{"url":"https://community.fantasyflightgames.com/topic/308169-the-ring-goes-south-the-council-of-elrond-1b/","title":"The Ring Goes South, The Council of Elrond, 1B","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308169-the-ring-goes-south-the-council-of-elrond-1b/?do=findComment&comment=3934546","commentId":3934546,"userName":"steve83","timestamp":1588630317,"content":"I've been playing The Ring Goes South from The Road Darkens, and wanted some clarification on the text on 1B [http://hallofbeorn.com/LotR/Details/The-Council-of-Elrond-RD?Lang=EN] (my emphasis):\n\n> Quote\n> \n> Forced: At the end of the planning phase, each player places the top card of his deck faceup in front of him, in player order, until there are a total of 4 faceup cards between the players. The first player chooses 1 faceup card to be played for 0 cost, 1 to add to its owner's hand, 1 to discard, and 1 to shuffle into its owner's deck. Then, either shuffle Lust for the Ring into the encounter deck, or raise each player's threat by 5. Advance to stage 2.\n\nI'm playing one-handed solo, and on one occassion I drew Galadriel as one of the four cards, and decided to play her for 0 cost. Galadriel's ability allows me to manipulate the player deck.\n\nMy question is, can I choose which order to carry out the tasks in bold above, or do I have to carry them out in order?\n\nIf I carry them out in order then that means I have to shuffle the deck after manipulating it, which somewhat negates the advantage of playing Galadriel here (other than possibly getting a free attachment from her ability).\n\nETA: It just occurred to me that Galadriel's ability might not even trigger here as technically she is not being played from my hand. But my original question re the order still stands.\n\nEdited May 4 by steve83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308169-the-ring-goes-south-the-council-of-elrond-1b/?do=findComment&comment=3934560","commentId":3934560,"userName":"GrandSpleen","timestamp":1588632406,"content":"As far as the order goes, I believe you could choose it. I suppose it's a grey area, when you follow rules you resolve 1 sentence at a time... In this case there could be an argument made for resolving each part of an \"and\" clause at a time in the order listed---- BUT I am not sure I've ever heard a ruling on that from a developer.\n\nCan you use Unlikely Friendship (gain 1 resource and draw 1 card) and choose the order in which you resolve those effects ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308169-the-ring-goes-south-the-council-of-elrond-1b/?do=findComment&comment=3934585","commentId":3934585,"userName":"steve83","timestamp":1588636506,"content":"Thanks. I just beat the scenario, and as luck would have it this issue didn't come up this time.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308169-the-ring-goes-south-the-council-of-elrond-1b/?do=findComment&comment=3935542","commentId":3935542,"userName":"NathanH","timestamp":1588790651,"content":"I'd take the four steps in the sentence and then resolve all the responses to the four steps afterwards. If the sentence was split into four different sentences I would resolve the first sentence, resolve all the responses to that sentence, then move on to the next sentence."}]}