{"url":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/","title":"The Land of Sorrow Play-through (There Be Spoilers)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3942986","commentId":3942986,"userName":"Preotet","timestamp":1590136559,"content":"I really enjoyed reading asgardianphil's trials and tribulations of his path through Ash Mountains and was inspired to do something similar myself. After failing miserably time after time I decided  I will instead focus on Land of Sorrow because 1) it's much easier 😄 and 2) to give potential readers a brief feel of the quest. So ... I've played this quest 5 times, now. Twice I've won, twice I've lost. Below is my 5th try.\n\n \n\nForth, the Three Hunters! (Gandalf, Tactics Eowyn, Spirit Glorfindel)\n\n51 cards deck, starting threat 25\n\nInitial draw: 2x Unexpected Courage, Dagger of Westernesse, Gondorian Shield, Golden Shield, A Test of Will\n\nMulligan: Feint, Shadowfax, Light of Valinor, Herugrim, Golden Belt, The Galadhrim's Greeting\n\n \n\nSetup: Add each Camp location to the staging area. Attach a random Captive objective-ally to each Camp location as a guarded objective. Place one random Warden enemy faceup (but not in play) under each Camp location. Shuffle the encounter deck and discard cards from the top until X locations are discarded, where X is 1 less than the number of players. Add each location discarded this way to the staging area.\n\n \n\n1B (15 QP)\n\nEach Camp location is immune to player card effects, and players cannot travel there while a Warden enemy is in play. \n\nForced: At the end of the round, raise each player's threat by 1 for each Camp location in the staging area.\n\n \n\nYou can't defeat this stage unless you control all three objective-allies.\n\n \n\nTurn 1\n\nRP: Draws Strider (reveals Snowmane)\n\nPP: Snowmane (from the top), Golden Belt, Strider on Eowyn (6 WP now), Light of Valinor on Glorfindel\n\nQP: Staging area: Slave Quarters (1), The Storehouse (1), The Barracks (1)\n\nEowyn and Glorfindel quest for 9 WP\n\nReveals Working Fields (3) - While Working Fields is in the staging area, characters cannot be healed. Travel: Each players deals 1 damage to a character he controls.\n\n9 WP vs 6 threat = 3 progress on main quest\n\nTP: I decided to travel to The Barracks (5 quest points, Forced: After The Barracks becomes the active location, add the enemy under it to the staging area. That enemy cannot take damage this round. Forced: When the Barracks is explored, the first player gains control of the objective ally it was guarding.) because the forced effect was not as harsh as the effects on the other two Camp locations. The enemy I added to staging area was Ulwarth (3 threat, 4A, 1D and 6H). The guarded captive underneath The Barracks was Silvan Endrahil with response After Edrahil quests successfully, choose a player to draw 1 card.\n\nEP: Decides not to engage Ulwarth (his engagement cost is 34). This made me sweat for a few rounds.\n\nRP: because of the forced effect on the quest card, threat raised by 3 (28)\n\n \n\nTurn 2\n\nRP: Draws Galadhrim's Greeting (reveals Wizard Pipe)\n\nPP: Wizard Pipe (from the top) on Gandalf\n\nQP: Staging Area: Slave Quarters (1), The Storehouse (1), Working Fields (3), Ulwarth (3)\n\nEowyn and Glorfindel quest for 9 WP\n\nReveals Watch Tower (X) - While Watch Tower is in the staging area, it gains archery X. X is 1 more than the number of Captive objective allies the player control. Travel: Reveal the top card of the encounter deck.\n\n9 WP vs 9 threat = 0 progress\n\nTP: ...\n\nEP+CP: 1 damage to Glorfindel because of Archery 1 on Watch Tower. Optionally engages Ulwarth to remove threat from the staging area and deals him a shadow card. Uses Wizard Pipe to put Feint on top of the deck and thwarts his attack. Hits him with Gandalf and Glorfindel and deals 5 damage. 1 short.\n\nRP: because of the forced effect on the quest card, raises threat by 3 (31)\n\n \n\nTurn 3\n\nRP: Draws Rivendell Blade (reveals Gondorian Shield)\n\nPP: Gondorian Shield on Gandalf from the top of the deck (4D now), reveals Gandalf's Staff, uses Wizard Pipe to put in hand and plays it on Gandalf. Glorfindel gets Rivendell Blade, Herugrim on Eowyn. Also plays Shadowfax on Gandalf.\n\nQP. Staging area: Slave Quarters (1), The Storehouse (1), Working Fields (3), Watch Tower (1)\n\nEowyn and Glorfindel quest for 9 WP\n\nReveals Warrior of Rhun (3)\n\n9 WP vs 9 threat = 0 progress (starting to sweat a bit more)\n\nEP: Engages Warrior of Rhun\n\nCP: 1 damage to Glorfindel because of Archery 1 on Watch Tower (2 damage now). Gandalf defends Ulwarth and uses Shadowfax to ready. Shadow: Defending character cannot ready this round. (Good thing I used Shadowfax before this, otherwise the other attack would go undefended.) 4A vs 4D = 0 damage. Gandalf defends Warrior of Rhun. Shadow: Attacking enemy gets +2 DS until the end of the round. 3A vs 4D = 0 damage. Glorfindel attacks Ulwarth for 3 agaist 1 defense. Ulwarth goes to the victory display.\n\nRP: raises threat by 3 (34)\n\n \n\nTurn 4\n\nRP: Draws Snowmane (reveals A Test of Will)\n\nPP: /\n\nQP. Staging Area:  Slave Quarters (1), The Storehouse (1), Working Fields (3), Watch Tower (1)\n\nEowyn and Glorfindel quest for 9 WP\n\nReveals treachery Weary Lands (Doomed 1. When Revealed: Each exhausted character gets -1 WP until the end of the phase.) Raises threat by 1 (35).\n\n8 WP vs 6 threat = Ewoyn readied because of Snowmane and 2 progress on The Barracks (Finally!)\n\nCP: 1 damage to Glorfindel because of Archery 1 on Watch Tower (3 damage so far).  Gandalf defends Warrior of Rhun and discards shadow with Staff. (It was Attach the top Easterling treachery in the discard pile to attacking enemy.) 3A vs 4D = 0 damage (So far, so good). Eowyn + Herugrim and Glorfindel + Rivendell Blade blast Warrior of Rhun to oblivion.\n\nRP: raises threat by 3 (38)\n\n \n\nTurn 5\n\nRP: Draws A Test of Will (reveals Round Shield)\n\nPP: Round Shield goes on Glorfindel (want to flip that contract). Action: Wizard Pipe to put A Test of Will on top of deck and get Foe-Hammer.\n\nQP. Staging Area: Slave Quarters (1), The Storehouse (1), Working Fields (3), Watch Tower (1)\n\nGandalf, Eowyn, and Glorfindel quest for 12 WP\n\nReveals treachery Painful Fatigue (When Revealed: Each players exhausts a character he controls and deals 1 damage to it.). Plays A Test of Will from the top of the deck (reveals Feint).\n\n12 WP vs 6 threat = Eowyn readies, The Barracks explored and 3 progress on main quest (6/15 progress). Gets objective ally Edrahil.\n\nTP: Watch Tower (Travel: Reveal the top card of the encounter deck.) Reveals treachery Recurve Bow (no target) which surges into Easterling Guard (3T, 4A, 2D, 5H; Archery 2. When Revealed: Assign X damage among characters in play. X is the current archery total.) Assigns 2 damage to Eowyn.\n\nEP: Engages Easterling Guard\n\nCP: Deals 2 damage to Gandalf because of Guard's Archery 2. Deals shadow card and plays Feint from the top of the deck (reveals Strider). Gandalf + Glorfindel smash Easterling Guard to pulp. Plays Foe-Hammer and exhausts Rivendell Blade. Draws Strider, Steward of Gondor, War Axe (reveals Wizard Pipe).\n\nRP: raises threat by 3 (41) and flips the contract\n\n \n\nTurn 6\n\nGandalf (2 damage, 5 WP), Eowyn (2 damage, 8 WP), Glorfindel (3 damage, 5 WP)\n\nRP: Draws Wizard Pipe (reveals Firefoot)\n\nPP: Wizard Pipe puts Steward of Gondor on top of the deck. Plays Steward of Gondor on Gandalf (reveals Dagger of Westernesse). He now has 5 defense. War Axe on Ewoyn (now 9 WP and 4 A). \n\nQP. Staging Area: Slave Quarters (1), The Storehouse (1), Working Fields (3)\n\nEowyn, Glorfindel and Edrahil quest for 17 WP\n\nReveals Warriors of the East side quest which surges into Rocky Outcrop (3) with the text while in the staging area, characters cannot be readied by player cards effects. Harsh!\n\n17 WP vs 8 threat = 9 progress (5 to clear Watch Tower, 4 on main quest (10/15)). Readies Eowyn and because of Edrahil's response draws Dagger of Westernesse (reveals Dunedain Warning). Gandalf's Staff then draws Dunedain Warning (reveals Wizard Pipe)\n\nTP: Travels to Working Fields and deals 1 damage to Gandalf (now 3) because of travel cost. Exhaust contract to heal 1 damage from each of the heroes (Gandalf 2, Eowyn 1, Glorfindel 2).\n\nRP: raises threat by 3 (44)\n\n \n\nTurn 7\n\nRP: Draws Wizard Pipe (reveals Song of Travel). Wizard Pipes Song of Travel with Galadhrim's Greeting (reveals Light of Valinor). Plays it and lowers threat to 38.\n\nPP: Song of Travel on Gandalf. Dagger of Westernesse on Glorfindel (now 6 WP). Plays Galadhrim's Greeting and lowers threat to 32. Heals heroes with contract (Gandalf 1, Eowyn 0, Glorfindel 1)\n\nQP: Staging Area: Slave Quarters (1), The Storehouse (1), Warriors of the East (side quest), Rocky Outcrop (3)\n\nEowyn, Glorfindel and Edrahil quest for 18 WP\n\nReveals Easterling Raider which triggers forced effect on Warriors of the East (After an Easterling enemy enters play, attach the top Easterling treachery in the discard pile to that enemy.) Attaches Recurve Bow (Archery 2) to Easterling Raider.\n\n18 WP vs 7 threat = 11 progress (3 on Working Fields, 8 on main quest (18/15)). Readies Eowyn, draws Light of Valinor (reveals Foe-Hammer)\n\nTP: Travels to Rocky Outcrop and exhausts Glorfindel because of travel cost. I couldn't afford not readying characters.\n\nEP: Engages Easterling Raider\n\nCP: 1 damage per hero because of Raider's Archery 3.  Defends with Gandalf for 5, no shadow, no damage. Plays Foe-Hammer from the top of the deck and exhausts Eowyn's Herugrim. Draws Firefoot, Gondorian Shield and Silver Lamp (reveals Rivendell Blade)\n\nRP: raises threat by 3 (35)\n\n \n\nTurn 8\n\nRP: Draws Rivendell Blade (reveals Golden Belt)\n\nPN:  Plays Golden Belt from the top of the deck and puts it on Glorfindel (reveals Dagger of Westernesse). Wizard Pipes Dagger of Westernesse with Snowmane. Puts Dagger of Westernesse on Glorfindel and discards Round Shield. Also puts Silver Lamp on Glorfindel. He now has 4 restricted attachments - that's 7 WP and 5 or 7 attack (depends on enemy's engagement cost) plus -4 defense on enemy.\n\nQP. Staging Area: Slave Quarters (1), The Storehouse (1), Warriors of the East (side quest)\n\nEowyn and Edrahil quest for 12 WP\n\nReveals Sword of Rhun (no target) which surges into Watch Tower (2) with Archery 2\n\n12 WP vs 4 threat = 8 progress (3 on Rocky Outcrops and 5 on main quest 23/15)). Readies Eowyn, draws Snowmane (reveals Unexpected Courage)\n\nTP: travels to Watch Tower. Travel cost: reveal an encounter card. Reveals Easterling Raider and attaches Sword of Rhun to it (because of forced effect on the side quest).\n\nEP: Engages Raider who has 5 attack because of the attachment and his ability.\n\nCP: 1 damage on Eowyn because of Raider's Archery 1. Defends with Gandalf, no shadow, no damage. Gandalf's Staff to put into hand UC (reveals another UC). Kills Raider with Glorfindel. Heals heroes with contract.\n\nRP: raises threat by 3 (38)\n\n \n\nTurn 9\n\nRP: Draws Unexpected Courage (reveals Will of the West)\n\nPP: 2x Unexpected Courage on Gandalf. Heals heroes with contract (zero damage on all of them). Wizard Pipes Will of the West with Firefoot. Plays Firefoot on Eowyn from top of the deck (she's now 10 WP and 6 attack).\n\nQP. Staging Area: Slave Quarters (1), The Storehouse (1), Warriors of the East (side quest)\n\nEowyn, Glorfindel and Edrahil quest for 20 WP on Warriors of the East\n\nReveals Watch Tower (2)\n\n20 WP vs 4 threat = 16 progress (5 on Watch Tower and 8 on Warriors of the East). Readies Eowyn, draws Herugrim (reveals Ancestral Armor)\n\nTP: Travels to Watch Tower (Travel: reveal an encounter card). Reveals Broken Captives (When Revealed: Exhaust each damaged character. If no characters are exhausted by this effect, Broken Captives gains surge and doomed 1.) which surges into Easterling Guard with Archery 2.  2 damage to Glorfindel because of the When Revealed on Guard.\n\nEP: Engages Guard.\n\nCP: 1 damage to Gandalf and Eowyn (Archery 2). Defends with Gandalf. No shadow, no damage. Kills Guard with Eowyn. Gandalf's Staff to draw Ancestral Armor.\n\nRP: Raised threat by 3 (42)\n\n \n\nTurn 10\n\nRP: Draws Quick Strike (reveals Light of Valinor). Heals heroes with the contract (Glorfindel 1 damage)\n\nPP: Wizard Pipes Light of Valinor with Ancestral Armor. Plays it on Gandalf who now has 6 WP and 7 defense.\n\nQP. Staging Area: Slave Quarters (1), The Storehouse (1)\n\nEowyn and Edrahil for 13 WP\n\nReveals Rolling Plains (4)\n\n12 WP vs 6 threat = 5 progress on Watch Tower and 2 on main quest (25/15). readies Eowyn, draws Gandalf's Staff.\n\nTP: Finally travels to next camp location. The Storehouse (When it becomes the active location, add the enemy under it to the staging area. That enemy gets +3 attack and -30 engagement cost until the end of the round.) The enemy under it was Lorgan (1T, 5A, 3D, 8H) with annoying forced effect: After Logan attacks, raise each player's threat by 1 (2 instead if this attack destroyed a character)\n\nEP: Lorgan engages.\n\nCP: Deal shadow card to Lorgan. Gandalf's Staff to draw Galadhrim's Greeting (reveals Silver Lamp). Gandalf defends, no shadow, no damage. Eowyn kills him immediately (16 attack).\n\nRP: raises threat by 2 (44)\n\n \n\nTurn 11\n\nRP: Draws Silver Lamp (reveals Quick Strike). Wizard Pipes Quick Strike with Galadhrim's Greeting and plays it. Lowers threat by 6 (38).\n\nPP: Plays Silver Lamp on Gandalf.\n\nQP. Staging Area: Slave Quarters (1), Rolling Plains (2)\n\nEowyn and Edrahil quest for 13 WP\n\nReveals: Recurve Bow (no target) which surges into Easterling Raider (2) with Archery 1\n\n13 WP vs 5 threat = 4 progress on Storehouse and 4 on main quest (29/15), readies Eowyn, draws Steward of Gondor. Gains objective ally Farin (1 WP, 3 A, 0 D, 4 H) with response: After Farin is declared as an attacker against an enemy, deal 1 damage to an enemy engaged with a player.\n\nTP: Travels to Slave Quarters (Forced: After Slaver Quarters becomes the active location, the enemy under it engages the first player and makes an immediate attack.) Enemy under it is Borlach (2T, 6A, 2D, 9H) with forced effect: After Borlach attacks and destroys a character, any excess damage must be assigned among characters you control. Defends with Gandalf, no shadow, no damage.\n\nEP: Engages Borlach and Easterling Raider\n\nCP: Archery 1. Deals shadows and heals with the contract. Defends with Gandalf, both shadows whiff, so no damage. With Staff draws Shadowfax and reveals A Test of Will. Eowyn kills both attackers with the help of Firefoot.\n\nRP: Raises threat by 1 (39)\n\n \n\nTurn 12\n\nRP: Draws A Test of Will (reveals UC)\n\nPP: Plays UC from the top of the deck (reveals the last card in the deck, A Test of Will)\n\nQP. Staging Area: Rolling Plains (2)\n\nEowyn and Edrahil quest for 13 WP\n\nReveals treachery Cruelty of Mordor (When Revealed: Each player deals 1 damage to a character he controls. Then, each player must choose: either deal 1 damage to each damaged character you control, or raise your threat by 1 for each damaged character you control.) Damages Glorfindel and raises threat by 1 (40).\n\n13 WP vs 2 = 11 progress (3 progress on Slave Quarters). Readies Eowyn, draws A Test of Will, gains under control captive Arador (0 WP, 1 A, 3 D, 5 H) with response: After Arador is declared as a defender, ready him. (Limit once per round.) Progresses to the next stage.\n\n2A. When Revealed: The first player returns each Warden enemy in the victory display to the staging area. Each other player discards cards from the top of the encounter deck until he discards an enemy and adds that enemy to the staging area.\n\n2B. This stage gets +10 quest points per player. Forced: After a player commits characters to the quest, if he is not engaged with a Warden enemy he must reveal an encounter card. (In order to win, you must defeat all Warden enemies.)\n\nPuts in the staging area Borlach (2T, 6A, 2D, 9H), Lorgan (1T, 5A, 3D, 8H), and Ulwarth (3T, 4A, 1D, 6H).\n\nTP: Travels to Rolling Plains and raises threat by 2 (42)\n\nEP: Due to high threat all Wardens engage.\n\nCP: Lorgan attacks for 8 because of shadow. (It's Nurn Slaver with Shadow: Attacking enemy gets +1 attack for each Camp location in the victory display.) 8A vs 7D. Gandalf = 1 damage. Because of Lorgan forced ability, I raise threat by 1 (43). Ulwarth attacks for 7 (same shadow), and Borlach for 6 (no shadows). Gandalf = 0 damage. Eowyn attacks for 16 and destroys Lorgan. Glorfindel and captive Farin attack for 8 and destroy Ulwarth. Gandalf and captive Arador attack Borlach for 4 and deal 2 damage. Heals heroes with the contract.\n\nRP: Raises his threat by 1 (44). Plays Will of the West.\n\n \n\nTurn 13\n\nRP: Draws Gladhrim's Greeting (reveals Feint). Wizard Pipes Feint with Galadhrim's Greeting in hand, plays it and lowers threat by 6 (38). Reveals Galadhrim's Greeting.\n\nPP: Plays Galadhrim's Greeting from the top of the deck and lowers threat by 6 (32).\n\nQP: Zero in the staging area. Main quest has 20 QP. Active location Rolling Hills with 4 QP.  It's possible. 😄\n\nGandalf, Eowyn, Glorfindel and Edrahil quest for 26 WP.\n\nReveals Nurn Slaver (2) (While the number of Camp locations in the staging area is less than the number of players, Nurn Slaver gains surge.) surges into Working Fields (3).\n\n26 WP vs 5 threat = 21 progress (4 on Rolling Hills, 17 on main quest). So close! Eowyn readies, draws Foe-Hammer.\n\nTP: Travels to Working Fields (Each player deals 1 damage to a character he controls.)\n\nEP: Engages Nurn Slaver.\n\nCP: Borlach attacks for 6 (shadow: Deal 1 damage to the defending character). Gandalf = 1 damage. Nurn Slaver attacks for 6 cos of shadow (Attacking enemy gets +1 attack for each Camp locations in the victory display.) Gandalf = 0 damage. Eowyn destroys them both, thanks to Firefoot.\n\nRP: Raises threat by 1 (33).\n\n \n\nTurn 14\n\nRP: Draws Round Shield  (reveals Quick Strike)\n\nPP: /\n\nQP: Staging Area 0 threat. Active Location = Working Fields\n\nEowyn, Glorfindel and Edrahil quest for 20 WP.\n\nI'm not engaged with a Warden enemy so I must reveal a card which is Working Fields (3). Reveals Cruelty of Mordor (Each player deals 1 damage to a character he controls. Then, each player must choose: either deal 1 damage to each damaged character you control, or raise your threat by 1 for each damaged character you control.) A Test of Will.\n\n20 WP vs 3 threat = 17 progress (4 on active location and 13 on main quest - 30/20) WINS THE GAME! 😄\n\nEdited May 25 by Preotet"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3942997","commentId":3942997,"userName":"Alonewolf87","timestamp":1590140352,"content":"Cool game. Just a question how many times did you play The Galadhrim's Greeting? I counted like five..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3942998","commentId":3942998,"userName":"Preotet","timestamp":1590140489,"content":"Yep. Five times. I packed Will of the West."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3942999","commentId":3942999,"userName":"Alonewolf87","timestamp":1590140769,"content":"> 4 minutes ago, Preotet said:\n> \n> Yep. Five times. I packed Will of the West.\n\nAnd they were apparentely all needed since you ended up at 33 threat still. Seems like a quest where you need to pack A LOT of threat management."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943001","commentId":3943001,"userName":"Preotet","timestamp":1590140968,"content":"Yes. Camp locations raise your threat in addition to normal raise. But you can't clear them every turn because 1) of other pesky locations and 2) you must first remove Warden enemy before you can travel to the next Camp location.\n\nEdited May 22 by Preotet"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943108","commentId":3943108,"userName":"Felswrath","timestamp":1590161248,"content":"Was it just me, or were you not raising your threat by 1 at the beginning of the refresh phase?\n\nThank You, though, I love hearing other players' games!\n\nEdited May 22 by Felswrath"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943114","commentId":3943114,"userName":"Preotet","timestamp":1590161932,"content":"I think I did correctly. 1 normal + 2 for the Camp locations in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943129","commentId":3943129,"userName":"MikeGracey","timestamp":1590163439,"content":"Nicely done Preotet! Thats a powerful deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943132","commentId":3943132,"userName":"Preotet","timestamp":1590163896,"content":"Thanks, Mike. 😃 Now, if only Ash Mountains would be so accommodating, he."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943135","commentId":3943135,"userName":"MikeGracey","timestamp":1590164140,"content":"> 2 minutes ago, Preotet said:\n> \n> Thanks, Mike. 😃 Now, if only Ash Mountains would be so accommodating, he.\n\nIm surprised that Ash Mountains seems harder because the difficultly rating on Land of Sorrow I thought was 9? I am aware that the difficulty ratings usually don't mean much, but still, a rating of 9 must be hard. Or was it Ash Mountains with a 9?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943139","commentId":3943139,"userName":"Preotet","timestamp":1590164728,"content":"Ash Mountains is rated 7, Sorrow 9 and Nurn 10. Maybe it's one of those things that difficulty depends on a number of players. For solo, Sorrow is for sure easier of the three."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3943144","commentId":3943144,"userName":"asgardianphil","timestamp":1590165322,"content":"Great write up mate. It always feels great to win. \n\nAnd writing it out helps you hone and focus. The community course correct you for errors or strategies.  \n\n> 6 hours ago, Preotet said:\n> \n> Yep. Five times. I packed Will of the West.\n\nAh, Will of The West. How I've missed you my old friend. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3944115","commentId":3944115,"userName":"asgardianphil","timestamp":1590398494,"content":"Heads up.\n\nI've just ordered Land of Sorrow from Boargameextras Webstore.  They are showing as in stock. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3944118","commentId":3944118,"userName":"asgardianphil","timestamp":1590398732,"content":"Sorry, just re checked... it's listed as preorder. Sorry. Got really excited. I've still paid for it so fingers crossed. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=3944121","commentId":3944121,"userName":"Preotet","timestamp":1590399215,"content":"Yeah, I hope you get it as soon as possible. At this moment in time, I think it's the best quest in the cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308583-the-land-of-sorrow-play-through-there-be-spoilers/?do=findComment&comment=4011573","commentId":4011573,"userName":"Alonewolf87","timestamp":1604762906,"content":"We just finished playing against The Land of Sorrow, it was a brutal quest but we were still able to win it at the first attempt (despite some terrible luck during the first quest phase).\n\nThis quest surely likes to pile up damage on you, I am sure that if we didn't have a dedicated healing deck (basically a Lore deck with Elrond and all the possible healing effects) we would not have gone past it. MVP was Dunedain Remedy, one turn saw it heal like 30 damage between all 4 decks).\n\nHard but satisfying quest, less punishing than Under the Ash Mountains since it's more traditional in the difficulties you have to overcome. We were constantly at the edge of defeat but prevailed with a good strategy and a little luck. Dang if they are annoying those Wardens.\n\nNow onto Escape from Khazad-Dum before we have to change our decks for The Fortress of Nurn.\n\nEdited November 7 by Alonewolf87"}]}