{"url":"https://community.fantasyflightgames.com/topic/308501-the-digital-game/","title":"The Digital Game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308501-the-digital-game/?do=findComment&comment=3941248","commentId":3941248,"userName":"Vince79","timestamp":1589845187,"content":"Is there a forum or a thread on the digital version of LOTR LCG?  I think it's called Lord of the Rings Adventure Card Game or something like that.  I was wanting to read what people were saying about it.  I may end up getting it someday since it's relatively inexpensive.  I understand it's a simplified, stripped down version of the LCG.  And I think I've heard it's no longer being supported?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308501-the-digital-game/?do=findComment&comment=3942413","commentId":3942413,"userName":"gokubb","timestamp":1590070695,"content":"Not sure if there is a thread. If you’re a fan of the LCG, I’d pass on it. I find the stripping down of mechanics to be annoying. I wish they would have just designed a different game entirely than try to keep it half the same and half new. It’s also pretty easy if you know how to manage threat and generate action advantage. The Sauron deck actually plays cards against you, but unfortunately the AI is not adaptable and often makes dumb mistakes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308501-the-digital-game/?do=findComment&comment=3942424","commentId":3942424,"userName":"Kjeld","timestamp":1590071433,"content":"It's not a bad game, and I quite enjoyed playing through it. Not for everyone, but also not a bad game. That said, you should understand two things before you buy: (1) it is not, as gokubb pointed out, a clone of the tabletop -- in fact, it plays like a whole different game; (2) it is no longer being supported since FFI dissolved, so there won't be new content and bugs probably won't get fixed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308501-the-digital-game/?do=findComment&comment=3942519","commentId":3942519,"userName":"Vince79","timestamp":1590081036,"content":"> 2 hours ago, Kjeld said:\n> \n> It's not a bad game, and I quite enjoyed playing through it. Not for everyone, but also not a bad game. That said, you should understand two things before you buy: (1) it is not, as gokubb pointed out, a clone of the tabletop -- in fact, it plays like a whole different game; (2) it is no longer being supported since FFI dissolved, so there won't be new content and bugs probably won't get fixed.\n\nYeah, I thought it might be nice as a casual game to play through.  I like the LCG, but sometimes it feels like a lot of work, because a lot of the scenarios are pretty challenging.  That can be good in itself, but sometimes I'm in the mood for something lighter.  And it's Tolkien-based, and like I said before, it doesn't cost that much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308501-the-digital-game/?do=findComment&comment=3942711","commentId":3942711,"userName":"Kjeld","timestamp":1590094634,"content":"Then I'd say go for it. The games are generally a good deal quicker, and you don't need to take care of a bunch of (finicky) mechanics, which can sometimes bog down the LCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308501-the-digital-game/?do=findComment&comment=3942872","commentId":3942872,"userName":"Vince79","timestamp":1590107867,"content":"> 3 hours ago, Kjeld said:\n> \n> Then I'd say go for it. The games are generally a good deal quicker, and you don't need to take care of a bunch of (finicky) mechanics, which can sometimes bog down the LCG.\n\nIt's not on my short list, but I expect I'll get it eventually.  I just thought it was odd that it was almost never discussed.  And I'm definitely not a fan of fiddly mechanics.  I'm almost through the Ring-Maker Cycle, and although the storyline is good, I can't wait to put the Time mechanics behind me (I hope).\n\nBy the way, I don't plan on abandoning the LCG.  I just like something lighter now and then. Sometimes the LCG feels like banging my head against a wall.  I'll have what I know is a good questing deck, then I'll go to the next scenario only to find out \"Hey, you need a better questing deck.  And one that defends really, really well, and has high attack\".  Rinse and repeat."}]}