{"url":"https://community.fantasyflightgames.com/topic/308675-help-for-new-players-questing-vs-combat-strategy/","title":"Help for new players: questing vs. combat strategy","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308675-help-for-new-players-questing-vs-combat-strategy/?do=findComment&comment=3944210","commentId":3944210,"userName":"wareagle77","timestamp":1590420373,"content":"Help! My wife and I recently started playing, and I just found out that questing is mandatory. We had assumed that we could say we're not questing (and thus not increase threat by the difference) that round to concentrate on combat, but that turns out not to be the case. We have been banging our heads against the MEDIUM difficulty quest in the Moria expansion--in particular the difficulty of having enough combat power to even be able to attack--it seems like every turn, even if we don't exhaust anyone on questing, all our characters are exhausted in defense and the enemies just sit there unengaged and bleeding us. If we have to quest AND fight every turn...how is that even possible? Very frustrated.\n\nIs there something we are missing rule-wise? Are we doing something wrong in terms of broad strategy? Or is this really a deck-building question? We've got one leadership/lore deck and one tactics/spirit deck. (I put them together with my very limited knowledge. Very roughly, each has something like 20 allies, 15 events, 10 attachments, plus or minus a few in each category.) We've been playing Aragorn/Gloin/Bifur and Eowyn/Thalin/Gimli or Legolas.\n\nKnowing now that we must quest every turn, it just seems impossible to have enough character resources to make any headway. Like I said, we're very frustrated. Help!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308675-help-for-new-players-questing-vs-combat-strategy/?do=findComment&comment=3951215","commentId":3951215,"userName":"Boromore","timestamp":1592033945,"content":"Hi. Sorry if no one has responded sooner. Yes, you need to balance the three core activities with your characters - questing, defending and attacking. Spirit is the best sphere for questing - for example, Eowyn from the core set will quest for 4 willpower minimum, and you have only committed one hero. Get out some Spirit or Lore allies, and add to that. Also, hero reuse is another key concept. Glorfindel with Light of Valinor will quest for 3, and still be ready. Dain boosts Dwarf decks fantastically. Without knowing which cards you have, I can't be more specific, but I hope these pointers help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308675-help-for-new-players-questing-vs-combat-strategy/?do=findComment&comment=3951216","commentId":3951216,"userName":"Boromore","timestamp":1592034270,"content":"Oh, and rereading your post -  normal enemies you haven't engaged don't attack you. Unless it is a special case, combat is only with engaged enemies ( who no longer contribute their threat in the Quest phase)."}]}