{"url":"https://community.fantasyflightgames.com/topic/309695-beorn-completes-first-nm-cycle-on-votp/","title":"Beorn completes first NM cycle on VotP","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/309695-beorn-completes-first-nm-cycle-on-votp/?do=findComment&comment=3960655","commentId":3960655,"userName":"Durins_Father","timestamp":1594461574,"content":"Greetings all, hope you are doing well during these difficult times.\n\nI just published the final article covering a nightmare scenario from the Shadows of Mirkwood cycle. However, I could have though of no-one better to write the analysis of Conflict at the Carrock than the big bear Beorn himself! He has given the article a more narrative spin than the regular analyses, which is really enjoyable to read through. The article can be read here: https://visionofthepalantir.com/2020/07/11/nightmare-conflict-at-the-carrock/ [https://visionofthepalantir.com/2020/07/11/nightmare-conflict-at-the-carrock/]\n\nFor those of you that don't know who Beorn (the community member) is, he is one of the oldest creators for this game and hosts the best card search engine for the game in his hall. But Beorn also has his own blog that has years worth of content to discover, including a ton of decks with alternative art that you can request the files from. See his blog here: https://hallofbeorn.wordpress.com/ [https://hallofbeorn.wordpress.com/]\n\nThis article concludes the entire first cycle of Nightmare scenarios. Vision of the Palantir will try to continue the analysis of other Nightmare content, but my lack of NM packs in the collection makes this a little tricky. Since I do not own any Dwarrowdelf NM packs, and only own a handful of other NM packs outside this first cycle, the NM scenario analyses won't be done in chronological order from here on out. I will try and complete cycles as I collect more NM packs, but there is no telling in how long that is going to take. If there are people out there that would like to assist in filling the gaps with articles of their own, send me a message and we can discuss details. The entire first cycle can now be found here: https://visionofthepalantir.com/shadows-of-mirkwood/ [https://visionofthepalantir.com/shadows-of-mirkwood/]\n\n "}]}