{"url":"https://community.fantasyflightgames.com/topic/309984-are-attachment-effects-optional-or-mandatory/","title":"Are attachment effects optional or mandatory?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/309984-are-attachment-effects-optional-or-mandatory/?do=findComment&comment=3964775","commentId":3964775,"userName":"steve83","timestamp":1595663572,"content":"I'm playing through Lost in Mirkwood with a Dale deck I built where there is a treachery card that punishes you for having resources (you have to discard them all then raise your threat by the number discarded).\n\nI was using Necklace of Girion for resource generation (and willpower boost):\n\n> Quote\n> \n> Guarded (enemy or location).\n> \n> Attach to a hero.\n> \n> Attached hero gets +2[willpower] and collects an additional resource during the resource phase.\n\nCan the ability of Necklace of Girion be ignored if I decide I have too many resources or is it mandatory?  (Steward of Gondor has to be exhausted to generate resources, so you can effectively turn it off if you start accumulating too many.)  And if I can, will I also lose the willpower boost?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/309984-are-attachment-effects-optional-or-mandatory/?do=findComment&comment=3964778","commentId":3964778,"userName":"dalestephenson","timestamp":1595664687,"content":"Looks like a passive effect that can't be turned off."},{"commentUrl":"https://community.fantasyflightgames.com/topic/309984-are-attachment-effects-optional-or-mandatory/?do=findComment&comment=3964786","commentId":3964786,"userName":"steve83","timestamp":1595669773,"content":"Thanks. I thought as much.\n\nRather than switching to Steward of Gondor, I think my best bet is to just ditch resource generation altogether, and rely on King of Dale [https://ringsdb.com/card/18008] and playing a bunch of cheap, non-restricted attachments on the hero I attached it to, so as to get a discount on the first Dale ally I play each round (likely free). The rest of the resources can be used for buying other cards.\n\nI guess they had King of Dale in mind when they designed this particular scenario."}]}