{"url":"https://community.fantasyflightgames.com/topic/310152-mines-of-moria-and-escape-from-khazad-pre-order/","title":"Mines of Moria and escape from khazad pre order","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/310152-mines-of-moria-and-escape-from-khazad-pre-order/?do=findComment&comment=3968232","commentId":3968232,"userName":"player4036351","timestamp":1596248397,"content":"Has everyone gotten their pre  order bonus? I did not. I contacted customer support and received an un acceptable answer of too bad... the warehouses only have so many pound sand...\n\nEdited August 1 by player4036351"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310152-mines-of-moria-and-escape-from-khazad-pre-order/?do=findComment&comment=3969618","commentId":3969618,"userName":"player3351457","timestamp":1596493274,"content":"Are you talking about the art work cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310152-mines-of-moria-and-escape-from-khazad-pre-order/?do=findComment&comment=3972142","commentId":3972142,"userName":"Catastrophic09","timestamp":1596922119,"content":"Same. I pre ordered in late May and didn't receive any of the pre order cards. Upon asking they said they were limited and only made so many.. More reasons to be annoyed with Asmodee. It's listed as pre order bonus and nothing says they are limited and you should get them as long as you pre order and not last minute. It's pretty easy to say the pre order bonus is only good up to a certain date and then count your total pre orders and print that many bonus cards rather than promising every pre order the bonus and then many of us not getting them. Very annoying and nothing to do but complain here haha or pre order immediately for future products but that doesn't support your FLGS which is why the whole pre order exclusive cards are a terrible idea in the first place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310152-mines-of-moria-and-escape-from-khazad-pre-order/?do=findComment&comment=3972788","commentId":3972788,"userName":"bdavis969","timestamp":1597107797,"content":"Was there supposed to be a pre-order bonus of art cards for The Mines of Moria and Escape From Khazad-dum pre-order? Apparently that information isn't available in order history, and I don't recall seeing a pre-order bonus. If there was supposed to be a pre-order bonus (beyond free shipping), then I guess I didn't receive it either. I have been getting the pre-order bonus full art cards for each of the Vengeance of Mordor Cycle pre-orders.\n\nWas there pre-order bonuses for any of the cycles before Vengeance of Mordor? I didn't start pre-ordering until Vengeance of Mordor. In my area (Reno, NV), all the remaining FLGS only seem to focus on Magic:The Gathering, so I prefer not to walk into those stores. Back in 2013/2014, I tried using a FLGS to order my stuff, but after it went out of business, I just decided to start using eBay and Amazon to get my collection caught up. The pre-order bonus (and free shipping) is actually what enticed me to order from FFG/Asmodee."}]}