{"url":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/","title":"Mystery solved?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972049","commentId":3972049,"userName":"Lecitadin","timestamp":1596901124,"content":"So... after all these years, the card Th End Comes' mystery has never been solved...\n\nhttps://ringsdb.com/card/04037 [https://ringsdb.com/card/04037]\n\nI guess we'll never know.\n\n04037.png [//content.invisioncic.com/Mfantflight/monthly_2020_08/04037.png.1269b3a3c862596da68566ab2c2c062f.png] [//content.invisioncic.com/Mfantflight/monthly_2020_08/04037.png.1269b3a3c862596da68566ab2c2c062f.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972334","commentId":3972334,"userName":"MikeGracey","timestamp":1596995569,"content":"It was a mistake, not a mystery. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972337","commentId":3972337,"userName":"Halberto","timestamp":1596997023,"content":"Most probably a printing mistake...\n\nWould not be so bad if it shuffled your discard pile. \n\nCan be used in one of those quest with ghost enemies popping up and putting into play all other copies in the encounter discard pile. But even so..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972339","commentId":3972339,"userName":"Kjeld","timestamp":1596997357,"content":"If it let you shuffle your own discard pile into your deck, then it would be useful for Dwarf mining decks -- an alternative to Will of the West. Would have to add \"Victory 0\" to it to avoid infinite recursion.\n\nChanging it completely, it would be kind of cool twist if it instead let you \"mine\" the encounter deck in some way. Not sure exactly how it would work, but I can imagine it could be a helpful tool for encounter control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972353","commentId":3972353,"userName":"Catastrophic09","timestamp":1597001930,"content":"> 1 hour ago, Kjeld said:\n> \n> If it let you shuffle your own discard pile into your deck, then it would be useful for Dwarf mining decks -- an alternative to Will of the West. Would have to add \"Victory 0\" to it to avoid infinite recursion.\n> \n> Changing it completely, it would be kind of cool twist if it instead let you \"mine\" the encounter deck in some way. Not sure exactly how it would work, but I can imagine it could be a helpful tool for encounter control.\n\nWow yes this card would be perfect and fitting if it was instead shuffle your discard pile into your deck! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972364","commentId":3972364,"userName":"afteryule","timestamp":1597004923,"content":"My best guess is that this card was designed to counter some of the issues of early scenarios where you had to find specific cards in the encounter deck. For example, Athelas in Journey to Rhosgobel or Gollum in The Dead Marshes. If these cards end up in the encounter discard pile, it could take a long time to find them again.\n\nI'm not saying that The End Comes is any good but perhaps the early designers thought there would be more scenarios where you relied on getting certain Objectives in play from the encounter deck. However, the design of the scenarios changed later instead (for the better) where these cards typically had the text to be put into play if discarded. This was one of the changes made in Nightmare Rhosgobel. That is far less frustrating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972432","commentId":3972432,"userName":"player3351457","timestamp":1597033362,"content":"I fixed it with the addition of a single player card:\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972541","commentId":3972541,"userName":"EBerling","timestamp":1597071552,"content":"> 18 hours ago, afteryule said:\n> \n> My best guess is that this card was designed to counter some of the issues of early scenarios where you had to find specific cards in the encounter deck. For example, Athelas in Journey to Rhosgobel or Gollum in The Dead Marshes. If these cards end up in the encounter discard pile, it could take a long time to find them again.\n> \n> I'm not saying that The End Comes is any good but perhaps the early designers thought there would be more scenarios where you relied on getting certain Objectives in play from the encounter deck. However, the design of the scenarios changed later instead (for the better) where these cards typically had the text to be put into play if discarded. This was one of the changes made in Nightmare Rhosgobel. That is far less frustrating.\n\n\n\nVery much this.  The card has several potential uses, but those uses are quest-dependent and the cost awkward enough that this card never justifies inclusion as one of a deck's 50 cards.  It's also a card that has only gotten worse with age and will continue to get worse should more cards ever release.  First, because the designers got better at designing quests so some of the uses of TEC are no longer needed (returning Gollum to the encounter deck, for instance) AND the more player card choices that players have, the less and less justifiable including something like The End Comes will be.\n\nThis card, like Brok Ironfist, is just a generally bad card by today's standards, especially since the card pool is so much larger than when these debuted.  They were bad upon release, but now there are so many other things you can run instead.  And, while unfortunate, that's okay, because the vast majority of cards in this game still have uses in at least some deck archetypes, and that's impressive for a game as old and large as LotR:LCG.  And it's doubly okay because Dwarves have far more cards than any other \"faction\" archetype, so having these two duds isn't that painful for thematic Dwarf decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3972586","commentId":3972586,"userName":"NathanH","timestamp":1597077195,"content":"If it didn't have that really restrictive requirement, this would be borderline playable in some cases, such as against quests with the Cursed Dead encounter set. When Dead Lord is about to engage you, it is effectively \"defeat a very specific enemy\" for 0 cost, which isn't at all bad.\n\nSo I guess this is a niche use case: hold The End Comes and Bofur until Dead Lord is revealed, drop Bofur in for 1 cost during quest resolution, play End Comes when he leaves. Effectively is a 1-cost card to defeat a specific enemy and get +2 willpower for one turn. That is OK.\n\nEdited August 10 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3973420","commentId":3973420,"userName":"Ywingscum","timestamp":1597242764,"content":"It’s also good against Easterling attachments "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3973541","commentId":3973541,"userName":"Halberto","timestamp":1597257887,"content":"If the End comes is considered by any means to be a somehow playable card then really the end (for this game) came....\n\nJoke aside, it is not as a bad card as broke ironfist,  not even close...\n\nBut the designer could release one last errate to make it better, like they did with raven of the misty mountain (not good even with the errata, but not anymore unplayable by default)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3973924","commentId":3973924,"userName":"EBerling","timestamp":1597334825,"content":"> 21 hours ago, Halberto said:\n> \n> Joke aside, it is not as a bad card as broke ironfist,  not even close...\n\n\n\nWhoa now, even Brok Ironfist has his very fringe uses.  For instance, I've been using him lately in a BoF Dwarf deck, the idea being that you start with Bombur as your Lore Hero to begin with 5 Dwarves, then after you've built up a little you can use Helm of Secrecy to turn Bombur into a more useful hero (at which point you can also play Brok for free, since Bombur is leaving play).  He's also fringe-useful in a Gray Wanderer deck designed around exploiting Timely Aid + A Very Good Tale.  Either card can put Brok into play for free, and when he tells a very good tale his 6 Cost is actually a boon (e.g. Brok + any 4 cost ally would let you grab two 5 Cost allies during Tale-Tellin', or Brok + 2 Cost ally = 4+4 cost allies).  In both types of decks,  you generate enough resources that you can also just bite the bullet and play Brok for his 6 cost if you really need his body on the table stat.\n\nHe's still a bad card, don't get me wrong, but I'd say he's probably got a comparable set of fringe-uses to The End Comes.\n\nEdited August 13 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3974026","commentId":3974026,"userName":"Halberto","timestamp":1597343137,"content":"I'm not bought to old \"I'm just a proxy' broke being any good. You can substitute him with better expansive allies  if your aim is to cheat him into play to  exploit his cost to fuel a very good tale.\n\nBeorn cost 6, IS actually good, and nowadays can ve cheated into play in easiest ways. Any harad ally, ally gildor or ally glorfindel. \n\n \n\nReally, I think you can always  build a better deck switching broke with another card.\n\nBut i have nor person hatred for him and if other players find ways to use him somehow I'm very happy as i love this game so much that i dislike thinking to any card as bad. Yes, even broke. Or Spirit Pippin, god be compassionate and forgive the designers for THAT."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310357-mystery-solved/?do=findComment&comment=3974921","commentId":3974921,"userName":"MikeGracey","timestamp":1597535107,"content":"Im with Eberling on Brok, and I plan to use him in a BoF deck as well for when I swap Bombur for Ori. Its actually a pretty good combo. But no good combos exist with the end comes, which is a worse card. "}]}