{"url":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/","title":"To strengthen the Outlands","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3972688","commentId":3972688,"userName":"Flrbb","timestamp":1597089923,"content":"As I cannot add (more) images here follow this link [https://www.skillen.de/to-strengthen-the-outlands/] to see this text but with nice images for the cards I came up with. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Also, note the final question here, at the end of this post!\n\nWith the recent cycle many traits got buffed. A very old trait got no love. The Outlands. One could argue that with the current meta that trait does not need to be strengthened more. Partways, I have to disagree. While using them in a mixed deck (like my Drinking Outlands [https://www.skillen.de/drinking-outlands/] deck) they are strong, if not to say overpowered and very easy to play at the same time, but not in a somewhat all purple deck. Even within the original cycle where they appeared first was Lord of Morthond, a card that was ment to fix a downside (card draw) of a pure purple Outlands deck, but at no time of the game that card was somewhat powerfull. So, in conclusion, Lord of Morthond never had its place in an Outlands deck.\n\nThis beeing said, I think that playing all purple Outlands today would result in a weak deck and could use some buffs to be on par with todays meta. I had the idea to explore the Outlands trait a bit and design cards to strengthen them, but especially with all-purple-heroes in mind.\n\nI neither want to create overpowered cards nor want to mix up the overall meta of the game. In conclusion, the designed cards have to be balanced and have to be tailored down to be usefull in an all-purple-Outlands deck, but have to have almost no use in any other deck. These cards should minimise the drawbacks of a said all-purple-Outlands deck. Obvious downsides which sprung to my mind are card draw, healing, cancelation and location contol.\n\nThere are 8 different outlandish cards for a deck in the game. 4 Allies (Forlong (unique), those 4 outlands everyone thinks of when talking about Outlands and Hunter of Lamedon). 3 Attachments (Lord of Morthond, Prince of Dol Amroth and Sword of Morthond). 1 Event (Men of the West). That summs up to 24 cards, if each of those is in the deck 3 times. And there are allready some good cards which would fit also in an all-purple Outlands deck: Sneak Attack, Gandalf, Valiant Sacrifice, A Very Good Tale, A Good Harvest, Strength of Arms, Reinforcements and maybe even Armored Destrier or The Storm Comes and of course the all-to-go Steward of Gondor. (Probably I should also name Gaining Strength and Captain’s Wisdom here.) Therefore I do not have to design like 9 other Outlands cards, which is nice.\n\nFirst, a thought on heroes. Currently there are Hirluin, Ally Forlong (with MotK) and Prince Imrahil (with his attachment Prince of Dol Amroth). This would allready be a set of three purple Outlands heroes, but I want to do something new. My idea is to keep the starting threat at a mid- but reasonable level. Imrahil and Hirluin do not have an up-to-date willpower (in spite of Leadership sphere) and I think a sentinel defender (as a counterpart to hirluin might be interesting), also currently Hirlin suffers from not having any special way for resource acceleration. Golasgil is what I came up with.\n\nHero (leadership): Golasgil, 10 threat, 2 willpower, 0 attack, 3 defense and 5 hit points. Text: Sentinel. Chose a Gondor. Noble. hero you control and exhaust Golasgil to move all resources from chosen hero to an Outlands hero you control.\n\nOn Vision of the Palantir is an old article [https://visionofthepalantir.com/2018/03/28/outlands/], which features 3 self-made Outland allies. Besides that Angbor now has its own, official card in the game (with which I do not want to interfere), these unique allies would be a target for MotK, so I do not want to create such unique Outlands.\n\nI want to strengthen Lord of Morthond, so I need to design off-sphere allies. As those will also gain the usual boni it would be way to overpowered, if these bring boni to outlands, too. Even when they stay in the game (like the unique allies from Vision of the Palantir) it would result in way to much questing power and so on. Mostly with (purple) Prince Imrahil and Sneak Attack in mind I borrowed that „at the end of the round, discard from play“ from core Gandalf. The following cards are what I came up with.\n\nAlly (spirit): Scout of Blackroot Vale, 1 cost, 0/0/0/1 with the text: At the end of the round, discard from play. Response: Discard to cancel the \"when revealed\" effects of a card that was just revealed from the encounter deck.\n\nAlly (tactics): Westmarch Explorer, 1 cost, 0/0/0/1 with the text: At the end of the round, discard from play. Response: After Westmarch Explorer participates in an attack that destroys an enemy, place X progress tokens on an non-unique location worth no victory points, where X is W.E. attack value.\n\nAlly (lore): Mornan Recruiter, 2 cost 1/1/1/2 with the text: Ranged. At the end of the round, discard from play. Response: When engaging an enemy, exhaust to draw X cards. X are its hit points.\n\nThese 3 allies cover cancellation, card draw and location control with some gambling risk (useable only in the round the entered play), but can be brought back with Men of the West – which is nice.\n\nI had no good idea for any attachments, but here are some nice ideas for events. Adding the Outlands trait to them also strengthen that currently odd Hunter of Lamedon. All events are from the leadership sphere.\n\nEvent: Angbor's Gathering, 1 cost with the text: Play only if each hero you control has the Outlands trait. Action: Discard the top 5 cards from your deck. Add each Outlands cards you discarded this way to your hand.\n\nEvent: Allies, allies!, X cost with the text: Play only if there is no copy of Sword of Morthond in play and you have a copy of that card in your hand. Action: Put a Gondor ally from your hand into play for no cost and attach Sword of Morthond to that ally. X is that ally's printed cost plus 2.\n\nEvent: Pain Brings Relief, X cost with the text: Action: Discard X Outlands from play. Reduce your threat by X.\n\nSo, what do you think about these cards?\n\n \n\nEdited August 10 by Flrbb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3972809","commentId":3972809,"userName":"dalestephenson","timestamp":1597111023,"content":"I'm surprised by the claim that Lord of Morthond never had a place in an Outlands deck, or that mono-leadership Outlands isn't/wasn't easy to play.  I've played several different mono-leadership Outlands deck and had no issues, and when I did deck analysis of ringsdb Hirluin decks I found mono-leadership was the most common sphere configuration -- and they invariably had Lord of Morthond, since in a mono-leadership deck that's free card draw.  The most common configurations were mono-leadership (Lord of Morthond) and Hirluin-Lore-Spirit (can play any Outlands on turn one).  Of 126 different creators, 51 used mono-leadership and just 20 Le/Lo/Sp.\n\nNow it's possible you can't get a mono-leadership Outlands deck that ramps up as quickly as (for example) a Elrond/Erestor/Hirluin Outlands deck, but I don't think it's weak.  Playing is dead easy, mulligan for Steward to put on Hirluin.  (Also a good idea to have 3x Errand-Rider, and Theodred is a solid choice for an Outlands lineup.  Envoy of Pelargir can both provide smoothing and serve as a Sword of Morthond target.)\n\nI think unique Outlanders in the last cycle would've been extremely welcome, with some ability that makes them worth considering for other decks.  Yes, they'd get pumped up, but if you've got a lot of outlands out to pump up a unique, your non-unique outlanders are going to steamroll things anyways.\n\nI like the idea of a defensive-minded Outlander hero, since to get overpowered you want strong defense rather than chumping your precious boosters.  Is Golasgil Outlands or Gondor?  If Outlands, his ability would require Gondor as the third hero.  If he's Gondor, then he is only playable in an outlands deck without actually benefiting from an Outland hero.  I'd prefer an Outland hero who is actually usable outside an Outlands deck, though his trait also powers him up there.\n\nTransfering a resource from himself to an arbitrary hero is too close to LeDenethor, though Denethor is limited to Gondorians (a much wider swath of heroes than Outlanders).  Taking a resource from a hero and giving it to another hero would be a more powerful version of Bifur.  What would make him really useful, I think, if he could *generate* resources for another hero -- now even without trait synergy, he could be useful outside an Outlands deck, while being invaluable in it.  And as a defensive minded hero, I think stealing a page from a Day's Rising may be the way to go -- after defending without taking damage, he generates a resource (once per round).  Two versions that could work would be on another hero, or on a leadership hero (which would include himself as an option).  Either way he can fuel Hirluin, if not as consistently as Theodred, but without the quest-together retirement.  It also sets up potential synergy with Dori, which I like.  Dori needs more partners than Hirluin does!\n\nThe idea of cheap off-sphere Outlanders to trigger Lord of Morthond, but having them go away to avoid building too strong a game state is an interesting one, but it also means they will sit in your hand as long as Hirluin can afford to pay any off-sphere Outlander who *does* build board state.  I think that will end up powering Lord only in the end game, and that's where Outlands is already overpowered.  And while they power up Lord of Morthond, I think they power up the mixed-sphere Outland decks more if they're useful, because they can afford to play a cheap ally *and* the global buffers.  The Lore ally is also not cheap, when there's already a two-cost Outlands lore card in the Hunters of Lamedon.  I think a second one-cost lore and a 2-cost tactics ally might be better from a distribution POV.\n\nAnd I think it would be nice if they were playable outside an Outlands deck, which means giving them *some* stats.  They're only one-turn wonders, and you can get 4 willpower for 2 cost or 3 attack for 1 cost in temporary allies already, don't be afraid to make them something better than 0/0/0/1!  Making them *both* Gondor and Outlands would open them up for use in a Lothriel deck, which would be cool, though they're only attractive there if the discard effect could be used in the quest phase.\n\nDiscard to cancel -- this is interesting, though in a solo deck we're talking about a 1/3rd hit rate, which in a temporary ally makes it about as handy as a lampwright.  I'd expand it to cancelling a \"when revealed\" effect *or* a shadow effect, that would make it much more likely to hit during the short lifespan.\n\nThe lore ally you can use when you know you are going to engage a high-HP enemy, which makes it quite powerful with the right enemy -- but at 2-cost it's also a strain on mono-leadership decks that have two lore allies to pay for already.  I'd make it a 1-cost and have the discard be a travel action that allows you to *travel* to a location without triggering the travel requirement, returning any active location to staging.  It still can be used when you know you need it, it can be ignored for quests that don't need it (lessening the strain on Lore), and it also really helps with the Burglar's Turn contract, which needs help way more than Outlands does!\n\nA 2-cost one-turn tactics ally needs something more impressive than placing progress on enemy destruction.  We've already got a three-attack 1-cost temporary ally.  Trouble is, the most useful tactics-related effects (direct damage, engagement, attack prevention) already have allies out there to do those effects.  Nothing comes to mind right away that I really like at 2-cost (or for that matter, at 1-cost).  Maybe fetching a card from the discard, offsetting damage from Lamedon and AVGT?  Or maybe turn it into a search effect, which can be very helpful in slow-drawing Tactics.\n\nI'm not a fan of the events as written.  Angbor's Gathering is very narrow (requiring three Outlands heroes), and 1-cost just for getting the cards makes it an expensive search card, besides causing discards.  Allies!  Allies! I don't get the utility -- you need the ally in hand, you need Sword of Morthond in hand, and you pay X+2 where X is the ally cost?  So you need a three card combo *in hand* in order to pay one more than you would just playing the ally and sword of Morthond separately!  I think you may have accidently left some text in from a previous version.  Pain relief is expensive (X for X threat reduction) *and* it costs you precious Outlanders, the opposite of what you want with a swarm deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3973491","commentId":3973491,"userName":"EBerling","timestamp":1597249918,"content":"Lord of Morthond is incredible for an Outlands deck, especially with a Gray Wanderer Hirluin who starts with Lord of Morthund as his free attachment for access to incredible, out-of-the-gate card draw.  Alternatively, an all Leadership lineup with Hirluin, (MotK) Forlong, and either Denethor or Prince Imrahil can make great use of it as well.\n\n\nPersonally, I find Outlands to be the least thematic of the \"faction\" traits and I find its mechanics to be pretty dry and repetitive to actually play.  So, were one to add cards to Outlands, I think the key is stuff that is a bit more interesting than just doing a bunch of stats algebra.  Some of your suggestions are pretty good at accomplishing this.  Another area of exploration for Outlands would be neutral allies, as these would avoid the issue of interacting as strongly with Forlong, Prince of Dol Amroth, and Lord of Morthond."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3973531","commentId":3973531,"userName":"Kjeld","timestamp":1597255775,"content":"I quite like the idea of temporary allies that will leave play at the end of the turn no matter what, but which might be discarded to good effect before then if the opportunity arises. That mechanic would certainly add some much-needed strategy to Outlands -- kudos for the idea!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3974707","commentId":3974707,"userName":"Flrbb","timestamp":1597480978,"content":"Thank you for your thoughts!\n\nSorry, it has been a while. I took my time to respond, because I wanted to include your comments and wanted to come up with new/better cards. Sadly, I was not that successful.\n\nAs you, dalestephenson, are the master of all these stereotypical decks I totaly trust you with the named numbers up there in your post. But at least in my experience, a mono leadership deck was (by far) never as powerfull as a deck with - lets say - Beravor (a hero from the core box). I bet all these deck on ringsdb are just expressions of the wish that a mono deck would work. I might be wrong here, though.\n\nEvery now and then you mention you would love to see Outlanders who are playable outside a Outlanders deck. Because I want not to mix up the whole meta of the game, this is something which I do not want to achieve with my cards. Designing such Outlands should be something which has to be done from the official game developers.\n\nGolasgil is ment to be an Outlands. From the lore he should also be noble, but that would mix up even more from the current game meta. I was proud that I created an effect which also fits somewhat lore-wise. But I guess you are right, my Golasgil needs a redesign. Because a sentinel defender in leadership and with outlands support has lots of posibilities to get very tanky, it is maybe the right way to reward a more risky playstyle.\n\nThis is my next iteration for the hero:\nResponse: When Gogasil defends, chose a hero you control. Add one resource to that hero for each shadow effect that triggered. (Limit once per phase.)\n\nNow the allies. All ment to be Outlands only, adding the Gondor trait is indeed a very nice option, but as stated, I do not want to interfere that muich with the overall meta. Especially the spirit one is who I like. You get (up to) 3 temporary willpower or to cancel a nasty when revealed for 1 resource. Nice trade off, I think. But probably you are right and +0will without Ethir Swordsmans is odd. In my opinion having another (3rd) lore ally isn't that much of a problem; all off-sphere allies have to be paid from Hirluin. On the other hand, making him cost less is not a problem. I also do like your I idea with the travel effects. But in that case you could quest and use him for traveling - I really like the tradeoff thingy. Maybe enabling traveling during questing is an option?! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] I am not sure about this at all. To overpowered?\n\nAlly (lore): Mornan Recruiter, 1 cost 0/0/0/1 with the text: Ranged. At the end of the round, discard from play. Response: When a location is revealed and both, this and the active location, are non-unique and worth no victory points, discard M.R. to add the current active location to the staging area and travel to the revealed location without paying any travel costs.\n\nAlly (tarctics). I got no new idea (which I like) here - execpt for boosting his stats: 1 cost for 0/1/0 with 1 hit point and ranged.\n\nAs the Outlands had to face ships from Harad it would be thematically suiting if dicarding would lead to reduce the boarding by one - or something like that. To make such ally usefull in more cases, a discard to ignare a Surge effect on any revealed card would be an option, I think.\n\nThe events: I have to admit, I were usure about their \"power level\".\n\nWith the discard form Angbor's Gathering I wanted to pick up the risky theme. Reducing it to zero cost is the only thing I can come up with at the moment.\n\nAllies! Allies! lets you play an off-sphere ally, so you can e.g. add healing to your deck. As it is indeed complicated to play, its text is best changed to \"...search your deck for Sword of Morthond\" instead the need of having it allready in hand. But it would still be a very, very restrictive card.\n\nPain relief was ment as an emergency card, but is indeed expensive. I had the idea that you could discard those new allies, which gets discarded at the end of the round anyways. Remember: all the outlands can be brought back with Men of the West. Reducing its cost to zero is the right way to go, I think.\n\nAnyhow, I have to think a bit more on good ideas to come up with. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3974761","commentId":3974761,"userName":"dalestephenson","timestamp":1597503373,"content":"Firbb, thank you for your response.  As I've only played mono-leadership Outlands, I'm in no position to dispute the idea that mono-leadership Outlands falls well short of mixed-sphere Outlands in terms of power, and my deck analysis certainly is NOT evidence against it.  Stereotypical decks are frequently solid, but never optimal, and the hero selections *usually* are driven by theme over power.  I think that's true of Outlands, there's only so many Outlands cards, and Lord of Morthond is one of them, it's a thematic shame to leave it in the binder just so you can play the non-outlands Beravor.  Imrahil was a popular Outlands pick even *before* he got his Outlands attachment, even though he doesn't synergize with the Outlands at all.  Thematic considerations matter for many players, even for this powerful deck-in-a-box.\n\nHowever, having played mono-leadership Outlands, I have to push back on the idea that mono-leadership are just \"an expression of a wish that mono would work\".  They work just fine.  Outlands are extremely fine swarmers, if you get them in play and keep them in play you can overwhelm a ton of quests, especially with the help of Strength of Arms.  There's plenty of stereotypical decks that will struggle in a solo context, but mono-leadership Outlands *isn't* one of them.  If the optimal Outlands deck is far stronger (probably with Elrond and Vilya), good for it, but mono-leadership doesn't help to make it *viable*.  It's already there.\n\nFurther, if your goal is to *reduce* the spread between mono-leadership Outlands and aggro multi-sphere Outlands, I think your strategy of adding cheap off-sphere Outlands allies is fundamentally flawed.  Yes, once Sword of Morthond is down they represent card draw, but *until* Sword of Morthond is played they're yet another Outlands ally that only can be played by Hirluin, making the resource bottleneck even more actue.  And if the allies are worth having in your deck *at all*, they can also be played but the multisphere deck more easily.  I think it's likely to increase the gap, not decrease it.\n\nIf you want to decrease the gap, you've got to do more than trigger Lord of Morthond more often -- you need these allies to *inherently* provide what mono-leadership needs more than multi-sphere.  That means resource smoothing.  Put text on each of your temporary allies that they may *also* be paid for with leadership resources, and Bob's your uncle.  Now it's mono-leadership that has the advantage in putting them into play.\n\nOfficial developers are done with the game for the duration of the hiatus, and given their treatment of Outlanders in the final cycle it's clear they have no intention of providing help to Outlands at all.  As a variant designer you are free to design cards that make sense only in very narrow contexts, but it greatly reduces my interest in a variant project to do so.  Outlanders that are merely useful outside Outlands don't break any sort of meta, they definitely won't be overpowered there and will just be more useful cards in a game with a lot of useful cards.  But the game benefits and grows as useful cards are added, and the wider the sphere where cards are useful the larger the combinatorial effect.  So when reviewing variant cards, I am *much* more interested in cards that can help in a variety of contexts, especially those that can synergize with weak factions (unlike Outlands), than in very narrow cards -- and a card that is weakened so much for general use that it only is plausible in a narrow context is likely to be underpowered in *that* context too, producing likely binder fodder, and that expands nothing.\n\nI'm not the designer, but I do make card suggestions, and those suggestions will *always* be tilted towards making cards make sense in a larger context.  In the case of Outlands allies/heroes that's difficult because of their insane buffs, admittedly -- but with temporary allies that's a little easier to tolerate since it doesn't permanently build board state, and any Outlander who only receives and does not give global Outlands buffs I think is defensible -- when the Outlands buffs become insane on such a target, it hardly matters because you've got the swarm in place already!  It's kind of like the nerfs to cap Battle Master in a Dain deck -- pointless, since if you've got a massive dwarf deck attack is no longer a problem.\n\nIt's true that a sentinel Outlands hero could become very tanky.  I see that as a good thing -- you want your sentinel defender to become tanky, and I see a decent defender who naturally out-towers the mighty Beregond over time as a positive development, he really needs some competition.  A strong natural defender for an Outlands deck is a good thing, since it means you aren't having to waste your swarmers chumping.  But for the purposes of promoting mono-leadership, the resource generation or redistribution is probably more important than the defense.  Trigger on defense by itself weakens resource generation, in a solo context Theodred can always quest, but a defender can't always defend.  Trigger on a shadow effect existing cripples the resource generation to a fraction of defenses, and the requirement to trigger only makes it worse and more obnoxious.  Indeed, my own suggestion for defense-without-damage is probably to weak for what's needed, as without help he's least likely to generate resources precisely when they are most needed.  I think the best ability would just to be to generate a resource when defending, period, with a once per round limitation.  The \"hero you control\" makes the generation less interesting, especially for a sentinel defender it could be \"defending player\".\n\nIt's mostly true that the cost distribution by sphere doesn't matter since Hirluin has to pay for it anyway in a mono-leadership deck.  But it will matter to the mixed-sphere Outlands deck, which typically leave out Tactics.  Concentrating the costs in Lore favors the lore-centric mixed sphere deck relative to mono-leadership.  If your goal is to narrow the gap, an even distribution has no effect on mono-leadership while complicating life for the mixed deck.  But it's not a big deal.\n\nOne-round allies are more akin to events than permanent allies, if you want a meaningful choice on whether to use the discard or not, it really needs to be on a permanent ally, and even there those cards have not been generally powerful.  If you want to avoid quest + travel, you could have exhaust & discard for that ability -- if you allowed that to be in the quest phase, it would be useful in quests even without obnoxious travel effects, a living Strider's Path.\n\nThe idea of something particularly useful against ships is an interesting one, but targeting ships directly would be way, way too narrow to be useful.  How about one-turn text blanking of an enemy for the tactics discard?  That would hit ships *especially* hard, while still being useful elsewhere.\n\nThe \"risk\" theme in general is not something I would emphasize.  The cards that represent blind risks have *never* been popular, and especially in temporary allies and events anything that *might* help is going to get crowded out by things that *will* help.  Outlands could use a search card, and with Lord of Morthond especially it could use a deep search card.  Men of the West works well with AVGT or to return sadly-chumped swarmers, but it's expensive and never a card I like to play, getting more targets for it shouldn't be a design goal, especially when using Men of the West doubles the cost of cheap one-shots.\n\nIf you want to tilt Angbor's Gathering towards Outlands mono-leadership, make it 3-cost-each-hero-pays , let it search the top *ten* cards, choose one Outlands cards to put into play for free and one to go to hand, all other cards shuffled back -- I think that might be worth having in a deck.\n\nI see the point about Allies! Allies! enabling an off-sphere Gondorian, but Good Harvest would do the same thing more cheaply while not being useless without a three-card combo in hand.\n\nCheap temporary allies are a poor target for Men of the West, because they're expensive and because they don't build your board state, and overpowering Outlands is all about board state.  At 0-cost you can get some cheap relief out of temporary allies.  An alternate might be to keep the X-cost and return Outlands *to hand*, this might be worth it for a rich mono-leadership deck to exploit Lord of Morthond, but it would still be a narrow usage case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3975206","commentId":3975206,"userName":"Flrbb","timestamp":1597610691,"content":"I really do like how deep you go into that little project of mine. I will re-think my cards and try to follow your suggestions.\n\nI found a way to embed pictures here. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] So I can present cards instead of plain text now.\n\nGolasgil-v1.jpg?raw=1 [https://www.dropbox.com/s/il7tkvy1qouqmkl/Golasgil-v1.jpg?raw=1]\n\nOne thing bugs me, though. There is a card called Revealed in Wrath. I think it is really powerfull and game-wise I am glad that it is somewhat restricted by noldor. Your suggestion to blank a text box would be exactly that card - execept my Outlands ally would be splashable. I think the following would be too strong overall. What do you think?\n\nWestmarch-Explorer-v1.jpg?raw=1 [https://www.dropbox.com/s/c2m0oftmstoymyc/Westmarch-Explorer-v1.jpg?raw=1]\n\nInstead, I was thinking about something like this: (less powerfull, but (at least in a multiplayer game) quite usefull, too)\n\nPinnath-Gelin-Defender-v1.jpg?raw=1 [https://www.dropbox.com/s/o4wu7437iejz0lj/Pinnath-Gelin-Defender-v1.jpg?raw=1]\n\nThe other two colours:\n\nScout-of-Blackroot-v1.jpg?raw=1 [https://www.dropbox.com/s/7alojlhsgs2u1kr/Scout-of-Blackroot-v1.jpg?raw=1]Mornan-Recruiter-v1.jpg?raw=1 [https://www.dropbox.com/s/ouh5ofbi09nwgp9/Mornan-Recruiter-v1.jpg?raw=1]\n\nMy current iteration for Allies, Allies is much cheaper to play and lets you fetch any ledership attachement. The restriction of \"2 or less\" is because of Ancestral Armor. Without you could play Faramir with this card, fetch and play A.A. for for a total of 4 resources.\n\nAllies-allies!-v1.jpg?raw=1 [https://www.dropbox.com/s/2fwtajawev0j347/Allies-allies!-v1.jpg?raw=1]\n\nMy idea for making Angbors Gathering something else than a worse AVGT revolves around using the bottom of a players deck, but I am not satisfied with its current state.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3977739","commentId":3977739,"userName":"Flrbb","timestamp":1598116858,"content":"I reworked some allies a bit, for now I am pleased.\n\nAllies-v2.jpg?raw=1 [https://www.dropbox.com/s/u3psv3gtsncde0j/Allies-v2.jpg?raw=1]\n\nAs I wasn't that much convinced from the theme and spirit of my events, I came up with (more or less) complete new ones. The game mechanics now does not let the player shuffle the deck - dunno if that is to much of a restriction overall, but it helps with the second part of the now new mechanic - interaction with the bottom of the deck.\n\nEvents-v2.jpg?raw=1 [https://www.dropbox.com/s/xww81t3b3rf6vpq/Events-v2.jpg?raw=1]\n\nThese events also feature some \"risky strategy\" - something I do miss with the \"official Outlands\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3978512","commentId":3978512,"userName":"dalestephenson","timestamp":1598286998,"content":"Golasgil is an attractive hero for an Outlands deck -- his 2/0/3/5 stat distribution line is excellent, as a defender he prevents having to chump Outlanders, and since he starts with useful willpower/defense he doesn't have to wait for Outlanders to come into play to be useful, unlike Motk-Forlong or Hirluin (or in Imrahil's case, for his attachment to show up).\n\nHowever, I'm not convinced he specifically favors *mono-leadership* Outlands, since his resource generation is unreliable.  Theodred will let you ramp up quicker, because he can consistently funnel resources to Hirluin.  LeDenethor doesn't have the same defensive bones, but once Hirluin is Gondor will also consistenly funnel resources to Hirluin.  Golasgil's ace-in-the-hole are the two new events that require two Outlanders, meaning you need to use either Motk-Forlong or Golasgil to trigger them early, and both are most useful early.  But since it requires two-Outlands and not mono-leadership, Golasgil/Hirluin/Elrond is going to be better than Golasgil/Hirluin/<Leadership>, because you can get Outlanders out quicker.\n\nBoth Angbor's Gathering and Captains of Thousands are excellent if you qualify to play them, with a caveat from the latter.  Angbor's Gathering searches *and* plays Outlanders, so it's a guaranteed two-Outlanders in play, at the cost of some bottom-of-deck discards of cards you wouldn't get to early, a bargain for only two.  The caveat here is that if you are playing Angbor's Gathering, you do NOT want temporary outland allies in your deck -- you may even want to leave Hunter of Lamedon out of your deck, because this is your chance to get two global buffers out for two.  Fantastic card, useful for mono-leadership because you don't need to use Hirluin's resource, but directly oppposed to the concept of putting temporary allies in the deck.\n\nCaptains of Thousand's deep search for titles is excellent in an Outlands deck, as it can fetch Steward of Gondor, Prince of Dol Amroth, and Lord of Morthond, playing the first two at a discount.  Steward of Gondor is the most important card in mono-leadership Outlands, so this really does strengthen mono-leadership even though it comes into play exhausted.  It does have an annoying \"discard all attachments\" clause, preventing you from playing it if you care about the attachments in your hand, but Outlands is pretty attachment-light.  It's not really \"risky strategy\", since you know exactly what you might sacrifice in-hand when you play the card, it's just a cost that you usually won't play and randomly hampers you when there's an attachment to sacrifice.  I'd lose the clause, and also shuffle the cards back in rather than shuffling the cards and placing on top, unusual behavior for a search card.\n\nAllies, Allies can now put allies on the bottom of your deck.  As a free card that turns cheap one-turn allies into cost reduction, it has a certain appeal -- but the apparent intention to work with Angbor's Gathering will backfire, because you want Angbor's Gathering to play *permanent* Outlanders, not one-shots.  As this doesn't require two Outlanders, it's a good combo with the one-shot, except for the fact that taking a card slot just to squeeze out a point of threat reduction is not very compelling.  It would never be used on permanent Outlanders, since that sabotages your board state.  (The wording should be fixed to combine the first two sentences, \"place X Outland allies from your hand or under your control...\").  I still think it's odd for a title of \"Allies, Allies\" to be on a card putting allies *out* of play, and the flavor text for all four cards should be directly from the canonical text.\n\nOf Glorious Tales isn't a bad draw card at all for Leadership, you get three cards in before you have to top/bottom deck, well worth one-cost and would be popular outside an Outlands deck.  It doesn't do anything in particular for mono-Leadership Outlands that it wouldn't do for anyone else.  The bottom-deck does make a nice combo with Angbor's Gathering, but so does Dunedain Pipe.\n\nThe four one-shots are, as you intend, only worth playing in an Outlands deck -- further, they're only worth playing in an Outlands deck where buffing is *already* present.  (Actually, if Visionary Leadership is in play, I could see running the spirit/leadership one-shots with Lothiriel, since they'll go back in your deck if they aren't used for cancellation and will give you 1-2 willpower for free).  Since three of the four have a discard effect that *only* affects newly revealed cards, their discard effect is too worthless to be useful without scrying.  The exception is the lore one-shot, who could predictably give 2+ progress if there's a location to receive it and an enemy you're able to destroy.  But as is, I think adding *any* of them to the Stereotypical Outlands Deck (mono-leadership) would make it weaker, not stronger.  One-shot allies are essentially events.  Paying one to cancel a treachery or blank an enemy or cancel surge *would* be worth it -- if the card is sitting in your hand until you need it.  Paying a resource *blind* to do any of those without sure knowledge that something will be revealed to cancel isn't worth it, even if you get a card in exchange.  In the absence of cancellation, none of the one-shots are worth squat unless you already have your permanent Outlands out -- and if you have your permanent Outlands out, you're already rolling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3980953","commentId":3980953,"userName":"Flrbb","timestamp":1598709193,"content":"> On 8/24/2020 at 6:36 PM, dalestephenson said:\n> \n> The four one-shots are, as you intend, only worth playing in an Outlands deck -- further, they're only worth playing in an Outlands deck where buffing is *already* present.  (Actually, if Visionary Leadership is in play, I could see running the spirit/leadership one-shots with Lothiriel, since they'll go back in your deck if they aren't used for cancellation and will give you 1-2 willpower for free).  Since three of the four have a discard effect that *only* affects newly revealed cards, their discard effect is too worthless to be useful without scrying.  The exception is the lore one-shot, who could predictably give 2+ progress if there's a location to receive it and an enemy you're able to destroy.  But as is, I think adding *any* of them to the Stereotypical Outlands Deck (mono-leadership) would make it weaker, not stronger.  One-shot allies are essentially events.  Paying one to cancel a treachery or blank an enemy or cancel surge *would* be worth it -- if the card is sitting in your hand until you need it.  Paying a resource *blind* to do any of those without sure knowledge that something will be revealed to cancel isn't worth it, even if you get a card in exchange.  In the absence of cancellation, none of the one-shots are worth squat unless you already have your permanent Outlands out -- and if you have your permanent Outlands out, you're already rolling.\n\nI have to think about all the stuff you wrote.\n\nForthe quoted pasage; I have to say that you think most of single player games, but in a 4 player game there is amost each round something to cancel (etc), so these temporary Outland allies are more worthy.\n\nI have to admit: It somewhat buggs me, that my allies only stay one single round. Adding a \"Time\" mechanic would be a solution, but it felt wrong for me. I also thought about an attachment which lets you ignore the discard at the end of the round. But I found that to fiddly to be worthwhile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3980977","commentId":3980977,"userName":"player3351457","timestamp":1598712668,"content":"The newest iteration of Allies, Allies has an X that is a little bit ambiguous. If X is the total number of outlands allies in your discard pile, it scales ridiculously with threat reduction. You get an erestor deck comboed with this and could be the craziest recurring threat reduction in the game. It also seems to be much better than the already established Men of the West."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3980978","commentId":3980978,"userName":"player3351457","timestamp":1598712741,"content":"Honestly, that version of Allies, Allies costing 4 would still be worth it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3981221","commentId":3981221,"userName":"dalestephenson","timestamp":1598783694,"content":"player3351457, are you sure you're reading Allies! Allies! correctly?.  An event isn't \"recurring threat reduction\", and the allies come from your hand or in play, not the discard. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3981227","commentId":3981227,"userName":"dalestephenson","timestamp":1598785909,"content":"Firbb, you could extend the time in play by doing one point of damage at the end of each turn to them -- that way if Anfalas herdsman are out, they can last longer than one round (two rounds in the case of the lore ally).\n\nBut it's not like their stats are so good that they require removal in the first place -- none of them provide any buffs to Outland in general, so only the 1-wp spirit ally and the 1-attack tactics ally are any better than a cheap chump blocker without buffing -- other than their discard effect, which is worth 1 by itself *if* you can get it to trigger.  Leaving them permanently in place would assure that.\n\nIt's true that the discard effect is much more likely to fire with four players than when playing solo.  I think of Outlands as a particularly solo friendly build, since it wants Steward, doesn't buff globally, and doesn't have any native sentinel/ranged.  Dwarf and Gondor swarm both provide global buffs.  If your intention is to only enhance four-player Outlands play, then these allies certainly are substantially more attractive.  How attractive?  Let's look at Fate of Wilderland, the most recent quest analyzed at Vision of the Palantir.\n\nThere's 43 cards in the encounter deck, of which 3 are surgers.  16 of those have \"when revealed\", the Treacheries and Slopes of Gundabad.  Not all of those are bad enough in four player that you'd spend a Test of Will on them, but there's only a 13% chance of it whiffing.\n\nThere's 14 non-surge non-unique enemies plus the three surgers.  Most of those you wouldn't waste a Revealed in Wrath on, but all of them have obnoxious text.  As a response, the discard effect is significantly *more* powerful than Revealed in Wrath for just revealed non-uniques -- it can cancel the surge keyword, plus any \"When Revealed\" effect (though that doesn't come up in this class).  Again there's a low likelihood of whiffing completely in four player, even if the effect you're cancelling turns out to be weak.\n\nSurge cancellation is a different story -- with just 3 surgers (ignoring Swarm of Bats, which should essentially never acquire surge in four-player), there's a 75% chance of whiffing even in four player.  It'd be a fantastic discard effect if the ally were *permanently* in play (and with 0/0/1/1 base stats, it doesn't do much while waiting), but as a speculative surge canceller it is worthless -- surges are too rare."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3983461","commentId":3983461,"userName":"player3351457","timestamp":1599175439,"content":"> On 8/30/2020 at 6:34 AM, dalestephenson said:\n> \n> player3351457, are you sure you're reading Allies! Allies! correctly?.  An event isn't \"recurring threat reduction\", and the allies come from your hand or in play, not the discard. \n\nI suppose I am not reading it correctly -- \"allies from play\" wasn't clear to me. But for a free cost, I still maintain that erestor plus a hand full of allies breaks your threat dial pretty well. Especially if you have the cheap leave play allies to use before tossing. Maybe taking it to 1 cost and making it a refresh action might balance the power a little bit. \n\nEdited September 3 by player3351457\nI suppose \"allies you control\" implies that they are, in fact, in play. Got it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3983473","commentId":3983473,"userName":"dalestephenson","timestamp":1599177299,"content":"Erestor tosses his cards every turn, and the cheap leave play allies only last one turn.  Plus you need the actual event in hand.  I'm not seeing that as \"breaking the threat dial\" at all, especially since it's not recurring.  I don't think losing my entire hand to lower my threat three is even much of a benefit, honestly.  And only at *extreme* threat-risk would ever consider taking a permanent Outlands out of play for a mere 1-additional-threat reduction.\n\nFree can be expensive when it costs you cards or allies in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3983958","commentId":3983958,"userName":"player3351457","timestamp":1599275673,"content":"> On 9/3/2020 at 7:54 PM, dalestephenson said:\n> \n> Erestor tosses his cards every turn, and the cheap leave play allies only last one turn.  Plus you need the actual event in hand.  I'm not seeing that as \"breaking the threat dial\" at all, especially since it's not recurring.  I don't think losing my entire hand to lower my threat three is even much of a benefit, honestly.  And only at *extreme* threat-risk would ever consider taking a permanent Outlands out of play for a mere 1-additional-threat reduction.\n> \n> Free can be expensive when it costs you cards or allies in play.\n\nIf you build a dedicated erestor + outlands deck, you would play the allies you could (leave play included) since you would discard them at the end of the round anyway. They benefit from the boosting allies on the round they are in play, and if you happen to have this card, you shuffle them back into your deck if you don't trigger their ability or don't have the resources to pay for them. It basically says \"you can trigger their responses if you need or if not, lower your threat.\" \n\n \n\nOn another note, I really think a one round play is the best way to round out the outlands, so I commend the OP for that. You get a one round strong ally for cheap with a niche ability that might save your butt if the situation calls for it. Men of the West plays well with it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/310402-to-strengthen-the-outlands/?do=findComment&comment=3985871","commentId":3985871,"userName":"dalestephenson","timestamp":1599679391,"content":"> On 9/4/2020 at 11:14 PM, player3351457 said:\n> \n> If you build a dedicated erestor + outlands deck, you would play the allies you could (leave play included) since you would discard them at the end of the round anyway. They benefit from the boosting allies on the round they are in play, and if you happen to have this card, you shuffle them back into your deck if you don't trigger their ability or don't have the resources to pay for them. It basically says \"you can trigger their responses if you need or if not, lower your threat.\" \n\nYes, if Erestor draws one-shots he's going to play them (if possible) since they go away anyways, and if there is also Allies! Allies! in hand there's no reason not to play it anyways, since it's free and otherwise he would lose it.  But that means that unlike a normal hero who could play a bunch of one-shots in the same round then use Allies! Allies! to bottom-deck them, Allies! Allies! only benefits Erestor *if* it comes up in the same hand with one-shot-allies.  At four cards per turn, that's isn't especially likely.  Suppose you had 3x of each of the one-shots, 3x of Allies! Allies! and 50 cards in the deck.  In a \"normal turn\" where one of the four cards you draw happens to be Allies! Allies!, here's the chance of having one-shots in hand to exploit when one of your one-shots shows up:\n\n3 one-shots: 12/49 * 11/48 * 10/47 ~= 1.2%\n\n2 one-shots: (12/49 * 11/48 * 37/47) + (12/49 * 37/48 * 11/47) + (37/49 * 12/48 * 11/47) ~= 13.3%\n\n1 one-shot: (12/49 * 37/48 * 36/47) + (37/49 * 12/48 * 36/47) + (37/49 * 36/48 * 12/47) ~= 43.4%\n\nLess than 15% of the time will the event have the *potential* for a threat reduction of two, and of the 43% of the time that it might be worth one, you might use the discard ability (worth *more* than a threat reduction of one) and have your event be worthless -- which it will be about 42% of the time simply because it came with no one-shot allies.  That doesn't \"break your threat dial pretty well\", it's something that might reduce your threat dial by 1-2 over the course of drawing your entire deck, at the cost of wasting 3 deck slots on Allies! Allies!  You'd be far better off in Erestor/Outlands to leave Allies! Allies! *and* the one shots out to start with Hirluin/Golsagil/Erestor and enable Angbor's Gathering.\n\nHowever, since the low-cost one-shots are so low wattage, I don't think they'd be unbalanced if they came with threat reduction for free, honestly (at least for an end-of-the-round effect if not used for the discard).  Alternately, the spirit one-shot could lower threat by one, the leadership one-shot could return a resource (or at least move one), the lore could draw a card (or at least heal a point of damage), and the tactics could cause a point of direct damage.  Even with those effects, though, I'm not sure I'd want them in any two-Outlands-hero decks to dilute the effect of Angbor's Gathering.  Allies! Allies! likely wouldn't make the cut in any Outlands deck for me, but especially not in an Erestor deck.\n\n "}]}