{"url":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/","title":"Solo League 25 -- GH/Dreamchaser with VoI/Ringmaker player cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3985750","commentId":3985750,"userName":"dalestephenson","timestamp":1599671305,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from Grey Havens and Dreamchaser. The quests are:\n\n1) Raid on the Grey Havens\n2) The Drowned Ruins\n3) A Storm On Cobas Haven\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests. This means that you must have at least one of Cirdan, Galdor, Argalad, and Na'asiyah.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource. This can be done *anytime* during setup.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Raid on the Grey Havens and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing A Storm on Cobas Haven it does not matter how many tokens I needed to defeat The Drowned Ruins.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker). You are required to reveal which Heroes you used, and how many cards in your deck came from outside GH/Dreamchaser, VoI/Ringmaker and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\nNote: Contracts (from the most recent cycle) are not part of the deck and should not be counted. A Loot Deck (from the Burglar's turn contract) is also not part of the deck and should not be counted. The One Ring or the Messenger of the King ally/hero should also not be counted *unless* your deck uses those cards to reach 50 -- the Master card fetched by the One Ring should be counted. You may follow contract/One Ring setup instructions at the same as hero setup, ignoring Caleb's ruling.\n\nNote: Na'asiyah conflicts with her enemy/ally versions in two of the quests -- for the purposes of this league, if you use the Na'asiyah hero this should be considered her identical twin sister, coincidentally also named Na'asiyah.\n\n5) Tiebreakers have frequently mattered in this league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from GH/Dreamchaser, VoI/Ringmaker or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from GH/Dreamchaser and VoI/Ringmaker. More is better.\n\n3rd) The number of heroes used from this list: Cirdan, Galdor, Argalad, Na'asiyah. More is better.\n\n4th) The number of cards in the deck outside GH/Dreamchaser and VoI/Ringmaker. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Grey Havens, The Drowned Ruins, and Storm Over Cobas Haven. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in August's Solo League (if you didn't play or finish August's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for November's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in November's league. October's cycle will be Angmar, chosen by the winner of August's league.\n\n7) Weekly deadlines will at 11:59pm Eastern on the 14th, 21st, and 28th. Only the final deadline really matters for scoring and cannot be extended -- the first two deadlines are only to be included in intermediate standings.\n\nRaid on the Grey Havens: September 14th\nDrowned Ruins: September 21st\nStorm on Cobas Haven: September 28th\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1mnQGj54v_xjelFnc0TOl6YQBzvSiWr1YZpWxWKI60G4/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1mnQGj54v_xjelFnc0TOl6YQBzvSiWr1YZpWxWKI60G4/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results, but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3986823","commentId":3986823,"userName":"Alonewolf87","timestamp":1599827475,"content":"This month (after much agonizing over whether I wanted to set up a Na'asiyah vs Na'asiyah fight) I went with a deck not much competitive from a tiebreaker point of view (31 cards outside the basic card pool) but I wanted to double down on the ally boost theme and try something I had in mind for a long a time: a (mainly) Noldor fellowship which made use of Narya, the contract and Lords of the Eldar for big swings. I have to say Ally Glorfindel really is amazing for this kind of deck, being able to alway come back in play if you have resources.\n\nAnyway my biggest fear, Raid on the Grey Havens, actually went surprisingly well, with a 0 tokens win. It was still a brutal game and I flipped the contract so many times it seemed more of a revolving door, but I was able to scare away (for now) Sahir and Na'asiyah.\n\nHere is the usual playthrough\n\n \n\nRaid on the Grey Havens\n\n \n\nOpening Hand: Glorfindel, Light of Valinor, Narya, Quickbeam, Elrond's Counsel, Lembas; use Galdor's ability to discard Glorfindel and draw Silver Harp\n\n \n\nSetup: add Dreamchaser, Sahir's Ravager and Pillaged Ship to the staging area (7 threat)\n\n \n\nTurn 1 (30 Starting Threat)\n\nDraw: The Evening Star and Elladan; discard The Evening Star\n\nPlanning Phase: play Silver Harp on Cirdan; discard a card on Arwen and take it back with Silver Harp, add 1 resource to Galdor; play Quickbeam (deal 1 damage to have it came in play ready); resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: send Arwen, Cirdan, Galdor and Quickbeam to the quest; reveal Corsair Arsonist (2 damage to Pillaged Ship); 11 Willpower against 9 threat; 2 progress on Stage 1\n\nTravel phase: travel to Pillaged Ship\n\nEngagement phase: engage Corsair Arsonist\n\nCombat phase: deal shadow cards; Corsair Arsonist goes undefended (shadow is Umbar Raider, 2 damage on Galdor); end of combat phase 2 damage to Pillaged Ship (4 total)\n\nRefresh Phase/End of Round: 31 Threat Dial; 1 damage on Dreamchaser (1 total)\n\n \n\nTurn 2\n\nDraw: 2nd Silver Harp and Will of the West; exhaust 1st Harp to keep both\n\nPlanning Phase: play 2nd Harp on Arwen; discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Cirdan; play Light of Valinor on Cirdan; play Lembas on Galdor; resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: send Cirdan, Galdor, Arwen and Quickbeam to the quest; reveal Elven Wave-Runner; play Elrond's Counsel (TD 28); 12 Willpower against 8 threat; 4 progress to clear Pillaged Ship\n\nTravel phase: travel to Elven Wave-Runner\n\nEngagement phase: nothing\n\nCombat phase: deal shadow card, Arsonist goes undefended (shadow is Battle Hardened, 2 damage on Cirdan, 2 resources on Arsonist); discard Lembas to heal 2 damage from Galdor and ready it; Galdor and Cirdan attack and destroy Arsonist; end of combat phase 1 damage to Wave-Runner\n\nRefresh Phase/End of Round: 29 Threat Dial; 1 damage on Dreamchaser (2 total)\n\n \n\nTurn 3\n\nDraw: Dwarven Tomb and Elrohir; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Cirdan; play Elrohir; resources left Arwen (0) Cirdan (0), Galdor (1)\n\nQuest Phase: send everyone to the quest; reveal Corsair Infiltrator; 13 Willpower against 7 threat; 6 progress, 3 to clear Elven Wave-Runner (goes to victory display, draw To The Sea, To The Sea), 3 on Stage 1 (5 total)\n\nTravel phase: nothing\n\nEngagement phase: engage Corsair Infiltrator\n\nCombat phase: Cirdan defends Infiltrator (shadow is Raid Leader, 1 damage on Cirdan for 3 total); end of combat phase 2 damage to Dreamchaser (4 total)\n\nRefresh Phase/End of Round: 30 Threat Dial; 1 damage on Dreamchaser (5 total)\n\n \n\nTurn 4\n\nDraw: Jubayr and Lords of the Eldar; discard Lords of the Eldar; Infiltrator steals Arwen resource\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Cirdan; play To The Sea on Cirdan; discard Will of the West and Dwarven Tomb (take Dwarven Tomb back with 1st Harp) on To The Sea to play Elladan for 1; play Narya on Cirdan; resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Elladan and Elrohir to the quest; reveal Pillaged Ship (3 damage to it); 13 Willpower against 7 threat; 6 progress on Stage 1 (11 total)\n\nTravel phase: travel to Pillaged Ship\n\nEngagement phase: nothing\n\nCombat phase: deal shadow cards (1 additional to Infiltrator); exhaust Cirdan to ready Elladan and Elrohir; Elrohir defends Infiltrator (shadows are Sahir's Ravager and Put To The Torch which deals 1 damage to Elrohir, no damage from the attack); Elladan and Quickbeam attack and destroy Infiltrator; end of combat phase 1 damage to Pillaged Ship (4 total)\n\nRefresh Phase/End of Round: 31 Threat Dial; 1 damage on Dreamchaser (6 total)\n\n \n\nTurn 5\n\nDraw: Lembas and 2nd Glorfindel; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Cirdan; discard 2nd Glorfindel and Dwarven Tomb on To The Sea to play 1st Glorfindel from discard pile for 3; play Lembas on Cirdan resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Quickbeam, and Glorfindel to the quest; reveal Mithlonde Harbor which surges into Umbar Raider; 14 Willpower against 8 threat; 6 progress, 4 to clear Pillaged Ship, 2 on Stage 1 (13 total)\n\nTravel phase: travel to Mithlond Harbor\n\nEngagement phase: optionally engage Sahir's Ravager, automatic engagement of Umbar Raider\n\nCombat phase: deal shadow cards; Elrohir defends Sahir's Ravager (shadow is Corsair Arsonist; exhaust Cirdan and Narya to ready Glorfindel and Elrohir, no damage, add 1 resource to Ravager and deal 1 damage to Dreamchaser for a total of 7); discard Lembas to ready Cirdan and heal 3 damage; Elrohir defends Umbar Raider (shadow is Burning Piers, add it to the staging area, no damage, no resources to steal); Cirdan, Elladan and Glorfindel attack and destroy Ravager; end of combat phase 1 damage to Burning Piers\n\nRefresh Phase/End of Round: 32 Threat Dial; 1 damage on Dreamchaser (8 total) and 1 damage on Burning Piers (2 total)\n\n \n\nTurn 6\n\nDraw: Mablung and Lindir; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Galdor; play Mablung (don't use its effect); discard Jubayr (sigh!) on To The Sea to play Lindir for 2 (draw Elfhelm, Daeron's Runes and 2nd The Evening Star); flip contract; play Daeron's Runes, draw 3rd Glorfindel and 2nd Elrohir, discard 3rd Glorfindel; resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Glorfindel and Mablung to the quest; discard 2nd Evening Star to ready Glorfindel; reveal Raid Leader; 19 Willpower against 8 threat; 11 progress, 2 to clear Mithlond Harbor, 9 on Stage 1 clearing it; advance to Stage 2, add Na'asiyah and Captain Sahir to the staging area, reveal 2nd Burning Piers, 8 resources on Sahir and Na'asiyah, 1 resource to Raid Leader and Umbar Raider; Sahir and Na'asiyah engage (no events to discard on Na'asiyah)\n\nTravel phase: travel to 1st Burning Piers\n\nEngagement phase: nothing\n\nCombat phase: deal shadow cards; Glorfindel defends Umbar Raider (shadow is Corsair Arsonist, 2 damage); Elrohir defends Sahir (shadow is Elven Caravel, exhaust Cirdan and Narya to ready and boost Elrohir and Glorfindel, 1 damage on Elrohir for 2 total, add 2 resources for 10 total on Sahir); Elrohir defends Na'asiyah (shadow is Mithlond Harbor, Na'asiyah swings for 12 and destroy Elrohir, contract flips back, Na'asiyah down to 7 resources); Glorflindel Lindir and Elladan attack and destroy Umbar Raider; Quickbeam attacks Na'asiyah (down to 6 resources)\n\nRefresh Phase/End of Round: 33 Threat Dial; 1 damage on Dreamchaser (9 total) and 1 damage on 2nd Burning Piers\n\n \n\nTurn 7\n\nDraw: Gildor Inglorion and Dwarven Tomb; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Cirdan; play 2nd Elrohir, flip contract; resources left Arwen (0) Cirdan (0), Galdor (1)\n\nQuest Phase: send Cirdan, Arwen, Galdor and Quickbeam to quest; reveal The Fires Spread (1 damage to Dreamchaser for 10 total, 1st Burning Piers for 3 total and 2nd Burning Piers for 2 total); 15 Willpower against 8 threat; 7 progress, 3 to clear 1st Burning Piers and 4 to remove 4 damage from Dreamchaser (6 total)\n\nTravel phase: travel to 2nd Burning Piers\n\nEngagement phase: nothing\n\nCombat phase: deal shadow cards; Elrohir defends Sahir (shadow is Put To The Torch, 3 damage to active location, is put under The Havens Burn, 3 damage to Dreamchaser for 9 total and reveal Elven Wave-Runner, exhaust Cirdan to ready and boost Quickbeam and Elrohir, 1 damage on Elrohir, add 2 resources for 12 total on Sahir); Glorfindel defends Na'asiyah (shadow is Sahir's Ravager, Glorfindel is destroyed, flip back contract, Na'asiyah down to 5 resources); Mablung attack Na'asiyah (no damage, down to 4 resources); Quickbeam, Elrohir, Elladan and Lindir attack Sahir (8 attack, 6 damage, remove 6 resources from Sahir down to 6);\n\nRefresh Phase/End of Round: 34 Threat Dial; 1 damage on Dreamchaser (7 total), 1 damage on Elven Wave-Runner\n\n \n\nTurn 8\n\nDraw: A Test of Will (finally!) and 2nd Gildor Inglorion; discard 2nd Gildor Inglorion\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Galdor; discard Elfhem and Dwarven Tomb (take back Dwarven Tomb with 1st Harp) on To The Sea to play Gildor Inglorion for 3; flip contract; resources left Arwen (1) Cirdan (1), Galdor (0)\n\nQuest Phase: send Cirdan, Arwen, Galdor and Quickbeam to the quest; reveal Battle Hardened, cancel it with A Test of Will; 15 Willpower against 8 threat, 7 progress, 1 to clear 1 damage from Wave-Runner, 6 to clear 6 damage from Dreamchaser (down to 1 total)\n\nTravel phase: travel to Wave-Runner\n\nEngagement phase: nothing\n\nCombat phase: deal shadow cards; Gildor defends Na'asiyah (shadow is Corsair Infiltrator, exhaust Cirdan and Narya to ready Quickbeam and Gildor, 1 damage, Na'asiyah down to 3 resources); Mablung defends Sahir (shadow is The Fires Spread, Mablung is destroyed, flip back contract, 1 damage to Dreamchaser for a total of 2 and Wave-Runner, add 4 resources to Sahir for a total of 10); Quickbeam, Gildor, Elrohir and Lindir attack and destroy Na'asiya (9 attack against 2+3 defense and 4 hit points, add her to the victory display); Elladan attacks Sahir (1 damage, down to 9 resources)\n\nRefresh Phase/End of Round: 35 Threat Dial; 1 damage to Dreamchaser (3 total)\n\n \n\nTurn 9\n\nDraw: Gleowine and 2nd To The Sea; discard 2nd To The Sea\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp, add 1 resource to Cirdan; discard Dwarven Tomb on To The Sea (take it back with 1st Harp) to play Glorfindel from the discard pile for 4; flip contract; resources left Arwen (0) Cirdan (0), Galdor (1)\n\nQuest Phase: send Cirdan, Arwen, Quickbeam and Glorfindel to the quest; reveal White Ship; 16 Willpower against 9 threat; 7 progress, 3 to explore Wave-Runner (add to victory display, draw Light of Valinor), the rest to clear Dreamchaser\n\nTravel phase: travel to White Ship (search the discard pile for 2nd Raid Leader and add it to the staging area)\n\nEngagement phase: nothing\n\nCombat phase: deal shadow cards; Elrohir defends Sahir (shadow is Umbar Raider, exhaust Cirdan and Narya to ready and boost Quickbeam and Elrohir, 1 damage, 2 resource of Sahir for a total of 11); discard Light of Valinor to ready Glorfindel; Galdor, Quickbeam, Elladan, Elrohir, Glorfindel, Lindir and Gildor attack Sahir (23 attack against 11 resources + 2 defense + 5 hit points, destroyed, add to the Victory Display and win the game\n\n \n\n8 completed turns (x10) + 35 threat - 16 Victory points = 99 final score\n\n \n\nEdited September 11 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3987246","commentId":3987246,"userName":"Bobbymcbobface","timestamp":1599857992,"content":"Once again, I will only be using the required cards, which will definitely put me out of the running for victory. This will be made all the harder since I do not own the Rngmaker cycle. \n\nRaid on the Grey Haven is definitely the hardest of the three, at least solo. I took ten tokens, after agonizingly close 4, 7, and 8 token runs. (the 0,1,2,3,5,6, and 9 runs were quick defeats.)\n\nDrowned Ruins was a turtling breeze, with zero tokens. On to Dol Amroth!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3987834","commentId":3987834,"userName":"Thanee","timestamp":1600008619,"content":"I started out with a deck using Círdan, Erestor and Na'asiyah, but it simply did not work well enough with the three spheres and my resources, so I had to switch out Na'asiyah for the more traditional choice and included Arwen instead.\n\nSo far, I only played Raid on the Grey Havens, which went pretty smooth, once I got past the first couple turns, where I didn't get anywhere progress-wise at first. But once the big allies started to show up, the deck started to pick up speed. Entered the second stage with 8 damage on the Dreamchaser, and was exactly one damage short to kill Sahír right away, as I sent everyone to douse the flames. So one more turn after that, where I had enough damage to defeat Na'asiyah and Sahír both.\n\nBye\nThanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988106","commentId":3988106,"userName":"Thanee","timestamp":1600093331,"content":"The Drowned Ruins was no problem at all. A bit annoying that I had all my Will of the West and all my Silver Harps in my opening hand (and thus in my discard pile, since I couldn't play them, or rather had better things to play; like Inner Strength, To the Sea, and Glorfindel), so I had to very carefully watch for those Dwarven Tombs. But it all worked out. I built up a few rounds and then started to go through the Underwater locations, with enough Willpower to explore one per round.\n\nOne curious situation happened with the third Underwater location, which was the one that blanks all attachments.\n\nI had Glorfindel with Sword-thain, and Asfaloth in play. He also had one resource.\n\nWith the attachments blank, he is no longer considered a hero, but the attachments themselves stay on him (if anything, they do not have any text, so they are just blank attachments). Does he lose the resource, though? I did so, since I wasn't sure (and it didn't matter, anyways).\n\nBye\nThanee\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988154","commentId":3988154,"userName":"dalestephenson","timestamp":1600099489,"content":"Since there's no direction to discard resources anywhere, I would not discard them -- though they wouldn't be useful for anything until Sword-Thain was unblanked.  It's equivalent to Treebeard or Radagast allies having their text blanked by a treachery -- their resources would be unusable, but there's no reason for them to go away."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988177","commentId":3988177,"userName":"Alonewolf87","timestamp":1600101072,"content":"Drowned Ruins was a breeze, having all the time to turtle (and 2 unique allies from the get go to jumpstart the contract) really makes this deck shine. I took a bit of sweet time but when I got to Sahir's betrayal I was able to flip back the contract next turn and make a huge quest push with Lords of the Eldar to clear the Shine immediately\n\nHere is the usual playthrough for those interested\n\n\n\nThe Drowned Ruins\n\n \n\nOpening Hand: (after Mulligan) Light of Valinor, Sulien, Silver Harp, Elladan, A Test of Will, Will of the West\n\n \n\nSetup: add Water Logged Halls and Cursed Caverns to the staging area\n\n \n\nTurn 1 (30 Starting Threat)\n\nDraw: Elwing's Flight and 2nd Light of Valinor; discard 2nd Light of Valinor\n\nPlanning Phase: play Silver Harp on Arwen; discard a card on Arwen and retrieve it with Silver Harp to add 1 resource to Galdor's pool; resources left Arwen (0) Cirdan (0), Galdor (2)\n\nQuest Phase: send Cirdan, Galdor, Arwen and Na'asiyah to the quest; reveal Tangling and Grasping; remove Na'asiya from the quest; 9 Willpower against 5 threat; 4 progress on stage 1\n\nTravel phase: travel to Cursed Caverns (without flipping it)\n\nEngagement phase: nothing\n\nCombat phase: nothing\n\nRefresh Phase/End of Round: 31 Threat Dial\n\n \n\nTurn 2\n\nDraw: To The Sea and The Evening Star; discard The Evening Star\n\nPlanning Phase: play Elladan; discard a card on Arwen and retrieve it with Silver Harp to add 1 resource to Cirdan's pool; play Light of Valinor on Cirdan; resources left Arwen (1) Cirdan (1), Galdor (0)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Na'asiyah and Elladan to the quest; reveal Drowned Dead; 12 Willpower against 4 threat; 8 progress, 5 to clear Cursed Caverns (don't trigger the Response, shuffle back in Grotto deck, add Undersea Grotto to the staging area), 3 on Stage 1 (7 total)\n\nTravel phase: travel to Undersea Grotto; spend 1 resource from Arwen's pool to add it to Sahir's pool\n\nEngagement phase: nothing\n\nCombat phase: nothing\n\nRefresh Phase/End of Round: 32 Threat Dial\n\n \n\nTurn 3\n\nDraw: Narya and Jubayr; exhaust Silver Harp to keep both\n\nPlanning Phase: discard Elwing's Flight on Arwen to add 1 resource to her pool; play Jubayr for 4 thanks to Undersea Grotto; resources left Arwen (0) Cirdan (0), Galdor (1)\n\nQuest Phase: send Cirdan and Arwen to the quest; reveal Drowned Cave; 7 Willpower against 7 threat; no progress\n\nTravel phase: nothing\n\nEngagement phase: engage Drowned Dead; spend 1 resource from Galdor' pool to add it to Na'asiyah's pool\n\nCombat phase: deal shadow card; Na'asiyah defends Drowned Dead (shadow is Powerful Undertow, spend Na'asiyah's resource to give her +2 Defense, no damage); Cirdan, Galdor and Jubayr attack and destroy Drowned Dead\n\nRefresh Phase/End of Round: 33 Threat Dial\n\n \n\nTurn 4\n\nDraw: Elrohir and Lords of the Eldar; discard Lords of the Eldar\n\nPlanning Phase: discard a card on Arwen and retrieve it with Silver Harp to add 1 resource to Cirdan's pool; play Sulien for 3 thanks to Undersea Grotto: resources left Arwen (0) Cirdan (0), Galdor (1)\n\nQuest Phase: send Cirdan, Arwen and Sulien to the quest; reveal Tangling and Grasping, remove Sulien from the quest; 7 Willpower against 5 threat; 2 progress on Undersea Grotto\n\nTravel phase: pay 1 resource from Galdor's pool to add it to Na'asiyah's pool (1 total)\n\nEngagement phase: nothing\n\nCombat phase: nothing\n\nRefresh Phase/End of Round: 34 Threat Dial\n\n \n\nTurn 5\n\nDraw: Elrond's Counsel and Daeron's Runes; exhaust Silver Harp to keep both\n\nPlanning Phase: play Elrohir for 2 thanks to Undersea Grotto (flip contract); play Daeron's Runes (draw 2nd Elrohir, 2nd Elwing's Flight, discard 2nd Elrohir); discard Will of the West on Arwen to add 1 resource to her pool; play Narya on Cirdan; resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Sulien, Elladan and Elrohir to the quest; reveal Cave Eel; play Elrond's Counsel (+1 WP to Cirdan, 31 TD); 17 Willpower against 8 threat; 9 progress, 1 to clear Undersea Grotto (shuffle back in Grotto deck, add Cursed Caverns to staging area), 8 on Stage 1 (15 total, cannot advance since I don't have enough locations in the victory display)\n\nTravel phase: travel to Drowned Cave\n\nEngagement phase: engage Cave Eel\n\nCombat phase: deal shadow card; Jubayr defends Cave Eel (discard shadow card, no damage); exhaust Cirdan and Narya to ready Elladan and Jubayr; everyone attacks and destroys Cave Eel\n\nRefresh Phase/End of Round: 32 Threat Dial\n\n \n\nTurn 6\n\nDraw: Dwarven Tomb and Elfhelm; exhaust Silver Harp to keep both\n\nPlanning Phase: play To The Sea on Cirdan; resources left Arwen (1) Cirdan (0), Galdor (1)\n\nQuest Phase: send Cirdan, Galdor, Arwen and Sulien to the quest; reveal Sea Scorpion; 15 Willpower against 7 threat; 8 progress, 4 to clear Underwater Cave and 4 on Stage 1 (19 total, cannot advance since I don't have enough locations in the victory display)\n\nTravel phase: travel to Water Logged Halls, flip to reveal Dark Abyss\n\nEngagement phase: engage Sea Scorpion; spend 1 resource from Arwen's pool and add it to Na'asiyah's pool (2 total)\n\nCombat phase: deal shadow card; Jubayr defends Sea-Scorpion (discard shadow card, no damage); cannot attack\n\nRefresh Phase/End of Round: 33 Threat Dial\n\n \n\nTurn 7\n\nDraw: Lindir and 2nd Test of Will; exhaust Silver Harp to keep both\n\nPlanning Phase: spend 1 resource from Galdor's pool to add it to Na'asiyah's pool (3 total); resources left Arwen (1) Cirdan (1), Galdor (1)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Sahir, Sulien and Elrohir to the quest; reveal Into The Abyss, cancel it with 1st A Test of Will; 21 Willpower against 3 threat; 18 progress, 12 to clear Dark Abyss (add it to Victory Display, add Undersea Grotto to staging area), 6 on Stage 1 (25 total, cannot advance since I don't have enough locations in the victory display)\n\nTravel phase: travel to Cursed Caverns, flip it to Twisting Hollow (now that's annoying)\n\nEngagement phase: nothing\n\nCombat phase: deal shadow card; Jubayr defends Sea-Scorpion (discard shadow card, no damage); Cirdan, Na'asiyah and Elladan attack and destroy Sea-Scorpion\n\nRefresh Phase/End of Round: 34 Threat Dial\n\n \n\nTurn 8\n\nDraw: 2nd Elladan and 3rd Light of Valinor; discard 2nd Elladan\n\nPlanning Phase: discard a card on Arwen and exhaust Silver Harp to take it back to add 1 resource to Cirdan's pool; resources left Arwen (2) Cirdan (2), Galdor (2)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Sahir, Sulien and Elrohir to the quest; reveal Drowned Dead; 21 Willpower against 4 threat; 17 progress, 14 to clear Twisting Passage (add it to the victory display, add 2nd Undersea Grotto to the staging area), 3 on Stage 1 (28 total, cannot advance since I don't have enough locations in the victory display)\n\nTravel phase: travel to 1st Undersea Grotto, flip it to Dark Abyss\n\nEngagement phase: engage Drowned Dead\n\nCombat phase: deal shadow card; Jubayr defends Drowned Dead (discard shadow card, no damage)\n\nRefresh Phase/End of Round: 35 Threat Dial\n\n \n\nTurn 9\n\nDraw: 2nd Lords of the Eldar and Gleowine; discard 2nd Lords of the Eldar\n\nPlanning Phase: discard a card on Arwen and exhaust Silver Harp to take it back to add 1 resource to Galdor's pool; spend 1 resource from Galdor's pool to add it to Na'asiyah's pool (4 total); resources left Arwen (3) Cirdan (3), Galdor (3)\n\nQuest Phase: send Cirdan, Galdor, Arwen, Sahir, Sulien and Elrohir to the quest; reveal Throngs of Unfaithful which surges into Drowned Cave; 21 Willpower against 6 Threat; 15 progress, 12 to clear Dark Abyss (add it to the victory display); advance to Stage 3; make Shrine to Morgoth the active location, Sahir flips to enemy (flip contract) and attacks (Na'asiyah defends, shadow is Throngs of Unfaithful, spend 2 resources down to 2 total to give her +4 Defense, no damage), remove Sahir from the game, search the encounter deck for Soulless Cadaver and add it to the staging area\n\nTravel phase: nothing\n\nEngagement phase: engage Throngs of Unfaithful\n\nCombat phase: deal shadow cards; Jubayr defends Throngs of Unfaithful (shadow is Ancient Depths, exhaust Cirdan and Narya to ready and boost Jubayr and Na'asiyah, no damage); Jubayr defends Drowned Dead (discard shadow card, no damage); Na'asiyah and Elladan attack and destroy Drowned Dead\n\nRefresh Phase/End of Round: 36 Threat Dial;\n\n \n\nTurn 10\n\nDraw: 2nd The Evening Star and 2nd To The Sea; discard 2nd To The Sea\n\nPlanning Phase: play Elfhelm (flip back contract); discard a card on Arwen and exhaust Silver Harp to take it back to add 1 resource to Galdor's pool; spend 1 resource from Galdor's pool to add it to Na'asiyah's pool (3 total); play 2nd The Evening Star (2+2 progress on Drowned Cave exploring it); resources left Arwen (2) Cirdan (2), Galdor (2)\n\nQuest Phase: send everyone to the quest; play Lords of the Eldar from the discard pile boosting all Noldor; reveal Cave Eel; 33 Willpower against 8 threat; 25 progress, 18 to explore Shrine to Morgoth and winning the game\n\n \n\n9 completed turns (x10) + 36 threat - 6 Victory points = 120 final score\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988178","commentId":3988178,"userName":"Alonewolf87","timestamp":1600101177,"content":"> 2 hours ago, Thanee said:\n> \n> With the attachments blank, he is no longer considered a hero, but the attachments themselves stay on him (if anything, they do not have any text, so they are just blank attachments). Does he lose the resource, though? I did so, since I wasn't sure (and it didn't matter, anyways).\n> \n> Bye\n> Thanee\n\nDale already replied so I will simply voice my support for that position: there is nothing indicating that you should discard those resources, ally Treebeard and Radagast show us that allies can have resources too. You simply won't be able to use them until you get Sword-Thain back online."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988188","commentId":3988188,"userName":"Bobbymcbobface","timestamp":1600103034,"content":"Cobas Haven finally ended in an amazingly epic, 33 victory point win at 6 tokens. This was such a fun solo league, with my favorite cycle AND quest! Thanks @dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/]!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988306","commentId":3988306,"userName":"Thanee","timestamp":1600122479,"content":"Good point about Treebeard and Radagast allies also being able to have resources, didn't think of that. But as I said, it really didn't matter, as there was no need for the resources anymore at that point and it was close to the end, anyways. 🙂\n\nBye\nThanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988468","commentId":3988468,"userName":"Alonewolf87","timestamp":1600170633,"content":"Cobas Haven was once again a victory at 0 tokens but the deck was really tested to its limit in combat. I ended up with huge amounts of damage everywhere (next time I really should include Ioreth and some Song of Healing in a deck like this one. I was still able to destroy the Corsair Flagship in a single all out attack the turn I engaged it thanks to a combat turn with 3 of 5 enemies without shadow cards, which let me take some extra undefended attacks to have the maximum firepower needed. Nifty bonus that the Corsair Skirmishers are boosted by the contract too.\n\nHere is the usual playthrough for those interested\n\n\n\nA Storm on Cobas Haven\n\n \n\nOpening Hand: The Evening Star, Silver Harp, Glorfindel, Gleowine, Lords of the Eldar, Lindir; use Galdor's ability and discard The Evening Star, Glorfindel and Lords of the Eldar, draw Daeron's Runes, Elrohir, Light of Valinor\n\n \n\nSetup: take control of Dreamchaser and Narelenya, add Corsair Flagship, Scouting Ship and Sea-Ward Tower (Guarded is Ramming Speed – Doomed 2),\n\n \n\nTurn 1 (32 Starting Threat)\n\nDraw: Lembas and Dwarven Tomb; discard Dwarven Tomb\n\nPlanning Phase: play Daeron's Runes (draw 2nd Lembas and To The Sea, discard 2nd Lembas); play Silver Harp on Arwen; discard a card on Arwen and take it back with Silver Harp to add 1 resource to Cirdan's pool; play Gleowine for 1 thanks to Narelenya discount; play Light of Valinor on Cirdan; resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: shift heading off course; send Dreamchaser to the Sailing Test (reveal 2 more cards due to Sea Ward Tower so 4); 1 symbol heading back to on course; send Cirdan, Galdor and Arwen to the quest; reveal Belfalas Islet; 9 Willpower against 6 threat; 3 progress on Stage 1\n\nTravel phase: travel to Belfalas Islet (consider Corsair Flagship as out of play)\n\nEngagement phase: engage Scouting Ship (deal 2 damage to it since we are on course); boarded by Southron Sailor\n\nCombat phase: deal shadow cards; Narelenya defends Scouting Ship (shadow is Boarding Party, +2 attack, 2 damage on Narelenya); Cirdan defends Southron Sailor (shadow is Battle-Hardened, 2 resource on Sailor, no damage)\n\nRefresh Phase/End of Round: 33 Threat Dial\n\n \n\nTurn 2\n\nDraw: Elwing's Flight and 2nd Elwing's Flight; discard 2nd Elwing's Flight\n\nPlanning Phase: play Lembas on Cirdan: discard a card on Arwen and take it back with Silver Harp to add 1 resource to Cirdan's pool; play To The Sea on Cirdan; play Elrohir for 2 thanks to Narelenya discount: resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: shift heading off course; send Gleowine to the Sailing Test (reveal 2 more cards due to Sea Ward Tower so 3); 1 symbol heading back to on course; send Cirdan, and Arwen to the quest; reveal Starlit Sea; 7 Willpower against 5 threat; 2 progress on Belfalas Islet\n\nTravel phase: nothing\n\nEngagement phase: nothing\n\nCombat phase: deal shadow card; Sailor goes undefended (shadow is Corsair Warship, 2 damage to Cirdan); Scouting Ship goes undefended (shadow is The Beacon, dang it!, 5 damage to Dreamchaser); Cirdan, Galdor and Elrohir attack and destroy Southron Sailor; Narelenya and Dreamchaser attack and destroy Scouting Ship:\n\nRefresh Phase/End of Round: 34 Threat Dial\n\n \n\nTurn 3\n\nDraw: Elladan and 2nd Silver Harp; exhaust 1st Silver Harp to keep both\n\nPlanning Phase: play 2nd Silver Harp on Arwen; discard a card on Arwen and take it back with 2nd Silver Harp to add 1 resource to Galdor's pool; play Elladan for 2 thanks to Narelenya discount; resources left Arwen (0) Cirdan (0), Galdor (0)\n\nQuest Phase: shift heading off course; send Dreamchaser to the Sailing Test (reveal 2 more cards due to Sea Ward Tower so 4); 1 symbol heading back to on course; send Cirdan, Galdor, Arwen, Elladan and Elrohir to the quest; reveal Corsair Skirmisher; 13 Willpower against 5 threat; 8 progress, 3 to clear Belfalas Islet, 5 on Stage 1 (8 total)\n\nTravel phase: travel to Starlit Sea\n\nEngagement phase: engage Corsair Skirmisher (deal 2 damage to it); boarded by Umbar Raider\n\nCombat phase: deal shadow cards; Narelenya defends Corsair Skirmisher (shadow is Starlit Sea. +1 attack, no damage); Cirdan defends Umbar Raider (shadow is Tower of the Heron, dang it!, 1 damage for 3 total, no resources to steal); exhaust Gleowine to draw A Test of Will\n\nRefresh Phase/End of Round: 35 Threat Dial\n\n \n\nTurn 4\n\nDraw: Firyal and 2nd Elladan; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp to add 1 resource to Cirdan's pool; discard 2nd Glorfindel on To The Sea and use Narelenya discount to play 1st Glorfindel from the discard pile (flip contract); resources left Arwen (0) Cirdan (0), Galdor (1)\n\nQuest Phase: shift heading off course; send Dreamchaser to the Sailing Test (reveal 2 more cards due to Sea Ward Tower so 4); 0 symbol so stay off course (1 degree); send Cirdan, Arwen and Glorfindel to the quest; reveal Tower of the Gull (Guarded by Cost of Anfalas); 13 Willpower against 7 threat; 6 progress, 2 to clear Starlit Sea, 4 on Stage 1 clearing it; advance to Stage 2, search and add Light Cruiser to the staging area (guarding Sea Ward Tower)\n\nTravel phase: nothing\n\nEngagement phase: nothing\n\nCombat phase: deal shadow cards; Elrohir defends Umbar Raider (shadow is The Raiders' Assault, no effect, no damage, steal Galdor's resource); Narelenya defends Skirmisher (shadow is Scouting Ship, no damage); Cirdan and Galdor attack and destroy Umbar Raider; discard Lembas to heal and ready Cirdan; exhaust Gleowine and draw Gildor Inglorion; discard Lindir to ready Glorfindel; Glorfindel, Cirdan and Elladan attack and destroy Skirmisher (discard Elladan to take control of Skirmisher, flip back contract)\n\nRefresh Phase/End of Round: 36 Threat Dial;\n\n \n\nTurn 5\n\nDraw: 2nd Elrohir and Elrond's Counsel; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp to add 1 resource to Galdor's pool; play 2nd Elladan for 2 thanks to Narelenya discount (flip contract); resources left Arwen (1) Cirdan (1), Galdor (0)\n\nQuest Phase: shift heading off course (2 degrees); send Dreamchaser, Glorfindel and Elladan to the Sailing Test (reveal 4 cards, deck down to 0 cards so reshuffle); 2 symbols so back on course; discard 2nd Elrohir to ready Glorfindel; send Cirdan, Galdor, Arwen and Glorfindel to the quest; reveal Corsair Warship; play Elrond's Counsel on Cirdan (33 TD); 17 Willpower against 15 threat; 2 progress on stage 2\n\nTravel phase: exhaust Narelenya to travel to Coast of Anfalas; discard Lindir to ready Glorfindel\n\nEngagement phase: engage Light Cruiser; boarded by Umbar Captain (1 resource) and Raid Leader (1 resource + 2 stolen = 3 total)\n\nCombat phase: archery 4 (1 damage to Gleowine and 3 to Glorfindel); deal shadow cards; Elrohir defends Raid Leader (shadow is Fog Bank, 1 damage); Skirmisher defends Light Cruiser (shadow is Scouting Ship, 2 damage); Gleowine defends Umbar Captain (shadow is Belfalas Islet; Gleowine is destroyed, flip back contract); Cirdan and Glorfindel attack Umbar Captain (5 attack against 3 defense, 2 damage)\n\nRefresh Phase/End of Round: 34 Threat Dial;\n\n \n\nTurn 6\n\nDraw: 2nd Gildor Inglorion and Will of the West; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp to add 1 resource to Galdor's pool; discard 2nd Gildor and Will of the West on To The Sea to play 1st Gildor for 2 thanks to Narelenya discount (flip contract); resources left Arwen (2) Cirdan (1), Galdor (0)\n\nQuest Phase: shift heading off course; send Narelenya to the Sailing Test (reveal 2 cards); 1 symbol so back on course; send Cirdan, Galdor, Arwen and Glorfindel to the quest; reveal Cobas Haven; play Elwing's Flight to boost and ready Glorfindel and Galdor; 18 Willpower against 8 threat; 10 progress 3 to clear Coast of Anfalas (take control of Tower of the Gull), 7 on Stage 2 (9 total)\n\nTravel phase: travel to Cobas Haven\n\nEngagement phase: nothing\n\nCombat phase: archery 4 (1 on Galdor, 3 on Skirmisher for 5 total); deal shadow cards; Narelenya defends Light Cruiser (shadow is Skirmisher, no damage); Gildor defends Umbar Captain (shadow is Starlit Sea, +1 attack, 2 damage); Elrohir defends Raid Leader (shadow is Battle-Hardened, +2 resource for 5 total, 1 damage on Elrohir for 2 total); Cirdan and Galdor attack and destroy Umbar Captain (6 attack against 3 defense, 3 damage for a total of 5); discard Firyal to ready Glorfindel; Glorfindel, Elladan and Skirmisher attack and destroy Light Cruiser (take control of Sea Ward Tower);\n\nRefresh Phase/End of Round: 35 Threat Dial\n\n \n\nTurn 7\n\nDraw: Dwarven Tomb and Narya (finally!); exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp to add 1 resource to Galdor's pool; play Narya on Cirdan; resources left Arwen (1) Cirdan (2), Galdor (0)\n\nQuest Phase: shift heading off course; send Dreamchaser to the Sailing Test (reveal 4 cards); 2 symbols so back on course; send Cirdan and Arwen to the quest; reveal Starlit Sea; play Lords of the Eldar from the discard pile boosting all Noldor characters; 11 Willpower against 9 threat; 2 progress on Cobas Haven\n\nTravel phase: nothing\n\nEngagement phase: engage Warship; boarded by Cunning Pirate (discard To The Sea, 1 resource) and Corsair Infiltrator (only 2 due to Cobas Haven effect)\n\nCombat phase: deal shadow cards; Narelenya defends against Warship (shadow is The Raiders's Assault, 2 damage for a total of 4); Elrohir defends Infiltrator (shadow is Taking Water, no damage); Gildor defends Raid Leader (shadow is Light Cruiser, no damage); Elladan defends Cunning Pirate (shadow is Ramming Speed, no damage); exhaust Cirdan and Narya to ready and boost Elladan and Gildor; Skirmisher, Glorfindel and Gildor attack and destroy Warship (14 attack against 4 defense, 10 damage, add it to victory display); Elladan attacks and destroy Corsair Infiltrator (5 attack against 3 defense, 2 damage); discard Dwarven Tomb to ready Glorfindel; Glorfindel and Galdor attack and destroy Cunning Pirate;\n\nRefresh Phase/End of Round: 36 Threat Dial\n\n \n\nTurn 8\n\nDraw: 3rd Elwing's Flight and 2nd Will of the West; exhaust 1st Harp to keep both\n\nPlanning Phase: discard a card on Arwen and take it back with 2nd Silver Harp to add 1 resource to Cirdan's pool;; resources left Arwen (1) Cirdan (2), Galdor (2)\n\nQuest Phase: shift heading off course; send Narelenya to the Sailing Test (reveal 4 cards); 1 symbol so back on course; send Cirdan, Arwen, Glorfindel and Skirmisher to the quest; reveal Tower of the Heron (Guarded by Boarding Party, which puts Vicious Marauder engaged with me, random discard is 3rd Elwing's Flight so 2 resources); 17 Willpower against 6 threat; 11 progress, 2 to clear Cobas Haven, 9 on Stage 2 clearing it; advance to Stage 3, engage Raider Flagship (boarded by Southron Soldier)\n\nTravel phase: travel to Starlit Sea\n\nEngagement phase: due to Flagship effect boarded by Corsair Infiltrator\n\nCombat phase: deal shadow cards (only to Raid Leader and Southron Soldier); Flagship goes undefended (5 damage to Narelenya for 9 total); Infiltrator goes undefended (no shadow, 3 damage to Cirdan); Elrohir defends Marauder (2 damage from its effect to Arwen, no shadow no damage); Gildor defends Southron Soldier (shadow is Taking on Water, no damage); exhaust Cirdan and Narya to ready and boost Elrohir and Gildor; Elrohir defends Raid Leader (shadow is Coast of Anfalas, no damage); discard A Test of Will to ready Glorfindel; Galdor, Gildor, Elladan, Glorfindel, Narelenya and Skirmisher attack and destroy Flagship (24 attack against 3 defense, 21 damage) adding it to the victory display and winning the game\n\n \n\n8 completed turns (x10) + 36 threat + 6 damage on heroes - 27 Victory points = 95 final score\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988577","commentId":3988577,"userName":"Bobbymcbobface","timestamp":1600186330,"content":"> 4 hours ago, Alonewolf87 said:\n> \n> Combat phase: deal shadow cards (only to Raid Leader and Southron Soldier); Flagship goes undefended (5 damage to Narelenya for 9 total); Infiltrator goes undefended (no shadow, 3 damage to Cirdan); Elrohir defends Marauder (2 damage from its effect to Arwen, no shadow no damage); Gildor defends Southron Soldier (shadow is Taking on Water, no damage); exhaust Cirdan and Narya to ready and boost Elrohir and Gildor; Elrohir defends Raid Leader (shadow is Coast of Anfalas, no damage); discard A Test of Will to ready Glorfindel; Galdor, Gildor, Elladan, Glorfindel, Narelenya and Skirmisher attack and destroy Flagship (24 attack against 3 defense, 21 damage) adding it to the victory display and winning the game\n\n@Alonewolf87 [https://community.fantasyflightgames.com/profile/329691-alonewolf87/] You do know Raider Flagship says, \"Only Ship objectives can be declared as attackers against Raider Flagship.\" Correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988582","commentId":3988582,"userName":"Alonewolf87","timestamp":1600187110,"content":"> 15 minutes ago, Bobbymcbobface said:\n> \n> You do know Raider Flagship says, \"Only Ship objectives can be declared as attackers against Raider Flagship.\" Correct?\n\nDang totally missed that, thanks for pointing that out. I guess then I would have taken less undefended attacks that turn, uber quested the next turn and still won with the other winning condition (the staging area was empty and there was only 1 Ship in play, worst case 2 if I revelead another, so I would have needed only 10-15 progress tokens). I would totally need to recalculate the final score though.\n\nIf @dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/] thinks I should play the quest again no problem for me.\n\nEdited September 15 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988764","commentId":3988764,"userName":"dalestephenson","timestamp":1600207128,"content":"Score doesn't matter at all, only tokens.  If you had reached the point where winning was guaranteed if you had played the rules correctly, there's no need to replay; but if there's any doubt you would've won you should replay from the beginning with the same number of tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988912","commentId":3988912,"userName":"Miceldars","timestamp":1600236582,"content":"There's too many things to think in this game, I often miss something at some point, and when I see it, I just say \"well, let's say I did that\" just because I don't want to restart from the beginning"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3988925","commentId":3988925,"userName":"Alonewolf87","timestamp":1600241265,"content":"> 9 hours ago, dalestephenson said:\n> \n> Score doesn't matter at all, only tokens.  If you had reached the point where winning was guaranteed if you had played the rules correctly, there's no need to replay; but if there's any doubt you would've won you should replay from the beginning with the same number of tokens.\n\nI tried to look at all the possible cards in the encounter deck and not even one would have resulted in me being unable to quest more than enough to win the following turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3994636","commentId":3994636,"userName":"General_Grievous","timestamp":1601246136,"content":"So knowing that there are nasty ship enemies I figured I could try to avoid them using Firyal’s MOTK trickiness. And it sure worked, unfortunately Raid on the Grey Havens was a really rough go for me so I ended up with 3 tokens for that quest and overall. Great fun to revisit my favorite cycle though!\n \n\nRaid on the Grey Havens\n\nFirst try I got quite a ways in before too many ships were set aflame. My second attempt with one token I drew two raid leaders in the first and second rounds and was subsequently annihilated shortly after. My third attempt with three tokens was a much more even game where I was able to fully utilize my doomed card strategy and managed to use a Word of Command to summon Helm of Secrecy and swap Saruman for Aragorn to drop my threat from 49 to 31 last round and win the game using my horde of Ents. \n\n \n\nThe Drowned Ruins\n\nThe second quest went substantially better being able to fully utilize my deck’s strategy, finding and playing all of the doomed cards with Saruman’s staff reducing the threat raise. I alternated playing allies every other round to work around the underwater locations and then right before the final round I used a Word of Command to summon Helm of Secrecy and drop my threat from 48 back to 31 which helped with the massive threat increases in the final phase of the quest. But by that point I had a horde of Ents ripping the grotto open and I was able to escape easily. 0 tokens used.\n\n \n\nStorm on Cobas Haven\n\nHere my Firyal strategy really paid off, I managed to avoid a total of 3 Warships by discarding them and taking my chances with the next card which ended up always being friendly locations or treacheries I could deal with. Smooth sailing and an easy final win. 0 tokens\n\n \n\nTotal tokens 3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3994752","commentId":3994752,"userName":"Thanee","timestamp":1601277952,"content":"First attempt against Cobas Haven didn't go so well. Lots and lots of big ship enemies and only very few allies early on. The second one worked well, though. The first stage took a while, but I had a Cobas Haven as the active location for two or three rounds, which allowed me to engage some of the ships without crew. Glorfindel was discarded twice and brought back from the discard to take over the two Corsair Skirmishers. At that point, there wasn't much in the way and the heroes sailed on towards victory.\n\nBye\nThanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3998198","commentId":3998198,"userName":"Alonewolf87","timestamp":1601988820,"content":"I guess Dale is still wrapped up in the whole moving business, since we have no news about this League roundup or the next one setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3998262","commentId":3998262,"userName":"General_Grievous","timestamp":1601998129,"content":"Sounds like it, I suppose we could post up the next one if Dale is busy. I just have no idea how to set up a google excel spreadsheet like that if any of you guys do?\n\n Looks like you managed to rock last month A Lone Wolf, so you get to pick next cycle. Thanee coming in second gets to choose a quest to play, and I get to exclude one. Bobby gets to pick the accompanying cycle for player cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3998275","commentId":3998275,"userName":"nbonnem","timestamp":1602001047,"content":"I plan to be playing in the league for the first time this month (October).  I did some digging to see what the restrictions would be and would like to confirm I am correct:\n\nOctober League:\n\nMandatory heroes (pick at least one): Erestor, Amarthiul, Arwen\n\nQuest gauntlet: Carn Dum, Treachury of Rhudar, Dread Realm\n\n \n\nDeluxe/Cycle for cards (for tiebreaker purposes): The Lost Realms/Angmar Awakened\n\nSupplemental Cycle (for tiebreaker purposes): Haradrim cycle\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3998640","commentId":3998640,"userName":"Alonewolf87","timestamp":1602080513,"content":"> 22 hours ago, General_Grievous said:\n> \n> Sounds like it, I suppose we could post up the next one if Dale is busy. I just have no idea how to set up a google excel spreadsheet like that if any of you guys do?\n> \n>  Looks like you managed to rock last month A Lone Wolf, so you get to pick next cycle. Thanee coming in second gets to choose a quest to play, and I get to exclude one. Bobby gets to pick the accompanying cycle for player cards. \n\nI created a page for the October Solo League, I hope Dale will forgive my insolence :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] and that I did everything correctly.\n\nI think I will pick Wilds of Rhovanion/Ered Mithrin. I will tag @Thanee [https://community.fantasyflightgames.com/profile/184196-thanee/] and @Bobbymcbobface [https://community.fantasyflightgames.com/profile/341691-bobbymcbobface/] to hear about their choices"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3998695","commentId":3998695,"userName":"Bobbymcbobface","timestamp":1602087505,"content":"Let's do Shadows of Mirkwood for supplemental cycle"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=3999008","commentId":3999008,"userName":"General_Grievous","timestamp":1602134745,"content":"I think Thanee is more so on Board Game Geek forum so may want to post/share there as well if you have an account. I’ll exclude Roam Across Rhovanion if it’s not picked as one to play so we up our odds of Dragon combat haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=4000027","commentId":4000027,"userName":"Thanee","timestamp":1602413820,"content":"I also check in here, occasionally. Let's pick Journey Up the Anduin as one of the quests.\n\nBye\nThanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=4000034","commentId":4000034,"userName":"Thanee","timestamp":1602415475,"content":"Final standings:\n\n0 Alonewolf87 (31)\n1 Thanee (30)\n3 General_Grievous (28)\n16 Bobbymcbobface (0)\n\nAlonewolf87 wins the league and can choose a cycle for November's league. Thanee finishes second and can choose a quest to play from that cycle. General_Grievous finishes third, and can choose a quest to exclude from that cycle. Bobbymcbobface finishes last, and gets to choose a supplemental cycle for player cards.\n\nJoin us in October for another trip to Angmar, as we play The Treachery of Rhudaur, The Battle of Carn Dûm, and The Dread Realm with the help of some friendly Haradrim.\n\nThank you for playing!\n \n\n----------------------------------------\n\n\nAlonewolf87 picked Ered Mithrin as the cycle for November's solo league.\nThanee picked Journey Up the Anduin as one of the quests.\nGeneral_Grievous picked Roam Across Rhovanion to be excluded.\nBobbymcbobface picked Shadows of Mirkwood as the supplemental cycle.\n\nBye\nThanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=4000094","commentId":4000094,"userName":"Alonewolf87","timestamp":1602432136,"content":"> 4 hours ago, Thanee said:\n> \n> Alonewolf87 picked Ered Mithrin as the cycle for November's solo league.\n> Thanee picked Journey Up the Anduin as one of the quests.\n> General_Grievous picked Roam Across Rhovanion to be excluded.\n> Bobbymcbobface picked Shadows of Mirkwood as the supplemental cycle.\n\nRNG chooses Fire in the Night and The Fate of Wilderland for the other two quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=4000998","commentId":4000998,"userName":"General_Grievous","timestamp":1602652772,"content":"> On 10/11/2020 at 10:02 AM, Alonewolf87 said:\n> \n> RNG chooses Fire in the Night and The Fate of Wilderland for the other two quests.\n\nNice! Great quests!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/311124-solo-league-25-ghdreamchaser-with-voiringmaker-player-cards/?do=findComment&comment=4001498","commentId":4001498,"userName":"Thanee","timestamp":1602780478,"content":"Only thing is, that we had those two also the last time we had that cycle, but that's RNG for you. 🙂\n\nBye\nThanee"}]}