{"url":"https://community.fantasyflightgames.com/topic/311361-negative-values/","title":"Negative values?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/311361-negative-values/?do=findComment&comment=3991100","commentId":3991100,"userName":"player4190410","timestamp":1600643153,"content":"Can values go below zero into negatives? And if so, how do negative values affect the game? \n\nTwo potential examples: \n\n1) I play \"Bartering\", and take an attachment card with a cost of 2 back into my hand. I then play an attachment card with a printed cost of 1. I reduce the printed cost of 1 by 2, which results in a cost of -1. \n\nIf there are no negative values in the game, then I simply play the new attachment for free. If there are negative values in the game, do I play the new attachment and add a resource to a Hero's pool? (If a card is paid for by returning the resources required to the resource bank, then a negative cost would be returning -1 resources to the resource bank; I.E. returning a resource to a Hero's pool...?)\n\n2) Marsh Adder is engaged with another player. I use Bard the Bowman's card effect, which gives the target enemy -2 defence when making a Ranged attack. Marsh Adder has a printed defence value of 1, so reducing his defence by 2 defence results in -1 defence. \n\nIf there are no negative values in the game, then I simply treat Marsh Adder as if it had 0 defence. If there are negative values in the game, then would I treat Bard the Bowman as having 4 attack (instead of his printed 3 attack) and treat Marsh Adder as having 0 defence? Or would I deal 1 damage to Marsh Adder before I resolve Bard the Bowman's attack, as Marsh Adder's defence is -1?\n\n \n\nThere are other potential cases, and I suspect it depends on what scenario/deck you are playing, but I'm asking about standing rules not special circumstances. \n\n.... I might also add I am quite proud of myself for asking such a technical question XD "},{"commentUrl":"https://community.fantasyflightgames.com/topic/311361-negative-values/?do=findComment&comment=3991111","commentId":3991111,"userName":"stimpaksam","timestamp":1600645606,"content":"There are no negative values. In your examples the values would just be reduced to 0."},{"commentUrl":"https://community.fantasyflightgames.com/topic/311361-negative-values/?do=findComment&comment=3991138","commentId":3991138,"userName":"sappidus","timestamp":1600655292,"content":"Source: RR Modifiers [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule553]…\n\n> Quote\n> \n> After all active modifiers have been taken into account, if a value is below 0, it is treated as 0: a card cannot have \"negative\" icons, attributes, traits, cost, or keywords.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/311361-negative-values/?do=findComment&comment=3991145","commentId":3991145,"userName":"player4190410","timestamp":1600659897,"content":"Thanks-that's what I suspected, but I thought I'd check\n\n> 1 hour ago, sappidus said:\n> \n> Source: RR Modifiers [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule553]…\n\nThat's a really great source! I'll definitely poke around there a little more! "}]}