{"url":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/","title":"If the Game Had Lasted One More Year...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4005906","commentId":4005906,"userName":"Felswrath","timestamp":1603653834,"content":"I won't deny that we are incredibly blessed the game lasted as long as it did, apparently for a few years beyond the initial plan. But had the game lasted one more year what would you have liked to see? Perhaps Cycle 10? Or maybe a 10 Year Anniversary Set?\n\nFor me, I'd have chosen ideally that the Vengeance of Mordor Cycle be split into two. One would be set in Rhun, and then the final cycle would be set entirely in Mordor.\n\nThen for the 10th Anniversary, and the Final Product, it would have been nice to have Shire Set for $60. It could come with the Scouring of the Shire, and a light hearted mini-campaign in the Shire complete with chasing young hobbits away from Farmer Maggot's crops and similar mundane tasks that would serve as a stark contrast to the darkness of the Mordor Cycle. It would be nice to see New versions of Sam and Fatty. There could also be some nice loot like a Play Mat that resembled Biblo's desk with an open book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4005976","commentId":4005976,"userName":"JusticeLizard","timestamp":1603669327,"content":"There is plenty I would like to have seen. A second Sam hero has been a wish of mine for a while. There is really only one thing, however, that makes me feel like the game was left incomplete. The final nightmare scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4006068","commentId":4006068,"userName":"TrueLolzor","timestamp":1603699872,"content":"Yeah, stopping producing nightmare halfway through is weird.\n\nEdited October 26 by TrueLolzor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4006142","commentId":4006142,"userName":"Zura","timestamp":1603718122,"content":"I really only feel like we're missing another Gandalf hero - Gandalf the White version. I'm kind of sad they never grasped this opportunity, especially in the Mountain of Fire box - they could have done him instead of Tom Cotton or 2nd Eomer. Another Sam would also be nice, but this is the weirdest thing to ommit in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4006552","commentId":4006552,"userName":"TwiceBorn","timestamp":1603754444,"content":"> 23 hours ago, JusticeLizard said:\n> \n>  There is really only one thing, however, that makes me feel like the game was left incomplete. The final nightmare scenarios.\n\nEspecially not doing the NM decks for Flame of the West and The Mountain of Fire... could they not at least have finished the saga?\n\nEdited October 26 by TwiceBorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4006820","commentId":4006820,"userName":"Crusaderlord","timestamp":1603812257,"content":"The nightmare scenarios were ambitious by aiming to rework every quest, and i expect the development time and costs eventually outweighted potential sales. It would have been far better to just rework say every deluxe box and saga set than all the quests, but hindsight is a great thing. \n\nI only have a few nightmare scenarios and dont mind missing out of those but In the UK i still have never managed to get Mountains of Fire - the stock on that one just never got going anywhere that i remember and i have been looking for a long time - such a strange one to not get any stock for but again i am guessing by the end they reduced their production numbers so not many went abroad. \n\nAlso what happened to the scenario kits - Mines of Moria and Escape from Khazad Dum - i have had that on pre-order in UK for months since it was first announced and it still has not ever got to stock anywhere in the UK.\n\nSo i am more concerned about getting actual missing packs than any individual cards that may not have been fully covered within the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4006967","commentId":4006967,"userName":"David&amp;Anna","timestamp":1603825818,"content":"Pretty sure the Mines of Moria and Khazad Dum are due out next week in the UK according to the UK distributor’s website. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/312116-if-the-game-had-lasted-one-more-year/?do=findComment&comment=4007997","commentId":4007997,"userName":"Thanatopsis","timestamp":1604004495,"content":"Game is not over yet. We have a standalone scenario due out in December. Maybe, just maybe FFG will announce another product around that time.\n\nAlso, Caleb Grace in a recent episode of CotR argued that the game is already ten years old since it debuted at GenCon 2010 at a demo.\n\n "}]}