{"url":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/","title":"New Moria packs. - packaging!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/?do=findComment&comment=4008883","commentId":4008883,"userName":"Andyh19","timestamp":1604155637,"content":"Are FFG serious with these. i got the delivery and thought it was a different order based on size of packing. The plastic boxes are just slightly smaller than my 10inch tablet and each include 80 or so cards with 3 (approx) postcard sized info cards included,  You could use them as rattles if pushed as the cards although \"taped\" are free to rattle round.. I have a bug bear about packaging that makes it look like you are getting more than you really do. But this one is really head shaking. If you saw them on the shelf you'd think you were getting something maybe halfway to a deluxe box, you're not. You're getting just over a normal expansion pack. I'm even starting to think about not throwing that much plastic into the recycling after having them in hand for 15 seconds or so to open and trying to find a use for them. I may end up using them to store the scenarios as the info cards won't fit any normal storage box. why they didn't just print the info on their normal paper leaflet and use their standard size packing is really beyond me on this one.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/?do=findComment&comment=4008969","commentId":4008969,"userName":"TwiceBorn","timestamp":1604176640,"content":"I agree 100%. \n\nIt's the same reason I was disappointed with the shift from cardboard tuck boxes to plastic clamshells for the adventure packs.\n\nSo much waste."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/?do=findComment&comment=4009087","commentId":4009087,"userName":"Andyh19","timestamp":1604228640,"content":"> 14 hours ago, TwiceBorn said:\n> \n> I agree 100%. \n> \n> It's the same reason I was disappointed with the shift from cardboard tuck boxes to plastic clamshells for the adventure packs.\n> \n> So much waste.\n\nI didn't like this change myself. I always kept the cardboard boxes to be used as long term storage for the game if I stopped playing it, as in the case of Star Wars LCG, but the shift to plastic made this pointless.  The artwork on the old cardboard made this a pretty good option for storage. I also know from a comment made that one of the senior FFG staff at the time didn't like the change either.\n\n \n\nI've got one more pack to buy for LoTR, number 6 in the vengeance cycle, and that will be it for this game, unless the nightmare decks become more readily available in the UK. So that's at least one less bit of plastic that goes in the bin within minutes of being opened."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/?do=findComment&comment=4009317","commentId":4009317,"userName":"TwiceBorn","timestamp":1604276508,"content":"All I have left to acquire is Vengeance of Mordor (still not available in Canada, and I had to order Land of Sorrow from the US) and Hunt for the Dreadnaught. I acquired most of the Nightmare packs over the summer, and I'm glad I acted when I did, as I suspected that they would soon become difficult if not impossible to acquire and that future reprints would not be assured."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/?do=findComment&comment=4010068","commentId":4010068,"userName":"Crusaderlord","timestamp":1604405106,"content":"If i sleeve all the cards then the size of the Moria plastic packaging is just about right to fit them all in and still close it - so i do not personally have an issue with the size to be honest\n\nHowever i do have an issue with the switch from cardboard to plastic clamshells - in a world where we are supposed to be more environmentally aware and reduce pollution this must be one of the worst decisions. The fact that i preferred the cardboard packs anyway still pales with the fact that we are now throwing a load more gaming plastic away - it is a ridiculous move and they should have been moving away from plastic not embracing it !   \n\nI realise not everyone on an individual level is plastic conscious, but the fact is that the world is slowly coming to think that we should act , FFG as a company fell short of their role in this sadly. That said i notice that some of their newer products are looking more cardboard based again which may show they now conceded they made a mistake.\n\nEdited November 3 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/?do=findComment&comment=4016297","commentId":4016297,"userName":"BillK62","timestamp":1605731592,"content":"(post deleted - argumentative)\n\nEdited November 18 by BillK62"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312258-new-moria-packs-packaging/?do=findComment&comment=4017315","commentId":4017315,"userName":"Bobbymcbobface","timestamp":1605845751,"content":"> On 10/31/2020 at 9:47 AM, Andyh19 said:\n> \n> If you saw them on the shelf you'd think you were getting something maybe halfway to a deluxe box, you're not. You're getting just over a normal expansion pack.\n\nTo be honest, 80 cards IS more than half of the latest deluxe boxes at 156 cards. But for sure, the packaging is deceiving."}]}