{"url":"https://community.fantasyflightgames.com/topic/312250-jungle-trail/","title":"Jungle Trail","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/312250-jungle-trail/?do=findComment&comment=4008759","commentId":4008759,"userName":"TwiceBorn","timestamp":1604119731,"content":"Jungle Trail [http://hallofbeorn.com/LotR/Details/Jungle-Trail-TSoH]has the following text: \n\nTravel: Reveal the top card of the encounter deck to travel here. \n\nAfter I reveal the top card of the encounter deck, am I obligated to travel, or can I change my mind?\n\nI revealed a Territorial Ape [http://hallofbeorn.com/LotR/Details/Territorial-Ape-TMk] from the top of the encounter deck and no longer want to pursue my travel plans along the Jungle Trail, as the ape would end up with an attack strength of 7 if I did (due to Overgrown [http://hallofbeorn.com/LotR/Details/Overgrown-TSoH] being attached to Jungle Trail) and I have no one to chump block with. \n\nThanks in advance for your thoughts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312250-jungle-trail/?do=findComment&comment=4008766","commentId":4008766,"userName":"stimpaksam","timestamp":1604121725,"content":"> 33 minutes ago, TwiceBorn said:\n> \n> ...or can I change my mind\n\nI'm afraid not. Once you commit to paying the Travel cost you must then travel there. This looks like just another one of those evil encounter combos. There is an action window after traveling where you can swap the active location with one that has lower threat using cards like Thror's Map or Distant Stars."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312250-jungle-trail/?do=findComment&comment=4008784","commentId":4008784,"userName":"TwiceBorn","timestamp":1604131305,"content":"Thanks for the reply, stimpaksam.\n\nI suspected that would be the answer, but was in denial and played on as if I had the choice, else it was essentially game over.\n\nIt ended up being a 20 round epic, with the worst player card draw I've had in a long time (Beravor had to defend against a Strangling Python [http://hallofbeorn.com/LotR/Details/Strangling-Python-TMk] in round 1 and had been incapacitated the full 20 rounds, as throughout the whole game I never managed to draw a Miner of the Iron Hills to free her from the snake... or even a Master of the Forge who could help me weed out attachments to get to a miner faster). The Imladris Stargazers in my second deck didn't show up until late.\n\nBut as I feared, we've now confirmed that my valiant efforts and victory against all odds (with both decks reaching threat 48) were fraudulent... 😪\n\n<Sigh>...\n\nOn a brighter note, this wasn't my first go at The Mumakil, I've beaten it several times before, but had not previously come across the situation described above.\n\nEdited October 31 by TwiceBorn"}]}