{"url":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/","title":"Solo League 28 - Voice of Isengard/Ring-maker with HoN/Against the Shadow cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4023111","commentId":4023111,"userName":"Alonewolf87","timestamp":1606847834,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from The Voice of Isengard and The Ringmaker. The quests are:\n\n1) To Catch an Orc\n2) The Dunland Trap\n3) Celebrimbor's Secret\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests. This means that you must have at least one of Tactics Eomer, Grima, Celeborn and Galadriel\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource. This can be done *anytime* during setup.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Into the Pit and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Foundations of Stone it does not matter how many tokens I needed to defeat Road to Rivendell.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker). You are required to reveal which Heroes you used, and how many cards in your deck came from outside The Lost Realm/Angmar Awakened, SoH/Haradrim and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\nNote: Contracts (from the most recent cycle) are not part of the deck and should not be counted. A Loot Deck (from the Burglar's turn contract) is also not part of the deck and should not be counted. The One Ring or the Messenger of the King ally/hero should also not be counted *unless* your deck uses those cards to reach 50 -- the Master card fetched by the One Ring should be counted. You may follow contract/One Ring setup instructions at the same as hero setup, ignoring Caleb's ruling.\n\n5) Tiebreakers have frequently mattered in this league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from The Voice of Isengard/The Ring-Maker, HoN/Against the Shadow or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from The Voice of Isengard/The Ring-Maker and HoN/Against the Shadow. More is better.\n\n3rd) The number of heroes used from this list: Tactics Eomer, Grima, Celeborn and Galadriel. More is better.\n\n4th) The number of cards in the deck outside The Voice of Isengard/The Ring-Maker and HoN/Against the Shadow. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside The Voice of Isengard, The Dunland Trap and Celebrimbor's Secret. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in November's Solo League (if you didn't play or finish Novemberr's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for February's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in February's league.\n\n7) Weekly deadlines will at 11:59pm Eastern on the 14th, 21st, and 28th. Only the final deadline really matters for scoring and cannot be extended -- the first two deadlines are only to be included in intermediate standings.\n\nTo Catch an Orc: December 14th\nThe Dunland Trap: December 21st\nCelebrimbor's Secret: December 28th\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1zCBGP_y9pGYW6YHsfSoQM749xb1CFFdvlO3cNn_NcdM/edit#gid=0 [https://docs.google.com/spreadsheets/d/1zCBGP_y9pGYW6YHsfSoQM749xb1CFFdvlO3cNn_NcdM/edit#gid=0]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results, but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4024353","commentId":4024353,"userName":"Alonewolf87","timestamp":1607020678,"content":"I had my worries about how the mechanics of To Catch An Orc might broke the combo of my Silvan Deck but luckily I had one copy of Host of Galadhrim in my hand at the start of the game, and another Host of Galahdrim with 2 copies of Galadhrim Weaver in what was left of my deck. My thinned down deck thus worked on my favor and soon the combo was firing off and I steamrolled the quest even though it took quite some time to find Mugash. 0 Valar Tokens\n\nHere is the usual playthrough (quite long Planning Phases with this deck)\n\n\n\nTo Catch an Orc\n\n \n\nOpening Hand (after mulligan): Unlikely Friendship, O Lorien, Host of Galadhrim, We Are not Idle, Galadhrim Minster, Galadriel's Handmaiden\n\n \n\nSetup: set aside 20 cards of my deck in a secondary deck and shuffle Mugash in the secondary deck, search and add Methedras to the staging area, advance to Stage 2 (2 Time Counters)\n\n \n\nTurn 1 (27 Starting Threat)\n\nDraw: Deep Knowledge\n\nPlanning Phase: play Deep Knowledge (draw A Test of Will and Galadhrim Weaver) TD 29; play Unlikely Friendship (add 1 resource to Galadriel's pool, draw Feigned Voices); play We Are Not Idle for 0 (draw Steward of Gondor); exhaust Galadriel (TD 28, draw Woodland Courier); move 1 resource from Galadriel's pool to Bifur's pool; play Galadhrim Minstrel (add Peace and Thought to the hand) ; resources left Bifur (0), Celeborn (1), Galadriel (1)\n\nQuest Phase: send Bifur, Celeborn and Minstrel to the quest; reveal Orc Hunting Party (no effect) surges into Prowling Wolf; 7 Willpower against 5 Threat; 2 progress on stage 2 (canceled, add 1 Time Counter for 3 total)\n\nTravel phase: travel to Methedras\n\nEngagement phase: Prowling Wolf engages\n\nCombat phase: deal Shadow Card; Minstrel defends Prowling Wolf (shadow is Orc Territory, no effect, 1 Attack against 1 Defense, no damage);\n\nRefresh Phase/End of Round: TD 29, 2 Time Counters\n\n \n\nTurn 2\n\nDraw: Deep Knowledge\n\nPlanning Phase: play Deep Knowledge (TD 31, draw 2nd Handmaiden and 2nd Peace and Thought); exhaust Galadriel (TD 30, draw Legacy of Numenor); play Legacy of Numenor (TD 34, add 1 resource to each hero's pool); play Steward of Gondor and O Lorien on Galadriel; exhaust Steward of Gondor to add 2 resources to Galadriel's pool; exhaust O Lorien and play 1st Handmaiden for 1 (TD 33); play 2nd Handmaiden (TD 32); resources left Bifur (2), Celeborn (0), Galadriel (2)\n\nQuest Phase: send Bifur, Minstrel and both Handmaidens to the quest; reveal Mugash's Lair; 9 Willpower against 5 threat; 4 progress, 3 to clear methedras (Search 3, add Henamarth Riversong to my hand, discard The Seeing Stone and Daeron's Runes), 1 on Stage 2 (canceled, add 1 Time Counter for 3 total)\n\nTravel phase: travel to Mugash's Lair\n\nEngagement phase: reveal top card of the secondary deck (Legacy of Numenor, discard it)\n\nCombat phase: deal Shadow Card; play Feigned Voices and return Minstrel to hand to block Prowling Wolf attack; Celeborn and both Handmaidens attack and destroy Prowling Wolf;\n\nRefresh Phase/End of Round: TD 33, 2 Time Counters\n\n \n\nTurn 3\n\nDraw: 2nd Minstrel\n\nPlanning Phase; exhaust: Steward of Gondor to add 2 resources to Galadriel's pool; exhaust Galadriel (TD 32, draw Unlikely Friendship; play Unlikely Friendship (add 1 resource to Bifur's pool, draw 2nd Weaver); play 1st Minstrel (add 2nd Host of Galadhrim to hand); exhaust O Lorien to play 2nd Minstrel for 1 (add Feigned Voices to hand); play Henamarth Riversong, exhaust Henamart to look at the top card of the encounter deck (Orc Skirmisher); play 1st Weaver (shuffle Unlikely Friendship back in the deck), play 1st Host of Galadhrim playing again Weaver (shuffling Feigned Voices back in the deck), both Minstrels (add Unlikely Friendship and 2nd Feigned Voices to the hand), both Handmaidens (TD 30) and Henamarth; resources left Bifur (0), Celeborn (0), Galadriel (1)\n\nQuest Phase: send Weaver, Henamarth, both Handmaidens and both Minstrels to the quest; reveal Orc Skirmisher; 14 Willpower against 3 Threat, 11 progress, 2 to clear Mugash's Lair, 9 on Stage 2 (canceled, add 1 Time Counter for 3 total)\n\nTravel phase: nothing\n\nEngagement phase: engage Orc Skirmisher (remove 1 Time Counter, down to 2 total)\n\nCombat phase: deal Shadow Card; play 1st Feigned Voices on Orc Skirmisher; Bifur, Celeborn and all the allies destroy the Skirmisher\n\nRefresh Phase/End of Round: TD 31, 1 Time Counter\n\n \n\nTurn 4\n\nDraw: The Tree People\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resource to Galadriel's pool; play Unlikely Friendship (draw Orophin add 1 resource to Celeborn's pool); exhaust Galadriel (TD 30, draw 2nd The Tree People); play 2nd Weaver (shuffle Unlikely Friendship in the deck); exhaust Henamarth Riversong to look at the top card of the encounter deck (Orc Hound); play 2nd Host of Galadhrim playing again both Weavers (shuffling Feigned Voices and 1st Host of Galadhrim back in the deck), both Minstrels (add Unlikely Friendship and 1st Host of Galadhrim to the hand), both Handmaidens (TD 28) and Henamarth; resources left Bifur (0), Celeborn (1), Galadriel (1)\n\nQuest Phase: send both Weavers, both Minstrels, both Handmaidens and Henamarth to the quest; reveal Orc Hound, surges into Orc Cave; 16 Willpower against 4 Threat, 12 progress on Stage 2 (canceled, add 1 Time Counter for 2 total)\n\nTravel phase: travel to Orc Cave (discard Prowling Wolf)\n\nEngagement phase: engage Orc Hound (exhaust Henamarth Riversong)\n\nCombat phase: deal Shadow Card; Celeborn defends Orc Hound (shadow is Orc Hunter, additional attack, 2 Attack against 2 Defense, no damage); Bifur defends Orc Hound additional attack (shadow is methedras Orc, 2 Attack against 2 Defense, no damage); play The Tree People on Henamarth putting Galadhrim Healer in play; all the allies attack and destroy Orc Hound\n\nRefresh Phase/End of Round: TD 29, 1 Time Counter\n\n \n\nTurn 5\n\nDraw: 2nd Feigned Voices\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resources to Galadriel's pool; play Henamarth Riversong; exhaust O Lorien to play Woodland Courier for 1 (place 1 progress on Orc Cave); exhaust Henamarth to look at the top card of the encounter deck (methedras); play 1st Host of Galadhrim playing again both Weavers (shuffling 1st The Tree People and 2nd Host of Galadhrim back in the deck), both Minstrels (adding 2nd Host of Galadhrim and 1st The Tree People to the hand), both Handmaidens (TD 27), Woodland Courier (add 1 progress on Orc Cave), Healer and Henamarth; resources left Bifur (0), Celeborn (0), Galadriel (1)\n\nQuest Phase: send all the allies to the quest; reveal methedras; 20 Willpower against 2 Threat, 18 progress, 2 to clear Orc Cave (search 5, add 3rd Handmaiden to hand, discard Legacy of Numenor, Galion, We Are not Idle, 3rd The Tree People), 16 on Stage 2 (canceled, add 1 Time Counter for 2 total)\n\nTravel phase: travel to methedras; exhaust Galadriel (totally forgot, TD 26, draw 3rd Minstrel)\n\nEngagement phase: nothing\n\nCombat phase: nothing\n\nRefresh Phase/End of Round: TD 27, 1 Time Counter\n\n \n\nTurn 6\n\nDraw: 2nd Unlikely Friendship\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resources to Galadriel's pool; exhaust Henamarth Riversong to look at the top card of the encounter deck (Orc Hunter); exhaust O Lorien to play 3rd Handmaiden for 1 (TD 26); exhaust Galadriel (TD 25, Deep Knowledge); play 2nd Host of Galadhrim playing again both Weavers (shuffling 3rd The Tree People and We Are not Idle back in the deck), both Minstrels (adding 3rd The Tree People and We Are Not Idle to the hand), 3 Handmaidens (TD 22), Woodland Courier (add 1 progress on methedras), Healer and Henamarth; resources left Bifur (0), Celeborn (0), Galadriel (1)\n\nQuest Phase: send all the allies to the quest; reveal Orc Hunter and choose to reveal another encounter card, reveal Orc Territory (get back another methedras from the discard pile); 24 Willpower against 5 Threat; 19 progress, 2 to clear methedras (Search 3, add Mugash to the staging area, add 3rd Weaver to my hand, discard Daeron's Runes) 17 on stage 2 and advance to stage 3 since Mugash is finally in play (3 Time Counters on Stage 3)\n\nTravel phase: travel to Methedras\n\nEngagement phase: engage Mugash\n\nCombat phase: add Shadow Card; play Feigned Voices on Mugash (return 2nd Weaver to hand), everyone except Bifur attacks Mugash (13 Attack against 4 Defense, 9 damage) exhaust Bifur and attack Mugash to it\n\nRefresh Phase/End of Round: TD 23, 2 Time Counters\n\n \n\nTurn 7\n\nDraw: The Seeing Stone (deck empty)\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resources to Galadriel's pool; exhaust Henamarth to look at the top card of the encounter deck (Methedras Orc); play 2nd and 3rd Weaver (shuffling Feigned Voices and Daeron's Runes in the deck); play 1st Host of Galadhrim playing again 3 Weavers (shuffling 2nd Host of Galadhrim, Galion and Legacy of Numenor in the deck), both Minstrels (adding 2nd Host of Galadhrim and Feigned Voices to the hand), 3 Handmaidens (TD 20), Woodland Courier (add 1 progress on Methedras), Healer and Henamarth; exhaust Galadriel (TD 19, draw Galion); play Galion; resources left Bifur (0), Celeborn (0), Galadriel (0)\n\nQuest Phase: send Celeborn and all the allies to the quest; reveal Methedras Orc; 30 Willpower against 5 Threat; 25 progress, 2 to clear Methedras, 23 to clear stage 3 winning the game\n\n \n\nFinal Score = 6 completed rounds (x10) + 19 Threat = 79 points\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4024881","commentId":4024881,"userName":"Alonewolf87","timestamp":1607103187,"content":"The Dunland Trap was another quest that worried me due to its particular mechanics. I rushed through Stage 1 to get ahead with my allies army's destruction so that I could rebuilt it again. This ended up having me hover over 45 Threat for a long time due to having to use again all the Doomed events but I was still able to score a first attempt victory, with Henamarth Riversong being a clear MVP. 0 Valar Tokens again.\n\nHere is the usual playthrough\n\n\n\nThe Dunland Trap\n\n \n\nOpening Hand (after Mulligan): Legacy of Numenor, Galadhrim Minstrel, Nenya, Feigned Voices, Unlikely Friendship, Deep Knowledge\n\n \n\nSetup: make Old South Road the active location, put Boar Clan Warrior in play engaged with me, 2 Time Counters on the quest\n\n \n\nTurn 1 (27 Starting Threat)\n\nDraw: Peace and Thought\n\nPlanning Phase: play Deep Knowledge (TD 29, draw Galadriel's Handmaiden and Daeron's Runes), deal 1 shadow card to Boar Clan Warrior); play Daeron's Runes (draw 2nd Handmaiden and 2nd Minstrel, discard 2nd Handmaiden, deal 1 shadow card to Boar Clan Warrior for 2 total); play Unlikely Friendship (draw A Test of Will, add 1 resource to Bifur's pool, deal 1 shadow card to Boar Clan Warrior for 3 total) play Legacy of Numenor (TD 33, add 1 resource to each hero's pool); move 1 resource from Celeborn's pool to Bifur's pool; play 1st Minstrel (add 2nd Deep Knowledge to my hand): play 2nd Deep Knowledge (TD 35, draw Wooland Courier and Galadhrim Weaver, deal 1 shadow card to Boar Clan Warrior for 4 total); play 2nd Minstrel (add 2nd Legacy of Numenor to my hand); play Galadhrim Weaver (shuffle 2nd Deep Knowledge in the deck) play 2nd Legacy of Numenor (TD 39, add 1 resource to each hero's pool); play Nenya on Galadriel with 1 resource from Celeborn's pool; play Galadriel's Handmaiden (TD 38); resources left Bifur (1), Celeborn (1), Galadriel (0)\n\nQuest Phase: send Bifur, both Minstrels, Handmaiden and Weaver to the quest; reveal Hills of Dunland; exhaust Galadriel and Nenya to add Galadriel's Willpower to Bifur's; 15 Willpower against 2 Threat; 13 progress, 4 to clear Old South Road (add it to the victory display), 9 on Stage 1\n\nTravel phase: travel to Hills of Dunland (draw 2nd Weaver, deal 1 shadow card to Boar Clan Warrior for 5 total)\n\nEngagement phase: nothing\n\nCombat phase: deal Shadow Card (for 6 shadow cards total on Boar Clan Warrior); play Feigned Voices (returning 1st Weaver to hand) on Boar Clan Warrior; Celeborn, both Minstrels and Handmaiden attack and destroy Boar Clan Warrior (2+1+1+1 Attack against 1 Defense, 4 damage)\n\nRefresh Phase/End of Round: TD 39; play Peace and Thought exhausting Bifur and Celeborn (draw We Are Not Idle, Steward of Gondor, 2nd We Are Not Idle, O Lorien, Henamarth Riversong), 1 Time Counter\n\n \n\nTurn 2\n\nDraw: 3rd We Are Not Idle (!!!)\n\nPlanning Phase: play Henamarth Riversong; exhaust Henamarth Riversong to look at the top card of the encounter deck (Dunlending Ambush); play 1st We Are Not Idle for 0 (draw 3rd Minstrel), play 2nd We Are Not Idle for 0 (draw 2nd Test of Will); play 3rd We Are Not Idle for 0 (draw 2nd Daeron's Runes); play 2nd Daeron's Runes (draw 2nd The Tree People and 3rd Daeron's Runes, discard 2nd The Tree People); play 3rd Daeron's Runes (draw 2nd Handmaiden and The Seeing-Stone, discard 3rd Minstrel); play The Seeing-Stone (TD 40, add 3rd Legacy of Numenor to my hand); play 3rd Legacy of Numenor (TD 44, add 1 resource to each hero's pool); play O Lorien and Steward of Gondor on Galadriel; exhaust Steward of Gondor to add 2 resources to Galadriel's pool; exhaust O Lorien and play 2nd Handmaiden for 1 (43 TD); play 1st The Tree People (taking Henamarth back in hand) and putting Orophin in play (return 3rd Minstrel to my hand) play both Weavers (shuffle back 1st The Tree People and 3rd Legacy of Numenor in the deck) ; resources left Bifur (1), Celeborn (0), Galadriel (1)\n\nQuest Phase: send both Minstrels, both Handmaidens, both Weavers and Orophin to the quest; reveal Dunlending Ambush (cancel its effect with 1st Test of Will) surges into Hithaeglir Stream; exhaust Galadriel and Nenya to add Galadriel's Willpower to Orophin's; 18 Willpower against 3 Threat; 15 progress, 3 to clear Hills of Dunland, 12 on Stage 1 clearing it; advance to stage 2: make Munuv Duv Ravine the active location, no Items or Mounts to discard, discard all allies except for Orophin, search the encounter deck for Boar Clan Stalker and put it in play engaged with me, shuffle my discard pile in my deck and draw 1 card (1st The Tree People)\n\nTravel phase: nothing\n\nEngagement phase: nothing\n\nCombat phase: deal Shadow Card; Orophin defends Boar Clan Stalker (shadow is In Need of Rest, no effect, 2 Attack against 1 Defense, 1 damage); play The Tree People (taking Orophin back in hand) and put 1st Galadriel's Handmaiden in play (TD 42); end of combat phase advance to Stage 3: put Chief Turch in play engaged with me, 5 Time Counters\n\nRefresh Phase/End of Round: TD 43, 4 Time Counters\n\n \n\nTurn 3\n\nDraw: 1st Daeron's Runes (add 1 resource token to Boar Clan Stalker)\n\nPlanning Phase: exhaust Steward of Gondor and add 2 resource to Galadriel's pool; play 1st Daeron's Runes (draw 1st Legacy of Numenor and 2nd The Tree People, discard Henamarth Riversong, add 1 resource to Boar Clan Stalker for 2 total); exhaust Galadriel (TD 42, draw Unlikely Friendship, add 1 resource to Boar Clak Stalker for 3 total); play Unlikely Friendship (draw 1st Feigned Voices, add 1 resource to Celeborn's pool, add 1 resource to Boar Clan Stalker for 4 total since it's the maximum I will stop keeping track of this); play 1st Legacy of Numenor (TD 46, let's live dangerously, add 1 resource to each hero's pool); play Orophin (get Henamarth Riversong back to hand); exhaust O Lorien and play Galadhrim Minstrel for 1 (add 1st Deep Knowledge to my hand); play Henamarth Riversong; exhaust Henamarth Riversong to look at the top card of the encounter deck (Low Provisions); play 2nd The Tree People (taking Henamarth Riversong back in hand) and put 1st Galadhrim Weaver in play (shuffle 1st Legacy of Numenor in the deck); play Henamarth again; play Wooland Courier (put 1 progress on Munuv Duv Ravine); play Deep Knowledge (TD 48, draw Galion and We Are Not Idle); play We Are Not Idle for 0 (draw Peace and Thought); move 1 resource from Galadriel's pool to Bifur's pool; resources left Bifur (1), Celeborn (0), Galadriel (1)\n\nQuest Phase: send Handmaiden (exhausts), Minstrel, Weaver, Henamarth, Courier, Galion and Orophin to the quest; reveal Low Provisions (cancel it with 2nd A Test of Will); 15 Willpower against 3 Threat; 12 progress, 5 to clear Munuv Duv Ravine (add it to the victory display)7 on Stage 3 but they do not count\n\nTravel phase: travel to Hithaeglir Stream\n\nEngagement phase: nothing\n\nCombat phase: deal Shadow Cards; play Feigned Voices (returning Galion to hand) on Chief Turch; Celeborn defends Boar Clan Stalker (shadow is Plains of Enedwaith, +1 Attack, 5 Attack against 2 Defense, 3 damage, dodged a bullet here); Bifur, Minstrel, Orophin, Henamarth and Courier attack and destroy Boar Clan Stalker (1+1+3+2+2, 9 Attack against 4 Defense, 5 damage)\n\nRefresh Phase/End of Round: TD 49; play Peace and Thought exhausting Bifur and Celeborn (draw 2nd Handmaiden, The Seeing-Stone, 2nd Unlikely Friendship, 2nd We Are Not Idle, 2nd Weaver), 3 Time Counters\n\n \n\nTurn 4\n\nDraw: 1st Legacy of Numenor and 2nd Deep Knowledge (due to the active location effect)\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resource to Galadriel's pool; exhaust Henamarth Riversong to look at the top card of the encounter deck (Dunland Tribesman); exhaust Galadriel (TD 48, draw 2nd Peace and Thought); play 2nd We Are Not Idle for 0 (draw 2nd Minstrel); exhaust O Lorien and play 2nd Minstrel for 1 (add 2nd Daeron's Runes to my hand); play 2nd Daeron's Runes (draw 3rd Handmaiden and 2nd O Lorien, discard 2nd O Lorien); play 2nd Unlikely Friendship (draw 2nd Host of Galadhrim add 1 resource to Galadriel's pool); play 2nd and 3rd Galadriel's Handmaiden (TD 46); play Deep Knowledge (TD 48, draw Galadhrim Healer and 3rd We Are not Idle); play 3rd We Are not Idle for 0 (draw 2nd Feigned Voices) ; resources left Bifur (0), Celeborn (1), Galadriel (0)\n\nQuest Phase: send 3 Handmaidens (1st one exhausts), 2 Minstrels (1st exhausts), Weaver (exhaust) and Galion to the quest; reveal Dunland Tribesman (draw 3rd Daeron's Runes); play 3rd Daeron's Runes (draw 3rd Deep Knowledge and 2nd Legacy of Numenor, discard The Seeing-Stone); 14 Willpower against 1 Threat; 13 progress, 4 to clear Hithaeglir Stream, 9 on Stage 3 but they do not count\n\nTravel phase: nothing\n\nEngagement phase: engage Dunland Tribesman\n\nCombat phase: deal Shadow Cards; play 2nd Feigned Voices (returning Galion to the hand) on Chief Turch; Woodland Courier defends Dunland Tribesman (shadow is Plains of Enedwaith, +1 Attack, 5 Attack against 0 Defense, 5 damage, Woodlance Courier is destroyed); Orophin, 2nd and 3rd Handmaiden and 2nd Minstrel attack and destroy Tribesman (2+1+1+1 Attack against 2 Defense, 3 damage)\n\nRefresh Phase/End of Round: TD 49, 2 Time Counters\n\n \n\nTurn 5\n\nDraw: 2nd The Seeing-Stone\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resource to Galadriel's pool; exhaust Henamarth Riversong to look at the top card of the encounter deck (Frenzied Attack); exhaust Galadriel (TD 48, draw 3rd Weaver): exhaust O Lorien and play Galadhrim Healer for 1 (heal 1 damage from Celeborn down to 2); play 2nd Weaver (shuffle Woodlance Courier back in the deck); play 1st Host of Galadhrim putting back in play 3 Handmaidens (TD 45), 2 Weavers (shuffle 2nd Feigned Voices and 3rd Daeron's Runes in the deck) 2 Minstrels (add 3rd Unlikely Friendship and 3rd The Tree People to my hand), 1 Healer (heal 1 more damage from Celeborn down to 1), Orophin (no ally to take back) and Henamarth; play 3rd Unlikely Friendship (draw 2nd Feigned Voices and add 1 resource to Galadriel's pool); play 3rd Weaver shuffling 3rd Unlikely Friendship back in the deck) play Galion; play 3rd The Tree People (returning Galion to hand) and putting 3rd Minstrel in play (add 3rd Host of Galadhrim to my hand); play Galion again ; resources left Bifur (0), Celeborn (0), Galadriel (0)\n\nQuest Phase: send all the allies to the quest; reveal Frenzied Attack (draw Haldir of Lorien, discard Haldir of Lorien); 30 Willpower against 0 Threat; 30 progress more on Stage 3 but they do not count\n\nTravel phase: nothing\n\nEngagement phase: nothing\n\nCombat phase: deal Shadow Card; play 2nd Feigned Voices on Chief Turch (returning Galion to hand)\n\nRefresh Phase/End of Round: TD 48, 1 Time Counter\n\n \n\nTurn 6\n\nDraw: 3rd Legacy of Numenor\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resource to Galadriel's pool; exhaust Henamarth Riversong to look at the top card of the encounter deck (Hithaeglir's Foothills); play 2nd Host of Galadhrim playing again Orophin (take Haldir back in hand), 3 Weavers (shuffle back 2nd Feigned Voices, 3rd The Tree People and 1st Host of Galadhrim in the deck), 3 Minstrels (add 1st Test of Will, 3rd Unlikely Friendship and 3rd The Tree People to my hand), Healer (heal 1 more damage from Celeborn down to 0) and Henamarth; play Galion; play 3 Unlikely Friendship (draw 3rd Daeron's Runes and add 1 resource to Bifur's pool); play 3rd Daeron's Runes (draw 2nd Feigned Voices and 1st Host of Galadhrim) ; resources left Bifur (1) Celeborn (0), Galadriel (1)\n\nQuest Phase: send all the allies to the quest; reveal Hithaeglir's Foothills, surges into In Need of Rest (no effect): 30 Willpower against 0 Threat; 30 Will progress more on stage 3 but they do not count\n\nTravel phase: travel to Hithaeglir's Foothills\n\nEngagement phase: nothing\n\nCombat phase: deal Shadow Card; play 2nd Feigned Voices on Chief Turch (returning Galion to hand); exhaust Henamarth Riversong to look at the top card of the encounter deck (Dunland Chieftain); exhaust Galadriel (TD 44, draw 3rd Peace and Thought\n\nRefresh Phase/End of Round: TD 45; exhaust Galadriel (TD 44, draw 2nd Steward of Gondor) 0 Time Counters, make engagement checks, Chief Turch attacks, the Healer takes it to the chin, it's destroyed and I win the game\n\n \n\nFinal Score = 5 Completed Rounds (x10) + 44 Threat – 4 Victory Points = 90\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4025329","commentId":4025329,"userName":"General_Grievous","timestamp":1607146947,"content":"Nice job so far! I’m looking forward to this month’s league"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4026224","commentId":4026224,"userName":"Alonewolf87","timestamp":1607350749,"content":"Celebrimbor's Secret was a real breeze, I had only played it as a 4 players Fellowship before and I was expecting more problems, but since The Orc's Search basically never triggered and the only Scour Effect I saw was the mandatory one from passing from Stage 1 to Stage 2 it was all super easy, despite the fact that my deck performed slightly worse than usual.\n\nI must say this Silvan combo deck is really something, I would not use it in a Fellowship (both for the Doomed and for the extremely long Planning Phases), but against lots of solo quests it really rocks.\n\nHere is the usual Playthrough\n\n\n\nCelebrimbor's Secret\n\n \n\nOpening Hand (after mulligan): The Seeing-Stone, Galadriel's Handmaiden, Deep Knowledge, Galadhrim Minstrel, Feigned Voices, Peace and Thought\n\n \n\nSetup: add The Orc's Search, Bellach and Secret Chamber to the staging area, attach Celebrimbor's Mould to Secret Chamber, add City Remains to the staging area, 3 Time Counters on Stage 1\n\n \n\nTurn 1 (27 Starting Threat)\n\nDraw: Henamarth Riversong\n\nPlanning Phase: play Deep Knowledge (TD 29, draw Nenya and Galadhrim Weaver); play The Seeing-Stone (TD 30, add 2nd Deep Knowledge to my hand); play 2nd Deep Knowledge (TD 32, draw Steward of Gondor and Unlikely Friendship); play Unlikely Friendship (draw A Test of Will, add 1 resource to Celeborn's pool); play Steward of Gondor on Galadriel; exhaust Steward of Gondor to add 2 resources to Galadriel's pool; play Henamarth Riversong; exhaust Henamarth Riversong to look at the top card of the encounter deck (Prowling Wolf); play Nenya on Galadriel; play Galadhrim Minstrel (add 2nd Unlikely Friendship to my hand); play 2nd Unlikely Friendship (draw O Lorien, add 1 resource to Bifur's pool; resources left Bifur (1), Celeborn (0), Galadriel (0)\n\nQuest Phase: send Galadhrim Minstrel to the quest; reveal Prowling Wolf; exhaust Galadriel and Nenya to add Galadriel's Willpower to the Minstrel's; 6 Willpower against 7 Threat, quest failed (TD 33)\n\nTravel phase: travel to City Remains\n\nEngagement phase: engage Prowling Wolf\n\nCombat phase: deal Shadow Card; play Feigned Voices (returning Henamarth Riversong to hand) on Prowling Wolf; Bifur, Celeborn and Minstrel attack and destroy Prowling Wolf (1+2+1 Attack against 1 Defense, 3 damage)\n\nRefresh Phase/End of Round: TD 34, play Peace and Thought exhausting Bifur and Celeborn (draw Orophin, Daeron's Runes, 2nd Minstrel, The Tree People, We Are not Idle), 2 Time Counters\n\n \n\nTurn 2\n\nDraw: 2nd Steward of Gondor\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resource to Galadriel's pool; play Galadhrim Weaver (shuffle Peace and Thought back in the deck); play The Tree People (returning Weaver to hand) and put 2nd Weaver in play (shuffle Feigned Voices back in the deck); play Henamarth Riversong; exhaust Henamarth Riversong to look at the top card of the encounter deck (Desecrated Ruins); play We Are not Idle for 0 (draw 2nd Daeron's Runes); play 1st Daeron's Runes (draw Galion and Legacy of Numenor, discard 2nd Steward of Gondor); play Legacy of Numenor (TD 38, add 1 resource to each hero's pool); play 2nd Daeron's Runes (draw Host of Galadhrim and Haldir of Lorien, discard Haldir of Lorien); play O Lorien on Celeborn; exhaust O Lorien and play 2nd Minstrel for 1 (add Feigned Voices to my hand); play Galion; play Galadriel's Handmaiden (TD 37); resources left Bifur (0), Celeborn (1), Galadriel (1)\n\nQuest Phase: send both Minstrels (1st exhausts), Weaver, Handmaiden and Galion to the quest; reveal Desecrated Ruins (cancel it with A Test of Will); exhaust Nenya and Galadriel to add Galadriel's Willpower to Galion's; 14 Willpower against 1 Threat; 13 progress, 3 to clear City Remains (no Scour effect to trigger) and 10 on Stage 1\n\nTravel phase: remove 3 progress from Stage 1 (down to 7) to travel to Secret Chamber\n\nEngagement phase: nothing\n\nCombat phase: nothing\n\nRefresh Phase/End of Round: TD 38, 1 Time Counter\n\n \n\nTurn 3\n\nDraw: 2nd We Are Not Idle\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resource to Galadriel's pool; play 2nd Galadhrim Weaver (shuffle A Test of Will back in the deck); play 2nd We Are not Idle for 0 (draw 2nd The Tree People); exhaust Henamarth Riversong to look at the top card of the encounter deck (Orc Skirmisher); play 2nd The Tree People (returning Galion to hand) and put in play Woodland Courier (no location to place progress on); exhaust O Lorien and play Orophin for 2 (return Haldir of Lorien to my hand); exhaust Galadriel (TD 37, draw 2nd Host of Galadhrim); play 1st Host of Galadhrim putting back in play Henamarth, Orophin (no Silvan to take back), Woodland Courier (no location to put progress on), Galadriel's Handmaiden (TD 36); 2 Weavers (shuffle 2nd The Tree People and 2nd We Are Not Idle in the deck) and 2 Minstrels (add 3rd Deep Knowledge and 3rd Unlikely Friendship to my hand); play 3rd Unlikely Friendship (draw 2nd Handmaiden, add 1 resource to Galadriel's pool); resources left Bifur (0), Celeborn (0), Galadriel (1)\n\nQuest Phase: send 2 Minstrels, 2 Weavers, Courier, Handmaiden, Galion, Henamarth and Orophin to the quest; reveal Orc Skirmisher; 20 Willpower against 3 Threat; 17 progress, 6 to clear Secret Chamber (attach Celebrimbor's Mould to Bifur), 11 on Stage 1 for 18 total, clearing it and advancing to Stage 2; trigger all Scour effects (only Bellach's basically, add Bellach's Scout to the staging area); Bellach attacks, Celeborn defends (shadow is Bellach Scout, no effect, 5 Attack vs 2 Defense, 3 damage), attach Celebrimbor's Mound to Bellach, 3 Time Counters on Stage 2\n\nTravel phase: nothing\n\nEngagement phase: engage Orc Skirmisher (remove 1 Time Counter, down to 2)\n\nCombat phase: deal Shadow Cards; play Feigned Voices (returning Galion to hand) on Skirmisher; all the other allies attack and destroy Skirmisher (I will not bother taking track here)\n\nRefresh Phase/End of Round: TD 39, 1 Time Counter\n\n \n\nTurn 4\n\nDraw: 2nd The Seeing-Stone\n\nPlanning Phase: exhaust Steward of Gondor to add 2 resources to Galadriel's pool; exhaust Henamarth Riversong to look at the top card of the encounter deck (Broken Lands); exhaust Galadriel (TD 38, draw 3rd Handmaiden); play 2nd Handmaiden (TD 37); play 3rd Deep Knowledge (TD 39, draw Galadhrim Healer and A Test of Will); exhaust O Lorien to play Galadhrim Healer for 1 (heal 1 damage from Celeborn, down to 2); play 3rd Handmaiden (TD 38); play 2nd The Seeing-Stone (TD 39, add 2nd Legacy of Numenor to my hand); play 2nd Legacy of Numenor (TD 43, add 1 resource to each hero's pool); play 2nd Host of Galadhrim putting back in play Healer (heal 1 damage from Celeborn down to 1), Orophin, Courier, Henamarth, 3 Handmaidens (TD 40); 2 Minstrels (add 2nd The Tree People and 2nd We Are Not Idle to hand); and 2 Weavers (shuffle 2nd The Seeing Stone and 2nd Legacy of Numenor back in the deck); play Galion; resources left Bifur (0), Celeborn (0), Galadriel (0)\n\nQuest Phase: send 2 Minstrels, 2 Weavers, 3 Handmaidens, Healer, Courier, Henamarth, Orophin, and Galion to the quest; reveal Broken Lands; 28 Willpower against 4 Threat; 24 progress on Stage 2\n\nTravel phase: travel to Broken Lands; exhaust Galadriel (TD 39, draw 2nd Legacy of Numenor)\n\nEngagement phase: optionally engage Bellach; play 2nd The Tree People (returning Galion to hand) and put in play 3rd Minstrel (add 2nd Peace and Thought to my hand);\n\nCombat phase: deal Shadow Card; Woodland Courier defends Bellach (shadow is Spies of Mordor, discard Nenya, 5 Attack against 1 Defense 1 damage), Courier is destroyed; Bifur, Celeborn and all the allies attack and destroy Bellach (1 Bifur +2 Celeborn +3 Handmaidens +3 Minstrels +2 Henamarth + 3 Orophin + 1 Healer = 16 Total against 4 Defense, 12 damage), attach Celebrimbor's Mould to Bifur and win the game\n\n \n\nFinal Score = 3 Completed Rounds (x10) + 39 Threat +1 damage on Celeborn – 8 Victory Points = 62\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4029742","commentId":4029742,"userName":"Thanee","timestamp":1607965169,"content":"The orc has been caught. Took a while to find the sneaky git, because he was hiding very deep inside the set-aside cards, but once the deck was set up with some allies and attachments, there wasn't really anything happening from the encounter deck, that caused me any trouble.\n\nBye\nThanee\n\nEdited December 14 by Thanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4030470","commentId":4030470,"userName":"General_Grievous","timestamp":1608086589,"content":"Well I decided to challenge myself this month with using just the restricted card pool (aside from the hero choices and MOTK contract that let me start with Anborn). But opening round I had the choice to play ranger spikes or treebeard and what were the odds that I would be overwhelmed with enemies round 1? So I went with Treebeard using Grima’s cost reduction and during the questing phase drew an enemy that revealed another card and summoned a second enemy and the shadow effect killed a hero. Pretty quick game loss after that. \n \n\nTried again with 2 tokens and got the traps really flowing this time. Though it was really hard to quest when so many of my allies ended up in my out of play 20 cards and getting discarded. In the end I was questing with everyone and constantly recycling traps with Anborn. I managed to just scrape out a victory.\n\n \n\nTokens used: 2\n\nEdited December 16 by General_Grievous"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4030717","commentId":4030717,"userName":"Thanee","timestamp":1608136208,"content":"The Dunland Trap required 2 Tokens for me. The first attempt was over in round 1, when I had three enemies engaged with my heroes, already. The second one took longer, but the start was not great either, and I was always behind, until it became too much. The third game, finally, worked fairly well, and even though I lost a couple allies and attachments to the trap (no real point to hold on to cards, when your hand gets discarded constantly), I was pretty well-prepared for the rest of the scenario, and quickly found a new healer, which was very good, as there was quite a lot of damage incoming. Not enough to kill my heroes, though, thanks to the healer and a number of resources spent to use him more than once per round.\n\nBye\nThanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4030718","commentId":4030718,"userName":"General_Grievous","timestamp":1608136237,"content":"The Dunland Trap was a an edge-of—the-seat adventure which could have gone anyway at anytime. This was the quest I had tried to build around foolishly thinking To Catch an Orc would be easier. But my opening strategy worked here and I was able to use a Forest Snare to great advantage. Choosing the Boar Clan Stalkers whenever I got to pick a Dunland enemy and then disabling them with a snare. I the set up several traps in the staging area and when I progressed to the Ambush chose to keep Treebeard with a few resources on him as my only ally. The final round I was holding off against two Boar Clan Stalkers and Chief Turcot himself. Trapping one stalker I was able to use Treebeard to fend off against the other as my cheap rangers and ents boldly sacrificed themselves to protect the counsellor Grima safe from Turch’s attacks. Managed to win first try with no tokens required.\n\n \n\n0 tokens used.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4030744","commentId":4030744,"userName":"General_Grievous","timestamp":1608138831,"content":"Celebrimbo’s Secret was the smoothest of the three and the Trap deck really shone here. From round one I was able to keep a steady combo of Poisoned Stakes and Ranger Spikes going and recycling to keep pretty much all Orcs stuck in the staging area hemorrhaging out and poisoned. The one that snuck through I defended with a well-funded TreeBeard and then subsequently Forest Snared and forgot about. Threat was the only thing that got a bit dicey but with Gandalf’s arrival x2 I was able to stay in the quest. That’s how I won the final round with a group attack from rangers and Ents crushing the poor Belach as all his forces watched in immobilized. It was a lot of fun bringing Traps again as I have tried time and again to make them work but MOTK Anborn is really the key that was missing for them. Having his awesome ability round one is fantastic especially when combined with Damrod’s card draw/cost reduction. There is always a trap being deployed. \n \n\n0 tokens used\n\n \n\ntotal for the three quests: 2 tokens. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4030748","commentId":4030748,"userName":"Thanee","timestamp":1608139617,"content":"Celebrimbor's Secret wasn't much of a problem. The start was a little rough, since I engaged one enemy too many (didn't realize, that I didn't have to as my Threat was below 40 still), which really slowed down my counterattacks. But once Glorfindel showed up, and got a Warrior Sword, he just dispatched everything with ease. Should have put more Warrior Swords in, instead of the other weapons, since it also works on characters not just heroes (which I only realized during that game; I didn't really take much time building that deck), it doesn't even require Sword-thain and I could play a second copy on Gandalf. Anyways, that was that.\n\nBye\nThanee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4032958","commentId":4032958,"userName":"Alonewolf87","timestamp":1608579172,"content":"The notice of the closure of the forums here on this website is quite the sad news, but I hope we will be able to carry on with these monthly leagues elsewhere..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4032985","commentId":4032985,"userName":"General_Grievous","timestamp":1608580324,"content":"Dale usually posted them on Board Game Geek LOTR LCG forum, so I’ll switch over to that if you guys are good with that? I’m Christian_Medic on there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4034142","commentId":4034142,"userName":"rlogan4","timestamp":1608769326,"content":"I am finally done with work for the year so I should able to get this in for the month.  Just have to see how my Silvan deck does against these quests as I used Rohan/Gondor two handed in my original playthrough of the cycle.  And yeah, I originally found this league through the BGG forum so I am good with that.  Granted I seem to only get in the league every other month so I'll let you regulars hash it out.  If we do continue doing the BGG forums I am weaponx1017 over there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/312998-solo-league-28-voice-of-isengardring-maker-with-honagainst-the-shadow-cards/?do=findComment&comment=4034472","commentId":4034472,"userName":"General_Grievous","timestamp":1608878080,"content":"Nice BGG work for everyone else too"}]}