{"url":"https://community.fantasyflightgames.com/topic/313182-hobbit-saga-2-forest-stream-lazy-lob/","title":"Hobbit Saga 2: Forest Stream + Lazy Lob","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/313182-hobbit-saga-2-forest-stream-lazy-lob/?do=findComment&comment=4026491","commentId":4026491,"userName":"ShiraHata","timestamp":1607382558,"content":"I've tried looking for an answer, but the search function somehow seems to be broken for me. The only relevant thing I could find through google was an old thread from 2014 where someone had the same question but didn't get a definitive answer.\n\nForest Stream is the active location. It reads: While Forest Stream is the active location, poisoned characters cannot quest.\n\nAfter committing some non-poisoned characters to the quest, Lazy Lob is revealed as an encounter card. It reads: When revealed: Each character committed to the quest gets 1 poison.\n\nAm I correct in assuming that all my characters are immediately removed from the quest? Is there any official statement on what \"cannot quest\" actually means in this context?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/313182-hobbit-saga-2-forest-stream-lazy-lob/?do=findComment&comment=4026518","commentId":4026518,"userName":"sappidus","timestamp":1607387588,"content":"I think most have assumed this should be interpreted as \"…poisoned characters cannot commit to the quest\" (rather than \"…poisoned characters cannot commit to the quest, and poisoned characters' willpowers are ignored when resolving the quest\"), and chalked up Forest Stream's phrasing to early-game-wording syndrome. But I am not aware of an explicit ruling that says so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/313182-hobbit-saga-2-forest-stream-lazy-lob/?do=findComment&comment=4026657","commentId":4026657,"userName":"ShiraHata","timestamp":1607415277,"content":"Hmm... I get that this might have been the designer's intent, but I am not convinced that the rules support this reading. Compare it to the wording of the Quest cards in this scenario:\n\nUnconscious characters cannot quest, attack, defend, collect resources, trigger abilities, be poisoned, or ready[…].\n\nThe \"cannot quest\" part is the same as on Forest Stream. We DO have an official ruling for the case where a defending character gets unconscious through the effect of a Shadow card (the attack is considered undefended): Link [https://boardgamegeek.com/thread/1025953/character-turn-unconscious-during-enemy-attack-pha]\n\nSome folks in that thread come to the conclusion that questing characters should also get removed from the quest when they become unconscious. Personally, I can't think of  a reason why it should work differently for questing and defending characters. Forest Stream uses exactly the same wording as the Quest cards in this scenario, so I have to assume that this nasty combo indeed withdraws all your characters from the quest.\n\nSo yeah, I think I've answered my own question, although I'd still like to hear what others have to say on this topic.\n\n(On an unrelated note: What's up with the search function on this site? It used to work rather well, but now it only shows me results from within the past 2 months. \"Date created\" is set to \"any\".)"}]}