{"url":"https://community.fantasyflightgames.com/topic/313235-grimbeorn-the-old-vs-chieftain-of-the-pit-shadow/","title":"Grimbeorn the Old vs Chieftain of the Pit shadow","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/313235-grimbeorn-the-old-vs-chieftain-of-the-pit-shadow/?do=findComment&comment=4027692","commentId":4027692,"userName":"Khamul The Easterling","timestamp":1607570573,"content":"Defending with Grimbeorn the Old against Goblin spearman.  Revealed shadow is chieftain of the pit. \"attacking enemy attacks again after this attack. Deal it another shadow card for the next attack. \"\n\nCan i spend a resource and trigger Grimbeorns ability to attack goblin spearman after i defend the first attack, killing him instantly, OR does the shadow trigger immediately after the first attack and Goblin spearman makes two attacks back to back with no action window to trigger Grimbeorns ability?  \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/313235-grimbeorn-the-old-vs-chieftain-of-the-pit-shadow/?do=findComment&comment=4027698","commentId":4027698,"userName":"stimpaksam","timestamp":1607571703,"content":"You'd treat them as two different attacks where the first needs to resolve before the next one can start. That means once the first attack resolves you can trigger Grimbeorn's response. If this kills the enemy then the shadow card would whiff. If not, then you would have to resolves it's second attack. And if you were to ready Grimbeorn and use him to defend the second attack you wouldn't be able to use his ability on that enemy again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/313235-grimbeorn-the-old-vs-chieftain-of-the-pit-shadow/?do=findComment&comment=4027835","commentId":4027835,"userName":"sappidus","timestamp":1607611477,"content":"I believe the (1st) shadow card sets up a delayed effect that priority says must fire before Grimbeorn's Response can be triggered. So the enemy will initiate a 2nd attack and get a shadow card. But Grimbeorn's Response can be triggered during the first subsequent opportunity, which is the first action window during the attack. So if Grimbeorn destroys the enemy at that point, the 2nd attack effectively whiffs after all. However, a shadow card was still dealt.\n\nThis is the reference ruling:\n\n "}]}