{"url":"https://community.fantasyflightgames.com/topic/313389-questions-re-ranger-of-cardolans-textbox-being-blanked/","title":"Questions re: Ranger of Cardolan&#039;s textbox being &quot;blanked&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/313389-questions-re-ranger-of-cardolans-textbox-being-blanked/?do=findComment&comment=4030384","commentId":4030384,"userName":"TwiceBorn","timestamp":1608072375,"content":"Just wondering if I played this correctly,\n\nDuring the engagement phase, an enemy engaged and I paid 1 resource to put Ranger of Cardolan [http://hallofbeorn.com/LotR/Details/Ranger-of-Cardolan-TWoE?Lang=EN] into play from hand. \n\nHis text box says: Response: After you engage an enemy [http://hallofbeorn.com/LotR/Search?CardType=Enemy], if you control at least 1 Dúnedain [http://hallofbeorn.com/LotR/Search?Trait=D%C3%BAnedain.&CardType=Hero] hero, spend 1 resource to put Ranger of Cardolan into play from your hand, under your control. At the end of the round, if Ranger of Cardolan is still in play, shuffle it into its owner's deck.\n\n \n\nAlso in play at that time was the Craft Remedy [http://hallofbeorn.com/LotR/Details/Craft-Remedy-TSoH?Lang=EN] side quest, which says: Treat the printed text box of each damaged character as if it were blank (except for Traits). \n\nI also happen to be at Stage 2b [http://hallofbeorn.com/LotR/Details/Under-the-Merciless-Sun-TSoH]of Desert Crossing, which says: Forced: At the end of the round, increase the temperature by 4. Then, each player assigns X damage among characters he controls, where X is the tens digit of the temperature. \n\n \n\nHere are my questions:\n\n1) At the end of the round, I played the Forced response on stage 2b before completing the second part of the Ranger of Cardolan's response (i.e., I placed 2 damage on the Ranger, and did not reshuffle him into the deck because of the passive text on Craft Remedy). Was I correct in triggering the Forced effect on Craft Remedy before the second half of the Ranger's response? Forced effects usually take precedence over Responses, but should I have triggered the Ranger's response first because the response as a whole had been initiated during the engagement phase? \n\n2) If I played the sequence above correctly, then Ranger of Cardolan's text box has been blanked as a result of the passive effect on Craft Remedy. Does this mean he gets to stay in play at the end of the round, or was a lasting effect created via his response during the engagement phase (before he was damaged) that would override Craft Remedy, therefore resulting in his reshuffling at the end of the round?\n\n3) If the passive text on Craft Remedy does enable the damaged Ranger of Cardolan to stay in play at the end of the round in which he was put into play, I presume that once Craft Remedy is defeated/explored on a subsequent round, that the Ranger would remain in play for the remainder of the game until destroyed/discarded via card effect.  If I understand it correctly, the second half of his response indicates that he normally would be reshuffled into his deck at the end of the round in which he entered play... which had previously been voided by Craft Remedy. Is this correct?  \n\n \n\nThanks in advance for your insights!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/313389-questions-re-ranger-of-cardolans-textbox-being-blanked/?do=findComment&comment=4030566","commentId":4030566,"userName":"Alonewolf87","timestamp":1608107711,"content":"> 9 hours ago, TwiceBorn said:\n> \n> 1) At the end of the round, I played the Forced response on stage 2b before completing the second part of the Ranger of Cardolan's response (i.e., I placed 2 damage on the Ranger, and did not reshuffle him into the deck because of the passive text on Craft Remedy). Was I correct in triggering the Forced effect on Craft Remedy before the second half of the Ranger's response? Forced effects usually take precedence over Responses, but should I have triggered the Ranger's response first because the response as a whole had been initiated during the engagement phase? \n\nI would say that the Ranger Response sets up a delayed passive effect for the end of the round, that would take precedence over Forced effects and Responses.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/313389-questions-re-ranger-of-cardolans-textbox-being-blanked/?do=findComment&comment=4030605","commentId":4030605,"userName":"NathanH","timestamp":1608118826,"content":"Yeah I would definitely shuffle the ranger away. I'd even do that if the card playing the role of Craft Remedy was blanking every ally's text box, not just damaged ones, although I have less strong rules justification for that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/313389-questions-re-ranger-of-cardolans-textbox-being-blanked/?do=findComment&comment=4031007","commentId":4031007,"userName":"TwiceBorn","timestamp":1608187262,"content":"Thanks to you both for taking the time to reply, and Alonewolf 87's rationale does seem very reasonable/logical.\n\nI had also sent Caleb the same rules query before I received your replies, so we'll see if he's in agreement. I'll post his reply if/when I get it.\n\nEdited December 17 by TwiceBorn"}]}