{"url":"https://community.fantasyflightgames.com/topic/313843-the-%E2%80%9Clast%E2%80%9D-goodbye/","title":"The “Last” Goodbye","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/313843-the-%E2%80%9Clast%E2%80%9D-goodbye/?do=findComment&comment=4035243","commentId":4035243,"userName":"Wandalf the Gizzard","timestamp":1609204638,"content":"As you all know, FFG is shutting down these forums at the end of the year. Alongside content creator stalwarts like Cardboard of the Rings, Grey Company and countless more, this discussion board has provided me and I’m sure many of you with entertainment, memories, and camaraderie to be treasured forever.\n\nThis post is essentially a thank you and a goodbye. The end of something as trivial as a forum is no large matter, but, I feel it is still deserving of a proper sendoff. \n \n\nI want to thank the members of this community  for making it truly the best one in the world. Thank you for showing me and all the newbies the ropes when we first started playing. Thank you for such a friendly, wholesome environment, and thank you for keeping the game alive with your enthusiasm!\n\nAs silly and over the top as it may sound, I will never forget this community. I would produce a list of the people I want to specifically express my gratitude towards, but it would be far too long!\n\n We know LotR LCG will likely end soon after this forum closes, and while our friendship will still continue through other forums and conventions, it won’t be the same for me, and possibly for you as well. Therefore, if anyone has any memories of the LotR LCG community they would like to share,  whether of levity or gravity, please do feel free to do so below.\n\nThank you for entertaining my ramblings one last time.  Goodbye for now!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/313843-the-%E2%80%9Clast%E2%80%9D-goodbye/?do=findComment&comment=4035295","commentId":4035295,"userName":"TrueLolzor","timestamp":1609244746,"content":"What do you mean by LotR LCG ending soon? It has technically ended already. Or do you mean they gonna stop printing it altogether?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/313843-the-%E2%80%9Clast%E2%80%9D-goodbye/?do=findComment&comment=4035300","commentId":4035300,"userName":"NathanH","timestamp":1609247139,"content":"This was probably the most pleasant message board I've ever been involved in. ❤️❤️"},{"commentUrl":"https://community.fantasyflightgames.com/topic/313843-the-%E2%80%9Clast%E2%80%9D-goodbye/?do=findComment&comment=4035333","commentId":4035333,"userName":"stimpaksam","timestamp":1609262236,"content":"> 4 hours ago, TrueLolzor said:\n> \n> What do you mean by LotR LCG ending soon? It has technically ended already. Or do you mean they gonna stop printing it altogether?\n\nThese forums are shutting down at the end of January. The game itself, while completed, will continue to be reprinted and sold."},{"commentUrl":"https://community.fantasyflightgames.com/topic/313843-the-%E2%80%9Clast%E2%80%9D-goodbye/?do=findComment&comment=4035341","commentId":4035341,"userName":"General_Grievous","timestamp":1609264562,"content":"I’m definitely going to keep playing the game and if we get Dreadnaught content drops or anything like that in the future the game will continue. There is also the sweet player continuation thing which helps too. But either way LOTR is not going to die anytime for me.\n\n \n\nBut the forums are closing so I’ll reflect on that for sure. The solo league has been great and met some awesome dudes on there and hope to continue it on Board Game Geek. I’m a newer player in the last two years so definitely proud of when we got FFG to answer future of the game by everyone helping vote on my question to them. So they support was awesome. My second favourite is all the fun speculating we did last year when that Reddit Poem got released. \n \n\nThis is the most respectful forum and group of people I have encountered. And along with the Facebook group it’s super nice to find a non-toxic part of the internet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/313843-the-%E2%80%9Clast%E2%80%9D-goodbye/?do=findComment&comment=4035583","commentId":4035583,"userName":"silverthorn","timestamp":1609364838,"content":"I've enjoyed being on this board more than most (the amout of posts I made is more than I think I have on any other board) and it'll be sad to see it go."}]}