{"url":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/","title":"Can&#039;t wait to see previews at Gen Con.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338031","commentId":338031,"userName":"Curator","timestamp":1280939187,"content":"The art and format look great. I hope this game does very well. FFG looks to be boasting the best display at Gen Con this year."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338071","commentId":338071,"userName":"Toqtamish","timestamp":1280944493,"content":"Be sure to post any info you find and card details for those of us unlucky enough to not be going."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338658","commentId":338658,"userName":"Chevee","timestamp":1281047557,"content":" Played it, it's awesome.  I honestly do not have spoilers because today was hectic, but I'll try to get some pics tomorrow to share.  I'll field questions while I play CoC Worlds tomorrow, so feel free to ask.\n\n \n\nChevee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338660","commentId":338660,"userName":"dukelp","timestamp":1281047691,"content":"WOW,can't wait!babeo.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/babeo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338688","commentId":338688,"userName":"Ruvion","timestamp":1281052737,"content":"anything...just anything at all would be nice.\n\nThe anatomy of the cards for one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338770","commentId":338770,"userName":"Wallenstein","timestamp":1281068899,"content":"Maybe few words about gameplay and card distribiution in Core Set?\n\nIs it all 3x or 1x?\n\nhow many cards from 216 are used in game to deck building?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338785","commentId":338785,"userName":"Dam the Man","timestamp":1281075080,"content":"3x The One Ring would ruin things a bit for me gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif] . Actually, being an Meccg oldie, I liked that a Unique card was Unique, could only have 1 in deck, whereas the LCGs allow 3x in deck, but only one in play per person. Still, both players having The One Ring in play would equally suck monkey balls."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338825","commentId":338825,"userName":"Chevee","timestamp":1281081348,"content":" Okay, honestly, my first question to the dude in blue was, \"how many base sets do I need to buy to get a full playset.\"  The dude's obivious no-clue answer was, \"we have not determined that yet.\"  What!?  How is it possible that the game is \"on the boat\" and you have no clue how many copies of the cards are in it?\n\n \n\nOkay.  Gameplay stuff:\n\nPlayers take simultaneous turns with one being the Active player, which passes back and forth.\n\nPlayers are battling a \"Quest\" deck which is really 3 cards that get progressively harder to beat (have more \"hit-points\").  Each turn, you flip 1 card per player from the Shadow deck which could be a creature (which blocks for the quest deck), a location (which blocks for the quest deck), or some events which can be really nasty.  The tricky part is that the Quest phase and Combat phase are separate events and use separate hero abilities, so I'll describe the hero,s a bit:\n\nIn the upper left box of the hero cards there are three stats.  The crossed axes is attack, the shield is defence, and the sun is your -I do't remember what it is called- attack on quests.\n\nBefore you flip shadow cards you must choose which characters are going on the quest.  They exhaust to do this, so they are not available for combat after the quest phase.  After you commit, you flip shadow cards.  So the shadow may flip more blockers or not.  Add up your suns, add up the shadows block, deal any extra suns as  \"damage\" to the quest.\n\nMonsters in the center jump out and attack.  They attack first, you chose a blocker and must exhaust to block.  If you have anyone left un-exhausted after blocking, you may exhaust to attack back.\n\n \n\nThat's basically it.  Repeat until you die or win.  Of course, the demo decks were tuned in the players favor, but I don't think the real game will be.\n\nAlso, unique is unique.  Players cannot have the same characters in play.\n\n \n\nChevee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338844","commentId":338844,"userName":"Frank36","timestamp":1281084891,"content":"Thank you very much for the info.\n\nIs there some \"theme\" in the game, some sort of visible story/questline or is it all \"random\" ?\n\nIs the art of all cards as good as we can see on the FF-site ?\n\nIt sounds very easy, do you think it will be harder to beat the quests with the complete set ?\n\n \n\nPS: I like the \"unique\"-rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338845","commentId":338845,"userName":"Frog","timestamp":1281084938,"content":"That's basically it.  Repeat until you die or win.  Of course, the demo decks were tuned in the players favor, but I don't think the real game will be.\n\n \n\nAlso, unique is unique.  Players cannot have the same characters in play.\n\n \n\nChevee\n\n \n\n \n\nIs there region/site movement or usage a of a map to travel across middle earth like MECCG?\n\nDo you have allies/factions like middle earth ccg?\n\nIs there items you can equip/use?\n\nAre there none battle quests?\n\nIs there corruption like MECCG?  (carrying to many items ie being greedy makes you succeptable to Sauron's evil)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338852","commentId":338852,"userName":"Dam the Man","timestamp":1281085699,"content":"Random_Person said:\n\n Okay, honestly, my first question to the dude in blue was, \"how many base sets do I need to buy to get a full playset.\"  The dude's obivious no-clue answer was, \"we have not determined that yet.\"  What!?  How is it possible that the game is \"on the boat\" and you have no clue how many copies of the cards are in it?\n\nI don't think the game has even seen a boat yet. Looking at the Upcoming tab from the top of the page, LotR isn't even listed in there yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338857","commentId":338857,"userName":"Chevee","timestamp":1281086465,"content":" The quests have story written on them.  You read one side, then flip, read the rest and do whatever it says.  It may give bonuses to things, or put more shadow cards in play or whatever.  The demo quest was a travel through Mirkwood.  So, there were tons of spiders and such.\n\nThere is a \"travel\" in which locations that come out on a quest, you may travel too.  Instead of being a blocker for hte quest, they add hit points to the quest.  You may assign damage as you like, so you can chose to kill the location first.  The ones I saw did nothing other than block.  Really, you must exhaust a hero to travel to the site and you move it up towards the quest stack to signify it is no longer blocking.\n\nThe artwork is just as awesome as you've seen.\n\nI did not see any \"items\" but that does not mean they don't exist.  Given the theme, I'm certain they do because there were \"attachments\" that were themed as blessings or spells.\n\nThere is \"Thread Level\" in this game that is similar to corruption I guess.  You start with 3 Heroes and your threat level is the total of their cost (upper right I think.)  You gain 1 threat per turn and can play things to reduce or increase threat based on their power.  Monsters attack whomever has the highest threat and also will not attack unless a player has threat equal to or greater than the monsters threat (upper right again, I think)\n\nYes there are allies and factions.  Factions mean nothing by themselves, you can combine whatever you want, but there are cards that may only be played on factions.  The resourcing of the game is based on your heroes.  Each hero generates 1 resource per turn of their \"Sphere of Influence.\"  You get to keep leftovers, so the pool builds up.  To pay for a card, it's entire cost must be paid with the appropriate sphere's resources.\n\n \n\nChevee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338860","commentId":338860,"userName":"Frog","timestamp":1281086984,"content":"Cool that sounds more like MECCG but faster.  I am definitly interested!\n\n(No, I will not let go of my MECCG cards either.  You can play that one solo as well!)\n\n:P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338864","commentId":338864,"userName":"Frank36","timestamp":1281087290,"content":"Again: Thank you.\n\nNot so easy at all. I like it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338865","commentId":338865,"userName":"Eryx_UK","timestamp":1281087478,"content":"I'm curious how it will work with extra packs. Will you just add them to the threat deck or do you have to build the threat deck, and if the latter how do you stop yourself from putting easy to beat threats in?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338867","commentId":338867,"userName":"Barbacuo","timestamp":1281087676,"content":"The_Big_Show said:\n\nI'm curious how it will work with extra packs. Will you just add them to the threat deck or do you have to build the threat deck, and if the latter how do you stop yourself from putting easy to beat threats in?\n\n\n\nMAybe it will depend on if you like rushing your threat deck o enjoy challenges. I should wait for the complete rule text about deck building thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=338933","commentId":338933,"userName":"Karazax","timestamp":1281098015,"content":" Great to hear some news, looking forward to any pictures and other details about the game.  \n\n \n\nI can imagine the possibility of assigning the shadow cards point values, so that the ultimate objective would be to try and get the highest score, which would be done by making the toughest shadow deck possible.  Or perhaps different FFG designed premade shadow decks for different scenarios.  I'm certainly excited to hear more info."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339087","commentId":339087,"userName":"Talarius","timestamp":1281116031,"content":"Thanks for the early insights, guys.\n\nAs a MECCG player, I've got both my eyes on the internet today, desperate for more info on this game.\n\nLotR LCG sounds less complex than MECCG (which I love, so less complexity is not a plus) but there's enough going on there that I have some hope.  Exhausting to travel, exhausting to fight combats that block the quest, exhausting to attack the quest... these are definite echoes of MECCG imho, so... so far, so good!  Hope to hear more, more, more!\n\n(and judging by the Horn of Gondor card in the intro article, yes, there must be items that attach to the heroes)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339103","commentId":339103,"userName":"Armydillo978","timestamp":1281118052,"content":"This game has me excited.  It sounds right up my alley.  Which hero's/allies did they have in the demo decks?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339119","commentId":339119,"userName":"Toqtamish","timestamp":1281119977,"content":"The gencon day 2 video has LotR stuff at 2 min 40 seconds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339132","commentId":339132,"userName":"Armydillo978","timestamp":1281121915,"content":"Toqtamish said:\n\nThe gencon day 2 video has LotR stuff at 2 min 40 seconds.\n\n\n\n \n\nBummer.   Work filters won't let me watch it.  I'll have to wait till I get home.  Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339163","commentId":339163,"userName":"dystroya","timestamp":1281127134,"content":"I have yet to try one of the LCG's. I want to try Warhammer, but I love the idea of a game two people can enjoy and not have to battle one another, similar to Shadows Over Camelot board game. I live 30 minutes away from downtown Indianapolis, so I can't wait to check it out tomorrow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339207","commentId":339207,"userName":"Drakson","timestamp":1281134234,"content":"In the video it show the card game being played on a mat or was that a game board? I wonder if that comes with it or if it was just made for the demos to help new players play at Gencon.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339226","commentId":339226,"userName":"Chevee","timestamp":1281140186,"content":"They have the tables wrapped in printed paper.  I would assume that does not come with the game.  The demo stuff is incomplete, so I'm not sure what does come with the game.  For instance, we used Warhammer damage tokens and generic gold tokens from Citadels during play, not the cool stuff you see in the stills they posted earlier.\n\n \n\nComparing it to MECCG does not work well.  Vastly different and MECCG was more complex. \n\nConsidering the quest we were playing was some woods-I honestly do not remember if it was supposed to be Mirkwood or not-and the shadow deck had a bunch of spiders and stuff in it, I would assume that the Shadow deck is fixed.  Pure conjecture.  I'll try to remember some of these questions tomorrow and ask.  They have rulebooks lying around I could likely sit and read without anyone batting an eye.\n\nChevee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339321","commentId":339321,"userName":"Karazax","timestamp":1281172533,"content":" There is some additional discussion the the game from other gencon participants here [http://boardgamegeek.com/thread/551101/comments-from-someone-at-gencon-who-got-to-play-th].  According to what is posted the game will slowly cover Middle Earth starting with Mirkwood in the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339394","commentId":339394,"userName":"Chevee","timestamp":1281188653,"content":"Okay, I spoke to Nate French a bit about the format and also card distribution.\n\n \n\nThe base game comes with 4 \"preconstructed decks\" and three quests.  The quests have a Shadow pack that goes with them and so when you pick your quest cards, you use the pack for each of the 3 cards to build the shadow deck.\n\nThe preconstructed decks have singles, so 3 base sets will be required for a full playset, but the packs will be all 3 ofs, like the rest of the LCGs now.\n\nAlso, the shadow cards  have symbols that are associated with the quests like a Spider or Orc and you will be able to mix in later Spider cards to the shadow deck when facing a spider quest.\n\n \n\nFor competitive play, Nate said they were leaning towards what I assumed.  There would be a new quest you have never seen before at the event.  Build what you hope is the best deck, show up and get a quest assigned and go at it.  The quests would also be prizes to be reprinted later, but special for that event.  I like that a lot.  It is a elegant way to add story to the game. \n\n \n\nThat's it for now.  I haven't re-demoed so it's all I've got.\n\n \n\nChevee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=339476","commentId":339476,"userName":"qwertyuiop","timestamp":1281206248,"content":"  I want to go to there. This will be great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=340065","commentId":340065,"userName":"Chevee","timestamp":1281336776,"content":"  So, I never made it back to take a re-run at the game, but I did snap a few overheads on my camera in passing.  Quality is horrible and glare is bad, but this may be of use to somebody.  If these bring up any more questions, I'll do my best to answer.\n\n \n\nhttp://i10.photobucket.com/albums/a102/cheveedodd/GenCon%202010/22284903190_ORIG.jpg [http://i10.photobucket.com/albums/a102/cheveedodd/GenCon%202010/22284903190_ORIG.jpg]\n\nhttp://i10.photobucket.com/albums/a102/cheveedodd/GenCon%202010/22284903196_ORIG.jpg [http://i10.photobucket.com/albums/a102/cheveedodd/GenCon%202010/22284903196_ORIG.jpg]\n\n \n\nChevee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33581-cant-wait-to-see-previews-at-gen-con/?do=findComment&comment=340227","commentId":340227,"userName":"mrkensr","timestamp":1281354832,"content":"Just back from GenCon..preview of this was strange at first, but the co-op idea was very cool. There were a few hang ups that even the demo people\n\nhad struggled with. I liked the concept and prolly would try to see where this goes."}]}