{"url":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/","title":"trippy introductory video?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=338546","commentId":338546,"userName":"MarthWMaster","timestamp":1281027947,"content":"One of the things that really drew me to Call of Cthulhu: The Card Game was the immersive video demonstration that accompanied its release. I'd be most enthused if they were to give something similar for The Lord of the Rings, with an explanation of the rules of play, background info on the LCG format, etc. All narrated by Gandalf, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=338581","commentId":338581,"userName":"Toqtamish","timestamp":1281032383,"content":"Well they did the same thing for AGoT and Warhammer so seems quite likely we will see one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=338613","commentId":338613,"userName":"josey wales","timestamp":1281038606,"content":"The videos do seem to be standard for the LCGs.  The others were excellent; the rules thoroughly explained with fantastic visuals.  I can't wait to see one for this game.  Of course, I  don't need any  extra persuasion, this was a must have from the moment I saw the banner on the home page."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=338673","commentId":338673,"userName":"Artemus Maximus","timestamp":1281050704,"content":"absolutely agree - i felt like i could almost play a game of WH:I after seeing its videos. In fact, when i finally got the core set, i just glanced the rules & started playing - and without too many errors when following the nitty-gritty stuff included now in the FAQ.\n\nPoint being, their videos are superb - a casual player really need only watch videos to have a good fun game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] In fact i wish i couldve shown the videos to people ive taught & got into the game, as they accomplish that so much better than i can gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=339312","commentId":339312,"userName":"Hellfury","timestamp":1281170231,"content":"From a marketing perspective, it makes playing some of these games far more palatable once an instructional video is in place.\n\nGiven the lack of COC players in my area, I doubt I would have even bought the game if it wasnt for the instructional videos. They explain the game very well and I refer potential players to them all the time so that they can make up their own minds if they like the mechanics or not.\n\nAll game companies should do this and FFG should do this for most if not all of their games since their rule books are notorious for being unintuitive.\n\nI know they cannot be cheap to produce, but they can only help sales of a game. Its a one time marketing expenditure that makes sense. Advertising and instructional all wrapped up into one tidy package."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=340414","commentId":340414,"userName":"ItsTheDukester","timestamp":1281368181,"content":" I'll pile on and add my agreement.\n\nThe video for Cthulhu was so good, in fact, that it convinced me to buy the game. And I felt like I knew how to play by the time I tore off the shrink.\n\nHere's hoping FFG has plans for this sort of thing in the pipeline.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=340417","commentId":340417,"userName":"Frog","timestamp":1281368417,"content":"I almost bought into that Eldritch Void known as Call of Cthulhu LCG based on their tutorial video.\n\nThankfully, I came to my senses and realized I'd never find anyone to play it with and did not fall prey to the Shoggoth pits!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33638-trippy-introductory-video/?do=findComment&comment=341516","commentId":341516,"userName":"Rumb13stiltzkin","timestamp":1281513299,"content":"Frog said:\n\nI almost bought into that Eldritch Void known as Call of Cthulhu LCG based on their tutorial video.\n\nThankfully, I came to my senses and realized I'd never find anyone to play it with and did not fall prey to the Shoggoth pits!\n\n\n\nHaha! Then it looks like you had more foresight than I did. I new for certain I'd be able to game with my girlfriend but outside of that, we're still looking into hobby shops. >.<\n\n "}]}