{"url":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/","title":"What i remember of the game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=342543","commentId":342543,"userName":"vermillian2","timestamp":1281626793,"content":"Heya, so I'll give you my analysis of the game!\n\nIt first starts with all of our heros we were using. There were other characters on the other side of our heros, but the instructions for demo recommended Argorn, some elf, and some other dude theodray or something?... Aregorn had 12 shadow, 5 hit points, 2 wisdom, 3 attack, 2 defense (not actual stat names, but close enough). His ability was that he didn't exhaust when he committed to quests. The elf healed one of your guys a damage when it was committed to a story, and the other guy let you discard a card to add a resource token to a hero (any it seems not just yours). The elf was Spiritual (Blue) sphere of influence, and the other two were  Purple... Leadership iirc.\n\nThe starting quest had us facing down a forest spider and an old forest road. The spider had 3 hit points, 1 armour, 2 attack, 2 threat. The location had 1 threat and an ability that granted the first player of that turn some card draw or something when we'd traveled there.\n\nWe'd play some cards, maybe some 2 cost purple unit that had some generic stats (IIRC 1 attack 1 defense 1 wisdom 3 hitpoints) or maybe a Seal of Gondor (exhaust the seal to add a resource to the hero its on) or Blessing of [something] (+1 wisdom to attached hero). Some other cards I remember were tactics that cancenled when revealed effects of shadow, that canceled shadow effects, ones that reduced your threat and readied a hero, let you draw two cards after an ally left play, an ally that allotted a progress token to all locations and the active quest, some archers which could attack when another player attacked...\n\nWe'd send in Aregorn and then elf usually (they both had 2 wisdom each) for quests, over powering the Shadow threat there by 4 initially, hoping stuff didn't go bad for us when more shadow cards were revealed. 2 more cards were thrown in (if there were two players) their \"when revealed\" effects resolved (sometimes decreasing each hero's willpower by 1, sometimes requiring that we all exhaust a character, sometimes requiring we all remove someone from the quest), and then we'd compare our willpower to the new threat. Sometimes progress was made, sometimes it was break even (if your will is greater than the threat, you apply the excess as progress to the quest). If it was too low all of your threat meters go up by that amount it was shy.\n\nFirst you Travel. Players may choose ONE locaiton in the staging area (where the shadow encounter deck cards are initially). It gets moved out of the staging area and placed next to the quest card. Progress tokens are added to the location now, first, instead of the quest, until the location gets its own progress requirements done. This slows down your progress on the quest, but by traveling you at least don't have that extra threat sitting there for next time you quest. You may also encounter the enemies there. One by one players choose to encounter an enemy, moving it off the staging area and in front of their.. for a lack of a better term Party. This also removes its Threat from impeding your Progress but is now going to have it pummel you. The third step after selecting Enemies to encounter is for any in the staging area to come visit you. If a player's threat is high, the enemies might come visit you. Each enemy has its own threat threshold (usually like 35 or 40, but some are low like 10). They will visit you if your threat is higher than its threshold (you start at 31 = the sum of your heros starting threat, and it goes up by one each turn, and more if you suck at questing. see above). There may still be some enemies in the staging area. There was one particularly nasty one that would deal 5 damage to a hero the first time it encounters that player... that would kill off one Hero... its threat threshold was 40... best to avoid it and leave it in the staging area (it only had a will power threat resistence of 1).\n\nNow the combat. One by one the enemies would get the top card of the encounter deck face down on them. One by one player's would exhaust a character to defend (hero or ally). That enemy would reveal its shadow effect (special text on every other card on encounter cards), do its attack minus the defenders defense in damage. Then repeat for each enemy. Then player's fight back. They would exhaust any number of their characters to attack enemies, adding up their attack, subtracting defense of enemy, and dealing that much damage. Some enemies had 3 HP, some 5, one nasty boss spider had 9... and also it had 3 defense... and 5 attack btw...\n\nAnd viola. Get resources (one per Hero), play Ally or attachments, Questing, encounter cards added to staging area, results applied to quest card or locations you are travelling at, monsters encountered, defend against monster attacks, attack back. repeat.\n\nHope that gives you some idea of the mechanics. sorry i couldn't remember names of some stats... game on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=342590","commentId":342590,"userName":"Frank36","timestamp":1281631103,"content":"Do you like it ?\n\nIs the art of all cards as good as we have seen on the FFG-website ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=342618","commentId":342618,"userName":"CrowOfPyke","timestamp":1281634342,"content":"Frank6 said:\n\nDo you like it ?\n\nIs the art of all cards as good as we have seen on the FFG-website ?\n\n\n\n \n\nI personally loved the game.  I think it is a great co-op game, not a good one, a great one.\n\n \n\nThe art is every bit as good as displayed on the FFG website."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=342660","commentId":342660,"userName":"CrowOfPyke","timestamp":1281637271,"content":"Here is what I remember about the play of the game:\n\n \n\nThere is a enemy deck played in the middle of the table.  Next to this is the 3 quests you must defeat/overcome to win the game.  See the photos in this thread here to see the board set up:  board images [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=359210&efpag=1]\n\nYou start with 3 heroes in play.  For the demo it was Aragorn, Theodred Crown Prince of Rohan, and Cereborn.  You draw a hand of cards from your deck (I don't remember how many at start).  Start your threat meter at 31.\n\nStart of turn: Untap heroes.  Gain resources, one per hero.  The type of resource the hero has/uses is printed on the hero's card.  Draw one card.  Increase your threat meter by 1.  Play cards from your hand, minding the *type* of resources you have available to play cards.  Events, Interrupts/Reactions, Heroes/Allies, etc are all options.\n\nEach player decides which of his heroes will go on quest.  (Aragorn doesn't tap to quest, Cereborn heals 1 damage from any character when he taps to go on quest).  Total up the Willpower of all characters that went on quest, from both players together.  Draw the top two cards off the enemy deck and play them in the staging area right below the quest cards (see the image link above).  Resolve any immediate effects on the two cards drawn, if any.  Total up the resistance (number by the black crown symbolm - Threat... I think....) of the enemy cards and the quest card.  Compare willpower vs resistance.  If willpower is higher, the excess is placed on the quest card as progress markers.  If willpower is equal to or less than resistance, no progress is made on the quest.  Each turn, more and more and more cards will end up in the Staging Area, slowing your progress.  So you have to get rid of the cards in the Staging Area slowing you and your partner down.\n\nThere are locations in the enemy deck as well that are played to the staging area when drawn.  These locations of course provide resistance (the number next to the black crown icon).  You get rid of locations by traveling there after the quest.  The locations had various effects when played, when traveled to for the first time, when defeated, etc.  When you travel to a location is placed next to the quest card as the \"Active Location\".  Then the next turn when you go on quest, all the progress counters you get go on the location FIRST, then the quest card if any are remaining.  This is how you get rid of location cards blocking your progress... mostly.  (I will get to the other way to get rid of locations later.)\n\nThere are creatures in the enemy deck that are played to the staging area.  Creatures can range from spiders, orcs, trolls, etc.  They have a resistance rating which impedes your quest progress.  They have Health, Defense and Attack ratings.  They also might have special abilities which will effect play.  They also have a Threat rating.  After the quest phase and after traveling to locations, you have combat.  If your hero party Threat rating is higher than a given monster in the Staging Area, that monster will attack your heroes.  You can also optionally attack a monster and take it on, even if your Threat rating is lower than the monster's.  If both players have the same Threat rating and a monster will attack them, then the monster goes after the player who is currently First Player.\n\nCombat:  First take the top card off the enemy deck and place it next to the monster you are fighting.  Decide which of your heroes will defend.  Flip over that enemy card and apply any special effects it has, if any, and then discard it.  Compare the monster's attack rating to the defending hero's defense rating.  Place damage on the defending hero, if any.  Decide which hero, or heroes, you control will Attack.  Compare the total Attack rating of all heroes combined to the defense rating of the monster.  Place any damage  on the monster.  If that is enough damage to equal the monster's health, then monster dies and is discarded.  If not, the monster hangs around to the next turn.\n\nPlay pretty much proceeds like that from turn to turn.\n\n \n\nWhat I remember about some cards:\n\nGandalf is a one turn ally.  Gandalf is also one big B.A.M.F. and well worth his rather expensive 6 resource cost.  I played him once to great effect and then brought him back later with an event card that allowed me to dig an ally card out of my discard pile and put it into play.\n\nThere was one ally card, a group of elves I think, which allowed you to put one progress counter on every Forest location in play and on the current quest when this ally was put into play.  This was HUGE.  One free progress token on the current quest at a key moment of struggle can be HUGE.  Also getting one free progress token on every Forest location was huge in the demo because all of the locations in the demo were Forest locations.  We cleared out a quest when we were pretty blocked at the moment.  We also cleared out about 4 locations with these guys.  They also had a Willpower rating of 2, so very useful on quests from turn to turn as well.  Very cool hero/ally.\n\nThere was one event/reaction card that would allow you to cancel the shadow effect of the enemy card just played.  That saved our bacon a couple of times as well.\n\n \n\nThat's about it for now.  If anyone has more questions, just let me know here.\n\n \n\nI am looking forward to this game in a BIG way!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=342839","commentId":342839,"userName":"Frank36","timestamp":1281667243,"content":"Very detailed report.\n\nThank you very much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=342943","commentId":342943,"userName":"2@tiscali.itmajo","timestamp":1281685758,"content":"Thank you for sharing the info."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=343278","commentId":343278,"userName":"Dasor","timestamp":1281720942,"content":"It seems to be a GREAT game!!\n\nI will buy it for sure just as it comes out\n\nI hope they will translate the game in Italian as soon as possibile ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=343389","commentId":343389,"userName":"vermillian2","timestamp":1281735887,"content":" Or chinese... i mean that's who we're all owned by right now anyhow, right? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=344679","commentId":344679,"userName":"jgt7771","timestamp":1281975575,"content":"Vermillian, CrowOfPyke, thank you SO much.  Having a much better idea of what the gameplay is, I have a much better idea of how this might work as a Living Card Game.  Much more relaxed (and excited) about investing in this now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=345717","commentId":345717,"userName":"atomicker","timestamp":1282139167,"content":"Thanks guys for all the work you put into those demo reports. Very much appreciated! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=346260","commentId":346260,"userName":"Shub-Niggurath","timestamp":1282233649,"content":"Great post, made interesting readingaplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif] - thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=346323","commentId":346323,"userName":"Saintsman","timestamp":1282246911,"content":"While the game is still in the testing phase, anyone recall cards and their effects?  Appreciate it in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=349039","commentId":349039,"userName":"Tiziano2","timestamp":1282805740,"content":"I remember 'elven archers' I think it was called, it can strike a monster card that is attacking another player. We used it repeatedly and loved it.\n\nCeleborn takes away wounds, and there is another card that cancels a just-appeared shadow card effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=351195","commentId":351195,"userName":"dj2.0","timestamp":1283228060,"content":"jgt7771 said:\n\nVermillian, CrowOfPyke, thank you SO much.  Having a much better idea of what the gameplay is, I have a much better idea of how this might work as a Living Card Game.  Much more relaxed (and excited) about investing in this now.\n\n\n\nSnap - this was the last check on my list:\n\nSolo? check\n\nCo-op? check\n\nCool Theme? check\n\nCool Art? check\n\nGameplay? check.\n\nFull house. Its sold."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=383494","commentId":383494,"userName":"Narsil0420","timestamp":1289265102,"content":"CrowOfPyke said:\n\nThat's about it for now.  If anyone has more questions, just let me know here.\n\n \n\n \n\nCrowofPyke or Vermillian -\n\nI was wondering if you could look at the Gimli Card, for example, and tell us what each of the numbers represents on a hero card, if you can remember.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=383620","commentId":383620,"userName":"jogo","timestamp":1289298100,"content":"I am not one of them but:\nAttack - used to hit monsters\nDefense - used to block monster hits\nWillpower - used to advance quest\nHitpoints - used to be not dead"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=383718","commentId":383718,"userName":"Narsil0420","timestamp":1289317118,"content":"So the big red number on the card is the hit points (or health) and the number next to the sun image is willpower?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=383769","commentId":383769,"userName":"jogo","timestamp":1289326025,"content":"Yep.\n\nIf I remember right Eowyn has 4 willpower and all other heros (in the dome game) 1 or 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=386551","commentId":386551,"userName":"Big Whoop2","timestamp":1290018862,"content":"registered here when i saw this game. im excited. hope it plays as good as it looks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/33956-what-i-remember-of-the-game/?do=findComment&comment=388830","commentId":388830,"userName":"Narsil0420","timestamp":1290516872,"content":"For anyone who played the demo:\n\nWhat else do you remember about how the players interact? Can they help each other out in combat in any way? What can a player do when it's the other player's turn?\n "}]}