{"url":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/","title":"EOWYN + THORIN = ...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384189","commentId":384189,"userName":"Wallenstein","timestamp":1289445178,"content":"2941 - Bilbo's journey, Thorin's death.\n\n2995 - Eowyn birth\n\nIf the game is set before the Battle of the Five Armies, why this two characters appears together?\n\nHello designers. Did you ever read this book?\n\nMaybe in first expansion we will see Gil-Galad, because why not?  aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384245","commentId":384245,"userName":"FloLeBlanc","timestamp":1289459314,"content":"Imagine the ton of additional rules if every character they do has to fit into a timeline for deck construction purposes.\nThis is common to LCG's/TCG's, see A Game of Thrones for example. Some characters are present in multiple versions, some that died in the books can fight people who get introduced later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384318","commentId":384318,"userName":"Wallenstein","timestamp":1289469709,"content":"But adding character into period where he doesn't exist is for me prove that designers have lack of ideas how this game should look.\n\nMaybe I'm wrong, but Eowyn could be any other hero with generic name.\n\n \n\nAGOT - I very like this game, but two unique characters in the same time controlled by two players is not good solution. AGOT LCG have no specific time set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384392","commentId":384392,"userName":"Dam the Man","timestamp":1289485708,"content":"It's nothing new, in Meccg you could have Thrain II running with Merry and Pippin for example (or Bergil son of Beregond who sure as hell wasn't alive when Thrain was still kicking it)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384433","commentId":384433,"userName":"atomicker","timestamp":1289491899,"content":"I agree with Wallenstein... of course I haven't seen the game yet, but I wonder if this kind of thing hints at a lack of creative thinking about the property on the part of the LCG designers. Instead of comparing LOTR to AGOT, I would like to point to Decipher's approach to the huge Star Trek timeline in their original CCG, where (if I remember my Trek correctly) characters and ships from different time periods were marked by icons that restricted where they could enter play. You couldn't put Archer, Kirk and Picard in the same deck without including some kind of card effect to allow it. Would it really have been so difficult to do something similar with Tolkien's Middle Earth? Start with LOTR-era-bugged characters, then release a Hobbit-era set or two, then a Second Age set, and on and on. Something like that could have added a modest new layer of complexity to deck building, been true to Tolkien's detailed setting, and (if timed correctly) would have offered FFG additional marketing opportunities around the upcoming movies.\n\nJust my two cents...  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384439","commentId":384439,"userName":"Dam the Man","timestamp":1289492781,"content":"On the flipside, it would also restrict the players' options when putting together decks. Freedom of choice was one of the key strengths of Meccg, you could pretty much pick the party you liked, without having to be limited to a certain timeline set of characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384580","commentId":384580,"userName":"Narsil0420","timestamp":1289529141,"content":" Yeah, I feel like this is being a little nitpicky...\n\nIf you're that concerned, you can construct your deck so that you only use characters that lived at the same time, in the same region and actually encountered each other in the lore of Middle Earth. Also you should make sure that you only use characters that actually went through the region that the quest takes place in. Also, only use Item that the corresponding character actually used, and event cards that that character actually took place in. I love Tolkien's world as much as the next man but let's just enjoy a game shall we?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384585","commentId":384585,"userName":"jhaelen","timestamp":1289530208,"content":"Wallenstein said:\n\nBut adding character into period where he doesn't exist is for me prove that designers have lack of ideas how this game should look.\n\n\n\nTo me it proves the opposite: The designers know when it is advisable to ignore 'history' to make for a better game. It's just like the changes Peter Jackson made to the storyline when he translated the novels into a movie: Different media require different approaches to fully utilize the media's strengths.\n\nIt wouldn't make any sense for such a game to restrict gameplay to only allow card combinations that follow a timeline. It would counter the point of an LCG, i.e. mixing and matching cards in any way you like."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384813","commentId":384813,"userName":"atomicker","timestamp":1289584318,"content":"I guess what surprises me most about this thread is seeing responses arguing that an increase in faithfulness to the source material would obviously damage this new LOTR card game. Is Tolkien's world really that much of an obstacle to gameplay? Is confidence in the abilities of FFG's game designers really that low? If so, maybe FFG would be better off saving themselves the LOTR licensing fee and making a Descent LCG instead... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI think FFG designers have already done a fantastic job translating extremely complex licenses (like Battlestar Galactica) into very playable games, and I have every confidence in their abilities to deliver a high quality product. It's too early to tell where they're headed with the LOTR LCG, but I agree with Wallenstein in that I don't think throwing out the timeline hints at a game I will find very interesting... I will always be a Tolkien fan first and a gamer second. But if FFG's aiming to hook general fantasy gamers with a casual interest in LOTR, then a light game with minimal story content might work out. There certainly seems to be no lack of support for that approach in this thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384924","commentId":384924,"userName":"jogo","timestamp":1289635994,"content":"I am a gamer first and a tolkien disliker(except hobbit) second.\nSo I am not at all interested in timelines and I hope FFG keeps out complicated things in deckbuilding due to some timelines. Game first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=384980","commentId":384980,"userName":"Darthvegeta800","timestamp":1289648486,"content":"Despite being a huge Tolkien fan, I don't really mind much.\nIt's a bit nitpicky I think.\nIn any case let's judge AFTER release?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=385261","commentId":385261,"userName":"Toqtamish","timestamp":1289737620,"content":"Also the game is set between the end of the hobbit and just before the start of the fellowship of the ring so it covers a somewhat larger time frame than the Op suggested."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=385272","commentId":385272,"userName":"ultimateigor","timestamp":1289740468,"content":"In that case, surely Thorin would already be dead? Same problem, different cause."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=385443","commentId":385443,"userName":"Wallenstein","timestamp":1289787368,"content":"If set after \"Hobbit\" it could be alternative history that Thorin didn't die. But moving one characters a few years back just because.... Because what?\n\nIf I want to play historical game about Ceasear I do not expect that I met Hannibal. \n\nIt is like Vader + Qui-Gon Jinn in the same fight. Nice but stupid.\n\n \n\nI simply expect the designers will do not bend \"reality\" only to sell their product.\n\njhaelen said:\n\nThe designers know when it is advisable to ignore 'history' to make for a better game. It's just like the changes Peter Jackson made to the storyline when he translated the novels into a movie: Different media require different approaches to fully utilize the media's strengths\n\n\n\nI also do not liked flood made by Army of the Dead in Minas Tirith. One of many examples of Peter Jackson fully utilization of media's strengths, saddly so stupid. My fried who didn't read book ask me after that: Why they care if they have such powerful superweapon?  preocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=385470","commentId":385470,"userName":"Artorius","timestamp":1289795014,"content":"I am a Tolkien fan too and I don't see any problem with Thorin and Eowyn together. \n\nAnd if you read the article \"Build your Felloship\"  (I don't know how to post the link...) they say that the game it set NEAR the end of The Hobbit and just before the beginning The Lord of the Ring. \n\nSorry for poor my english, not my first language =)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=385627","commentId":385627,"userName":"Wallenstein","timestamp":1289828193,"content":"Artorius said:\n\nAnd if you read the article \"Build your Felloship\"  (I don't know how to post the link...) they say that the game it set NEAR the end of The Hobbit and just before the beginning The Lord of the Ring. \n\n\n\nIf yes, it is true that Thorin alternatively do not die at the end of \"Hobbit\", and can live long enough to met Eowyn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=386334","commentId":386334,"userName":"Martin_fr","timestamp":1289983092,"content":"MECCG was built upon a \"what if...\" universe. Plus the only timetable the authors specified was \"the free peoples tried to orginaze to resist to Sauron\" (the One Ring isn't even found at the start of the game).\n\nLOTR (Decipher) was based upon the movies, so the timeline was a lot more specified and respected.\n\nLOTR (FFG) is specifying a timeline (between Hobbit and LotR) which is a mistake to me : this will generate subject like this one (isn't Thorin dead at the end of the Hobbit) and brings nothing to the game.\n\nAnyway, I didn't kill my eyes on the appendixes of the LotR book, so I didn't pay attention Eowyn was so youth. And I don't care about this detail, as it won't prevent me from enjoying (or not) this upcoming game.\n\nThe bright-side is that we'll play with famous characters (Thorin II) instead of some generic FFG-created \"dwarf-lord\" with equal stats and role."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=386696","commentId":386696,"userName":"Narsil0420","timestamp":1290057371,"content":" This is interesting from the description page:\n\n\"Instead of directly retelling the classic stories that have previously been narrated, this game provides players with a variety of elements—characters, settings, enemies, events, items, artifacts, scenarios—that allow them to embark upon new adventures and share new experiences with these beloved characters during this ominous period of Middle-earth history.\"\n\nI think they might have just added this recently because I don't remember this from the first time I read the page...\n\nI guess they heard you Wallenstein!\n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=386932","commentId":386932,"userName":"NinjaDorg","timestamp":1290096939,"content":" This is an outrage!  According to the rules Aragorn can DIE!!!   This never happened before the events of LOTR so I will NOT be buying this!  Foolish designers!!  I can't BELIEVE they designed a game where Aragorn can die, etc etc etc.\n\nSeriously though, this game looks awesome.  So awesome I had to come back to the FFG forums to join the inane banter because I'm that hyped by it.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=387180","commentId":387180,"userName":"Wallenstein","timestamp":1290144035,"content":"NinjaDorg said:\n\n This is an outrage!  According to the rules Aragorn can DIE!!!   This never happened before the events of LOTR so I will NOT be buying this!  Foolish designers!!  I can't BELIEVE they designed a game where Aragorn can die, etc etc etc.\n\nSeriously though, this game looks awesome.  So awesome I had to come back to the FFG forums to join the inane banter because I'm that hyped by it.\n\n \n\nIf game is setup in specific period of tmie I expect that every character belongs to this frame.\nI don’t like mixing characters from different realities (like prvious example Vader and Qui-Gon Jinn).\n\n \n\nIf character will die or not is tottaly diffrent matter.\n\nNow with information that this is period from end of Hobbit till beggining of LOTR, everythink is fine.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=387501","commentId":387501,"userName":"qwertyuiop","timestamp":1290208746,"content":"There are many powers in the world, for good or evil. Some are greater than I am. Against some I have not yet been measured. - Gandalf the Grizzle\n\nI think we can all agree that Gandalf has never been measured against The Time Machine of Old Pukel-land. Problem solved. The solution is time travel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=394477","commentId":394477,"userName":"9thimmortal","timestamp":1291893918,"content":"I agree with one poster that you can make it whatever you want to.\n\nIf you want to make it 'historically accruate' go ahead an do it - only build your fellowship out of people in the same time period.\n\nIf you want to make it a game where you feel you can have fun mixing and matching characters you love, go ahead and do that.\n\nI guess I don't see the issue. *shrug*\n\nI would rather have it this way, and I can choose which era (or playstyle) than be locked into one.  Plusses FAR outweight the minuses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=394732","commentId":394732,"userName":"Spirit Juggler","timestamp":1291954057,"content":"I have to say I personally hope that at some point they will be able to expand into the wide 'Middle Earth' ethos rather than just between Hobbit and Lord of the Rings. There is such a wealth of story with fantastic characters and creatures that it seems a shame to limit it even that much. I have no problem with the idea of mixing characters from different timelines so long as the game is as it's meant to be... Fun. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=438421","commentId":438421,"userName":"Narsil0420","timestamp":1300189674,"content":"Well you guys should be happy. It looks like they basically replaced Thorin with Gloin, they have the exact same attributes. All your complaining about Thorin not fitting the timeline worked!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=438427","commentId":438427,"userName":"Toqtamish","timestamp":1300190059,"content":"They also clarified the time line too. Its further away from the Hobbit than we originally had believed. \"These quests take place during a timespan of 17 years: from when Bilbo celebrates his 111th birthday (and Frodo’s 33rd) to days just prior to Frodo’s leaving the Shire.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=438591","commentId":438591,"userName":"servant of the secret fire","timestamp":1300206979,"content":"Narsil0420 said:\n\nWell you guys should be happy. It looks like they basically replaced Thorin with Gloin, they have the exact same attributes. All your complaining about Thorin not fitting the timeline worked!\n\n\n\nThe promblem is still there.If we want to play the events of that timeline and dont mess with Tolien's lore we can never have Gimli and Legolas in the same party.Gimli and Legolas are in the same starter deck (tactik sphere).If you play your first game with this deck timeline is broken and you are not true at Tolkien's lore.\n\nSo if someone had a promblem with Thorin and Eowyn he must have the same promblem with Legolas and Gimli as their first meeting was at the secret council in Rivendel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=438642","commentId":438642,"userName":"Toqtamish","timestamp":1300212093,"content":"It's just a game folks. I wouldn't let stuff like that bother you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=438747","commentId":438747,"userName":"Wallenstein","timestamp":1300243554,"content":"servant of the secret fire said:\n\nNarsil0420 said:\n\n \n\nWell you guys should be happy. It looks like they basically replaced Thorin with Gloin, they have the exact same attributes. All your complaining about Thorin not fitting the timeline worked!\n\n \n\n \n\nThe promblem is still there.If we want to play the events of that timeline and dont mess with Tolien's lore we can never have Gimli and Legolas in the same party.Gimli and Legolas are in the same starter deck (tactik sphere).If you play your first game with this deck timeline is broken and you are not true at Tolkien's lore.\n\nSo if someone had a promblem with Thorin and Eowyn he must have the same promblem with Legolas and Gimli as their first meeting was at the secret council in Rivendel.\n\n\n\n \n\nMine doubts were about mixing timeline, not alternative history within specified period of time. In short words I didn't liked the idea of having Eowyn birth 50 years earlier.\n\nThere is no possibility to avoid alternative histories (like Gimli-Legolas earlier meeting), because without that choosing of \"historical\" characters would be limited."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=438805","commentId":438805,"userName":"scottindeed","timestamp":1300256998,"content":"It's a shame if the artwork for Thorin has been scrapped, as that was a really nice picture."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439038","commentId":439038,"userName":"servant of the secret fire","timestamp":1300283877,"content":"There is no possibility to avoid alternative histories (like Gimli-Legolas earlier meeting), because without that choosing of \"historical\" characters would be limited.\n\n \n\n \n\nI agree with this.My point was that if a company wants Tolkien's fans happy they must be accurate at lore and historical events.Removing just one of those two has the same results (Tokien's fans maaaad lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]).\n\nSo or they must remove  all inaccurate events,historical characters etc or they must just say that this is a game based on Tolkien's world(not lore) and we can play free any event with any hero (dead or alive)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439053","commentId":439053,"userName":"cootewards","timestamp":1300285832,"content":"servant of the secret fire said:\n\nThere is no possibility to avoid alternative histories (like Gimli-Legolas earlier meeting), because without that choosing of \"historical\" characters would be limited.\n\n \n\n \n\nI agree with this.My point was that if a company wants Tolkien's fans happy they must be accurate at lore and historical events.Removing just one of those two has the same results (Tokien's fans maaaad lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]).\n\nSo or they must remove  all inaccurate events,historical characters etc or they must just say that this is a game based on Tolkien's world(not lore) and we can play free any event with any hero (dead or alive).\n\n\n\nI consider myself a fan of Tolkien's Lord of the Rings works, but I couldn't disagree with you more.  If you want something that is completely accurate to the lore and the events, well read the books. Anyone making a game like that would have a fail, because the person playing the free-peoples would always win against the person playing Sauron's forces.\n\nWhat would be the point?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439071","commentId":439071,"userName":"servant of the secret fire","timestamp":1300287443,"content":"cootewards said:\n\nservant of the secret fire said:\n\n \n\nThere is no possibility to avoid alternative histories (like Gimli-Legolas earlier meeting), because without that choosing of \"historical\" characters would be limited.\n\n \n\n \n\nI agree with this.My point was that if a company wants Tolkien's fans happy they must be accurate at lore and historical events.Removing just one of those two has the same results (Tokien's fans maaaad lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]).\n\nSo or they must remove  all inaccurate events,historical characters etc or they must just say that this is a game based on Tolkien's world(not lore) and we can play free any event with any hero (dead or alive).\n\n \n\n \n\nI consider myself a fan of Tolkien's Lord of the Rings works, but I couldn't disagree with you more.  If you want something that is completely accurate to the lore and the events, well read the books. Anyone making a game like that would have a fail, because the person playing the free-peoples would always win against the person playing Sauron's forces.\n\nWhat would be the point?\n\n\n\nAnd thats why no one can make a game based on Tolkien's lore and have all Tolkien fans happy (that was my point).\n\nI am a big fan of Tolkien's books (not only LOTR but also Silmarilion,Hobit etc) but in a game i can forgive some inaccurate thinks (like Gimli and Legolas in the same party before their first meeting) but i can never accept somethink like Gimli as the ringbearer.\n\nI hope you can understand what i want to say cause my English are poor and i think this is the best way i can explain to you sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439307","commentId":439307,"userName":"cootewards","timestamp":1300335362,"content":"I see so you are only happy to accept very minimal changes from the source material.\n\nGiven that, I'm really interested to know which (if any) Lord of the RIngs games you've ever actually liked?\n\nWhich games have got that level of acurracy, and actual game choice uncertainty of outcome right for you?\n\nAlso if Decipher releasing different ringbearers annoyed you so much the simple answer was not to buy them and stick to just using Frodo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439518","commentId":439518,"userName":"servant of the secret fire","timestamp":1300368442,"content":"cootewards said:\n\nI see so you are only happy to accept very minimal changes from the source material.\n\nGiven that, I'm really interested to know which (if any) Lord of the RIngs games you've ever actually liked?\n\nWhich games have got that level of acurracy, and actual game choice uncertainty of outcome right for you?\n\nAlso if Decipher releasing different ringbearers annoyed you so much the simple answer was not to buy them and stick to just using Frodo.\n\n\n\nI have tested all.The only game  i still play is Desipher's Lotr(with home rules) and ofcourse only Frodo and Sam (if Frodo dies) as ringbearerslengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif].\n\nDesipher's Lotr was a good game until they disided to make Boromir,Gimli,Galadriel and Gandalf ringbearers(worst decision ever) but my decks allways have Frodo as the ringbearer so i can still feel that i play a game close to Tolkien's lore.\n\nAlso i liked the Return of the King and the Two Towers action games from EA cause i had the oportunity to take Gandalf in my hands and kill as many orcs ,uruk hai and trolls as i likegui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif].\n\nOn the other hand Lotr online was a very very bad game(game play sucks,characters are ugly and i dont even want to remember those Hobbit gaurdians tank a Balrogsorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]).i 've spend some time in this game cause the graphics were amazing and you can make a travel threw Middle-Earth and see some places from Tolkien's world.Lotro is now free and if you like to explore Middle-Earth from your pc this is the perfect game but dont even bother with the gameplay.\n\nBFME i think is a nice game but i dont like strategy games so i cant realy tell.\n\nThere are many more games based on Tolkien like LOTR conquest and some board games but i dont want to write a wall of text.\n\nps1:ofcourse this is only my personal opinion and my personal taste\n\nps2:I hope i didnt kill English language"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439598","commentId":439598,"userName":"Toqtamish","timestamp":1300376018,"content":"Making others ringbearers was a good idea and really the only way that Deciphers game could keep going. I love LotR books but I don't think for a game that it needs to be hamstrung by the limitations of following the source material to the letter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439635","commentId":439635,"userName":"servant of the secret fire","timestamp":1300379607,"content":"Toqtamish said:\n\n \n\n and really the only way that Deciphers game could keep going.\n\n \n\n \n\nBut why?You still can have Frodo and Sam as ringbearers at later sets without  any promblem and not keep the game stable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439684","commentId":439684,"userName":"Toqtamish","timestamp":1300384683,"content":"Variety is better. And again, it's a game. It's not the books. It's a game. If that bugs you the movies must have given you a heart attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439696","commentId":439696,"userName":"servant of the secret fire","timestamp":1300387665,"content":"Toqtamish said:\n\nVariety is better. And again, it's a game. It's not the books. It's a game. If that bugs you the movies must have given you a heart attack.\n\n\n\nOfcourse it is just a game but if you were a fan of Thorn and you see a game with Thorn holding a machine gun will you say, oh no promblem it is just a game who cares about mythology?I am not one of those guys who think that thinks like Gimli as ringbearer in a game is blasphemy and those who made it must die with grate pain but i think that some thinks must stay as they are.Again this is only my personal taste and my personal opinion.\n\nAs for the movies yes i think i had 10-11 heart attacks in each moviepartido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439699","commentId":439699,"userName":"YGrams","timestamp":1300388213,"content":" As an avid fan of Tolkien, I have no problem in game terms of this slight change in timelines. It means that we have more access to the characters we know and love, as opposed to being restricted to a small cast of characters. What I am NOT okay with is that despite having been flexible with the timeline to allow more Tolkien characters into the game who would otherwise have not appeared, they still see the need to use their darn stock heroes like Eleanor and Beravor. It's one thing to allow Eowyn, an existing character with an actual history and storyline, to be born a bit earlier; it's another thing entirely to say, \"Oh, there aren't enough characters in Tolkien's mythology. We'd better use the made-up heroes from Middle-earth Quest!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439701","commentId":439701,"userName":"Toqtamish","timestamp":1300388556,"content":"So what, again more variety. Plus of course they want to use their own characters they made them. If I had made characters I would want to use them too. As for Servant, slight difference between Thor, and Tolkien. Thor is a god still worshiped by some. Tolkien is completely fictional characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439711","commentId":439711,"userName":"servant of the secret fire","timestamp":1300390599,"content":"Having characters like Eleanor(if someone can accept another female warrior except Eowyn) is not a big promblem for me.Rohan army or Gondor army had many other warriors who fought at Pelenor fields or in any other war along with the well known heroes wich we can find in the books.So i dont have a promblem if a company wants to give some random names to some random characters if that makes the game more flexible.\n\nBut having Gimli as ringbearer making the journey to Mount Doom and destoying the ring is a totaly different think.\n\nI agree with YGrams 100%"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439715","commentId":439715,"userName":"Toqtamish","timestamp":1300391060,"content":"Well then I fear you guys may have a hard time with this game as well. As I am sure similar things will happen. It's too bad. In a way I feel sorry for you both."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439721","commentId":439721,"userName":"servant of the secret fire","timestamp":1300392174,"content":"Nah dont worry about me i allways find a way to turn thinks in my sidegran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif].I think i'll find a way and my decks will be accurate at Tolkiens lore.Done that in the pastlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38217-eowyn-thorin/?do=findComment&comment=439831","commentId":439831,"userName":"cootewards","timestamp":1300422334,"content":"servant of the secret fire said:\n\nNah dont worry about me i allways find a way to turn thinks in my sidegran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif].I think i'll find a way and my decks will be accurate at Tolkiens lore.Done that in the pastlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif].\n\n\n\nAnother problem solved.\n\nMy work he is done..."}]}