{"url":"https://community.fantasyflightgames.com/topic/38641-curious-about-solo-play/","title":"Curious about solo play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/38641-curious-about-solo-play/?do=findComment&comment=387683","commentId":387683,"userName":"ulramir385","timestamp":1290264903,"content":" Hi, Im new to the LCG system and Im curious how it works. Im particulary interested in the Lord of the Rings as it has a minimum of 1 player.\n\nI used to play some CCG back in the day including Deciphers LOTR and Im quite intrigued what FFG will do with the LOTR franchise"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38641-curious-about-solo-play/?do=findComment&comment=387779","commentId":387779,"userName":"qwertyuiop","timestamp":1290292640,"content":"There's more info about LCGs around the website, but here's the basic idea.  CCGs have randomly distributed packs. You could spend a lot of money trying to get the cards you want while ending up with a mountain of worthless cardboard. LCGs have fixed distribution so no matter which starter box you buy, it will have the same cards. Same goes for new expansions. It keeps the game economical, and in my opinion keeps the game fresh and promotes more  varied deck building.  LOTR is a co-op game, so it can lend itself easily to a one player format."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38641-curious-about-solo-play/?do=findComment&comment=387830","commentId":387830,"userName":"ulramir385","timestamp":1290313606,"content":" I see. Thanks.\n\n \n\nI suppose that means we wont end up having about 50 copies of the same common card etc. That can only be a good thing.\n\nI will miss opening a booster pack though to check out which rare card you get though but you cant win them all I suppose lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38641-curious-about-solo-play/?do=findComment&comment=388587","commentId":388587,"userName":"qwertyuiop","timestamp":1290463907,"content":" Well, just avoid looking at the expansion spoilers. It will make every adventure pack a fun fresh experience!"}]}