{"url":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/","title":"Does Cooperative Play = Less Power Creep?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/?do=findComment&comment=389028","commentId":389028,"userName":"Blutsteigen","timestamp":1290558487,"content":"what do you think? Will future expansions be a bit more balanced, and will the game require less card combos to be long-term playable?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/?do=findComment&comment=389291","commentId":389291,"userName":"Frog","timestamp":1290607621,"content":"The cool thing about the co-op game design is that it will be more about the journey than \"beating the game\".\n\nSo it would seem that the expansions will continue to be fun not because you will get uber-powerful and destroy the game, but more because you now have new companions to travel with, new items to equip, new places to explore, and new foes/goals to defeat.\n\nMany are worried that this will drive away the typical CCG/LCG gamer because they won't feel the need to stack their decks to decimate each other. Even if it does, it will surely hook a new crowd who hates that aspect of card games.  But maybe the scoring system they are working on will bring out the competitive side of gamers for this game.\n\nSo yea, I can't see the normal power creep happening with this.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/?do=findComment&comment=389876","commentId":389876,"userName":"Aluminium2","timestamp":1290755254,"content":" How i understand, game will be quite different from other CCG, and also different from other LCG. It will look more like RPG card game. It makes fantasy journey. And thisis what what i am waiting from it. In this game will be less competitive side, but more co-op, and this will drive away the typical CCG/LCG gamers. Ofcourse , many people will try this game. But how long they will play depends exactly grom competitive side of the game. \n\nBut LOTR fans will try and play it in any case =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/?do=findComment&comment=392138","commentId":392138,"userName":"Rathmaker","timestamp":1291304000,"content":"Aluminium said:\n\n How i understand, game will be quite different from other CCG, and also different from other LCG. It will look more like RPG card game. It makes fantasy journey. And thisis what what i am waiting from it. In this game will be less competitive side, but more co-op, and this will drive away the typical CCG/LCG gamers. Ofcourse , many people will try this game. But how long they will play depends exactly grom competitive side of the game. \n\nBut LOTR fans will try and play it in any case =)\n\n\n\nI am guessing you are pretty close to the mark as far as new cards are concerned.\n\nFor me the appeal to the game, besides being LOTR of course, is that they game feels to play much more like an RPG than a CCG.  Opening up the new set of cards to find Andúril that I can equip with Aragorn, a new hero/ally to add to my dwarf deck, or a new area of Middle Earth to explore is going to be what keep me playing. \n\nMy friends and I have already started to discuss how we can turn our game sessions into campaigns, much like a tabletop RPG.  Of course all of our talk is totally speculative when we have seen only a small handful of the cards. \n\n~Rathmaker~"},{"commentUrl":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/?do=findComment&comment=392471","commentId":392471,"userName":"jgt7771","timestamp":1291377423,"content":"Frog said:\n\nMany are worried that this will drive away the typical CCG/LCG gamer because they won't feel the need to stack their decks to decimate each other. Even if it does, it will surely hook a new crowd who hates that aspect of card games.\n\n+1!!!\n\nHated this ever since the day I observed a tournament where the top few players all had the same stupid deck.  It's not just that it was uber-powerful; it was all the other cards that had been summarily dismissed.  If I wanted to play some odds-n-ends deck, I was sure to be trounced by the player with the same stupid killer deck.\n\nLOTR won't have that.  Even if there is a killer deck, I'll be allied with it, not pitted against it.  So I can get as goofy as I want with my cards.  Besides, if Death Angel is any indication of what cooperative FFG card play is like, the only killer decks you'll be seeing will be the autonomous one run by the game itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/?do=findComment&comment=393655","commentId":393655,"userName":"ClydeCloggie","timestamp":1291699573,"content":"I fully expect different decks will be needed to beat the different Quests, much like in the original MECCG game. As such it should be hard to build an all-conquering broken deck. As with all card games though, there will be issues with multi-card combos that give a huge advantage.Worst case scenario is a self-inforcing positive feedback combo as the one that eventually broke MECCG's Balrog expansion. How FFG will keep this under control will determine the success of the game to some degree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/38787-does-cooperative-play-less-power-creep/?do=findComment&comment=394472","commentId":394472,"userName":"9thimmortal","timestamp":1291892904,"content":"FFG actually does a pretty darn good job with Power Creep IMHO.  At least with aGoT (Warhammer I am not 100% sure of yet, but I haven't seen a ton - maybe since it hasn't been out long enough for a good sample). \n\nBut I agree that they can just change the parameters/classes/end results a little better in co-op."}]}