{"url":"https://community.fantasyflightgames.com/topic/39110-thoughts-of-a-lord-of-the-rings-fan/","title":"Thoughts of a Lord of the Rings fan...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/39110-thoughts-of-a-lord-of-the-rings-fan/?do=findComment&comment=392097","commentId":392097,"userName":"Rathmaker","timestamp":1291299470,"content":"Greetings Fantasy Flight and fellow gamers,\n\nI recently checked this site for updates to the Lord of the Rings Living Card Game, and was ecstatic  to see that there are recent updates and previews.  This was the first time in close to a month that I had checked the site.  After seeing the announcement, the demo in Gencon, and subsequent releases in August it was rather disconcerting to hear nothing from Fantasy Flight Games concerning the Lord of the Rings LCG (hence my last post on these forums in November). \n\nI am a tremendous fan of the Lord of the Rings (and other materials dealing with Middle Earth).  I have been since I began reading (almost 18 years ago) the works Professor Tolkien created.  I have played most of the games based on the Lord of the Rings.  I find it increases the immersion I have with Middle Earth.  This game is practically an automatic buy for me (and I assume it will be the same for many other fans of the Lord of the Rings).  The prospect of playing in a cooperative card game based on a the Lord of Rings is exciting.  Combining this with the chance to play in an era of Middle Earth not tapped much, the gorgeous card art, and the soloability of the game is what makes me ecstatic to play it.  I am eagerly awaiting this release.\n\nWhile I am a tremendous Lord of the Rings fan, another thing I am is a gamer that feels burned on numerous levels.  Whether it be Decipher ruining the previous LOTR TCG (reset button in Shadows, the power creep in the last expansions, and the lack of regular development and communication in the end), WOTC ruining (or outright killing) too many games I have loved and giving a transparent reason that even a blind person can see through, or many game companies lacking in proper support for games that comes far short of the hype they had set up.  For CCGs specifically, I am tired of the randomness that comes with purchasing the game.  I have not bought into a game of the collectible form (CCG, TCG, LCG, Minis, etc.) in over 3 years.  I admittedly have not had much experience in Fantasy Flight Games.  I have some of their board games, and used to play Disk Wars years ago.  I have never tried any of the LCGs, but the concept seems infinately more appealing than the CCG purchasing model.  Many fellow gamers at my local game store have expressed alot of satisfaction in FFG.\n\nThe concept of Lord of the Rings being combined with the LCG format will be the thing to pull me back into the purchase of card game type games.  I am jumping head first into this game.  My game group is excited for the concept as well.  I am going to do what I can to drum up interest at my local game store, and I will look into having demos (or running them myself if need be) for this game.  I believe the purchase model matched with the cooperative design of a card game will be a great success in the current gaming environment. \n\nI am putting alot into the compliments toward FFG from fellow gamers, and I pray that they are warranted.  I hope the developers of the Lord of the Rings LCG have as much love for the world that Professor Tolkien created as us fans.\n\n~Rathmaker~\n\nP.S. Sorry for the rambling.  I just wanted to get some thoughts down.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/39110-thoughts-of-a-lord-of-the-rings-fan/?do=findComment&comment=393505","commentId":393505,"userName":"Spirit Juggler","timestamp":1291654449,"content":"I agree with a lot of what you say. I myself am a huge Middle earth fan and loves games involving middle earth. I was also disapointed *as stated in other posts* the Deciphers LOTR CCG and am very much looking forward to this release :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I do also play the Call of Cthulhu LCG :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] So I already have some experience of this style of game and you're right. All the randomness and frustration of missing that one card you need despite buying a million and one packs of cards is removed from the LCG format. I'm also looking forward to having a co-op customizable card game and will be interested to see how all this pans out.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/39110-thoughts-of-a-lord-of-the-rings-fan/?do=findComment&comment=393647","commentId":393647,"userName":"ClydeCloggie","timestamp":1291698079,"content":"Might as well reveal myself after lurking here for a while.\n\nMassive Tolkien fan too, and I was an avid player of ICE's MECCG right from the start until after its demise and even ran the METW-L Card of the Day for a while as Fram Frumgarson. I still consider it to be the greatest game ever. Also played LotRCCG but lost interest in that one due to its lesser gameplay.\n\nThis one looks very interesting and ticks a lot of my boxes. Being a working dad, going to playgroups etc. is not an option, so solo play? Check.  Stunning artwork? Check. Non-random packaging? Check. The few cards revealed hint at quite complex card interplay, excellent replay value, and RPG-type storytelling, soooo....check.\n\nIt also looks like some advanced mechanics will be present right from the word go. Under The Shadow for instance is a card of which the mechanic would not have appeared in MECCG until the second expansion set. And I'm already seeing a nice combo between Gandalf and Horn of Gondor to get a resource pool pump going (assuming there will be a get ally from discard pile card, although it should come with restrictions or a hefty fine to keep Gandalf's powers in check).\n\nSo yes, me likes it very much...a return to the days of cardboard geekdom is on the...ehh...cards.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/39110-thoughts-of-a-lord-of-the-rings-fan/?do=findComment&comment=428500","commentId":428500,"userName":"scottindeed","timestamp":1298448668,"content":"Just thought i'd add my pleasure at the development of this game too.\n\nI too just have no time for random booster pack style card games.  I collected some Magic The Gathering cards when i was at uni.  Loved the mechanics of the game, but disliked how the main deciding factor on the outcome of a game was down to whowever had been on ebay and forked out 100's of pounds to build the best deck.  Recently i've discovered the Duals Of The Planeswalkers computer game version that has really helped scratch that particular itch.\n\nI also began to collect Wizkids Star Wars PocketModels, but again the blind booster purchases were a burden and the game itself was a little too basic for my liking.\n\nLord Of The Rings LCG sound great though.  Love the idea of the LCG model, which i haven't played before.  I've no problem forking out once a month to have all the cards i need for that expansion.  My gaming sessions with my mates these days are limited now as well (real life + marriage), and we nearly always opt for computer games or DVDs.  So being able to play solo is a very big plus for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/39110-thoughts-of-a-lord-of-the-rings-fan/?do=findComment&comment=428686","commentId":428686,"userName":"pumpkin","timestamp":1298471757,"content":" \n\nMay aswell add that I'm really looking forward to this too; this would actually be my first foray into LCGs.\n\nAlways liked the idea of the card games, especially the standard packs of the LCG format, and although i am a big cthulhu fan, I didn't buy into that game for a few reasons, namely non solo play, and the distribution format of the early expansion packs made it still seem a bit like a CCG, in the way that one expansion wasn't enough, and buying multiple expansions resulted in excess \"common\" cards, although FFG are clearly fixing that with their re-jig of making exansions 60 cards each going forward.\n\nIt really seems that FFG have ironed out the crinkles in their LCG format now, and will be applying that to LOTR from the get go, so it seems like the right one to get into and i really like the scenario concept; i think that has what has really sold me on this game.\n\nIt looks like the quests each having certain icons that are used to built up the encounter deck is a really clever mechanic, and i assume later expansions as well as probably having cards with a new icon unique to that expansion could also provide cards with existing icons allowing new cards to be used with older quests? We will have to see.\n\nFrom the few icons we've seen it seems like they are based on a theme (orc, beast, tower of Dol Guldur, mirkwood etc) so it really gives FFG some mix and match capabilities for new quests going forward.\n\nI wonder if they suggest 2 core sets for a 4 player game purely to get the threat track and other tokens in the second core set or whether you'll need more cards in the event deck to cover 4 players than comes in one core set (and hence really need two expansions for a 4 player game to keep the card distribution values right going forward)?\n\nNot that it really matters to me as I'm more looking forward to playing this solo than playing with my gaming group anyway!\n\nDo we think the initial expansion will be released at the same time as the core set or a month later? How has this been done with other LCGs?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/39110-thoughts-of-a-lord-of-the-rings-fan/?do=findComment&comment=428959","commentId":428959,"userName":"Spirit Juggler","timestamp":1298520748,"content":"I imagine it will be a month later at least. Just to give us enough time to play and get to grips with the base game. "}]}