{"url":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/","title":"Best Way to Buy?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=421509","commentId":421509,"userName":"TheLightdarker","timestamp":1297250469,"content":"Until I stumbled upon news about this exciting release, I had never heard of the concept of living card games before, but I think the notion of having a new set of cards to buy every month is a really intriguing and irresistible prospect.\n\nUnfortunately, I don't have a local game store that carries any of FFG's LCGs (though they do carry some of the board games, like Descent), but I am hoping to avoid having to pay ~$5 or so shipping every month for a $15 or less booster pack.  I was wondering, for those of you that play and purchase FFG's other LCG series, what seems to be the most cost-effective or efficient way to buy the core game and monthly releases?\n\nI've gotten very spoiled with Amazon Prime's free, two-day shipping on most items, and was wondering, would anyone be able to tell me how promptly Amazon lists the monthly booster set for each LCG?  It would be great to get Amazon's regularly low prices, but free shipping would be golden.  Are there any other comparable sites that anyone could suggest?\n\nIn any case, please tell me how you typically purchase existing LCG sets and monthly boosters, and about how much it costs you!\n\nBonus question:  what day of the month are the booster packs typically released for the LCG series?\n\nThanks in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=421568","commentId":421568,"userName":"Arma virumque2","timestamp":1297258746,"content":"I've had very little luck purchasing LCG cards from Amazon in the past.  When they've had card packs in stock, they've usually been sold through third-party associates who don't use Fulfilled by Amazon, so Prime shipping doesn't apply\n\nHowever I just did a quick search for the other two LCG games that I'm familiar with, and Amazon's Prime-eligible inventory has improved dramatically sometime in the past few months.  Plus, they seem to have entries for several yet-to-be-released card packs with due dates in February.  I don't know if they'll be released on the same day as our FLGS, but the situation definitely seems to be improving.\n\n \n\nAs for total cost, if you want every pack, it's best to assume you'll have to pay $15 x 12 months = $180 per year.  Plus, the other LCGs seem to be releasing one or two medium-size expansions each year, which cost another $30 or so.  (LOTR LCG has not announced whether it will follow suit.)  So a copy of every card may cost $210-240 per year.\n\nAnd then there's the cost of the core set, approx. $40.  With other LCGs, the core set was playable with only one copy, but completionists who want a full play-set of every card have had to buy three copies.  So there's another $40-120, depending on your own obsessiveness.\n\nOnline retailers often sell the cards for cheaper than MSRP, but the cost of shipping only makes this cost-effective if you buy multiple sets of cards at once.  Amazon is currently hit-and-miss on whether it sells at MSRP or a discount.\n\nOf course, there are many players who feel strongly that it's worth the extra money to support a local game store instead of buying online."},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=421574","commentId":421574,"userName":"Darksbane","timestamp":1297259241,"content":"Lightdarker said:\n\nUnfortunately, I don't have a local game store that carries any of FFG's LCGs (though they do carry some of the board games, like Descent), \n\n\n\nUnless you just dont want to buy from your Local store I'm sure they would order the product for you.\n\nLightdarker said:\n\nbut I am hoping to avoid having to pay ~$5 or so shipping every month for a $15 or less booster pack.  I was wondering, for those of you that play and purchase FFG's other LCG series, what seems to be the most cost-effective or efficient way to buy the core game and monthly releases?\n\nI've gotten very spoiled with Amazon Prime's free, two-day shipping on most items, and was wondering, would anyone be able to tell me how promptly Amazon lists the monthly booster set for each LCG?  It would be great to get Amazon's regularly low prices, but free shipping would be golden.  Are there any other comparable sites that anyone could suggest?\n\nIn any case, please tell me how you typically purchase existing LCG sets and monthly boosters, and about how much it costs you!\n\nMy friends and I order in bulk from minaturemarket.com and we can tend to grab $75 worth of stuff between the 4 of us to reduce shipping to 0. Generally Miniature Market has the $15 chapter packs listed for ~10 so even if we do pay shipping it is normally still less than the MSRP for the cards. Amazon in my experience is good for buying older packs but the new stuff can take alittle longer to get listed by them (and not 3rd party people).\n\nLightdarker said:\n\n \n\nBonus question:  what day of the month are the booster packs typically released for the LCG series?\n\nThanks in advance.\n\n\n\nThere really isn't a set day.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=421582","commentId":421582,"userName":"TheLightdarker","timestamp":1297260503,"content":"Thanks for the responses!\n\nTo Arma virumque: I understood the total yearly investment for all the packs, etc., I was more just asking about what peeople typically pay if anyone was taking advantage of any special deals going on (i.e., the example Darksbane gave of finding the chapter packs for a reduced price).\n\nTo Darksbane:  I actually happen to have just called my local game store (where I haven't gone in years, as I recently moved back to town), and I was completely unaware that they had the option of doing \"special\" orders, before today.  I just assumed retailers would have to have some sort of standing contract with FFG to buy X quantity of Y product as opposed to being able to make arrangements for individual customers.  It seems like they could order the product for me, though, which would be cool, and since I don't know of anyone else to take advantage of free, bulk shipping with, and am too impatient to wait for places like Amazon to list boosters, I may end up going with that option.\n\nAgain, thanks for the input everybody."},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=421619","commentId":421619,"userName":"Narsil0420","timestamp":1297264023,"content":"You should check out my similar topic: \"What's the fastest way to get this game?\" There's some good info on game buying there.\n\nYour other main option is to buy from an online board game specialty shop.  You'd probably want to find one that's relatively close to your area by just looking up their contact info on their page. Noble Knight Games, Funagain games, B&B, Thought Hammer, cardhaus,  and potomac distributors, are just a few I've come across.\n\nGood hunting!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=421647","commentId":421647,"userName":"Narsil0420","timestamp":1297265527,"content":"I also looked around as to your other question, \"what day of the month are the booster packs typically released for the LCG series?\" The answer is of course, various days. But each LCG has a day of the week that's dedicated to it when the \"card of the week\" usually comes out. For Warhammer:I it's Tuesday, Game of Thrones - Thursday, and Cthulhu - Friday. LOTR has taken up the Wednesday slot. It seems like they try to release the new packs on those respective days although there's a lot of variation. Other than that there's no real pattern other than middle of the month-ish. I also noticed that when a large expansion comes out, it usually doesn't interrupt the flow of monthly packs. In other words a large update seems to come out in the same month as a monthly pack, it doesn't replace it.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=422158","commentId":422158,"userName":"Toqtamish","timestamp":1297343843,"content":"Actually large ones are often, not always but often, released in the break between one cycle to another. Theres typically a one month break between the end of one and the start of another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=422371","commentId":422371,"userName":"evilidler","timestamp":1297368116,"content":" I've not found any unbeatable offers on Amazon.com, but I have found VERY cheap expansions for the other LCGs from Amazon.co.uk (several on the way as I type this :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]. The ELGS near me charges about $50 for a typical LCG expansion, so I can stomach just about any lower price :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nSince I'm still catching up with the entire collection of LCGs (yes, addiction is rough, no, I won't accept counselling) I also buy 2-4 packs at a time from Sci-fi Genre, which ends up half as expensive as here. I get either 2-3 of the newer 60-card packs, or 4 of the old format, which is cheap enough I don't have to pay duty fees. With shipping it's still half the price compared to locally!\n\nI get CoC/AGoT/W:I expansions as low as £13 from Amazon UK, which ends up 60% of the local price WITH SHIPPING. Some merchants there simply add £7(!) for each item in the basket though, even if they are shipped together.\n\nI recommend places like Sci-fi Genre, MyAtomic, and any other reputable mail-order place since they don't charge the full $15 for chapter packs. I also recommend having two LCGs so you can save more on shipping as you buy two packs per month ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/42170-best-way-to-buy/?do=findComment&comment=422394","commentId":422394,"userName":"angelofb100d","timestamp":1297373272,"content":"This kind of ties into game stores being willing to order it for you, but also comic shops.  Diamond, the company that distributes to comic shops, will ship ffg products- so your local comic shop could probably order everything at no additional cost."}]}