{"url":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/","title":"Pinch of weed for all waiting here","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431116","commentId":431116,"userName":"Sky","timestamp":1298908442,"content":"Waiting is pain, there is no sweet torture, only dull backstabing pain of waiting. So I thought maybe there is some Lore, some Spirit we can find in the parts already revealed to us. I took into account all the info about the cards i found so far - and here are the facts.\n\nThere are 226 cards, 12 Heroes, 120 cards in Player deck, 10 Quest cards, and 84 cards of Encounter deck.\n\nI tried to figure some info from the cards spoiled so far (numbers on them) and i got the following results.\n\n1-12 x 1 Hero cards - no comments\n\n13-27 x 2 = 30 cards in Leadership sphere\n\n28-42 x 2 = 30 cards in Tactics sphere\n\n43-57 x 2 = 30 cards in Spirit sphere\n\n58-72 x 2 = 30 cards in Lore sphere\n\nSo far all fits into the following scheme - 4 decks of 30 cards each for each Sphere - average two copies of each card. It seams that we will eventually be forced (by our greed of course) to purchase more copies of the starter.\n\nNow encoutner deck\n\n73-117 x 1,87 = 84 cards - this deck seems to hide most inside. It is clear that number of different cards will vary... unless we do not know everything yet - shadow key (french site posted its picture) seems to have number 110 so... though it is unique to the quest... it is still consider to be part of encounter deck. This deck can spread into 119 but... no evidence so far. We shall see in few weeks  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIt seems that encounter deck can be split into two parts - generic part (common for all adventures to come) and unique part - used in specified quests.\n\n118-127 x 1 = 10 Quest cards again it is just estimate - 122 is the only fixed point here - Beorns Path.\n\nNow i wander how much effort will that take to move from one adventure to another. Shall we detach all cards - sort them according to their type and create another deck part by part and then shuffle it?\n\nLets assume that Shadows of Mirkwood is all on the market and we get roughly 170 new cards in the encounter deck  (60 cards - 1 hero - 3x9 player decks cards-3 quest cards) x 6 adventure packs. If we just add them all adventures will take 3 times more time - 84 cards at starter deck - 234 cards after first sets of adventures... i feel there is some mechanism we do not know about yet that controls it. Hopefully some people who have already touched the game shall answer soon. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431345","commentId":431345,"userName":"scottindeed","timestamp":1298965274,"content":"From what I have gleaned from the game, adventures would not take longer if you (and even if you are allowed to) create a larger event deck.  You'd still be drawing the same number of cards on a given turn as determined by your heroes, threat, quest etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431425","commentId":431425,"userName":"ffgfan","timestamp":1298975840,"content":"You know that in a FFG's  2010 release book,  that I got in The Witch's Song, there's a two side LOTR spread in. It got some preview but does not show to much. the most interesting thing in it is the info that the core set has got 216 card not 226."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431568","commentId":431568,"userName":"Sky","timestamp":1298991860,"content":"226 cards from the info of Galakta - the Polish publisher of the game. As it has been anounced this year I presume it is actual info on the site.\n\nI also cannot agree that the number of cards in the encoutner deck does not affect lenght of play. Your point seems valid only as long as there is no need for the special encounter in the quest. Then you just burn through this deck until you get enough progress tokens. But imagine that you are waiting for Signs of Gollum to show up.... it can really slow You down....\n\nSky"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431666","commentId":431666,"userName":"qwertyuiop","timestamp":1299003495,"content":" Your encounter deck will most likely change based on which of the three scenarios you play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431691","commentId":431691,"userName":"servant of the secret fire","timestamp":1299008826,"content":"qwertyuiop said:\n\n Your encounter deck will most likely change based on which of the three scenarios you play.\n\n\n\nWen new scenarios comes live can you play old scenarios with some new monsters or a combination of old and new monsters and shadow cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431776","commentId":431776,"userName":"jhaelen","timestamp":1299032312,"content":"servant of the secret fire said:\n\n \n\n \n\nWen new scenarios comes live can you play old scenarios with some new monsters or a combination of old and new monsters and shadow cards?\n\n \n\nThis will depend on the icons of new monsters: If new cards had the same icons as earlier scenarios, you could include them in the deck.\n\n \n\nThis is something I'm not sure how it's going to work. Apparently, at the moment the encounter decks are fixed. There's no variation, you simply include every card showing the correct icon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431789","commentId":431789,"userName":"BeardFan","timestamp":1299035218,"content":"There's only 29 cards for each sphere in the core set, as each deck contains one copy of the neutral ally card \"Gandalf\". Some cards, like \"Fate of Fortune\" that revives a dead character are only included once, some 3 times (and I think some were also included 2 times, but not sure). I don't think you'll need a second set, if you only have to build decks for yourself alone. Will be different, if you have to provide the cards for your players, as the standard deck size should be 50 cards according to the rules.\n\nAnd in contrast to WHI or AGOT LCGs, \"unique\" cards are unique not only for the player, but for the whole game. So if one player has a unique card in play, no other player can have this card in play. So no armies of multiple Gandalfs lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431801","commentId":431801,"userName":"scottindeed","timestamp":1299037630,"content":"I can't see myself buying more than one set of anything, as its not like your deck has to be competitive against another player.  If anything the constraints of having one copy of the game will make it more challenging :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431805","commentId":431805,"userName":"BeardFan","timestamp":1299038184,"content":"Hell, you don't even need a second set for the 4 player game. It's true that there are only two threat counters, but these can be replaced by 2d10. We played a 4 player game with the starter decks and didn't miss any cards. You will only draw one card per turn normally, so it will be more than 20 turns until you run out (in which case you don't lose, but just have no more cards to draw). And as the threat level rises by one each turn (and you start around 28/29) the game should be over before you run out of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=431847","commentId":431847,"userName":"jhaelen","timestamp":1299044331,"content":"BeardFan said:\n\nAnd in contrast to WHI or AGOT LCGs, \"unique\" cards are unique not only for the player, but for the whole game. So if one player has a unique card in play, no other player can have this card in play. So no armies of multiple Gandalfs lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\nAh, that's good to know.\n\nIt's also very nice that you can play it with four players using only a single box. So I don't even have to convince anyone else to also buy it happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43101-pinch-of-weed-for-all-waiting-here/?do=findComment&comment=432032","commentId":432032,"userName":"servant of the secret fire","timestamp":1299068965,"content":"jhaelen said:\n\n \n\nBeardFan said:\n\nAnd in contrast to WHI or AGOT LCGs, \"unique\" cards are unique not only for the player, but for the whole game. So if one player has a unique card in play, no other player can have this card in play. So no armies of multiple Gandalfs lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\nAh, that's good to know.\n\n \n\nIt's also very nice that you can play it with four players using only a single box. So I don't even have to convince anyone else to also buy it happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n \n\n \n\nYeap this is realy good.Unique characters must be unique.Having a game with 3 Aragorns fighting 3 Balrogs just dont fit with Tolkiens lore."}]}