{"url":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/","title":"fun has a limit?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=431579","commentId":431579,"userName":"servant of the secret fire","timestamp":1298992800,"content":"Hello all i am new here and i ll ask you to forgive my English cause are not my first language.I am fun of Tolkien for 15 years now and the only card game i have ever played is diciphers tcg.\n\nMy question is how you can spend many hours with your friends with a co-op game?I mean until the next month comes and take the new quests you play the same quest over and over again?Lets say that it will take 1 week to complete the first 3 quests the box gives you. then what?you just wait 24 days for the next expantion just to play somethink new?\n\nCan someone  explain me how a co-op game works ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=431665","commentId":431665,"userName":"qwertyuiop","timestamp":1299003365,"content":" You build creative decks and don't fear being crushed by nasty monsters. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]  That's how."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=431788","commentId":431788,"userName":"BeardFan","timestamp":1299035031,"content":"I think this is where the deckbuilding will come in. After enough adventure packs are released to give you some flexibilty with heroes and and a bigger card pool, you can start building fun thematic decks. Say a deck only with characters from Rohan and Rohan related stuff inside. Or a Gondor-centered deck. Or use only girls as heroines etc.\n\nAlso playing connected scenarios with the advanced campaign rules should be really nasty, as you carry over your threat level, your wounds and your eliminated heroes to the next scenario. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=431840","commentId":431840,"userName":"pumpkin","timestamp":1299042066,"content":" \n\nYep, I can see the simple rotations of combinations of heroes from the core set enough to keep the game fresh, especially if the quests are relatively difficult to complete,\n\nAs each expansion has a new hero, this hero and new player cards can be added into the rotations and even breathe new live into older (core set) quests, as they are attempted again with different heros and different options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=431970","commentId":431970,"userName":"servant of the secret fire","timestamp":1299061592,"content":"Thanks all for your replys and sorry if my question is kinda stupid but i have no experience from a co-op card game.I ll buy this game even if i dont like the game play only for the art (big fun of Tolkien :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) but it will be nice if this game can keep my interest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=432175","commentId":432175,"userName":"qwertyuiop","timestamp":1299087241,"content":" It's not a stupid question.  It just may help to be willing to be a little crazy with your  deckbuilding. You may be able to find a lot of extra card synergy with the cooperative aspect. Ridiculous combos and such!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=432224","commentId":432224,"userName":"servant of the secret fire","timestamp":1299096852,"content":"qwertyuiop said:\n\n It's not a stupid question.  It just may help to be willing to be a little crazy with your  deckbuilding. You may be able to find a lot of extra card synergy with the cooperative aspect. Ridiculous combos and such!\n\n\n\nSo can you use  point system just to add an extra challenge between you and your friend?You know a friendly trush talking like my heoroes have less wounds and i have a better score than you etc.Just to force your friend to build a better deck and tell you :ok let me change some cards and then we play again and see whos deck will do better.\n\nAgain sorry for my English"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=432236","commentId":432236,"userName":"Bohemond2","timestamp":1299099171,"content":"Not to worry, the game includes a point counting system.\n\n \n\n\"At the end of the game, a simple bit of calculation can give you an idea of how well you went in the adventure. Each player adds up their final threat level, the threat cost of each of their dead heroes, and the number of wound markers on each of their heroes. Certain cards from the encounter deck have a keyword of Victory X (such as the Marsh Adder, with Victory 3) at the bottom-right of the card. This number will then be subtracted from the score of the players if they defeat this card during the game. The lower the score, the better and more decisive the victory. Keeping one’s heroes alive and well is a good way to keep your score low.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=432330","commentId":432330,"userName":"BeardFan","timestamp":1299121415,"content":"The point score will be a group score, not a player score. So you won't be able to rate players within a group. It actually does make sense this way, because by using different spheres, the players take different roles. So the guy with the tactics sphere would of course slay the creatures, but probably get more wounds. There are no scores for healing and progressing in the adventure, which will be taken care of by willpower or lore. So it would be unjust to rate players separately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=432377","commentId":432377,"userName":"servant of the secret fire","timestamp":1299128931,"content":"BeardFan said:\n\nThe point score will be a group score, not a player score. So you won't be able to rate players within a group. It actually does make sense this way, because by using different spheres, the players take different roles. So the guy with the tactics sphere would of course slay the creatures, but probably get more wounds. There are no scores for healing and progressing in the adventure, which will be taken care of by willpower or lore. So it would be unjust to rate players separately.\n\n\n\nI see.Then if you are 4 people you can make 2 teams play the same scenario and if both teams complete the scenario they can compare their scores.They can make a tournament with this point system :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=432437","commentId":432437,"userName":"Narsil0420","timestamp":1299138381,"content":" Why do we have to always find a way to make things competitive! Can't we just enjoy cooperating with people!?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=432454","commentId":432454,"userName":"servant of the secret fire","timestamp":1299141803,"content":"Narsil0420 said:\n\n Why do we have to always find a way to make things competitive! Can't we just enjoy cooperating with people!?!\n\n\n\nIts just in humans nature.Just imagine a basketbal game with only one team trying to score 100 points in 4 min.Not so exciting dont you think?Competition makes you better and forces you to test your limits.I dont say lets change this game from a coop to a competitive game.But if i can use some rules of the game to make it somehow competitive i can make my friends play  this game with me cause they only like competitive games :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=443538","commentId":443538,"userName":"DrNate","timestamp":1300999225,"content":" I plan to be plenty busy with just the core set alone. First there is the matter of testing all sorts of combinations of heroes based on factors like: spheres, stats, gameplay, flavor,personal preference. That will take me a while to figure out,I haven't even considered what to put into the deck yet! \n\nOnce I do find the characters that I enjoy playing, there is the matter of building a deck that can successfully guide my team(s) through a mission,developing the personal playing skills to do so. From there, it will be a matter of getting my point total lowerlower. \n\nAnd then, we have to consider Hard ModeNightmare Mode.  Something about the name Nightmare Mode makes me want to conquer that challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=444065","commentId":444065,"userName":"gerson2","timestamp":1301082544,"content":"Since the game is story driven, in casual play people can create their own custom quest cardstell a different story from those officially available. The possibilities are endless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=444169","commentId":444169,"userName":"Mighty Jim 83","timestamp":1301111125,"content":"Core set alone - if you've got two players, then you'll use the various combos of decks. That's 12 different possibilities. (Player A- Lore/Player B - Tactics, A-Lore/B-Spirit, A-Spirit/B-Lore... etc.) Then you can build 2-sphere decks, 2 heroes for one sphere,1 herosome low-cost cards for a second minor sphere- this adds a choice element for which hero you use within the sphere, plus times that by all the different player/deck combinations.\n\nThen you could build a 3-sphere deck.\n\nTimes all of that by the 3 different scenarios. Or play the scenarios in secquence as a campaign, without resetting damage.\n\nAlready, that must be hundreds of possibilities, without even replaying the same quest & deck combo in an attempt to avenge a defeat.\n\nI think there's going to be plenty to keep us occupied."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=444182","commentId":444182,"userName":"faith_star83","timestamp":1301113385,"content":"When first I saw that there will be a lotr lcg by FFG I was really excited, but when I found out it was a co-op game I was somewhat disappointed. Until I started reading the articles here, that is!\n\nI have to agree with what most people say here: The co-op nature adds a lot of depth to the Gameplay. And so do the story that is told by the quest cards, the deck-buildingthe flavour of the game! I am really looking forward to what new Chapter Packs will bringI also think that ffg will keep us entertained by adding new mechanics to the game from time to time. One month actually passes quite fast, since you will be busy trying out new strategiesall.\n\n \n\nservant of the secret fire said:\n\nNarsil0420 said:\n\n \n\nJust imagine a basketbal game with only one team trying to score 100 points in 4 min.Not so exciting dont you think?\n\n\n\nI think that is one way to see things. But consider this: It might be very boring for people watchig that one team facing the challenge to score 100 points in 4 minutes. But how exciting will it be for the team players? Analyzingevaluating new stratgegies, re-assign team roles, etc. might be very interesting for the team captainthe members. And so will be the lotr lcg!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=444211","commentId":444211,"userName":"servant of the secret fire","timestamp":1301122353,"content":"Thank you all for your postsi hope my first experience with a coop card game wiil be as exciting as you all say in this thread.\n\nAs a big fan of Tolkien it will be very nice for me if i can have fan with a game based on Tolkien.\n\nMay the Valar protect you allgran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=444334","commentId":444334,"userName":"DrNate","timestamp":1301150176,"content":"faith_star83 said:\n\nBut consider this: It might be very boring for people watchig that one team facing the challenge to score 100 points in 4 minutes. But how exciting will it be for the team players?\n\n \n\nIt will be more exciting if that Basketball team is constantly under seige by Orcs a-nd Spiders!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=444356","commentId":444356,"userName":"servant of the secret fire","timestamp":1301155057,"content":"DrNate said:\n\n \n\nfaith_star83 said:\n\nBut consider this: It might be very boring for people watchig that one team facing the challenge to score 100 points in 4 minutes. But how exciting will it be for the team players?\n\n \n\nIt will be more exciting if that Basketball team is constantly under seige by Orcs a-nd Spiders!\n\n \n\n \n\nAs an ex professional basketball player i can tell you that no orc or spider can defend me or scare me partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=448331","commentId":448331,"userName":"kuffdaddy","timestamp":1301844077,"content":"also hopefully FFG comes out with the league play and like the W:I have an achievement booklet.  I always liked having something like that just because it can force you to make very odd deck builds.  they make you think a little more and play outside of your comfort zone sometimes\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/43147-fun-has-a-limit/?do=findComment&comment=449558","commentId":449558,"userName":"The_Audiophile","timestamp":1302022288,"content":" Playing with myself will have a new meaning, thanks Lotr Lcg!\n\n "}]}