{"url":"https://community.fantasyflightgames.com/topic/43826-adventure-pack-collation/","title":"Adventure Pack Collation","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/43826-adventure-pack-collation/?do=findComment&comment=438513","commentId":438513,"userName":"gerson2","timestamp":1300199054,"content":"Due to this game uniqueness, I believe the distribution of cards in the Adventure Packs will not follow the same pattern used in the other LCG (3 copies of each of the 20 cards in the pack).\nWe've been told each pack contains a new scenario and a new hero. Since there's no use for other copies of the hero card or the quest cards, I believe only attachment, ally, event, enemy and treachery cards will come in 3."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43826-adventure-pack-collation/?do=findComment&comment=438770","commentId":438770,"userName":"ffgfan","timestamp":1300248192,"content":"You can find those informations in news but for all who don't want to search too much I'm posting does here:\n\nHunting High And Low\n\"Adventure Packs for The Lord of the Rings: The Card Game provide many new options for players. Not only do they expand your available card pool, but they also introduce new quests to challenge your fellowship. These fixed 60 card decks include a new Hero, three copies of nine unique player cards, and the Encounter and Quest cards devoted to the included scenario. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\nWhile Encounter and Quest cards build the scenario, the nine unique player cards come from each of the four spheres of influence. Consisting of new allies, events, and attachments, these cards are used to customize and expand your player deck.\"\n\nOf Adventures To Come\n\"The Lord of the Rings: The Card Game is the first cooperative/solo LCG, and the contents of each Adventure Pack are designed to support an ever-changing play environment suitable for this new style of game. Each Adventure Pack release will include a new scenario with a new set of Encounter cards that will be featured in the quest. In addition, players will also find a new Hero card and a variety of new player cards for all four spheres of influence.\"\n\n\"In addition to the 6 new scenarios (here the author talkes about all pack from Shadows Of Mirkwood Cycle), approximately half of each pack is devoted to new player cards. There is a new hero in each pack (starting off with Bilbo Baggins in The Hunt for Gollum Adventure Pack), and an assortment of cards for all 4 spheres. This was an exciting set to design, and I’m looking forward to its release!\"\n\nHope this helps!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43826-adventure-pack-collation/?do=findComment&comment=443545","commentId":443545,"userName":"DrNate","timestamp":1300999867,"content":" So, 27 cards for the player's deck plus one character card. I'm guessing only one quest card? That means 31 encounter cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/43826-adventure-pack-collation/?do=findComment&comment=443891","commentId":443891,"userName":"Troymk1","timestamp":1301059935,"content":" No there would be 3-4 quest cards.  As you say the rest will be a new encounter 'group'"}]}