{"url":"https://community.fantasyflightgames.com/topic/43882-an-observation-regarding-the-rules/","title":"An Observation Regarding the Rules","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/43882-an-observation-regarding-the-rules/?do=findComment&comment=439273","commentId":439273,"userName":"FiendishDevil","timestamp":1300327628,"content":"So I read through the rules and realized that this game is hard. There are some definite limitations to advancing forward.\n\n3 heroes per player = 3 resources per round\n\n1 encounter draw per round per player\n\nCommitting to a quest, defending, and attacking all require Exhaustion of the character. One character can only do ONE of these actions.\n\nI can see it already. Because enemies attack first and the negative for not defending is so harsh (direct damage!), you will be defending when possible. Which means that you need to plan ahead and not commit characters to quests.\n\nAH! This game has a very euro-game feel to it! Too much to do and not enough time! I can see intro turns working out as build up to horde resources, equip. But as you advance, you will need to be making a lot of sacrifices as you get forced into limitations by card draw, resources, and just the quirks of the game board.\n\n \n\n \n\nJust initial thoughts....I'm excited for this game. Loving that it can be played single player! Sometimes it's hard to find friends!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/43882-an-observation-regarding-the-rules/?do=findComment&comment=439304","commentId":439304,"userName":"Frank36","timestamp":1300335255,"content":"Better too hard than too easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43882-an-observation-regarding-the-rules/?do=findComment&comment=439556","commentId":439556,"userName":"conykchameleon","timestamp":1300371702,"content":"True, but I think the heroes have a distinct advantage over the Shadow due to the way that combat works. Once the Shadow card is revealed for any attacking enemy, all of its cards are on the table (pun intended). After this happens, the hero can gauge whether or not he can best the enemy in combat without having to worry about a live opponent having more cards in his hand or tricks up his sleeve. There will be a lot less resources wasted as opposed to other games, which may offset the apparent lack of resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/43882-an-observation-regarding-the-rules/?do=findComment&comment=439706","commentId":439706,"userName":"sisyphus5","timestamp":1300389293,"content":"conykchameleon said:\n\n \n\nTrue, but I think the heroes have a distinct advantage over the Shadow due to the way that combat works. Once the Shadow card is revealed for any attacking enemy, all of its cards are on the table (pun intended). After this happens, the hero can gauge whether or not he can best the enemy in combat without having to worry about a live opponent having more cards in his hand or tricks up his sleeve. \n\n \n\n \n\nWhile you can plan with the knowledge that there are no more tricks after the Shadow card has been revealed, you normally have no way of knowing what the Shadow effect is before you've declared your defender (or lack thereof).  That could potentially have dire consequences if the right (read: wrong) Shadow card gets played.    \n\n "}]}