{"url":"https://community.fantasyflightgames.com/topic/44082-travel-question/","title":"travel question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/44082-travel-question/?do=findComment&comment=441302","commentId":441302,"userName":"micheni","timestamp":1300688546,"content":"hi all.\n\ni read the rules and the only point that got me  a little confused is the tyravel phase.\n\nmy questions  are:\n\na.) if the players want to travel to a location do they put the location card  on top of the current quest card so that it acts as  a quest  card until they put enough markers on it  and discard it after that  or  they put the location card beside the quest card so there are 2  \"quests\" in play together?\n\nb ) which location card is called   \" active \".  i think active is a location only if the players choosed to travel to that location .\n\nthx in advance\n\ndimitris"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44082-travel-question/?do=findComment&comment=441307","commentId":441307,"userName":"YGrams","timestamp":1300689269,"content":" As for your first question, my understanding is that it would be placed on top of the current quest card, which then makes it the 'active' location. The active location is simply the place where your party is at any given time, which is why you can only have one active location at a time - you can't be in two places at once! The active location is treated as another stage of the quest, that is, you need to successfully place x number of progress tokens on the active location before it can be discarded, and your party is then at the next topmost card. Note that if you are currently at a location (ignoring quest deck cards), you cannot travel to another location until that location has been resolved (that is, has had sufficient progress tokens placed on it to remove it from play).\n\nSo I guess, by extension, whichever card is topmost on your quest deck is your active location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44082-travel-question/?do=findComment&comment=441308","commentId":441308,"userName":"BeardFan","timestamp":1300689311,"content":" Yes you put the Location on top of the quest card. This location is now the active location. Progress markers during quest phase go onto the location. You cannot chose to put them on the quest. If you have put enough progress onto the location, the location is discarded. And any excess progress then goes onto the quest card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44082-travel-question/?do=findComment&comment=441310","commentId":441310,"userName":"YGrams","timestamp":1300689428,"content":" Sorry, a correction to what I've said: I just quickly re-read the rules, and the active location is actually placed next to the quest deck. Frankly, though, I think I'll end up putting it on top of the quest deck in case I have a moment of forgetfulness."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44082-travel-question/?do=findComment&comment=441472","commentId":441472,"userName":"BeardFan","timestamp":1300704700,"content":"It's all a question of available space happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nThe rules also state that you put the resource tokens next to your hero, but we always put them directly on the cards during our games. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44082-travel-question/?do=findComment&comment=442050","commentId":442050,"userName":"micheni","timestamp":1300784210,"content":"thx for the answers."}]}