{"url":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/","title":"Let&#039;s Start Thinking About Deck Construction - Deck Archetypes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=443803","commentId":443803,"userName":"Bohemond2","timestamp":1301051096,"content":"Yes, I know that this is ridiculously premature, and highly speculative, but I wanted to start a conversation about hero pairings and deck construction. The following decks have been designed with the assumption that they will be played in two, three or four player games. In addition, I find multi-sphere decks more interesting, in part because they open up far more potential for deck building, and, I think, will be stronger in two player games. Each deck will run, approximately 32 cards in the main sphere and 16 in the secondary, and 2 neutral allies (which the exception of “Men of Middle Earth, which will be closer to 29/19/2). Given the deck size, I am assuming two starters.\n\nSo, here are my initial deck concepts. \n\nElves – 29 Threat\nDenethor - Lore (1W, 1A, 3D, 3H, 8T)\nGlorfindel – Lore (3W, 3A, 1D, 5H, 12T)\nLegolas – Tactics (1W, 3A, 1D, 4H, 9T)\n\nYes, yes, I know Denthor isn’t an elf, but we only have so many heroes, and he pairs amazingly well with his elven friends. . This basic game plan with this deck is to take advantage of high stats. Send Glorfindel off questing, or bring him to bear against a particularly tough foe. Denethor is one of the best reserve defenders in the game with both a high defense, and the ability to exhaust for a special if no foe appears. Legolas makes for a great attack (especially in multi-player), and actually gives your progress for killing.\n\nThe deck will supplement this basic strategy with a deck full of combat tricks. Feints and Forest Snares, and other one-shot cards abound., to all the Legolas and Glorfindel to attack without fear of consequence. The Lore sphere also allows for card drawing, so the hope is, where a mono-tactics deck would run low on cards as the game progresses, the lore deck allows you to keep a hand full of nasty surprises. In addition, Glorfindel and various lore powers give you healing to keep your heroes in the fight.\n\nDwarves – 29 Threat\nGimli – Tactics (2W, 2A, 2D, 5H, 11T)\nGloin – Leadership (2W, 2A, 1D, 4H, 9T)\nThalin – Tactics (1W, 2A, 2D, 5H, 9T)\n\nThe dwarven characters, by nature, want to grind down your opponents. Keep thalin questing, so you can start wearing down monsters that come their way. Gloin wants to put himself in danger, especially once your teammate has ways to heal you, while gimli wants to get bloodied once or twice and turn into an unstoppable killing machine.\n\nWhile the elves focus on combat tricks, healing and card advantage, the dwarves eschew such cards. Instead, they will focus on building a bevy of long term assets. The dwarves will be gathering axes, strapping on gondrian plate mail, recruiting hoards of allies, and generally focusing on the acquisition of permanent, dwarvy assets. Dwarves, by nature not only want to accumulate stuff, but they get salty when they lose something, so cards that give a boost when some of your permanents are destroyed are also a must. That’s not to say that they have no combat tricks, dwarves now the value of a moral boosting wa rcry, and aren’t so scrupulous that they won’t have one of their many allies launch an Ambush, but, in general, they want focus on acquiring vast piles of resources.\n\n\nMen of Middle Earth – 28 Threat\nAragorn – Leadership (2W, 3A, 2D, 5H, 12T)\nDunhere – Spirit (1W, 2A, 1D, 4H, 8T)\nTheodred - Leadership (1W, 2A, 1D, 4H, 8T)\nAs long as Theodred constantly rides around of his horse chasing quest after quest, the men of middle earth abound with resource tokens. Theodred’s ability synergizes perfectly with Aragorn; you can send the heir of Isildur questing and constantly untap him, and still generate three resources a turn. If you are able to find Celebrian’s Stone, or send Dunhere Question, the deck also has more flexibility in resources than other decks, since it can generate Spirit Resources and Leadership resources at the same rate. As for Dunhere, I remain skeptical of his ability. I fear that foes her can kill will engage rather than remaining in the staging area, and the beasts left in the staging area will prove to tough for him to seriously injury. I will test it with him, but if we get another solid spirit hero, he may find himself on the sidelines.\n\nThe deck will focus on protecting and empowering your ally. You can keep threat levels low, toss out helpful boosts, and protect your allies from attack (through Aragorn’s Sentinel ability, if nothing else). The deck will try to include a number of cards which allow you to press through locations and get progress tokens on the quest. More than any other deck, the Men of Middle Earth want to pour cards onto Aragorn to turn him into an unbeatable champion. You want him both questing and fighting on every turn, so he should get loaded down with every helpful permanent you can find.\n\nWomen of Middle Earth – Threat 25 or 16+X\nEowyn - Spirit (4W, 1A, 1D,3H, 9T)\nEleanor – Spirit (1W, 1A, 2D, 3H, 7T)\nBeravor or Bilbo Baggins (1W, 1A, 2D, 2H, 9T)\n\nHow these heroes would work together is a bit of a mystery, since I have yet to see the states or abilities of Beravor (does anyone know these?). In any case, she may be quickly replaced by Bilbo, whose ability to draw cards is just ridiculously. You game plan is fairly simple; take advantage of Eowyn’s ridiculous willpower, as well as her power, and try to plow through quests as quickly as possible. Make sure your threat stays low, since your partner should be doing most (all?) of the fighting. You will focus on healing your ally, even bringing back fallen heroes, providing various forms of support, and generating occasional card advantage for when you need to push Eowyn over the top to finish quests. Most of all, try not to get noticed, because all of your heroes are quite squishy.\n\n\nLet me know what you think about this game plan.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=443883","commentId":443883,"userName":"Troymk1","timestamp":1301058974,"content":" I think this fits in quite well with the thoughts I was having about deck design with 2 sets.\n\n \n\nLet's both playtest these combosthen pool our thoughts here?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=443948","commentId":443948,"userName":"Narsil0420","timestamp":1301068165,"content":"Yeah, I think the Aragorn, Theodred, Spirit Character team would work really well, with Celebrian's Stone. You could really have almost halfhalf leadership/spirit cards in your deck since once Aragorn got C.S. there would be two heroes in each sphere. I might actually go with Eleanor to balance out Aragorn's high threat. And she could take advantage of the Gondor bonus cards in the Leadership deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=443957","commentId":443957,"userName":"Bohemond2","timestamp":1301069165,"content":"I think Eleanor is a beast,if I were just picking characters for a single deck, I agree with you completely .  However, I worry about the viability of the spirit/lore deck without her in it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=443993","commentId":443993,"userName":"9thimmortal","timestamp":1301071514,"content":"Just confirming where everyone is getting their card lists?  When I look at the rules, they are too blurry,the LoTR search engine doesn't seem to be 100% up-to-date with the above cards.  Is there a thread,anther search engine?\n\nThanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444007","commentId":444007,"userName":"Bohemond2","timestamp":1301074190,"content":"Most of the cards come from the preview poststhe videos, also, boardgamegeek has images of several spoilers from various French previews that show a different selection of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444148","commentId":444148,"userName":"Narsil0420","timestamp":1301106083,"content":"Also, if you haven't read the rules, there's a bunch of cards there.\n\nAnd, check out my Heroes spreadsheet on google docs, I've compiled all the info on the heroes there (except Beravor).\n\nhttps://spreadsheets.google.com/ccc?key=0ArA9fFPC4iekdHVxVm50dS10R1Nhd0ljZVg5eDNJd0E&hl=en [https://spreadsheets.google.com/ccc?key=0ArA9fFPC4iekdHVxVm50dS10R1Nhd0ljZVg5eDNJd0E&hl=en]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444409","commentId":444409,"userName":"DrNate","timestamp":1301163529,"content":"Wow, I haven't thought that far ahead, but I do like: Eowyn goes out to do all the important questing, while Gimli an-d Legolas just get to hang outdo the killing (men!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444563","commentId":444563,"userName":"ClydeCloggie","timestamp":1301227662,"content":"I have only one target with this game: winning in single-player Nightmare mode. Obviously I will have to see where the power cards are, but based on what we know so far I'm thinking a Tactics or Leadership major with Eowyn minor sphere might be the way to go. Quick questing and loads of firepower to survive. Will of the West will be a crucial card as it essentially gives you your deck back. Bring it on!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444591","commentId":444591,"userName":"sisyphus5","timestamp":1301233437,"content":" \n\n I've been thinking of trying an all-Lore with Denethor, Glorfindel and (when he comes out) Bilbo.  I have a sneaking suspicion Lore would greatly appreciate the extra cards (as long as you can keep Bilbo alive).  Questing could become a problem --  I'd rather not recruit the Wisest Woman in the World unless I absolutely have to though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444607","commentId":444607,"userName":"Bohemond2","timestamp":1301236180,"content":"I suppose we will see how it plays out in a few weeks, when we get our hands on the core set, but I am wary of Bilbo, especially in a solo game. Yes, he has an amazing power, but he is awful at attacking and questing. his low health makes healing him very inefficient. Denethor, and his ability to foresee the specific threats that await you in the encounter deck, may be what salvages him.\n\nOne of the ideas in the Call of Cthuluhu Card game is that different faction are defined not just by strengths, but also by weaknesses. Each faction has certain things it can't do well. I suspect we may see something similar with spheres in LotR. Playing cooperatively allows you to camouflage those weaknesses, but, for solo play, they may well be exposed. I think that dual sphere decks will outperform mono-sphere decks in solo play, especially with the limited card-pool we start out with.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444761","commentId":444761,"userName":"Jerry Rigg","timestamp":1301255760,"content":" I don't really care how *viable* it is - I know the first deck I make will utilize the Three Hunters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444770","commentId":444770,"userName":"Narsil0420","timestamp":1301256942,"content":"Jerry Rigg said:\n\n I don't really care how *viable* it is - I know the first deck I make will utilize the Three Hunters.\n\n\n\nTotally! That's so exciting! Of course your threat would be high (32) but they compliment each other really well. Aragorn can quest, Gimli defend, and Legolas (and Aragorn, if you use his ability) can attack. If you use Celebrian's Stone, you could even put in a couple threat reducing cards (Galadhrim's Greeting) from the Spirit sphere in your deck and play them once Aragorn had the Spirit Icon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444774","commentId":444774,"userName":"Bohemond2","timestamp":1301257582,"content":"The Three Hunter should work very well together.  You will start out with a very high threat, which puts you on a bit of a clock, but you will carve a bloody swathe through any enemies foolish enough to engage you. \n\nHowever, you probably want the vast majority of your deck to be tactics cards, with only a handful of low-cost leadership cards.  Taking advantage of Aragorn's power means that you wil have precious few non-tactics resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444776","commentId":444776,"userName":"DrNate","timestamp":1301257778,"content":"Jerry Rigg said:\n\n \n\n I don't really care how *viable* it is - I know the first deck I make will utilize the Three Hunters.\n\n \n\n \n\nI'm with you. Maybe not my first deck, but my first Tactics/Leadership deck will be the Hunters. I probably want to try Gimli, Legolas, Eowyn first. Then Aragorn, Theodred, Eowyn. Then the Hunters are third. I'm going to be busy when this game ships. But will I end up trying all 112 combinations? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444792","commentId":444792,"userName":"sisyphus5","timestamp":1301262161,"content":"Jerry Rigg said:\n\n \n\n I don't really care how *viable* it is - I know the first deck I make will utilize the Three Hunters.\n\n \n\n \n\n \n\nOne of the attractions of this game to me is taking things that AREN'T perfectly streamlined decks and making them work anyway. :-D\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=444825","commentId":444825,"userName":"Apophenia","timestamp":1301269711,"content":"Sisyphus said:\n\nOne of the attractions of this game to me is taking things that AREN'T perfectly streamlined decks and making them work anyway. :-D \n\n\n\nOne of the things I want to try and do when making decks is to choose three random heros (Maybe limit them to two spheres) and try and build a deck around them. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=445051","commentId":445051,"userName":"Toqtamish","timestamp":1301305589,"content":"That sounds like fun. I like that idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=445100","commentId":445100,"userName":"9thimmortal","timestamp":1301310299,"content":"I really like the Leadership cards so far.  Resource inflation is pretty good - Theobred/Gloin probably can put out some major resources, especially with Stward of Gondor. \n\nPlus, they can use the Sneak Attack/Gandalf combo that seems pretty strong.  Need a way to get those Sneaks back in the deck!  Plus Valiant Sacrifice to get cards to use those resources on. \n\nI think I will be trying a ton of combos though, like people said :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nCan't wait!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44290-lets-start-thinking-about-deck-construction-deck-archetypes/?do=findComment&comment=447791","commentId":447791,"userName":"Martellus2","timestamp":1301726969,"content":"Narsil0420 said:\n\nAlso, if you haven't read the rules, there's a bunch of cards there.\n\nAnd, check out my Heroes spreadsheet on google docs, I've compiled all the info on the heroes there (except Beravor).\n\nhttps://spreadsheets.google.com/ccc?key=0ArA9fFPC4iekdHVxVm50dS10R1Nhd0ljZVg5eDNJd0E&hl=en [https://spreadsheets.google.com/ccc?key=0ArA9fFPC4iekdHVxVm50dS10R1Nhd0ljZVg5eDNJd0E&hl=en]\n\n\n\nSuperb! Thanks,\n\n "}]}