{"url":"https://community.fantasyflightgames.com/topic/44330-scenario-building/","title":"Scenario Building","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/44330-scenario-building/?do=findComment&comment=444187","commentId":444187,"userName":"faith_star83","timestamp":1301114808,"content":"So as far as I understand, the game will provide scenarios (consisting of quests and encounter decks) and the players build the adventuring group (Heroes) and the Hero's Deck? New adventure packs add some player cards, a hero and a new scenario (consisting of quests and encounter decks). So we will end up with a lot of Quests and Encounter cards after some time.\n\nDid anybody spend some thought on building his own scenarios? I certainly find this very intriguing and will try to do so once I collected some Adventure Packs providing additional cards. For an example, designing once own quests and putting together an appropriate Encounter Deck, or just putting togther a new group of quest cards to try and tell different story. I think there is a lot of potential in that area, too!\n\nIt would be nice if ffg would organize some scenario building contests or such!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44330-scenario-building/?do=findComment&comment=444691","commentId":444691,"userName":"Casamyr","timestamp":1301245304,"content":"I think it will be quite easy and quick to build new scenarios to play, since each scenario card (1a, 2b, etc) shows which encounter cards to add to the encounter deck.\n\n \n\nThe tough part, I suppose would be picking the quest cards so that they make some kind of sense (if you're into that thing) when you are adventuring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44330-scenario-building/?do=findComment&comment=444735","commentId":444735,"userName":"Bohemond2","timestamp":1301250495,"content":"My sense is that you would have more success creating your own quest cards, rather than trying to mix quest cards together from different sets."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44330-scenario-building/?do=findComment&comment=444796","commentId":444796,"userName":"Casamyr","timestamp":1301262818,"content":"that was my other thought - to create your own scenarios. I'm sure that with monthly adventure packs with their new encounter decks there will be sufficient quests to pick from that will fit together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44330-scenario-building/?do=findComment&comment=978150","commentId":978150,"userName":"Dwarf king Bronze beard","timestamp":1391860842,"content":"I have been made a couple of guests my self and i think that would be awesome that we could make our own scenarios in here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited February 8, 2014 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44330-scenario-building/?do=findComment&comment=978170","commentId":978170,"userName":"booored","timestamp":1391863271,"content":"there are some very good custom quests... in fact one of the main custom quest guys from ages ago is now working on the game for FFG.. I haven't looked at customs for a while so with the current card pool not sure how they stand up...\n\n \n\nOrc Hunt [http://boardgamegeek.com/filepage/80417/orc-hunt-custom-scenario] is a fun one... HilariousPete made it and he tried ot capture the corruption mechanics from Middle Earth CCG.\n\nRaid on the River Carnan [http://boardgamegeek.com/thread/805266/feonixs-custom-scenario-4-raid-on-the-river-carn] - One of Finox's ones... this is a good one.\n\nThe Culling at the Barrow-downs [http://boardgamegeek.com/filepage/71574/feonixs-scenario-3-the-culling-at-the-barrow-downs] - is also Finox... this was the first one I ever played.. back before Kaz was out.. very very cool. I still like it and play it.. but it is a bit easy now... but you can include the nightmare cards now to beef it up a little.\n\nWeb of Isengaurd is a custom deluxe expansion... so far only part 1 and 2 of the quests are out.. but also some player cards and heroes you can try..  it is focused on secrecy. Custom Scenario: Web of Isengard (Part 1) [http://boardgamegeek.com/filepage/83490/custom-scenario-web-of-isengard-difficulty-7] , Custom Scenario: A New Power is Rising (Web of Isengard Part 2) [http://boardgamegeek.com/filepage/86004/custom-scenario-a-new-power-is-rising-web-of-iseng]\n\nThe Anduin and the Pursuer [http://boardgamegeek.com/filepage/91963/deck-the-anduin-and-the-pursuer] looks good I havn't played this one though.. but looks quality\n\n \n\nI have been meaning to make one for ages but just never get the time.\n\n \n\n \n\nI recommend PRINTERSTUDIO to print out sets of cards.\n\nEdited February 8, 2014 by booored"}]}