{"url":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/","title":"Hello... I&#039;m a newb in LCG ^_^","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445279","commentId":445279,"userName":"BioDio","timestamp":1301324256,"content":"Hi there,\n\nI'm not a huge geek in this stuff, I just have the WoW boardgame, and when I bought it I played it a lot, and I still like it ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\nToday I discovered the LCG and... wow... it sounds cool! It makes me remember of the Fighting Fantasy books but in a card game (and I love those books, sometimes I still read one).\n\nI wanted to ask if, the other LCG from FF can be played singleplayer too, and if they are better (from what you have seen) than the LotR one, and, when is LotR going to be released?\n\nBtw, a final question, for a non-geek/nerd, will I find this game interesting =x? It really sounds rly cool... and I love not to be collecting cards!! so I don't waste too much money!\n\nAnd what I need is the Core game and then I can buy any expansion in any order right?\n\nBtw, for trading card games, I don't like Magic, I like the WoW TCG, Eye of Judgment (lol.. just lol.....), and well... ... the one I liked the most is Yu-gi-oh... It sounds stupid but... the artwork was bad (I don't like those anime style of art) but I loved the quick and fast gameplay, and it is still the card game I like the most. I hate Pokemon btw >_<\n\nSorry if I'm being... too weird =x it's my 1st post in FF..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445288","commentId":445288,"userName":"faith_star83","timestamp":1301324916,"content":"I think it is difficult for other people to judge wether you will like the game or not. Mostly because the game is not yet available so there are no players with a lot of playing experience.\n\nProbably you should consider these three points to get an idea wether you might like lotr or not:\n\n1) Do you like the setting, story and characters of the Lord of the Rings? And the artwork that can be seen in the videos / on the screenshots?\n\nSince this is a Lord of the Rings games, the game will probably be at its best for fans of Tolkiens work. Also the game seems to draw heavily on the story-telling elements of the quests and scenarios.\n\n2) Do you like cooperative games?\n\nCooperative games are not loved by everyone. Basically you play alone or with friends against the game mechanics / scenario deck. You might find a similar experience in e.g. Arkham Horror and should some time to think on wether this might be something for you.\n\n3) Do you like to spend time on developing strategies / build decks and be explorative?\n\nMuch of this games value comes from the wide variaetiy that the LCG format adds. By adding new cards through adventure packs you will be able to devise new strategies and try out lots of combos. On the other hand, the game might lose much of its appeal when you don't like spending time to build and try out new decks.\n\nI only know the A Game of Thrones LCG apart from this one and it is for 2-4 players.\n\nHopefully, you will be able to determine a bit better wether or not this game might be interesting for you. I think the game will become more interesting by exploring new quests that are added with the adventure packs, so the core set will just be the beginning. On the other hand, if you are reluctant to buy an adventure pack from time to time the game might become boring quickly.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445297","commentId":445297,"userName":"BioDio","timestamp":1301325890,"content":"Thanks for the reply\n\nI Think I'll go with LotR, I've already seen the Toturial Videos.\n\nI've read your points, and yeah, I like co-op games (WoW boardgame is a co-op game too) and I really enjoy building new decks, allways doing that with some TCG I have, but one thing that makes me really want LotR it's is Singleplayer component of the game, this way, I can play with a friend when he comes to my house, but when he isn't here, I can play alone when I want! I loved that feature in WoW boardgame too.\n\nI like LotR, loved the movies and reading Hobitt, the art in the cards look awesome, the only thing that I'm really worried is if this can be a quick cash in using the sucess of LotR right now =x I want a really good LCG game, and to be able to play singleplayer, that is why I'm asking if the other LCG can be better and I was allways curious about A Game of Thorns"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445301","commentId":445301,"userName":"Bohemond2","timestamp":1301326048,"content":"The other LCGs are not cooperative, nor can they played solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445304","commentId":445304,"userName":"BioDio","timestamp":1301326388,"content":"Done, I'm buying lotR lol =p\n\nWhen is it going to be released? April?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445314","commentId":445314,"userName":"Toqtamish","timestamp":1301327170,"content":"Yes in April. We believe it to be April 15th. May will be the first adventure pack and June the second with one every month to follow like that. Usually there is a 1 month break after the cycles 6 packs are all released and then the next cycle starts up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445317","commentId":445317,"userName":"BioDio","timestamp":1301327356,"content":"I'm going to mail my usual store of boardgames and ask if they are going to import it (I'm in EU)\n\nWell, it is LotR so, it will get imported for sure..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445371","commentId":445371,"userName":"9thimmortal","timestamp":1301331289,"content":"Just a side-note though - if you liked WoW TCG, then you will like the Warhammer LCG for sure, and probably the Game of Thrones LCG (especially considering the looks-to-be-awesome HBO series coming up). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/44439-hello-im-a-newb-in-lcg-_/?do=findComment&comment=445439","commentId":445439,"userName":"BioDio","timestamp":1301338887,"content":"Yay, I just mailed my store and they replied saying that they will have the game ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png] maybe even close to the US release date!\n\nThis game rly looks awesome!"}]}