{"url":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/","title":"Tournament suggestions?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=446469","commentId":446469,"userName":"antivelar","timestamp":1301500616,"content":"So far I have came up with tournament rules to consist of two to three rounds. Usually random quests or the newest quest doing it multiple times with different groups. This makes it more likely for people to build decks that are more well rounded. It will also make peoples scores different. The way people will be mixed up is by there score. Every round each player with the same score will play with someone else so they have more of a chance of having a different score.\n\nHow does everyone feel about a format that doesn't make you come as a team?\n\ni like it because it changes the game and it also makes it more interesting to play with different combinations. Maybe 4 lore decks will be all together or one of each sphere. Or multisphere decks. Mixing with other players will keep it fresh in tournament form, but you can still go in with your friends on non tourney days.\n\ni hope FFG adopts a tournament format soona nd supports it with promos or something to encourage players to get in. If not i will do the supporting myself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=446672","commentId":446672,"userName":"faith_star83","timestamp":1301536576,"content":"antivelar said:\n\nThe way people will be mixed up is by there score. Every round each player with the same score will play with someone else so they have more of a chance of having a different score.\n\n\n\n \n\nI am not sure how to understand this, but if I'm not mistaken then the Score you get at the end is for the group not individual players, so basically all players that did the same quest have the same score.\n\nI did think a little bit about tournament format but didn't come up with a good one, as this is a co-op game. I really look forward to what ffg does, but as I don't expect much support / activity in my area anyway I rather hope for a solid casual experience in the beginning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=446679","commentId":446679,"userName":"antivelar","timestamp":1301538272,"content":"The way the tournament would work is lets say 8 players show up. First round randomly each player plays a four player co-op game in two pods. Then the second round each player that played in the first round will be paired with one of the other players in the other pod.\n\nSo Pod 1 scores 35 points and Pod 2 scores 25 points.\n\nPlayer 1 from pod 1 and player 5 from pod 2 play round two together and get 30 points\n\nPlayer 2 from pod 1 and player 6 from pod 2 plaround two together and get 27 points\n\nPlayer 3 from pod 1 and player 7 from pod 2 play round two together and lose for 50 points\n\nPlayer 4 from pod 1 and player 8 from pod 2 play round two together and get 44 points\n\nScores by Place\n\nFirst Place: Player 6: 52\n\nPlayer 5: 55\n\nPlayer 2: 62\n\nPlayer 1: 65\n\nPlayer 8: 69\n\nPlayer 7: 75\n\nPlayer 4: 79\n\nPlayer 3: 85\n\nScoring works fine and helps players try to build more rounded decks. It also can have mix rounds of 3 players and solo rounds, even though they need to be monitored more closely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=447031","commentId":447031,"userName":"PWBrian","timestamp":1301586062,"content":" Given the length of play, I don't think a tournament in which players rotate from group to group is really feasible.  In order to be fair, players would need to play with a pretty wide variety of other players (or preferably all of them).  This would have to put a hard limit on the size of the tournament or fairly harsh time limits on individual rounds of play.  Players could also play poorly in a round, just to lower the overall score of a competitor.  I just don't think co-operative play is well suited to individual competition.\n\nTeam-based competition, on the other hand, makes a lot more sense to me.  Say, if players come in with fixed teams and pit their decks against a few different scenarios, that would have some benefits over individual competition:  It would limit the potential length of the tournament by allowing a fixed number of rounds, it would eliminate some of the unnecessary kingmaking, and it would still require rounded decks while allowing players to create synergies between each other.\n\nOf course, that would also require coming up with teams beforehand, which is its own concern. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=447116","commentId":447116,"userName":"9thimmortal","timestamp":1301594412,"content":"For sure there would be a ton of issues with co-op. \n\nI would love to see teams going to compete together...but you would need a judge at every table.\n\nIndividuals moving between tables would be interesting since there would be more self-policing.  Another issue would be the unique part of the heros - you would have to bring 2-3 decks otherwise you would consistently be using the same heros. \n\nLastly, Solo with your opponent watching (and maybe speeding things along by 'playing' the shadow side) would work. \n\nEither way, luck is still such a huge factor, it would never be that great of a competative game.  But, maybe someday someone smarter than me at FFG will figure out a way!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=449700","commentId":449700,"userName":"Maniacske","timestamp":1302063879,"content":"It would be awesome if FFG decides to release new quests specifically designed for tournament play!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=449775","commentId":449775,"userName":"DB.Cooper","timestamp":1302082172,"content":" FFG already explained a bit the tournaments in an old article...\n\nWhat I understood was that you go with a friend and play against unique and original scenarios each turn and go on through the tournament with the easy scoring system. \n\nI guess it's a \"couple-system\", where you go after testing your decks and ready them for a variety of scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=449785","commentId":449785,"userName":"servant of the secret fire","timestamp":1302083611,"content":"DB.Cooper said:\n\n FFG already explained a bit the tournaments in an old article...\n\nWhat I understood was that you go with a friend and play against unique and original scenarios each turn and go on through the tournament with the easy scoring system. \n\nI guess it's a \"couple-system\", where you go after testing your decks and ready them for a variety of scenarios.\n\n\n\nI think this is the best.Participate at tournaments as a team with your friends is an excelent idea and somethink new than the usual competitive card game tournaments.That type of tournaments is one more reason to spend hours with your friends to find the best deck for a random scenario wich you will face in a tournament."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=449829","commentId":449829,"userName":"PWBrian","timestamp":1302088750,"content":"DB.Cooper said:\n\nWhat I understood was that you go with a friend and play against unique and original scenarios each turn and go on through the tournament with the easy scoring system. \n\n\n\nI hadn't thought about them offering unique tournament scenarios.  That would be a good way to handle things, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=449886","commentId":449886,"userName":"Toqtamish","timestamp":1302094406,"content":"That is what they hinted at when it was mentioned about tournaments. Hopefully we will see more details once the game is out on the shelves or in customers hands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/44547-tournament-suggestions/?do=findComment&comment=450517","commentId":450517,"userName":"9thimmortal","timestamp":1302194199,"content":"servant of the secret fire said:\n\nDB.Cooper said:\n\n \n\n FFG already explained a bit the tournaments in an old article...\n\nWhat I understood was that you go with a friend and play against unique and original scenarios each turn and go on through the tournament with the easy scoring system. \n\nI guess it's a \"couple-system\", where you go after testing your decks and ready them for a variety of scenarios.\n\n \n\n \n\nI think this is the best.Participate at tournaments as a team with your friends is an excelent idea and somethink new than the usual competitive card game tournaments.That type of tournaments is one more reason to spend hours with your friends to find the best deck for a random scenario wich you will face in a tournament.\n\n\n\nI don't think it is an issue of scenarios.  But on how to keep them 'legal' I guess.  If there isn't a judge @ every table, I really don't know how.  Most FFG competative games (since there is no REAL money involved) are fun and fair, but in every competative game, there has to be a way to make sure everyone is playing by the rules.  *shrug*  In co-op, I just don't know how that happens."}]}