{"url":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/","title":"CardGameDB now supports Lord of the Rings LCG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/?do=findComment&comment=451750","commentId":451750,"userName":"Darksbane","timestamp":1302432460,"content":"It's just a handful of days before the Lord of the Rings Living Card Game goes on sale now, so I decided to release the utilities for it so everyone can hit the ground running when building decks and searching for cards.\n\nFor those of you who play the other two games we support (Game of Thrones and Call of Cthulhu) these features will look familiar but to those new to CardGameDB here is what we offer to assist in your enjoyment of the Lord of the Rings LCG.\n\nLord of the Rings Deckbuilder [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-deckbuilder]:\n\ndeckbuilder.jpg [http://www.cardgamedb.com/forums/ccs_files/site_images/deckbuilder.jpg] [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-deckbuilder]\n\nThe Lord of the Rings Deckbuilder allows you to search for cards and add them to your deck by clicking the +, you can add or remove cards from your deck with the + and - buttons on each card. Once the deck is built you can save your deck online at CardGameDB (must be logged in), export it as .txt file, or copy it as BBCode. Once saved online you can come back to it anytime and modify it or submit it to the site for inclusion in the Lord of the Rings Decks section. The Deckbuilder also has realtime graphing to easily track your characters strength, your cards cost, the number of each card type, and the number of each sphere. Flash 10 is required for this. Currently, as the deckbuilder is very reliant on card images, only a few of the cards are available in it  as an example of what it can do. Once the game is released I'll enter in the rest of the hero cards and update the images.\n\nLord of the Rings Submitted Decks Section [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks]:\n\ndeckview.jpg [http://www.cardgamedb.com/forums/ccs_files/site_images/deckview.jpg] [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks]\n\nOnce your deck is submitted it will show up in the submitted decks section and in the forums. The forums provides an easy way to discuss all the new decks and the decks section will show the more detailed information like deck graphs and sample hand.\n\nLord of the Rings Spoiler List [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler]:\n\nspoiler.jpg [http://www.cardgamedb.com/forums/ccs_files/site_images/spoiler.jpg] [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler]\n\nA traditional spoiler list organized by sets. You can drill down in each set to individual cards to view an image of the card, comment on that card and give it a 1 to 5 card rating.\n\nLord of the Rings Advanced Card Search [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-advanced-card-search]:\n\nadvanced.jpg [http://www.cardgamedb.com/forums/ccs_files/site_images/advanced.jpg] [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-advanced-card-search]\n\nJust looking for a easily searchable database of cards? The Card Search page gives you search options to find any card and shows a consise list of spoilers for those cards, you can hover over a card's name to see an image and click on the card's name to go to its page.\n\nAs with the other supported games there is also a quick search option at the top of every page to let you instantly search for the card you are looking for no matter where you are on the site. We also have forums, a member map, small chat room, and more coming soon.\n\n \n\nCurrently most of the available spoilers should be in our database, and when the game is actually released I should be able to make any corrections and add in the missing cards as soon as it is available. If you see any errors or have any suggestions for improvements please feel free to let me know.\n\nI'm also looking for people who might be interested in writing strategy, gameplay, or card spotlight articles for the Lord of the Rings LCG (and also for the Call of Cthulhu LCG and Game of Thrones LCG). If you think you'd be interested drop me a line either at cardgamedb [at] gmail [dot] com or in a private message on CardGameDB.com.\n\nCardGameDB is not in any way affiliated with FFG or any of the copyright holders for their games, we just love card games and especally FFG's Living Card Game format.\n\nMake sure to Like us on Facebook [http://www.facebook.com/pages/CardGameDBcom/121405217909645] and follow us on Twitter @CardGameDB [http://www.twitter.com/CardGameDB] for updates on the site content and any game news."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/?do=findComment&comment=451825","commentId":451825,"userName":"Toqtamish","timestamp":1302445338,"content":"Thanks Darksbane, I saw that this morning on the site when I went to get the new episode of 2 champs and a chump."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/?do=findComment&comment=451913","commentId":451913,"userName":"tjmk","timestamp":1302463615,"content":" Great work. You really do some high-quality, easy-to-use stuff with the site. Much appreciated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/?do=findComment&comment=451934","commentId":451934,"userName":"Saintsman","timestamp":1302467038,"content":"Excellent work! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/?do=findComment&comment=452008","commentId":452008,"userName":"faith_star83","timestamp":1302486040,"content":"Awesome! Thank youhappy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/?do=findComment&comment=452042","commentId":452042,"userName":"YGrams","timestamp":1302497108,"content":" Looks brilliant, Darksbane; I'm sure it will prove of great use to those of us who have no experience with card games (for example, me). The only thing I'd point out is that the Cost/Willpower/Attack/Defence/Hit Points graph on the deck page looks a bit difficult to read clearly, but it may very well just be me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45064-cardgamedb-now-supports-lord-of-the-rings-lcg/?do=findComment&comment=452092","commentId":452092,"userName":"Darksbane","timestamp":1302509902,"content":"Thanks everyone, glad you like it.\n\nYGrams said:\n\n \n\n Looks brilliant, Darksbane; I'm sure it will prove of great use to those of us who have no experience with card games (for example, me). The only thing I'd point out is that the Cost/Willpower/Attack/Defence/Hit Points graph on the deck page looks a bit difficult to read clearly, but it may very well just be me.\n\n \n\n \n\nYeah I agree, you can turn off any of the individual column graphs by clicking on their name in the legend, and you can rotate the column graph by clicking and dragging on it for a better view. I'm going to look into some different kinds of graphs though to see if there might be one better suited. Perhaps a normal 2d graph would look better."}]}