{"url":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/","title":"Storyline / Scenario speculations","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=452036","commentId":452036,"userName":"faith_star83","timestamp":1302495126,"content":"I know some people might not like speculation, but I think it's quite interesting to hear other people's thoughts and speculations. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif] It's also great to have some atmosphere while waiting for the last (10?) days until the release of the core set!\n\nSo I wonder what you guys think might come after the Shadows of Mirkwood cycle? We already have the wish list thread where everybody posted what they hope to see, but in this thread I would like to try and elaborate what storylines there might be to provide for another cycle (considering timeline and story progressing). I am no expert on Tolkien lore and Middle-Earth so I hope for some insights from more knowledgable people.\n\nOk, let's start. My first thought was, that considering the Shadows of Mirkwood cycle deals with the Hunt for Gollum, there might as well be a cycle about Gandalf and his search for the One Ring (someone already mentioned this in the wish list thread) since it would fall in the time between the Hobbit and The Lord of the Rings. Maybe we will even see Gandalf as a Hero? Kind of a change of perspective...(Is it even possible in a LCG to have the same character be printed as ally and hero? Or will we never see Gandalf as a Hero because he's an ally in the core set?).\n\nLet me know what you think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=452040","commentId":452040,"userName":"ClydeCloggie","timestamp":1302496412,"content":"I will assume that future expansions will continue where the last one ended. So after the sixth adventure pack, we'll be back in Thranduil's Halls in Mirkwood.\n\nFrom there, the heroes could go east and north towards Dale, the Lonely Mountain, and even further into the Grey Mountains. That could mean Dragons.\n\nSouth is the way towards Gondor and Ithilien, where we could face the build-up of Sauron's forces, maybe with some spying quests into Mordor. We may have to pay Shelob a visit, although I personally think that's unlikely as the designers may want to move away from Spiders for the next cycle. Gondor itself is still fairly safe at this time, though, so it's hard to see where the big threats will be coming from if the action doesn't move towards Mordor.\n\nTo the south-west we have Isengard and Fangorn...Saruman and the Ents.\n\nTo the west, we could go over the Misty Mountains (via Moria or Redhorn Pass) towards Rivendell and on to The Shire, but it would mean going through Mirkwood once again. Of course, the designers could choose to leave this bit out of the narrative and start from Lorien...\n\nActually, that's my bet: a cycle starting from Lorien, moving west over or under the Misty Mountains, to Rivendell. And obviously such an itinerary would not ignore Moria...I'm thinking we might see the Balrog, Durin's Bane, within a year or so.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=452663","commentId":452663,"userName":"faith_star83","timestamp":1302601128,"content":"wow...thanks for the very detailled explorations!\n\nI also don't think that we will see much of spiders and forest in the next adventure pack cycle, but I have the impression that its too early for moria. Actually, I am not sure and - as mentioned - am not too familiar with details of the storyline, but did anybody venture into these mines before the fellowship went there? wasn't gimli still thinking his cousin was living there and gandalf didn't remember the password?\n\nAnyway, Mines of Moria would be predestined as the first deluxe expansion. Considering that the current cycle seems to feature a lot of elves and rohirim we might see some gondor or dwarf action!\n\nI really wonder if we might still get a gandalf hero version, though ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=452694","commentId":452694,"userName":"servant of the secret fire","timestamp":1302604437,"content":"faith_star83 said:\n\nwow...thanks for the very detailled explorations!\n\nI also don't think that we will see much of spiders and forest in the next adventure pack cycle, but I have the impression that its too early for moria. Actually, I am not sure and - as mentioned - am not too familiar with details of the storyline, but did anybody venture into these mines before the fellowship went there? wasn't gimli still thinking his cousin was living there and gandalf didn't remember the password?\n\nAnyway, Mines of Moria would be predestined as the first deluxe expansion. Considering that the current cycle seems to feature a lot of elves and rohirim we might see some gondor or dwarf action!\n\nI really wonder if we might still get a gandalf hero version, though ;-)\n\n\n\nOk a quick journey threw Kazad-Dum.\n\nIn the year 1980 of the third age Dwarves dug too much and deep and they unleashed the Balrog who killed DurinVI (THE KING).In the next year Nain Durins son tried to take back Kazad-Dum but he lost and Dwarves fled from their home.\n\nAfter those events for 500 years  Balrog lurked alone and later Sauron directed orcs and trolls from Mordor to Moria.After that we have the battle of dwarves and orcs in year 2994 at the east gate of  Moria.Dwarves were victorious but they could not reclaim Moria cause Balrog was still therelengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif].\n\nExcept those events we have Gandalf's journey to Moria somewhere between the years 2841-2941 and also Aragorn did a secret journey to Moria but i don't remember the year now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=452925","commentId":452925,"userName":"qwertyuiop","timestamp":1302643157,"content":" I'd like some hot withered heath action, and Moria, and Ithilien.  And the area surrounding Bree. And Gundabad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=453989","commentId":453989,"userName":"Eryx_UK","timestamp":1302861542,"content":"I'd love to have Moria as an expansion. That would be so cool. But I'd also want to see other areas of Middle Earth covered such as Cardolan, Angmar, Mordor itself (that should be the toughest story to complete), Dagolad and the Dead Marshes. I'm sure we'll get them but just making hopeful suggestions that all areas of Middle Earth will see some love from FFG,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=454007","commentId":454007,"userName":"Frank36","timestamp":1302862555,"content":"ClydeCloggie said:\n\nTo the west, we could go over the Misty Mountains (via Moria or Redhorn Pass) towards Rivendell and on to The Shire, but it would mean going through Mirkwood once again. Of course, the designers could choose to leave this bit out of the narrative and start from Lorien...\n\nActually, that's my bet: a cycle starting from Lorien, moving west over or under the Misty Mountains, to Rivendell. And obviously such an itinerary would not ignore Moria...I'm thinking we might see the Balrog, Durin's Bane, within a year or so. \n\n\n\n \n\n+ 1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=454145","commentId":454145,"userName":"Watcher2","timestamp":1302872030,"content":"The_Big_Show said:\n\nI'd love to have Moria as an expansion. That would be so cool. But I'd also want to see other areas of Middle Earth covered such as Cardolan, Angmar, Mordor itself (that should be the toughest story to complete), Dagolad and the Dead Marshes. I'm sure we'll get them but just making hopeful suggestions that all areas of Middle Earth will see some love from FFG,\n\n\n\n \n\nYes, I bet Moria will be an entire expansion set, as will Mordor (which I see being a couple years down the line).\n\n \n\nJeez Louise, there are so many cool ideas and possibilities I don't know what we'll see! Or what I'd like to see first!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45094-storyline-scenario-speculations/?do=findComment&comment=462130","commentId":462130,"userName":"richsabre","timestamp":1304309850,"content":"as ive said in another post, i hope dale, erebor, misty mountains, will be there\n\n \n\nalso there Angmar with the witch king, you could have in the Barrow Wieghts, the old  forest with Old man willow and Tom Bombadil"}]}