{"url":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/","title":"Allied Spheres?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452348","commentId":452348,"userName":"Bohemond2","timestamp":1302535753,"content":"I will start out by saying that these comments are speculative, based on what very little we have seen in card teasers.\n\nWe have seen a couple of cards that suggest a synergy between the spheres of Spirit and Leadership.  Celebrian's Stone and Aragorn work together to encourage a Leadership/Spirit deck.  The newly revealed Summing the Rohirim also encourages the same combination (assuming that Rohan allies are, like Rohan heroes, split between leadership and Spirit.  And I think that's a safe bet).\n\nMy question is this.  How do you think dual sphere synergies will work?  Will we see a pair of of two allied Spheres (Leadership/Spirit and Tactics/Lore)? Do you think we will have a wheel of alliances (Spirit aligned with leadership and Lore, Leadership aligned with Spirit and Tactics, Tactics aligned with Lore and Leadership, etc.)? Do you think all six possible alliances will be supported?  Do you think these cards are anamolous, and we won't see much dual sphere support out of the gate?  Do you see us starting with one of these possibilities in the Core set and moving to another as the game expands?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452351","commentId":452351,"userName":"Toqtamish","timestamp":1302536160,"content":"I could see all 6 possibilities as the game expands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452371","commentId":452371,"userName":"servant of the secret fire","timestamp":1302540276,"content":"If we will not have all 6 possibilities it will be a very bad thing for the game (especially for a coop game).I dont have experience from coop games but from what others say in those forums the most exciting thing in a coop game is to create different decks to win the game.If your possibilities are few then i don't see this game going too far.\n\nOne more think i don't want to see in this game is useful allys,events,heroes etc only for the current adventure pack.\n\nFor example i want Radagast and the Eagles to be useful in all future and previous scenarios and i don't want the game forces me to play with all new cards from the new adventure pack or else i can't complete the scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452376","commentId":452376,"userName":"YGrams","timestamp":1302541406,"content":" From what little we've seen of the cards, I'd hazard a guess that Tactics/Leadership decks and Lore/Spirit decks might have difficulty questing and in combat, respectively, but hopefully they'll still be viable. I think, though, that this could be counter-balanced with cards like Steward of Gondor, in that hopefully you're able to generate enough resources to offset the weaknesses of your combination of spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452380","commentId":452380,"userName":"Toqtamish","timestamp":1302542259,"content":"It will probably end up like a lot of other card games. All are possible and there are cards for all possibilities but some just work better off of each other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452401","commentId":452401,"userName":"mkultra","timestamp":1302543806,"content":"It really is too early to tell. Once we have access to all the cards, we will know how practical dual sphere decks can be. All it takes is a couple of cards from one sphere to provide adequate resources of another sphere at a reasonable price. If that happens, let the deckbuilding begin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452407","commentId":452407,"userName":"Bohemond2","timestamp":1302544583,"content":"mkultra said:\n\n \n\nIt really is too early to tell. Once we have access to all the cards, we will know how practical dual sphere decks can be. All it takes is a couple of cards from one sphere to provide adequate resources of another sphere at a reasonable price. If that happens, let the deckbuilding begin.\n\n \n\n \n\nIf we can't wildly speculate on the internet, how will we occupy ourselves for the next two weeks until release?\n\nI think combining any of the two spheres out of the box will make for a viable deck, though, perhaps not a viable solo deck.  For this question, I was more interested in if people anticipated that we would see specific cards that would encourage dual-sphere decks.  Given the limited pool of cards in the core set, I would be surprised to see cards that encouraged all six combinations right off the bat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452414","commentId":452414,"userName":"Toqtamish","timestamp":1302546044,"content":"It's most likely something that will be developed over time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452481","commentId":452481,"userName":"DrNate","timestamp":1302557428,"content":"I think that a few spheres will just mesh together better from the start. It may take a few weeks to discover which ones they are, but I doubt that all six (o-r twelve, if you consider one sphere primary and one support) will be equally optimal. You also have to consider the quest at hand, some spheres my synergize better when faced with specific challenges. I do hope that they are all equally fun, regardless. \n\nAs expansions come out, the game will evolve; hopefully the gap between these spheres will narrow. Again, it will take time to figure out, but that's part of the fun of living card games, am I right?\n\nThis makes me wonder how skilled/lucky you have to be to make a three sphere deck work. Or even (dare I say it?) a four sphere deck! Aragorn/Tactics Hero/Lore Hero, then use Celebrian's Stone on Aragorn to play Spirit cards. That's an insane deck. Who's game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452492","commentId":452492,"userName":"Scoob4","timestamp":1302559355,"content":"One thing I've discussed with the friends I'll be playing this game with is how much the different roles feel like a computer MMO RPG to me. I guess not everyone will have played one, but for those who have, you have healing, tanking, dps, and hybrid classes to choose from. In looking over the basics for the spheres, it looks to me like tactics, even though it will have the playstyle of dps, will be the tanks, as they draw the encounter deck's attention for questing to occur. Lore is healing. Spirit, especially with Eowyn, look like the dps that wears down the quest. Finally, leadership will possibly be a hybrid sphere.\n\nBut what really gets me excited about speculating is a sort of \"pick up group\" approach to deckbuilding. I'm sure each sphere will have some ability to act like hybrids. So what if you decide to build a 2 tactic/1 lore hero deck where you choose lore cards that focus on combat instead of healing to supplement the combat of tactics. You show up on the day  your friends have agreed to get together and say \"I built this great tanking deck, who has a healing deck they want to pair with me.\"\n\nThis might not be exactly the kind of speculation asked for, but to me it's what I'm most excited to try: Building multi-sphere decks that still have a heavy focus on one element of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452653","commentId":452653,"userName":"faith_star83","timestamp":1302600101,"content":"servant of the secret fire said:\n\nOne more think i don't want to see in this game is useful allys,events,heroes etc only for the current adventure pack.\n\nFor example i want Radagast and the Eagles to be useful in all future and previous scenarios and i don't want the game forces me to play with all new cards from the new adventure pack or else i can't complete the scenario.\n\n\n\nI actually thought about the same thing...on the one hand, being a solo player game I hope for some deep storytelling elements are therefore wouldn't mind if the adventure cycles (not single packs) would focus on one or two themes and encourage decks immersing in these strategies....on the other hand I love the idea of trying to build a deck that can cope with (almost) any kind of adventure deck that is thrown in its way, like e.g. at tournaments (assuming that there will be tournament specific quests)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=452673","commentId":452673,"userName":"Scoob4","timestamp":1302601998,"content":"faith_star83 said:\n\n \n\nI actually thought about the same thing...on the one hand, being a solo player game I hope for some deep storytelling elements are therefore wouldn't mind if the adventure cycles (not single packs) would focus on one or two themes and encourage decks immersing in these strategies....on the other hand I love the idea of trying to build a deck that can cope with (almost) any kind of adventure deck that is thrown in its way, like e.g. at tournaments (assuming that there will be tournament specific quests).\n\n\n\nThis is actually another thing that excites me about the game. I actually see it going both ways! I'm sure that some strategies will emerge that are just solid, take into any scenario strategies, and then I'm sure that some strategies will be better suited for different kinds of quests. To me this means that deckbuilding is going to be as dynamic as possible without actually having a live opponent.\n\nJust think...you have a deck that's been able to handle the last 4 scenarios in the single packs, but in the 5th pack in the adventure cycle it runs into a roadblock, just can't get by. You go to town trying to create a specific deck that can handle that scenario, and once you do you try to figure out the key elements to see if maybe you can incorporate it into your handle-everything deck. This game has me so excited."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=454091","commentId":454091,"userName":"ffgfan","timestamp":1302868456,"content":"I think that mixing Spheres is just a question of time. But in my opinion when we will get the game it will be good to mix them to get a really powerful effects and combos. A deck with more then one Sphere will be better and more universal  to play in a couple of scenarios in a row."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=454143","commentId":454143,"userName":"qwertyuiop","timestamp":1302871965,"content":"I don't see multisphere decks being very plausible for a while. Not without a good stable of neutral cards or effects that alleviate the sphere resource spending restriction.\n\n \n\nOf course this may not be the case, or the issue may be offset for now by playing with 30 card decks instead of 50(if a player has more than one core set)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=454154","commentId":454154,"userName":"Watcher2","timestamp":1302872766,"content":"ffgfan said:\n\nI think that mixing Spheres is just a question of time. But in my opinion when we will get the game it will be good to mix them to get a really powerful effects and combos. A deck with more then one Sphere will be better and more universal  to play in a couple of scenarios in a row.\n\n\n\n \n\nAgreed, and I think this is by design, really. Not that FFG is trying to force people to buy expansions, but the whole concept of a LCG (as I understand it), is that the game evolves and grows with later expansions, opening up new design elements and concepts as it does.\n\nWhat we're speculating at with multi-sphere decks is just the next logical evolution the game will undertake. Probably once we are well into the later half of this first series of Scenario packs.. but that is just my speculation of course.\n\nAnd that's a good thing. By the time single sphere decks seem a little stale, we'll have enough cards to develop all new multi-sphere decks and thus the game will renew itself in terms of ideas and possibilities."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=454206","commentId":454206,"userName":"jhaelen","timestamp":1302877840,"content":"qwertyuiop said:\n\nI don't see multisphere decks being very plausible for a while. Not without a good stable of neutral cards or effects that alleviate the sphere resource spending restriction.\nAfter seeing Radagast I think there's going to be several ways to get around the resource matching restrictions. It doesn't always have to be the heroes that provide the resource tokens.\n\nAnd thanks to solo play, there'll be plenty of opportunity to try all kinds of things using 'exotic' decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45122-allied-spheres/?do=findComment&comment=454232","commentId":454232,"userName":"mkultra","timestamp":1302881399,"content":"jhaelen said:\n\nqwertyuiop said:\n\nI don't see multisphere decks being very plausible for a while. Not without a good stable of neutral cards or effects that alleviate the sphere resource spending restriction.\n\nAfter seeing Radagast I think there's going to be several ways to get around the resource matching restrictions. It doesn't always have to be the heroes that provide the resource tokens.\n\n \n\nAnd thanks to solo play, there'll be plenty of opportunity to try all kinds of things using 'exotic' decks.\n\n\n\nImagine the possibilities...what if there will be a neutral  \"Alliance\" ally, when played provides a resource of maybe Lore and/or Tactics for example. Cards like this not only speed up the game but open up deckbuiling exponentially. Single sphere decks will get boring after a while in my opinion. But being able to efficiently and cheaply build multi-sphere decks, where you can fix shortcomings or enhance strengths of one sphere really adds to the total fun factor. I'd really like to play decks other than a Lore deck or one or two variants of a Tactics deck. If I want that I can continue to play W:I. lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"}]}