{"url":"https://community.fantasyflightgames.com/topic/45297-single-sphere-tournament-deck/","title":"Single Sphere tournament deck. ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45297-single-sphere-tournament-deck/?do=findComment&comment=454246","commentId":454246,"userName":"DrNate","timestamp":1302882787,"content":"I was unloading the truck this morning, and I realized something about the single sphere tournament legal Player deck: it won't be possible to build one. Not without AT LEAST one expansion, anyhow.\n\nWe start with the rules for Player Deck construction, from page 27 of the rulebook: \"A tournament deck must contain a minimum of 50 cards.\nAdditionally, no more than three copies of any card, by title, can be included in a player’s deck.\" Seems easy enough. Lots of card games have a minimum deck size and a maximum number of individual card copies per deck.\n\nBut look at the sphere breakdown from page 10:\n\n\"Leadership (cards 13-27; heroes Aragorn, Glóin, Théodred)\n\"Tactics (cards 28-42; heroes Legolas, Gimli, Thalin)\n\"Spirit (cards 43-57; heroes Éowyn, Dunhere, Eleanor)\n\"Lore (cards 58-72; heroes Glorfindel, Denethor, Beravor)\"\n\nThat's only 15 cards per sphere! A single sphere deck can only have three of each of these cards (plus three Gandalf) for a total of 48 cards! And, you'd need three core sets just to get enough cards to do that!\n\nI suppose you could just wait a month and buy an expansion for some more cards, or just throw in two off-sphere cards and hope you never draw them. Still, I feel kind of sad that you have to jump through hoops like that just to make a deck focused one one sphere tournament legal.\n\nWhat do you think? Am I missing anything here?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45297-single-sphere-tournament-deck/?do=findComment&comment=454292","commentId":454292,"userName":"qwertyuiop","timestamp":1302887156,"content":"i'm still trying to wrap my head around the idea of enjoyable tournament play.  Either you play with someone..against them and the game degenerates into timing the perfect way to backstab your opponent, survive the scenario, and have a better score,  or  you play with someone trying to get the best score as a team, thus creating a need for more tournament staff to observe games. The one option seems to be completely against the spirit of the game, not to mention tedious, and the other doesn't seem feasible... unless cheating can be eliminated some other way.\n\nYour observation is pretty hilarious. I don't remember, but I guess the heroes themselves don't count towards the 50 card limit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45297-single-sphere-tournament-deck/?do=findComment&comment=454295","commentId":454295,"userName":"Watcher2","timestamp":1302887690,"content":"No, I don't think you're missing anything DrNate.\n\n \n\nHere is a quoted passage from the rules PDF. The very definition of the Player Deck. Boldfacing is mine.\n\n \n\nThe player deck includes a combination of ally, attachment, and event cards shuffled into a deck from which a player draws his cards throughout the game. No more than three copies of any ally, attachment, or event card, by title, can be included in a player’s deck. Each of the four 30-card starter decks in this core set can be played out of the box as an introduction to the game. For advanced play, the cards in these starter decks can be combined with one another, or further developed with cards from Adventure Pack expansions, to create 50-card tournament decks. (For more on the art of customizing a player deck, see “Tournament Deckbuilding and Customization,” page 27.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45297-single-sphere-tournament-deck/?do=findComment&comment=454477","commentId":454477,"userName":"mkultra","timestamp":1302947249,"content":"We haven't seen all the cards yet. Maybe there will be neutral allies (ala Gandalf) or neutral items/events to fill out your deck. I hope single sphere decks are a rarity. Except for thematic reasons, why would you want to limit your possibilities and deckbuilding choices?  You are not playing against player 2, you are trying to win against the encounter deck. If the designers did their homework, then each sphere should have it's own strengths and weaknesses. The fun part is finding cards from other spheres that compliment and solidify your build. I imagine solo play by necessity will require multisphere decks. This approach is not for everybody. It is only how I will approach this game (my first co-op game btw)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45297-single-sphere-tournament-deck/?do=findComment&comment=454518","commentId":454518,"userName":"qwertyuiop","timestamp":1302953318,"content":"mkultra said:\n\nWe haven't seen all the cards yet. Maybe there will be neutral allies (ala Gandalf) or neutral items/events to fill out your deck. I hope single sphere decks are a rarity. Except for thematic reasons, why would you want to limit your possibilities and deckbuilding choices?  You are not playing against player 2, you are trying to win against the encounter deck. If the designers did their homework, then each sphere should have it's own strengths and weaknesses. The fun part is finding cards from other spheres that compliment and solidify your build. I imagine solo play by necessity will require multisphere decks. This approach is not for everybody. It is only how I will approach this game (my first co-op game btw).\n\n\n\n \n\nGotta walk before you can run. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45297-single-sphere-tournament-deck/?do=findComment&comment=455372","commentId":455372,"userName":"jhaelen","timestamp":1303139194,"content":"DrNate said:\n\nWhat do you think? Am I missing anything here?\n\n\n\nI think you're missing that no official tournaments are planned using just the cards from the core set gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nInofficially, you can do whatever you want. Just have a tournament using decks with a minimum of 30 cards."}]}