{"url":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/","title":"Initial Impresions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454484","commentId":454484,"userName":"Sky","timestamp":1302949008,"content":"Hi.\n\nFor all You Guys first batch of information.\n\nThe Game has:\n\n2xstring bag with cards. The art is top notch. So is fragility. I mean before You go out of the ship buy yourself 5 bags of sleeves.\n\n2xsheets of cardboard with all threat meters, and everything You need to punch out.\n\n1xinstruction. If You bought Game of Thrones LCG nothing woudl ever surprise You\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454496","commentId":454496,"userName":"mkultra","timestamp":1302949957,"content":"Hello Sky, how about a card list with the # of times the card appears in the core."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454509","commentId":454509,"userName":"Sky","timestamp":1302951729,"content":"Leadership\n\nAlies\n\nCitadel Guard x 3\n\nFaramir x 2 U\n\nSon of Arnor x 2\n\nSnow Creek Scout x 3\n\nArcher from Silver Vein x 2\n\nLong Beard Orc Killer x 2\n\nBrog Iron Fist x 1 U\n\nEvents\n\nAlways Watchful x 2\n\nCommon Target x 2\n\nFor Gondor! x 2\n\nSneak Attack x 2\n\nNoble Sacrifice x 2\n\nGrim Determination x 1\n\nAttachments\n\nSteward of Gondor x 2\n\nCelebrian's Stone x 1 U\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454512","commentId":454512,"userName":"Sky","timestamp":1302952460,"content":"Tactics\n\nAllies\n\nVeteran Axeman x 3\n\nGondor Spearman x 3\n\nHorse Archer x 2\n\nBeorn x 1 U\n\nEvents\n\nSwordplay Mastery x 3\n\nRain of Arrows x 2\n\nFeint x 2\n\nQuick Strike x 2\n\nValley of Spears x 2\n\nBroad Hit x 1\n\nUnited x 1\n\nAttachments\n\nBlade from Gondolin x 2\n\nCitadek Plate x 2\n\nDwarven Axe x 2\n\nHorn of Gondor x 1 U"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454516","commentId":454516,"userName":"Sky","timestamp":1302953130,"content":"Spirit\n\nAllies\n\nWandering Took x 2\n\nLorien Guide x 3\n\nScout from the North x 2\n\nEvents\n\nGaladrihms Bless x 2\n\nStrnght of Will x 2\n\nHurried Strike x 2\n\nWill of the West x 2\n\nTest of Will x 2\n\nFace the Enemy x 3\n\nLight in the Darkness x 2\n\nLuck or Fate x 1\n\nDwarven Tomb x 1\n\nAttachments\n\nBlessings of the Lady x 2\n\nPower of the Earth x 2\n\nUnexpected Bravery x 1\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454523","commentId":454523,"userName":"Sky","timestamp":1302954162,"content":"Lore\n\nAllies\n\nDaughter of the Nimrodel x 3\n\nErebor Smith x 2\n\nHenamarth The River Song x 1 U\n\nMiner from the Iron Hills x 2\n\nGleowin x 2 U\n\nEvents\n\nImladris' Knowledge x 3\n\nWealth of Lorien x 2\n\nFlair of Radaggast x 2\n\nSecret Path x 2\n\nGandalf's Searches x 2\n\nHospitality of Beorn x 1\n\nForest Snare x 2\n\nAttachments\n\nGuardian of Lorien x 2\n\nDark Knowledge x1\n\nInstinct of Self Preservation x 2\n\n \n\nNeutral\n\nGandalf x 4\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454528","commentId":454528,"userName":"qwertyuiop","timestamp":1302955585,"content":" Thanks for the information! gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]  It seems that buying two copies instead of three will work out well for me!.... for now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454540","commentId":454540,"userName":"Sky","timestamp":1302956819,"content":"That is what i think also. But... for now i will stay with 1 copy of Core Set. On the first sight i found only 2 or 3 cards i would like to multiply in quantity.\n\nNow a pinch of salt.\n\nI just finished putting all cards into sleeves now - and the box sreams for organization!!!!! This two stringbags just will not do the justice to the game (you can storage tokens in them) , In my opinion u need:\n\n1 space for heroes\n\n4 spaces for spheres\n\n1 space for quest cards\n\nabout 6 spaces for different types of cards in the encounter deck i got the box shut so i am not sure (three quests specific) 3 generic types (spiders, beasts, orcs).\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454553","commentId":454553,"userName":"Sky","timestamp":1302959007,"content":"About the encounter deck I shall write nothing :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]. It would be like summarise the movie You are just going to. To tell You the truth I tried not to look to closely at those cards too. Tomorrow I will have the first game and would like it to be so surprising as it could be :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI had one question though. In the cardboard there was a bit named Proof of purchase - what is it used for?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454575","commentId":454575,"userName":"DrNate","timestamp":1302965415,"content":"Thank you so much for the information on the Player cards! I am so ready for this game, it is making me wild! I'll have to go do some math to occupy my time until I can go find it somewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454582","commentId":454582,"userName":"mkultra","timestamp":1302967839,"content":"WOW, Thanks for the infoaplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454587","commentId":454587,"userName":"Eryx_UK","timestamp":1302968621,"content":"Thanks for posting the list. I was pondering whether I would need 2 starters or not, and now I know I can make do with just one. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454589","commentId":454589,"userName":"Toqtamish","timestamp":1302969138,"content":"wow Beorn is in the starter. That's a nice surprise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454604","commentId":454604,"userName":"Sky","timestamp":1302972186,"content":"I could not bear waiting. I had to move through Mirkwood.\nOld way was ahead of me, and I heard sounds that made my hair bristle. Only great spiders moved that way. The three of us were not afraid. Lore was our Shield.\nThe adventure did not start rosy. We proudly entered into the dark forest sure that moss covered path would let us silently move through. We were aware that from this side of Mirkwood only an old forest way was quick enough. Though we noticed spider lurking among the trees we did not hesitate. We were silent, focused and brave, and the fact that accidentally met Blacksmith wanted to travel with us only make us feel better. Once we passed first trees we saw that our plan was not foolproof. Just after few steps we saw the Forrest Gate and we felt that something was wrong there. The fear started to emerge from our thoughts and only the fact, that we found the secret path allowed us to stay calm. Not for long... The spider we thought was left behind, jumped among us in the least expected moment. Denethor was brave enough to take first blow. We hoped that his legendary skills will protect him.\nThe spider behaved predictable, and Belavora scored her first hit. They say that spider's blood is not red, and they are right. Black drops sprinkled from the wounded beast. It became reckless and he was nearly immediately hit by the Blacksmith.\nThe beast was screeching and we felt the building of threat around us. Who would be the first - we ore other beasts that were being summoned by the wounded arachnid. We knew it was now or never. Denethor blocked the incoming blow, and the Balcksmith impaled wounded spider with his spear.\nWe had to choose: advance now or retreat. Our lack of experience chose instead of us.\nOnce we gathered to walk through the gate, we saw like the Spawn of Ungolianth emerges of its Shadow. It was quick and ferocious. One second it was away, the next we saw as it cut Denethor twice with its pincers. Hadn't we have forrest snare with us, we would all be killed the next few seconds. Once the beast was entangled we managed to hit it a few times. We had to escape but we did not know where to go. And the more we looked around we were more confused.\nShall we go through an Enchanted Creek or shall we use the Necromancers Pass? The evil will of the denizen of the latter place we felt the very next moment when the Necromancer reached us and killed Daughter of the Nimrodel. We could only stare as he sucked all life out of her slender body.\nWe whacked th weakening spawn till its death only to be confronted by Chieftain Uthak. The moment he enter the Gate, he swung his sword through the legs of Beravora. The scream made us drop everything we got to cover our ears. Her pain was unbearable. It was the first moment we saw the end coming. But if we have to die we would do it on our terms. The knowledge Imladris gave us let us heal the wounds of Beravora so she could fight for the last time. We even wounded Uthak twice, but then we saw that we were surrounded by countless enemies. It was the end.\n \n\nLotr LCG - Sky\n\n1:0\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454611","commentId":454611,"userName":"Sky","timestamp":1302974057,"content":"So after the pulse has slowed down a little I can post what it was like.\nHard. That is the first thing that comes to my mind. I purposefully chose one of the spheres. Should I mix two of them I shall first try each of them individually. The Lore deck is good at card management a lot of cards allows You to draw or make someone draw. It is surely good at other things, but my mediocre skill did not allow to use them.\nI played conservatively. Tried to be prepared for everything. It is not a case here. Now I know I should risk some free hits from the Enemies drawn in the first rounds just to make sure to kill them in the same turn. You can ask why it does matter so much? Because each round the game ads 1 card to the staging area. I did not pay attention to long term effects of it and allowed first fights to take two turns instead of one. And threat from locations that was building in the staging area became falling avalanche – one round I seem to have everything under control, the next it was successful struggle, and on round 3 i add up 5 threat after Quest phase. Two such rounds and I was done.\nI noticed it too late. I got 5 locations in the staging area of the threat level of 8. I had to commit all my heroes, and half of allies to commit to quest, and at the same moment Uthak was bashing my head with his Warhammer.\nTomorrow I will make second attempt with the Lore deck. One shall learn by his mistakes :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454612","commentId":454612,"userName":"DrNate","timestamp":1302974272,"content":"Be strong, friend Sky. The shadow may have won today, but it will never prevail. The wisdom you've gained will serve you well in the days ahead.\n\nI can't wait to have my own cards so I can post reports like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454614","commentId":454614,"userName":"Jerry Rigg","timestamp":1302974316,"content":" Faramir is an ally? Lame sauce. Well, here is more hope from me that they'll have hero and ally versions of the same characters - although I doubt it. :/"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454659","commentId":454659,"userName":"servant of the secret fire","timestamp":1302984540,"content":"I have only one question sky.Is this game as good as we wanted to be or..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454710","commentId":454710,"userName":"ffgfan","timestamp":1303002894,"content":"Thanks Sky for all the info. I just have one more question do You have the English or German version of the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454720","commentId":454720,"userName":"Sky","timestamp":1303005267,"content":"I think this game has great potential. But rmemeber my opinion is based on the following facts.\n\nI've been through 1/2 of the encounter deck (incluing shadows cards) of one quest, i have been through 1/2 of my sphere deck.\n\nSo I have seen in action about 1/8 cards of CS.\n\nWhat I am afraid whether this game will become \"feasible\" as 1-man experience. I will seldom find someone who would like to play it with me. In a multiplayer game each player can concentrrate on some aspects of the gameplay. If You are mediocre at some areas is not so crucial if You can assign Your assets properly. Playing it alone forces You to find combination of 3 heroes that stands out multiple areas so much that You can make some mistakes and still win the game.\n\nI will make another attempt in few hours. I shall tell You if I learnt anything on my mistakes, Yet I wander why, when I look ijn the mirror I see one mindless Orc. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI have Polish version of the game and it is called Wladca Pierscieni here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454743","commentId":454743,"userName":"Catra.TB","timestamp":1303014792,"content":"Oh man... come on ! When will I have my copy ? :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] I cant bear it ! The one ring is too heavy for me !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454745","commentId":454745,"userName":"weaponxmerc","timestamp":1303015084,"content":"As far as single player gameplay goes, if only having one set of heroes isn't strong enough, you could always use two different decks but control both. Not saying it's ideal, but if you want to try different sphere combinations or see how different decks can work together, it might be helpful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454752","commentId":454752,"userName":"Sky","timestamp":1303019759,"content":"This Time it was not about Honor. It was about revenge. As soon as the first spider emerged from the shadow I allowed it to hurt Glorfindel a little just to align it with a great oak. And then we impaled it and watched as life slips from the eight alien eyes. The Uthak started to hunt us again but Radaghast Wit allowed us to fool it just for this time. It gave us enough time to get sure that the old road we were traveling was completely safe. Were we not afraid of threat which seemed to lurk in the near Pass we could advance much further.\nOn the pass Uthak caught up with us and we started dealing blows. Soon we managed to reach beyond the pass but one after one two Beast Tamers blocked our way. We were able to almost kill one of them, when again it was time when red, watchful eyes surrounded us. In the grave silence last sound we heard was a faint creak of many bowstrings.\nI shall give encounter deck to my son to shuffle – one cannot prevail alone facing three of most dangerous creatures in a row.\nLotR – Sky\n2-0\nNothing big so far. Our national soccer team many times lost in a worse matter. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n \n\nAs I stated befere why should I mix spheres when I do not know how each sphere works (so far). I start to understand mechanics of the game - it starts to feel smooth. After two - three attempts i will try to move to other sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454802","commentId":454802,"userName":"servant of the secret fire","timestamp":1303031167,"content":"Maybe solo play with just the starter decks is not possible.Maybe  the game forces you to make a deck of 50 cards minimum to win a solo scenario.For example it will be more easy if you have 3xsneak attack and 3xGandalf than only 1 Gandalf and 2x sneak attack.\n\nBut i think is  good that this game is hard.That means that you must waste time to win all 3 scenarios and think so many different ways to overcome the shadow or my cusre works and you will never finish a scenario unless i take my copy of the game lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454818","commentId":454818,"userName":"Saintsman","timestamp":1303035381,"content":"Any hope we can get spoilers on some of the ally cards?  I'm really interested in Faramir and Beorn!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454838","commentId":454838,"userName":"echtalion","timestamp":1303038497,"content":"I definitely agree on the view that it's best that the game is hard.\n\nI never enjoy playing against a dumb opponent, but quite the contrary. The more you are forced to think of strategies, the tenser the game, and the most satisfaction once you beat a given scenario.\n\nI can't wait for this! I ordered my first on Amazon.uk (~£20), but knowing how they handle new releases, I have also ordered another copy from iguk (~£29). happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454940","commentId":454940,"userName":"Sky","timestamp":1303057771,"content":"I am pretty sure my translation back into English will not be 100% fair, so do not scald me for any mistakes :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nFaramir\n\n4C 2-1-2 3HP\n\nGondor. Noble?. Watcher?\n\nAction: Exhaust Faramir to choose player, Until the end of the Phase Each character contolled by this player gets  +1 Will.\n\nBeorn\n\n6C 1-3-3 6HP\n\nBeorning. Warior.\n\nAction: Untill the end of the Phase Beorn gets +5 Str. At the end of the phase, You activated the effect, shuffle it into Your deck (only once per Round).\n\n \n\nNow about Allies\n\nLore Deck \n\nDaughter of the Nimrodel\n\n \n\n3C 1-0-0 1HP\n\n \n\n \n\n \n\nWoodelf.\n\nAction: Exhaust DotN to cure up to 2 HP of any Hero.\n\nErebor Smith\n\n \n\n \n\n \n\n2C 1-1-1\n\n \n\nDwarf. Craftsman?.\n\nResponse: When U play ES, move the top Attachement from the discard pile of any player to the deck of that player.\n\n Henamarth The River Song\n\n \n\n \n\n1C 1-1-0 1HP\n\nWoodelf.\n\nAction: Exhaust HtRS to see the top card from Encounter Deck\n\nMiner from the Iron Hills\n\n \n\n \n\n 2C 0-1-1 2HP\n\nDwarf.\n\nAnswer: When MftIH enters play choose and discard 1 Condition Attachment\n\nGleowin\n\n \n\n2C 1-0-0 2HP\n\nMinstrel. Rohan.\n\nAction: Exhaust Gleowin to choose Player. This player draws 1 card.\n\n \n\n Gandalf\n\n5P 4-4-4 4HP\n\nIstari.\n\nAt the end of the round discard Gandalf from play.\n\nAnswer: When Gandalf enters play choose 1: draw 3 cards, deal 4 wounds to one enemy in play or lower your threat level by 5.\n\n \n\nNow some update on my brain wrestling. I had not been able to play through my whole 3rd game but this time I made myself sure to shuffle all cards as good as possible,\n\nI was able to kill staff now, and to get rid of one or 2 locations. Once Gandalf hit the playing area i lowered my threat lvl by 5 and went back under 40. Should not my chores interupt me i would try to see if i could reach stage 2 or maybe three of the quest. My insights into Lore deck as a standalone solution are still grim.\n\nThis deck cannot  mange threat in any way (apart from Gandalf - from now on i shall treat 3xG as a must in this deck) and its ability to get cards back from the discard pile is very limited. Apart from that it lacks Allies comparable to Faramir or Beorn (You had the nose to ask for them - as u can see Beorn is one of the cards U may think is not necessary to have 3 copies - apart of the situation when U want him as soon as possible). So the whole fight depends on heroes. U can decide that You will not defend with them but then cards like Uthak will force U to sacrifice Hero (not to good idea as in th CS there is no way to get him back) or Ally. So Beravora and Glorfindel have total str of 5 and it is Your main hit force. When U commit them to the quest, You cannot strike back. I wander how much can U squeese of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=454958","commentId":454958,"userName":"Infyra","timestamp":1303060738,"content":"Some of the early reports from demo sessions said that the players felt as if there were too many locations in the deck. Seeing you can only travel to one of them every turn, and the fact that in multiplayer games you might get more then one per round, leading to inescapable growing threat in the staging area.\n\nDo you have the same experience with your solo effort so far?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455089","commentId":455089,"userName":"Sky","timestamp":1303094377,"content":"That can be a serious problem. Though You just have to know the game to develope some skills. In my first game i was overcurious. Ah location, phew no problem -> active location, ah second location -> we will cope with it soon, ah 3rd location -> why do i have to get 5 additional threat....\n\nOn the other hand You just do want it to be hard. I am sure I will remember very well the first game I will matke through the I Quest :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nSoon we will see real geeks dig into everything (even flavor text :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ). I just hope they will not find anything game breaking.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455104","commentId":455104,"userName":"playernumberone_2","timestamp":1303099358,"content":"Infyra said:\n\nSome of the early reports from demo sessions said that the players felt as if there were too many locations in the deck. Seeing you can only travel to one of them every turn, and the fact that in multiplayer games you might get more then one per round, leading to inescapable growing threat in the staging area.\n\nDo you have the same experience with your solo effort so far?\n\n\n\nThere is a problem with the wilderness deck. Two types of the locations included (Brown Lands and East Bay - or something like that, these are literal translations) are a somewhat broken combo. Brown Lands have a threat strength of 5 but once you travel there, it is automatically explored. East Bay on the other hand has a moderate threat strength but very high quest points (6). Moreover it forces the player to travel there if this card is in the staging area. If those cards hit the table in combination, with another Brown Lands card added in a round or two later, the game is lost (at least with the standard decks).\n\nExcept for this, I don't consider the frequency of locations turning up a problem of the game. It's rather a central aspect. The spirit sphere deals with locations while the tactics spehre deals with enemies. Here's a distribution of cards in the respective decks:\n\nSet - Enemy - Location - Treachery - Objective - Total\n\nWilderness - 8 - 4 - 2 - 0 - 14\n\nOrcs             - 7 - 4 - 3 - 0 - 14\n\nDol Guldur  - 5 - 4 - 3 - 3 - 15\n\nSpiders        - 4 - 5 - 3 - 0 - 12\n\nMirkwood     - 6 - 4 - 0 - 0 - 10\n\nAnduin          - 3 - 5 - 1 - 0 - 9\n\nLidless Eye - 3 - 0 - 7 - 0 - 10"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455110","commentId":455110,"userName":"Sky","timestamp":1303100757,"content":"But maybe it should be that way. If my undeveloped 1 man army encounters Uthak, and on the two following 2 turns two Tamers (16HP total) I should loose. There is beauty in it. Encounter deck threatens You. How high should be the danger it creates to justify the words \"Danger\" and \"Threat\". Should You be able to cope with everything it throws at You in any sequence, would it be a threat? If some Enemy has the ability to get 2 shadow cards on himself, shoudn't he be dreadfull to You. How can one accomplish it without posing a risk of failure of the Party with one unlucky shadow effect - i got one time: Your threat  rises by 4 - i started to cry :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png], and than i did phew as i defended this attack, and the rest of shadow deck was: or by 8 if this attack is undefended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455234","commentId":455234,"userName":"Bohemond2","timestamp":1303122547,"content":"So, for each scenario, you are looking at the following card totals.\n\nPassage Through Mirkwood 36 cards(17 enemies,13 locations, 6 Treachery)\n\nJourney Down the Anduin 47 cards (21 enemies, 13 locations, 13 Treachery)\n\nEscape from Dol Guldur 39 Cards (16 enemies, 13 locations, 9 treachery, 3 objectives)\n\nThe odds of you getting two or three specific cards in sequence for a 47 card deck are not high.  That being said, you do want to clear locations ASAP.  Make friends with someone who likes to play Spirit.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455242","commentId":455242,"userName":"9thimmortal","timestamp":1303123547,"content":"Yeah, I think Eowyn is probably required in solo-play.  That 4 quest (can be 5-6) is killer all by herself. \n\nGandalf is seeming more and more required as well.  Hmmm..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455279","commentId":455279,"userName":"MarioelKamui","timestamp":1303127757,"content":"Thanks sky for the info....i cannot wait to get my copy....patience"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455335","commentId":455335,"userName":"Sky","timestamp":1303134177,"content":"MarioelKamui said:\n\nThanks sky for the info....i cannot wait to get my copy....patience\n\n\n\nYou are welcome.\n\nThe more time I spend with the game the more I like it . Forth attempt was quick and full of blows coming and going both ways. No, this time I did not succeed either. Yet I managed to look into the eyes of the Spawn of Ungolianth. She would be mine, did not Uthak, yes again the villain that from now on will stalk me in my dreams, enter the very second i chose the path in the third part of the quest. On this fight shadow was not on my side. Neither could second Gandalf help me. Yet dying in the final fight of the game has had its own merits. \n\nThis game is not for cheaters. U play it alone, and if You do stray from the rules, noone will notice it. And it was so tempting. I could win it - all i needed to do was to tamper with 2 shadow effects, which killed one of my heroes, and then did not allow me to counterstrike.\n\nI like the fact, that in my 4th game each round takes 1-2 minutes. Apart from brainbashing moments in the quest phase and the shadow phase. Apart from that moments the game is like physics - You know what U do and why You do. And then the storm comes - the Quest moment is nicer of the two (if You do not draw Uthak :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )  You take some risk into account, you know there will be some lithning. And then in the Shadow phase it is like standing in the night in the wood when suddenly You hear the DANGER behind You. You turn once - nothing, You turn the second time - nothing, and than You know U have to turn round just one more time, and You hear scream of beast already in midair jumping at You. \n\nNow i will switch my way of playing it. Spirit time :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455367","commentId":455367,"userName":"Bohemond2","timestamp":1303138339,"content":"You may need some luck playing solo with a mono-spirit deck.  You should be able to quest well, but does spirit have any way to deal with enemies?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455399","commentId":455399,"userName":"jhaelen","timestamp":1303142265,"content":"I already suspected it would be very difficult (and probably require quite a bit of luck as well) to win a solo game using only a single mono-sphere deck.\n\nIt makes sense to me to use the pre-built decks for your first couple of games, though. You have to get a feeling for what the spheres are all about first, before you can build a deck that has exactly what you're going to need.\n\nThanks for the playtest reports and info - it makes for an exciting read. I can't wait till my copy arrives happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455406","commentId":455406,"userName":"Bohemond2","timestamp":1303142797,"content":"I want to offer my thanks as well.  Sky has me even more exited for this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455421","commentId":455421,"userName":"Sky","timestamp":1303143831,"content":"Yay! That was a Night to Remember.\n\nSpirit deck is completely a different story. So far it seems more balanced with each Hero well prepared for their part - Eowin Quests, Dunhern fights, and Eleanora takes some defensive position.\n\nIt did not start to well. First two spiders, hit, and hit hard, from the second round two of my Heroes were at 1HP. Then I had to throw away 2 cards (including Gandalf :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]( ). From that on the synergies between cards started to seamlessly function. I was able to throw back enemies from engagement so Dunhern hit them with +1 Str,. as i attached to him Unexpected Bravery he did it twice a round.\n\nI darted through first two stages and the 3rd one was the one with 10 Quest Point, I continued fight with spider, and I choose who??? Yes Chieftain Ufthak. Should I fight him, i coud not scratch him a bit. But than the justice woke up at last and I was able to serch my discard pile for Gandalf. I put everyone for Quest (had about 13 points of Will against Ufthak and new Treachery). Of course I did not forget to apply Entrance 4 damage which Gandalf provides to this bloody bastard. And the TA DA!!!! Quest was won.\n\nThe spirit deck lacks healing ability. I sucked some damage like i did in the Lore deck and then some longsome thought came through my mind - Sebastian ... did you notice any healing ability when you looked at the cards in the deck? No? So how You are going to heal them now? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIf I had the chance to play this game with a Lore player I think we woudl find some fields of synergy :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\nLet the ring be with You in Your pocket :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455444","commentId":455444,"userName":"alessandro5","timestamp":1303146927,"content":"Thanks for reports, Sky!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455477","commentId":455477,"userName":"Narsil0420","timestamp":1303152400,"content":"Could we get some pics? (here or on Board Game Geek)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455569","commentId":455569,"userName":"jhaelen","timestamp":1303179577,"content":"Sky said:\n\nAnd the TA DA!!!! Quest was won.\nCongratulations! aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455768","commentId":455768,"userName":"DrNate","timestamp":1303207515,"content":"Good job, Sky. I like your reports. And I have learned a lot from them.\n\nMost of all I have learned that playing a single sphere deck early on is less about winning and more about the path of knowledge. I won't be frusterated if I cannot win when using a single sphere deck in solo play, it's all about getting a feel for what the sphere provides in relation to my personal needs/wants/play style.\n\nCan't wait."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=455771","commentId":455771,"userName":"Eryx_UK","timestamp":1303207743,"content":"My copy arrived today and can't wait to get home and give it a try. Have a friend coming over so I'll get to try both solo and double play.\n\nSo excited. babeo.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/babeo.gif] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456005","commentId":456005,"userName":"Sky","timestamp":1303231921,"content":"Gandalf? Gandalf! Gandalf…He was gone. The sounds of galloping horse was quickly fading. Though he left us we were more or less the shape in which we entered this damned forest.\nWhat was more important than our message for Lady Galadriel we could never know. What we knew was that at the bank of the Anduin we did left small raft and we hoped to use it soon.\n“Why don’t we use shortcut to the river? One day through the Gladden Fields and we can bath in the warm current of Andiun” Eowina said in her impatient manner.\nEleanora would find this proposal charming, was it not the middle of April. And the winter has been harsh this year…\n“Ladies first.” Said plainly Dunhern and turned his horse south – east.\nThe Gladden Fields were named after trolls. One said they gladden when they stab You. If You are reckless enough to run through shallow valleys and mild slopes of their homeland, the last thing one’ll see is their calm face turns cheery when they club their victim for the last time...\nOnce they dived in those shallow gorges they heard the sound of incoming Troll. For now they were safe but they knew once he would find them he will send them to Illuvatar. Two Lorien Guides showed them the way through the thicket.\nThey were pushing through the obstacles so hard they did not see the EYE, lidless EYE focusing on them. Was it not for Eleanora who in the very last second with all her strength moved them from the road they would be all harmed. But the EYE did not leave them and found them all one by one. All wriggled in excruciating pain…\nAnd then they were on spiral of doom. First Allies then Eowin. I managed to resurrect her but only to see like I draw the third EYE. If it was not enough I got Necromancer’s Pass on the very next round, and then Beast Timer. I lost control of threat which lead to failing engagement checks, and suddenly everything was on me. I lost Eleonora, avenged her with Gandalf, but it was already fighting a loosing battle. Next round I was engaged with Troll and Tamer and I got only Eowina.\n\n \n\nCould I play better? (I hate this question already) Of course. Once again I have to get used to each of the card abilities. I had a few moments I could avoid harmful effects but I did not cause I did not notice some of the abilities. Had I had a bad draw – I do not know. This game is about negotiating obstacles. And lets assume this obstacle was just a tiny little to high. I Hope to beat this quest next time.\nThe main thing on my mind is how to kill Troll which has 9HP and 3DEF. Jabbing him with Gandalf in the staging area? Pointless – only 1 damage will be done this way. Dunhern with 3ATT in the staging area does not hit him at all. And when he engages You all excess damage goes directly into Threat….- that’s why I have lost threat control. And I could not heal. Resources were not a problem, but I needed more Allies and drew mainly Events...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456022","commentId":456022,"userName":"Narsil0420","timestamp":1303233288,"content":"I don't think you're using Gandalf right. When he comes into play, I think he should deal 4 direct damage to an enemy without any reduction from defense value. So, you could get 4 damage on the hill troll if he was in the staging area (or engaged with you for that matter)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456032","commentId":456032,"userName":"9thimmortal","timestamp":1303234122,"content":"Narsil0420 said:\n\nI don't think you're using Gandalf right. When he comes into play, I think he should deal 4 direct damage to an enemy without any reduction from defense value. So, you could get 4 damage on the hill troll if he was in the staging area (or engaged with you for that matter).\n\n\n\nVery true.  Defense does not stop direct damage.  Not that four damage would kill the Troll. \n\nAlso, YOU can engage the Troll (and put multiple characters on him, correct).  There are some other direct damage it looks like (some bowman, and something that does 2 damage when engaged?).\n\nLastly, you can put sacrifical lambs in front of the Troll and keep on questing away! lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456038","commentId":456038,"userName":"bonzo4","timestamp":1303234769,"content":"My first impression: I love this game, especially the Leadership Sphere, Aragorn and Theodred are an awesome combination, I've combined the Sphere with all other Spheres now and didn't have too many difficulties finishing the first scenario. Think I'm gonna try the second one tomorrow :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nStill I have some questions, maybe someone could help me clarify:\n\n1. What's the advantage of confronting enemies while they are already in the staging area? I still don't see no difference, except your threat level isn't high enough to make them attack the next round... If you attack an enemy in the staging area, still the enemy strikes first, doesn't it?\n\n2. Can heroes also be declared as defenders?\n\n3. Can I combine Gandalf with \"Sneak attack?\" So bring him into game, let him do his damage and then take him back onto my hand? Or do I have to discard him after the phase then?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456045","commentId":456045,"userName":"Apophenia","timestamp":1303235227,"content":"Bonzo said:\n\n1. What's the advantage of confronting enemies while they are already in the staging area? I still don't see no difference, except your threat level isn't high enough to make them attack the next round... If you attack an enemy in the staging area, still the enemy strikes first, doesn't it?\n\n\n\nYou are playing a Tactics/Leadership deck and your friend is playing a Lore/Spirit deck but they are the first player for this turn. That means that the Enemy would normally engage the Lore/Spirit deck. Since your deck is better at dealing defending and attacks so you decide to engage the Enemy and save your friend from having to deal with it. \n\nJust an example but it illustrates one of the reasons you might want to engage an enemy. The other reason is to make questing easier but that only matters if your threat is too low to attract them on your own."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456047","commentId":456047,"userName":"Eryx_UK","timestamp":1303235347,"content":"Had a friend round tonight to try out the game. The first story we did as a whitewash. Not a challenge. The Anduin story we tried twice and it killed us both times before we could get off the first part. It mainly came down to too many locations popping up and just how hard we found the hill troll. Did enjoy the game though but **** it's tough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456061","commentId":456061,"userName":"Acererak","timestamp":1303236759,"content":"Bonzo said:\n\n2. Can heroes also be declared as defenders?\n\n\n\n \n\nSure thing\n\n \n\nBonzo said:\n\n3. Can I combine Gandalf with \"Sneak attack?\" So bring him into game, let him do his damage and then take him back onto my hand? Or do I have to discard him after the phase then?\n\n\n\n \n\nYou just brought up one of the most discussed topics so far (check BGG). My opinion is that Gandalf should not be able to use his special ability with Sneak Attack or that would be almost a quest breaker all the time. So if you Sneak attack him just can use him in one Phase (his stats alone are just awesome) and then back to your hand. If you pay the 5 Resources, then use him for one full round but then discard.\n\n \n\nThis is almost sure a topic in the first official FAQ though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456069","commentId":456069,"userName":"servant of the secret fire","timestamp":1303237578,"content":"Sky said:\n\nGandalf? Gandalf! Gandalf…He was gone. The sounds of galloping horse was quickly fading. Though he left us we were more or less the shape in which we entered this damned forest.\nWhat was more important than our message for Lady Galadriel we could never know. What we knew was that at the bank of the Anduin we did left small raft and we hoped to use it soon.\n“Why don’t we use shortcut to the river? One day through the Gladden Fields and we can bath in the warm current of Andiun” Eowina said in her impatient manner.\nEleanora would find this proposal charming, was it not the middle of April. And the winter has been harsh this year…\n“Ladies first.” Said plainly Dunhern and turned his horse south – east.\nThe Gladden Fields were named after trolls. One said they gladden when they stab You. If You are reckless enough to run through shallow valleys and mild slopes of their homeland, the last thing one’ll see is their calm face turns cheery when they club their victim for the last time...\nOnce they dived in those shallow gorges they heard the sound of incoming Troll. For now they were safe but they knew once he would find them he will send them to Illuvatar. Two Lorien Guides showed them the way through the thicket.\nThey were pushing through the obstacles so hard they did not see the EYE, lidless EYE focusing on them. Was it not for Eleanora who in the very last second with all her strength moved them from the road they would be all harmed. But the EYE did not leave them and found them all one by one. All wriggled in excruciating pain…\nAnd then they were on spiral of doom. First Allies then Eowin. I managed to resurrect her but only to see like I draw the third EYE. If it was not enough I got Necromancer’s Pass on the very next round, and then Beast Timer. I lost control of threat which lead to failing engagement checks, and suddenly everything was on me. I lost Eleonora, avenged her with Gandalf, but it was already fighting a loosing battle. Next round I was engaged with Troll and Tamer and I got only Eowina.\n\n \n\nCould I play better? (I hate this question already) Of course. Once again I have to get used to each of the card abilities. I had a few moments I could avoid harmful effects but I did not cause I did not notice some of the abilities. Had I had a bad draw – I do not know. This game is about negotiating obstacles. And lets assume this obstacle was just a tiny little to high. I Hope to beat this quest next time.\nThe main thing on my mind is how to kill Troll which has 9HP and 3DEF. Jabbing him with Gandalf in the staging area? Pointless – only 1 damage will be done this way. Dunhern with 3ATT in the staging area does not hit him at all. And when he engages You all excess damage goes directly into Threat….- that’s why I have lost threat control. And I could not heal. Resources were not a problem, but I needed more Allies and drew mainly Events...\n\n \n\n\n\nI don't have the game yet but for what i have seen so far i think a tactik deck with Beorn,Gandalf and Gimli(i think a nice combo is to let Gimli have some wounds on him) will be a good solution for troll.On the other hand i don't know how god is tactik with the quest fase but i will find out tomorow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456073","commentId":456073,"userName":"Acererak","timestamp":1303237963,"content":"servant of the secret fire said:\n\n \n\n \n\nI don't have the game yet but for what i have seen so far i think a tactik deck with Beorn,Gandalf and Gimli(i think a nice combo is to let Gimli have some wounds on him) will be a good solution for troll.On the other hand i don't know how god is tactik with the quest fase but i will find out tomorow.\n\n \n\n \n\n \n\nJust Gimli himself is a good solution for the Troll. The question remains on how to tackle the beast at the moment when he (or Aragorn) is not around.\n\n \n\nTactics definitely needs some help in the questing area.  Legolas ability is a great asset though.\n\n \n\nGimli + Eowyn combination is working nicely for me so far though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456082","commentId":456082,"userName":"servant of the secret fire","timestamp":1303238620,"content":"Acererak said:\n\n \n\nJust Gimli himself is a good solution for the Troll. The question remains on how to tackle the beast at the moment when he (or Aragorn) is not around.\n\n \n\nTactics definitely needs some help in the questing area.  Legolas ability is a great asset though.\n\n \n\nGimli + Eowyn combination is working nicely for me so far though.\n\n\n\nI plan to make a deck like this(Gimli,Legolas and Eowyn).You use 3 copies of Gandlaf or 2 are enough for this deck ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456085","commentId":456085,"userName":"Acererak","timestamp":1303239173,"content":"servant of the secret fire said:\n\n \n\nI plan to make a deck like this(Gimli,Legolas and Eowyn).You use 3 copies of Gandlaf or 2 are enough for this deck ?\n\n\n\n \n\nSounds like a great team to me. I would probably go for just 2 copies given Gandalf resurce cost and that you don´t have access to Sneak Attack (specially if you are playing with 2 players and one core set, so your pal can have his 2 copies as well). Otherwise it could be a burden more than anything...although you always have Eowyn´s ability to feed (triggers discarding one card, although doing so with Gandalf seems a bit unrespectful to the old wizard), so probably up to you ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456087","commentId":456087,"userName":"servant of the secret fire","timestamp":1303239508,"content":"Acererak said:\n\nservant of the secret fire said:\n\n \n\n \n\nI plan to make a deck like this(Gimli,Legolas and Eowyn).You use 3 copies of Gandlaf or 2 are enough for this deck ?\n\n \n\n \n\n \n\nSounds like a great team to me. I would probably go for just 2 copies given Gandalf resurce cost and that you don´t have access to Sneak Attack (specially if you are playing with 2 players and one core set, so your pal can have his 2 copies as well). Otherwise it could be a burden more than anything...although you always have Eowyn´s ability to feed (triggers discarding one card, although doing so with Gandalf seems a bit unrespectful to the old wizard), so probably up to you ;-)\n\n\n\nAHAHAHA you can understand from my name that i prefer die than discard a Gandalf cardlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif].\n\nOh and i forgot to ask you.You said that Gimli alone can manage the troll.You mean with his dwarven axe right?Or he can do the job without his axe?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456097","commentId":456097,"userName":"Acererak","timestamp":1303240526,"content":"servant of the secret fire said:\n\nOh and i forgot to ask you.You said that Gimli alone can manage the troll.You mean with his dwarven axe right?Or he can do the job without his axe?\n\n\n\n \n\nAnd I can see a few Gandalfs under your avatar as well, hehe. I did use it that way (discard for extra willpower for Eowyn, he was my last card on hand) once since that point meant one stage completed before a nasty Location was going to force me another 6 quest points. I found it a necesary sacrifice the wizard was willing to make for the good of the fellowship. Ended up winning, by the way.\n\n \n\nThe Axe, the Citadel Armor, the Gondorian Blade and a few nice Tactic events for combat surely help (and definitely you will probably have some of them if you go for 2 tactic heroes). But the main point is that Gimli has 2 defense + 5 hit points which means he can stand at least one assault from the Troll himself. And in the next round, put a minimum of 6 attack strength to the combined attack on the beast. With the help of some of those assets and the rest of heroes the Troll should fall without making too much damage to your mission.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456104","commentId":456104,"userName":"servant of the secret fire","timestamp":1303241107,"content":"Thanks for your reply mate.If Gandalf's sucrifice was for the safety of the fellowship i think i can forgive you lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456133","commentId":456133,"userName":"DrNate","timestamp":1303245557,"content":"servant of the secret fire said:\n\nI plan to make a deck like this(Gimli,Legolas and Eowyn).You use 3 copies of Gandlaf or 2 are enough for this deck ?\n\n\n\nYou stole my deck idea before I even ever told anyone that it was my deck idea! I'm using three Gandalf, because I am scared to run with less than three, until I build up my confidence through play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456213","commentId":456213,"userName":"Sky","timestamp":1303266485,"content":":) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]. My question was very specific. Sure thing You can build Your deck to tackle the Troll. But i was wandering how to deal with him without activatoing +4 wounds of Gandalf with the full spirit deck. When I could play Gandalt i had to chose from deal four wounds and get all the mobs engage me or lower the threat. In the second option Gandalf is only normal 4str character - that is why I asked how to kill him. The quest ordered to kill him to advance (i had enough exploration tokoens in round 3) so questing was not a solution. WIth STR6 he can kill any of the spirit deck heroes - regardless - in defence position or not.  \n\nLetrs assume You have all Heroes Ready\n\nThen Troll engages You.\n\nYou play Gandalf > 4 wounds. (5HP left)\n\nYou declare some lamb as defender (lets assume def 1 hp2) -> death and +3 htreat.\n\nYou use Gandalf -> defence overcome and 1 damage done (4HP Left).\n\nYou attack with all the party (3 Heroes) -> deal 4 dam -> Troll is dead.\n\nSo You killed Troll at sacrifice of Gandalf, I good character, and Your threat at the end of fight is +3.\n\nAs You have Gandal and Lamb in Your play area - the minimum round is 3. It means You can have to cope with other foes and locations.\n\nAnd when Troll engages You - >you have to deal with its shadow effect.\n\nShould You exhaust any of this five characters due to some Treachery or other effect then what -> lets assume You were not able to deal last point of damage and Troll is at 1HP.\n\nNext Round You have to have two more ready characters -> One to deal with defence, second to deal last point of damege after Your heroes. -> If you took this possibility into account it pushes the start of this sequence to Round 4 (U need to pay for the two characters)..\n\nBut what with engagements, building threats and such. How to fight (skills, moves.. any ideas) should You not have any Gandalf in Your hand. Do You have any insights into this situation?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456255","commentId":456255,"userName":"fruszu","timestamp":1303273416,"content":"Bonzo said:\n\n \n\n3. Can I combine Gandalf with \"Sneak attack?\" So bring him into game, let him do his damage and then take him back onto my hand? Or do I have to discard him after the phase then?\n\n \n\n \n\nYou can put into play Gandalf with Sneak Atack and then return him to your hand at the end of the phase, but you cannot use his ability then. Why?:\n\nSNEAK ATTACK: Action: Put 1 ally card into play from your hand. At the end of the phase, if that ally is still in play, return it to your hand.\n\nGANDALF: At the end of the round, discard Gandalf from play.\nResponse: After you play Gandalf from your hand, (choose 1): draw three cards, discard one enemy from the staging area, or reduce your threat by 5.\n\nSneak attack obliges you to return the ally to your hand sooner (at the end of the phase) than Gandalf's card text (at the end of the round). So you don't have to discard Gandalf in that case.\n\nBut you cannot deal damage from Gandalf's ability when you put him into play with Sneak Attack. Because Gandalf's text says: After you play Gandalf from your hand.\n\nPlaying and putting into play are two different things, i think (in other card games are: for example in AGoT LCG). The first one means, that you have to play the card with all costs and by the standard rules. Putting into play bypasses normal rules and costs. Page 8 and 25 of the LotR LCG rulebook suggest that there's a difference between playing and putting into play, so i think this rule also applies in LotR.\n\nThen:\n\nYou can put Gandalf into play with Sneak Attack, but you cannot use his ability then (but he can still fight :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456262","commentId":456262,"userName":"Acererak","timestamp":1303275228,"content":"fruszu said:\n\n You can put into play Gandalf with Sneak Atack and then return him to your hand at the end of the phase, but you cannot use his ability then. Why?:\n\nSNEAK ATTACK: Action: Put 1 ally card into play from your hand. At the end of the phase, if that ally is still in play, return it to your hand.\n\nGANDALF: At the end of the round, discard Gandalf from play.\nResponse: After you play Gandalf from your hand, (choose 1): draw three cards, discard one enemy from the staging area, or reduce your threat by 5.\n\nSneak attack obliges you to return the ally to your hand sooner (at the end of the phase) than Gandalf's card text (at the end of the round). So you don't have to discard Gandalf in that case.\n\nBut you cannot deal damage from Gandalf's ability when you put him into play with Sneak Attack. Because Gandalf's text says: After you play Gandalf from your hand.\n\nPlaying and putting into play are two different things, i think (in other card games are: for example in AGoT LCG). The first one means, that you have to play the card with all costs and by the standard rules. Putting into play bypasses normal rules and costs. Page 8 and 25 of the LotR LCG rulebook suggest that there's a difference between playing and putting into play, so i think this rule also applies in LotR.\n\nThen:\n\nYou can put Gandalf into play with Sneak Attack, but you cannot use his ability then (but he can still fight :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )\n\n \n\n\n\n \n\nCompletely agree with your reasoning. I am quite sure that is how Sneak Attack + Gandalf combo should be played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456268","commentId":456268,"userName":"ClydeCloggie","timestamp":1303275871,"content":"Indeed. Would be near game-breaking if you could plonk down a free Gandalf and then have him do all his stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456274","commentId":456274,"userName":"Dam the Man","timestamp":1303277454,"content":"fruszu said:\n\nBecause Gandalf's text says: After you play Gandalf from your hand.\n\n \n\nDoes the final Gandy say that? Spoilers on BGG at least seem to indicate his text now reads: \"After Gandalf enters play...\", which would allows SA + Gandy combo. Going by the below, they changed Gandy's wording:\n\nwww.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/gandalf-core [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/gandalf-core]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456283","commentId":456283,"userName":"fruszu","timestamp":1303280071,"content":"Dam said:\n\nfruszu said:\n\nBecause Gandalf's text says: After you play Gandalf from your hand.\n\n \n\nDoes the final Gandy say that? Spoilers on BGG at least seem to indicate his text now reads: \"After Gandalf enters play...\", which would allows SA + Gandy combo. Going by the below, they changed Gandy's wording:\n\nwww.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/gandalf-core [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/gandalf-core]\n\n\n\nThank you, I didn't know that. I used spoiler from lotrlcg.com and from \"promotional\" (official, i thought) pictures of Gandalf's card. I don't have my copy yet (still waiting for shipping). Sorry then.  If Gandalf's text is like that on cardgamedb, then Gandalf's ability will work after put into play with Sneak Attack.\n\nNow the question to all the lucky people who have english version already: What Gandalf says? :-)\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456285","commentId":456285,"userName":"ClydeCloggie","timestamp":1303280153,"content":"That does change the issue completely. i would now say that you CAN use Gandalf's full abilities with Sneak Attack. interesting...that is incredibly strong, but judging from the initial reports of games being played, the power curve of this game might actually need an extremely strong combo like this. Darn, it's time this game gets delivered to my door..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456289","commentId":456289,"userName":"Acererak","timestamp":1303280787,"content":"fruszu said:\n\nNow the question to all the lucky people who have english version already: What Gandalf says? :-)\n\n\n\n \n\nYes, that change has been made. I still find hard to believe that combo is valid. Will wait for official FAQ then since opinions seem varied."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456313","commentId":456313,"userName":"faith_star83","timestamp":1303283834,"content":"I just finished my first game...and here is my impression:\n\nNice! I quite like the game, although I need some practice, the game seems more complex than I thought.\n\nThe Gandalf combo was already much discussed in advance I just pulled it off. It works pretty well but it didn't feel incredibly overpowered. First of all costs 5 tokens, so you really think twice before putting that guy down for 5, but also it is not so easy to have Gandalf AND Sneak Attack on your hand (true, there is but one copy of Gandalf in the initial play decks, so its almost impossible but still..). He basically kills off one enemy or gives you a huge card advantage.\n\nWhat I was wondering, though is whether it is legitimate to put down Gandalf with the Sneak Attack and THEN play a Valiant Sacrifice?! I did it and that was awesome...\n\nOk, apart from Gandalf I was really disappointed with the cards, like some other users already stated: They are really really thin. The material seems quite sturdy though, but I really consider buying sleeves...I am a bit annoyed by this since I don't like to use sleeves for my board / cardgames...\n\nAlso I will probably start constructing multi-sphere decks really soon...I always seem to have the same cards on my hand...the ones that are 2-3 times in the deck. This makes it kind of boring since some of the cards don't really seem useful at most of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456367","commentId":456367,"userName":"bonzo4","timestamp":1303290988,"content":"Just tried the second scenario and I was defeated in every possible way ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] I tried multiple deck combinations, but after all, I couldn't make any progress in 2B.\n\nAfter having defeated the Hill Troll (with a lot of luck due to good cards in my hand) I had the problem that when I had to draw two cards in every adventure phase I drew 2 location cards in the first two rounds of 2B. So after 2 rounds I had around 10-12 Threat strength just by location cards which I couldn't handle with my heroes so the threat level kept rising and rising.\n\nWell, guess I should practice a little more with the first scenario ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456382","commentId":456382,"userName":"servant of the secret fire","timestamp":1303292068,"content":"DrNate said:\n\nservant of the secret fire said:\n\n \n\nI plan to make a deck like this(Gimli,Legolas and Eowyn).You use 3 copies of Gandlaf or 2 are enough for this deck ?\n\n \n\n \n\nYou stole my deck idea before I even ever told anyone that it was my deck idea! I'm using three Gandalf, because I am scared to run with less than three, until I build up my confidence through play.\n\n\n\nI think this is an obvious combo for someone who just started the game.On paper (i don't know if that works in practise) Eowyn and Legolas is a very strong combo for questing and spirit cards combine with 3 Gandalfs can help you a lot with your threat.Gimli i think is the best hero (correct me if i am wrong) for combat fase and Beorn is a very strong ally even if you don't use his abilities.\n\nFew hours left and i will see this in practisegran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456406","commentId":456406,"userName":"9thimmortal","timestamp":1303293781,"content":"Acererak said:\n\nfruszu said:\n\n \n\nNow the question to all the lucky people who have english version already: What Gandalf says? :-)\n\n \n\nYes, that change has been made. I still find hard to believe that combo is valid. Will wait for official FAQ then since opinions seem varied.\n\n\n\nHe has changed since demos, but whenever you demo'd the game the Sneak/Gandalf combo was highlighted.  So I assume it is valid.  It is a combo, however, and if you have a perfect set up is only a couple of times a game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456411","commentId":456411,"userName":"faith_star83","timestamp":1303294138,"content":"@servant\n\ngreat, let us know what you think of the game! I managed to get hands on the game today gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif] I wish we could meet  for a round of co-op!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456422","commentId":456422,"userName":"servant of the secret fire","timestamp":1303295050,"content":"faith_star83 said:\n\n@servant\n\ngreat, let us know what you think of the game! I managed to get hands on the game today gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif] I wish we could meet  for a round of co-op!\n\n\n\nI am very huppy for you mate.I am glad you found a way and you have the game so soon.Distance is a promblem but never say never in life.Maybe you can have your vocations in Greece this summer and we can kick Sauron's **s together after a great day in the beachlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456423","commentId":456423,"userName":"Acererak","timestamp":1303295159,"content":"rings said:\n\nHe has changed since demos, but whenever you demo'd the game the Sneak/Gandalf combo was highlighted.  So I assume it is valid.  It is a combo, however, and if you have a perfect set up is only a couple of times a game. \n\n \n\n \n\n \n\nHaving 3 Sneak Attacks + 3 Gandalfs in your deck, plus the fact that you could double use each Gandalf card (one with sneak attack, which puts him back in your hand for a ridiculous 1 resource cost, and one paying his usual cost)...well, I see high probabilities of this happening quite a few times during a game.\n\n \n\nExperience will tell though, I guess. Thanks for the info."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456468","commentId":456468,"userName":"Titan","timestamp":1303299043,"content":"What would happen then if you have multiple players running multiple copies of Gandalf and Sneak Attack? Would their constant onslaught break the game? Or would the encounter deck manage to compensate since it plays more cards into the staging areas when there are more players?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456469","commentId":456469,"userName":"Bohemond2","timestamp":1303299142,"content":"Keep in mind, you can't have multiple copies of Gandalf in play at the same time.  That's less of an issue with Sneak Attack, since you bounce your Ally at the end of a phase, but if you are playing a four player game in which everyone has three Gandalfs, it will come up. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456475","commentId":456475,"userName":"Titan","timestamp":1303299615,"content":"That's what I mean. It is likely to come up repeatedly throughout the game and maybe set up a major disadvantage for the encounter deck. I hope the folks at FFG have anticipated this and feel it is not an issue. The way this combo seems to play may lead to eventually everyone maxxing it out on their decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456484","commentId":456484,"userName":"prune","timestamp":1303300494,"content":"Sneak Attack + Gandalf helped me win my first game last night.  I had Gandalf in hand, and then used the Mirkwood Mountains ability to pull Sneak Attack out of the top few cards in my deck.  This was the first I'd read the card text, and it was pretty clear that it was an intended combo.  The game seems hard enough that giving the players access to some strong combos seems perfectly fine!\n\nAbout card sleeves, the first thing that I did was to put the cards into clear sleeves.  I strongly recommend doing the same.  The only problem is, deck protectors are in short supply right now.  I sell the darned things and can't get any new stock right now, probably not for a couple of weeks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456616","commentId":456616,"userName":"DrNate","timestamp":1303313445,"content":"Dang, sorry to hear that you can't get any card sleeves in stock. I hope I have better luck. After all these reports of thin/flimsy cardstock, I am not too eager to play with them without the use of sleeves. And, to be honest, I have never sleeved any card game I have ever played, this will be my first. That's how much this game means to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456666","commentId":456666,"userName":"qwertyuiop","timestamp":1303320159,"content":" I don't understand why the Gandalf/Sneak Attack combo is being questioned.  The final versions of the cards seem pretty clear.  So everyone just build their Spirit decks splashed with Aragorn now.  gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\nAlso, Dwarven Tomb and Stand And Fight.  gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456791","commentId":456791,"userName":"The Spaniard","timestamp":1303337524,"content":" For your information, the cards in LOTR are not thin, they share the stock with all of our LCG's and are the same thickness as all normal cards on the market. For some reason every individual feels different thicknesses on cards, which is why FFG uses a caliper (measures thickness) to ensure proper quality.\n\n\nSo, these cards are of good quality paper and should be as rigid and durable as any card game on the market.\n\ncP\nFFG\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456846","commentId":456846,"userName":"Spirit Juggler","timestamp":1303353279,"content":"I didn't think they were any thinner than Call of Cthulhu cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456864","commentId":456864,"userName":"darkeldar70","timestamp":1303357138,"content":" hi to all 1 question ,to be very competitive i have to buy more copy  of the starter game??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456865","commentId":456865,"userName":"jhaelen","timestamp":1303357320,"content":"spirit said:\n\nI didn't think they were any thinner than Call of Cthulhu cards. \n\n\n\nYup, though they _are_ thinner than e.g. the Arkham Horror cards. Still, they're definitely thick enough. Also, they look absolutely awesome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=456966","commentId":456966,"userName":"sserre","timestamp":1303371556,"content":"Played the first two scenarios yesterday with 4 players....\n\nI think this game can be very cool in the future when there are more cards coming out. At the moment its rather basic.\nIf you play it with 4 players i think you should try the third scenario for balance, first one goes to easy and is i think more for two players.\nIf you play with 50 cards in the future you won't be able to get that fast your good chars on the field as now with 30 cards ofc.\n\nThe scenarios i played were fun, but i was kinda disappointed in the fact when were getting to the final stage of a scenario that we can win it to easily. The leadership deck is insane... i believe aragorn is to powerful atm, and faramir is also insane. Yesterday only the leadership player achieved to get to 24 willpower only alone with his leaderschip deck during the quest phase. (thx to event ready all chars in play + faramir ability).\n\nThe dwarf deck is rather only based on combat nothing more... so no good in soloplay. can never can get enough willpower with those guys..\n\nWat im curious is how FFG will do tournaments... anyone has an idea on that? are players need to build there shadow deck to?\n\n\nWas it not better that the game gets an seperate deck voor shadow deck and encounters, so that when enemys attack the card thats played face down on them always has a shadow effect that triggers, or at least that it improves it because its to much random at the moment. In the first scenario there more locations then shadow cards and creatures... so that i think could be handled differently...\n\nanyway it will still take a while to get an idea how good the game will be. need more cards and more options to build decks. so im curious what FFG will bring out in the future for LOTR.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457078","commentId":457078,"userName":"Toqtamish","timestamp":1303385602,"content":"darkeldar70 said:\n\n hi to all 1 question ,to be very competitive i have to buy more copy  of the starter game??\n\n\n\n \n\nIf you want to play competitively, yes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457180","commentId":457180,"userName":"Titan","timestamp":1303400513,"content":"The Spaniard said:\n\n For your information, the cards in LOTR are not thin, they share the stock with all of our LCG's and are the same thickness as all normal cards on the market. For some reason every individual feels different thicknesses on cards, which is why FFG uses a caliper (measures thickness) to ensure proper quality.\n\n\nSo, these cards are of good quality paper and should be as rigid and durable as any card game on the market.\n\ncP\nFFG\n \n\n\n\n\n \n\nI haven't gotten my core set yet( one more day), but in comparing the Invasion cards with a few others from different games, they do feel as though they are made of a more flexible cardstock. Perhaps that is the reason why they feel thinner?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457208","commentId":457208,"userName":"Basteq","timestamp":1303403237,"content":"I've just pre-ordered my set on Amazon UK but still there is no street date for it.\n\nI cannot wait :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457350","commentId":457350,"userName":"servant of the secret fire","timestamp":1303427056,"content":"Ok my turn.\n\nTwo things counts for me wen i buy a card game.Is it fun?Is it Lord?This game has  both and from my first game i am totaly happy with the game.\n\nNow lets go to my crazy side.After the 3 first games my friend told me that he likes the game a lot but he miss the competition of other card games give you.My answer was instant.Lets try to make it competitive i said and i saw a smile in his face.\n\nWe took our 2 core sets and we chose wich quest we both must complete.After that we took our time and we made our free people decks.We can have the same heroes and allys cause don't forget we play competitive nowlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif].\n\nSo the game goes as you play a solo game but me and my friend we use the shadow deck.How?Wen my friend is  playing as a good guy i draw 4 cards and i choose wich one i want to place in the staging area.I keep the other three cards  in my hand and if he choose to engage a creature i can use any of my three cards i have in my hands as the were the hidden shadow cards.If he is engaged with  2 creatures i choose wich shadow effect must be played to harm his heroes as much as i can.\n\nOk i told you from the begining that this is crazy but it worked well and we had a lot of fun.If you have 2 core sets and you want to do somethink crazy with this game try it its funlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif].\n\nps:sorry ffg for what i have done to your game but after 6 hours of play and many beers i think you can forgive me sonrojado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sonrojado.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457685","commentId":457685,"userName":"wraith428","timestamp":1303479651,"content":"Sky said:\n\nLetrs assume You have all Heroes Ready\n\nThen Troll engages You.\n\nYou play Gandalf > 4 wounds. (5HP left)\n\nYou declare some lamb as defender (lets assume def 1 hp2) -> death and +3 htreat.\n\nYou use Gandalf -> defence overcome and 1 damage done (4HP Left).\n\nYou attack with all the party (3 Heroes) -> deal 4 dam -> Troll is dead.\n\nSo You killed Troll at sacrifice of Gandalf, I good character, and Your threat at the end of fight is +3.\n\n\n\n \n\nNot sure this works the way you describe... but my understanding of the game might be wrong.\n\n \n\nIn the Planning Phase you play Gandalf and deal 4 damage to the troll?\n\nThen in the Encounter Phase you engage the troll\n\nIn the Combat Phase you sacrifice a lamb defender to the troll and take some threat OK\n\nThen you attack any maybe kill the troll, attacking with Gandalf and heroes most likely since Gandalf goes away at the end of the round and you might as well get the most bang for your buck.\n\n \n\nWhat I don't get is the \"You use Gandalf -> defence overcome and 1 damage done (4HP Left).\"  Is this a seperate attack by Gandalf.  Haven't you already used his 4 damage ability when he came into play in the Planning Phase.  I don't believe you can make multiple attacks against the same monster with individual characters making individual attacks... I think they all have to declare their attack on a specific monster at once.\n\n \n\nAm I wrong... game is still new.\n\n \n\nWraith428"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457809","commentId":457809,"userName":"qwertyuiop","timestamp":1303494899,"content":"servant of the secret fire said:\n\nps:sorry ffg for what i have done to your game but after 6 hours of play and many beers i think you can forgive me sonrojado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sonrojado.gif].\n\n\n\nIf I've said it once I've said it a hundred times.... You don't have any beers.javascript:void(0);/*1303512892488*/ [http://www.youtube.com/watch?v=A3b9gOtQoq4&feature=player_embedded]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457821","commentId":457821,"userName":"Titan","timestamp":1303496210,"content":"wraith428 said:\n\n \n\nSky said:\n\n \n\nLetrs assume You have all Heroes Ready\n\nThen Troll engages You.\n\nYou play Gandalf > 4 wounds. (5HP left)\n\nYou declare some lamb as defender (lets assume def 1 hp2) -> death and +3 htreat.\n\nYou use Gandalf -> defence overcome and 1 damage done (4HP Left).\n\nYou attack with all the party (3 Heroes) -> deal 4 dam -> Troll is dead.\n\nSo You killed Troll at sacrifice of Gandalf, I good character, and Your threat at the end of fight is +3.\n\n \n\n \n\n \n\nNot sure this works the way you describe... but my understanding of the game might be wrong.\n\n \n\nIn the Planning Phase you play Gandalf and deal 4 damage to the troll?\n\nThen in the Encounter Phase you engage the troll\n\nIn the Combat Phase you sacrifice a lamb defender to the troll and take some threat OK\n\nThen you attack any maybe kill the troll, attacking with Gandalf and heroes most likely since Gandalf goes away at the end of the round and you might as well get the most bang for your buck.\n\n \n\nWhat I don't get is the \"You use Gandalf -> defence overcome and 1 damage done (4HP Left).\"  Is this a seperate attack by Gandalf.  Haven't you already used his 4 damage ability when he came into play in the Planning Phase.  I don't believe you can make multiple attacks against the same monster with individual characters making individual attacks... I think they all have to declare their attack on a specific monster at once.\n\n \n\nAm I wrong... game is still new.\n\n \n\nWraith428\n\n \n\n\n \n\n \n\nGandalf's effect allows you to choose between drawing 3 cards, dealing 4 damage to an enemy, or reducing your threat level by 5, when he enters play. This does not count as an attack. You can then attack with Gandalf as you normally would. Since his attack is 4 and the troll's defense is 3, Gandalf overcomes the troll with one point to spare, which per the rules, counts as one damage on a combatant. This way, you can actually deal 5 damage with Gandalf in one turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457834","commentId":457834,"userName":"wraith428","timestamp":1303499199,"content":"But how does Gandalf attack on his own?  I didn't this you could attack the same monster multiple times in the Combat phase.\n\nGandalf comes in does 4 damage.\n\nI believe... tell me I'm wrong... but you only get to attack a monster once in the combat phase... you can attack with multiple character but you're only allowed one attack against the monster.  Thus Gandalf can't attack on his own and then have other monster's attack.\n\nOr are we talking about sneak attack here?\n\n \n\nWraith428\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457859","commentId":457859,"userName":"DrNate","timestamp":1303505379,"content":"wraith428 said:\n\nBut how does Gandalf attack on his own?  I didn't this you could attack the same monster multiple times in the Combat phase.\n\nGandalf comes in does 4 damage.\n\nI believe... tell me I'm wrong... but you only get to attack a monster once in the combat phase... you can attack with multiple character but you're only allowed one attack against the monster.  Thus Gandalf can't attack on his own and then have other monster's attack.\n\nOr are we talking about sneak attack here?\n\nYou can only attack each enemy once during the combat phase, but you don't play Gandalf during the Combat Phase. Except with Sneak Attack, and even then the four damage done by Gandalf is a freebie; doesn't count as an attack at all. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=457870","commentId":457870,"userName":"qwertyuiop","timestamp":1303509054,"content":" Well, I got my first legit solo win.  After two wrath stoking losses using the Tactics deck and honest consideration of burning the game like the heathen kings of old, I decided to man up and show some Leadership.  I wouldn't say I took the game to Trouncylvania, but I did ok.  I give a lot of credit to having Steward of Gondor in my opening hand.\n\n\nAn ally made a Noble Sacrifice drawing out a Forest Spider while Uthak scowled from a distance, not yet ready to engage. Gandalf must have heard the screams because he showed up double quick and took Uthak to brown town during the next turn. Theodred walked into a nest of Hummerhorns while choosing which path to take, but the Sons of Arnor avenged him. In the end, Faramir showed up to point out the obvious. Nevertheless, the whole company was glad to see him as they walked out of the forest with a quest overage of 22.  Overall score, 43 threat + Theodred + 2 wounds -Chief Uthak and - Hummerhorns = 44."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45320-initial-impresions/?do=findComment&comment=458026","commentId":458026,"userName":"servant of the secret fire","timestamp":1303555169,"content":"qwertyuiop said:\n\nservant of the secret fire said:\n\n \n\nps:sorry ffg for what i have done to your game but after 6 hours of play and many beers i think you can forgive me sonrojado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sonrojado.gif].\n\n \n\n \n\nIf I've said it once I've said it a hundred times.... You don't have any beers.javascript:void(0);/*1303512892488*/ [http://www.youtube.com/watch?v=A3b9gOtQoq4&feature=player_embedded]\n\n\n\nI don't know if this is somehow an English/US joke/sarcasm but i don't understand what you mean.The only thing i can understand from your comment is that you have a very bad taste on music lol."}]}