{"url":"https://community.fantasyflightgames.com/topic/45424-so-whats-the-final-consensus/","title":"So whats the final consensus?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45424-so-whats-the-final-consensus/?do=findComment&comment=455652","commentId":455652,"userName":"player541151","timestamp":1303193246,"content":"I bought the game yesterday. Well... 2 copies. I opened 1 and am REALLY psyched to play but haven't opened the second one. Ive read about 100 topics on the situation but nowhere does it seem like it's really laid out what the general \"Now it's released and this is how it is\" consensus is.\n\nShould I open the second copy? I'm the game purchaser for my group and I have 1 friend who I really play with but I'd like to play with 4 people. I opened my first copy now and seperated all the cards. Now I'm under the understanding that no matter the players you don't need more \"System\" cards IE: quests monsters locations and stuff, and you'd only need multiples of player cards. From the first set I opened it seems like there's gona be alot of duplicates I just \"throw away\" unlike Warhammer invasion where duplicate core sets is not a MUST but close to it.''\n\nMy real question to someone who's purchased 2 sets or more and plans on playing with 3-4 people: Is it worth opening my second set? If so how come? what are the pros and cons and if 2 is a good thing why or why not a 3rd set?\n\nLike I said there are alot of IN DEPTH threads on analasys of the sets and the things inside the boxes. Most are speculation threads prior to the game being released. No where has anyone laid out a simple answer now that the game is out since people have their copy(s).\n\n \n\nThank you to everyone in advance for all help in this matter I really appreciate it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45424-so-whats-the-final-consensus/?do=findComment&comment=455663","commentId":455663,"userName":"Sky","timestamp":1303195803,"content":"The answer is inside You. Why do You play LotR?\n\nA. Competitivness? Then Yes - Open second Box add where U think U do it cards up to 3 and voila :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\nB. Leisure? Do what You want about it - You will not broke the gameplay in this way or another.\n\nFrom my tiny experience the question is: how many people will really play to win (not to have good time) with You? If more than one, then go for the second box - 4 more gandalf means two of You have 3 and one less lucky two of this cards.\n\nWhen You play with just one of Your friends the added value from the second box is as follows:\n\na) each of You will have 3 Gandalfs.\n\nb) each of You will be able to boost Your decks a little. So far i found only one card in the Spirit deck, that from my point of view is so good it impacts a game so much it is a little bit game breaking. In the lore deck i have not felt i miss anything in my deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45424-so-whats-the-final-consensus/?do=findComment&comment=455666","commentId":455666,"userName":"BeardFan","timestamp":1303195935,"content":"It really depends on what you want. If you want to play it as a \"boardgame\" with you supplying the cards for the other 3 players, I don't see the need for a second coreset (except that you'll miss out the additional threat trackers). I played this with 4 people using only the starter decks and it was fine. Just add the upcoming cards for the separate spheres to the starters and you can keep playing.\n\nIf you want to build decks, you may miss duplicates for some cards, so a second coreset might come in handy. Problem is, as you said, you can throw away half of the cards since you won't need them.\n\nSo far I only bought one set, but I may buy a second one. But not for the multiplayer game, but only for my own deckbuilding needs. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45424-so-whats-the-final-consensus/?do=findComment&comment=455669","commentId":455669,"userName":"BeardFan","timestamp":1303196135,"content":"Just another thought. Even if you want to build decks, you might not need another copy. It's a coop game. So if you play with someone who also built a deck, just ask him for some cards you need in your deck. Should work during casual play. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45424-so-whats-the-final-consensus/?do=findComment&comment=455775","commentId":455775,"userName":"DrNate","timestamp":1303208364,"content":"I think I can play to win but also have a good time. Storytelling, building friendship through teamwork, creatively taunting the shadow deck, none of this will detract from a solid Spirit/Tactics strategy featuring my favorite characters.\n\nTo me it is just a game and if winning totally overshadows having fun, then I'm either playing wrong, or it just isn't for me.\n\nAs for extra boxes, I will hopefully be able to use the unneeded copies of cards from the second (and third?) core set to my friend(s) to entice them to play with me. Of course they can share my cards, but having their own just feels different. But is it worth it? Part of it depends on how many cards I desire more copies of. The other part depends on math!\n\nFor the first core set, I need all 225 cards for $40. Great value.\nFor the second core set, I will only need 53 cards from the set for $40. I can give away 172 cards. Still pretty great.\nFor the third, I would only need 13 cards and could only give away 40 to my friend. Worth $40? Maybe Ebay."}]}