{"url":"https://community.fantasyflightgames.com/topic/45464-encounter-and-quest-spoilers-from-cardgamedbcom/","title":"Encounter and Quest spoilers from CardGameDB.com","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45464-encounter-and-quest-spoilers-from-cardgamedbcom/?do=findComment&comment=456009","commentId":456009,"userName":"Darksbane","timestamp":1303232079,"content":"Finally the Encounter deck and quest deck spoilers, would have edited my other thread but the forums won't let me edit the post anymore :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nBanks of the Anduin [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/banks-of-the-anduin-core]\nType: Location\nEncounter Set: Journey Down the Anduin\nThreat: 1 Quest Points: 3\nRiverland.\nForced: If Banks of the Anduin leaves play, return it to the top of the encounter deck instead of placing it in the discard pile.\nhere and there through openings Frodo could catch sudden glimpses of rolling meads, and far beyond them hills in the sunset, and away on the edge of sight a dark line, where marched the southernmost ranks of the Misty Mountains. - The Fellowship of the Ring\nIllustrator: Ben Zweifel\nSet: Core\n\nBlack Forest Bats [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/black-forest-bats-core]\nType: Enemy\nEncounter Set: Passage Through Mirkwood\nThreshold: 15\nThreat: 1 Attack: 1 Defense: 0 Hit Points: 2\nCreature.\nWhen Revealed: Each player must choose 1 character currently committed to a quest, and remove that character from the quest. (The chosen character does not ready.)\nThey could not stand that, nor the huge bats, black as a top-hat, either... - The hobbit\nIllustrator: David Lecossu\nSet: Core\n\nCaught in a Web [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/caught-in-a-web-core]\nType: Treachery\nEncounter Set: Spiders of Mirkwood\nWhen Revealed: The player with the highest threat level attaches this card to one of his heroes. (Counts as a Condition attachment with the text: \"Attached hero does not ready during the refresh phase unless you pay 2 resources from that hero's pool.\")\nIllustrator: Daryl Mandryk\nSet: Core\n\nCavern Guardian [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/cavern-guardian-core]\nType: Enemy\nEncounter Set: Escape from Dol Guldur\nThreshold: 8\nThreat: 2 Attack: 2 Defense: 1 Hit Points: 2\nUndead.\nDoomed 1.\nShadow: Choose and discard 1 attachment you control. Discarded objective cards are returned to the staging area. (If this attack is undefended, discard all attachments you control.)\nIllustrator: Mark Winters\nSet: Core\n\nChieftan Ufthak [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/chieftan-ufthak-core]\nType: Enemy\nEncounter Set: Dol Guldur Orcs\nThreshold: 35\nThreat: 2 Attack: 3 Defense: 3 Hit Points: 6\nDol Guldur. Orc.\nChieftan Ufthak gets +2 Attack for each resource token on him.\nForced: After Chieftan Ufthak attacks, place 1 resource token on him.\nVictory 4.\nIllustrator: Mathias Kollros\nSet: Core\n\nDespair [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/despair-core]\nType: Treachery\nEncounter Set: Wilderlands\nWhen Revealed: Remove 4 progress tokens from the current quest card. (If there are fewer than 4 progress tokens on the quest, remove all progress tokens from that quest.)\nShadow: Defending character does not count its Defense\nIllustrator: Marc Scheff\nSet: Core\n\nDol Guldur Beastmaster\nType: Enemy\nEncounter Set: Dol Guldur Orcs\nThreshold: 35\nThreat: 2 Attack: 3 Defense: 1 Hit Points: 5\nDol Guldur. Orc.\nForced: After Dol Guldur Beastmaster attacks, deal it 1 additional shadow card.\nIllustrator: David Lecossu\nSet: Core\n\nDol Guldur Orcs\nType: Enemy\nEncounter Set: Dol Guldur Orcs\nThreshold: 10\nThreat: 2 Attack: 2 Defense: 0 Hit Points: 3\nDol Guldur. Orc.\nWhen Revealed: The first player chooses 1 character currently committed to a quest. Deal 2 damage to that character.\nAttacking enemy gets +1 ATK. (+3 ATK instead if this attack is undefended.)\nIllustrator: Anna Christenson\nSet: Core\n\nDriven by Shadow\nType: Treachery\nEncounter Set: Dol Guldur Orcs\nWhen Revealed: Each enemy and location currently in the staging area gets + 1 Threat Strength until the end of the phase. If there are no cards in the staging area, Driven by Shadow gains surge.\nShadow: Choose and discard 1 attachment from the defending character. (If this attack is undefended, discard all attachments you control.)\nIllustrator: Alexandru Sabo\nSet: Core\n\nDungeon Jailor\nType: Enemy\nEncounter Set: Escape from Dol Guldur\nThreshold: 38\nThreat: 1 Attack: 2 Defense: 3 Hit Points: 5\nDol Guldur. Orc.\nForced: If Dungeon Jailor is in the staging area after the players have quested unsuccessfully, shuffle 1 unclaimed objective card from the staging area back into the encounter deck.\nVictory 5\nIllustrator: Tiziano Baracchi\nSet: Core\n\nDungeon Torch\nType: Objective\nEncounter Set: Escape from Dol Guldur\nItem.\nGuarded. Restricted.\nAction: Raise your threat by 2 to claim this objective when it is free of encounters. When claimed, attach Dungeon Torch to a hero you control. (Counts as an attachment. If detached, return Dungeon Torch to the staging area.)\nForced: At the end of each round, raise attached hero's controller's threat by 2.\nIllustrator: David Lecossu\nSet: Core\n\nEast Bight Patrol\nType: Enemy\nEncounter Set: Passage Through Mirkwood\nThreshold: 5\nThreat: 3 Attack: 3 Defense: 1 Hit Points: 2\nGoblin. Orc.\n\nShadow: Attacking enemy gets +1 Attack. (If this attack is undefended also raise your threat by 3.)\nIllustrator: Nikolay Stoyanov\nSet: Core\n\nEastern Crows\nType: Enemy\nEncounter Set: Sauron's Reach\nThreshold: 30\nThreat: 1 Attack: 1 Defense: 0 Hit Points: 1\nCreature.\nSurge.\nForced: After Eastern Crows is defeated, shuffle it back into the encounter deck.\nShadow: Attacking enemy gets +1 Attack. (+2 Attack instead if defending player's threat is 35 or higher.)\nIllustrator: Matthew Starbuck\nSet: Core\n\nEnchanted Stream\nType: Location\nEncounter Set: Dol Guldur Orcs\nThreat: 2 Quest Points: 2\nForest.\nWhile Enchanted Stream is the active location, players cannot draw cards.\n\"There is one stream there, I know, black and strong which crosses the path. That you should neither drink of, nor bathe in: for I have heard that it carries enchantment and a great drowsiness and forgetfulness.\" - Beorn, The Hobbit\nIllustrator: Ben Zweifel\nSet: Core\n\nEndless Caverns\nType: Location\nEncounter Set: Escape from Dol Guldur\nThreat: 1 Quest Points: 3\nDungeon.\nDoomed 1. Surge.\n\"I alone of you have ever been in the dungeons of the Dark Lord, and only in his older and lesser dwelling in Dol Guldur.\" - Gandalf, The Fellowship of the Ring\nIllustrator: Even Mehl Amundsen\nSet: Core\n\nEvil Storm\nType: Treachery\nEncounter Set: Sauron's Reach\nWhen Revealed: Deal 1 damage to each character controlled by each player with a threat of 35 or higher.\n\"They say in my land he can govern the storms in the Mountains of Shadow...\" - Boromir, The Fellowship of the Ring\nIllustrator: Tom Garden\nSet: Core\n\nEyes of the Forest\nType: Treachery\nEncounter Set: Spiders of Mirkwood\nWhen Revealed: Each player discards all event cards in his hand.\n...he would see gleams in the darkness round them, and sometimes pairs of yellow or red or green eyes would stare at him from a little distance, and then slowly fade and disappear and slowly shine out again in another place. - The Hobbit\nIllustrator: Yoann Boissonnet\nSet: Core\n\nForest Gate\nType: Location\nEncounter Set: Passage Through Mirkwood\nThreat: 2 Quest Points: 4\nForest.\nResponse: After you travel to Forest Gate, the first player may draw 2 cards.\nThe path itself was narrow and wound in and out among the trunks. Soon the light at the gate was like a little bright hole far behind, and the quiet was so deep that their feet seemed to thump along while the trees leaned over them and listened. - The Hobbit\nIllustrator: Ben Zweifel\nSet: Core\n\nForest Spider\nType: Enemy\nEncounter Set: Passage Through Mirkwood\nThreshold: 25\nThreat: 2 Attack: 2 Defense: 1 Hit Points: 4\nCreature. Spider.\nForced: After Forest Spider engages a player, it gets +1 ATK until the end of the round.\nShadow: Defending player must choose and discard 1 attachment he controls.\nIllustrator: Marco Caradonna\nSet: Core\n\nGandalf's Map\nType: Objective\nEncounter Set: Escape from Dol Guldur\nItem.\nGuarded. Restricted.\nAction: Raise your threat by 2 to claim this objective when it is free of encounters. When claimed, attach Gandalf's Map to a hero you control. (Counts as an attachment. If detached, return Gandalf's Map to the staging area.)\nAttached hero cannot attack or defend.\nIllustrator: Mike Nash\nSet: Core\n\nGladden Fields\nType: Location\nEncounter Set: Journey Down the Anduin\nThreat: 3 Quest Points: 3\nMarshland.\nForced: While Gladden Fields is the active location, each player must raise his threat by an additional point during the refresh phase.\nVictory 3.\n\"On a time they took a boat and went down to the Gladden Fields, where there were great beds of iris and flowering reeds.\" - Gandalf, The Fellowship of the Ring\nIllustrator: Ben Zweifel\nSet: Core\n\nGoblin Sniper\nType: Enemy\nEncounter Set: Wilderlands\nThreshold: 48\nThreat: 2 Attack: 2 Defense: 0 Hit Points: 2\nGoblin. Orc.\nDuring the encounter phase, players cannot optionally engage Goblin Sniper if there are other enemies in the staging area.\nForced: If Goblin Sniper is in the staging area at the end of the combat phase, each player deals 1 point of damage to 1 character he controls.\nIllustrator: Alexandr Shaldin\nSet: Core\n\nGreat Forest Web\nType: Location\nEncounter Set: Spiders of Mirkwood\nThreat: 2 Quest Points: 2\nForest.\nTravel: Each player must exhaust 1 hero he controls to travel here.\nAs he drew nearer, he saw that it was made with spider-webs one behind and over and tangled with another. - The Hobbit\nIllustrator: Jason Ward\nSet: Core\n\nHill Troll\nType: Enemy\nEncounter Set: Wilderlands\nThreshold: 30\nThreat: 1 Attack: 6 Defense: 3 Hit Points: 9\nTroll.\nExcess combat damage dealt by Hill Troll (damage that is dealt beyond the remaining hit points of the character damaged by its attack) must be assigned as an increase to your threat.\nVictory 4.\n\"Mutton yesterday, mutton today, and blimey, if it don't look like mutton again tomorrow.\" - Troll, The Hobbit\nIllustrator: Florian Stitz\nSet: Core\n\nHummerhorns\nType: Enemy\nEncounter Set: Spiders of Mirkwood\nThreshold: 40\nThreat: 1 Attack: 2 Defense: 0 Hit Points: 3\nCreature. Insect.\nForced: After Hummerhorns engages you, deal 5 damage to a single hero you control.\nShadow: Deal 1 damage to each character the defending player controls. (2 damage instead if this attack is undefended.)\nVictory 5.\nIllustrator: David Lecossu\nSet: Core\n\nIron Shackles\nType: Treachery\nEncounter Set: Escape from Dol Guldur\nWhen Revealed: Attach Iron Shackles to the top of the first player's deck. (Counts as a Condition attachment with the text: \"The next time a player would draw 1 or more cards from attached deck, discard Iron Shackles instead.)\nShadow: Resolve the \"When Revealed\" effect of Iron Shackles.\nIllustrator: Drew Whitmore\nSet: Core\n\nKing Spider\nType: Enemy\nEncounter Set: Spiders of Mirkwood\nThreshold: 20\nThreat: 2 Attack: 3 Defense: 1 Hit Points: 3\nCreature. Spider.\nWhen Revealed: Each player must choose and exhaust 1 character he controls.\nShadow: Defending player must choose and exhaust 1 character he controls. (2 characters instead if this attack is undefended.)\nIllustrator: John Wigley\nSet: Core\n\nMarsh Adder\nType: Enemy\nEncounter Set: Wilderlands\nThreshold: 40\nThreat: 3 Attack: 4 Defense: 1 Hit Points: 7\nCreature.\nForced: Each time Marsh Adder attacks you, raise your threat by 1.\nVictory 3.\nUnder the boughs of Mirkwood there was deadly strife of Elves and Men and fell beasts. - The Fellowship of the Ring.\nIllustrator: Sandara Tang\nSet: Core\n\nMassing at Night\nType: Treachery\nEncounter Set: Journey Down the Anduin\nWhen Revealed: Reveal X additional cards from the encounter deck. X is the number of players in the game.\nShadow: Deal X shadow cards to this attacker. X is the number of players in the game.\nIllustrator: Mathias Kollros\nSet: Core\n\nMisty Mountain Goblins\nType: Enemy\nEncounter Set: Journey Down the Anduin\nThreshold: 15\nThreat: 2 Attack: 2 Defense: 1 Hit Points: 3\nGoblin. Orc.\nForced: After Misty Mountain Goblins attacks, remove 1 progress token from the current quest.\nShadow: Remove 1 progress token from the current quest. (3 progress tokens instead if this attack is undefended.)\nIllustrator: Nikolay Stoyanov\nSet: Core\n\nMountains of Mirkwood\nType: Location\nEncounter Set: None\nThreat: 2 Quest Points: 3\nForest. Mountain.\nTravel: Reveal the top card of the encounter deck and add it to the staging area to travel here.\nResponse: After Mountains of Mirkwood leaves play as an explored location, each player may search the top 5 cards of his deck for 1 card and add it to his hand. Shuffle the rest of the searched cards back into their owners' decks.\nIllustrator: Ben Zweifel\nSet: Core\n\nNazgul of Dol Guldur\nType: Enemy\nEncounter Set: Escape from Dol Guldur\nThreshold: 40\nThreat: 5 Attack: 4 Defense: 3 Hit Points: 9\nNazgul.\nForced: When the prisoner is \"rescued,\" move Nazgul of Dol Guldur into the staging area.\nForced: After a shadow effect dealt to Nazgul of Dol Guldur resolves, the engaged player must choose and discard 1 character he controls.\nIllustrator: David A. Nash\nSet: Core\n\nNecromancer's Pass\nType: Location\nEncounter Set: Dol Guldur Orcs\nThreat: 3 Quest Points: 2\nStronghold. Dol Guldur.\nTravel: The first player must discard 2 cards from his hand at random to travel here.\n\"It is clad in a forest of dark fir, where the trees strive on against another and their branches rot and wither. In the midst upon a stony height stands Dol guldur, where long the hidden Enemy had his dwelling.\" - Haldir, The Fellowship of the Ring\nIllustrator: Daryl Mandryk\nSet: Core\n\nOld Forest Road\nType: Location\nEncounter Set: Passage Through Mirkwood\nThreat: 1 Quest Points: 3\nForest.\nResponse: After you travel to Old Forest Road, the first player may choose and ready 1 character he controls.\n...Beorn had warned them that that way was now often used by the goblins, while the forest-road itself, he bad heard, was overgrown and disused at the eastern end and led to impassable marshes where the paths had long been lost. - The Hobbit\nIllustrator: Ben Zweifel\nSet: Core\n\nPursued by Shadow\nType: Treachery\nEncounter Set: Sauron's Reach\nWhen Revealed: Each player raises his threat by 1 for each character he controls that is not currently committed to a quest.\nShadow: Defending player chooses and returns 1 exhausted ally he controls to its owner's hand. If he controls no exhausted allies, raise his threat by 3.\nIllustrator: Matthew Starbuck\nSet: Core\n\nShadow Key\nType: Objective\nEncounter Set: Escape from Dol Guldur\nItem.\nGuarded. Restricted.\nAction: Raise your threat by 2 to claim this objective when it is free of encounters. When claimed, attach Shadow key to a hero you control. (Counts as an attachment. If detached, return Shadow Key to the staging area.)\nForced: At the end of each round, attached hero suffers 1 damage.\nIllustrator: Nicholas Cloister\nSet: Core\n\nThe Brown Lands\nType: Location\nEncounter Set: Wilderlands\nThreat: 5 Quest Points: 1\nWasteland.\nForced: After the players travel to The Brown Lands, place 1 progress token on it.\nThey had come to the Brown Lands that lay, vast and desolate, between Southern Mirkwood and the hills of the Emyn Muil. What pestilence or war or evil deed of the Enemy had so blasted all that region even Aragorn could not tell. - The Fellowship of the Ring\nIllustrator: Ben Zweifel\nSet: Core\n\nThe East Bight\nType: Location\nEncounter Set: Wilderlands\nThreat: 1 Quest Points: 6\nWasteland.\nWhen faced with the option to travel, the players must travel to The East Bight if there is no active location.\n\"...to the east the lands are a waste, and full of Sauron's creatures...\" - Haldir, The Fellowship of the Ring\nIllustrator: Santiago Villa\nSet: Core\n\nThe Necromancer's Reach\nType: Treachery\nEncounter Set: Dol Guldur Orcs\nWhen Revealed: Deal 1 damage to each exhausted character.\nThere was an eye in the Dark Tower that did not sleep. He knew that it had become aware of his gaze. A fierce eager will was there. - The Fellowship of the Ring\nIllustrator: Anna Christenson\nSet: Core\n\nTower Gate\nType: Location\nEncounter Set: Escape from Dol Guldur\nThreat: 2 Quest Points: 1\nDungeon.\nForced: After travelling to Tower Gate, each player places the top card of his deck, face down in front of him, as if it just engaged him from the staging area. These cards are called \"Orc Guard,\" and act as enemies with: 1 hit point, 1 Attack, and 1 Defense.\n\"I myself dared to pass the doors of the Necromancer in Dol Guldur, and secretly explored his ways...\" - Gandalf, The Fellowship of the Ring\nIllustrator: West Clendinning\nSet: Core\n\nTreacherous Fog\nType: Treachery\nEncounter Set: Sauron's Reach\nWhen Revealed: Each location in the staging area gets +1 Threat Strength until the end of the phase. Then, each player with a threat of 35 or higher chooses and discards 1 card from his hand.\n\"But it will be hard to find the path unless the fog lifts a little later on.\" - Aragorn, The Fellowship of the Ring\nIllustrator: David Lecossu\nSet: Core\n\nUnder the Shadow\nType: Treachery\nEncounter Set: Escape from Dol Guldur\nWhen Revealed: Until the end of the phase, raise the total Threat Strength in the staging area by X, where X is the number of players in the game.\nShadow: Defending player raises his threat by the number of enemies with which he is engaged.\nIllustrator: Igor Kieryluk\nSet: Core\n\nUngoliant's Spawn\nType: Enemy\nEncounter Set: Spiders of Mirkwood\nThreshold: 32\nThreat: 3 Attack: 5 Defense: 2 Hit Points: 9\nCreature. Spider.\nWhen Revealed: Each character currently committed to a quest gets -1 Wilpower until the end of the phase.\nShadow: Raise defending player's threat by 4. (Raise defending player's threat by 8 instead if this attack is undefended.)\nIllustrator: Andrew Olson\nSet: Core\n\nWargs\nType: Enemy\nEncounter Set: Wilderlands\nThreshold: 20\nThreat: 2 Attack: 3 Defense: 1 Hit Points: 3\nCreature.\nForced: If Wargs is dealt a shadow card with no effect, return Wargs to the staging area after it attacks.\nShadow: Attacking enemy gets +1 ATK. (+2 ATK instead if this attack is undefended.)\nIllustrator: Ryan Barger\nSet: Core\n\nWolf Rider\nType: Enemy\nEncounter Set: Wilderlands\nThreshold: 10\nThreat: 1 Attack: 2 Defense: 0 Hit Points: 2\nGoblin. Orc.\nSurge.\nShadow: Wolf Rider attacks the defending player. That player may declare 1 character as a defender. Deal Wolf Rider its own Shadow card. After combat, return Wolf Rider to the top of the encounter deck.\nIllustrator: Alexandru Sabo\nSet: Core\n\n\nhttp://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/banks-of-the-anduin-core"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45464-encounter-and-quest-spoilers-from-cardgamedbcom/?do=findComment&comment=456012","commentId":456012,"userName":"Darksbane","timestamp":1303232196,"content":"A Chosen Path: \"Don't Leave the Path!\"\nType: Quest\nScenario: Passage Through Mirkwood Encounters: Dol Guldur Orcs,Passage Through Mirkwood,Spiders of Mirkwood\nQuest Points: 0\nWhen Revealed: Each player must search the encounter deck and discard pile for 1 Spider card of his choice, and add it to the staging area.\nThe Players must find and defeat Ungoliant's Spawn to win this game.\nThe Players must find and defeat Ungolinant's Spawn to win the Game.\nThe trail winds into one of the darkest, most tangled parts of the forest...\nYou sense that a foul, dark presence is hunting you, and you move quickly in an attempt to avoid its evil.\nThe shadows grow darker, and you realize that a foul presence is aiming to draw you from the path. You must defeat it to pass this way.\nIllustrator: Ben Zweifel, Yoann Boissonnet\nSet: Core\n\nA Chosen Path: Beorn's Path\nType: Quest\nScenario: Passage Through Mirkwood Encounters: Dol Guldur Orcs,Passage Through Mirkwood,Spiders of Mirkwood\nQuest Points: 10\nPlayers cannot defeat this stage while Ungoliant's Spawn is in play. If players defeat this stage, they have won the game.\nThe trail winds into one of the darkest, most tangled parts of the forest...\nYou sense that a foul, dark presence is hunting you, an dyou move quickly in an attempt to avoid its evil.\nYou attempt to follow a secret, hidden trail to avoid the enemy...\nIllustrator: David Lecossu, Yoann Boissonnet\nSet: Core\n\nA Fork in the Road\nType: Quest\nScenario: Passage Through Mirkwood Encounters: Dol Guldur Orcs,Passage Through Mirkwood,Spiders of Mirkwood\nQuest Points: 2\nForced: When you defeat this stage, proceed to one of the 2 \"A Chosen Path\" stages at random.\nAs you move through Mirkwood, hounded by spiders, the forest path forks before you...\nUnsure of what lies ahead but spurred by the urgency of your message, you choose a path and proceed...\nIllustrator: Ben Zweifel\nSet: Core\n\nAmbush on the Shore\nType: Quest\nScenario: Journey Down the Anduin Encounters: Dol Guldur Orcs,Journey Down the Anduin,Sauron's Reach,Wilderlands\nQuest Points: 0\nWhen Revealed: Reveal 2 encounter cards per player, and add them to the staging area.\nSkip the staging step of the quest phase for the remainder of the game.\nOnce there are no enemies in play, the players have won the game.\nThe ongoing harassment from your enemies has forced your raft to the shore, and you must now confront their ambush head on. If you survive this attack, the path to the Golden Wood should be open before you...\nIllustrator: David A. Nash\nSet: Core\n\nAnduin Passage\nType: Quest\nScenario: Journey Down the Anduin Encounters: Dol Guldur Orcs,Journey Down the Anduin,Sauron's Reach,Wilderlands\nQuest Points: 16\nReveal 1 additional card from the encounter deck each quest phase. Do not make engagement checks during the encounter phase. (Each player may still optionally engage 1 enemy each encounter phase.)\nAfter defeating the Troll, you are able to board the raft and embark upon a river voyage. As you depart, your enemies pursue, harassing the small vessel as you attempt to navigate the river...\n\nAs your enemies harass the raft, it is difficult to maintain balance and effectively fight them off.\nIllustrator: Ben Zweifel\nSet: Core\n\nFlies and Spiders\nType: Quest\nScenario: Passage Through Mirkwood Encounters: Dol Guldur Orcs,Passage Through Mirkwood,Spiders of Mirkwood\nQuest Points: 8\nSetup: Search the encounter deck for 1 copy of the Forest Spider and 1 copy of the Old Forest Road, and add them to the staging area. Then Shuffle the encounter deck.\nYou are traveling through Mirkwood forest, carrying an urgent message from King Thanduil to the Lady Galadriel of Lorien. As you move along the dark trail, the spiders gather around you...\nThe nastiest things they saw were the cobwebs; dark dense cobwebs, with threads extradionairly thick, often stretched from tree to tree, or tangled in the lower branches on either side of them. There were none stretched across the path, but whether because some magic kept it clear, or for what other reasons they could not guess. - The Hobbit\nIllustrator: Ben Zweifel\nSet: Core\n\nOut of the Dungeons\nType: Quest\nScenario: Escape from Dol Guldur Encounters: Dol Guldur Orcs,Escape from Dol Guldur,Spiders of Mirkwood\nQuest Points: 7\nForced: At the beginning of each quest phase, each player places the top card of his deck, face down in front of him, as if it just engaged him from the staging area. These cards are called \"Orc Guard,\" and act as enemies with 1 hit point, 1 Attack, and 1 Defense.\n\nPlayers cannot defeat this stage while Nazgul of Dol Guldur is in play. If this stage is defeated and Nazgul of Dol Guldur is not in play, the players have won the game.\nFollowing a thread of sunlight, you discover a cavern opening leading out through the side of the hill. Stationed outside the cave-mouth, however, is a large group of Orcs.\nIllustrator: Kaya\nSet: Core\n\nThe Necromancer's Tower\nType: Quest\nScenario: Escape from Dol Guldur Encounters: Dol Guldur Orcs,Escape from Dol Guldur,Spiders of Mirkwood\nQuest Points: 9\nSetup: Search the encounter deck for the 3 objective cards, and place them in the staging area. Also, place the Nazgul of Dol Guldur face up but out of play, alongside the quest deck. Then, shuffle the encounter deck, and attach 1 encounter to each objective card.\nWhen Revealed: Randomly select 1 hero card (among all the heroes controlled by the players) and turn it facedown. The hero is now considered a \"prisoner\", cannot be used, cannot be damaged, and does not collect resources, until it is \"rescued\" (as instructed by card effects) later in this quest.\n\nThe players, as a group, cannot play more than 1 ally card each round.\n\nPlayers cannot advance to the next stage of this quest unless they have at least 1 objective card.\nThe Lady Galadriel of Lorien has asked you to investigate the area in the vicinity of Dol Guldar. While doing so, one of your allies was ambushed by Orcs, captured, and is now held in a dungeon cell...\nIllustrator: Ben Zweifel\nSet: Core\n\nThrough the Caverns\nType: Quest\nScenario: Escape from Dol Guldur Encounters: Dol Guldur Orcs,Escape from Dol Guldur,Spiders of Mirkwood\nQuest Points: 15\nResponse: After placing any number of progress tokens on this card, flip the \"prisoner\" hero card face-up, and place 1 damage token on it. This hero has been \"rescued,\" and may now be used by its controller.\n\nThe players, as a group, cannot play more than 1 ally card each round.\n\nPlayers cannot advance to the next stage of this quest unless they have rescued the prisoner and have all 3 \"Escape from Dol Guldur\" objective cards.\nFinding a hidden entrance to the dungeons of Dol Guldur at last, you attempt to make your way through the caverns beneath the hill, searching for your imprisoned friend. the denizens of this labyrinth stand in your way, while the jailors protect the prisoner.\nIllustrator: Kaya\nSet: Core\n\nTo the River...\nType: Quest\nScenario: Journey Down the Anduin Encounters: Dol Guldur Orcs,Journey Down the Anduin,Sauron's Reach,Wilderlands\nQuest Points: 8\nSetup: Each player reveals 1 card from the top of the encounter deck, and adds it to the staging area.\nWhen Revealed: Search the encounter deck for 1 Hill Troll (if one is not already in play), and place it in the staging area. Shuffle the encounter deck.\n\nPlayers cannot defeat this stage while any Hill Troll cards are in play.\nEmerging from Mirkwood Forest with an urgent message for Lady Galadriel, you must now make your way south along the Anduin River in order to reach the forest of Lorien. As you leave the forest behind, you notice that you are being pursued, and thus quicken your pace...\n\nAs you approach the location of a small raft stranded on the riverbank, a fearsome Hill Troll emerges from behind a grouping of rocks, and attacks!\nIllustrator: Ben Zweifel\nSet: Core"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45464-encounter-and-quest-spoilers-from-cardgamedbcom/?do=findComment&comment=456029","commentId":456029,"userName":"9thimmortal","timestamp":1303233868,"content":"Thanks for whetting my whistle even more.  *crossing fingers it is there when I get home*"}]}