{"url":"https://community.fantasyflightgames.com/topic/45488-table-talk-rules-question/","title":"Table Talk rules question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45488-table-talk-rules-question/?do=findComment&comment=456210","commentId":456210,"userName":"Jivewookiee","timestamp":1303266117,"content":" I havent got a copy of the game yet, so actual play may clear this up, but.....\n\nThe \"Table Talk\" rule\n\nAs I read it, you are allowed to plan and plot together to beat an objective or critter. But you CANNOT talk of specific cards or cards you have seen in another players hand.\n\nSurely a group of friends, after a few games. And years of knowing each other will be able to tell the group what card he is using without the title. I can see the argument that you shouldnt play like that and that it runs on a honour system. But surely if I ask if someone can give me a heal before an attack and they say yes, i can deduce the card they are talking about. Im not sure how many \"instant\" heals are in the box but it couldnt more than two or three different ones\n\nAlso you could play a game of verbal Guess Who and process of elimination end up with the knowledge of what they are holding.\n\n \n\nSo people who have played this....how did you deal with it\n\n \n\nJivewookiee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45488-table-talk-rules-question/?do=findComment&comment=456232","commentId":456232,"userName":"jhaelen","timestamp":1303269399,"content":"Jivewookiee said:\n\nAlso you could play a game of verbal Guess Who and process of elimination end up with the knowledge of what they are holding.\n\n\n\nThe way I see it, the rule is mainly there to avoid having a player make all decisions for another player. Since it's a cooperative game not giving another player important information would be counter-productive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45488-table-talk-rules-question/?do=findComment&comment=456251","commentId":456251,"userName":"Mighty Jim 83","timestamp":1303272389,"content":"My experience from other co-op games, is that half the fun is listening to some of the convoluted ways people find of telling you their cards without actually telling you their cards.\n\nObviously, it makes the game a bit easier this way, so it depends what you want from the game, is the objective to be sociable, or to play the game seriously? if its the latter, you'll need to keep a tight rein on people."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45488-table-talk-rules-question/?do=findComment&comment=456281","commentId":456281,"userName":"TheProfessor","timestamp":1303279559,"content":" I think jhaelen hit the nail on the thumb here.  The main purpose is most likely to prevent one player from running the entire game.  In order to keep all players engaged, there must be some decision making that they alone can do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45488-table-talk-rules-question/?do=findComment&comment=456306","commentId":456306,"userName":"Jampel2","timestamp":1303282811,"content":"What \"we and i\" did in a coop game was table talk all the time about stuff like how much characters you want me and can you engage to quest exploration, can you take these baddys and i can take these, wich location do we want to explore etc. . The point of the rule for me is to keep you hand hidden so you can both plan ahead what to do but still don;t know what your partner has up his sleeve."}]}