{"url":"https://community.fantasyflightgames.com/topic/45503-card-discussion-gandalf-combos/","title":"[Card Discussion] Gandalf (+combos)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45503-card-discussion-gandalf-combos/?do=findComment&comment=456421","commentId":456421,"userName":"faith_star83","timestamp":1303294938,"content":"Hi guys,\n\n \n\nsince questions and comments about Gandalf are popping up in every kind of place, I thought to open up an official Gandalf thread.\n\nI think one of the most frequently asked question is about the Gandalf + Sneak Attack combo.\n\nThe combo is possible afaik. Gandalf reads: Response: After Gandalf enters play, (choose 1): draw 3 cards, deal 4 damage to 1 enemy, or reduce your threat by 5.\n\nSneak Attack reads: Action: Put 1 ally card into play from your hand. At the end of the phase, if that ally is still in play, return it to your hand.\n\nFollowing the text, Gandalf triggers when entering play. And he does that when being put into play by Sneak Attack in my opinion.\n\nBut I wonder if I can play - as a last action of the round when Gandalf leaves play - the card Valiant Sacrifice!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45503-card-discussion-gandalf-combos/?do=findComment&comment=456428","commentId":456428,"userName":"Bohemond2","timestamp":1303295829,"content":"I would think that playing Valiant Sacrifice would be permissible.  What's the argument for not allowing it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45503-card-discussion-gandalf-combos/?do=findComment&comment=456452","commentId":456452,"userName":"9thimmortal","timestamp":1303297847,"content":"From the wording of the cards, I think he triggers on Sneak, and Sacrifice triggers for sure (leaving play, otherwise would say 'after being discarded').  I don't see a reason why not (other than both being pretty powerful). \n\nAgain, I think both were demo'd as working that way as well - albiet a long time ago (last year's GenCon)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45503-card-discussion-gandalf-combos/?do=findComment&comment=456537","commentId":456537,"userName":"mason240","timestamp":1303305920,"content":" Did anyone else get 4 copies of Gandalf? Is is the only card in the player decks that has more then 3, so I'm wondering if it was an accident. I'm going to put 3 in the database unless everyone else got got 4 as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45503-card-discussion-gandalf-combos/?do=findComment&comment=456540","commentId":456540,"userName":"Toqtamish","timestamp":1303306053,"content":"Every copy comes with 4. One per 30 card starter deck. It's right in the rulebook. Page 10.\n\nEach starter deck should also include 1 copy of the\nneutral ally card, Gandalf (card 73)."}]}