{"url":"https://community.fantasyflightgames.com/topic/45540-organizing-sleeves-any-recommendations/","title":"Organizing Sleeves - Any recommendations?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45540-organizing-sleeves-any-recommendations/?do=findComment&comment=456753","commentId":456753,"userName":"krisarthur","timestamp":1303330663,"content":"I just purchased the game and bought 100 blue sleeves for the encounter deck.\n\n \n\nAfter that how you are you organizing them? Obviously the quest cards need to be see through.\n\n \n\nTips?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45540-organizing-sleeves-any-recommendations/?do=findComment&comment=456760","commentId":456760,"userName":"faith_star83","timestamp":1303331299,"content":"I decided to put all my cards in clear sleeves (as they are so thin!) since they have a nice artwork in the back. That way I can also easily distinguish encounter deck from player deck without having to use different sleeves..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45540-organizing-sleeves-any-recommendations/?do=findComment&comment=456762","commentId":456762,"userName":"krisarthur","timestamp":1303331698,"content":"I bought 3 other 50 packs of different colors for the rest of the cards though I know I'll have to do the Quest cards with clear sleeves.\n\nI haven't even played a game yet.. but can you separate the player cards by sphere (1 color per sphere) or just mix all the player cards up period?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45540-organizing-sleeves-any-recommendations/?do=findComment&comment=456778","commentId":456778,"userName":"pwvogt","timestamp":1303336350,"content":" You'll probably want four different sets of sleeves in you're looking to store all your cards in sleeves in a big cardboard box or otherwise. You want one color for all of your player deck cards, another for your hero cards (so you can easily identify them amongst your decks), as you've said a clear one for your quest cards, and then a final color for your encounter cards. I would recommend finding one color you like for your player deck cards rather than picking up a color for each of the four spheres as you'll probably want to build combined decks at some point and color-coded sleeves per sphere would be cheating the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45540-organizing-sleeves-any-recommendations/?do=findComment&comment=457069","commentId":457069,"userName":"Toqtamish","timestamp":1303384254,"content":"I have 4 different colors for the player decks picked out and ready to sleeve once I get my copy. When FFG releases the LotR themed sleeves this summer I plan to use those exclusively."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45540-organizing-sleeves-any-recommendations/?do=findComment&comment=457079","commentId":457079,"userName":"prune","timestamp":1303386033,"content":"I'm using clear deck protector sleeves for everything except the characters.  The art on the back of the player and encounter cards is attractive, so I want to be able to see it, and it's easy to keep the different decks separated.  I think I'd only consider colored sleeves if I were going to play in a tournament, so I could make sure my cards didn't get mixed up with other peoples' cards.\n\nCharacters I'm putting in heavier sleeves with a textured back, so that they can be kept with a deck but easily separated from the deck just by feel.\n\nI've set aside the clunky cardboard box for the time being, and put the sleeved cards in a couple of 2-piece plastic card boxes, and put the rule book and other stuff in the big plastic bag that came with the game.  Takes up a quarter of the space as the big display box and fits easily into a backpack with plenty of room for other stuff.  It's making me want to print out a copy of the rules so that I can have a copy that folds up and transports easily without inflicting wear and tear on the copy that comes with the game."}]}