{"url":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/","title":"First crack at deckbuilding","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457034","commentId":457034,"userName":"Oshio","timestamp":1303379339,"content":"After playing a few games with the pre-constructed decks I, as a long time CCG player, couldn't stop myself from putting together a couple of decks. While solo-sphere decks are, eventually, going to be the most efficient way to go, right now it's physically impossible to build a tournament legal solo sphere deck. With all of the great things this game has going for it, this is my biggest complaint: I really wish they would have added another 10 cards per deck so that we could build a legal solo sphere deck with a couple of sets. After the first expansion comes out this should be possible, but we won't have many options...it's going to be a solid few months before we start getting some flexibility.\n\nSo, that being said, it looks like we'll just have to make due with dual-sphere decks. Dual sphere decks have the distinct disadvantage of having one sphere under-represented and only producing 1 resource per round, so tricks need to be employed to combat this. This problem interestingly makes Leadership the best sphere to team up with, as they can bring the uber powerful Steward of Gondor to the table, something that is a 3x necessity when playing a dual sphere deck in order to get your under-represented sphere up and running as quickly as possible.\n\nSo with 2 sets of the base game I started looking at spheres and what fits best together. While there are some obvious and powerful combos with Leadership and Tactics, I decided to pair Leadership with Knowledge to fill in some of it's weaknesses, namely lack of card draw and healing. This left me looking long and hard at Tactics and Spirit, which actually fit together quite nicely as well. So I built a couple of decks. Both have problems, though Tactics/Spirit has the most, mainly resulting from their complete lack of people. Also Horn of Gondor is a ghetto replacement for Steward of Gondor, but we make due with what we have. Here's what I came up with:\n\nLeadership/Knowledge\n\n1x Aragorn (L)\n\n1x Theodred (L)\n\n1x Berevor (K)\n\nAllies (24)\n\n3x Snowbourn Scout (L)\n\n3x Guard of the Citadel (L)\n\n3x Silverlode Archer (L)\n\n3x Miner of the Iron Hills (K)\n\n3x Daughter of Nimrodel (K)\n\n3x Gandalf (U)\n\n2x Faramir (L)\n\n2x Gleowine (K)\n\n2x Henomarth Riversong (K)\n\nAttachments (10)\n\n3x Protector of Lorien (K)\n\n3x Steward of Gondor (L)\n\n2x Forest Snare (K)\n\n2x Celebrian's Stone (L)\n\nEvents (16)\n\n3x Sneak Attack\n\n3x Valient Sacrifice\n\n3x Ever Vigilant\n\n3x Gandalf's Search\n\n2x Common Cause\n\n2x Lorien's Wealth\n\nComments\n\n\nLeadership is definitely the most 'wealthy' sphere and Knowledge brings an insane amount of card draw to the table, so they go together quite well. The spread of hero's is fantastic: Aragorn and Theodred work well together questing, while Berevor is a solid defender or a card drawing machine. Though there are a few uniques that have multiple copies (notably Steward), Protector of Lorien gives you something to do with the extras. Ideally you are looking to get Steward on Berevor ASAP in order to bump her production up and get the Knowledge side of your deck going. Plenty of solid combo's in the deck to mention here (Leadership is full of them), if you haven't take a look at this thread, it's a pretty decent look at some of the card interactions in this game's early life: http://www.boardgamegeek.com/thread/644768/lord-of-the-rings-combo-compendium. [http://www.boardgamegeek.com/thread/644768/lord-of-the-rings-combo-compendium.] There are also some crappier cards in the deck just by necessity, I would probably dump most of the action cards when better ones come along (aside from Ever Vigilant and Sneak attack.)\n\n \n\nTactics/Spirit\n\n1x Eowyn\n\n1x Legolas\n\n1x Gimli\n\nAllies (18)\n\n3x Gondorian Spearman (T)\n\n3x Veteran Axehand (T)\n\n3x Horseback Archer (T)\n\n3x Lorien Guide(S)\n\n3x Northern Tracker (S)\n\n3x Wandering Took (S)\n\nAttachments (12)\n\n3x Dwarven Axe (T)\n\n3x Blade of Gondolin (T)\n\n3x Horn of Gondor (T)\n\n3x Favor of a Lady (S)\n\nEvents (20)\n\n3x A Test of Will (S)\n\n3x Quick Strike (T)\n\n3x Blade Mastery (T)\n\n3x Feint (T)\n\n2x Hasty Stroke (S)\n\n2x Unexpected Courage (S)\n\n2x Rain of Arrows (T)\n\n2x Stand Together (T)\n\nComments\n\nFirst, the problems with the deck. The biggest problem is that both spheres are severely lacking in allies, especially inexpensive ones. There's no way I'd be using Northern Tracker (really really good but horribly expensive) or Wandering Took if I didn't have to, and I'd like even more allies in the deck. The fact that Tactics has 0 allies with any willpower is crap, hopefully that changes soon. It's going to be really tough to get the Spirit side of this deck going, but once you get a Lorien Guide or Northern Tracker you are really helping cover Tactics huge weak spot. Tactics also needs a solid defender ally that can actually block a couple of hits without dying, because Legolas and Gimli are attackers, period.\n\nSo, why even pair them together? Because even if you don't play a single Spirit card, Eowyn singlehandedly improves Tactics questing ability by leaps and bounds. Between her questing (and dumping your excess cards to boost her Willpower) and Legolas you should be able to quickly build up tokens without too much Ally support. Each hero has an item in the deck: Gimli has the Axe, Legolas has the Blade and Eowyn has the Horn (and Favor, to a lesser extent.) The Horn is mostly crappy, but if you can scrape up a few extra resource tokens out of it for Eowyn it's worth it. Hopefully something better comes along soon.\n\n \n\nSo that's what I've got so far, looking forward to what other people put together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457050","commentId":457050,"userName":"Bohemond2","timestamp":1303381336,"content":"some thoughts on the first deck, feel free to ignroe them if you disagree.\n\nFirst, I think you have too many 3+ cost Lore cards (and I am including Gandalf's search in that category), which makes you very dependant on Steward of Gondor  for resource acceleration.  I worry that your hand could bog down without it.\n\nIn practice, even in Lore heavy decks, I have fond Protector of Lorien to be less useful than I had thought it would be. I think you are better off, especially in a solo deck, with Dark Knowledge, since it allows you to know how to arrange your blockers and when to let an unblocked attack through. \n\nI know there is redundancy with the Henomarth, but Ithink you are much better off with Denethor than Berevor.  He is a better defender, and once you get his ability going you totally control the flow of the game.  He also synergizes quite well with the abilities of Aragorn and Theodred, because he identifies the turns when you don't want to untap, increasing your resources.\n\nLots of good ideas here.  I look forward to hearing about how these decks continue to evolve.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457055","commentId":457055,"userName":"Oshio","timestamp":1303381706,"content":"I don't disagree with you on the 3+ cost lore cards, but unfortunately at this point there aren't a lot of better options. Gandalfs Search is not really in there to dump a lot of resources in, more to just speed up the deck a little bit, even if it's just dropping 1 extra resource mid game to cycle through. It will be one of the first cards cut when there are better actions available.\n\nInteresting idea with Dark Knowledge, I will consider it. I'm going to run a few games with PoL, as I like the ability to dump my extra Uniques for something, but if I don't get much bang for my buck I'll swap it out for Dark Knowledge.\n\nKnowledge has some good heroes, because I was honestly torn between all three. I finally settled on Berevor due to her card draw capabilities which are frankly just awesome, but I certainly see the appeal for Denethor. I think I'll have to run a couple of games with each and get some data on it.\n\n\nThanks for the input!\n\n \n\nConnor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457075","commentId":457075,"userName":"Bohemond2","timestamp":1303385286,"content":"I would love to hear the results!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457089","commentId":457089,"userName":"Oshio","timestamp":1303387665,"content":"Got 2 quick games in against the second scenario with the Leadership/Knowledge deck. **** that scenerio is tough for a single player, almost unreasonably so. With multiple players to handle things while that nasty Hill Troll is out you can keep your head about you, but with one you really have to scramble.\n\nAnyways.\n\nFirst game was a disaster. Though I got my first turn Stewart after a mulligan I really didn't have much else I could do. I threw a blocker at the Troll and quested with Ara-dred combo but by couldn't do anything for damage to the Troll. Though the board was generally under control, the Troll's spillover damage shot my threat up and I hit 50 by turn 3. There was no card in the game that could have saved me.\n\nSecond game was much better. I didn't pull a SoG but I did get a Sneak/Gandalf in my opening hand, so I opted not to mulligan. This time I gave Aragorn a first turn Protector of Lorien, quested with Ara-dred, and threw Aragorn in front of the Troll. Thank god I gave him that PoL because the Troll got a +1 damage shadow card, but Aragorn took the whole attack and lived. I don't recall what happened next turn, but my threat raised a little, I dropped a Gandalf and did a big attack to the Troll and killed him. I was pretty much tapped out and took a little threat hit, but not nearly as bad as the last game.\n\nThings got smoother from there...I got out a couple Childs of Lorein and healed up, I got a decent card draw engine going and I got through the first part of the quest. The second wasn't too bad and I started making some progress. Finally I readied for a huge push to blast past the second part, complete with a double Faramir pumping, and...drew two Necromancers Reach. The board was almost completely cleared. I still got a bit of progress on the quest from Aragorn and Gandalf, but almost all of my support guys were down, and Theodred was gone as well. I took a risk and left one attack undefended that round and the shadow card gave them a huge boost, killing Berevor. In the space of 20 seconds I went from 'win was almost a lock' to 'Aragorn and 1 HP Faramir are alone against a horde of evil'. Needless to say I went down the next round.\n\nOuch.\n\nI'm looking forward to trying my 2 decks together in two player, as I really think the second scenerio is miles harder for solo play. Will update later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457103","commentId":457103,"userName":"sputang","timestamp":1303390470,"content":"CAlexander said:\n\nThough the board was generally under control, the Troll's spillover damage shot my threat up and I hit 50 by turn 3.\n\n\n\nIs this a special rule for the scenario?  I always thought excess damage was ignored.  Perhaps I've been playing this wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457109","commentId":457109,"userName":"apelite","timestamp":1303390862,"content":"sputang said:\n\nIs this a special rule for the scenario?  I always thought excess damage was ignored.  Perhaps I've been playing this wrong.\n\n \n\n \n\nIt's a special rule for the Hill Troll. And it hurts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457115","commentId":457115,"userName":"Apophenia","timestamp":1303391280,"content":"Since  your Lore hero is either Beravor that would make your starting threat 30. Nasty high starting threat. Many decks would have a couple of turns before they were forced to deal with the Hill Troll. But I guess that is the price you have to pay for starting with a bunch of awesome heroes.\n\nsputang said:\n\nIs this a special rule for the scenario?  I always thought excess damage was ignored.  Perhaps I've been playing this wrong.\n\n \n\n \n\nRead the Hill Troll card. It specifically says that excess damage increased your threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457120","commentId":457120,"userName":"sputang","timestamp":1303391630,"content":"Whoops.  Got it.  I've just been playing the intro scenario until I can build a deck that can defeat it regularly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45564-first-crack-at-deckbuilding/?do=findComment&comment=457217","commentId":457217,"userName":"Oshio","timestamp":1303404243,"content":"Swapped in Denethor and, first game, ended up pulling a monster in the opening setup, then the required hill giant, then another monster when questing. It was brutal. So not only did my threat shoot right up past 30 turn 1 due to not having enough Willpower, I also had to face the Hill Giant and 2 friends. Theoden died, but I actually managed to put up some semblance of resistance, getting past the first quest card before finally succumbing to the onslaught.\n\nI metaphorically flipped the table, but gave it another shot later.\n\nSecond game went much better and the card gods favored me with a very easy first few turns, allowing me to set up a sizable resistance by the time the Troll came. Though he took out one defender and bumped my Threat, I quickly Forest Snared him (such a great card) and rendered him helpless. The rest of the first Story card was pretty much a cakewalk, as I took my time setting up a solid ally base. Finally I finshed him off and moved on. The second story card started off good as well, but then the 'if you have 35+ threat, all of your guys take a wound' card came up and wiped out a few of my guys, which pushed me back a bit. But I had saved up some resources and managed to fill the board once more, forging past the second card and onto the third, which is blessedly easy in single player. Finished with a respectable score of 36 points, due to a Sneak/Gandalf during the last 2 turns of the game lowering my threat dial nicely.\n\nSo, after...um...5? games, I finally managed to beat the stupid second scenario. The third one is laughable for solo as you are automatically down a hero, but I may be masochistic enough to try it."}]}