{"url":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/","title":"[Rules Q] Wolf Rider","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=456996","commentId":456996,"userName":"ClydeCloggie","timestamp":1303374984,"content":"Wolf Rider's shadow effect states:\n\n\"Wolf Rider attacks the defending player. That player may declare one chracter as a defender. deal Wolf Rider its own Shadow card. After combat, return Wolf Rider to the top of the encounter deck.\"\n\nMy Q is about the phrase 'after combat'. Does this mean at the end of the combat phase, or after the single combat resulting from the fact that Wolf Rider attacks as per its shadow effect?\n\nIf the first, it is possible to attack Wolf Rider, kill it and send it to the discard pile before the last bit of its shadow effect kicks in.\n\nIf the latter, Wolf Rider will be back on top of the encounter deck after the player has defended its attack, and can therefore not be targeted by a player attack.\n\nMind you, with all the other nasties in the encounter deck, the second option may actually be preferable.\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=457013","commentId":457013,"userName":"Sky","timestamp":1303376395,"content":"I think the former is proper. You deal with one enemy, and suddenly he has companion out of nowhere :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]. If You kill it during Your attack phase, all kudos go to You and dead WR lands in the discard pile. If not, he does not forget about You, and awaits on the top of Encouter Deck :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=457028","commentId":457028,"userName":"Bohemond2","timestamp":1303378212,"content":"I would go with the former as well.  I read \"after the combat\" as referring to the combat phase.  It would have to read \"after the attack\" for the later interpretation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=457578","commentId":457578,"userName":"Iron-on Ghost","timestamp":1303469678,"content":"It's that pesky \"after\" again! It causes a lot of confusion when the phase, stage or action in question is not clearly defined. But in this instance I think Bohemond is right. The word \"Combat\" is almost exclusively used in reference to the Phase so it is safe to assume it is referencing the same in this case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=491113","commentId":491113,"userName":"xris","timestamp":1309086431,"content":"Are we any closer to a resolution of the Shadow effect for the Wolf Rider card?\n\nI don't think there is any official response concerning the card (maybe if the forthcoming FAQ update) but are there any other clues (such as, from the playtesters) on how it should be played?\n\nI believe the general consensus is that it attacks (with its own Shadow card) but it returns to the top of the Encounter Deck before the player may attack it. If so, then I assume that it is returned to the Encounter Deck after Step 3 \"Resolve Shadow Effect\" of \"Resolving Enemy Attacks\" of Phase 6 \"Combat\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=492003","commentId":492003,"userName":"Saramund","timestamp":1309226968,"content":"I would apply it as with the DOl Guldur Beastmaster ability (after he attacks he gets a second Shadow Card) or Cheiftain Ufthak.\n\nAfter WR attacks, he moves back to the staging area if the shadow cards didn't apply any shadow effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=492129","commentId":492129,"userName":"pumpkin","timestamp":1309247341,"content":"Saramund said:\n\n....he moves back to the staging area if the shadow cards didn't apply any shadow effects.\n\n\n\nThats a different card entirely, Wargs I think you are getting confused with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=492130","commentId":492130,"userName":"pumpkin","timestamp":1309247417,"content":"xris said:\n\nAre we any closer to a resolution of the Shadow effect for the Wolf Rider card?\n\nI don't think there is any official response concerning the card (maybe if the forthcoming FAQ update) but are there any other clues (such as, from the playtesters) on how it should be played?\n\nI believe the general consensus is that it attacks (with its own Shadow card) but it returns to the top of the Encounter Deck before the player may attack it. If so, then I assume that it is returned to the Encounter Deck after Step 3 \"Resolve Shadow Effect\" of \"Resolving Enemy Attacks\" of Phase 6 \"Combat\".\n\n\n\nThe general concensus, based on response to this thread at least, is that it is returned at the end of the combat phase and therefore after the player has had a chance to attack back.\n\nI've added this to the FAQ until the official FAQ determines otherwise"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45563-rules-q-wolf-rider/?do=findComment&comment=526537","commentId":526537,"userName":"player559363","timestamp":1315674643,"content":"My wife and I just ran into this issue yesterday.  We were in the 3 phase of the Anduin quest, and the wolf rider appeared as the result of a shadow effect.  We believe \"after\" means after the combat phase so players will have a chance to attack.  Do to the wording of the shadow effect we were unsure if the wolf rider always returns to the top of the encounter deck  However, as we thought through what would be most realistic (as if we were placing ourselves in the battle) it made most sense that if the players (heroes and their allies) were unable to kill the wolf rider, he may return for another ambush, however, if he is defeated, then he is discarded.  It simply didn't make sense that a wolf rider can continue to appear.  There would be no way of getting rid of the card, even if you did defeat it.  Furthermore within the context of the 3rd stage of the Anduin quest, you would never be able to win because he would continually and permanently be the last enemy."}]}