{"url":"https://community.fantasyflightgames.com/topic/45600-question-stand-together/","title":"[Question] Stand Together","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45600-question-stand-together/?do=findComment&comment=457390","commentId":457390,"userName":"Fishiste","timestamp":1303438272,"content":"Hi everyone,\n\n\"Action: Choose a player. That player may declare any number of his eligible characters as defenders against each enemy attacking him this phase\"\n\nHow does this card work in terms of damages?\n\nIf i have 2 characters with one defense each and play Stand Together on me.\n\nThe enemy has 4 attack, 2 of them are absorbed by the defense. Then there is still damages tokens to put on my characters. What should I do:\n\n- put 2 damage tokens on one of the 2 characters?\n\n- put 2 damages tokens on each of the characters?\n\n- put the 2 damages tokens on the characters as I want (one on each for instance).\n\nWe were not able to answer on one of the french forum... Thanks for answering this!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45600-question-stand-together/?do=findComment&comment=457408","commentId":457408,"userName":"pumpkin","timestamp":1303442963,"content":"IMO, it would be the third option, you can split the damage as you like, but there is nothing in the rules to support this. I certainly don't think you apply the 2 damage to each defender, but could see a ruling where damage has to be applied to a single defender (but in that case excess damage shouldn't spill over).\n\nActually, i think i may have just changed my mind, i think perhaps you apply the damage to a single defender but excess damage doesn't spill over onto the other defenders. Still nothing in the rules that covers this though, AFAIK."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45600-question-stand-together/?do=findComment&comment=457423","commentId":457423,"userName":"thearrow","timestamp":1303445543,"content":"If you have more than one defender then it is possible for both to sustain damage so I would have thought that the damage could be shared rather than all of it been  allocated to just one  defender."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45600-question-stand-together/?do=findComment&comment=457473","commentId":457473,"userName":"Iron-on Ghost","timestamp":1303456214,"content":"This is indeed a ruling that is not clearly defined by the rule book. The only reference to \"a single\" anything is when it says \"If an attack is undefended, all damage from the attack must be assigned to a single hero controlled by the active player \" (pg 18 of the LotR LCG rulebook). In the previous Paragraph it merely describes the event of a single defender. So at this point I would say all we have is speculation and I could throw in my opinion that it would make sense that the damage must be dealt to a single character that is participating in the \"Stand Together\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/45600-question-stand-together/?do=findComment&comment=457564","commentId":457564,"userName":"Watcher2","timestamp":1303467531,"content":"The Customer Service section has a place to submit a rules question. I've submitted this one for review. Though the last few answers seem reasonable, we might as well start identifying things that they'll want to include in the FAQ.\n\nBTW, the game is hard to find on the drop down menu. It's listed under \"THE Lord of the Rings: the Card Game.\" So if you want to submit a question look under T for \"THE\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45600-question-stand-together/?do=findComment&comment=457649","commentId":457649,"userName":"jhaelen","timestamp":1303475229,"content":"Fishiste said:\n\n- put the 2 damages tokens on the characters as I want (one on each for instance).\n\n\n\nThis, I think. There's nothing in the rules to contradict this interpretation.\n\nNote, that you can also decide to take two damage with one of both defenders, even if that defender only has one hit point left."}]}