{"url":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/","title":"Has anyone had success with the Lore deck?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457439","commentId":457439,"userName":"player666653","timestamp":1303450237,"content":"I can beat the first scenario solo with every other deck but not this one. It starts off with 30 threat so there is a lot of combat, but the best fighter is also the best questing character and unlike Aragorn you get 1 use of him!\n\nThe deck gives lots of draw and delaying abilities but either locations or monsters eventually overwhelm it. It feels like it's missing something as there is no point in lots of draw if you are not getting useful cards (except Gandalf of course.) The first chapter pack will have Bilbo for this deck but he has terrible stats and 9 threat (2 cards a turn though may be too hard to give up.)\n\nIs there something I am missing or should I avoid soloing with this deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457449","commentId":457449,"userName":"Acererak","timestamp":1303452423,"content":"Probably missing Protector of Lorien. That card has no limit in how many times can be used per round (usually overlooked). Since Lore deck has also quite a few ways to draw more cards, combine with Glorfindel and run through quests like crazy.\n\nForest Snare also helps a lot.\n\nHard deck to play solo though. But not useless at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457471","commentId":457471,"userName":"Eryx_UK","timestamp":1303455746,"content":"I've not managed to solo the Lore deck either. At present it's also just feels like a support faction in multiplay as well which doesn't make it all that interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457479","commentId":457479,"userName":"Acererak","timestamp":1303457155,"content":"Well, I just played a game with solo Lore deck against Escape from Dol Guldur and made it the furthest so far out of quite a few tries (managed to rescue poor old Denethor). Trapping the Nazgul helps a lot. So does Protector of Lorien. Allies are quite nice in this deck as well.\n\n \n\nBetter think twice before overlooking this deck! ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457490","commentId":457490,"userName":"pumpkin","timestamp":1303458994,"content":"The_Big_Show said:\n\nI've not managed to solo the Lore deck either. At present it's also just feels like a support faction in multiplay as well which doesn't make it all that interesting.\n\n\n\nThats how i feel about it too, it does seem like a great support deck.\n\nI'm determined to give it another go solo though until i have managed to work out the specifics of the deck. Each deck has its own strengths and I'd hate to think any of them aren't viable in solo play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457504","commentId":457504,"userName":"simpatikool","timestamp":1303460907,"content":"The Lore deck is the only one I have tried so far in this game. Have not gotten far though. I would add that my failure to complete is more due to uncertainty in rule interactions than anything else.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457582","commentId":457582,"userName":"SJBenoist","timestamp":1303469942,"content":"I actually think Lore is the strongest deck.\n\n \n\nProtector of Lorien is (IMO) broken, and no other deck can produce combos or \"power cards\" so reliably.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457596","commentId":457596,"userName":"CrowOfPyke","timestamp":1303470784,"content":"Acererak said:\n\nProbably missing Protector of Lorien. That card has no limit in how many times can be used per round (usually overlooked). Since Lore deck has also quite a few ways to draw more cards, combine with Glorfindel and run through quests like crazy.\n\nForest Snare also helps a lot.\n\nHard deck to play solo though. But not useless at all.\n\n\n\n \n\nForest Snare is good.\n\n \n\nBut I must admit that I also overlooked that Protector Of Lorien can be used more than once per turn.  Lore appears to be more about board control, and will take time to learn how to use this Sphere properly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457607","commentId":457607,"userName":"player666653","timestamp":1303471741,"content":"I just had my first success, Protector of Lorien was the MVP of the deck! I was trying to keep too many cards before, now using Loriens Wealth to draw I was throwing all my cards away to make huge progress on quests. I put it on Beravor so that I still had an attacking and defending character to keep the spiders away.\n\nThe diffent play styles of each deck is what amazes me about this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457627","commentId":457627,"userName":"pumpkin","timestamp":1303473391,"content":"SJBenoist said:\n\n \n\nI actually think Lore is the strongest deck.\n\n \n\nProtector of Lorien is (IMO) broken, and no other deck can produce combos or \"power cards\" so reliably.  \n\n \n\n \n\nBroken because it isn't limited to one use per round/phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457628","commentId":457628,"userName":"SJBenoist","timestamp":1303473683,"content":"Pretty much. \n\n \n\nIt would not be so bad if not for Lore's ability to produce so many cards so easily.  Being able to drop 7 cards on Glorfindel and have him Quest at a Willpower of 10 every other turn is just too good (IMO)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457637","commentId":457637,"userName":"pumpkin","timestamp":1303474284,"content":"I'm going to try the deck again, now I've seen PoL in a new light, but I wonder if this card will get updated via the FAQ to be use once per phase or something (which could tame it alot without making it an exhaust to use), but to be honest other than forest snare, without PoL this deck doesn't seem to have much going for it and that card almost seems to be critical to successful questing with the deck.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457639","commentId":457639,"userName":"jhaelen","timestamp":1303474543,"content":"I actually had the easiest time playing the Lore deck. The Spirit and Tactics decks are the ones that didn't work well for me.\n\nSpirit has too few allies, so if you get many enemies, you'll lose.\n\nTactics has too little willpower, so you have to rely on Legolas to get your progress tokens which means it's pure luck if you win.\n\nI've since put together different, two-sphere decks which all work a lot better for solo play than the pre-built ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457655","commentId":457655,"userName":"SJBenoist","timestamp":1303475722,"content":"5 important generalizations to remember with Lore: \n\n * Don't try to block or kill every Enemy.\n * Focus on gathering Progress tokens as quickly as possible.\n * Use healing to offset the damage you are taking from Engagements.\n * Let Denethor stop the nastiest thing on the board, and let the rest by.  (Use Forest Snare if it is too strong for him).\n * Use Breavor to draw cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457665","commentId":457665,"userName":"Apophenia","timestamp":1303476773,"content":"I put Protector of Lorien on Beravor and sent her questing. If the board was clear I also sent Glorfindel to help. However if there was something I needed to kill then I kept Glorfindel in reserve. He has both a Willpower and Attack of 3 so he is very versatile. Block with Denethor and then kill the monster with Glorfindel. If there are multiple enemies don't be afraid to let some of the damage through, you have lots of ways of healing damage.\n\nThis is probably slower then putting Protector of Lorien on Glorfindel and doing super questing but you can probably deal with Enemies better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457741","commentId":457741,"userName":"Oshio","timestamp":1303486705,"content":"pumpkin said:\n\nThe_Big_Show said:\n\n \n\nI've not managed to solo the Lore deck either. At present it's also just feels like a support faction in multiplay as well which doesn't make it all that interesting.\n\n \n\n \n\nThats how i feel about it too, it does seem like a great support deck.\n\nI'm determined to give it another go solo though until i have managed to work out the specifics of the deck. Each deck has its own strengths and I'd hate to think any of them aren't viable in solo play\n\n\n\nTactics is not at all viable in solo play. If you have a LOT of luck with Legolas you can get through the intro scenario, but that's only if you're lucky, and it doesn't stand a chance in the other scenarios (not that any of the decks have good chances against them solo). Having 0 Allies with any willpower is just brutal. Hopefully a few expansions changes that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457744","commentId":457744,"userName":"Apophenia","timestamp":1303487140,"content":"I agree with you that you have to be lucky to win with the Tactics deck, however...\n\nCAlexander said:\n\n \n\nHaving 0 Allies with any willpower is just brutal. Hopefully a few expansions changes that.\n\n \n\n \n\nBeorn has 1 willpower! Gandalf has 4 willpower! I totally use both of them for questing when playing Tactics. lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457807","commentId":457807,"userName":"pumpkin","timestamp":1303494690,"content":" \n\nGot much further on my latest attempts, when using PoL to its full potential, but still haven't beat the first scenario with Lore. It's a real pain that Glorfindel is the best attacker and quester, and its always a pain only effectively being able to one or the other well each round\n\nIts difficult to get any serious damage dealt with the deck (which to be fair isn't its forte), and despite a few forest snares coming to play (need 3 of those babies really..), due to the high threat of the starting heroes i keep finding myself being overwhelmed with enemies; Chieftain Ufthak is particularly troublesome!\n\nI will continue to try though\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457843","commentId":457843,"userName":"faith_star83","timestamp":1303501752,"content":"I had an easy ride to beat the Passage through Mirkwood with the Lore deck several times...but the tactics deck! It's so weak?!\n\nI just never had enough willpower to do any progress on the quests and thus locations kept stacking up in the staging area. The few enemies that turned up to allow Legolas to put quest-markers on the quest, were all buffered by the active locations (since you cannot ignore them with like a combined willpower of 4). Allies are few and number and have zero willpower.\n\nI really like the mechanic though, advancing quests by killing of enemies, but it just doesn't work if you draw 2-3 locations. I always end up with the staging area cluttered up with locations, denying any quest-attempts and thus raising  the threat level to 50 with lightning speed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=457854","commentId":457854,"userName":"DrNate","timestamp":1303504850,"content":" I almost had success with the Lore Deck. Gandalf got discarded from my hand and I believe that this is the only thing that killed me off. \n\nMy corruption was in the 40's, but I was at the second step of the quest and had ample allies in play. There were a lot of locations in play, I never drew many actual enemy cards. I did have Spawn, but he was thoroughly snared and ready to be killed when we got to the third quest.  \n\nI piled on the willpower, exhausted almost everyone, with the intent of flying past Fork in the road, and hoping for the \"Kill Ungolant's Spawn\" quest...Then drew the Treachery card that does one damage to every exhausted character. In that instant I lost two heroes, about five allies, and my willpower went from 12 to 5. I ate 5 corruption, my dial reached 50 and it exploded. \n\nI'm sure that if I had packed my deck with more Gandalfs, I would have won, somehow. Regardless, Lore isn't a bad deck. Just not quite to my taste the way Leadership is. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=458440","commentId":458440,"userName":"pumpkin","timestamp":1303652285,"content":"Finally got success against the intro scenario with the lore deck.\n\nI burned through the deck as quick as possible to get lots of allies and the table, and was helped by getting 2xPoL on the table early on too.\n\nI found Riversong's ability to be really useful in determining how best to play either the quest phase or the combat phase by knowing either the new staging card in the quest phase i was about to turn or what the shadow card on my worst engaged enenmy was about to be; he seems really useful in solo play. The multiple encounter cards on the go in multi player probably makes him less useful the more players there are\n\nAlso used Beravor's power more than i had in previous games and resisted using her to quest/attack in favour of picking up more cards. Once there's a PoL on the table, using her power to pull cards (and then burn those cards to defend or quest if needed) seemed a better strategy and i only used her for defending or attacking if the number of enemies i was engaged with really made it necessary.\n\nGonna give it another go tonight to see if it was just a fluke."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=458529","commentId":458529,"userName":"bharrington73","timestamp":1303671961,"content":"I found the ability to know what's coming is key to winning with Lore. Henemarth Riversong is quickly becoming one of my favorite characters. I always use him (or Denethor early on) before questing. That way I know exactly how much I need to commit to questing and how much I have to hold back if something nasty is coming.\n\nAlso, I tend to allow one enemy through, put the damage on Glorfindel and then heal it with a Daughter of Nimrodel or Self Preservation. That keeps Glorfindel free to attack any engaged enemies. Once you have multiple reusable heals on the table you can almost ignore most enemies.\n\nStep 1: What is coming?\n\nStep 2: How much damage can I heal this turn?\n\nStep 3: Figure out how many defenders you need to keep the total damage healable and the quest with everybody else.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=458649","commentId":458649,"userName":"scottindeed","timestamp":1303709120,"content":"I kicked ass with the Lore deck against the first scenario - and I was playing Protector of Lorien as discard 1 card, once per round - though re-reading the card i can see that its not necessarily so!\n\nI used Denethor's ability pretty much every turn to get a look at the encounter deck and plan accordingly.  I could then decide whether it was safe to quest or to hold back characters for combat, or whether I should just ditch the card and take a chance.  I would ditch the card rarely unless it was something really bad like Hummerhorns.  I also played Dark Knowledge on Denethor.  That way there were no surprises!  I used lots of card draw powers and abilities to get through the deck to find Gandalf as well.  Had so much Healing going on as well that my Heroes could soak up attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=458656","commentId":458656,"userName":"DerBarchen","timestamp":1303710848,"content":"I havnt tried this deck against the first scenario yet but it was quite effective in the second one. The only problem I have with it really is that its terrible at threat management. I think if you splice it with either Leadership or Spirit it should really pay off! Especially if you mix with discard recursion like stand and fight etc.\n\nTactics on the other hand requires luckyness, I got pretty far with it in the second scenario (further than with any other solo-sphere deck) but sometimes lose the first. I think the intention for all the decks in core set is to have the mixed with other spheres. Its probably why apart from Leadership they all run a little bad solo.\n\nIts impressive how different each sphere is though, if you really think about it its insane how much potential there is in each sphere!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45607-has-anyone-had-success-with-the-lore-deck/?do=findComment&comment=458813","commentId":458813,"userName":"Fieras","timestamp":1303732458,"content":"LORE is a lot of support.  Heals, and Draw for ally support mostly."}]}