{"url":"https://community.fantasyflightgames.com/topic/45647-encounter-deck-balance-and-group-scores/","title":"Encounter Deck balance and Group Scores","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45647-encounter-deck-balance-and-group-scores/?do=findComment&comment=457869","commentId":457869,"userName":"faith_star83","timestamp":1303509017,"content":"I can't help but feel that the scoring might be too random to actually give you a reliable number on the strength of your deck. At least if you have only one core set for construction (it's not enough to build reliable two-sphere decks, there just aren't enough cards).\n\nActually in general I feel that the encounter deck mechanism doesn't provide a very stable game experience. It's just too dependent on which cards you draw during staging, especially in the early game. I played the Journey down the Anduin scenario three times so far and two times I had really broken starts.\n\nOnce, I turned up a Marsh Adder in the set-up phase, added the Hill Troll and got me a Wolf Rider followed Chieftain Uthak in the first staging phase. Sure these enemies remain in the staging area for a while, but facing three of these bad boys in the first round makes questing and battle really difficult.\n\nIn general I feel the difficulty varies rather strongly according to what you draw of the encounter deck. Sometimes you don't even get victory points. Sometimes you get a really easy run and sometimes you're just overwhelmed no matter ow strong your decks.\n\nI do love the game and think it's very fun, but I didn't expect the game experience to change so drastically from game to game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45647-encounter-deck-balance-and-group-scores/?do=findComment&comment=457901","commentId":457901,"userName":"Widowmaker93","timestamp":1303515114,"content":"yeah when you are playing solo the game experience can change quite a bit from game to game. journey down the anduin is the biggest culprit in this aspect. it does scale really well to 3 or 4 players however. feels very \"epic.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/45647-encounter-deck-balance-and-group-scores/?do=findComment&comment=457969","commentId":457969,"userName":"jhaelen","timestamp":1303541605,"content":"faith_star83 said:\n\nI do love the game and think it's very fun, but I didn't expect the game experience to change so drastically from game to game.\n\n\n\nI actually kinda like this. Combined with the short game time it allows for excellent replayability. In solo play you usually don't see a lot of the cards from the decks, so it takes a while unitl you know what to expect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45647-encounter-deck-balance-and-group-scores/?do=findComment&comment=458191","commentId":458191,"userName":"prune","timestamp":1303584158,"content":"jhaelen said:\n\nfaith_star83 said:\n\nI actually kinda like this. Combined with the short game time it allows for excellent replayability. In solo play you usually don't see a lot of the cards from the decks, so it takes a while unitl you know what to expect.\n\n \n\n\n\nAgree completely.  Yes the score on one game is not a good \"objective\" measure of how good your deck is or how well you play the game.  But on the other hand, a scenario can still give you some surprises even after you play it several times.\n\nI'd rather have the unpredictability, myself."}]}