{"url":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/","title":"Deck list that doesn&#039;t have useless cards using only one core set...?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/?do=findComment&comment=457871","commentId":457871,"userName":"vermillian2","timestamp":1303509428,"content":"so... I'm trying to put together a 'viable' deck using just one core set. That would mean a 50 card deck. ... I'm always winding up short. I tried purple red deck dwarf theme (so the dwarf axes help out), but I run out of cost effective cards in purple (as there is just one dwarf in purple, so I figure I'd be low on funds for purple cards)... I've tried a red, green deck, but it wound up being horrible... perhaps cause I went two red heroes one green...\n\nAnyone have a deck list yet, that doesn't fail hard, for two colors, 50 cards? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/?do=findComment&comment=457877","commentId":457877,"userName":"qwertyuiop","timestamp":1303510215,"content":" Proxy a 3rd Blade of Gondolin and see if it helps any. To do so, take a copy of Gandalf's Search from your Lore deck, flip it so the card back is facing you, then sleeve along with your deck.\n\nCrappy card/resource disadvantage cards aside, try a spirit/tactics deck. There are spirit allies who help with locations, and Legolas or Gimli might prove a good addtion.  If you had multiple core sets, I'd suggest Leadership/Spirit using Aragorn, Celebrian's Stones, Steward of Gondor,  Sneak Attack(maybe), Snowburn Scout, Noble Sacrifice, and 1x Faramir.  It deals with locations well, helps generate resources, and adds a little draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/?do=findComment&comment=457878","commentId":457878,"userName":"vermillian2","timestamp":1303510420,"content":" Spirit is blue right? I have not tried a blue / red deck yet. You suggest one red, two blue heroes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/?do=findComment&comment=457881","commentId":457881,"userName":"qwertyuiop","timestamp":1303510715,"content":"There are good offensive and questing values for red/blue. If i were to build a deck with those two factions I would use Eowyn, Dunhere, and either Legolas or Gimli.  The purple/blue I mentioned with Aragorn might be stronger.  Celebrian's Stone and Aragorn work well, since the stone gives Aragorn a Spirit(bue) Icon, if he has it attached. So he basically becomes a dual land. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/?do=findComment&comment=457884","commentId":457884,"userName":"faith_star83","timestamp":1303511713,"content":"I also bought one core set only and tried to build good 50 card decks, but I think there's just not enough cards...quite disappointed. sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif] The core set really is more of an introductory set I guess and we have to wait for 2-3 adventure packs to build solid 50 card decks I guess.\n\nI just build smaller decks than 50, using two spheres and adding only the cards I want / need. I am certainly not going to spend another 40 bucks on a core set and end with more than 50% of redundant cards. It would be so nice if ffg would provide some solution to this...but I don't think it is in their interest to do. t does take some of the pleasure though, since I was really looking forward to deck building, but had to realize there is only very little deck building with just one core set. Guess that's how we're forced to buy expansions....can't wait for them! lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/?do=findComment&comment=458409","commentId":458409,"userName":"Oshio","timestamp":1303646986,"content":"The core set is as advertised: a core set. While I really, REALLY think it could have used 40 card decks instead of 30 and allowed for single sphere legal decks out of the gate, that wasn't what they decided to do. I would, however, recommend a second core set. Online you can get it for 20-something dollars and turning all those 2x cards into 3x is huge, not to mention giving you a couple of the powerful uniques. 3x is certainly overkill as there are only a few 1x cards, and even fewer that are worth including, but I've found the second to be worth it. Your mileage may vary.\n\nOn the plus side, there is some deckbuilding fun to be had with 2 sets combining spheres. Though there is certainly a resource disadvantage unless you are using Leadership (who has access to the uber powerful Steward of Gondor), it at least allows you to have some fun and start testing the waters.\n\nThe bad thing is we're not going to be able to have any major deck building for several months. I'm a little uneasy about the majority of each expansion being new quests...maybe every other expansion, but every single one? I would prefer more deck variety to more quest variety, and I'm really hoping they change their strategy. They have already said there will only be 9 new cards per expansion, and spread out among the spheres this is, on average, 2 cards per sphere, some of them bound to be unique. That's 1 expansion until a single sphere is playable using all of their cards, but many expansions before we have any real options. Oh well, after this arc they might re-examine their strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45648-deck-list-that-doesnt-have-useless-cards-using-only-one-core-set/?do=findComment&comment=458431","commentId":458431,"userName":"Ahzrab","timestamp":1303650600,"content":"Well we got two core sets, despite that I would recommend lore/leadership (2 lore heroes and aragon) or leadership/spirit (1 spirit hero/ and 2 LS heroes). Lore and Leadership have the only 1 cost characters and also the most characters in the game right now.\n\nBtw I'm sad that I share the core set copies with a friend and took spirit/tactics, because they have huge problems with questing (aka no good combo synergy)."}]}