{"url":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/","title":"Is this game hard or is it just me? What&#039;s your best score?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=457941","commentId":457941,"userName":"FiendishDevil","timestamp":1303528140,"content":"Did Passage Through Mirkwood two times. First playthrough used the standard purple deck (Aragorn and company with one core set) -- didn't make it. Second play through I custom built a purple and blue (from three core sets). Final score? 10. Would have been 8 if I didn't let my Aragorn take damage.\n\nI'm finding the game to be fairly difficult, I can imagine that multiplayer would make things a little easier, but still hard. Definitely finding purple and blue to have the best combos. The ability to have card recursion and Sneak Attack on Threat Reducers like Gandalf and that one blue card definitely can get broken. Over the course of two turns I was able to lower my threat by a whopping 17 -- Not even the Forest Spiders would force encounter me.\n\nHaven't tweaked much yet with red and green -- but I'm thinking green is really weak.\n\n \n\nGame is hard because frankly...there's really not many options in the core set. Also, I am not a big fan of the way they distributed the cards. I originally bought 2 core sets so I could support 4 players -- but that didn't even give me 3 copies of each -- so I went out and got my 3rd core. I thought they would have learned that 3 copies of each card should be standard... I know they are going to release a revised core with 3 copies of each in the future or pull a Warhammer and release reprints of core cards in future big box expansions.\n\n \n\nHopefully I'll be able to play some multiplayer tomorrow...we'll see how it pans out.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=457977","commentId":457977,"userName":"pumpkin","timestamp":1303542011,"content":"I've only played with mono decks so far and some decks have faired better than others (leadership seems powerful, lore less so)\n\nWhat do you refer to with regards to what FFG did with Warhammer and deluxe expansions? Did they use a deluxe expansion to bring the core set up to 3 of each player card from the core set? Which expansion?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=457979","commentId":457979,"userName":"faith_star83","timestamp":1303542389,"content":"hm...I can see how it would upset people who bought 3 core sets if there were some reprints in the future, but I thought about this, too and  would love it if ffg would steadily provide us with playsets of the core set cards by including one or two reprints in the adventure packs. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nLeadership combos are great, but I didn't think Lore was weak at all! The card drawing engine + Protector of Lorien is sick! And also healing can be quite nice from time to time...I think all the spheres have their strengths. But I feel tactics is a bit on the downside when it comes to questing...it seems very weak against a location heavy run-through..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458027","commentId":458027,"userName":"Titan","timestamp":1303555408,"content":"For the time being, it looks as though the Lore deck is good with control and support, but perhaps not so good with characters in combat. It certainly is begging to be mixed with another sphere that covers up it's weaknesses. On the Warhammer subject, I have all the packs and expansions and there is no reprint of core cards that I've seen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458083","commentId":458083,"userName":"SJBenoist","timestamp":1303564328,"content":"How are you calculating your score?\n\n \n\nI don't think \"8\" or \"10\" is possible, especially since Aragon alone will cost you 12  ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458086","commentId":458086,"userName":"Cabello","timestamp":1303565188,"content":" with threat reduction it is. i had a score of negative 7 with that deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458087","commentId":458087,"userName":"Cabello","timestamp":1303565188,"content":" with threat reduction it is. i had a score of negative 7 with that deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458098","commentId":458098,"userName":"SJBenoist","timestamp":1303567824,"content":"We must be calculating score very differently.\n\n \n\nAs I understand it, you add the final Threat value of your dial, 1 for every wound marker on a Hero, and the Threat value (again) for every dead Hero.\n\nThen you subtract any Victory Points earned from cards.\n\n \n\nThis would make the lower 30's a very good score. \n\n \n\n \n\nIf you are starting with the 3 heroes from the Tactics deck, your score in turn 1 would be 29.  I don't think there are enough threat reduction cards in any possible combination in the game to get you to -7, even if you win in the first turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458101","commentId":458101,"userName":"Cabello","timestamp":1303568871,"content":" that is exactly what i did. by the end of the game i had managed to reduce my threat dial to 1, then after netting out wounds and victory points i got that score"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458102","commentId":458102,"userName":"SJBenoist","timestamp":1303568930,"content":"I think your score is mathematically impossible.  \n\n \n\nCould you describe how that happened? \n\nWhat card did you use and how many turns did your game last? \n\n \n\nFor example, at the end of the first turn alone, you have a score of 30 if you didn't take any damage.\n\n \n\nWhat card let you drop 29 points of threat?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458103","commentId":458103,"userName":"Cabello","timestamp":1303569062,"content":" gandalf reduces by five, and they have an even that reduces by 6, they also have an event that allows you to play an ally from your discard and another that lets you shuffle your discard back into your deck. this allowed me to play those cards many times. this is also with the standard deck from one core set vs mirkwood."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458106","commentId":458106,"userName":"SJBenoist","timestamp":1303569293,"content":"Cabello said:\n\n \n\n gandalf reduces by five, and they have an even that reduces by 6, they also have an event that allows you to play an ally from your discard and another that lets you shuffle your discard back into your deck. this allowed me to play those cards many times. this is also with the standard deck from one core set vs mirkwood.\n\n \n\n \n\n \n\nIf you play Gandalf 3x, that is only 15 Threat ... and you would need at least 3 turns to do it, which ADDS 3 Threat, so that is a net of -12.\n\n \n\nThe Elf card brings you to -17 (-6 + 1 more turn).  If you play it 3x, you are still at -27.\n\n \n\nThat isn't enough to even cover the 1st turn of the game in Threat, and would take at least 4 turns to play (probably more, I haven't even bothered to count the Resources needed)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458108","commentId":458108,"userName":"Cabello","timestamp":1303569491,"content":"in the game i played by threat did not go up hardly at all, then again it also took me a while to make progress for the first part of the game. it was a long game, but i had good control the entire time. i also had at least 9 points from creatures. but i played each of those cards quite a few times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458109","commentId":458109,"userName":"SJBenoist","timestamp":1303569604,"content":"You are not understanding me.\n\n \n\nIt doesn't matter how your game went.  There is no combination of cards that will give a -7 score.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458110","commentId":458110,"userName":"Cabello","timestamp":1303569669,"content":" you forget the one that shuffles your discard back into your deck, therefore the entire thing is recursive indeffinately"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458112","commentId":458112,"userName":"SJBenoist","timestamp":1303569785,"content":"No, you do NOT reshuffle your discard pile into your deck.\n\nSee page 12 of the rulebook.\n\n \n\nEven using the appropriate cards, I'm confident your score isn't going to happen EVER.\n\n \n\nEither there was a mistaken in the calculation, or you are trolling me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458114","commentId":458114,"userName":"Cabello","timestamp":1303569826,"content":" there is an event that does that. its a 1 rsource cost. forget its name"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458116","commentId":458116,"userName":"SJBenoist","timestamp":1303569952,"content":"Which deck are you using?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458118","commentId":458118,"userName":"Cabello","timestamp":1303570424,"content":" the blue one i think? i played all the deck in quick order one after another so im not entirely sure atm. also not at home so i cant check just now. but i deff can when i do to get you the exact names of the cards i am referencing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458151","commentId":458151,"userName":"scottindeed","timestamp":1303574243,"content":"I was definitely surprised at how difficult it was, but i've only been using the mono decks straight out of the box so far.  I started with the Tactics deck, but had great difficulty making progress on the quests on the first scenario.  On the first scenario, if you end up with Beorn's Path (as I did), you'll have a total of 20 progress points to achieve in 21 turns (as starting threat is 29).  Even with some Gandalf threat reduction, its very unlikely.\n\nI next tried Spirit and made better progress, but ultimately got overwhlemed by enemies.\n\nI beat the first scenario today though with the Leadership deck.  I ended up with loads of Allies out, and then with Faramir, the deck ends up as a questing beast.  Using Theodred and Aragorn questing together you can give Aragorn the Resource token from Theodred, and then use it to ready Aragorn again every turn.\n\nI then took my successful Leadership deck down the Anduin in the second scenario, but ended up with too many location cards building up that I couldn't shift.  I could see Spirit doing well on the second scenario.  There's Allies in the Spirit deck that make progress on locations still in the staging area whenever you quest which would be very useful in the game i had.  Dunhere would also be able to snipe at the enemies building up along the river banks.  I'll give it a try tomorrow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458176","commentId":458176,"userName":"Kiwina","timestamp":1303579203,"content":"SJBenoist said:\n\nWhich deck are you using?\n\n\n\nCabello said:\n\n\nthe blue one i think? i played all the deck in quick order one after another so im not entirely sure atm. also not at home so i cant check just now. but i deff can when i do to get you the exact names of the cards i am referencing.\n\n\n\n \n\nThose cards are in the spirit deck (blue)  I got a 2 (my best score so far) with the Spirit deck using those cards as well.  First, the three Spirit heroes only have a total threat value of 24.  I used The Galahdrim's Greeting (it costs 3 and reduces your threat by 6) 3 times.  There are only two copies of that card, so I did have to use Dwarven Tomb (it costs 1) to get it back in my hand once.  I used Gandalf's (he costs 5) threat reducing ability 3 times.  I had to use Stand and Fight (it costs x, where x=the ally's cost) to use Gandalf that many times.  I also got victory points from the Hummerhorn (Victory 4).  It is possible to get that low even with including the turns it takes to acquire the resources. (The Galahdrim's Greeting is -6 +1 [for the turn you played it] = -5,  Gandalf is -5 +2 [turns to collect resources for him] = -3)  My hand also worked out well enough that I made progress every quest, and none of my heroes were damaged.\n\nI never ended up using Will of the West (it lets one player reshuffle their discard pile into their deck) because by the time I had gotten it I was using my Stand and Fight cards on Gandalf.  That deck also contained only one copy of Gandalf.  If there had been three Gandalfs in that deck it would have been possible to use Gandalf at least six times, once for each copy of Gandalf and once for each copy of Stand and Fight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458184","commentId":458184,"userName":"FiendishDevil","timestamp":1303582155,"content":"Warhammer reprinted Innovation in the Dark Elf/High Elf big box expansion. IIRC there may have been more reprints.\n\n \n\nI'm a little ticked off. I threw in 3 copies of every green card and 3 copies of gandalf and I couldn't get a 50 card mono green deck -.-\n\nI suspect this is the case currently where it is impossible to build a 50 card mono colored deck using the 3 card limit.\n\nI have 4 decks built, blue/purple, purple/red, red/blue, and mono green.\n\n \n\n \n\nI achieved a score of 10 with blue/purple running Aragorn,  Theodred, and Dunhere (Initial threat 28). 1st turn I managed to get Celebrian's Stone onto Aragorn netting him a total of 4 willpower. As well as giving him blue resource icon. Every turn, I was therefore able to use the Aragorn/Theodred combo to commit both to the quest (5 willpower), giving Aragorn 1 resource, then spending it to untap Aragorn so I could use him in battle phase. This is huge for efficiency.\n\nI was able to quickly get out Steward of Gondor as well, which vastly helped my game. 5 resources a turn is very big. Snowbourn Scouts made for defensive fodder and easily blazing through locations, combined with Stand and Fight for easy/cheap recursion. Valiant Sacrifice also made for a mini-draw boost with this combo.\n\nOne turn I lowered my threat by 17 using The Galadrims Greeting then playing Dwarven Tomb to fish it back and play it again, then using Sneak Attack for a Gandalf during the quest phase. Total resource cost: 3 +1 +3 +1, which was only 1 turn of saving to pull off that combo.\n\nWith my threat lowered, I was able to use Dunhere to snipe creatures in the staging area, they never had to engage me. I was able to easily net 5 victory by killing that mosquito thing with one attack.\n\nKilling the boss spider was really easy -.- Dunhere sniping + Gandalf/direct damage in battle phase finished it off.\n\n2 damage on Aragorn + 28 initial threat + 8 turns - 18 (3 Galadrims Greeting) - 5 (1 Gandalf) -  5 victory = 10 points\n\nAdmittedly, I had a great opening, lucky draws, and the enemies never really gave me trouble. I was also able to limit the bad elements of the encounter deck with Hasty Stroke and Test of Will (cancel Shadow and Revealed Effect) -- taking only the events that weren't as harmful.\n\n \n\nHope that helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458243","commentId":458243,"userName":"vermillian2","timestamp":1303602431,"content":" Yeah Blue seems kinda strong with the threat reduction... Probably won't help with the second encounter deck! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45655-is-this-game-hard-or-is-it-just-me-whats-your-best-score/?do=findComment&comment=458266","commentId":458266,"userName":"qwertyuiop","timestamp":1303611523,"content":"SJBenoist said:\n\nNo, you do NOT reshuffle your discard pile into your deck.\n\nSee page 12 of the rulebook.\n\n \n\nEven using the appropriate cards, I'm confident your score isn't going to happen EVER.\n\n \n\nEither there was a mistaken in the calculation, or you are trolling me.\n\n\n\n \n\nI've decided to call you \"Beautiful Mind\", but it's good clean fun so don't get riled.   Having said that, Will of the West allows you to shuffle your discard back into your deck.  Stand and Fight turns a deck with 3x Gandalf into a potential deck with 6x Gandalf(as long as one actual Gandalf has made it to the discard pile before SaF is played).  Dwarven Tomb lets you fetch a Spirit card from your discard. It's still fairly improbable that a negative threat can be achieved in a solo game. Dunhere would almost have to have Unexpected Courage played on him very early(hopefully turn 2), followed by a Northern Tracker or Silvan Scout.  A Galadhrim's Greeting played first turn keeps most things from engaging. Lucky draws early on from the encounter deck help, too. It's doable so long as allies can take care of locations and Dunhere swings twice a turn into the staging area."}]}