{"url":"https://community.fantasyflightgames.com/topic/45667-keyword-protected/","title":"Keyword : &quot;Protected&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45667-keyword-protected/?do=findComment&comment=458029","commentId":458029,"userName":"Dncan","timestamp":1303555437,"content":"The explanations in the rulebook seem to me to be quite vague...\n\n \n\n\nWhile entering the game...\n\nIf you draw a protected objective, then you reveal and attach the next card of the encounter deck to the objective. If another objective card comes up while attaching a card for the guarded keyword, place the second objective in the staging area, and use the next card of the encounter deck to fulfill the original keyword effect.\n\nFirst of all, I suppose that the objective and its protection count as one card in the staging area (\"place them both\"), therefore in a 3-player game, if I draw an objective, I draw the next encounter card and attach it to the objective, and then I still have to draw two more cards. Right ?\n\nNext what about the \"double objective\" case, when I get another objective while drawing for a first one ? It is said to place it in the staging area, I suppose it is placed apart from the first one ? After all, we could decide that there could be two objectives protected by the same card...\n\nAnd if the objectives are separated, once I've drawn another card to fulfill the first keyword, I suppose (again) that I have to draw still another card as the protection for the second one ?\n\nAnd what about the number of encounter cards still to be drawn ? 3-player game, first card = objective. I draw the next one : another objective. i place it in the staging area, I draw the next one and attach it to the first objective, then I draw a fourth one that goes to the second objective. And now, do I have to add one or two more encounter cards to the staging area ? And what if these weren't the first encounters of the turn, but occurred after two \"normal\" ones ? Do I still place a fourth obstacle in the staging area with this second pair objective+protection, or do I discard them or shuffle them back in the encounter deck ?\n\n\nAbout the resolution, it's a lot more easier to understand, but there is still a little interrogation...\n\nIf the objective is protected by a Treachery card, the effect of this card applies immediately or it is cancelled, and the card is discarded. The objective becomes automatically accessible, in the staging area. This is OK.\n\nIf the objective is protected by a Location card, either it is explored without having been moved, or it has been travelled to and brought near the Quest card, which still is part of the staging area. When the Location will be discarded, the objective will become accessible, and wether it is with the other encounter cards of the staging area or in the \"active location\" area doesn't really matter since objectives don't have a threat cost (at least for the ones in the core set).\n\nNow...\nIf the objective is protected by an Enemy card. It is said that the encounter card is discarded as usual when the enemy leaves the game, either by being defeated or as the result of a card effect. But this will occur mostly in the play area of a player, after an engagement, and not in the staging area anymore.\nThe question is, is any player able to get this objective (by complying to the condition given on the card), or only the one the enemy was engaged with ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45667-keyword-protected/?do=findComment&comment=458182","commentId":458182,"userName":"Kiwina","timestamp":1303581527,"content":" First, I think you are correct.\n\nNext, with the \"double objective,\" I think all objectives have to guarded by something, so you would draw an encounter card for the second objective.  On that same note, I don't think the second objective or the card guarding it counts toward the one card drawn per player.  They are a bonus threat from the encounter deck.  So in a 3 player game, if you draw an objective then draw a second objective for the \"Protection\" draw; you will draw a card to protect each of the objectives, and that would all count as one card drawn for a player.  That leaves two cards needing to be drawn.\n\nWith resolution.  I believe when you kill the enemy guarding the objective, the objective returns to the staging area where it can be claimed by any player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45667-keyword-protected/?do=findComment&comment=458302","commentId":458302,"userName":"Dncan","timestamp":1303619219,"content":"Hello,\n\n \n\nI asked these questions here and also on the french edition forum, and you are giving me the exact same answers. So you must be correct.\n\nThank you aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45667-keyword-protected/?do=findComment&comment=458399","commentId":458399,"userName":"qwertyuiop","timestamp":1303644813,"content":"Dncan said:\n\nHello,\n\n \n\nI asked these questions here and also on the french edition forum, and you are giving me the exact same answers. So you must be correct.\n\nThank you aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]\n\n\n\n \n\nBecause the French have never been wrong. Not once. Not ever.lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45667-keyword-protected/?do=findComment&comment=458624","commentId":458624,"userName":"Dncan","timestamp":1303703865,"content":"qwertyuiop said:\n\nBecause the French have never been wrong. Not once. Not ever.lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\n\n\nbostezo.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/bostezo.gif]\n\nNope. Because that's two official forums where I get according answers. Chances that both are wrong in the exact same way at the same time are weak, aren't they ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45667-keyword-protected/?do=findComment&comment=458659","commentId":458659,"userName":"DerBarchen","timestamp":1303711459,"content":"My sources say you are correcet. My sources being the way I understood the rules =P"}]}