{"url":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/","title":"Scenario 2 - How to beat it? (Solo Play)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458221","commentId":458221,"userName":"faith_star83","timestamp":1303593279,"content":"Guys,\n\nI'm really losing my nerve here. I just can't beat Scenario 2! I tried all kinds of decks / hero combinations and played easily 12 times so far. It's really frustrating.\n\nThe closest I got to success is with a tactics / spirit deck (using Gimli, Eowyn and Dunhere) but even then I never manage eventhough I defeated two Hill Trolls in a row. The main killers are usually:\n\n1) Hill Troll\n\n2) Surge creatures\n\n3) Evil Storm\n\n4) The Brown lands\n\n5) Cluttering up of locations making questing impossible.\n\nFirstmost I already think the set-up pretty tough:\n\nI turn up 1 card from the encounter deck, look for the Troll. This usually leaves me with two cards in the staging area even before I start out. The I start questing and turn up another card, so by the time questing resolves I already have/had to deal with 3 encounter cards. Often I hit a surge creature that hits another creature or one of the nastier locations. And that's only turn one and I still have to deal with the troll!\n\nOnce I hit - barely alive - the second part of the quest. Enemies and locations start to clutter up the staging area and make it difficult to quest and fight/defend.\n\nThen it goes on:\n\n1) Beating that freak without Gandalf's help usually leaves all my heroes barely alive and uses up my resources.\n\n2) These babies all to often clutter up the staging area and make it hard to quest because there are a) too many enemies b) too many locations.\n\n3) After beating the troll I always end with more than 35 somehow (if not Pursued by Shadows does)...and I usually lose one or two heroes / allies to this one.\n\n4) This card always shows up after I already travelled somewhere anyway and can't deal with it right away, making questing impossible and raising the threat bar incredibly fast. Gladden Fields is usually not so far away, too. My Northern Tracker is already buried since I had to deal with Trolls and surgers.\n\n5) Especially in the second part of the quest this gets a serious issue.\n\nWell, so I just set out to venture down the Anduin again, but faced a Hill Troll, Eatern Crows, Dol Guldur Orcs and an Enchanted Stream after the questing phase and just lost my motivation.\n\nSo I am really frustrated right now and just wanted to know if I am too stupid to play this game or anybody else has had similar experiences.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458227","commentId":458227,"userName":"prune","timestamp":1303597053,"content":"I beat it my first time through total dumb luck.  \"When Revealed\" cards that impacted nothing because my threat was too low, locations drawn as shadow cards, you name it, everything went right when it came to drawing from the encounter deck.  Deck was Tactics (Legolas & Thalin) plus Spirit (Eowyn), I think the low initial threat (27) was a big help.\n\nSince then, I've played it a couple of times (Tactics + Spirit, or Leadership + Lore) and never even got close to completing it.\n\nI'm almost wondering, because of the need to manage your threat (the troll and the race down the river can both really inflate your threat) and the need to heal damage (lots of cards that do damage out of combat, and some ugly monsters), if a Spirit / Lore deck might do better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458229","commentId":458229,"userName":"Widowmaker93","timestamp":1303598317,"content":"Yeah that one is really tough and nearly impossible in solo play unless EVERYTHING goes your way. Out of the 3 it is the hardest for solo play. It does scale really really well to 3 and 4 players though. You really need all 4 decks running at the same time to have the best chance and even then it involves a lot of luck and good draw/play on the part of the players. Those hill trolls are nasty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458247","commentId":458247,"userName":"SerAndrew","timestamp":1303603244,"content":" One thing that's particularly nasty.. be careful when you finish the river part (2b) of the quest. If you've committed everyone to questing and move on to the last stage, enemies can engage again.. So if you've let a crapload of enemies in staging, you'll get slaughtered. I made the mistake but luckily I had enough resources to play Grim Resolve and readied everyone. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458290","commentId":458290,"userName":"DerBarchen","timestamp":1303617813,"content":"I suggest trying a multi-sphere deck, maybe spirit and leadership? With lots of Sneak Attack and discard pile-reuse you could just bounce Gandalf in and out of play Many times ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThat said I havnt tried that yet, thats just the deck I made after losing to the scenario 3 times in a row. I was goign to test play it later today so Ill let you know how it goes =P"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458292","commentId":458292,"userName":"Deleriad","timestamp":1303618100,"content":" I've tried this a few times and never yet got to the third quest. It is horribly hard. My next idea is a tactics & lore or Leadership and lore deck. The thing is a huge combat fest as far as I can tell. Nigh on impossible to get out from under the hill troll without a lot of wounds. Leadership and lore might work because leadership can generate the extra resources to help pay for all the healing. I suspect though that I'll just get mullered at the ambush.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458310","commentId":458310,"userName":"apelite","timestamp":1303620485,"content":"I've had success with my Gimlore (Glorfindel, Beravor, Gimli) Lore/Tactics deck (with basically all the core cards except the expensive Tactics ones and no Rain of Arrows).\n\nI let the troll hit Gimli first round to get his blood up and then use feint or forest snare to stop the thing attacking again. Gimli should kill it in a couple of rounds.\n\nThen the journey down the Anduin can take a while, but the key is to pull as much as you can into engagement and let Gimli hit them, while everyone else is concentrating on questing (the big danger with Gimli hanging on 4 damage is the Evil Storm encounter card, so you might want to heal him a point). There's no need to rush the second quest, but you have to make sure that when you leave the boat that there are as few (preferably none) enemies as possible on the stage, or you have a snare and a couple of cannon fodder handy. With Lore's card churn, with a bit of luck you can get ahead of the game and actually prepare for the moment when you have to leave the boats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458316","commentId":458316,"userName":"faith_star83","timestamp":1303622118,"content":"Thanks for all the contributions! I feel kind of relieved, that everybody has a hard time not only me!\n\nI finally did it though: I decided to give it another go with the Gimli, Eowyn and Dunhere deck. And I breezed through the quests with ease this time.\n\nI even only one Veteran Axehand (ally) and I ended up with an used unused Gandalfs on my hand (I used him three times anyway thanks to Stand and Fight gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]).\n\nWhat did the trick? I had Gimli with Dwarven Waraxe and 4 wounds for massive damage against the troll and then picked up Unexpected Courage and a Citadel Armor on my way. Add Feints and Quick Strikes to the mix and you can imagine what a warmonger Gimli became. Dunhere did his share to the weaklings in the staging area and I used Eowyn and Gandalf for questing.\n\nI even shrugged off a second Hill Troll (Feint) and Chief Uthak (Quick) without ever getting wounded. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nScore: 30 + 0 + 9 = 39 -18 (2x Hill Troll, Chief Uthak, 2x Gladden Fields) = 21\n\nWhat I realized: I didn't turn up one Brown Lands, which probably helped keep my Threat down (along with Gandalf and The Galadhrim's Greetings).\n\nAs for the strategy: I guess it's really important to quest and get rid of locations as wes as enemies so the Threat doesn't rise to quickly. And I guess you need loads of luck on the card draw.\n\nOne question: What's your take on Banks of the Anduin? Leave it or quest it? I felt that it can slow down quite badly to always \"lose\" three progress tokens on a recurring location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458318","commentId":458318,"userName":"apelite","timestamp":1303622494,"content":"faith_star83 said:\n\nOne question: What's your take on Banks of the Anduin? Leave it or quest it? I felt that it can slow down quite badly to always \"lose\" three progress tokens on a recurring location.\n\n\nLeave it, imo. It will hang there with 1 threat, but otoh, using 3 questies to get through it are resources that, with a bit of luck, could more than deal with the card you'd be drawing instead of it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458343","commentId":458343,"userName":"DerBarchen","timestamp":1303630785,"content":"faith_star83 said:\n\nI even shrugged off a second Hill Troll (Feint) and Chief Uthak (Quick) without ever getting wounded. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nScore: 30 + 0 + 9 = 39 -18 (2x Hill Troll, Chief Uthak, 2x Gladden Fields) = 21\n\n\n\nWow, thats an excellent score! Ill be sure to try out several decks playing Scenario 2 on my own, including this one.\nNow all thats left to do is atempt the third scenario on your own eh? Think you can take out a Ringwraith? =P"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458364","commentId":458364,"userName":"Eryx_UK","timestamp":1303637861,"content":"I managed to succeed at the 2nd scenario yesterday.  I beat by accepting that you'll take damage from the Troll for a couple turns. Use allies to block and reduce the damage and use your heroes to gang up and attack it. I was also lucky to keep drawing locations in stage 2 rather than monsters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458430","commentId":458430,"userName":"Apophenia","timestamp":1303649810,"content":"faith_star83 said:\n\n \n\nOne question: What's your take on Banks of the Anduin? Leave it or quest it? I felt that it can slow down quite badly to always \"lose\" three progress tokens on a recurring location.\n\n \n\n \n\nQuest it but make sure to that you can get into a fight on the same turn. Then Banks of Anduin becomes a Shadow effect. However I'm not certain if the Forced would still trigger as a Shadow effect. Does being a shadow card count as being in play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=458637","commentId":458637,"userName":"DerBarchen","timestamp":1303705440,"content":"Apophenia said:\n\n \n\nQuest it but make sure to that you can get into a fight on the same turn. Then Banks of Anduin becomes a Shadow effect. However I'm not certain if the Forced would still trigger as a Shadow effect. Does being a shadow card count as being in play?\n\n\n\nNope, only shadow effets resolve when a card comes out of shadow! Personally I quested it only when I knew it was going to be benificial. As in, if I was afraid that it would stop progress on my quest I didnt bother (The second quest especially, with its 16 progress needed) That said it IS a great buffer sometimes!\n\nI beat this with a Spirit/Leadership deck last night with 37 points. Not as great as some runs but it was definately epic! Luckily I didnt encounter the 2nd Troll though. I managed to control the flow of enemies so well with Aragorn + Unexpected Courage that by the time Ambush hapened there was nothing to fight really."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=459154","commentId":459154,"userName":"jhaelen","timestamp":1303792962,"content":"I've played it 21 times, now. Still no luck sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]\n\nI think using Leadership as part of the deck is a must. Then I mostly tried combining it with Tactics (Gimli), but the farthest I got was 13 progress in stage 2. I guess, I'll try combining Leadership with Spirit or Lore next.\n\nI'm particularly unhappy that the neato-Gandalf combos have been revealed as non-legit. Repeatedly using Gandalf and getting the Steward of Gondor card are the only thing that gave me the feeling it might be possible to beat the scenario solo with an incredible amount of luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=459199","commentId":459199,"userName":"scottindeed","timestamp":1303802098,"content":"I managed to beat it yesterday using my Leadership/Spirit deck (Aragorn/Theodrid/Dunhere). \n\nEarly on I managed to reduce my threat by 6 with one of the Spirit cards, giving me a bit of breathing room before the Troll came stomping down to engage me.  I played Gandalf to wound him, then once I had some Allies in play I engaged the Troll, letting him kill one of the Allies.  I had just enough with my Heroes and Allies to finish him off.  I was only really pestered by some Wargs in the first part, but good old Dunhere was able to attack them still after they'd scurried cowardly back to the staging area.\n\nI was pretty lucky travelling down the Anduin, but also had masses of Allies (inc Faramir) in play which ment I made it through in two turns.  The final section of the quest was easily done with only Chieftan Uthak to contend with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=459209","commentId":459209,"userName":"wookie78","timestamp":1303803715,"content":"I finally managed to beat this scenario solo last night after about 10 attempts!  (Brutal scenario!  I haven't plucked up the courage to try Escape from Dol Guldur yet!!!).\n\nI managed it with a combined Lore / Leadership deck.\n\nMy heroes were Berevor, Denethor, and Theodred.\n\nThe low starting threat of the three heroes - 26 I think from memory - provides a bit of time to get 'tooled up' before the hill troll will engage the heroes, which I think is vital to success.  I used Berevor's ability to keep picking up 2 cards in the hope that Forest Snare would leap into my hand.  If you are lucky (and I was), a Forest snare will come out - I then used this to shackle the Hill Troll and prevent him from attacking.\n\nTheodred's ability is really useful as it allowed me to give him one extra resource token each turn (I always commit him to questing) which meant I could keep his resource pool to a useful amount so I could play Leadership cards.  Once Steward of Gondor comes out then the situation is even better as this gives him an extra 2 resource tokens - which means that although I only have one leadership hero I can potentially have 4 resource tokens to spend each round on Leadership cards in my hand(after the resource phase).\n\nLore and Leadership decks have a good number of useful (and relatively cheap) allies - getting lots of these out was also key to my success - again Berevors ability comes in handy here to quickly get these cards into your hand.  I also had 3 Gandalf Cards in my deck - combined with sneak attack this was very useful - he helped keep my threat counter down an awful lot!\n\nI did lose Denethor towards the end (quest card 3A) but by this point I had about 8 allies in play so was able to cope with the loss!\n\nThe above strategy (with a good share of luck it has to be said (i.e. forest snare arrived before hill troll, shadow card that removes attachment (e.g. forest snare) didn't hit me, steady stream of allies, timely appearance by Gandalf, etc.) resulted in a triumphant victory with a score of 44 (final threat score = 38 + 8 (dead Denethor sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]) + 2 damage tokens on heroes - 4 victory points (hill troll)).  After about 10 failures I was more than happy with that score!!!!\n\nI was beginning to wonder if it was actually possible to beat this scenario (playing solo) and was getting slightly disheartened with the game - I'm pleased to say that my faith in the game has been renewed - it is possible, don't give up!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=459462","commentId":459462,"userName":"pumpkin","timestamp":1303830624,"content":"jhaelen said:\n\nI'm particularly unhappy that the neato-Gandalf combos have been revealed as non-legit.\n\n\n\nWhich combos? and where have they been revealed as non-legit? BGG?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460075","commentId":460075,"userName":"jhaelen","timestamp":1303924663,"content":"pumpkin said:\n\nWhich combos? and where have they been revealed as non-legit? BGG?\n\n\n\nWell, it was reported on the German LotR LCG forum and referenced a thread over at BGG. However, in the meantime new information indicates, it was based on an old/wrong version of the Gandalf card text. Unfortunately, I cannot verify anything since I have the German version which may have translation issues.\n\nIt was reported that the text said 'When Gandalf is played...'. Being played is defined as paying the card's cost (this is in contrast to 'put into play'), so you couldn't use Gandalf's passive ability if it was put into play by a different effect, like Sneak Attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460259","commentId":460259,"userName":"conykchameleon","timestamp":1303955414,"content":"Tried to put this in the right thread...\n\n \n\nI finally beat this scenario!!! Legolas, Gimli, and Eowyn. My score only ended up being 26, but both Gimli and Legolas died in stupid ways in the second-to-last and last turns (Crows and a Treachery, respectively). I gotta say, seeing a pack of crows take down Gimli was kinda funny. Anyway, basically Gimli tanked (I still don't think that two Citadel Plates makes sense, but I can't find a rule against it), Eowyn quested, and Legolas sniped/placed progress tokens. Has anyone else had success with this hero combo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460269","commentId":460269,"userName":"Maniacske","timestamp":1303957657,"content":"My friend and I got clobbered on this one too last night. My friend played a lore/spirit deck and I myself used a spirit/tactics deck.\n\nHeroes were Eleanor, Legolas, Eowyn, Glorfindel, Beravor and Dunhere. Obviously, we didn't have enough punch to beat the Hill troll (disposed of it with a few Gandalfs) and didn't produce enough resources.\n\nEleanors ability was very useful though. Might try the tactics/spirit deck again but with Gimli or Thalin instead of Eowyn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460276","commentId":460276,"userName":"conykchameleon","timestamp":1303959256,"content":"My problem with Eleanor is that while her ability is useful, having to exhaust a hero is just too high of a cost. Especially since Spirit has a 1 cost event that does the same thing. IMO it is nearly impossible to beat the Hill Troll in Solo without Gimli or Forest Snare."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460283","commentId":460283,"userName":"jhaelen","timestamp":1303959870,"content":"conykchameleon said:\n\nI finally beat this scenario!!! Legolas, Gimli, and Eowyn. My score only ended up being 26, but both Gimli and Legolas died in stupid ways in the second-to-last and last turns (Crows and a Treachery, respectively). I gotta say, seeing a pack of crows take down Gimli was kinda funny. Anyway, basically Gimli tanked (I still don't think that two Citadel Plates makes sense, but I can't find a rule against it), Eowyn quested, and Legolas sniped/placed progress tokens. Has anyone else had success with this hero combo?\n\n\n\nCongratulations!\n\nSo far I only tried combining Tactics with Leadership using Gimli, Aragorn, and Theodred. Since I didn't include the plate armor, Gimli ends up being too fragile, since he has to tank the troll for a single round. So, combining Gimli with two Lore heroes or replacing Theodred with Legolas (and including the plate armor) might be a better way to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460359","commentId":460359,"userName":"guciomir","timestamp":1303975851,"content":"conykchameleon said:\n\nMy problem with Eleanor is that while her ability is useful, having to exhaust a hero is just too high of a cost. Especially since Spirit has a 1 cost event that does the same thing. IMO it is nearly impossible to beat the Hill Troll in Solo without Gimli or Forest Snare.\n\n\n\nPlay all spirit deck. Keep threat down. You can play for hours without engaging troll and you can play every ally from your deck, you can gather 100 resources, you can score all possible victory points and then kill Troll with 3 gandalf strikes. When you deal final hits be sure to have another 2 gandalfs in hand (reshuffling is the key). Nothing can touch you since you have tons of counters. Just remember to not touch the troll before you are ready to win the game next turn. So far 4 out of 4 games won with this strategy. I am not sure if it will be this easy when deck grows to 50 cards, but so far this is very effective, yet boring strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460447","commentId":460447,"userName":"zambo226","timestamp":1303986226,"content":"guciomir said:\n\nconykchameleon said:\n\n \n\nMy problem with Eleanor is that while her ability is useful, having to exhaust a hero is just too high of a cost. Especially since Spirit has a 1 cost event that does the same thing. IMO it is nearly impossible to beat the Hill Troll in Solo without Gimli or Forest Snare.\n\n \n\n \n\nPlay all spirit deck. Keep threat down. You can play for hours without engaging troll and you can play every ally from your deck, you can gather 100 resources, you can score all possible victory points and then kill Troll with 3 gandalf strikes. When you deal final hits be sure to have another 2 gandalfs in hand (reshuffling is the key). Nothing can touch you since you have tons of counters. Just remember to not touch the troll before you are ready to win the game next turn. So far 4 out of 4 games won with this strategy. I am not sure if it will be this easy when deck grows to 50 cards, but so far this is very effective, yet boring strategy.\n\n\n\n \n\nI'm really confused by this post.  You can't \"play for hours without engaging troll\" because you keep staging one card from the deck and you'll have to send Heroes and Allies out to quest every turn to prevent your threat from increasing.  Meanwhile, stuff like Misty Mountain Goblins, Dul Guldur Orcs and Wolf Riders come attack you, so you have to handle them, too.  All the while your threat automatically increases at the end of every turn.  And there's no reshuffling your deck; once it's gone, it's gone.\n\nI suggest you revisit the rules; sounds like you're getting a lot of them wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460450","commentId":460450,"userName":"zambo226","timestamp":1303986535,"content":"jhaelen said:\n\npumpkin said:\n\n \n\nWhich combos? and where have they been revealed as non-legit? BGG?\n\n \n\nWell, it was reported on the German LotR LCG forum and referenced a thread over at BGG. However, in the meantime new information indicates, it was based on an old/wrong version of the Gandalf card text. Unfortunately, I cannot verify anything since I have the German version which may have translation issues.\n\n \n\nIt was reported that the text said 'When Gandalf is played...'. Being played is defined as paying the card's cost (this is in contrast to 'put into play'), so you couldn't use Gandalf's passive ability if it was put into play by a different effect, like Sneak Attack.\n\n\n\n \n\nGandalf is worded \"After Gandalf enters play...\", so those combos with Sneak Attack, Stand and Fight, etc., still work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460458","commentId":460458,"userName":"Oshio","timestamp":1303987273,"content":"Zambo said:\n\n \n\nI'm really confused by this post.  You can't \"play for hours without engaging troll\" because you keep staging one card from the deck and you'll have to send Heroes and Allies out to quest every turn to prevent your threat from increasing.  Meanwhile, stuff like Misty Mountain Goblins, Dul Guldur Orcs and Wolf Riders come attack you, so you have to handle them, too.  All the while your threat automatically increases at the end of every turn.  And there's no reshuffling your deck; once it's gone, it's gone.\n\nI suggest you revisit the rules; sounds like you're getting a lot of them wrong.\n\n \n\n \n\nYou can, he just didn't mention the cards that let you do so, so I'll add to this a bit:\n\nBasically spirit decks start with incredibly low threat, and you can continue to keep it low by playing The Galadrim's Greeting (SSS, Lower your threat by 6) and Dwarven Tomb (S, Pick up a Spirit card in your discard pile). Yes, you do still have to keep engaging monsters and questing, but if there is one thing Spirit does well it's quest, and only dealing with 1 card a turn isn't hard, especially when you can keep higher threat monsters in the staging area where they can get picked off by Dunhere(Spirit Hero, may attack monsters in the staging area and gets +1 attack when doing so). Finally, Will of the West (S, Shuffle your discard pile back into your deck.) effectively lets you continue to lower your threat 'forever', or at least until you want to finally engage the higher threat monsters. It does involve the right cards, but as the poster mentioned, with a smaller deck this isn't too tricky.\n\nI suggest revisiting the spirit deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460461","commentId":460461,"userName":"Spirit Juggler","timestamp":1303987605,"content":"I tried it last night with a Tactics/Law deck using Legolas, Thalin and Glorfindel. Got to the second quest without any problems but then got bogged down by locations. If I'd been drawing bad guys I'd have been fine. Thalin wounds them as they're revealed and then Legolas gets success tokens on the quest for killing them. I got two locations adding 5 threat each and several other smaller locations and no bad guys to nut so was simply overwhelmed by threat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460498","commentId":460498,"userName":"guciomir","timestamp":1303992512,"content":"CAlexander gave a nice explanation of what I meant. Anyway, this is very effective strategy vs scenario2, but very boring.\n\nI tried the same vs scenario 3 and it does not go that well. You can't really have Eowyn or Dunhern imprisoned and even if you lose Eleonora, you will be overwhelmed. However, as far as four 30 cards deck go, Spirit can handle its own."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460652","commentId":460652,"userName":"jhaelen","timestamp":1304009590,"content":"Zambo said:\n\nGandalf is worded \"After Gandalf enters play...\", so those combos with Sneak Attack, Stand and Fight, etc., still work.\n\n\n\nThanks for the confirmation!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460690","commentId":460690,"userName":"Entropy42","timestamp":1304012562,"content":"CAlexander said:\n\n \n\nYou can, he just didn't mention the cards that let you do so, so I'll add to this a bit:\n\nBasically spirit decks start with incredibly low threat, and you can continue to keep it low by playing The Galadrim's Greeting (SSS, Lower your threat by 6) and Dwarven Tomb (S, Pick up a Spirit card in your discard pile). Yes, you do still have to keep engaging monsters and questing, but if there is one thing Spirit does well it's quest, and only dealing with 1 card a turn isn't hard, especially when you can keep higher threat monsters in the staging area where they can get picked off by Dunhere(Spirit Hero, may attack monsters in the staging area and gets +1 attack when doing so). Finally, Will of the West (S, Shuffle your discard pile back into your deck.) effectively lets you continue to lower your threat 'forever', or at least until you want to finally engage the higher threat monsters. It does involve the right cards, but as the poster mentioned, with a smaller deck this isn't too tricky.\n\nI suggest revisiting the spirit deck.\n\n\n\nThe other thing about this scenario is that once you are on step 3, nothing else is coming out.  If you can keep the enemies in the staging area and just quest, you don't even have to kill them and you can just sit there and lower your threat by playing these card combos.  This is extremely helpful if you are playing nightmare mode and want to set yourself up for the next quest.  It is also going to be, IMO, a big problem for tournament play.  All the high scoring decks will have to be built around creating a board lock-down and just slowly lowering your threat to 0 while farming all the Victory Point cards out of the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460695","commentId":460695,"userName":"conykchameleon","timestamp":1304013105,"content":"Entropy42 said:\n\nCAlexander said:\n\n \n\n \n\nYou can, he just didn't mention the cards that let you do so, so I'll add to this a bit:\n\nBasically spirit decks start with incredibly low threat, and you can continue to keep it low by playing The Galadrim's Greeting (SSS, Lower your threat by 6) and Dwarven Tomb (S, Pick up a Spirit card in your discard pile). Yes, you do still have to keep engaging monsters and questing, but if there is one thing Spirit does well it's quest, and only dealing with 1 card a turn isn't hard, especially when you can keep higher threat monsters in the staging area where they can get picked off by Dunhere(Spirit Hero, may attack monsters in the staging area and gets +1 attack when doing so). Finally, Will of the West (S, Shuffle your discard pile back into your deck.) effectively lets you continue to lower your threat 'forever', or at least until you want to finally engage the higher threat monsters. It does involve the right cards, but as the poster mentioned, with a smaller deck this isn't too tricky.\n\nI suggest revisiting the spirit deck.\n\n \n\n \n\nThe other thing about this scenario is that once you are on step 3, nothing else is coming out.  If you can keep the enemies in the staging area and just quest, you don't even have to kill them and you can just sit there and lower your threat by playing these card combos.  This is extremely helpful if you are playing nightmare mode and want to set yourself up for the next quest.  It is also going to be, IMO, a big problem for tournament play.  All the high scoring decks will have to be built around creating a board lock-down and just slowly lowering your threat to 0 while farming all the Victory Point cards out of the deck.\n\n\n\nI was under the impression that tournament play would be based around new quests that had not been seen before to prevent this kind of thing?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460745","commentId":460745,"userName":"faith_star83","timestamp":1304021534,"content":"Entropy42 said:\n\nThe other thing about this scenario is that once you are on step 3, nothing else is coming out.  If you can keep the enemies in the staging area and just quest, you don't even have to kill them and you can just sit there and lower your threat by playing these card combos.  This is extremely helpful if you are playing nightmare mode and want to set yourself up for the next quest.  It is also going to be, IMO, a big problem for tournament play.  All the high scoring decks will have to be built around creating a board lock-down and just slowly lowering your threat to 0 while farming all the Victory Point cards out of the deck.\n\n \n\n \n\nI was wondering though: Having a low threat and not being engaged by enemies is a fine thing, but when I have to many encounter cards in my staging area, the threat level gets to high for succesful questing...making progress impossible. Especially once you flip the second quest card enemies don't engage you anyway (even if you play leadership), but adding two encounter cards every turn really did the trick in my runs and I was finished by an overwhelming threat level and treacheries and enemies, making it literally impossible to put progress tokens on the quest or defeat the sheer number of enemies.\n\nI agree though, that spirit is one of the strongest spheres (and one of my favourite) since they are great questers, and Will of the West, The Galadhrim's Greeting and Stand and Fight are very powerful cards. But I am not fully convinced that it is very easy to play through the second quest with this deck, will give it a couple of tries though this afternoon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=460854","commentId":460854,"userName":"jhaelen","timestamp":1304044651,"content":"conykchameleon said:\n\n \n\nI was under the impression that tournament play would be based around new quests that had not been seen before to prevent this kind of thing?\n\n\n\nSure, but the key to getting a low score is having a means to reduce threat (other than scoring cards worth victory points). Since threat reduction is part of the Spirit theme you probably don't even have to show up at a tournament if your group doesn't have anyone playing the Spirit sphere!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=468967","commentId":468967,"userName":"faith_star83","timestamp":1305494096,"content":"I was bored yesterday so I decided to have another go at this one...and I won. It was actually quite a breeze even!\n\nI played Leadership / Tactics....arguably the best combiation of spheres for this scenario.\n\nI had to beat two Hill Trolls, but other than that I had no problems at all...I had an army of allies which made questing and combat very simple!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=469118","commentId":469118,"userName":"jhaelen","timestamp":1305523023,"content":"faith_star83 said:\n\nI played Leadership / Tactics....arguably the best combiation of spheres for this scenario.\n\n\n\nWell, using Tactics always requires a steady string of enemies. If you get a string of locations instead (say, one or several East Blights followed by Brown Lands) your threat goes through the roof really quick.\n\nImho Spirit/Lore or Leadership/Lore works best. After Forest Snaring the Hill Troll you can take your time and enter the second quest stage as soon as it's convenient."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=470858","commentId":470858,"userName":"Vyron2","timestamp":1305732688,"content":" i have relatively consistent wins on the second scenario with a spirit/lore combination - starting under 30 threat, thus having more time building up and defeating the troll - either playing gandi, galadhrim (threat -6) or forest snare - then you should have enough time... ofc, if the deck's against you, you will lose :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] there are so many nasty cards... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=471093","commentId":471093,"userName":"Vyron2","timestamp":1305774459,"content":"f.y.i.: 2nd scenario\n\nyesterday I played a solo game with a spirit deck made out of 2 core sets (and only 2 gandis :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png], so 43 cards (because you just can't add any more cards without breaking the 3-card rule...)... I started with a threat count of 24, ended with 24 (!!!) and 17 Victory Points - so FINAL SCORE: SEVEN POINTS !!!\n\nI emptied the encounter deck once, emptied my deck, too (though I refilled it with Will of the West...) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI used Gandi several times (threat lowering, troll killing :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]) with stand and fight... kept my threat low with galadhrim's greeting and again with dwarven tomb... out of the discard pile and used it again... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nunexpected courage on dunhere (killing all the bad guys in the staging area, esp. goblin sniper) and eleanor - cancelling treachery effects...\n\nI amassed all 9 allies - took, northern and guide - 3x favor of the lady on eowyn... you can imagine the rest - why it took so long, because I got TWO trolls on the first stage... took quite some time... then I got through stage 2 and 3 in 3 turns :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] QUEST MASTER :DDD\n\nvery long, but entertaining game... try the pure spirit with 2 core sets out, if you haven't already"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=471148","commentId":471148,"userName":"jhaelen","timestamp":1305782402,"content":"Vyron said:\n\nI emptied the encounter deck once, emptied my deck, too (though I refilled it with Will of the West...) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n[...]\n\nvery long, but entertaining game... try the pure spirit with 2 core sets out, if you haven't already\n\n\n\nYou emptied your deck? This means the game took over 37 turns! that must have been a long game indeed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=474467","commentId":474467,"userName":"Smalachi","timestamp":1306317773,"content":"Have only played solo a few times, as I prefer 2 player games. Tried JdtA twice with a spirit/Lore deck, Eowyn/Dunhere/Beravor and nailed it with socres of 1 and -11!!!!!\n\nHad help with good draws from the encounter deck to start with, reduced threat with Gandalf/Galadhrims greeting and then just built up my had with Beravor's and Gleowines drawing abilities - had my entire deck in my hand!!! (>30 cards) at this point, it gets a bit silly, cos instead of finishing the senario quickly (you have got an urgent message after all!) you just hang around waiting for resources to build up.\n\nThe Hill troll only has 1 threat, so you can generally just quest with Eowyn and you should be alright. Dunhere and beravor can take care of the one other card if needed, if not draw cards. Soon you get more gandalfs/stand and fights, reducing threat more (never damage the hill troll), engage the hill troll with gandalf one time and then forest snare it. Then you can happily whittle away at it, drawing your deck and building up resources (at theis point you've got plenty of allies to deal with the other card being drawn).\n\nOne huge 'loophole' in the encounter deck is Banks of the Anduin. Get two northern trackers (3 if you've got them, I don't - only 1 core set needed!) and you can put it on top of the encounter deck at the beginning of every other quest phase, then you know exactly whats coming!\n\nOnly problem is that after a couple of goes, you get bored cos it takes so long to build up resources, and then its just a case of waiting. Will probably try with a more difficult deck now.\n\nPS posted a similar comment on another thread, then thought it fits better here!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=474625","commentId":474625,"userName":"Titan","timestamp":1306335529,"content":"I use a leadership/spirit/lore deck most of the times. In order to pass the second quest in the Anduin scenario, the best tactic I have seen is to have a number of allies in play and use Faramir liberally. I have passed this scenario as quickly as two turns. And the moment I discovered Faramir's extra usefulness here, I vowed never to leave him out of this scenario again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=474645","commentId":474645,"userName":"servant of the secret fire","timestamp":1306337510,"content":"I use 3 core sets so i think i have a big bonus.Spirit/leadership with Celebrian's stone on Aragorn, the favor of the lady on Eowyn and nothern trucker can make things more than easy.Except those cards you have Faramir and having Gandalf 11 times with this deck sometimes i feel like i cheatlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif].\n\nSpiri/lore also work well but it takes more time and sometimes you slow down things because you have the cards but not the resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=477061","commentId":477061,"userName":"Marael","timestamp":1306762351,"content":"I played it 4 times, and win only 1 with a Leadership / Spirit (Eowin, Theodred, Aragorn). The most difficult part is the Troll, after him the things goes easier, as my quest is high enough. But the other 3 times I died for the Troll, if the allies does not show up early.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=477115","commentId":477115,"userName":"Ileopsoas","timestamp":1306768260,"content":"Marael said:\n\nI played it 4 times, and win only 1 with a Leadership / Spirit (Eowin, Theodred, Aragorn). The most difficult part is the Troll, after him the things goes easier, as my quest is high enough. But the other 3 times I died for the Troll, if the allies does not show up early.\n\n \n\n\n\nI Played today using the same heoroes as you (i didnt looked at this topic before) and i think this is a strong combination against this quest!I won the second time i Played, but with a lot of sheer luck...but the first time I played it wasn't the Troll the real threat (I have six ways to reduce threat:Gandalf ,the greeting's card...+ Stand and fight+ sneak attack), but Necromancer reach and dor guldur's orc where my doom!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=478497","commentId":478497,"userName":"Glaurung","timestamp":1306941422,"content":"Hallo to every one. 1 week is past since i got the game in my hand. First days i lose all the time both quests.I mean first and second. Now i get bored. I build up the deck and i cannot lose second quest. First one is to easy and boring to play. Third quest you dont need to try solo. Is not possible for solo at all. This is multy player quest!!! But i like to play alone so much. My deck is 3 color. Eowin,Gimly, Theodred. L/T/SP.  This deck cannot lose second quest!!! SO if you win second first is just easy walking. And i scare if they will give me only 1 quest per exp. pack i will get bored quickly!!!\n\nSo i hope there will be more than 1 quest in exp pack and they will be really difficult and different.\n\nIf someone need deck list i can print it.\n\nI was proff. player of decipher lotr trading card game use to play many events and even world cup.Was the best player in my small country(Estonia). I really like this game but i hope exp pack quest will be more exiting than core set. We need more cards, more quests and more challenge!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=478819","commentId":478819,"userName":"jhaelen","timestamp":1306987988,"content":"Glaurung said:\n\nI build up the deck and i cannot lose second quest. First one is to easy and boring to play. Third quest you dont need to try solo. Is not possible for solo at all.\n\n[...]\n\nIf someone need deck list i can print it.\n\nI was proff. player of decipher lotr trading card game use to play many events and even world cup.Was the best player in my small country(Estonia).\n\n\n\nConsider me utterly impressed by your superior, nay, godly, skills!\n\nPlease illuminate us lowly, inferior players by posting your deck that cannot lose!\n\n \n\nP.S.: I've actually beaten the third scenario using a single deck, but I guess I must have imagined it since you so convincingly made the case it cannot be beaten. I bow to your superior wisdom!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=478878","commentId":478878,"userName":"Glaurung","timestamp":1306997960,"content":"hey man you get me wrong. I mean im not super puper powerfull brain, cool deck builder. With my deck i win 4 times form 5 games. And you lose only if you really have bad luck or you make mistakes. And i do so. But this deck is already quite powerfull!!! So if you play really carefully as you play on the tournaments you will win 85%. That what i mean. And yesterday for example i play 5 games and no lose any. And today i play 1 and lose(very bad luck draw). So i mean  is not so difficult. And there is difficult 4. So if in adventures pack will be quest difficult 2 or 3 is boring. That what i mean!!!  So i hope future quiests will be more harder. My deck i can post::\n\nTheodred Skill\n\nHero (3)\nEowyn (Core) x1\nGimli (Core) x1\nTheodred (Core) x1\n\n\nAlly (14)\nFaramir (Core) x1\nGandalf (Core) x3\nGondorian Spearman (Core) x2\nNorthern Tracker (Core) x3\nVeteran Axehand (Core) x2\nLorien Guide (Core) x3\n\n\nAttachment (15)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDwarven Axe (Core) x3\nSteward of Gondor (Core) x3\nThe Favor of the Lady (Core) x2\nUnexpected Courage (Core) x3\n\n\nEvent (21)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x2\nThe Galadhrim's Greeting (Core) x3\nValiant Sacrifice (Core) x2\n\nThe deck work very easy. Gimly for kill everything!!!! with axe and armor. Eowyn for quest.Theodren for quest and add resources whom you need at the moment. Maybe you need second Faramir. I should to test more. But you will win 80-90% of the game against second quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=478879","commentId":478879,"userName":"Glaurung","timestamp":1306998127,"content":"jhaelen said:\n\nGlaurung said:\n\n \n\nI build up the deck and i cannot lose second quest. First one is to easy and boring to play. Third quest you dont need to try solo. Is not possible for solo at all.\n\n[...]\n\nIf someone need deck list i can print it.\n\nI was proff. player of decipher lotr trading card game use to play many events and even world cup.Was the best player in my small country(Estonia).\n\n \n\nConsider me utterly impressed by your superior, nay, godly, skills!\n\n \n\nPlease illuminate us lowly, inferior players by posting your deck that cannot lose!\n\n \n\nP.S.: I've actually beaten the third scenario using a single deck, but I guess I must have imagined it since you so convincingly made the case it cannot be beaten. I bow to your superior wisdom!\n\n\n\nYou say you can beat 3 scenario alone???? Very interesting!!! How you do that??? What kind of deck???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=480933","commentId":480933,"userName":"jhaelen","timestamp":1307336936,"content":"Glaurung said:\n\n \n\nYou say you can beat 3 scenario alone???? Very interesting!!! How you do that??? What kind of deck???\n\n\n\nI used a 50-card Leadership/Spirit deck with Eowyn, Aragorn, and Theodred created from a single core set. Since that means I almost included every card from those spheres (and naturally three copies of Gandalf) it should be relatively easy to figure out the deck.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=480966","commentId":480966,"userName":"lleimmoen","timestamp":1307340480,"content":"jhaelen said:\n\nGlaurung said:\n\n \n\n \n\nYou say you can beat 3 scenario alone???? Very interesting!!! How you do that??? What kind of deck???\n\n \n\nI used a 50-card Leadership/Spirit deck with Eowyn, Aragorn, and Theodred created from a single core set. Since that means I almost included every card from those spheres (and naturally three copies of Gandalf) it should be relatively easy to figure out the deck.\n\n \n\n \n\n\n\nSounds like a sh*tty deck to beat the tough scenario, all the better then for the player. Did it take many attempts? Congrats.\n\nI find the game very challenging solo although I feel I quite mastered it (so far) in coop. It seems a bit less fun solo, too, but that will perhaps change once I get better in it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=481118","commentId":481118,"userName":"Ileopsoas","timestamp":1307356982,"content":"lleimmoen said:\n\n \n\njhaelen said:\n\n \n\nGlaurung said:\n\n \n\n \n\nYou say you can beat 3 scenario alone???? Very interesting!!! How you do that??? What kind of deck???\n\n \n\nI used a 50-card Leadership/Spirit deck with Eowyn, Aragorn, and Theodred created from a single core set. Since that means I almost included every card from those spheres (and naturally three copies of Gandalf) it should be relatively easy to figure out the deck.\n\n \n\n \n\n \n\n \n\nSounds like a sh*tty deck to beat the tough scenario, all the better then for the player. Did it take many attempts? Congrats.\n\nI find the game very challenging solo although I feel I quite mastered it (so far) in coop. It seems a bit less fun solo, too, but that will perhaps change once I get better in it.\n\n \n\n \n\nWith that deck you shouldn't have any problem...if you try 10 times!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=481537","commentId":481537,"userName":"jhaelen","timestamp":1307413535,"content":"lleimmoen said:\n\n \n\n \n\nSounds like a sh*tty deck to beat the tough scenario, all the better then for the player. Did it take many attempts? Congrats.\n\n \n\nOf course it did cool.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/cool.gif]\n\n \n\n33 attempts in all; 8 attempts if I only count the ones in which Theodred ended up being the prisoner (otherwise the chance to make it is pretty much non-existent).\n\nPlaying with two decks is definitely more fun and almost makes the scenario too easy, already. I won 8 out of 12 attempts (although that was before the FAQ change to the Nazgul)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482271","commentId":482271,"userName":"Glaurung","timestamp":1307529340,"content":"This is deck list 90% win against second scenario:\n\nTotal Cards (50)\n\nHero (3)\nEowyn (Core) x1\nGimli (Core) x1\nTheodred (Core) x1\n\nAlly (11)\nFaramir (Core) x2\nGandalf (Core) x3\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\n\nAttachment (14)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDwarven Axe (Core) x3\nSteward of Gondor (Core) x3\nUnexpected Courage (Core) x3\n\nEvent (25)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nValiant Sacrifice (Core) x2\nHasty Stroke (Core) x3\n\n\nDeck Strategy: So this is the last of this deck. I test it about 1 or 2 weeks. Against first scenario is very easy to play. Second scenario this deck win 90%.\n\nStrategy: Gimly is killing machine. With plate, axe and U.courage on him he is unbeaten. he can make 12 damage is enough to kill any enemy in the game for now with one strike. Quick strike kill them even before they can come close.\nTheodred for quest and add resources to heroes.He can died in the end if need it.\nEowyn she is for quest and counter some nasty with hasty stroke and test of will(and reduce treat with galadrimes greatings).\nFaramir for quest and Gandalf depend of situation.Kill, draw, reduce treat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482690","commentId":482690,"userName":"faith_star83","timestamp":1307596706,"content":"You say Gimli is a killing machine with Citadel Plate, Axe and unexpected courage, that is true of core, but I can't see how you will be able to consistently have enough resources to pay for all this stuff considering you're heroes come from three different spheres.\n\nI assume you win when you have a Steward of Gondor on your start hand and you lose when you don't?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482730","commentId":482730,"userName":"ClydeCloggie","timestamp":1307602531,"content":"faith_star83 said:\n\n \n\nYou say Gimli is a killing machine with Citadel Plate, Axe and unexpected courage, that is true of core, but I can't see how you will be able to consistently have enough resources to pay for all this stuff considering you're heroes come from three different spheres.\n\nI assume you win when you have a Steward of Gondor on your start hand and you lose when you don't?\n\n \n\n \n\nExactly my thoughts. This deck seems extremely vulnerable in the first few turns as key cards in it are high cost and everything needs to be sourced from a single hero's pool. Getting the Plate out consistently appears to be impossible. You've got a starting threat of 28 so at best 2 turns before the Troll attacks unless you get a Gandalf played on turn 2 or 3 or a Galadhrim's Greetings on turn 3 to lower threat, but that means using almost all your available resources.\n\nI find theclaim of 90% victory fairly unrealistic, I must say, and as noted above it seems extraordinarily dependent on resource generation through Steward, which is only playable from turn 2 even if you have it in your opening hand.\n\nCan I maliciously suggest some lack of rules observation may have a hand in the high win percentage? Paying for cards with out-of-sphere resources comes to mind, and you do know that Steward is unique?\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482759","commentId":482759,"userName":"Glaurung","timestamp":1307605947,"content":"ClydeCloggie said:\n\nfaith_star83 said:\n\n \n\nYou say Gimli is a killing machine with Citadel Plate, Axe and unexpected courage, that is true of core, but I can't see how you will be able to consistently have enough resources to pay for all this stuff considering you're heroes come from three different spheres.\n\nI assume you win when you have a Steward of Gondor on your start hand and you lose when you don't?\n\n \n\n \n\nExactly my thoughts. This deck seems extremely vulnerable in the first few turns as key cards in it are high cost and everything needs to be sourced from a single hero's pool. Getting the Plate out consistently appears to be impossible. You've got a starting threat of 28 so at best 2 turns before the Troll attacks unless you get a Gandalf played on turn 2 or 3 or a Galadhrim's Greetings on turn 3 to lower threat, but that means using almost all your available resources.\n\nI find theclaim of 90% victory fairly unrealistic, I must say, and as noted above it seems extraordinarily dependent on resource generation through Steward, which is only playable from turn 2 even if you have it in your opening hand.\n\nCan I maliciously suggest some lack of rules observation may have a hand in the high win percentage? Paying for cards with out-of-sphere resources comes to mind, and you do know that Steward is unique?\n\nI play lotr pf decipeher for years. Also i make tournaments my self i n my country. Before that i have my own magic the gathering shop. S i have expirience with card games and sure Steward is unique.I really serious about this game.I like it so much.Mostly becouse of the solo.I dont have so much players around.\n\nMaybe im just lucky all the time????? Ok maybe. But i win 4 games from 5. And if i lose is mean really bad luck or very bad draw.\n\nYou forget about ability of theodred. He can add recourses in begining. And this is very important!!! You have plate in your hand in starting hand??All go to quest and add 1more resource to Gimly. Or maybe you have Galadrim greetings. So add resources to Eowin and play it on second turn. Same time i have feint ( troll will not attack) or gandalf with sneak attack. You will have something in starting hand anyway.+ The first strike of troll Gimly should take to make him sronger and than he use quick strike or if you have U courage you strike back.\n\nSteward you play only on Eowyn!!!!! No another way. In the middle of the game you have lot of resources to play all ally and galadhrims greetings+ 2 dwarfen tombs for play it again from discard pile. Or maybe you can play stand and fight???? In the middle of the games i have so much resoures tokens on her....  But If Gimly or Eowyn dies game is finish. So you must protect her any cost.Cards like necromancer reach or Evil storm is most dangerous for you.Test of will and hasty stroke must be in your hand. And dwarven tomb very often return test of will insteed of Galadrim Greetings. Very often i must to say.Often???? no Mostly!!!!\n\n \n\nJust try it and you will see yourself. But of course you should to think, think and think. The game is hard(that what i like most).Mistakes always deadly.\n\nP.S. This deck is rush deck. But in the beginning you need to prepare. Dont be so rush to go second stage until you ready. Better if you have Faramir before you go second stage and gandalf also ready to come. Than 2 3 tuns for the second stage and finish.\n\n \n\n \n\n \n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482767","commentId":482767,"userName":"Glaurung","timestamp":1307606591,"content":"I play lotr tcg decipher for years. Also i make tournaments my self i n my country.I was on the first world cup in Essen where i lose only 1 game.This game was against the best player in the world on the moment.\n\nBefore that i have my own magic the gathering shop. S i have expirience with card games and sure Steward is unique.I really serious about this game.I like it so much.Mostly becouse of the solo.I dont have so much players around.\n\nMaybe im just lucky all the time????? Ok maybe. But i win 4 games from 5. And if i lose is mean really bad luck or very bad draw.\n\nlet me Explain how is works:\n\nYou forget about ability of theodred. He can add recourses in begining. And this is very important!!! You have plate in your hand in starting hand??All go to quest and add 1more resource to Gimly. Or maybe you have Galadrim greetings. So add resources to Eowin and play it on second turn. Same time i have feint ( troll will not attack) or gandalf with sneak attack. You will have something in starting hand anyway.+ The first strike of troll Gimly should take to make him sronger and than he use quick strike or if you have U courage you strike back.\n\nSteward you play only on Eowyn!!!!! No another way. In the middle of the game you have lot of resources to play all ally and galadhrims greetings+ 2 dwarfen tombs for play it again from discard pile. Or maybe you can play stand and fight???? In the middle of the games i have so much resoures tokens on her.... But If Gimly or Eowyn dies game is finish. So you must protect her any cost.Cards like necromancer reach or Evil storm is most dangerous for you.Test of will and hasty stroke must be in your hand. And dwarven tomb very often return test of will insteed of Galadrim Greetings. Very often i must to say.Often???? no Mostly!!!!\n\n \n\nJust try it and you will see yourself. But of course you should to think, think and think. The game is hard(that what i like most).Mistakes always deadly.\n\nP.S. This deck is rush deck. But in the beginning you need to prepare. Dont be so rush to go second stage until you ready. Better if you have Faramir before you go second stage and gandalf also ready to come. Than 2 3 tuns for the second stage and finish.\n\nFunny thing!!!! One time i get 2 goblins snipers on the last stage. I wait for around 10 turns to get gandalf to kill one(than i can engage another). My treat was so low they cannot engaged me by them self. SO in the end of the day they kill me before gandalf come. 2 wounds in 1 round. In this case low treat is really bad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482780","commentId":482780,"userName":"DeeJay507","timestamp":1307608422,"content":"Hello,\n\nMy tactics is to:\n\n1) Start with threat lower than 30 (in order to prepare for troll -> he is easy while in staging area with only 1 threat but can quickly kill you when engaged).\n\n2) Think of a way to neutralize the Troll before your threat reaches 30.\n\n3) Keep your threat lower than 35 all the time.\n\n4) Prepare for 2nd and 3rd step of the quest before you finish 1st.\n\nI find that Lore/Spirit deck works nice because of:\n\nCard Draw, Keeping threat low + Heal gives you a lot of time to prepare, Forest Trap for Troll.\n\nAnd while the deck lacks real defence and/or attack power in heroes and attachments, it has strong allies.\n\nPersonally I use Beravor, Dunhere and Eowyn. I mulligan when don't have Unexpected Courage :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png].\n\nUnexpected Courage on Beravor FTW!\n\nA lot of cards is great for Protector of Lorien, Eowyn and for options of countering nasty game effects.\n\nAbility of playing allies from your graveyard for Spirit is great way to play expensive Lore allies for Spirit resources :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nTime works on your advantage, while you get to draw more and more cards, and when you have 0, you can reshuffle discarded cards.\n\nIn solo mode, you can reshuffle endlessly and cast nice cards, like Gandalfs over and over again.\n\nYour threat is low all the time which means that enemies stay at the staging area. You can kill them with Dunhere. Slowely but surely and without need of worrying about shadow effects and defending. This leaves you with Beravor drawing cards and Eowyn questing for you.\n\nSpirit allies can deal with locations without you having to travel to them. Eowyn gets upgraded with nice Attachments, and Dark Knowledge on Dunhere is more than cool. Do I need to defend against this enemy with Beravor, or I can safely get the damage and heal it afterwards and get 2 additional cards?\n\nGoblin Sniper is owned by Dunhere.\n\nHill Troll and bosses are owned by Forest Trap that can be retrieved using Erebor Hammersmith.\n\nYou can get through stage 2 of the quest at once, putting all required tokens using protector of lorien and discarding 20 cards :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] (Note that with Gleowin and Beravor + Unexpected Courage you get to draw 6 cards per turn).\n\nAlways leave resources so you can play responses.\n\nAlways use abilities that exhaust your characters at the end of combat phase. (To avoid having to deal 1 damage to your exhausted characters during quest phase when treachery card pops up).\n\nEven if you lose hero -> you can return him to play using Fortune or Fate. Then again using Dwarven Tomb. Then again with Will of the West. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nNever quest with damaged Eowyn alone.\n\nAt the begining if your threat is 29 you should have one of following:\n\nForest Trap, The Ghladrim's Greeting, Gandalf, A Light in the Dark.\n\nTry to survive one troll attack by sacrificing ally and getting as low threat as possible. The best is Gandalf, since he lower's your threat and defends against the troll. (don't use it to damage troll or attack, be patient :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] unless you don't have forest trap...  ). Then you can use Forest Trap (and if not -> A light in the dark to get more turns). You can play gandalf from your discard pile with Stand and Fight again so don't worry.\n\nThe worst start is when you have neither of these cards. Nor Gleowin. Then, Beravor should draw you some cards. You draw 3 cards per turn and have starting threat of 27, which give you 16/50 cards in hand when you reach treat 30. If you still don't have any of your 11 cards that solve the troll problem you are in trouble.\n\nI played less with tactics and leadership so I'm not sure how to handle the situation there. Probably you need to hurry. You don't have heal and threat lowering cards. However you have much more attack and defence power.\n\nI suppose the cards that solve the troll problem are: Gimli with Citadel Plate (Get damage from troll, then attack. Or first defend then Feint/Quick Strike/Ever Vigilant).\n\nHave some allies and then Feint -> For Gondor.\n\nSneak attack with Gandalf :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYou can also lure the troll without him attacking you the first turn using steak attack with Son of Arnor in correct phase (after all enemies attacked but before you attacked them.)\n\nYou quest by using Faramir and Celebrian Stone.\n\nSwift Strike + Gondorian Spearman helps you put that final 3 points of damage on troll.\n\nStand together is another way of fending off the troll for one more turn.\n\nAnyway, chose your heroes wisely so you have time to build up some resources. Stewart of Gondor surely helps with that.\n\nHowever I believe that you can have a harder times than if u used Spirit.\n\nThe scenario 2 can get really difficult when you have threat over 35 and I don't see how you can prevent that when playing leadership/tactics.\n\nMaybe I'll give it a try to see if I'm right :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nGood luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482808","commentId":482808,"userName":"Glaurung","timestamp":1307610295,"content":"Yes true my friend. You play slow control deck. And is work like this: slowly and patiently.\n\nAnd this work very good too!!! I really glad to see here one player who is really go to deep to the game on the  strategy point and deck building.\n\nMany others just only crying around: no possible no possible!!!!! \n\nWhat do you thing about last scenario???? i really want to beat it solo( by Original rules!!!).But no possible as i see........\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=482840","commentId":482840,"userName":"avgzxc","timestamp":1307613636,"content":"3rd scenario:\n\n \n\nEowyn, Beravor, Denethor(maybe Glorfindel because if Eowyn gets imprisoned it often means extreme quest trouble at the beginning).\n\nReason for this team is simple: lore quest pumps - you basically need them to get some breathing room. Also, any breathing room means drawing cards with Beravor.. More drawing, more best cards vs given situation, higher chance for getting Beravor + Unexpected Courage, which easily pushes things to the next level.\n\nPlay 5x3xlore allies, 3xTook, 3 Northern Trackers...\n\nRest of the deck is pretty standard: threat management, some nice attachments etc.\n\nIMO, if you care about high success rate vs 3rd scenario don't bother with decks other than spirit/lore - you need the most cost efficient cards to survive the initial onslaught.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=486581","commentId":486581,"userName":"DurinIII","timestamp":1308269993,"content":"Dude, you guys should try an all Dwarves hero line...it can beat quest 2. Mix tactics (Gimli and Thalin) and Leadership (Gloin). This deck is good. I beat the scenario first try with it (granted I had a victory score of 54) happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=486608","commentId":486608,"userName":"scottindeed","timestamp":1308275347,"content":" Beat Scenario 2 yesterday with a score of -24 (maximum), using Lore/Spirit  Denethor, Berevor and Dunhere.  Lots of stalling.  Just wanted to see if i could get the max score, i wouldn't want to sit through all that normally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=487433","commentId":487433,"userName":"DurinIII","timestamp":1308422068,"content":" Use Gimli, Thalin, and Gloin. Generate resources with Gloin and Leadership cards. Use Gimli and thalin to attack and defend things. Be prepared to not quest early on so that you clear the staging area (i.e. never quest when you are engaged with a Hill Troll...kill it first!). Then, once the stage area is clear and manageable, drop allies like Farimir and Rohan rider, and Gandalf, and quest away!!!  I have won every time with this deck. Good Luck!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=487434","commentId":487434,"userName":"DurinIII","timestamp":1308422191,"content":" Mix Leadership and Tactics...Gimli, Thalin, and Gloin...play it correctly and you will win every time.  Good Luck!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=488024","commentId":488024,"userName":"jhaelen","timestamp":1308543764,"content":"DurinIII said:\n\nI have won every time with this deck. Good Luck!\n\n\n\nHow many games did you play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=488632","commentId":488632,"userName":"Mighty Jim 83","timestamp":1308639754,"content":"Tried this with a Leadership/Tactics deck- Aragorn, Theodred, Eowyn. Luck getting Steward of Gondor out helps, likewise Unexpected Courage.\n\nHowever, I still can't see a way of dealing with the Troll. Barring some flukes, the Troll engages on round 3 (starting threat of 28) and there's not much that can deal with it. If you use low cost allies to die, then your threat sky-rockets, if you stand and fight, you'll quickly have dead heroes.\n\nAside from a starting hand containing Gandalf AND sneak attack, I really can't see how this can be done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=488654","commentId":488654,"userName":"ClydeCloggie","timestamp":1308643563,"content":"Mighty Jim said:\n\nTried this with a Leadership/Tactics deck- Aragorn, Theodred, Eowyn. Luck getting Steward of Gondor out helps, likewise Unexpected Courage.\n\nHowever, I still can't see a way of dealing with the Troll. Barring some flukes, the Troll engages on round 3 (starting threat of 28) and there's not much that can deal with it. If you use low cost allies to die, then your threat sky-rockets, if you stand and fight, you'll quickly have dead heroes.\n\nAside from a starting hand containing Gandalf AND sneak attack, I really can't see how this can be done.\n\n\n\nMy most successful solo deck for Anduin has been Spirit/Leadership with Eowyn/Dunhere/Aragorn, starting threat 29. Key to winning was questing well enough to prevent threat raise on turn 1 and then getting either Gandalf or Galadhrim's Greeting out on turn 2 before engagement. The Troll engaging early essentially means you lose.\n\nI'm currently running a triple-sphere deck with Aragorn/Legolas/Glorfindel, starting threat 33. I actually first played the deck with the three lowest threat heroes from those spheres but that didn't really work so i've now gone for the two powerhouses plus Legolas. Obviously there is no way to avoid an early Troll, so Anduin has been a pain for this deck. but it's nice trying out ways of dealing with the Troll on turn 1. Snowbourn Scout or Henamarth as turn 1 fodder helps, but then a Gandalf is desperately needed to reduce threat and kill the troll within 2 turns. The good thing about those heroes is that they are excellent attackers, it's just that you can't afford to run into other enemies at set-up or turn 1. A Beastmaster is all it takes to cook the goose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=489130","commentId":489130,"userName":"Glaurung","timestamp":1308720109,"content":"Total Cards (50)\n\nHero (3)\nEowyn (Core) x1\nGimli (Core) x1\nTheodred (Core) x1\n\nAlly (11)\nFaramir (Core) x2\nGandalf (Core) x3\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\n\nAttachment (14)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDwarven Axe (Core) x3\nSteward of Gondor (Core) x3\nUnexpected Courage (Core) x3\n\nEvent (25)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nValiant Sacrifice (Core) x2\nHasty Stroke (Core) x3\n\n\nDeck Strategy: So this is the last of this deck. I test it about 1 or 2 weeks. Against first scenario is very easy to play. Second scenario this deck win 90%.\n\nStrategy: Gimly is killing machine. With plate, axe and U.courage on him he is unbeaten. he can make 12 damage is enough to kill any enemy in the game for now with one strike. Quick strike kill them even before they can come close.\nTheodred for quest and add resources to heroes.He can died in the end if need it.\nEowyn she is for quest and counter some nasty with hasty stroke and test of will(and reduce threat with galadrimes greatings).\nFaramir for quest and Gandalf depend of situation.Kill, draw, reduce threat.\n\n90% win every time against Anduin quest.\n\nSuggest you also : when you play the game take 1 dice d6 and every time you make mistake add1. Than you can see in the end of the game how many mistake you do and try to reduce it from game to game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=489147","commentId":489147,"userName":"DurinIII","timestamp":1308724189,"content":" So, I finally beat quest two guys. I used the pretty obvious combination (that most of you keep talking about) of Spirit/Leadership...this is after I realized I was playing the quest slightly wrong with my \"invincible\" dwarf deck that I commented on earlier (thalin, gimli, and thorin). Anyway, yeah, threat removal and high willpower, worked for me. Though, I haven't been able to beat it again...played three games with this deck.  Hard quest!!! Good luck Tolkien fans!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=489622","commentId":489622,"userName":"Aetius3","timestamp":1308796630,"content":" I just managed to win three times in a row with this scenario.\n\nThis is the deck, assembled from only one core kit:\n\nHero (3)\nBeravor (Core) x1\nEowyn (Core) x1\nTheodred (Core) x1\n\n\nAlly (22)\nGandalf (Core) x3\nSilverlode Archer (Core) x2\nSnowbourn Scout (Core) x2\nGuard of the Citadel (Core) x3\nDaughter of the Nimrodel (Core) x3\nErebor Hammersmith (Core) x2\nSon of Arnor (Core) x2\nLorien Guide (Core) x3\nNorthern Tracker (Core) x2\n\n\nAttachment (12)\nForest Snare (Core) x2\nProtector of Lorien (Core) x2\nSelf Preservation (Core) x2\nSteward of Gondor (Core) x2\nCelebrian's Stone (Core) x1\nThe Favor of the Lady (Core) x2\nUnexpected Courage (Core) x1\n\n\nEvent (16)\nWill of the West (Core) x2\nThe Galadhrim's Greeting (Core) x2\nValiant Sacrifice (Core) x2\nLore of Imladris (Core) x3\nStand and Fight (Core) x3\nLorien's Wealth (Core) x2\nSneak Attack (Core) x2\n\n \n\nEowyn is for questing, the goal is to overload her so much with attachment like The Favor of the Lady to send only her and the Lorien Guides to questing, with the occasional Northern Tracker. I never used her in combat.\n\nBerevor is for card drawing. Give her Unexpected Courage, cycle the discards with Will of the West, and you will soon play with all your deck in hand. She can also fight when she got Unexpected Courage and you've got in your hand all what you need, but it's uncommon, at least until half the game.\n\nTheodred is the primary fighter (since Berevor is usually exausted from his ability) and, if the field is free, can be used to support a quest or two to marshall more resources.\n\nThe key is the first step of the quest:. You start with Threat 27, so you should have at least 3 round before he can engage you. Spent these to draw as many card you can. You will need cannon fodder and Forest Trap, at least. Forest Trap the Troll as soon you can. Now play slow. Draw cards. When you are ready for the next step kill the troll with Gandalf (or the sheer mass of alleys) and go on.\n\nSons of Arnor are here to help you ensare the Troll and juggle with enemies, Northern Trakers to  manage the eventuality of a Location overload in the second phase and are great fighters if you need them, all the Lore cards are here to help you cope with the inevitable bruises. No one must die.\nCuriosly I used Stand and Fight less than expected, but it's still useful, at least as a quick discard for Eowyn or Favor of the Lady.\n\nI found wise to literally overload Eowyn with attachment. 2 times out of three she ended the game with 2 Favor of The Lady, Steward of Gondor and Celebrian's Stone on her. With her and the Lorien Guides (and some other ally) and a firm control over the Staging Area I managed to earn something like 14 progress token in a single phase.\n\nIf you want to play for the score you can literally grind the scenario: at the end you will have all your deck in play or in hand and absolute control on the flux of the game, but you all know this already ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=489731","commentId":489731,"userName":"soupy89","timestamp":1308814457,"content":"2 copies of Protector seems redundant when you are playing Eowyn and 2 copies of Favor and Celeb. Wouldn't you rather throw in a Took or two and have some extra bodies? Protector is +1 will/defense IF you have an expendable card, whereas Took is a 1/1/1/2 for one extra resource no matter what's in your hand. Unless you are consistently discarding more than one card, the ally seems better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45681-scenario-2-how-to-beat-it-solo-play/?do=findComment&comment=489973","commentId":489973,"userName":"Aetius3","timestamp":1308839771,"content":"soupy89 said:\n\n2 copies of Protector seems redundant when you are playing Eowyn and 2 copies of Favor and Celeb. Wouldn't you rather throw in a Took or two and have some extra bodies? Protector is +1 will/defense IF you have an expendable card, whereas Took is a 1/1/1/2 for one extra resource no matter what's in your hand. Unless you are consistently discarding more than one card, the ally seems better.\n\n\n\n \n\nYes, an earlier version of this deck was exaclty like this, with 2 Took and no Protector. It was a close thing and probably functional but putted Eowyn under A LOT of stress. \nSpirit is already the backbone of this deck and Spirit cards are used more constantly than the others and putting even those Took made Spirit Resources really scarce.\nYes, Eowyn can became Steward of Gondor, but it will be a forced choice. Like this, instead, I can be more flexible and augment with the Stewardship the sphere I need the most in that moment.\nProtector helps Theodred (who DOESN'T like to tank like he must in this deck) and with this deck is almost impossible run out of easy discards for it, considering how Eowyn's ability is seldom used.\nOne Protector and one Took could still be a more balanced choice, since the randomess of the draws is severly reduced, with this deck.\n\nA good solution to use the 2 Tooks could be using Gloin instead of Theodred: he can marshal a lot of resources, helped by the healing of Lore, Berevor would be lightened (since there will be less Lore cards to play) and Eowyn could became Steward by default, at the cost of one round of preparation against the Troll..."}]}