{"url":"https://community.fantasyflightgames.com/topic/45688-expansion-cycles-shadows-of-mirkwood-and-beyond/","title":"Expansion cycles - &quot;Shadows of Mirkwood&quot; and beyond.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45688-expansion-cycles-shadows-of-mirkwood-and-beyond/?do=findComment&comment=458284","commentId":458284,"userName":"timbolton","timestamp":1303616585,"content":"First post here, I did check via the search function on here so apologies if this is repeating another thread.\n\nI've just bought the core set, really looking forward to playing the game, though I'll probably be more interested in solo play for now. What has grabbed me more is the adventure packs, I'm really excited about these expansions - especially the subject of the first series of six, the Hunt for Gollum.\n\nThere seems to be a theme running with upcoming LOTR stuff from this great-looking card game to the upcoming RPG by Cubicle 7, especially since the first set for the rpg is titled \"The One Ring: Adventures over the Edge of the Wild\" and covers the same locations - east of Rivendell over Misty Mountains, the surrounding area of Mirkwood and the Lonely Mountain. Maybe the upcoming Hobbit film has influenced that so some extent, but I'm definitely not complaining since the Hobbit is one my most treasured books.\n\nI've been scouring the internet for news of the adventure packs and it seems we only definitely have the name for the first three packs of the \"Shadows of Mirkwood\" cycle. There is a small low-quality image of the six box line up for the \"Shadows of Mirkwood\" in the interview [http://www.fantasyflightgames.com/edge_news.asp?eidn=1981] with Nate French, so with the magic of PhotoShop and information provided in the interview, I've been able to get the names of the whole lineup for \"Shadows of Mirkwood\". Once those are out and news of the next line comes out, I'll post it here too.\n\nAdventure Packs line: Shadows of Mirkwood\n\n * The Hunt for Gollum\n * Conflict at Carrock\n * A Journey to Rhosgobel\n * The Hills of Emyn Muil\n * The Dead Marshes\n * Return to Mirkwood\n\nLooking forward to each and every release!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45688-expansion-cycles-shadows-of-mirkwood-and-beyond/?do=findComment&comment=458309","commentId":458309,"userName":"FiendishDevil","timestamp":1303620385,"content":"From rereading the announcements for the first three packs, it looks like each pack will come with 1 hero and 9 unique cards for boosting the spheres. The rest is scenario cards and encounters. 60 cards per pack...\n\n1 hero = 1 card or will we get three copies?\n\n9 uniques at 3 copies = 27 cards\n\n1 scenario + encounters = 30 cards or 32 if only 1 copy of the hero\n\n \n\nProbably looking at 10 unique cards for scenario + encounters, 3 of which are the scenarios. Meaning probably 7 unique new encounter cards. 2 locations, 1 boss, 1 or 2 VP uniques, 3 to 4 grunts/events.\n\n \n\nJust a little guesswork..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45688-expansion-cycles-shadows-of-mirkwood-and-beyond/?do=findComment&comment=458319","commentId":458319,"userName":"faith_star83","timestamp":1303622607,"content":"I am almost sure we only see one hero. Three of them make no sense since even when you play multiplayer, you can only have one Bilbo! (Only my guess though).\n\nI am also really excited for the new adventure packs, somebody already figured out the names of the packs a little while back. I am really looking forward to Hills of Emyn Muil!\n\nI actually we see some originality in the encounter decks, I guess its 3-4 quest cards and then a mix of Treachery, Enemy and Locations. Hopefully also Objectives...and maybe something new? \n\nI wonder how the 9 player cards will be distributed among the 4 spheres...maybe the sphere getting Bilbo (Lore) gets one card less?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45688-expansion-cycles-shadows-of-mirkwood-and-beyond/?do=findComment&comment=458320","commentId":458320,"userName":"timbolton","timestamp":1303622832,"content":"I can probably add the hero info for only \"The Hunt for Gollum\". The others are unknown, though names are mentioned, they seem to be more likely allies than hero cards - for example Radagast.\n\nAdventure Packs line: Shadows of Mirkwood\n\n * The Hunt for Gollum (Hero: Bilbo Baggins)\n * Conflict at Carrock\n * A Journey to Rhosgobel\n * The Hills of Emyn Muil\n * The Dead Marshes\n * Return to Mirkwood"}]}