{"url":"https://community.fantasyflightgames.com/topic/45695-lore-of-the-ring-the-time-period-and-events-during-the-game-setting/","title":"Lore of the Ring - The time period and events during the game setting","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45695-lore-of-the-ring-the-time-period-and-events-during-the-game-setting/?do=findComment&comment=458317","commentId":458317,"userName":"timbolton","timestamp":1303622473,"content":"Thought I'd add a little background information to the actual game setting here, just in case there are players who came into this from the films rather than the books.\n\nPlease note if you haven't looked at the books at all there will be SPOILERS for the upcoming adventure quest line, \"Shadows of Mirkwood\".\n\n \n\n \n\nWe know that the LOTR CG is set in the 17 years between Bilbo leaving the Shire to live in Rivendell and Frodo setting off with the One Ring on the quest we all know so well. Below is part of the timeline that appears in the collected \"The Lord of the Rings\" or with \"The Return of the King\" if you have the book in three parts.\n\nThe Lord of the Rings, pages 1090-91\n\nT.A. = Third Age of Middle Earth\n\n * T.A. 3001............  Bilbo's farewell feast. Gandalf suspects his ring to be the One Ring. The guard on the Shire is doubled. Gandalf seeks for news of Gollum and calls on the help of Aragorn.\n * T.A. 3002............ Bilbo becomes a guest of Elrond, and settles in Rivendell.\n * T.A. 3004............ Gandalf visits Frodo in the Shire, and does so at intervals during the next four years.\n * T.A. 3007............ Brand son of Bain becomes King in Dale. Death of Glrean.\n * T.A. 3008............ In the Autumn Gandalf pays his last visit to Frodo.\n * T.A. 3009............ Gandalf and Aragorn renew their hunt for Gollum at intervals during the next eight years, searching in the vales of Anduin, Mirkwood, and Rhovanion to the confines of Mordor. At some point during these years Gollum himself ventured into Mordor, and was captured by Sauron. Elrond sends for Arwen, and she returns to Imladris; the Mountains and all the lands eastward are becoming dangerous.\n * T.A. 3017............ Gollum is released from Mordor. He is taken by Aragorn in the Dead Marshes, and brought to Thranduil in Mirkwood. Gandalf visits Minas Tirith and reads the scroll of Isildur.\n * T.A. 3018............ 12 April. Gandalf reaches Hobbiton.\n * T.A. 3018............ 20 April. Sauron attacks Osgiliath. About the same time Thranduil is attacked, and Gollum escapes.\n\nThere is a chapter on \"The Hunt for the Ring\" in JRR Tolkien's \"Unfinished Tales\" (pages 436-459) where Aragorn's capture of Gollum is further elaborated on from the listing above and also there is more elaboration on the hunt for the One Ring that eventually leads to the Shire as we know from the start of The Lord of the Rings.\n\nThe \"Shadows of Mirkwood\" quest series is very much based then on the above events, something that makes it even more interesting to me, since it's part of Middle Earth lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45695-lore-of-the-ring-the-time-period-and-events-during-the-game-setting/?do=findComment&comment=458456","commentId":458456,"userName":"Hastur360","timestamp":1303657039,"content":"Great knowledge and thanks for putting it all up here saves me some time looking it all up.:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I think the setting is very interesting as well since it is steeped in lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45695-lore-of-the-ring-the-time-period-and-events-during-the-game-setting/?do=findComment&comment=458605","commentId":458605,"userName":"Narsil0420","timestamp":1303697642,"content":"Great post! In light of this I really hope to see a \"guarding of the shire\" scenario or even a whole series on it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45695-lore-of-the-ring-the-time-period-and-events-during-the-game-setting/?do=findComment&comment=504308","commentId":504308,"userName":"timbolton","timestamp":1311649075,"content":"Thanks!\n\n\nBumping this thread now the first expansion is supposedly out! Not seen it myself as yet boo! :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45695-lore-of-the-ring-the-time-period-and-events-during-the-game-setting/?do=findComment&comment=505831","commentId":505831,"userName":"Iver2","timestamp":1311910780,"content":"Great timbolton!\n\nAs a Tolkien fanatic myself I love your event time line. And yes, the part in \"Unfinished tales\" is absolutely worth reading.\n\nGuys, there is acctually a great fan movie called \"Hunt for Gollum\". Watch it, its stunning for a \"few bucks\" production. As the title suggests, its Aragorn's Hunt for Gollum in the Anduin valley. ( http://www.thehuntforgollum.com/ [http://www.thehuntforgollum.com/])\n\nThere is also another movie which i even liked more, its called  \"Born of Hope\".  Born is, guess who? Aragorn! And we see his father Arathorn in action. Stunning one as well. ( www.bornofhope.com )\n\nOther than than, i can only advise everyone to read all books from Tolkien out there. Honestly, the more other fantasy i read, the more i realize that Tolkien is so unspeakably unique, that I can't find words. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}