{"url":"https://community.fantasyflightgames.com/topic/45690-played-a-four-player-match/","title":"Played a four player match!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45690-played-a-four-player-match/?do=findComment&comment=458303","commentId":458303,"userName":"FiendishDevil","timestamp":1303619313,"content":"Today I taught three friends how to play and we played through Mirkwood and the River. Wow! Multiplayer is so different than solo play! I must say that this game positively shines in multiplayer!\n\nThe play through of Mirkwood with four players was very, very easy. We could have stalled to rack up infinite threat reduction combos. As a learning scenario -- so fun!\n\nAfter stomping that scenario, we moved on to the River scenario. Off the bat, this scenario was SO scary. The setup was very daunting! We weren't sure the rules of the setup, so we played the setup as if it was a Stage -- meaning we surged, we use When Revealed effects. Which was very bad -- we managed to get the troll out with a bunch of others simply because we drew the card that auto played X more encounter cards! I was glad when we flipped over the 1A quest that we didn't have to fish for another troll! Phew!\n\nI really enjoyed this scenario though! It was very climatic! We managed to stall by Forest Rooting the troll, clearing out the staging area and accumulating progress, then slaying the troll to move on to 2B. Holy crap! I love the game play mechanics on this! The mechanics fit with the theme very well! It really did seem like you were on a boat with enemies coming at you from all sides! And then beating that off, we landed onto 3B. A little easy at this point, we had already cleared the deck of all the difficult VP locations and monsters.\n\nI really wanted to play the final scenario, but it was getting late.\n\n \n\nMy synopsis? This game is amazing and chapter packs are going to add a lot more options! I'm really excited to see what's coming down the pipe.\n\n \n\nThat said. Green is really boring to play -- but totally helpful in a multiplayer game. When push comes to shove, I'd argue that blue and purple are definitely the strongest colors at the moment. Will post up my deck builds sometime later...I think they are fairly strong. Do note that I am running three core sets. In order to build 4 solid decks, it is a must have to get three cores."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45690-played-a-four-player-match/?do=findComment&comment=458355","commentId":458355,"userName":"Troymk1","timestamp":1303634774,"content":" Seems we had a similar experience. \n\n \n\njavascript:void(0);/*1303652802857*/ [http://www.boardgamegeek.com/thread/645721/4-player-experience]"}]}