{"url":"https://community.fantasyflightgames.com/topic/45715-bilbo-aragorn-theodred-fast-win/","title":"Bilbo + Aragorn + Theodred = Fast win","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45715-bilbo-aragorn-theodred-fast-win/?do=findComment&comment=458495","commentId":458495,"userName":"mason240","timestamp":1303663281,"content":" I just got done running the second scenario with a leadership/lore deck using the spoiled version of Bilbo Baggins [http://lotrlcg.com/cardFocus.php?Title=Bilbo%20Baggins]. \n\nIf you haven't seen it yet, he allows the first player to draw an additional card. Playing solo means you get to draw 2 every turn, and helps make an already fast deck like leadership even faster. Because I was using Theodred (After Theodred commits to a quest, add on resource to another hero's pool) I was able to give Bilbo 2 resource a turn. By playing Son of Arnor I was able to enage the Hill Troll during the Planning phase, which together with the extra resource allowed me to put a Forest Snare on the Troll in round 2 before he was able to attack me.\n\nDrawing the extra cards let me quickly  get to Steward of Gondor (then I was at 6 resources a turn) and Celebrian's Stone (giving Bilbo +2 willpower). I was able to Sneak Attack with Gandalf 2 twice. Because Bilbo was getting 2 resource a turn, I was able to get out 2 Daughter of the Nimrodels. My final score was 27.\n\nBy using this combo you area able to draw the same number of cards and generate the same amount of resources as 2 players, Once The Hunt for Gollum is released, I think will be a very powerful deck for solo play. \n\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45715-bilbo-aragorn-theodred-fast-win/?do=findComment&comment=458499","commentId":458499,"userName":"Titan","timestamp":1303664797,"content":"30 card deck or did you bump it up to 50? Either way, looks like a great addition for a lore/leadership deck. I haven't tried them together yet, but I think these decks will work well to in general. Leadership is the best all around and lore is full of control and healing. I won't play with him spoiled, though. I have a thing about having the actual card to use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45715-bilbo-aragorn-theodred-fast-win/?do=findComment&comment=458524","commentId":458524,"userName":"faith_star83","timestamp":1303670387,"content":"Nice idea, I didn't even think about using spoiled cards already ;-)\n\nI love Theodred, his a real multi-sphere enabler as you can get the same amount of resources for your one character sphere. Netting an extra card every turn with Bilbo seems the perfect match!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45715-bilbo-aragorn-theodred-fast-win/?do=findComment&comment=458534","commentId":458534,"userName":"jogo","timestamp":1303674905,"content":"Why the extra willpower for bilbo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45715-bilbo-aragorn-theodred-fast-win/?do=findComment&comment=458552","commentId":458552,"userName":"qwertyuiop","timestamp":1303680874,"content":"jogo said:\n\nWhy the extra willpower for bilbo?\n\n\n\nBecause he's only useful for questing outside his ability, and it doesn't look like there are any Spirit cards being played. "}]}