{"url":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/","title":"Core deck sizes and deck building in general","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=458660","commentId":458660,"userName":"DerBarchen","timestamp":1303711885,"content":"So by the sizes of the decks in the core set (30 for each sphere) it seems that the intention is for you to try out each sphere on its own againts the starting scenario and then build a 50, split-sphere tournament deck. Atleast thats the only reason that I can find for you to need \"a second core set for up to 4 players\" (apart fromthe fact that the other two players will need pen and paper to keep track of their threat. GOD FORBID!)\n\nI was wondering if I was the only one who decided to just run 30 decks (even when mixing spheres) atleast untill more cards are added to the pool. It seems really convenient to stick at 30 untill there are more genuinely usefull cards in the pool (especially in single player where a good handfull of the cards dont really work) I did the same with Game of Thrones, I stcuk with 40 and then moved up to 50 and then to tournament 60 as I bought more cards.\n\nI was just wondering if Im the only one who thought this about the core set, would it be \"cheating\" in some sense to just stick with 4 decks of 30? It just seems more economical to me (both draw wise and money wise) to do so, do other people who run 50 card decks find their draw is cluttered with useless cards in solo play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=458662","commentId":458662,"userName":"Acererak","timestamp":1303713281,"content":"I think your decision is quite valid, and from a gameplay perspective auto balances itself, so to speak. You have less cards in your deck which is usually better (your combo cards will come faster and more often) but on the other hand, you have less copies of each and thus, less chances to play them during a game.\n\nSo I don´t see a major need of getting both cores unless you really like to start deck building with tournament rules in mind. For a four players games I also think the same. The game escalates in difficulty backwards as well, the more players, the easiest it is. So having less powerful decks (one core mono sphere starter decks) balances this fact a bit.\n\nThe problem might come if you would like to deckbuild (multi sphere decks) AND have three or four players. Then I would strongly recommend getting the second copy of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=458663","commentId":458663,"userName":"Ahzrab","timestamp":1303713309,"content":"Since you don't play a tourney, it's totally okay to run with 4 30 card decks.\n\nI must say, the gameplay gets more difficult if you run with a split sphere 50 card deck (And if you don't take Leadership as a sphere)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=458667","commentId":458667,"userName":"DerBarchen","timestamp":1303714560,"content":"Ahzrab said:\n\nSince you don't play a tourney, it's totally okay to run with 4 30 card decks.\n\nI must say, the gameplay gets more difficult if you run with a split sphere 50 card deck (And if you don't take Leadership as a sphere).\n\n\n\nAye I expecterd as much since youre constricted by a limited card pool youll end up having to use cards that may not be particularly usefull, especialy in solo play. Im sure a few adventure packs will sort these problems out!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=459102","commentId":459102,"userName":"InfernalZebra","timestamp":1303783596,"content":"Ahzrab said:\n\nSince you don't play a tourney, it's totally okay to run with 4 30 card decks.\n\nI must say, the gameplay gets more difficult if you run with a split sphere 50 card deck (And if you don't take Leadership as a sphere).\n\n\n\nI definitely think I will have to go with the 30-card deck idea until more cards come out. It appears impossible to build a decent 50-card deck without somehow using Leadership, as you say. Without either Théodred, Steward of Gondor, or Celebrían's Stone + Aragorn (if you're running Leadership and Spirit) there is no reliable way to pay for any of your cards in any reasonable fashion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=459476","commentId":459476,"userName":"Kitsune Rei","timestamp":1303832489,"content":" I don't see why not. I was thinking about it, I don't think 1 box can really support more than 2 people customizing their decks because the good cards get scooped up and they're pretty important to have- watering down your good cards makes the game a lot harder. We ended up getting a box for each of us because we were really into deckbuilding, but we're also trying to be patient for more cards to come out, then things will be better :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] There's no way to build a monocolor 50 card deck yet. I'll also admit I've proxied a couple cards I really wanted to have 1 more of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=459503","commentId":459503,"userName":"qwertyuiop","timestamp":1303836690,"content":" Someone should come up with a draft variant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=459597","commentId":459597,"userName":"faith_star83","timestamp":1303849182,"content":"I actually run 2 35 card split-sphere decks. As there are so few usable cards in the core set and the difficulty in singleplayer is very high I decided to build the strongest decks I could. And that meant leaving some of the cards out, because they do nothing but sit on my hand. Forcing yourself to build a 50 card deck at this point just gets in the way of fun. Unless you own more than one core set!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=459797","commentId":459797,"userName":"Magus Edge","timestamp":1303900117,"content":" I have 2 core sets and it is still very difficult to make a mono-sphere 50 card deck without having wasted cards in the way.  The closest I've come to a legit tournament deck is a Leadership/Spirit deck and its floating around mid 40s for card count."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=459868","commentId":459868,"userName":"Bohemond2","timestamp":1303906248,"content":"I tend to take the opposite approach.  Thirty card decks, as you stated, are starters designed for initial experimentation with the game.  if you are building decks, you should try to hit 50 cards, if possible.  For multi-sphere decks, you have enough cards to play with 50.  In my mind, playing with smaller card count artificially lowers the difficulty of the game. I tend to find posts which brag about low victory point totals, and then reveal that they are not playing with legal decks irksome.  Its  a solo game, enjoy it however you want.  But I view 40 card decks the same way I would view someone who played with 10 Gandalf cards or decided that each character should get two resources every turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=460577","commentId":460577,"userName":"DerBarchen","timestamp":1304001200,"content":"Bohemond said:\n\nI tend to take the opposite approach.  Thirty card decks, as you stated, are starters designed for initial experimentation with the game.  if you are building decks, you should try to hit 50 cards, if possible.  For multi-sphere decks, you have enough cards to play with 50.  In my mind, playing with smaller card count artificially lowers the difficulty of the game. I tend to find posts which brag about low victory point totals, and then reveal that they are not playing with legal decks irksome.  Its  a solo game, enjoy it however you want.  But I view 40 card decks the same way I would view someone who played with 10 Gandalf cards or decided that each character should get two resources every turn. \n\n\n\nThis is really why I made this thread. I feel like that too sometimes but I agree (obviously) with the majority voice here that its very hard to make a decent 50 card deck, even With two spheres in it. I think you can make some decent 3 sphere decks but not really for solo play, eventually you just get outnumbered because youre not throwing out cards quick enough (I did make a Tactics/Spirit/Lore Tri-Sphere deck and it worked remarkably well)\n\nIm not saying its impossible to make decent 50 decks with the core set (especially if people bought 2, the rich buggers =P ) but it is hard and mainly confined to solo play. I just find its a lot more benificial for you as a serious player in general to play with a deck that helps you familirarise yourself with every card you have without runing your play experience. As I said in a different thread, your learning experience is cut short if youve been bum-rushed by orcs and lost the game 5 draws in.\n\nAt the end of the day as long as youre not in a tournament it doesnt really matter how you play. I was just wondering if I was the only one who thinks that its tough to make tournament decks with Core-sets alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=526543","commentId":526543,"userName":"player559363","timestamp":1315675837,"content":"My wife and I just ran into this situation last night.  We made two, 50 card, dual-sphere decks according to the tournament rules.  We played the Anduin Quest that came with the core set, and made it to the 3rd phase in the quest.  We found that our decks were too watered down with cards that were simply not helpful enough. \n\nI don't think it is cheating at all to play with a smaller deck if you don't have two core sets.  The reason I think this is because, you don't have enough cards to get 3 copies of the best ones into your deck of 50 (i.e. if you are playing with 2 people, each player can only have a maximum of 2 Gandalfs).  There is an obvious advantage to having three copies of Gandalf instead of two in yoru deck.  However, if the deck size is smaller (say 30, or some other number as people have suggested), then the disadvantage goes away becacuse relative to your smaller deck size having two Gandalfs is about the same as having three Gandalfs in a deck of 50.\n\nDoes anyone else seem to think that the rules of this game do not seem to be fully flushed out? (even though the game is a ton a fun).\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=526839","commentId":526839,"userName":"The Strolling Bones","timestamp":1315760859,"content":"I also feel that the number of player cards is rather restrictive currently, although I said from the beginning that this game would take about a year to really hit its stride. With roughly 21 different cards (some have 3 copies others 2 and still others only 1 with one core set) for each sphere and this is including the 3 official Adventure packs the idea of tournament legal 50 card mono sphere decks is questionable at best. The adventure packs are also only giving 3x 2-3 cards per sphere for player cards so it will be quite sometime until there are enough options where it is not required to run the weaker cards in your decks. Although I do have a feeling that some of these weaker cards are going to find combos in the future and so they will be worth inclusion.\n\nThe deck building and co-op elements are what initially drew me to this game, however I find myself playing solo games more often than not and having a hard time building decks due to the lack of options.\n\nIn time this will improve however, I'm certain of that fact.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45743-core-deck-sizes-and-deck-building-in-general/?do=findComment&comment=526869","commentId":526869,"userName":"marlow4","timestamp":1315770517,"content":"Each adventure pack, each deluxe expansion, each player card gets us a little closer to mono sphere perfection.\n\nI'm totally prepped. I have deck sleeves in purple, red, blue, and green. Don't have a purple metal Rook case, though. Somehow I ended up with like 300 blue card sleeves and I don't know why. The game I used to play a lot was GoT CCG, but I had various sleeve colors for the different houses. No idea why I bought so many blue sleeves. I'll have to borrow Doc Brown's dolorean and see what my past self was up to.\n\nMaybe it's a sign that I should focus on playing mono Spirit? Roll the bones, consult the oracle!"}]}