{"url":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/","title":"Journey Along the Anduin: Single Player (score: 3!!!) ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459144","commentId":459144,"userName":"Iron-on Ghost","timestamp":1303790480,"content":"I somehow managed to score super low on Anduin Using primarily an all Spirit Deck. I did however use Beorn [http://lotrlcg.com/cardFocus.php?Title=Beorn] as my beefcake to take the hits of the Hill Troll [http://lotrlcg.com/cardFocus.php?Title=Hill%20Troll]. I also continued to rock out my Threat using The Galadhrim's Greeting [http://lotrlcg.com/cardFocus.php?Title=The%20Galadhrims%20Greeting]. The key ingridient to my deck was Stand and Fight. [http://lotrlcg.com/cardFocus.php?Title=Stand%20and%20Fight]. With Stand and Fight I was able to bring out Beorn after discarding him with Eowyn [http://lotrlcg.com/cardFocus.php?Title=Eowyn]'s ability to discard and up her Willpower. I also run Gleowine [http://lotrlcg.com/cardFocus.php?Title=Gleowine] to help run through my cards for Beorn and or Stand and Fight. I run all three heroes and always leave Eleanor [http://lotrlcg.com/cardFocus.php?Title=Eleanor] ready to deal with those pesky Necromancer's Reach [http://lotrlcg.com/cardFocus.php?Title=The%20Necromancers%20Reach]es among other things in hopes to keep my damage low. Any The Favor of the Lady [http://lotrlcg.com/cardFocus.php?Title=The%20Favor%20of%20the%20Lady] that comes up goes to Eowyn. I reshuffle the deck once I use both Galadhrim's Greetings using Will of the West [http://lotrlcg.com/cardFocus.php?Title=Will%20of%20the%20West]. So with all this the most of it is getting my threat down low and managing it and keeping a bunch of cards in hand. In the end I had all cards in hand except what was in the discard pile, and on the last level if I wanted to just pull it along I suppose I could have reducing my threat to even less and having the last creature sit there until I was ready, but I got impatient and rocked his little world. Dunhere [http://lotrlcg.com/cardFocus.php?Title=Dunhere] is GREAT for creature management once they are unable to engage you. Now If I could only figure out how to take on the Prison solo.... so hard.\n\nIf you see anything you dont understand let me know and I will explain more. Also This was not a 50 card deck as I only have 1 core set and Didnt want to muddy up the mechanics with a second sphere. So might not be as good if running a 50 card deck. but hopefully with the next set I will be able to make it work on a full Spirit Mechanic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459174","commentId":459174,"userName":"Iron-on Ghost","timestamp":1303798387,"content":"Update: Realized I didnt add victory points... but I did play again and got a score of  -11. Even better. Dream team for me. At the end i can just kite the last creature and zap my threat with gandalf and the Galadhrims Greeting. Beorn for the win!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459175","commentId":459175,"userName":"Sky","timestamp":1303798546,"content":"How did U use Beorn in all spirit deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459177","commentId":459177,"userName":"Iron-on Ghost","timestamp":1303799057,"content":"Sky said:\n\nHow did U use Beorn in all spirit deck?\n\n\n\nAs mentioned above Stand and Fight [http://lotrlcg.com/cardFocus.php?Title=Stand%20and%20Fight] allows me to play allys from the discard and it has in paratheses (can be from any sphere). So I play Beorn and Gleowine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459195","commentId":459195,"userName":"Sky","timestamp":1303801555,"content":"Ok. But whose discard pile it was?\n\nYou can use discard pile - correct. But who did put that card there in a single player game??\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459198","commentId":459198,"userName":"wookie78","timestamp":1303802060,"content":" He discarded Beorn into his discard pile from his own hand by using Eowyn's ability (discard a card to gain +1 willpower).  Quite sneaky... demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459202","commentId":459202,"userName":"Sky","timestamp":1303802548,"content":"Grats on finding that loop. I hope it will be fixed and plastered in the first FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459205","commentId":459205,"userName":"BeardFan","timestamp":1303802863,"content":"No need to fix that loophole. That's the way LCGs should work. Think outside the box. Cool deck idea. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459208","commentId":459208,"userName":"Sky","timestamp":1303803489,"content":"I think it is not correct to allow one deck to play any card it wants (ally so far) for no additional penalty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459223","commentId":459223,"userName":"Troymk1","timestamp":1303805609,"content":" Sky that's exactly how it works !!\n\n \n\nDeckbuilding is ALL about getting the biggest bang for the lowest cost!\n\n \n\nRecently I grabbed Faramir from someones discard pile while I had 6 questing characters a turn. How nice was that !\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459236","commentId":459236,"userName":"Sky","timestamp":1303807141,"content":"Troymk1 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIn a MP game it is fully legitimate. If You choose someone's \"Dead\" Ally and pay its cost -> U get it under control.\n\nMy concern is whether can U have in Your deck cards, YOU CANNOT legitimately play.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459238","commentId":459238,"userName":"ClydeCloggie","timestamp":1303807734,"content":"Great play, brilliant work on playing Beorn this way...no need to ban this IMO, it's exactly what makes good players stand out in CCGs/LCGs. I would also not call this broken as the route through the discard pile requires quite a lot of work (draw Beorn, use Eowyn or other discard effects to get him into discard, then play the fishing event...you would normally look at quite a number of rounds before Beorn hits the table.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459248","commentId":459248,"userName":"Sky","timestamp":1303809126,"content":"For me it is too far from the deckbuilding and to cloce to ruleabusing :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png].\n\nI respect Your opinion. But in mine it abuses the play and the balance of the decks. All those cards are +1 will forced events in Your hand. If you limit. their number to 5-6 they are just free added value (in the worst case).Add some allies like DotN and she would give the deck healing ability. The greatest drawback of spirit deck neutralized! The more powerful allies will show up in the game the more powerfull the SPIRIT phase will happen.\n\nShould You run out of the SaF cards there is always DTomb waiting. So in the longer plays You can easily get 2-3 of them into every play.\n\nI don't think designers will find it as a part of metagame though. Time will tell. Great kudos for finding it are still given :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459251","commentId":459251,"userName":"BeardFan","timestamp":1303809686,"content":"This combo is not broken in any way, so there's no need for banning or a FAQ. This is because you have to \"pay\" more to play Beorn this way. While the deck with a corresponding sphere only needs Beorn's card and 6 resources, the spirit deck needs Beorn's card, Eowyn's ability and an additional card and still you have to pay 6 ressources. So thats 4 conditions to meet instead of 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459257","commentId":459257,"userName":"Sky","timestamp":1303810789,"content":":) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Only 3. Her ability is free and always available. AND you will not waste Your spirit cards to use it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459274","commentId":459274,"userName":"Ahzrab","timestamp":1303812763,"content":"Sky said:\n\n:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Only 3. Her ability is free and always available. AND you will not waste Your spirit cards to use it.\n\n\n\nWell Eowyn can die and it only works once each round. If you consider this combo broken, then what's with Aragorn and Celebrian's Stone?\n\nSpirit has a good base ability and some nice faction cards but imo it isn't as ridicolous strong as Leadership and Lore.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459283","commentId":459283,"userName":"Oshio","timestamp":1303813700,"content":"I took this idea one step further and built a full 50 card deck. It's a lot tricker as it's harder to see your key cards, but it's actually a very solid deck. Like all things in this game (for now at least) it is dependant on luck to an extent: a horrible draw from the shadow deck or your own deck will undo you, but I think it is fairly consistant.\n\nThe basic premise of the deck is simple: utilize spirits amazing threat reduction to keep yourself under the radar while questing with their powerful questers (Eowyn, Northern Tracker and Lorien Guide.) Discard all of your 'out of sphere' guys to fuel Eowyn's ability, then bring them into play with Stand and Fight. Use Dwarven Tombs and Will of the West to get your Stand and Fight's back. Dwarven Tomb can also be used to re-use Galadhrim's Greeting. The most powerful part of this deck is that you have more control over the game than with any other deck I've played. You keep your threat low, snipe bad guys with Dunhere, avoid nasty cards with Eleanor, Test of Will and Hasty Stroke. I beat the second scenario fairly easily the first time I played this, though it (barely) beat me the second time, mostly due to the second Hill Troll cropping up right at the beginning of quest 2 right around the time I ran completely out of cards due to not seeing my Gleowine.\n\nThe most obvious shocker is how many out of sphere guys are here. Honestly there isn't much else to fill the deck up with and it works pretty well. Even if you only see 2x Stands and 2x Tombs, that's 4 very powerful guys you can put out. Gandalf is also essential for his threat reduction and utility. All these guys are getting discarded to Eowyn anyway, so they are serving another purpose as well.\n\nHeroes (not the greatest combo, but **** it's nice to start with such low threat)\n\nEowyn\n\nEleanor\n\nDunhere\n\nAllies\n\nLorien Guide x3\n\nNorthern Tracker x3\n\nWandering Took x3\n\nOut of Sphere Allies\n\nGandalf x3\n\nGleowine x3 (Yes he's unique, but it's worth it to find him.)\n\nFaramir x3 (See above)\n\nBeorn x2\n\nDaughter of Nimrodel x3\n\nAttachments\n\nThe Favor of the Lady x3 (All goes on Eowyn)\n\nUnexpected Courage x3 (All goes on Dunhere)\n\nEvents\n\nStand and Fight x3 (Key)\n\nDwarven Tomb x3 (Key)\n\nThe Gladhrim's Greeting (Key)\n\nWill of the West x3 (Allows the deck to theoretically work infinitely)\n\nA Test of Will x3 (Always nice to have 1 of these in hand + 1 extra resource available)\n\nHasty Stroke x3 (Same as above)\n\nLight in the Dark x3 (Kind of useful to buy yourself an extra turn to reduce your threat or get rid of a guy once your threat is reduced below his level...but I certainly wouldn't have 3x in here if there was a better card available.)\n\n \n\nStrengths:\n\n* Allows you to utilize several very powerful key characters from other spheres without having to worry about the resource crippling dual-sphere decks suffer from.\n\n* Spirit threat reduction buys you much more time than most decks, allowing you a few extra turns to get your combo's in place. Once you have a strong established base, you can theoretically reduce your threat forever and be untouchable while still dealing with threat buildup through your awesome location-killers and Dunhere.\n\n* You start out with an awesome quester right away, ensuring you won't suffer from any early game threat bumps.\n\nWeaknesses:\n\n* Like all decks that are not Lore, this suffers horribly from a lack of card draw. Gleowine is very necessary, but the deck really needs something else. This game could really use a neutral Gleowine-like character.\n\n* If you get a crappy draw, you're in trouble. The mulligan rule helps that a lot, but sometimes you'll end up with a hand full of out of sphere characters and nothing to do with them. Though you have a few extra turns to deal with that because of your low threat, it can still kill you if the shadow deck gets a good draw.\n\n* The deck is fairly expensive. This isn't that big of a deal - 2 turns is worth a Beorn, and this deck isn't putting characters out as fast as other decks, instead relying on fewer, more powerful characters. But it is still expensive, and honestly only Leadership has a great resource engine.\n\nPossible Changes:\n\n* Swapping Eleanor for Aragorn. You lose a major advantage (your starting low threat) and you are open to a turn 2 Troll attack unless you draw well, but you gain a major resource boost with the attachements he can bring in. Aragorn works best here because of his 'gain the spirit icon' attachment, but theoretically you could bring someone cheaper in just to unlock Steward of Gondor + their 1 resource guy.\n\n* Swapping Eleanor for Berevor. This is a more viable option in my mind as your threat isn't nearly as bad (27) and Berevor singlehandedly solves your card draw problem. She can also purchase Gleowine turn 2 'honestly', and makes Daughter of Nim make more sense. But your Spirit resources take a pretty sizable hit, as it now takes a solid 3 turns of production to get Beorn out, and it makes it much harder to 'save' a couple resources for your cancellation cards.\n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459284","commentId":459284,"userName":"Oshio","timestamp":1303813736,"content":"Ahzrab said:\n\n \n\n \n\nWell Eowyn can die and it only works once each round. If you consider this combo broken, then what's with Aragorn and Celebrian's Stone?\n\n \n\n \n\n \n\n Or Steward of Gondor + Anything :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459286","commentId":459286,"userName":"sputang","timestamp":1303813997,"content":"Nice session report. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Would you mind listing your deck makeup?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459310","commentId":459310,"userName":"Oshio","timestamp":1303815825,"content":"Oh I forgot another possible change to that above decklist: add Theodred instead of Aragorn. Your threat is still super low, he singlehandedly fixes your resource problem with his ability and SoG. The only thing you're missing is more card draw, which can still bring the deck to a crippling halt."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459325","commentId":459325,"userName":"CrowOfPyke","timestamp":1303817154,"content":"ClydeCloggie said:\n\nGreat play, brilliant work on playing Beorn this way...no need to ban this IMO, it's exactly what makes good players stand out in CCGs/LCGs. I would also not call this broken as the route through the discard pile requires quite a lot of work (draw Beorn, use Eowyn or other discard effects to get him into discard, then play the fishing event...you would normally look at quite a number of rounds before Beorn hits the table.)\n\n\n\n \n\nI agree.  This is a \"legitimate play\" because it uses quite the 3 card combo that you have to set up.  Brilliant insight to find this one too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459331","commentId":459331,"userName":"Titan","timestamp":1303817864,"content":"CAlexander said:\n\nOh I forgot another possible change to that above decklist: add Theodred instead of Aragorn. Your threat is still super low, he singlehandedly fixes your resource problem with his ability and SoG. The only thing you're missing is more card draw, which can still bring the deck to a crippling halt.\n\n\n\n\n \n\nWith Theodred, you could use Sneak Attack to bring Beorn in on the cheap for one turn, as long as you don't use his ability, then return him to your hand and then discard him on the next turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459332","commentId":459332,"userName":"Oshio","timestamp":1303817969,"content":"After thinking about it, ensuring it worked and playing around with some cards, I think this deck works best splashed with Spirit, namely Theodred.\n\n* Your resources are much more stable, as mentioned earlier. Between SoG and his own ability you more than make up for losing the 1 Spirit per turn that Elanor provides.\n\n* Celebrian's Stone is awesome on Eowin.\n\n* Snowborn Scout is really good and can still be played turn 1. He synergizes well with Spirit's 'anti-location' theme. Also, in a pinch, you can buy Faramir 'honestly'.\n\n* Most importantly, it allows access to Sneak Attack. This not only hands you the awesome Sneak Attack/Gandalf combo, but allows you to Sneak in the allies that might be clogging up your hand if you don't see early Stand and Fight's.\n\n* One last thing: you have super Rohan-trifecta flavor!\n\nI've put together a prototype now and will post results in a separate thread. Sorry for the highjacking :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459390","commentId":459390,"userName":"Sky","timestamp":1303822791,"content":"I do not want to break Your holiday, but before engaging even more should You answer whether page 4 of instruction clearly bans it?\n\nSpheres of Influence\nThere are four different spheres of influence in The\nLord of the Rings: The Card Game, and each has its\nown distinct flavor and identity. Most player cards fall\nunder one of these spheres, represented by a unique\nicon, as well as by a unique color on its card border.\nEach hero has an emphasis in one of these four spheres.\nA hero’s sphere dictates the types of cards that hero\nallows a player to use.\n\nIf You do not have proper hero You cannot use OOH cards in Your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459395","commentId":459395,"userName":"Titan","timestamp":1303823640,"content":"But you are using a card from your own sphere. The issue is whether the abilities on said cards allow you to bring in allies from other spheres.  Stand and Fight clearly says that it does. Sneak Attack is not specific, but does not contradict it, either. You are paying the cost of the card, not the cost of the ally. And if indeed the idea is to ban the use of allies belonging to different spheres in decks, then I find that to be a restraint on creativity and ingenuity that should not happen in a card game unless there are specific game breaking results derived from it. I don't see any, so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459400","commentId":459400,"userName":"Sky","timestamp":1303823833,"content":"If the fact, that ad hoc created deck beat second quest twice in the row does not convince You, nothing will :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459406","commentId":459406,"userName":"Ahzrab","timestamp":1303824800,"content":"Sky said:\n\nIf the fact, that ad hoc created deck beat second quest twice in the row does not convince You, nothing will :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\n\n\nI'm convinced if you play 100 games and win 99%.\n\n2 games hardly count as a benchmark."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459415","commentId":459415,"userName":"Apophenia","timestamp":1303825936,"content":"Sky said:\n\nIf the fact, that ad hoc created deck beat second quest twice in the row does not convince You, nothing will :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\n\n\nI don't see the deck as ad hoc. It is deliberately constructed to take advantage from on of Spirits strongest mechanics (discard pile recursion). It also isn't fool proof because without Lore the deck has to rely on luck, a mulligan, and delay tactics to make sure it gets the cards it needs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459420","commentId":459420,"userName":"Oshio","timestamp":1303826439,"content":"Sky:\n\nHave you played a lot of TCG's before? I don't want to sound snarky, but if you have you'll know that a mechanic has to be seriously abusive before most companies even begin talking about issuing errata. Just look over to the Warhammer: Invasion forums, which finally (after almost a year) have been able to get the game un-broken. Allowing you to play a few cards from the discard pile for full cost does not even come close to abusive. I think that once the deck is finely tuned, it MIGHT be able to win 60/40 against Scenario 2.\n\nAnd, to quote page 27:\n\n\"A tournament deck must contain a minimum of 50 cards. Additionally, no more than three copies of any card, by title, can be included in a players deck. Within these guidelines any combination of allies, attachments and events can be used in the player deck.\"\n\nAnd, later, under advice,\n\n\"\"A player should also make sure that all the cards in his deck belong to a sphere that maches at least one of the heroes' resource icons, lest he find himself with a dead card he cannot hope to play.\"\n\nThere is nothing barring a player from doing so, so the deck works. As others have said, the question isn't 'can you include an out of sphere card', it is 'Sneak Attack work out of sphere', which we have come to an almost unanimous conclusion that it does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459431","commentId":459431,"userName":"sputang","timestamp":1303827688,"content":"Don't forget the golden rule that the text on the card supercedes the rules of the game.  And I'm pretty sure \"Stand and Fight\" specifically mentions that you can use it one cards of another sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459442","commentId":459442,"userName":"ClydeCloggie","timestamp":1303829001,"content":"If this game would have concrete walls around its spheres, with no leeway at all to include cross-sphere use of cards, it would be a much less interesting game. For me, the benchmark of a game that got this wrong was Decipher's LotR-TCg with all their cards that were only playable on one specific character. And the four unique sphere concept of this game still worries me in that respect. For that reason alone, this deck with its inventive use of Beorn is already very good news."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459528","commentId":459528,"userName":"Fieras","timestamp":1303839118,"content":"I see no issues with playing it that way.  Well done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459619","commentId":459619,"userName":"Iron-on Ghost","timestamp":1303852967,"content":"Update: I have played a few more times and have been beat hard. The whole deck concept is based solely on a mechanic that is difficult to get out but once the engine rolls then it works very well. A few inconvenient flips of the encounter deck or not having the Galadhrim's Greeting show up within the first few rounds means certain destruction. THAT TROLL WILL WHOMP YOU HARD WITH NO BEORN (PERIOD). So ... fear not.\n\nAlso as far as the deck construction goes the rules for deck construction are at the end of the rule book, which at no time limit your using of out of sphere cards. but it does give you a warning,\n\n\"A player should also make sure that all\nthe cards in his deck belong to a sphere that matches\nat least one of his heroes’ resource icons, lest he find\nhimself with a dead card he cannot hope to play.\"\n\nI can hope to play those cards...\n\nAs for the deck make up I used all the spirit cards I had and just threw in Gleowine x 2 and Beorn x1. That's it. Like I said a non 50 card deck but a good example of a 50 card make has been listed by CAlexander [http://www.fantasyflightgames.com/edge_comunidad_perfil.asp?ecoid=7381]\n\nThanks CAlexander for the 50 card make-up I'll be sure when I get enough cards to play around with it further."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459623","commentId":459623,"userName":"mason240","timestamp":1303854408,"content":" Iron-on Ghost, you are a genius and your combo is 100% legal. SaF specifically states you can pull allies from any sphere. I would't find it highly unlikely that FFG would errata such a combo away; combos like that are supposed to be what CCGs are all about. If deck building choices were obvious, the game would suck. Like CAlexander, I wonder if this is perhaps Sky's first deck-building game. \n\n \n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45802-journey-along-the-anduin-single-player-score-3/?do=findComment&comment=459650","commentId":459650,"userName":"guciomir","timestamp":1303876481,"content":"You do not need this combo to beat scenario 2.\n\nI've been playing 3 games and won all of them using only spirit deck with 3 gandalfs. It is easy, you quest with Eowyn, counter all possible cards that can screw you (and some of them do nothing if your threat is low), keep threat down, around 20 and destroy all enemies with the sharpshooting hero knight. Important: do not touch the troll. You can play stage 1 for hours and nothing can hurt you, reshuffling your deck all the time, putting threat level to 0 value, prepare the board with your every ally and finally screw the troll with 3 gandalfs strikes (when you deal last hit you should have 2 gandalfs in hand). Then you procede to quest with the army of allies and in the same turn you finish 2nd part of the quest and go to stage 3, which you win in 1-2 turns. It is possible to do that with 0 threat and after playing stage 1 for 3 hours (if you have time and patience) you will have tons of victory points.\n\nI know 3 out of 3 is not a big deal, but I'll play some more games and check if spirit wins all the time. The important thing is to not let troll engage you, so you can't finish stage 1 of the quest and during this stage you can go through the deck multiple times."}]}