{"url":"https://community.fantasyflightgames.com/topic/45814-rules-question-sneak-attack/","title":"[Rules Question] Sneak Attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45814-rules-question-sneak-attack/?do=findComment&comment=459315","commentId":459315,"userName":"Oshio","timestamp":1303816160,"content":"Quick question: are you able to use Sneak Attack to play a character from a sphere not represented by one of your heroes? I would think yes - the cards do not mention otherwise and the rules don't seem to contradict it - but the fact that they use extra wording on Stand and Fight to allow it to be used on any sphere makes me question it. Thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45814-rules-question-sneak-attack/?do=findComment&comment=459316","commentId":459316,"userName":"wookie78","timestamp":1303816350,"content":"I have assumed you can use Sneak Attack to play any ally from any sphere in your hand.  I mainly aim to use Sneak Attack to bring Gandalf in cheaply. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45814-rules-question-sneak-attack/?do=findComment&comment=459317","commentId":459317,"userName":"Fieras","timestamp":1303816378,"content":"I read sneak attack as any sphere as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45814-rules-question-sneak-attack/?do=findComment&comment=459329","commentId":459329,"userName":"Titan","timestamp":1303817537,"content":"I think it has to do more with the fact that Stand and Fight allows you to take allies from other player's discards and it stands to reason that some of these allies would be from spheres that you don't have in your deck. They might have felt that it needed the extra clarity. Since Sneak Attack only works for allies in your hand, that (in the designer's minds) might be less of a likelihood. I agree that there is nothing that prevents it's use on an ally of a different sphere. For example, the spirit/Beorn/Stand and Fight combo that was talked about in another thread should also be possible using leadership/Beorn/Sneak Attack. It would be cheaper, but more temporary."}]}