{"url":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/","title":"[Decklist + Discussion] Spirit of Rohan","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459427","commentId":459427,"userName":"Oshio","timestamp":1303827212,"content":"I decided to branch off from the \"Journey Along the Anduin: Single Player (score: 3!!!)\" thread and create my own, for fear of completely highjacking that one. Due credit goes to Iron-On Ghost for coming up with the idea of building a deck around playing out of sphere characters from your discard pile utilizing \"Stand and Fight\". Decklist below, followed by discussion:\n\nHeroes (25 Threat)\n\nTheodred (L)\n\nDunhere (S)\n\nEowyn (S)\n\nAllies - 21\n\n3x Wandering Took (S)\n\n2x Lorien Guide (S)\n\n2x Northern Tracker (S)\n\n3x Snowbourn Scout (L)\n\n2x Faramir (L)\n\n3x Beorn (T)\n\n3x Gleowine (K)\n\n3x Gandalf (U)\n\nAttachments - 9\n\n3x Steward of Gondor (L)\n\n2x The Favor of the Lady (S)\n\n2x Celebrian's Stone (L)\n\n2x Unexpected Courage (S)\n\nEvents - 20\n\n3x Stand and Fight (S)\n\n3x The Galadharim's Greeting (S)\n\n3x Dwarven Tomb (S)\n\n3x A Test of Will (S)\n\n2x Will of the West (S)\n\n3x Sneak Attack (L)\n\n3x Valiant Sacrifice (L)\n\nThoughts\n\nThe main idea of the deck is to use Spirit's powerful recursion ability to pull key out of sphere characters from the discard pile (where they have been discarded to fuel Eowyn's ability). Leadership backs this up with a very powerful resource engine (Theodred and Steward of Gondor), the very strong Sneak Attack (which can be used for the now popular Gandalf combo or Beorn if you lack Stand and Fight) and Valiant Sacrifice to help with the decks primary weakness: lack of card draw.\n\nThe deck's secondary strategy is to capitalize on Spirit's threat reducing ability utilizing The Galadharim's Greeting, Dwarven Tomb and Gandalf (with or without Sneak Attack). Snowbourn Scout, Lorien Guide and Northern Tracker all help tear through locations, and Eowyn is a questing beast, especially when she's helped out with Celebrian's Stone and Favor of the Lady. Dunhere snipes enemies that can't attack you due to your lowered threat.\n\nI've been testing the deck against Scenario 2, and one of it's greatest assets is it's 'set up time'. With only 25 starting threat you have several turns to prepare for the inevitable Hill Troll, and by the time it comes you often have a means of dealing with it within 2 turns. Though you may have to take a threat hit or two, it's fairly easy to get yourself back down into the 20's and lower with the resources in the deck.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459452","commentId":459452,"userName":"Oshio","timestamp":1303829613,"content":"First game with this updated decklist very much proved the rule that if this deck gets a good draw, you are in complete control of the game. My opening hand (without having a mulligan) included a Stand and Fight, Dwarven Tomb, Gleowine and Gald's Greeting. First card drawn was Steward of Gondor. First turn Steward on Eowyn is nasty. I literally had more resources than I could spend the entire game. Gleowine came out turn 1, I think Beorn was turn 4. I got a little overwhelmed with really low-threat enemies early and took some heavy wounds to Theodred & Dunhere, but after I dropped Beorn I was set. With that base in place (resource engine going, Boern out, Gelowine drawing me cards, Stand and Fight on Theodred) I focused on lowering my threat. My questing was going steadily - gaining a token or two per turn - and all that was really in the staging area was the Troll. At that point I managed to lower my threat to the high teens and took on the ogre, with the help of a Surprise Attack from Gandalf.\n\nThings were a breeze from there as I had resources, low threat and a standing army. I blew through quest 2 in 4 turns, with only a single location left when I was done. My 2 cards drawn for quest 3 were the Necromancers Reach which I cancelled and an orc. I left the orc around for a few turns so I could drop the other two Gandalf's in my hand and lower my threat. Ended the game, after victory points, at -4.\n\nThis wasn't a typical game and I'm going to be testing a lot more. But when this deck works it's like a symphony of control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459457","commentId":459457,"userName":"Apophenia","timestamp":1303830181,"content":"CAlexander said:\n\nFirst turn Steward on Eowyn is nasty.\n\n \n\nWouldn't it have to be second turn? Theodred can't get a second resource until he quests and since you can't play Attachments except during the Planning phase wouldn't you have to wait for the next turn to play it?\n\nAnd what do you mean by Stand and Fight on Theodred?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459470","commentId":459470,"userName":"Oshio","timestamp":1303831658,"content":"You're right, it was turn 2. I didn't take notes so my memory of the game was slightly off. And I meant Unexpected Courage on Theodred...not sure what I was thinking there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459482","commentId":459482,"userName":"Entropy42","timestamp":1303833428,"content":"Why is Steward of Gondor on Eowyn nasty?  It doesn't seem like its better on her than on any other hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459484","commentId":459484,"userName":"Oshio","timestamp":1303833827,"content":"Entropy42 said:\n\nWhy is Steward of Gondor on Eowyn nasty?  It doesn't seem like its better on her than on any other hero.\n\n\n\nIt is. I more meant, in this deck, Steward of Gondor on a Spirit hero is incredible. Maybe not moreso on one hero or the other, but this deck + lots of resources = a beating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459508","commentId":459508,"userName":"Oshio","timestamp":1303836891,"content":"I played 2 more games with the deck. The first was against the same scenario and while my start was solid (Tomb, Greeting, Steward) it was missing a Stand and Fight. Still, with Steward, I decided to keep it and played. I managed to gain control of the board very quickly, but after several turns I still hadn't drawn a Stand and Fight. I had just about every other card I needed in place and even Sneak Attacked with Beorn at one point, but the darn SaF wouldn't show up. Finally, after many turns of lowering my threat, keeping under the radar and finishing the quest in all ways other than killing the Troll, I dropped a Gandalf for his card draw and drew it. The next turn was amazing as I spent all my accumulated resources, completely owned the board and quickly finished the game. My score that game, 6, was not as good as my first game, but still obviously solid.\n\nLearning to play the deck is important, as you can essentially tread water forever until you get the cards you need. Cards like Gandalf and Dwarven Tomb all have different awesome applications, and choosing the right ability at the right time is key.\n\nNext game I decided to step up and play Scenario 3. Theodred was prisoner, I drew a bunch of Leadership cards and got slaughtered lol. So...that is most definitely not a single player option. I'll keep trying though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459593","commentId":459593,"userName":"faith_star83","timestamp":1303848920,"content":"ah...nice deck. I had some similar thoughts when I tried to construct a deck the other day, but quickly realized that one core set doesn't give you enough powerful cards. I like the idea to have 3x Dwarven Tomb and 3x Saf = 6x ally recursion...guess I have to order two more core sets...llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459607","commentId":459607,"userName":"Oshio","timestamp":1303850861,"content":"faith_star83 said:\n\nah...nice deck. I had some similar thoughts when I tried to construct a deck the other day, but quickly realized that one core set doesn't give you enough powerful cards. I like the idea to have 3x Dwarven Tomb and 3x Saf = 6x ally recursion...guess I have to order two more core sets...llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif]\n\n\n\nI got two myself. I really don't like the idea of buying a third simply for Dwarven Tomb, Unexpected Courage and Beorn, so I'm proxying them now. If they end up being must haves after a couple expansions come out I'll cave in, but for now the card pool is just so small that every decent card has to have 3x."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45821-decklist-discussion-spirit-of-rohan/?do=findComment&comment=459621","commentId":459621,"userName":"Iron-on Ghost","timestamp":1303853461,"content":"great deck layout CAlexander I am glad I wasn't the only one who saw the greatness in Spirit. It is definately my favorite sphere and will probably keep it as my base sphere. The resource pump is great as well i am just too much of a fraidy cat to get rid of Eleanor. Especially with those damned Caught in the Webs [http://lotrlcg.com/cardFocus.php?Title=Caught%20in%20a%20Web]. Those will ruin me if I dont have Eleanor. I know spirit has cards to deal with it but having it flip once having to quest with her can really mess everything up."}]}