{"url":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/","title":"Tri quest run","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459468","commentId":459468,"userName":"Cabello","timestamp":1303831340,"content":" Hey guys, just did a two player run through all three quests. this was using the blue and purple decks. I have three core sets but at this point have only just brought all the decks to have 3 copies of all the cards. between each quest we allowed ourselves one extra resourse phase before starting the new one. we had a total score of 53. Has anybody else tried this? how did you guys do?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459471","commentId":459471,"userName":"Oshio","timestamp":1303831840,"content":"Cabello said:\n\n Hey guys, just did a two player run through all three quests. this was using the blue and purple decks. I have three core sets but at this point have only just brought all the decks to have 3 copies of all the cards. between each quest we allowed ourselves one extra resourse phase before starting the new one. we had a total score of 53. Has anybody else tried this? how did you guys do?\n\n\n\nInteresting. How tough was it? I'd expect it to be fairly easy if you did not reset what you had on the board, at least as long as you had a Spirit player in the mix to reshuffle your decks and keep threat low. Definitely sounds like fun though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459532","commentId":459532,"userName":"Fieras","timestamp":1303839373,"content":"Did you go into the 2nd scenario with all your characters from the first one in play already?  If so, I would guess it was exceedingly simple to win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459568","commentId":459568,"userName":"Infyra","timestamp":1303843318,"content":"I think the proper way to play the nightmare scenario is to throw everything except heroes into their respective discard piles. Keep the damage on your heroes, keep your threat and do not shuffle the discard piles back in the decks.\n\nThat way you will have to manage threat, damage on your heroes and the danger of decks running out throughout all three scenario's."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459780","commentId":459780,"userName":"Entropy42","timestamp":1303898290,"content":"Infyra said:\n\nI think the proper way to play the nightmare scenario is to throw everything except heroes into their respective discard piles. Keep the damage on your heroes, keep your threat and do not shuffle the discard piles back in the decks.\n\nThat way you will have to manage threat, damage on your heroes and the danger of decks running out throughout all three scenario's.\n\n\n\nYeah, the rules on it are not very clear.\n\nI played Nightmare mode last night with a friend, using only the 30 card precons.  I was Lore, he was Leadership.  We allowed ourselves each one free reshuffle of cards from the discard pile when our decks were exhausted (since we had only 30 card decks).  We did not add a threat to ourselves during the refresh phase the turns we beat the 1st and 2nd scenarios.  After clearing a scenario, we would reset the encounter decks, but nothing on our own boards.  The game took 4 hours, and I died on the last turn, but he managed to finish the quest.  Our final score was 113 (not sure how to score a player who is eliminated due to threat).  With these two decks, it is extremely difficult to keep your threat down.  We never took threat from failing to quest, and I still died from threat.  Also, with 30 card decks, it is very easy to just run out of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459864","commentId":459864,"userName":"Cabello","timestamp":1303906040,"content":" We basically played as though it was one giant quest with 9 parts, we didnt touch any of our own stuff inbetween quests, except that we gave ourselves one extra resource round"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459873","commentId":459873,"userName":"Fieras","timestamp":1303906915,"content":"Cabello said:\n\n We basically played as though it was one giant quest with 9 parts, we didnt touch any of our own stuff inbetween quests, except that we gave ourselves one extra resource round\n\n\n\nYeah, you should be losing all your allies and attachments in between scenarios if you want to play fully \"nightmare\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=459879","commentId":459879,"userName":"Entropy42","timestamp":1303907389,"content":"Yeah, it appears we just played the \"somewhat unsettling dream\" scenario.  If you are going with 2 pre con decks though, its still plenty challenging.  Seems ours was very similar to Cabello's, just they gave themselves an extra 6 resources, and we gave ourselves 2 less threat.  I look forward to playing correctly and seeing how fast we die."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45824-tri-quest-run/?do=findComment&comment=460244","commentId":460244,"userName":"Entropy42","timestamp":1303951685,"content":"Tried this again tonight (precon Spirit and Tactics), this time playing by the \"correct\" nightmare rules. \n\n 1. What do you do with cards in play at the end of a scenario?  I assumed you discarded them. \n 2. What do you do with cards in your hand?  I could see maybe shuffling them in and drawing back to 6, not shuffling and drawing to 6, or just continuing on with your hand. \n\nWhat we did after the first scenario was just keep the 1-2 cards we had and draw up to 6.  Now we finished the 2nd scenario and aren't sure what do since one player has 8 cards in hand.  The rules only say \"don't reset player decks, damage, or threat\"  I'm not sure what \"reset player decks\" means, but I assumed it just meant you don't shuffle your discard back into your library."}]}