{"url":"https://community.fantasyflightgames.com/topic/45909-quest-3-setup-question-attaching-an-encounter-card/","title":"Quest 3 setup question:  Attaching an Encounter Card","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45909-quest-3-setup-question-attaching-an-encounter-card/?do=findComment&comment=460221","commentId":460221,"userName":"Kalthon","timestamp":1303944965,"content":" \n\nI'm not the best at understanding rules most of the time so any help would be great.\n\n \n\nWhen it says \"Attach an encounter card to the objective card\", how exactly does that work with the game mechanics?  Do I do the \"when revealed\" text if its a treachery card?  Do they just go on top of the objective cards face up?  Face down?  Is ANY card in the encounter deck considered an encounter card?\n\n \n\nThe mechanics of this game, and explanation at times, is a bit tough to get a good solid grasp on at times.  This would be one of those times. \n\nAlso, a friend and I have tried the third quest a couple times and after the first turn we both have about 7 to 10 more threat than at the beginning of the turn, almost lost, or did lose, a hero, and just cant get further than turn 3.  It's just 2 of us and we haven't changed the decks.  Is it even possible to do this quest from the beginning?  Or is the only way to beat it is when you are starting from the expert mode where you do all the quests in a row?\n\n \n\nThanks for all the help!\n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45909-quest-3-setup-question-attaching-an-encounter-card/?do=findComment&comment=460226","commentId":460226,"userName":"Titan","timestamp":1303946791,"content":"All cards in the encounter deck are considered encounter cards. \n\nPer P. 24 of the rulebook, treachery cards on objectives are immediately triggered when revealed. \n\nI haven't seen anything that changes the behavior of encounter cards when they are attached to objectives. I would play them as you normally would unless you find an effect that specifically states otherwise. Also, since it says that enemy and location cards count their threat while attached, then they have to be played face up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45909-quest-3-setup-question-attaching-an-encounter-card/?do=findComment&comment=460249","commentId":460249,"userName":"Kalthon","timestamp":1303952408,"content":"Thank for a very clean and clear answer.  All that makes sense based off of what I read and I feel kinda dopey having to have asked. \n\n \n\nNow all I need to do is figure out how to not be bad and I'll be golden.\n\n \n\nThanks again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45909-quest-3-setup-question-attaching-an-encounter-card/?do=findComment&comment=460255","commentId":460255,"userName":"Casamyr","timestamp":1303953367,"content":"I guess the quickest and easiest way to imagine this is:\n\nIf it is an enemy - they are carrying the objective and drop it when they die\n\nIf it is a location - the objective is hidden there and is found when you remove it from play\n\nand treachery is treachery and is resolved as in the rules."}]}