{"url":"https://community.fantasyflightgames.com/topic/45905-really-basic-question/","title":"Really Basic Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45905-really-basic-question/?do=findComment&comment=460196","commentId":460196,"userName":"David Spangler","timestamp":1303940204,"content":"I just got the game, haven't had a chance to play yet but will do so tomorrow solo.\n\nOne question in my mind from reading rules.  A hero engages the quest and then is exhausted, meaning he or she can't now travel or defend against any engagements and attacks.  If I have three heroes, and one engages the quest, the other two are ready and free to deal with threats and enemy engagements, right?  In other words, all heroes are considered \"on the quest\" even if only one hero is actually engaging it and thus exhausted.\n\n \n\nSo, with three heroes:  one hero engages quest in Quest Phase and is exhausted.  Another hero could, if I wished, travel in the travel phase and get exhausted.  Then my last hero can defend if engaged in the Encounter and Combat phases?  Is this how it goes?\n\nSorry if these basic questions have been asked and answered before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45905-really-basic-question/?do=findComment&comment=460201","commentId":460201,"userName":"vermillian2","timestamp":1303941006,"content":" Nope:\n\nExhaust to quest (count their Willpower subtract the Threat). Decide if you want to travel (no exhausting required).\nExhaust to defend\nExhaust to attack\n\nThat's the extent of exhausting activities.\n\nTraveling is free. Even if you're not questing that turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45905-really-basic-question/?do=findComment&comment=460205","commentId":460205,"userName":"David Spangler","timestamp":1303941958,"content":"Oh, right.  I messed up on the travel rule.\n\nI guess you have to quest to keep threat down and manageable but you need heroes who are not questing to deal with defending and attacking.  This would be really tough if you tried to do the game with a single hero!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45905-really-basic-question/?do=findComment&comment=460285","commentId":460285,"userName":"Mighty Jim 83","timestamp":1303959926,"content":"David Spangler said:\n\nOh, right.  I messed up on the travel rule.\n\nI guess you have to quest to keep threat down and manageable but you need heroes who are not questing to deal with defending and attacking.  This would be really tough if you tried to do the game with a single hero!\n\n\n\nYes, very tough.\n\nHaving said that, don't forget that your allies can also quest, defend and attack, they're just generally not as good as your heroes (or their Gandalf, so they're much better, but only around for 1 turn.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45905-really-basic-question/?do=findComment&comment=460348","commentId":460348,"userName":"Eryx_UK","timestamp":1303974392,"content":"Allies are key, especially in solo play. Use them to soak the monster's attacks and let your heroes attack back. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45905-really-basic-question/?do=findComment&comment=461472","commentId":461472,"userName":"Kitsune Rei","timestamp":1304169724,"content":"Yes, first turn is usually rather rough since you start with a couple things to deal with but all you have is your heroes and maybe 1 ally, and that's also why sometimes you have to riskily take damage undefended just so you have someone left who can attack. You do have to think a lot about who you commit to what or you'll come up short in questing too often.\n\nI don't know how you could get away with playing with 1 hero at all much less solo, it seems like too little resource gain for the threat reduction. I was playing the starter sets with 2 other players and I lost a hero, but found I could get by without them (I was playing Leadership and lost Gloin to a shadow card, but it was ok because Aragorn had Steward of Gondor. Man that card is fantastic.)"}]}