{"url":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/","title":"Lord of the Rings: The Card Game Podcast!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460609","commentId":460609,"userName":"GirderZombie","timestamp":1304004401,"content":"Hi FFG forum members,\n\nCheck out a new podcast all about the Lord of the Rings: The Card Game called Cardboard of the Rings! It comes out every 2 weeks and is chocked full of discussion about the game and there is a weekly contest too! Check it out either at the site below or search for it on iTunes.\n\nThanks for listening, and feel free to contact us at cardboardoftherings@gmail.com!!\n\ncardboardoftherings.wordpress.com/ [http://cardboardoftherings.wordpress.com/]\n\nitunes.apple.com/ca/podcast/cardboardoftherings/id432032108 [http://itunes.apple.com/ca/podcast/cardboardoftherings/id432032108]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460624","commentId":460624,"userName":"conykchameleon","timestamp":1304006185,"content":"This is exactly what I needed to fuel my obsession for this game! Thanks so much for doing this!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460650","commentId":460650,"userName":"Kennon","timestamp":1304009426,"content":"Freaking awesome, dude! We're running an A Game of Thrones card game podcast called \"2 Champs and a Chump\" (available on iTunes or the link in my signature) that started off as bi-weekly as well- back in November. By the first of the year though, we decided that we loved it so much that we went weekly. New episodes on Fridays.\n\nSo, I've gotten one of the other hosts to play a few games with me, and we're planning on recording a segment on the LotR LCG *hopefully* in next week's episode. I'll be pretty excited to check yours out. Maybe we could even work out some low level cross promotion or interaction? Hit me up if you'd like to check out some options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460663","commentId":460663,"userName":"DerBarchen","timestamp":1304010652,"content":"I dont mean to forum spam or over promote but this might be the place to put this:\n\nhttp://petulantbooster.tumblr.com/ [http://petulantbooster.tumblr.com/]\n\nIts an up and comming blog/webcomic/commentary on LCGs and other hobbies like table top games, pen and paper RPGs and game design in general. Its very new and doesnt have much on it yet but hopefully, with a little bit of work, itll be sometihng worth reading! Let me know what you think you people with your creative Podcasting and what not =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460671","commentId":460671,"userName":"TheLightdarker","timestamp":1304011063,"content":"Very awesome idea, I'm kinda jealous that I didn't think of doing it first!  I think it's very cool that this game seems popular enough to warrant that kind of attention, too, as it makes me really optimistic about this LCG having a long, enjoyable life chock full of great future releases.\n\nI'll definitely try to give this a listen when I get home.  At work at the moment all three episodes on your page are coming up as \"file not found.\"  Admittedly the computer I'm on is a piece of garbage, but is anyone else having this problem?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460691","commentId":460691,"userName":"Toqtamish","timestamp":1304012922,"content":"Just finished listening to it. was pretty good. Sadly cards have still not arrived at my somewhat local store but I did my best to follow along."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460699","commentId":460699,"userName":"GirderZombie","timestamp":1304013468,"content":"Awesome, I'll check out your cast and it would be great to work with you guys. We have zero podcasting experience, so our first episode is a little unorganized and nervous, but I expect we can improve and learn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460748","commentId":460748,"userName":"Kennon","timestamp":1304022007,"content":"We're about to release episode 19, so we don't have a great deal of experience, but it's getting easier with each release. If I can help at all, let me know.\n\nA couple quick bits of feedback though:\n\n1. Could you add an RSS feed for those of us that don't use iTunes to subscribe to? It might be good if you go through Google feedburner (and use that as the feed for iTunes) so that you can keep track of your stats in a relevant way.\n\n2. I managed to listen to the first 8 minutes or so before the streaming on my phone broke, but you sounded kind of like you were in a cave. Is there anything that might stand out about where you were recording or the equipment you used?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460751","commentId":460751,"userName":"Trump281","timestamp":1304022582,"content":" A podcast focused on one game?!  Not sure I can stand it, but I'm willing to give you a shot for a few episodes at least.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=460753","commentId":460753,"userName":"GirderZombie","timestamp":1304022700,"content":"Hahaha, the cave, yeah that is my kitchen table which is much akin to a cave. Next time we are going to record in my office which is smaller and carpeted so there should be far less echo. We are also like 100% more organized for the next show already then we were for this one.  We do have a feed which is:\n\nfeeds.feedburner.com/Cardboardoftherings [http://feeds.feedburner.com/Cardboardoftherings]\n\nWe're looking forward to the cross promo!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=461269","commentId":461269,"userName":"Kennon","timestamp":1304123671,"content":"Finally had the chance to finish listening to it tonight. Great job guys. I think you're of to a more polished start than we were by the first official episode for sure.\n\n \n\nBtw, check your email. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=461509","commentId":461509,"userName":"GirderZombie","timestamp":1304177460,"content":"Thanks for the support Kennon!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=461533","commentId":461533,"userName":"Casamyr","timestamp":1304181792,"content":"I've listened to teh 'cast a couple of times now, and even though my copy of LotrLCG still has yet to arrive (ordered a couple of weeks ago and is being shipped out to NZ- hopefully it'll arrive this week) I'm begining to get a great feel for this game and am so looking forward to opening it and having a go myself.\n\nKeep it up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=461552","commentId":461552,"userName":"Toqtamish","timestamp":1304184531,"content":"Absolutely agree with you there casamyr, my copy has finally arrived here in Canada so I am hoping to go and pick it up tomorrow. I might listen to the show again then as it will be easier to understand some of the points when I have my cards in hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=461601","commentId":461601,"userName":"Casamyr","timestamp":1304198298,"content":"Yeah, I'll definitely do exactly the same once I get my copy toqtamish - probably after I've had a game or two to get a feel for it then listen to cotrpodcast. It'll be great. I can't wait for the next installment either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=461606","commentId":461606,"userName":"pwvogt","timestamp":1304200792,"content":"Just listened to your test show and thought the quality was actually pretty decent. I listen to a ton of podcasts and can tell that you put some work into the production quality. I'm holding off on listening to the first two real episodes until Monday (I podcast pretty much just at work to get through some mind numbing days), so I'm very excited to hear some more. I'll probably eventually throw up a review of the cast over at The Hopeless Gamer [http://www.thehopelessgamer.blogspot.com] as I'm trying to blog quite a bit about the game as it's my main obsession now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=462272","commentId":462272,"userName":"Toqtamish","timestamp":1304328667,"content":"Having just listened to it again few things come to mind. One is stop comparing to the movies, this game is not even remotely based on those moves, it's based on the books which the cartoon/live action movie from back in the 70's is a closer match than Peter Jackson's take. And I had to laugh when someone did not know what a warg is. \"It's a black wolf\". lol, not so much. http://lotr.wikia.com/wiki/Warg [http://lotr.wikia.com/wiki/Warg]\n\n \n\nAlso about the cards thickness, these are the exact same dimensions and quality as the other LCG's that FFG makes. I own hundreds of AGoT cards and they have all lasted well but I also sleeve any cards for any card game when I actually play with them but I also have a whole bunch that are in my storage drawers unsleeved and they are all fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=462514","commentId":462514,"userName":"GirderZombie","timestamp":1304360247,"content":"It is hard to not compare to the movies because I watch them way more often than I read the books, for time reasons, so they end up being at the forefront of my mind. I can see how that might be irritating as the tale in the books is so superior to the movies, although they are good.\n\nGlad to hear the cards last.\n\nThanks for the feedback, and thanks for listening, check out episode #2 next week!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=462562","commentId":462562,"userName":"Casamyr","timestamp":1304369112,"content":"Actually I don't mind the movie stuff. Sure its not quite the books but PJ kept for the most part (ignoring the elves turning up at Helm's Deep here) has kept the guts of the story there (don't get me started on the Scouring of the Shire) but any comparisons are going to happen. Might as well enjoy it.\n\nI was listening to the 'cast today, since my copy of lotr finally arrived yesterday and think that the Denethor part has merit, though I did enjoy using him as a defensive wall, rather than looking at the top card of the encounter deck. In fact I did something else - I chucked Dark Knowledge on him, and used it's ability to look at a shadow card dealt to an enemy every combat phase to decide who was blocking what. Worked a treat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=462571","commentId":462571,"userName":"Toqtamish","timestamp":1304371490,"content":"My reason for saying to stop with the movies is because this game is not based on the movies like the old ccg that decipher made was. This one is based on the books so comparing it to the books makes more sense than using the movies that have no relation to this particular Lord of the Rings card game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=462578","commentId":462578,"userName":"Casamyr","timestamp":1304373986,"content":"quite true Toq, quite true. I think the comparisons to the films are always going to happen though, but yeah - focus on the books more rather than the films."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=462774","commentId":462774,"userName":"Kennon","timestamp":1304416491,"content":"Yeah, the comparison is pretty much always going to happen. I think you're doing just fine if you wind up contrasting as well.\n\nIt's actually an interesting concept. While Lord of the Rings is the larger franchise by far, many more people have been exposed to it by only seeing the movies, or having read the books ages ago but the movies much more recently, which makes them stick out in people's minds far easier. On the other hand on our Game of Thrones podcast, the audience is reversed. We're smaller and since the TV adaptation has just started airing people are vastly more familiar with the books. By the time season two starts, the franchise may have grown significantly with people that only have the series to go off of, or at least that started there. We shall see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464022","commentId":464022,"userName":"guest455987","timestamp":1304594971,"content":"I enjoyed the podcast and look forward to more.  One suggestion for Brandon... get closer to the microphone... much closer, actually.  There's a funny room echo that's kind of off-putting.  Your voice is good, so let the mic feature that and not the room. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464119","commentId":464119,"userName":"Paul Grogan","timestamp":1304606543,"content":"I listened to the podcast.  I was pretty unimpressed and dont think I'll be listening to any others.  It seemed pretty poorly prepared and more like a couple of guys chatting.  The comparison to the movies didnt bother me much - the fact is there are a lot of LotR fans just from the films who haven't read the books, but I would have prefered a more informed podcast.  There were a few times when cards were referred to as \"erm, you know, that card, cant remember what it is called\".  Have the cards there - Or edit the podcast later to contain the right stuff.\n\nI listen to quite a few podcasts or videos about games from various links on BGG, maybe I'm just fussy but they are a lot better.\n\nThis podcast contained nothing really of any value to me.  Disappointed as I thought it would be pretty good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464178","commentId":464178,"userName":"conykchameleon","timestamp":1304614712,"content":"Paul Grogan said:\n\nI listened to the podcast.  I was pretty unimpressed and dont think I'll be listening to any others.  It seemed pretty poorly prepared and more like a couple of guys chatting.  The comparison to the movies didnt bother me much - the fact is there are a lot of LotR fans just from the films who haven't read the books, but I would have prefered a more informed podcast.  There were a few times when cards were referred to as \"erm, you know, that card, cant remember what it is called\".  Have the cards there - Or edit the podcast later to contain the right stuff.\n\nI listen to quite a few podcasts or videos about games from various links on BGG, maybe I'm just fussy but they are a lot better.\n\nThis podcast contained nothing really of any value to me.  Disappointed as I thought it would be pretty good.\n\n\n\n \n\nThis is exactly why I LOVE this podcast. I don't need someone acting all serious and telling me how to play the game. I do, however, love hearing conversations about the game. I've listened to many podcasts and enjoy this one so much because it's so informal and friendly. Please don't change a thing! (honestly)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464233","commentId":464233,"userName":"GirderZombie","timestamp":1304622127,"content":"Sorry you didn't enjoy that cast Paul! We tried our best to prepare but we had gotten the game just 2 days before so it was tricky. Give episode 2 a listen as we have come a long way in terms of prep.\n\nGrudunza, we were recording in my kitchen which is big, un-carpeted and echos. We will be recording in a better location on Wednesday as I agree, it was a little annoying to hear a cast from Gollum's cave.\n\nDon't forget to enter the contest if you haven't already!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464294","commentId":464294,"userName":"Casamyr","timestamp":1304634423,"content":" I agree Paul. I enjoyed it because it was two fans who seemed to be jsut chatting naturally about the current topic. It didn't bother me that sometimes the name of a card slipped the mind - shucks there's 220 odd cards in the set and it's only been out a few weeks.\n\nKeep up the good work and I'm looking forward to the next installment - 2 weeks is a long time to wait. :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464388","commentId":464388,"userName":"Cidervampire","timestamp":1304657360,"content":"I enjoyed the podcast.\n\nWell done chaps!\n\nI was listening to the podcast on the way to work and thought I heard a cat trapped in a warehouse I was passing only to realise the mog was actually on the podcast\n\n \n\nGeoff"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464648","commentId":464648,"userName":"TheLightdarker","timestamp":1304694035,"content":"I just want to chime in to agree with the people that are posting that they enjoyed the podcast specifically because it was a couple of friends chatting excitedly about the sweet new game they'd just picked up.  You guys established a structure for the rest of the podcast early on, and addressed all of the different topics you set out to, doing so in a casual, lighthearted way that conveyed and encouraged energy, excitement, and genuine enjoyment of the game to your audience.  You guys sounded amped up about the game and really excited to have finally gotten to play it, and that in turn helped to maintain my interest and add some fuel to my own little obsession with this game.  Approaching things in a loosely structured, friendly and casual way makes you guys very identifiable to your audience, and I think it would be easy to picture you two as the kind of people you would want to invite over to sit down and play a game with.\n\nThe LotR universe nowadays obviously includes much more than the original novels, and I think it is only appropriate to do a little bit of comparison to the movies and other works as, for a lot of people, that is the only way that they know Lord of the Rings; I would imagine that discounting the films entirely or to either criticize or ignore them would alienate a huge proportion of your potential audience.  I enjoyed hearing a little bit about how everything compares and contrasts, but am grateful that the podcast didn't contain any nerdrage about FFG's loyalty to the source material, just simple opinions.\n\nLike those that have said it before me, keep up the good work, I really liked what I heard and have high hopes for the future of this podcast.  Two weeks is a long time to wait, but I'll definitely be checking back to give you guys another listen!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=464751","commentId":464751,"userName":"guest455987","timestamp":1304709383,"content":"GirderZombie said:\n\nGrudunza, we were recording in my kitchen which is big, un-carpeted and echos. We will be recording in a better location on Wednesday as I agree, it was a little annoying to hear a cast from Gollum's cave.\n\n\n\nGreat, but regardless of the room, get closer to the microphone.  It's always better to hear the voice, not the room."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=466436","commentId":466436,"userName":"longclaw","timestamp":1305053881,"content":" Wow, props to Kennon for turning me on to this through their Game of Thrones podcast.  Just wanted to say that I enjoyed it thoroughly.  Very nicely done.\n\nI think Denethor can be fantastic for knowing how to plan the rest of your turn, not just defense, though.  I'll often leave the card on top and be that much closer to knowing exactly how much to quest with or leave standing for combat.  And Bilbo's free draw?  Huge.  In fact, if you can team up with Tactics, I'd probably leave Glorfindel at home before I would the other three.  \n\nCan't wait till the next one, guys!\n\nBy the way, which part of Canada are you guys from?  I've got lots of  in-laws and friends running around up there.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=466500","commentId":466500,"userName":"Kennon","timestamp":1305065638,"content":"Longclaw! Glad to see that you crossed over! I agree that they did quite a great job. I'm getting really antsy waiting for their new episode.\n\nIt strikes me that Bilbo is probably the best as a solo hero since you'll always be the first player and always benefit from the draw. It's not that I don't want to give cards to fellow players, but when I do so with Bilbo is beyond my control compared to someone like Beravor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=466841","commentId":466841,"userName":"gmerwin2","timestamp":1305120968,"content":"I am no expert by any means regarding podcasts as a matter of fact these two where only my second and third I have ever listened to and I have to say I enjoyed them greatly!  I will be coming back for more and to echo someone elses comment...two weeks is a long time to wait. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=466934","commentId":466934,"userName":"GirderZombie","timestamp":1305129976,"content":"We are from Toronto and we are recording the next cast tomorrow. We have so much to talk about, it should be epic!! Thanks to everyone that listened to episode 1, and you still have a few fleeting moments to enter the trivia contest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=471189","commentId":471189,"userName":"GirderZombie","timestamp":1305786471,"content":"Hey all, episode #2 is up at all the regular places, carboardoftherings.wordpress.com cardgamedb.com and iTunes! Check it out for endless card discussion, contests, cats, and more! And yes we know (now), Celebrian's Stone is unique! Thanks for listening and enjoy the show!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=475594","commentId":475594,"userName":"GirderZombie","timestamp":1306476664,"content":"Episode #3 is up, check it out, it is full of discussion that is ripe for further analysis. We botch our judgement of Steward of Gondor, but other than that, we hope you enjoy the show! Thanks for listening!\n\ncardboardoftherings@gmail.com\ncotrpodcast on twitter\ncardboardoftherings.wordpress.com"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=475896","commentId":475896,"userName":"TheLightdarker","timestamp":1306516249,"content":"GirderZombie said:\n\n \n\nEpisode #3 is up, check it out, it is full of discussion that is ripe for further analysis. We botch our judgement of Steward of Gondor, but other than that, we hope you enjoy the show! Thanks for listening!\n\ncardboardoftherings@gmail.com\ncotrpodcast on twitter\ncardboardoftherings.wordpress.com\n\n \n\n \n\nThe Lighter-Darkerer approves of this message :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=486054","commentId":486054,"userName":"plueschi2","timestamp":1308193066,"content":"No episode 4 yet? I miss you already!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=486457","commentId":486457,"userName":"Kennon","timestamp":1308246319,"content":"I second that!\n\n \n\n \n\n \n\n \n\n \n\n."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=486517","commentId":486517,"userName":"GirderZombie","timestamp":1308257996,"content":"Episode 4 should be available the morning of June 17th! We are already looking forward to episode 5 when we finally get some new cards!!!\n\nThanks for listening and check us out on cardboardoftherings.wordpress.com"},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=486556","commentId":486556,"userName":"gmerwin2","timestamp":1308263583,"content":"Awesome!  Looking forward to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/45935-lord-of-the-rings-the-card-game-podcast/?do=findComment&comment=486577","commentId":486577,"userName":"plueschi2","timestamp":1308268097,"content":"Woohoo, just loading it ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}