{"url":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/","title":"Why do characters stay exhausted the whole round?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461425","commentId":461425,"userName":"nelsonbaggins","timestamp":1304163934,"content":"I can't really see from either a gameplay or theme standpoint how a character should stay exhausted for the length of the round.  Thematically, every character in Middle Earth (and all RPG's for that matter) is on a quest in which they need to attack and defend simultaneously.  The whole adventure seems stunted if you have to choose between questing, attacking or defending.  Gameplay-wise, why muddy up the table with sideways cards--it's inelegant and messy.  I think they could've kept the same basic concept and just allowed the characters to remain standing throughout the round.  Let the player decide how they want to quest, attack or defend.  As it is, it kind of removes the strategy (i.e. thinking) for you, eliminating player choice.  For example, if you commit everyone to a quest--you're done for the round.  If you want (or need) to defend against an attack--done for the round.  Maybe you'd like to actually attack with someone--you can, but have to skip questing and defending.  It's like going to an all you can eat buffet and only getting to eat one item.  I'm kinda bummed by this. \n\n(Granted, on my first disastrous playthrough solo, I rarely had more than 2 allies in play.  It seems as though a multitude of them is required to win.  Can it be that allies make or break this game?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461427","commentId":461427,"userName":"Mestrahd","timestamp":1304164244,"content":"You kind of disproved your own theory there. \"Let the players decide to quest, defend, attack\" That's exactly what they're doing by having the exhausts last. You have to choose how much to risk during questing, to leave enough defenders, or to let the attacks through in order to have attackers.\n\nAs for allies, yes they are key. If you can't have at least one ally per round, it seems much harder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461430","commentId":461430,"userName":"nelsonbaggins","timestamp":1304164475,"content":"Yes, I anticipated your response and concur, however choice only comes into play with an adequate amount of allies, which arguably a single starter deck does not contain enough of (unless you combine and go multi-sphere).  Throughout my initial game I never seemed to have much of a choice beyond: \"Which option will allow me to survive another round?\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461440","commentId":461440,"userName":"conykchameleon","timestamp":1304165683,"content":"Thematically I think you could argue both ways, but gameplay wise, I think that what is there is clearly more interesting. If you don't have to exhaust, you don't have to make decisions based on a yet-undecided outcome, which is pretty much the basis of all games. If there's not exhausting you don't have a decision tree where: \"Do I quest with Aragorn, or do I save him to defend against a potential threat?\". And by extension, it kind of ruins the entire point of a TCG. TCGs essentially introduce elements which nullify a branch in the decision tree or allow you to make multiple choices. Example: Aragorn. Now, instead of choosing between Questing and Combat, his power allows me to make both of those decisions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461464","commentId":461464,"userName":"Toqtamish","timestamp":1304169323,"content":"It forces you to manage your characters like a resource. Without that there would be a lot less management making the game a lot easier, too much so in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461469","commentId":461469,"userName":"nelsonbaggins","timestamp":1304169573,"content":"Yeah, I think where I went wrong was with allies.  It seems you should be putting out at least one new ally every round.  It looks like resource production is also going to be key, because the default every round is only three, which isn't really enough to do much of anything.  Either that, or cards that let you ignore cost like Sneak Attack.  I suppose the difficulty level needs to be high as well, since the customization with future cards will see decks quickly gain strength and be able to breeze through scenarios before long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461490","commentId":461490,"userName":"guest455987","timestamp":1304172802,"content":"Basically, it is thematically representing \"what is this character doing for this space of time\" (i.e. one round of play).  It represents their focus at that time.  Are they going to defend against a particular monster, attack a monster, or put some attention into figuring out how to proceed on the current quest?  In terms of gameplay, it's a huge part of the game, determining what's best to do with each character each round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46036-why-do-characters-stay-exhausted-the-whole-round/?do=findComment&comment=461504","commentId":461504,"userName":"Titan","timestamp":1304177141,"content":"With a limited amount of cards, multi-sphere is going to be the way to go, early on. Specially in solo play. Remember that starter decks are just that, starters. They are meant to introduce and teach the game and get you excited for future releases. They are not meant to be greatly competitive since the company wants us to continue to buy the product."}]}