{"url":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/","title":"Nightmare mode: best experience so far!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461612","commentId":461612,"userName":"armored_butterfly","timestamp":1304205682,"content":"Hello,\n\njust played a 4 players nightmare mode game today, using the starters deck (with an added Gandalf in each deck, coming from a second core set).\n\nIt was very challenging, we've lost a couple of heroes along the way, but it was very, very fun.\n\n \n\nWe were debating on some home rules for the nightmare mode, we didn't use any of them, but we are thinking about them for future games, since the rulebook is a bit vague on this mode of play. For exemple: bringing back the number of card in hands to six after each scenario.\n\n \n\nHave any of you tried the nightmare mode? Any thoughts on home rules?\n\nThanks\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461622","commentId":461622,"userName":"justin hendry","timestamp":1304209050,"content":"i thought about doing nightmare mode, but the way my games run you have to be brave to try. it seems like all my games end around 40-49. not being able to restart that each turn i would not get very far. gandalf seems to be my savour in this game, i haven't beat many games with out him. cool to hear someone has tried it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461623","commentId":461623,"userName":"justin hendry","timestamp":1304209051,"content":"i thought about doing nightmare mode, but the way my games run you have to be brave to try. it seems like all my games end around 40-49. not being able to restart that each turn i would not get very far. gandalf seems to be my savour in this game, i haven't beat many games with out him. cool to hear someone has tried it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461682","commentId":461682,"userName":"Emrad","timestamp":1304227875,"content":"Other than a campaign nightùare mode, I could think of simply adding cards during the Quest phase.\n\nWith 2 players, add an additional card when you reveal encounter cards.\n\nWith 4 players, add two additional cards.\n\n \n\nThis should greatly increase the difficulty :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461732","commentId":461732,"userName":"Oshio","timestamp":1304238298,"content":"Has there been an official ruling yet on nightmare mode? I started to run through it solo and have finished my first game, but I'm not sure where to go next.\n\nIt is clear your threat stays where it is. This is how I intend to finally beat the 3rd Scenario. It is clear wounds stay on your heroes. It is not clear what happens to your cards between games, as all it says is \"[you do not reset] player decks\". I assume this just means you have to use the same decks, but some interpret it as keeping the cards in your discard pile. But what about the cards in play? Some have also assumed you just scoop these into the discard pile, but this is such an incredibly important point that it is mind boggling that they don't mention this. What about your hand? Do you discard it and draw a new one?\n\nAt this point I really have no idea.\n\nThat being said I tweaked the Spirit of Rohan deck to be prepared for this, adding a couple Daughters of Nimronel and a few other cards. Even if you do keep all the cards in your discard pile between games, I made sure that Will of the West was the final action of the game so that the hit isn't too bad. I finished scenario one, managed to get out a Daughter of Nim to erase my hero wounds and finished the scenario at 8 threat. I probably could have treaded water a bit more to lower that further but I didn't want to tempt fate too much.\n\nSo now I'm moving forward to Scenario 2 in a very strong position: most of my cards were reshuffled, I have no wounds and I have 8 threat. My intent is to very carefully work through scenario 2 so that I can start the third scenario with no wounds and 0 threat, which will actually give me a fighting chance! Ridiculous that it takes Nightmare mode to beat that last one solo, but if that's what it takes that's what it takes.\n\n[Note: For those that didn't follow the Spirit of Rohan thread, the deck is based around recursive threat reduction (Galadrim's Greeting, Dwarven Tomb, Sneak/Gandalf, Will of the West) and playing key out of sphere characters with Stand and Fight. So it's pretty ideal for a solo nightmare run.]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461745","commentId":461745,"userName":"Toqtamish","timestamp":1304240333,"content":"Nothing changes between the scenarios. You would want to do this with full size decks for sure as the 30 card decks I don't think would survive with any cards left. Although there is at least that one card that lets you shuffle your discard back into the player deck. That would be a must in a game this long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461751","commentId":461751,"userName":"Kennon","timestamp":1304241373,"content":"Agreed. I'm pretty certain the intention is that cards in play, hand, discard pile, etc. all stay exactly where they were."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461761","commentId":461761,"userName":"Oshio","timestamp":1304241878,"content":"Kennon said:\n\nAgreed. I'm pretty certain the intention is that cards in play, hand, discard pile, etc. all stay exactly where they were.\n\n\n\nThen it should be called 'cakewalk' mode instead of 'nightmare' mode. Any decent deck would tear this apart if they could keep all their cards in play. I'm fairly certain you don't keep all the cards in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461764","commentId":461764,"userName":"Toqtamish","timestamp":1304242073,"content":"What makes you think that ? Rules are pretty simple on it.\n\n\"For a “nightmare” level challenge, do not reset threat, hit points, or player decks at the beginning of each scenario. When playing such a campaign,\nthe players should start with the “Passage through Mirkwood” scenario, follow with the “Journey Down the Anduin” scenario, and finish with the “Escape from Dol Guldur” scenario.\"\n\nSo everything stays as is. It is basically like going from stage 1 to 2 to 3 of a regular quest just in this case it's got a few more stages so you go 1,2,3,4,5,6 etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461769","commentId":461769,"userName":"Oshio","timestamp":1304242793,"content":"Dang. I've got 8 threat now and 6 guys out including Beorn, Gleowine and Daughter of Nimronel. Just seems like cheating!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461770","commentId":461770,"userName":"Toqtamish","timestamp":1304242894,"content":"It's not cheating if it's the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461776","commentId":461776,"userName":"Oshio","timestamp":1304244423,"content":"Toqtamish said:\n\nIt's not cheating if it's the rules.\n\n\n\nYeah, but it's also not really a 'nightmare' mode. Though it may be difficult for some decks that start at high threat and don't have any way to reduce it, for any deck running Spirit cards it's fairly easy. The only reason I bring it up is because there have been several dissenting viewpoints on the forums so far. I'd just love an official clarification.\n\nCancel [../../../edge_public/img_edge/spacer.gif] [../../../edge_foros_temas.asp?efid=201&efcid=4]../../../edge_foros_temas.asp?efid=201&efcid=4"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461829","commentId":461829,"userName":"Entropy42","timestamp":1304251446,"content":"Toqtamish said:\n\nWhat makes you think that ? Rules are pretty simple on it.\n\n\"For a “nightmare” level challenge, do not reset threat, hit points, or player decks at the beginning of each scenario. When playing such a campaign,\nthe players should start with the “Passage through Mirkwood” scenario, follow with the “Journey Down the Anduin” scenario, and finish with the “Escape from Dol Guldur” scenario.\"\n\nSo everything stays as is. It is basically like going from stage 1 to 2 to 3 of a regular quest just in this case it's got a few more stages so you go 1,2,3,4,5,6 etc.\n\n\n\nI am one of the dissenting opinions on this, as I think CAlexander is showing that nightmare mode is not very difficult at all if you keep your allies/attachments between rounds.  You read the rules as \"everything stays as is\".  I read them as \"here are the things you don't reset, everything else gets reset\"  Between each scenario, I just do everything that you are supposed to do when setting up a scenario, and the only things I don't clear are the threat and wounds (and don't shuffle the discard back in).  Its really pointless to argue about it, but I guess I'm just saying that I don't see it as clear-cut based on what is in the rulebook."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=461889","commentId":461889,"userName":"Toqtamish","timestamp":1304260315,"content":"I have already emailed Nate about it as everyone seems to need an official ruling for everything so figured it is better than another argument back and forth on the boards. Will post my replies from him when I get them hopefully in the next day or two. I have emailed him a few so it might be a bit before I get all replies to the various questions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=462969","commentId":462969,"userName":"Oshio","timestamp":1304440329,"content":"Well I finally finished my run through nightmare mode with the Spirit of Rohan deck and ended up scoring a -18. This is assuming your threat can't go below 0, the assumption I'm operating under, otherwise I could have scored pretty much anything I wanted to.\n\nRegardless of whether or not the characters stay in play, this mode doesn't really work with any deck based around lowering threat. Basically they can get to the end of Scenario 1, continue to lower their threat until it gets to 0, then finish it. Both of the following scenarios are easy to breeze through when you start at 0 threat. That being said, being allowed to keep your guys is even worse, as you have your entire deck engine set up and your discard pile is nothing more than Galadrim's Greetings, Dwarven Tombs and Sneak Attacks constantly being reshuffled with Will of the West.\n\nUnfortunately the only way to fix this is to create a nightmare mode that not only does not allow you to keep your cards between games, BUT makes you 'reset' your threat to your starting value if it happens to be lower than it. But that is boring, so I think I'll just give this mode a pass for now. For a deck that doesn't involve spirit, it's an auto loss, which is equally boring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46052-nightmare-mode-best-experience-so-far/?do=findComment&comment=463098","commentId":463098,"userName":"armored_butterfly","timestamp":1304459745,"content":"In our game, we had the four spheres (starter decks). Spirit did play a card of two to reduce the threat level for certain players, but no one died because he reached 50 threats. So I wouldn't say spirit plays such a pivotal role."}]}