{"url":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/","title":"Solo Tactics Deck gets hammered by first scenario","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461629","commentId":461629,"userName":"Reaper Steve","timestamp":1304211809,"content":"So, I've played 4-5 times now, all using the core tactics deck solo against the first scenario.\n\nSince the Passage thru Mirkwoord scenario is Difficulty 1 (the easiest), I thought it would be wise to play the same deck several times to get the hang of  it .Problem is, I keep getting crushed.\n\nMy intro game did not go well, but I made the common mistake of adding threat from engaged monsters during the Quest. Oops.\n\nI crushed the scenario the second time. Later I figured out that was because both decks played in the perfect order.\n\nThe next two tries weren't even close. I'm getting the feeling that solo core tactics deck isn't going to cut it. I can tell it's meant for a 2-player game. For instance, solo a Horseback Archer is no better than a Veteran Axehand (since the former can't really take advantage for Ranged) but it costs 1 more resource.\n\nShould I just accept that this deck isn't optimum for solo and move on? Or are my tactics to blame? I generally Quest Thalin and Gimli in a meager effeort to just hold back the threat while I make make real progress with Legolas (and maybe a Gondolian Blade) as he kills things. But I seem to average 1-2 threat per turn from failing the Quests. Add  another auto 1 threat at the end of the turn and that only gives me 10-12 turns to hack my way to the end. I just don't see it happening unless the threat deck is kind... there's no way if you've already beat Ungoliant's Spawn but have to cycle back through the deck with the \"Don't Leave the Path!\" Quest Card.\n\nThoughts?\n\nSteve"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461689","commentId":461689,"userName":"richsabre","timestamp":1304229679,"content":"just tryed first game last night with tactics- it got crushed too, i think the deck with denethor (lore? havent got it to hand) is the best at the moment but as i say, just my first impression."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461712","commentId":461712,"userName":"ChinaBlade2","timestamp":1304234440,"content":"Hiya,\n\nI was having pretty much the same experience and was concerned that this game wasn't going to live up to my expectations.\n\nA number of things convinced me to stick with it, and I am happy to say that my enjoyment is increasing with each play:\n\n1. Correcting some major errors I had been making with the rules (counting engaged enemy Threats being the killer). This produced my first win - placing that last progress token on the 1st Scenario gave me a huge sense of satisfaction.\n\n2. The community forums. Although I will never match the expertise and sheer creativity of most of these folk, if you are polite and sensible, they will help you gain everything you can from the game.\n\n3. It's a new game and I am hoping that official FAQs will address some of the ambiguities that have been identified. I think that by their nature, card games produce all kinds of weird and unforeseen interactions.\n\n4. I have accepted that this is an introductory set - and will be a limited example of the game's full potential. I am playing solo at the moment and using each starter deck on its own against each scenario in turn. This is just to get used to the game flow, the mechanics and some of the more obvious card partnerships (e.g. Aragorn/Theodred). It makes winning difficult, and although it would be legal to add extra Gandalf's to my player deck, or combine spheres in a single deck - I am satisfied at the moment with just getting used to how things work.\n\n5. I am hopeful that new card releases will give plenty of scope for variety of play. I'm not going to be a great deck-builder, but I am looking forward to trying out the decks that people will be sharing within the Community.\n\n6. I think the game looks great and captures the theme wonderfully.\n\nI look forward to coming home from work, putting one of Howard Shore's LotR scores on the hi-fi, laying out a game, drawing those first six cards into hand (and hoping to see Gandalf's face looking out from them...)\n\nVery Best Regards.\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461715","commentId":461715,"userName":"Troymk1","timestamp":1304235023,"content":" It is interesting that everyone is so in love with tactics. Is it because it is more glamorous to be the swaggering warrior?\n\n \n\nActually it is something I used to see in roleplaying. Many player's eyes would glaze over during events that would further the plot, and simply lived for the encounters.\n\nHowever in this game, since plot is driven by an abstract stat (Willpower), this emphasis on being badass fighty types is simply untenable.  Tactics is a One Trick Pony when it comes to forwarding the plot.  Even if Legolas kills an enemy each round, you will soon be behind on questing if more than two locations are hanging about.  \n\n \n\nAs more Heroes are released in the adventure packs this may change, but Tactics is simply not that good right now.\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461717","commentId":461717,"userName":"richsabre","timestamp":1304235303,"content":"i agree, ive just tryed the leadership and got far better results."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461723","commentId":461723,"userName":"Young Ranger","timestamp":1304236645,"content":" I tried the first scenario with three of the four single sphere deck. I still have not tried it with Lore. But I was able to beat the quest with Tactics and a final score of 42. Leadership did the best with a final score of 39 and Spirit failed. The key to be successful with Tactics is in a few cards. The Horn of Gondor is great to get resources. Having Legalos kill enemies and and using Feint and Thicket of Spears to handle your enemies attacks. And the most important is using Gandalf at the right time with the right choice. And the right choice depends on what is happening in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461741","commentId":461741,"userName":"Toqtamish","timestamp":1304240144,"content":"Troymk1 said:\n\n \n\n It is interesting that everyone is so in love with tactics. Is it because it is more glamorous to be the swaggering warrior?\n\n \n\nActually it is something I used to see in roleplaying. Many player's eyes would glaze over during events that would further the plot, and simply lived for the encounters.\n\nHowever in this game, since plot is driven by an abstract stat (Willpower), this emphasis on being badass fighty types is simply untenable.  Tactics is a One Trick Pony when it comes to forwarding the plot.  Even if Legolas kills an enemy each round, you will soon be behind on questing if more than two locations are hanging about.  \n\n \n\nAs more Heroes are released in the adventure packs this may change, but Tactics is simply not that good right now.\n\n \n\n \n\n \n\nI actually predicted a few weeks ago, in another thread, that Tactics would be the most popular sphere right out of the gate. It is kinda like Stark in the AGoT core set, people like the simplicity of just punching someone in the face. demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461766","commentId":461766,"userName":"aeneas2467","timestamp":1304242513,"content":" I had the same experience as you did. I thought that a tactics deck would be the easiest to learn the game because basically you just kill stuff. But, I had no way to quest effectively and got crushed; especially if a lot of locations were drawn. I've found that including Eowyn in decks is almost a must because of her '4' willpower and special ability and she is only a threat cost of '9'. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461795","commentId":461795,"userName":"Titan","timestamp":1304246361,"content":"Tactics is just a miserable questing deck. My experience with it was very similar, questing just in hopes of minimizing your threat gain and hoping Legolas can advance you. it doesn't usually get you far.\n\nI've noticed something ironic with the different spheres. In most other games I've seen, when they are just starting and the card pool is limited, the \"blunt\" faction(that is, the best faction at killing things) is usually the early favorite because beatdown is the way to go. Not so here, the game is structured in such a way that pure beatdown can't get you a victory. You need to be able to do several things well in order to pass more than the introductory quest. There is, in my opinion, a higher level of deckmaking required here than most new games have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461852","commentId":461852,"userName":"Reaper Steve","timestamp":1304254467,"content":"Thanks, guys, for confirming that the core tactics deck is not an optimal solo experience. I do really like the game, so I'll move on to another deck. I want to play each core deck a few times to get the feel and then I'll try to optimize a solo deck.\n\nI do get the feeling that the core tactics deck may be a great 2nd player deck. Let the first player focus on handling the quesing (the tactics player can throw in Thalin to damage monsters as they appear) and the tactics player can focus on fighting and making the maximum use of his ranged characters and Legolas' additional progress through battle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461874","commentId":461874,"userName":"pwvogt","timestamp":1304258449,"content":" I definitely agree with your assessment about Tactics being great for a second player. I introduced my brother to this game by having him play the tactics deck while I took Spirit (my personal favorite). We wiped the board of locations and monsters, and better yet he had a helluva time being the tank and killing stuff. He was hooked right away, and I would suggest if you want to demo the game with someone new, always have them playing the Tactics deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=461877","commentId":461877,"userName":"sputang","timestamp":1304258914,"content":"As the game evolves, I'm predicting there will be more ways for the tactics deck to progess through the scenario by killing stuff than questing, like Legolas and the Blade of Gondolin.   Once we have access to more cards like these, tactics could become a viable solo deck.  More neutral allies with high willpower will help too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=463043","commentId":463043,"userName":"Arma virumque2","timestamp":1304447782,"content":"Reaper Steve said:\n\nI just don't see it happening unless the threat deck is kind... there's no way if you've already beat Ungoliant's Spawn but have to cycle back through the deck with the \"Don't Leave the Path!\" Quest Card.\n\n\n\nIn addition to trying a different sphere, it sounds like you may have overlooked a critical element of the \"Don't Leave the Path\" card.  You're allowed to search both the deck and the discard pile for a spider, so if Ungoliant's Spawn isn't already in play, you can go grab it wherever it is, and start whacking away.  There's no need to cycle through the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=463186","commentId":463186,"userName":"Dam the Man","timestamp":1304472032,"content":"Solo Tactics win with minor rules hickups:\n\nwww.boardgamegeek.com/thread/648953/scenario-1-mirkwood-vs-core-tactics-deck [http://www.boardgamegeek.com/thread/648953/scenario-1-mirkwood-vs-core-tactics-deck]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=463230","commentId":463230,"userName":"jhaelen","timestamp":1304482004,"content":"Arma virumque said:\n\n \n\nYou're allowed to search both the deck and the discard pile for a spider, so if Ungoliant's Spawn isn't already in play, you can go grab it wherever it is, and start whacking away.  There's no need to cycle through the deck.\n\n\n\nYup. The third scenario isn't as forgiving:\n\nIn one of my games the Dungeon Jailor removed one of the objective cards which later turned up as a Shadow card, so it went to the discard pile. Fun! (Not.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46057-solo-tactics-deck-gets-hammered-by-first-scenario/?do=findComment&comment=463427","commentId":463427,"userName":"dvang","timestamp":1304509664,"content":"Dam said:\n\nSolo Tactics win with minor rules hickups:\n\nwww.boardgamegeek.com/thread/648953/scenario-1-mirkwood-vs-core-tactics-deck [http://www.boardgamegeek.com/thread/648953/scenario-1-mirkwood-vs-core-tactics-deck]\n\n \n\n\n\n \n\nYep, just one or two minor rules mistakes, that did not affect the win. It isn't the only time I've won with the tactics deck, but it was the only win without playing Beorn, who is essentially a 4th hero (that just doesn't gain resources). I've won two other times with Tactics, both with Beorn played. So, I'm 3-1 with Tactics vs scenario 1 so far.\n\nI'm going to try Tactics again and put another report on it up (probably Thursday). Based on my latest experience, it seems pretty clear to me that Tactics needs to quest with both Gimli and Thalin every turn, if nothing else than to reduce the threat each turn, but once you clear the staging area, you're almost guaranteed to make progress most turns."}]}