{"url":"https://community.fantasyflightgames.com/topic/46064-timing-questions-about-completing-quests/","title":"Timing questions about completing quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46064-timing-questions-about-completing-quests/?do=findComment&comment=461653","commentId":461653,"userName":"MechaJeff","timestamp":1304223136,"content":"So it seems that there are several situations where the players can complete a quest stage outside the quest phase, for example, Legolas sniping monsters and putting on success tokens.  There have been one or two other situations that have come up, like killing the hill troll while having a ton of completion counters on the first stage of Down the River.  Things like that.\n\nAnyways, the next stage has the players draw a bunch of new encounters and stage them.  What happens when you full treachery cards?  Lets say you get the treachery card that boosts the threat of all the locations in play, and you just pulled it during the, I dunno, lets say the planning phase.  I don't know how that might happen, but work with me (maybe the hill troll explodes somehow.)\n\nDoes the treachery card stay in play all the way through the quest phase, boosting the locations threat?\n\nDoes it get cycled into the discard pile / back into the deck and pull a new encounter until you get something more persistent (monster / location)?\n\nOr do you play it, the threat goes up for the planning phase, and then resets and normal, effectively meaning the card has no effect on the quest phase where it would matter?\n\nThanks for any clarification."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46064-timing-questions-about-completing-quests/?do=findComment&comment=461666","commentId":461666,"userName":"jhaelen","timestamp":1304225366,"content":"MechaJeff said:\n\nDoes the treachery card stay in play all the way through the quest phase, boosting the locations threat?\n\nDoes it get cycled into the discard pile / back into the deck and pull a new encounter until you get something more persistent (monster / location)?\n\nOr do you play it, the threat goes up for the planning phase, and then resets and normal, effectively meaning the card has no effect on the quest phase where it would matter?\n\n\n\nIts the latter. You just got lucky. Enjoy it while you can, it won't happen often demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46064-timing-questions-about-completing-quests/?do=findComment&comment=461669","commentId":461669,"userName":"pumpkin","timestamp":1304225538,"content":"I think the wording on the card is \"..during the phase\", so the card's effects end at the end of the planning phase.\n\nYou do play threat cards as normal, they aren't discarded and replaced with something more persistent.\n\nDuring set up/planning is one of the better times to pull a treachery card because, as you point out, a lot of their effects are redundant during that phase (thank Iluvatar for small mercies!)"}]}