{"url":"https://community.fantasyflightgames.com/topic/46127-rules-questions-that-need-answering/","title":"[Rules] Questions that Need Answering","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46127-rules-questions-that-need-answering/?do=findComment&comment=462163","commentId":462163,"userName":"fruszu","timestamp":1304314958,"content":"I have few questions about the rules:\n\n1. THALIN\nWhat happens when I quest with Thalin and draw Eastern Crows from the Encounter Deck?\n\nI think that Thalin Passive ability kills Crows before Surge keyword forces me to reveal another card from Encounter Deck. But am I right?\n\n2. ARAGORN + THEODRED\n\nWhen I commit characters to a quest, do I commit them all at the same time (I think so), or one after another? Can I commit Aragorn and Theodred, use Theodred's ability to give the resource to Aragorn and than stand Aragorn (paying with the resource he just received)?\n\n3. HUMMERHORNS\nDo I keep this card as a Vicotry card when it is played as a Shadow card? (I'm afraid I don't, but not sure).\n\n4. FOREST SNARE\nThat cards has a game text: Attach to an enemy engaged with a player. Attached enemy cannot attack.\nMy wife played this attachment on Ungoliant's Spawn engaged with me. I've been killed few minutes after that. Ungoliant's Spawn came back to Staging Area. Is Forest Snare discarded? I think so, because it has no legal targer - US is no longer engaged with a player. Or maybe this restriction matters only when i play the attachment?\n\nThank You for your help\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46127-rules-questions-that-need-answering/?do=findComment&comment=462171","commentId":462171,"userName":"fabest","timestamp":1304316794,"content":" 1. Thalin inflicts his damage before the Surge keyword, yes. Before \"when revealed\" effects too. This has been answered by Mr French and is available in the FAQ thread.\n\n2. No official answer about this yet, but it has been decided that you can choose the order in which you resolve the abilities so you can give a resource to Aragorn and he can use it to stand. Available in the FAQ thread too.\n\n3. No, you'll need to kill them as enemies. This is available in the rulebook.\n\n4. This one I'm not sure but I'd say that the target restriction is only taken into account when playing the card. This is how I read it and I'm pretty confident about that. But you never know :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nConclusion : be sure to read the FAQ thread, other rules thread and the rulebook before opening a new thread. Anyway, glad to help you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46127-rules-questions-that-need-answering/?do=findComment&comment=462185","commentId":462185,"userName":"DerBarchen","timestamp":1304319555,"content":"fabest said:\n\n \n\n4. This one I'm not sure but I'd say that the target restriction is only taken into account when playing the card. This is how I read it and I'm pretty confident about that. But you never know :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n\n\nIts true there are no official rules for it but going by other LCGs the way the rule works is that it checks for the Trigger once. The tirgger here being \"an enemy engaged with a player\" This means the attatchment definately stays on when it becomes un-engaged since it was engaged at the time of playing the attatchment. Hopefully this will be anwsered in the official FAQ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46127-rules-questions-that-need-answering/?do=findComment&comment=462327","commentId":462327,"userName":"fruszu","timestamp":1304333716,"content":" Thank You both for answers.\n\nI didn't notice that FAQ thread. I will be posting there next time. Thanks for help again!"}]}