{"url":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/","title":"Thoughts and questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/?do=findComment&comment=462159","commentId":462159,"userName":"Lostintransit","timestamp":1304313872,"content":"Hi all,\n\nSo I picked this up last week due to my friends love of Lotr and our joint love of card games. Having played a fair few games now I'm liking the game, but I feel the synergy between 3 or four decks favours the players far to much! I can see how this is a tricky game for 2 players (played a few myself), but i feel I might up the challenge to make it harder. Anyone else found this?\n\nAlso how many people have finished the \"nightmare\" challenge? It seemed way to easy with 3 players and brought up some crazy rules questions!\n\nQuestion 1: Can threat go below 0? this came about due to the blue deck having a card that lowers threat, plus a discard recycle card and my green deck having massive card draw, so he could lower everyones threat, then shuffle in and draw again! We decided that threat couldn't go below 0, so everyone finished Dolgur on 0 threat! :-D\n\nQuestion 2: How do you score the \"nightmare\" challenge? also do you keep out victory cards from quest to quest? the rulebook wasn't very clear on this!\n\nRegards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/?do=findComment&comment=462172","commentId":462172,"userName":"Toqtamish","timestamp":1304316984,"content":"Zero is lowest it could go.\n\nYes keep out the victory point cards, otherwise score as usual."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/?do=findComment&comment=462176","commentId":462176,"userName":"Lion1978","timestamp":1304317605,"content":"Agree to Toqtamish. We played it the same way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/?do=findComment&comment=462207","commentId":462207,"userName":"jhaelen","timestamp":1304322687,"content":"Lostintransit said:\n\nHaving played a fair few games now I'm liking the game, but I feel the synergy between 3 or four decks favours the players far to much! I can see how this is a tricky game for 2 players (played a few myself), but i feel I might up the challenge to make it harder. Anyone else found this?\nYup. Currently I think the game is hardly playable solo and a cakewalk with four players. In other words: It doesn't scale well, at all.\n\nMy inital enthusiasm is already wearing thin. I'm going to get the first AP cycle in the hope things stabilize and improve a bit, but I'm not very hopeful right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/?do=findComment&comment=462227","commentId":462227,"userName":"Toqtamish","timestamp":1304324427,"content":"I think the game plays great solo. And it is alot of fun. Looking forward to playing two player. I won't play 4 player until I get a second core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/?do=findComment&comment=462237","commentId":462237,"userName":"Lostintransit","timestamp":1304325268,"content":"Well thats insane if thats the case, we scored 126 points in total over 3 games on \"nightmare\". If the difficulty doesn't scale well then I might up the number of encounter cards drawn as a quick fix. Nice to know others have encountered this problem as well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46126-thoughts-and-questions/?do=findComment&comment=462430","commentId":462430,"userName":"servant of the secret fire","timestamp":1304347381,"content":"For my experience so far 4 players vs the game is not so good.If you and your friends like this game buy 2  core sets make 2 teams and play competitive.Trying to do better score than your oponents score is a lot more fun than 4 players vs the game.\n\nI enjoy solo and coop very much so far."}]}