{"url":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/","title":"Denethor: Basically a wall.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462208","commentId":462208,"userName":"DerBarchen","timestamp":1304322874,"content":"Ive been checking out people's \"first decks\" and general solo and multipalyer builds and Im not seeing any Denethor out there, or atleast not a lot. I was wondering if Im wrong to love him so much? I mean with 3 deffence he is basically a wall for the purposes of blocking and even if hes the only Lore hero in your deck you can effectively heal him every few turns with the likes of Self Preservation and Dughter of Nimrodel.\nHe's kind of become an auto-include in my decks that use atleast one lore hero.\n\nWhat are people's thoughts on him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462209","commentId":462209,"userName":"Troymk1","timestamp":1304323028,"content":" Yes he is pretty **** cool. My solo deck was Denethor, Glorfindel and Gimli.\n\nBasically giving me a first class Quester, Attacker and Defender.  Of course this meant my starting threat was 31 :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462212","commentId":462212,"userName":"fabest","timestamp":1304323315,"content":" I like him a lot too as he is the best defender of the core set.\n\nBut the Lore deck is the weakest I think for the moment, and as I'm still playing mono-sphere decks I don't use him a lot.\n\nIn multi-sphere decks he should be really valuable yes, especialy because he can let you use healing cards too.\n\nBut other Heroes seem difficult not to play (Legolas, Eowyn, Aragorn, Gimli…). I guess the choice will be easier when more cards will be available and that you will be able to really customize your deck to make the best of your heroes thanks to synergy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462271","commentId":462271,"userName":"raohthekenoh","timestamp":1304328543,"content":"I don't like Denethor because he falls into one of the few pitfalls I think this game has, some heroes end up pigeonholed into doing one thing and only one thing for the entire game. His ability is not particularly impressive (sometimes you might mitigate a massive threat, bu t you also exhaust him for the turn so it's a mixed bag) so the only logical thing you can do with him is wall, each and every turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462277","commentId":462277,"userName":"Emrad","timestamp":1304329046,"content":"As in basically every card game, card drawing is the key to win.\n\nThus, the best part of the Lore sphere is draw-engine part (the hero and the unique ally that makes you draw one as well). Healing isn't bad, but tanking monsters makes no sense when you can't efficently deal with them afterwards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462310","commentId":462310,"userName":"Darksbane","timestamp":1304332254,"content":" I built a Defensive Lore/Spirit deck [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/defense-lore-spirit-r20] in which Denethor's defense was a major part. With Protector of Lorien [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/protector-of-lorien-core] on him you can often make him virtually indestructible and in a pinch he can be good on quests too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462316","commentId":462316,"userName":"Toqtamish","timestamp":1304332820,"content":"I just put together a leadership/lore deck with Denethor in it to give him a try after reading this thread so will see how he works out. His high defense is appealing. Highest of any of the heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462337","commentId":462337,"userName":"Toqtamish","timestamp":1304335412,"content":"I gotta agree he does make a great wall, which is probably why his ability is somewhat lackluster to make up for the fact he has the second highest defense power of the player cards and the highest out of the heroes. I just finished a game with the PTM scenario using leadership/lore. While I got off to a good start drawing both of my Steward of Gondors I later realized its unique and had had two out on Aragorn and one on Denethor, which I found quite ironic. oops. It is a really good card to have out early as it gets you an early start on resources and I think it will work well when playing a game with leadership and another sphere as it helps the one other hero make a bigger impact with resources than you could accrue otherwise in the off sphere. However much like my game earlier today the locations and there threat just got to the point I could not get the willpower to remove them even once I got out Faramir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462383","commentId":462383,"userName":"DerBarchen","timestamp":1304341390,"content":"Darksbane said:\n\n I built a Defensive Lore/Spirit deck [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/defense-lore-spirit-r20] in which Denethor's defense was a major part. With Protector of Lorien [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/protector-of-lorien-core] on him you can often make him virtually indestructible and in a pinch he can be good on quests too.\n\n\n\nI ran something Very similar earlier but for some reason it didnt cross my mind to put PoL on Denethor. I think I read its rules as +1 attack insdead of defence. *facepalm*\nThat said a Lore/Spirit recursion deck can be really tough. You can bounce Gandalf in and out of play with Stand and Fight and with good draw and discard recurssion you can abuse PoL something fierce.\n\nSteward of Gondor is a must IMO, if palyed right it can seriously win games. I find it works great in Lore decks for the extra healing and/or spirit decks to help revive heros/Gandalf quicker. I had a MP game last night where my friend was playing Leadership and I was playing lore so he powered me up with Steward and took continuous damage on Gloin to gain resources and then I used Steward to create extra resources to heal Gloin xD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462454","commentId":462454,"userName":"scottindeed","timestamp":1304350873,"content":"Mono Lore deck is a big favourite of mine, and I have to say his ability is excellent.  Once I have enough Allies out, I use his Ability pretty much every turn and can judge exactly whether to quest or hold back and defend.  If its something really nasty he can just bounce the card to the bottom of the deck.  Fantastic ability in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462475","commentId":462475,"userName":"jhaelen","timestamp":1304352931,"content":"I beat scenario 2 solo using Denethor/Aragorn/Theodred. I very rarely used him to defend, though.\n\nI actually think his ability is very good. You should not underestimate the power of being able to plan how to distribute your resources (i.e. characters) perfectly every round. I also attached the support card to him that allows you to look at a shadow card before it's revealed.\n\nIn a game with a luck factor as high as this one, everything that helps to reduce the luck factor is extremely important.\n\nI think, at the moment solo play would be improved most by a card that allows you to search your deck for a specific card (type). I hope there'll be something like this in the first AP cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462511","commentId":462511,"userName":"GirderZombie","timestamp":1304359748,"content":"I was majorly down on Denethor initially but both his ability and his 3 defense are significant. I like having Theordred, who is so popular right now, Denethor and one other hero in my solo decks. I like that Denethor enables lore so that I can splash forest snare, which is great for slowing Hill Trolls and other major baddies down and you can play it on turn 2 with Theo accelerating out resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462543","commentId":462543,"userName":"Mackey79","timestamp":1304364181,"content":"Toqtamish said:\n\nWhile I got off to a good start drawing both of my Steward of Gondors I later realized its unique and had had two out on Aragorn and one on Denethor, which I found quite ironic. oops.\n\n\n\nI had the same problem once. Had two out and realized much later that it's a unique card. It seemed to good to be true.... gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=462621","commentId":462621,"userName":"KDuffert","timestamp":1304388293,"content":"In solo play Denethor rocks da house cause when you are able to plan the next adventure phase with knowing what is coming, you can get all out of your possibilitys."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464238","commentId":464238,"userName":"GodRob","timestamp":1304623348,"content":"I agree he's a \"wall\", but he also has an ability that is very useful at the end of the turn, just in case there are no enemies to engage.  Sneaking a peek at the next encounter card can really help with the upcoming Quest phase.\n\nRobert"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464337","commentId":464337,"userName":"Beornd","timestamp":1304645797,"content":"jhaelen said:\n\nI beat scenario 2 solo using Denethor/Aragorn/Theodred. I very rarely used him to defend, though.\n\nI actually think his ability is very good. You should not underestimate the power of being able to plan how to distribute your resources (i.e. characters) perfectly every round. I also attached the support card to him that allows you to look at a shadow card before it's revealed.\n\nIn a game with a luck factor as high as this one, everything that helps to reduce the luck factor is extremely important.\n\nI think, at the moment solo play would be improved most by a card that allows you to search your deck for a specific card (type). I hope there'll be something like this in the first AP cycle.\n\n\n\nReally interesting. i wonder how to manage the troll attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464359","commentId":464359,"userName":"jhaelen","timestamp":1304650379,"content":"Beornd said:\n\n \n\nReally interesting. i wonder how to manage the troll attack.\n\n\n\nForest Snare! I had one in my starting hand and sent Denethor and Theodred questing to be able to play it in turn two. With a bit of luck you should also manage to stay safe from the troll for a turn or two, since you're starting with a threat of only 28."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464376","commentId":464376,"userName":"servant of the secret fire","timestamp":1304653426,"content":"jhaelen said:\n\nBeornd said:\n\n \n\n \n\nReally interesting. i wonder how to manage the troll attack.\n\n \n\nForest Snare! I had one in my starting hand and sent Denethor and Theodred questing to be able to play it in turn two. With a bit of luck you should also manage to stay safe from the troll for a turn or two, since you're starting with a threat of only 28.\n\n \n\n\n\nWith one core set you have only 2 forest snare and only Gandalf can save you from the troll.Even if you are lucky with the troll then you must have a good group of heores to make a fast passage threw the second face of the scenario or else your threat will hit 50 very fast.\n\nFrom my experience the best solo deck so far (i must test all combinations of heroes) for the second scenario is Gimli,Legolas and Eowyn.You have more chances to avoid troll and kill it.With 3x Gandalf,2x feint,2x thicket of spears,2x quick strike,1x stand together and ofcourse Gimli you have more tools to face the troll.\n\nAs for Denethor's abilities and stats are great but i hate him so much from the books so i will not use him even if he is my last hope to win a scenario gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464466","commentId":464466,"userName":"jhaelen","timestamp":1304672717,"content":"servant of the secret fire said:\n\nFrom my experience the best solo deck so far (i must test all combinations of heroes) for the second scenario is Gimli,Legolas and Eowyn.\n\n\n\nWell, my experience has been different. I've tried it 24 times using Gimli, Legolas, and Aragorn without success. The main problem of using Gimli to block and kill the troll is that Gimli ends up being lethally wounded and almost always ends up dying at some later point because of it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464479","commentId":464479,"userName":"Toqtamish","timestamp":1304675098,"content":"Maybe instead use a lore character like Glorfindel and use their healing cards on Gimli when needed. That is how I beat scenario 2. Left wounds on Gimli for the extra attack power boost but when needed healed him to prevent his death."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464510","commentId":464510,"userName":"Troymk1","timestamp":1304679051,"content":" I used Denethor, Glorfindel and Gimli.\n\n \n\nSo basically a quester, a defender, and an attacker. Not bad.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464550","commentId":464550,"userName":"Bohemond2","timestamp":1304682319,"content":"servant of the secret fire said:\n\nFrom my experience the best solo deck so far (i must test all combinations of heroes) for the second scenario is Gimli,Legolas and Eowyn.You have more chances to avoid troll and kill it.With 3x Gandalf,2x feint,2x thicket of spears,2x quick strike,1x stand together and of course Gimli you have more tools to face the troll.\n\nRemember the requirements on Thicket of Spears.  You can't play the card if you don't have three tactics heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46129-denethor-basically-a-wall/?do=findComment&comment=464589","commentId":464589,"userName":"servant of the secret fire","timestamp":1304686825,"content":"Bohemond@\n\nYou are so right.Yes this card is uselles if you play with 2 different spheres.I was palying this wrong.I did a new test today  with this deck and i left Thicket of spears out and it is still good.\n\nJhaelen@\n\nThe promblem with the 3 hunters is that your starting threat is 32 and troll engages you immidiatly.With one unlucky hidden card if you defend troll with Gimli you can loose him from the first round.I use 3 core sets for hunters deck cause 3X Gandalf,Beorn,sneak attack,celebrian's stone and some cards from spirit sphere can do the job a little more easier.But my mane promblem with other decks and the one with the hunters is not the troll so much but the second phace of the scenario wen you draw one extra card per player each quest phace and you need 16 progress tokens to pass it.Eowyn is the best tool for this phase."}]}