{"url":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/","title":"Scaling this game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462228","commentId":462228,"userName":"Troymk1","timestamp":1304324492,"content":" Everyone seems to agree this game is frightfully difficult with one deck and not too hard at all with 4 decks in play. Just the amount of resources available and your choice of tactical options makes things much easier. I propose the following scaling fix.  The Staging area receives 1.5 cards in the quest phase (rounded down)  \n\n \n\nSo this would translate as  \n\n1 Player   = 1 Card\n\n2 Players = 3 Cards\n\n3 Players =  4 Cards\n\n4 Players =  6 Cards\n\nI will play-test this soon, but would love to hear some feedback.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462231","commentId":462231,"userName":"Toqtamish","timestamp":1304324649,"content":"I think it plays fine as is but would be interested to see the results of your playtesting nonetheless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462241","commentId":462241,"userName":"Carnivean","timestamp":1304325457,"content":"We have found 1 and 2 players isn't too bad, but beyond 2 it seems skewed in favour of the players.  We decided on:\n\n1 Player = 1 Card\n\n2 Players = 2 Cards\n\n3 Players = 4 Cards\n\n4 Players = 6 Cards\n\nWorks well so far"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462266","commentId":462266,"userName":"Troymk1","timestamp":1304327874,"content":" So that would be an EXTRA card for each player beyond the second?  Ok I will try that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462283","commentId":462283,"userName":"Emrad","timestamp":1304329234,"content":"For the record, the nightmare mode is totally beatable in a 2-player game with well-build decks (even with only one Core set).\n\nSo adding a 3rd card to each Quest phase might be a good \"hard mode\" variant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462352","commentId":462352,"userName":"Narsil0420","timestamp":1304336953,"content":"I also just played a very easy four player game last night and I was thinking what if during a four player game, you raised your threat by two each turn instead of one? One of the problems in the game was that the Spirit Sphere was a little bored because the rest of us took all the fighting on our selves. This would make Spirit feel a little more vital as they would need their Threat lowering abilities even more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462515","commentId":462515,"userName":"Carnivean","timestamp":1304360273,"content":"That was another reason we decided that dual spheres were a must for us Narsil.  We \"fixed\" the heroes so that there is no clashes, still 30 card decks.  We upped each deck to 2 x Gandalf though to offset the changes.\nOur \"starting\" decks now look something like:\n\nGimli, Legolas, Theodred - 20 tactic, 10 leadership cards\n\nEowyn, Dunhere, Thalin - 20 spirit, 10 tactic cards\n\nGlorfindel, Denethor, Eleanor - 20 lore, 10 spirit cards\n\nAragorn, Gloin, Beravor - 20 leadership, 10 lore cards\n\nTheory behind the splits was for Tactics to get a bit of resource generation support from Theodred, Spirit to get an additional quest supporter and buff their damage potential in Thalin, Lore to get some more interaction in the main part of the game with Eleanor and events, then Leadership to get some card draw and Aragorn to have another Dunedain Ranger with him :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWe have found it works pretty well at the moment and changes the game quite a lot for a few reasons.  Resource management and uniques become a big part of it.  Also the cards are thinned out slightly because 10 have gone walk about to another deck, so it probably plays closer to a 50-card deck.  There are no 3x of any card in the respective decks.\n\nThe unique part of it has really made things interesting though.  One game we had the \"tactics\" deck put out Steward of Gondor first and then the \"leadership\" player was stuck with it.\nThe other thing we found is that the table talk really changed.  Playing straight colours and having all four represented means guaranteed no conflicts.\nAll of a sudden the Leadership player wasn't quite so open as his plans for dealing with something may be thrown out by the Tactics player.\n\nGood fun!\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462641","commentId":462641,"userName":"fabest","timestamp":1304392742,"content":" Obviously, if you modify the pre-constructed decks, you have to respect the 50 cards minimum rule, otherwise the game would be too easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462697","commentId":462697,"userName":"Bohemond2","timestamp":1304405597,"content":"If you are finding the game too easy you could make a radical change. Something crazy, like playing with 50 cards instead of 30."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462837","commentId":462837,"userName":"Troymk1","timestamp":1304424465,"content":"Bohemond said:\n\nIf you are finding the game too easy you could make a radical change. Something crazy, like playing with 50 cards instead of 30.\n\n\n\n \n\nI am talking about 4 player 50 card decks actually Behemond,  Between the 12 special character abilities and the amount of resources (and cards) at their fingertips, even the 3rd scenario doesn't seem TOO difficult.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=462847","commentId":462847,"userName":"Fieras","timestamp":1304425473,"content":"Carnivean said:\n\nGimli, Legolas, Theodred - 20 tactic, 10 leadership cards\n\nEowyn, Dunhere, Thalin - 20 spirit, 10 tactic cards\n\nGlorfindel, Denethor, Eleanor - 20 lore, 10 spirit cards\n\nAragorn, Gloin, Beravor - 20 leadership, 10 lore cards\n\nPublish [../../../edge_public/img_edge/spacer.gif]\n\n\n\n \n\nPlay with 50 card decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=463054","commentId":463054,"userName":"Carnivean","timestamp":1304451262,"content":"Fieras said:\n\nCarnivean said:\n\n \n\nGimli, Legolas, Theodred - 20 tactic, 10 leadership cards\n\nEowyn, Dunhere, Thalin - 20 spirit, 10 tactic cards\n\nGlorfindel, Denethor, Eleanor - 20 lore, 10 spirit cards\n\nAragorn, Gloin, Beravor - 20 leadership, 10 lore cards\n\nPublish [../../../edge_public/img_edge/spacer.gif]\n\n \n\n \n\n \n\nPlay with 50 card decks.\n\n\n\nDo that with one CS and 4 players?\nEven if 4 players buy 4 CS then they cannot make 4 single sphere decks.  Unless they play nicely and swap heroes politely, 4 dual-sphere decks is hard to get working because people want the same hero.\nHow about you think about what you are saying rather than coming in an spewing a throw-away line that adds nothing and doesn't contribute?\n\n\nWe are experimenting to see what we can get out of the core set despite it saying 1-2 players to get people interested in the game.  So all the responses of \"Play 50 cards\" are relatively irrelevant.\n\nPersonally I have 3 CS myself and muck around with 50-card decks all the time, but turning up to a demo day in a store, stacking the deck with cards and then playing dual sphere is not really an option.\nWhen you have 10-12 people playing all the starters, that puts bullets in the dual sphere decks.\n\nAll I have done is change up the starters so that people can see where the game will/could go, have a different experience and explore some of the other aspects of the game like resource management which is largely non-existent in starter games. \n\nSo generally speaking, 50-cards isn't really a good option for a lot of people just starting out and seeing what the game is like"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=463062","commentId":463062,"userName":"Carnivean","timestamp":1304452719,"content":"Troymk1 said:\n\nBohemond said:\n\n \n\nIf you are finding the game too easy you could make a radical change. Something crazy, like playing with 50 cards instead of 30.\n\n \n\n \n\n \n\nI am talking about 4 player 50 card decks actually Behemond,  Between the 12 special character abilities and the amount of resources (and cards) at their fingertips, even the 3rd scenario doesn't seem TOO difficult.\n\n \n\n \n\n\n\nI agree Troymk1.  We had some dual-sphere decks built up to 50 and we didn't see the challenge we thought we would.  The one thing that did catch us off was the 5 threat location a couple of times, but it largely mean 1-2 progression counters and not 4-5.\n\nJust further on the upping the cards thing, we had a game last night and it did make a difference.  We turned over two Brown Lands that would have been split into two questing phases.  That was interesting.  We have seen an average in threat increase with 4 players of around 3-4 I'd say.  Most extra threat we had was with that Brown Lands and we got 8 extra than the first 4 cards turned.\n\nhaven't played 3-player enough yet to comment, but I cannot see it being too out of whack compared to 4 player"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=463072","commentId":463072,"userName":"Ucayali","timestamp":1304453954,"content":"Maybe in future good solution will be changing number of heroes available for each player depend how many is playing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=463991","commentId":463991,"userName":"Entropy42","timestamp":1304591673,"content":"Carnivean said:\n\n \n\nTroymk1 said:\n\n \n\nBohemond said:\n\n \n\nIf you are finding the game too easy you could make a radical change. Something crazy, like playing with 50 cards instead of 30.\n\n \n\n \n\n \n\nI am talking about 4 player 50 card decks actually Behemond,  Between the 12 special character abilities and the amount of resources (and cards) at their fingertips, even the 3rd scenario doesn't seem TOO difficult.\n\n \n\n \n\n \n\n \n\nI agree Troymk1.  We had some dual-sphere decks built up to 50 and we didn't see the challenge we thought we would.  The one thing that did catch us off was the 5 threat location a couple of times, but it largely mean 1-2 progression counters and not 4-5.\n\nJust further on the upping the cards thing, we had a game last night and it did make a difference.  We turned over two Brown Lands that would have been split into two questing phases.  That was interesting.  We have seen an average in threat increase with 4 players of around 3-4 I'd say.  Most extra threat we had was with that Brown Lands and we got 8 extra than the first 4 cards turned.\n\nhaven't played 3-player enough yet to comment, but I cannot see it being too out of whack compared to 4 player\n\n \n\n \n\nAll the comments about playing with 50 card decks are kinda pointless.  The (3-4 player) game is still really easy with 50 card decks.  I played a 3 player game last night, 2nd scenario, using 2 50 card decks constructed from a single core set.  The 3rd deck was just 2 factions from a 2nd core set stuck together, no mixing of the 2 core sets.  For added challenge, we played with adding 4 cards in each questing phase, and in the 2nd phase of the quest we added 6 cards (rather than just 1 additional card) to the staging area.  In the 3rd part of the quest, it says to add 2 for each player (6 total), but we added 9 instead.  We beat the scenario with a final score of 91 and never were in terrible shape.  Even had 2 Hill Trolls out in the staging area at once."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=464000","commentId":464000,"userName":"Troymk1","timestamp":1304592594,"content":" Yeah I am hosting a 4 player game over on BGG using iPhone shots and text to convey the state of the game\n\n javascript:void(0);/*1304610605290*/ [http://www.boardgamegeek.com/thread/647735/play-by-forum-game-1] \n\nCurrently the guys have just freed Glorfindel without TOO much trouble at all and now have the Nazgul chasing them.\n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=465429","commentId":465429,"userName":"Carnivean","timestamp":1304881740,"content":"We had a close one on Friday night on scenario three with four players.\n\nThe 30-card decks split with the Spheres I list above worked a treat.  In those though there were none of the 1-of cards just to make it tougher . . . no Beorn, Horn, Brok, Grim Resolve, Celebrian's Stone, Unexpected Courage, etc.  Also there were no 3 x any card in any individual deck.  Taking out those game changing cards mean we had to dip into the second CS, but the end result was worth it.\nGimli was the captured Hero, but resource management was interesting, you definitely have to think more about the cards coming forth and the amount of time before cards can come out is increased, especially in the off-suit of the cards.\n\nEnd score ended up being around 140 from memory with 2 new players.  3 heroes lost, Gloin, Beravor and Theodred.  Everyone on 40+ threat, one on 47.  It was the first game we have fealt like it was a challenged.\n\nTaking out the singles from the core set I think made a huge difference.  Limiting to a max of 2x put it back closer to a 50-card experience (chance of drawing any 2x card in 30-card deck is 6.67% vs 6% in 50-card deck) added to things as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=465560","commentId":465560,"userName":"Deleriad","timestamp":1304918366,"content":" I haven't played enough multi-player yet to be sure about how well this game scales but it seems unlikely that just adding 1 card extra per player to the encounter deck draw will cut it.\n\nE.g. imagine some hypothetical game where two teams play each other. 1 team has 1 player, draws 2 cards per turn and gains 3 resources. The other team has 2 players, draws 1 card each, has 3 resources each, starts with 6 cards each and so on. Basically there's a clear asymmetry.  When you consider as well that essentially the game consists of two cooperating players against what is essentially a very simple AI (draw 1 random card and play it immediately) then it seems unlikely the game will scale. Finally it appears that although the card pool for the players will increase, there's no sign of how (if any) constructed encounter decks will pan out. \n\nI've seen enough CCGs/LCGs from FFG to know that they will have done the same calculations so I assume that the expansion decks will attempt to address the issues. Alternately they may just decide that the game is basically suboptimal with more than 2 players. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=465919","commentId":465919,"userName":"BudSinigaglio","timestamp":1304968070,"content":"Our 4-player group easily beat the first 2 scenarios (several times). When we read the 3rd \"Escape from Dol Guldur\" quest cards we were scared. We played it and beat it with very little trouble. Our prisoner was Theodred, that was no problem. Gorn got Steward & CS right away and his resources were good. We always thought we were in a bad spot but someone always had a card to deliver us from ruin. Only once during \"Through the Caverns (card 2b) did we have a rough spot. We quested like 6 dudes for 16 willpower. We revealed and Ungoliant's spawn which knocked us down to 10 willpower. Then came \"Under the Shadow\" which raised the theat strength by 4 (for a 4-player game). We ended up with 10 willpower vs. 20 thread strength. We all discarded 1 card from Eowyn's action and we ended up with 14 willpower so we were all -6. We each added 6 threats and I thought we were done for. We spanked the Nazzie in one turn. Denethor defended, Glorfindel attacked with 3 archers helping and a couple allies. Hummerhorns killed Gloin but the leadership deck was still doing fine. We were basically messing around so the Lore deck helped the Spirit deck abuse card drawing so we could get \"Fortune or Fate\" to bring Gloin back. We were successful. Spirit eventually got both his Northern Trackers\" and that was the end of any locations messing with us. We were healing heroes wounds at the end just to pad our score. Wasn't too challenging.\n\nSo as I read this thread, I tend to agree with Carnivean's post on page one about adding more staging phase encounter deck cards. I think we will do that from now on. The locations will rarely hurt you if you can quest with 1 or more Northern Rangers. It's just the treachery and enemies you have to handle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=465967","commentId":465967,"userName":"Carnivean","timestamp":1304978518,"content":"Elven Archer said:\n\nThe locations will rarely hurt you if you can quest with 1 or more Northern Rangers. It's just the treachery and enemies you have to handle.\n\nYeah I am starting to think they need to be toned down a little.  We didn't have one out and were battling to break even on a few rounds and the threat before the draw was pushing up toward 12 . . . there was about 7 locations out and about.  Everyone was on edge.\n\nThen I drew a Ranger and told everyone if we held on for 2 turns (i was playing the Spirit/Lore adjusted starting deck i mentioned in our group and had only 2 spirit resources) then all would be fine.\n\nNext turn 2 more locations and it went to a 15 threat in the SA, but the Rangers were out so almost all of them would be completed next turn.\n\nIt was the first time we felt pushed even in the third game with four players, but the Rangers killed off any perceived doubt we had about succeeding.\nThat being said it has been our favourite 4-player game to date.\n\nOut of interest, we used the following discuassed in this thread:\nAdjusted dual sphere starter decks (listed previously)\nDid not include any of the cards that appear as singles in the CS other than Gandalf\nDid not use the extra threat cards mentioned above."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466192","commentId":466192,"userName":"BudSinigaglio","timestamp":1305024582,"content":"Locations are a major aspect to the game. In a 4-player game, we found that locations are what really kill the fellowship. On any given quest phase, we often draw 2 (sometimes 3) locations are drawn during staging. with legolas addiing tokens for helping with a kill, the group can sometimes take down 2 locations per round. Sometimes the group can only remove 1 location. As each round progresses, it seems as though the locations begin to overwhelm the group. Several times we had 6 or 7 locations out there adding 12 to 16 threat strength against us. Every single time that happened we had a Northern Ranger to wipe out all the locations (either this round or the next). It's a little frustrating to come to the conclusion that if the group has at least 1 Northern Ranger that all locations are basically moot, but if the group has 0 Northern Rangers the locations alone will cause the group to lose the game via unsuccessful questing. Even when the group \"travels\" every turn during the travel phase they can't seem to knock out the locations as quickly as they are drawn (even with Legolas' help). Not to mention the steep cost of paying the effects to travel to some of them. That Northern Ranger seems to make or break the game for us EVERY SINGLE TIME.\n\nNot sure how to fix that problem. Even drawing 6 encounter cards during the staging part of the quest phase in our 4 player game won't affect this Location vs. Northern Ranger problem. The Northern Ranger is either:\n\na) questing and knocking down an unlimited number of locations or\n\nb) not out there and therefore the group dies by being overwhelmed with locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466210","commentId":466210,"userName":"Apophenia","timestamp":1305026023,"content":"Elven Archer said:\n\n \n\nNot sure how to fix that problem. Even drawing 6 encounter cards during the staging part of the quest phase in our 4 player game won't affect this Location vs. Northern Ranger problem. The Northern Ranger is either:\n\na) questing and knocking down an unlimited number of locations or\n\nb) not out there and therefore the group dies by being overwhelmed with locations.\n\n \n\n \n\nI mentioned it somewhere before but one thing you could do, if you have two core sets, is to take two encounter decks and remove all the locations from one of them and then combine them. This will probably help with the location distribution and make the Northern Tracker less required. For scenario one this drops the location average from once every three cards to once every five cards. (Note I only recommend this when drawing more then four encounter cards a turn and that I haven't tested this at all.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466411","commentId":466411,"userName":"Carnivean","timestamp":1305050006,"content":"Elven Archer said:\n\nThat Northern Ranger seems to make or break the game for us EVERY SINGLE TIME.\n\nNot sure how to fix that problem. Even drawing 6 encounter cards during the staging part of the quest phase in our 4 player game won't affect this Location vs. Northern Ranger problem. The Northern Ranger is either:\n\na) questing and knocking down an unlimited number of locations or\n\nb) not out there and therefore the group dies by being overwhelmed with locations.\n\n\n\nOur group is trying to avoid the drawing extra cards mentioned earlier.  What we did was try to get a 30-card deck to play more like a 50-card and by cutting max duplicates to 2 instead of three has made a difference at 30 cards.  Putting a restriction on our decks as opposed to changing the rules feels less like cheating :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  But as you said the problem with the Rangers is still present.\n\nWe were talking about it after last week's games and suggestions have been thrown around and there were two that seem to have merit, though we haven't play tested it yet:\n\n 1. Response: After Northern Tracker commits to a quest, Northern Trackers gains progress tokens equal to it's remaining life.\n    Response: Travel phase.  Exhaust Northern Tracks to place any progress tokens on Northern Trackers onto Locations in the staging area.\n 2. Response: After Northern Tracker commits to a quest, Northern Trackers gains 4 progress tokens.  Northern Trackers may only gain 4 tokens in this method.\n    Response: After a successful quest that the Northern Trackers were committed to, Norther Trackers may move it's progress tokens to innactive Locations.\n\nThe first one has the Trackers stock-piling tokens but then having to not commit to a quest to utilise them.  It also ties the token accrual to the life/health of the trackers.  Healthy trackers are better trackers.\n\nI like the second one too.  Fixed tokens and it doesn't have to exhaust to use them but must be questing on a successful quest.\n\n \n\nThe one thing with the Trackers at the moment is that they can clear the board in around 2 turns, and pretty much hand an auto-win to an extent.  I am not saying they should be changed but they were two ideas we came up with just chatting about the same thing after a game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466488","commentId":466488,"userName":"BudSinigaglio","timestamp":1305062807,"content":"Carnivean, both of your suggestions are EXCELLENT. I intend to try at least one of them. Not sure which one I like more, but they both seem very reasonable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466502","commentId":466502,"userName":"conykchameleon","timestamp":1305066151,"content":"I wouldn't be too quck to nerf the Northern Trackers just yet. If you notice on the Conflict at Carrock preview, there are upcoming locations that are immune to player card abilities..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466514","commentId":466514,"userName":"BudSinigaglio","timestamp":1305068720,"content":"I think I like that. Gives me confidence that playtesting and/or message board activity is affecting future releases. I really like that Northern Ranger so I hope they keep him from breaking the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466544","commentId":466544,"userName":"Carnivean","timestamp":1305075991,"content":"Hmmm, while we should definitely take a wait and see approach in general, those two I just suggested were ideas thrown around after a game where the Trackers turned it from a VERY tight game into a cake-walk.\n\nIt is definitely a game changer though and a card we are watching as a group closely.\n\nAlso take a look at the Carrock, it is definitely going to be the final destination in terms of the quest based on it's ability with the trolls and the way you travel to the location.  The \"immune to player's cards\" effect is there, I bet, to prevent people circumventing the quest the way it is meant to play.  I cant see it being a common location power except for Location based scenarios.\n\nThe threat reduction ability of the Trackers is crazy, crazy to the point where we never travel to a Location if one is in play, as a general rule.  We had about 16 threat on the board with 14 from locations and in two turns there was 2 threat in the staging area.  With 2 or even 3 Carrocks out at once, the Tracker would still be removing 6-8 threat, which is massive in this game's scope.\n\nTo me the Locations are there to be a persistent threat, they are tougher to manage than creatures just because the rate at which we can negate them.  The Trackers ability to nullify massive amounts of threat seems to be a little unbalanced at this stage of the game.\n\n \n\nWait and see for sure, but they are a massive card in the game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466972","commentId":466972,"userName":"Troymk1","timestamp":1305136305,"content":" I have been playtesting the 6 encounter cards for 4 players and it seems to work really well.\n\n \n\nAnyone else?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466984","commentId":466984,"userName":"Carnivean","timestamp":1305138451,"content":"We started doing that and it worked well, but a few of the guys felt that we were messing with the rules, so we started trying the \"max 2 copies in 30 card decks\" solution.\n\nI dont think it was messing with the rules too much myself, but the 2 copies thing seems to dilute things down enough to reflect close to a 50-card deck.\nFrom how it played for dual-sphere 30-card decks, I think we will stay with that until a few releases come out and a few more heroes.\n\nTaking the chance of getting cards from 1/10 to 1/15 is a lot closer to the approximate 1/17 from a 50-card deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=466987","commentId":466987,"userName":"Entropy42","timestamp":1305138918,"content":"Are there really that many 3-ofs in the base set that you want to draw all the time?  I feel like I could make my pre-cons better by going down to only 2 of many of the triplicates, thus increasing my chances of drawing the more powerful single and double cards that are in there (like Gandalf).\n\nFWIW, I've played with the 6 cards for 4 players rule, and found it to be good.  We did this while also scaling up the quest cards, so if it said reveal an additional card each quest phase, we revealed 4 additional cards. \n\nI haven't played enough games where Northern Tracker was game breaking, but I have noticed I'm always happy to get him out.  His ability is unusually strong in MP.  Is he unique?  If not, maybe a rule to say he is would help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=467016","commentId":467016,"userName":"Carnivean","timestamp":1305144191,"content":"Entropy42 said:\n\nAre there really that many 3-ofs in the base set that you want to draw all the time?  I feel like I could make my pre-cons better by going down to only 2 of many of the triplicates, thus increasing my chances of drawing the more powerful single and double cards that are in there (like Gandalf).\n\nFWIW, I've played with the 6 cards for 4 players rule, and found it to be good.  We did this while also scaling up the quest cards, so if it said reveal an additional card each quest phase, we revealed 4 additional cards. \n\nI haven't played enough games where Northern Tracker was game breaking, but I have noticed I'm always happy to get him out.  His ability is unusually strong in MP.  Is he unique?  If not, maybe a rule to say he is would help.\n\n\n\nBy removing the 3-ofs and going dual sphere changes it more.  Just going to 2-ofs itself wouldn't make a huge difference as you say, but we haven't increased the 1-ofs.  We just use the core set at the moment to try and balance it at that level.  Also things like Faramir and Steward of Gondor got split between the Leadership/Spirit and the Tactics/Leadership deck.  So other things got lowered just through making dual-sphere decks.\n\nYeah NT is not unique.  But even with one he can clear a hell of a lot in 2 turns with a large portion of the Locations as they are mostly 2 progress.\n\nAnd yeah I guess in MP, he ramps up quickly.  We have had 4-player games where we have drawn 4 Locations on the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=467209","commentId":467209,"userName":"Troymk1","timestamp":1305185871,"content":" \n\nAS a side not on scaling. I am using 50 card 2 sphere decks to hand out to my friends.  I will play test again during the Dallas Games Marathon "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=467237","commentId":467237,"userName":"Troymk1","timestamp":1305188411,"content":" I think diluting your deck is more about making it random, and as this is a deck building game, not of much interest to most people.\n\n \n\nMy guess is it was playetested heavily as a two player and that's it.  So as was proposed 1 extra encounter card for 3 player, 2 extra for 4"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=470854","commentId":470854,"userName":"Troymk1","timestamp":1305732258,"content":" Alright I have been playtesting the 6 encounter card variant for 4 players and here are the results.\n\nScenario 1 =  beat the scenario in 3 turns, Score 134. (including Thalin being lost to an unlucky shadow effect)\n\nScenario 2 = beat the scenario in 4 turns,  Score 126. \n\nScenario 3 = have failed 3 times. Last effort was the closest. 9 turns Beravor, Theodred and Dunhere Killed and all 4 players pushed over 50 threat by a nasty combo of encounter cards. \n\n \n\nI think Scenario 3 is do-able with 6 encounter cards but it will take some luck on my part.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=470871","commentId":470871,"userName":"Mestrahd","timestamp":1305734854,"content":"If you're that concerned about Northern Tracker, why not just make him put one progress token on one location in the staging area, instead of all? That way he's equivalent to Lorien Guide but with better stats for the extra cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46131-scaling-this-game/?do=findComment&comment=470995","commentId":470995,"userName":"Carnivean","timestamp":1305754268,"content":"Troymk1 said:\n\n Alright I have been playtesting the 6 encounter card variant for 4 players and here are the results.\n\nScenario 1 =  beat the scenario in 3 turns, Score 134. (including Thalin being lost to an unlucky shadow effect)\n\nScenario 2 = beat the scenario in 4 turns,  Score 126. \n\nScenario 3 = have failed 3 times. Last effort was the closest. 9 turns Beravor, Theodred and Dunhere Killed and all 4 players pushed over 50 threat by a nasty combo of encounter cards. \n\n \n\nI think Scenario 3 is do-able with 6 encounter cards but it will take some luck on my part.\n\n\n\nThat looks similar to ours though we have only played S3 once and we scraped through.  All our wins were over 110 as well but I didn't keep notes (i think one may have been like 118).\n\nIf I demo to people I get out the dual-sphere decks and run the rules as is.\n\nIf we are playing with our group, we construct and play 4/6 threat cards for 3/4 players."}]}