{"url":"https://community.fantasyflightgames.com/topic/46145-loretactics-solo-deck/","title":"Lore+Tactics solo deck?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46145-loretactics-solo-deck/?do=findComment&comment=462400","commentId":462400,"userName":"CrowOfPyke","timestamp":1304343270,"content":"I have been tooling around with solo play to better understand the card options.  I have tried Leadership+Lore and Leadership+Spirit, both work fine.\n\n \n\nI have been trying Lore+Tactics.  It's terrible in solo play, but perhaps I am \"doing it wrong\".  Anyone been successful in solo play with this Sphere combo?  If so, mind posting a deck list so I can see where I am going off the path?\n\n \n\nIn a side note, I have yet to try Leadership+Tactics, Lore+Spirit, or Spirit+Tactics....  I am curious to see how those combos work as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46145-loretactics-solo-deck/?do=findComment&comment=462401","commentId":462401,"userName":"Toqtamish","timestamp":1304343545,"content":"Leadership plus tactics won me the PTM scenario last night, deck list is in my Ungoliant Spawn How I detest thee thread...\n\nI am playing solo 30 card beginner deck Spirit right now and am tearing apart the PTM scenario so far but right now I am on 3b and Ungoliant Spawn is in the staging area, thankfully my threat is only 25 but I also have a forest spider out so gonna try tearing it apart before I need to deal with Ungoliant Spawn if I can keep her out in the staging area with low threat and using Dunhere's ability and the card  A Light in the Dark if she engages me I figure I will be winning this game pretty soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46145-loretactics-solo-deck/?do=findComment&comment=462407","commentId":462407,"userName":"Toqtamish","timestamp":1304344857,"content":"Or not, **** you Ungoliant spawn and your unholy horde of spiders and bats. Made it to phase 3b Beorn's Path but my progress on the quest was slowed to only 3 as the shadow deck kept throwing out spiders and I couldn't hold them off. First went Elenor, then Dunhere and finally Eowyn 3 allies all with 1 wound on them were all that was left. What killed me was the deck bringing out Hummerhorn's as Ungoliant Spawns shadow card giving all my remaining hero, Eowyn, her last wound and all my allies one wound each.\n\nI think adding Tactics or leadership to the spirit deck is going to be my next dual sphere deck. Right now I am trying to play them all solo to see each of them in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46145-loretactics-solo-deck/?do=findComment&comment=462482","commentId":462482,"userName":"jhaelen","timestamp":1304354041,"content":"CrowOfPyke said:\n\nI have been trying Lore+Tactics.  It's terrible in solo play, but perhaps I am \"doing it wrong\".  Anyone been successful in solo play with this Sphere combo? \n\nIt _is_ quite terrible. Lore +anything else works better.\n\nStill, I may eventually try adding Gimli as my third character in scenario 3. It should make beating that Nazgul quickly easier to pull off (if you get that far...).\n\nTactics is great in multiplayer games, though."}]}