{"url":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/","title":"2v2 competitive play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/?do=findComment&comment=462408","commentId":462408,"userName":"mijnjiku","timestamp":1304345209,"content":"I picked up the game this weekend and spent many hours with a friend getting acquainted and such.\n\nAs we were looking at various cards between rounds to see how things could work together, I started thinking about what kind of competitive play options you could have beyond what the rules specify.  This is what I've come up with and I'm looking for some thoughts on this.\n\n2v2 combine: 2 teams of 2 players work through the same table/scenario.  The threat and engagement management provided with Spirit decks would provide an interesting dynamic by having 2 teams work together to get through the scenarios while still trying to come out with better scores than the others (EDIT) by means of managing threat and victory points to favor your team.  The depth of strategy to this type of game would run deep in my theorycrafting opinion.\n\nJust curious as to whether or not this would be a game-style that would be enjoyable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/?do=findComment&comment=462411","commentId":462411,"userName":"Titan","timestamp":1304345726,"content":"The one catch I always see when you are playing for score is that you need to have spirit in your deck. Without it, you are just at too much of a disadvantage against a deck that is running it. I had thought that maybe, once we got around to having tournaments, this would be the scoring system, but it runs into the same issue. If you are considering having both teams run the exact same deck, that seems a little less original and/or interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/?do=findComment&comment=462412","commentId":462412,"userName":"Toqtamish","timestamp":1304345925,"content":"That is how the proposed tournament system is going to work. I remember seeing stuff on it somewhere but cannot recall where. Basically all teams would play against the same scenario and see who does the best. Scenario would be new for that tournament."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/?do=findComment&comment=462416","commentId":462416,"userName":"Titan","timestamp":1304346209,"content":"Forgive me for taking the thread in an unintended direction, but that system basically would force any participants to run threat reducing decks(I. E. spirit) as a major part of their strategy in perpetuity. For now, there's only a few cards and it is a necessity, just the same, but what happens down the line?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/?do=findComment&comment=462417","commentId":462417,"userName":"mijnjiku","timestamp":1304346398,"content":"Titan said:\n\nIf you are considering having both teams run the exact same deck, that seems a little less original and/or interesting.\n\n\n\nWell I was thinking since deck dynamics are likely to change with future releases, playing spirit on both teams may not totally be necessary.  I was also thinking, since health on heroes has an effect on the score, each team managing their own health while still considering the ability of all players to make it through if one of the team members dies would be a 2nd dynamic to factor in with deck builds for this kind of competition.  It does seem that this would require at least a little dependence on threat management, obviously, but I don't think it's the end all be all especially when considering the possibilities that may come with new packs.\n\nI think it's expected that each setup (2v2 double table, 2v2 combine, 4v4 (sounds ridiculous but I'm thinking of a 2 out of 3 competition with maybe 1 game a week at your local game store)) would lend itself to different deck building strategies to accommodate that overall competitive tactics.  Variety would be inherent in playing a different tournament set up.  If that makes sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/?do=findComment&comment=462464","commentId":462464,"userName":"mijnjiku","timestamp":1304351645,"content":"Titan said:\n\nForgive me for taking the thread in an unintended direction, but that system basically would force any participants to run threat reducing decks(I. E. spirit) as a major part of their strategy in perpetuity. For now, there's only a few cards and it is a necessity, just the same, but what happens down the line?\n\n\n\nThat's what I'm thinking about.  Right now there are only so many ways to manage threat, but surely there will be other cards that at least provide the ability to customize a spirit deck to something different from other spirit decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46147-2v2-competitive-play/?do=findComment&comment=462519","commentId":462519,"userName":"Titan","timestamp":1304360742,"content":"Or perhaps there will be cards that manage threat for other spheres. Perhaps not in the same way Spirit does it, but effectively, just the same. Obviously, threat reducing strategies are always going to be part of the game, whether they are the province of spirit or not."}]}