{"url":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/","title":"My first deck construction attempt","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/?do=findComment&comment=463213","commentId":463213,"userName":"Paul Grogan","timestamp":1304479205,"content":"With a couple of core sets, and some proxy cards, I decided to start building 2 decks to play the first scenario.  My thinking is that at Difficulty=1, I should be able to beat this with a constructed deck.  If I cant, what hope do I have of the other quests.\n\nI had already played scenario 1 solo with most of the decks and had limited success.  Tactics deck was a waste of time, the spirit deck ran ok, but I think we were lucky.  I've also played the game 2 player a couple of times (again, using the starter decks), won one and lost one.\n\nAnyway, with 3 each of 15 different cards per sphere.  Add in 4 heroes and 2 Gandalfs, and you have a legal 50 card deck.  However, it isnt really 'constructed' as you've just used everything you have.   So I decided that I would 'relax' the construction rules until more cards are available.  I went with a 40 card deck limit to allow mono.\n\nHowever, I then threw together 2 dual sphere decks, using the 40 card min rule.  This allowed me to properly construct a deck and have a lot of choice about what cards I used and which I chose to left out.\n\nGood news is that I beat the first scenario on turn 5.   It wasnt a walk in the park.  I lost 3 heroes in total and at one point almost threw the game away due to a mistake.   What I did learn though was useful.  One of my decks had 2 Leadership heroes and 1 Lore hero.   I had the right mix of Leadership and Lore cards, but some of my Lore cards were too high a cost, and since I was only generating 1 Lore resource a turn, a lot of these cards wouldnt get played.  I did however have Eowyn in the other deck, and Protector of Lorien, so always a way to discard cards.  Turn 3, the Lore hero got killed, which means all these cards couldnt be played.\n\nBut, with Eowyn and 2 Favour of the Lady on here, along with Aragorn with the +2 Willpower stone and readying after questing, I was able to slap down so many progress tokens on the quests, got it done in no time.  Finished the game during the ad break whilst watching Game of Thrones :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nNext plan, tweak the decks a bit and then try the second scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/?do=findComment&comment=463231","commentId":463231,"userName":"Paul Grogan","timestamp":1304482426,"content":"EDIT (why cant I edit my original post).   Seems that deck needs to be 50 cards not including the heroes.  So right now, you cant actually build a legal mono-sphere deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/?do=findComment&comment=463282","commentId":463282,"userName":"Toqtamish","timestamp":1304492154,"content":"You can edit it. After the edit button disappears instead press Report to moderator link and in the address bar where it says \"reportar\" type instead \"editar\" and edit away."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/?do=findComment&comment=463323","commentId":463323,"userName":"Titan","timestamp":1304499617,"content":"You're using 4 heroes? The max number is 3."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/?do=findComment&comment=463375","commentId":463375,"userName":"Toqtamish","timestamp":1304505006,"content":"Titan said:\n\n \n\nYou're using 4 heroes? The max number is 3.\n\n \n\n \n\nHe was using two different decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/?do=findComment&comment=463398","commentId":463398,"userName":"pumpkin","timestamp":1304506836,"content":"Toqtamish said:\n\nTitan said:\n\n \n\nYou're using 4 heroes? The max number is 3.\n\n \n\n \n\nHe was using two different decks.\n\n\n\nyou are right, he was, but I actually think he was also using 6 heroes and the 4 is a typo (should have been a 3).\n\n3X15, plus 3 heroes, plus 2 gandalfs = 50, which makes sense in the context of being a legal deck. so in effect Paul made two legal decks and lpayed them both simultaneously I guess (except he had wrongly counted the 3 heroes as part of each deck, so they weren't actually legal, until he made them dual sphere)...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46235-my-first-deck-construction-attempt/?do=findComment&comment=463404","commentId":463404,"userName":"Paul Grogan","timestamp":1304507181,"content":"It was a typo.   I meant add in 3 heroes.   Sorry to have caused so much confusion.   Each deck was 3 heroes.\n\nIn the end, I played them with 40 card decks, but this may have been 37 cards and 3 heroes.  I'll be tweaking the decks anyway and will up them both to 40 cards + 3 heroes.\n\nThis means that they are not 'legal' but am just playing for fun now.  It means I have more chance of getting the cards I really want, but will add more cards to my decks to make them \"less good\"."}]}