{"url":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/","title":"Duplicates of Core Game Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463412","commentId":463412,"userName":"gearhead","timestamp":1304508007,"content":"In the core game, there aren't 3 copies of each card.   Some of these can be very useful/powerful cards like Dwarven Tomb, Beorn and such.\n\nThe choice then, is whether to just 'do' with 1 or 2 copies of certain cards or buy 2 more core sets!  Of course, buying 2 more core sets means having tons of cards that'll never really see use and can't be traded for cards I'd like to have.\n\nWhy not offer a \"special\" pack of cards with duplicates of those cards not given 3 copies of in the core game? You could even make it \"print on demand\".\n\n \n\nThis way, people can buy the duplicates they need, and there aren't a whole lot of unusable cards floating around in limbo.  If nothing else \"think of the trees you'll save!\" ; )\n\nAnd the players will love you helping them get the cards they want without having to buy 2 more core sets just to have 3 copies of all the cards they need for the decks they want to build.\n\nAnyway, my 2 cents. Chime in if you agree...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463418","commentId":463418,"userName":"Ucayali","timestamp":1304508962,"content":"Maybe expansions will contains more copys of cards from core set"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463448","commentId":463448,"userName":"pumpkin","timestamp":1304511789,"content":"Already been discussed on many threads, even before the game was released.\n\n \n\nIt's never been done on other LCGs so there's nothing to suggest FFG will do the same here. There is \"more\" waste in additional core LoTR sets than with other LCG core sets, in some instances, without any option to trade, as you mention, but because many people seem content buying two or even three core sets, it seems unlikely FFG will provide a core epxansion.\n\nPrint on demand isn't really an option I dont think as FFG have already stated that because of the differing in print colour pallettes they can't ensure that a POD player deck card will be the exact same colour as the core ones, which could prove troublesome when shuffling them into an existing deck.\n\nWith 2 core sets and using a few proxys, you can relatively easily generate 3 of every card decks.\n\nIf you go the whole hog and buy 3 core sets, then someone did come up with the bright idea that this meant you could keep the three encounter decks prepped and ready for the 3 core quests, without having to swtich cards around.. which is a nice idea, but not sure its worth buying a 3rd core set for!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463479","commentId":463479,"userName":"Troymk1","timestamp":1304514437,"content":" One way they COULD do it is to offer the various sphere decks as standalone packs for somewhere in the $8 range.  They are still making a profit but it allows us to customize further without gaining 3 copies of each encounter and quest card\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463495","commentId":463495,"userName":"pumpkin","timestamp":1304515740,"content":"Yer, I totally agree and wish they would do it, but this is my first LCG (I like the solo play element), and people who have familiarity with other LCGs seem to think its a given that you buy multiple core sets if you want to properly deck build.\n\nI've got a 2nd set on the way, because I can sort of justify extra threat trackers and the like to support 4 players, but I'd be happy to have a \"cheap\" way of getting those last 3 copies of each card if FFG gave me one...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463573","commentId":463573,"userName":"ChinaBlade2","timestamp":1304523050,"content":"I got lucky this week on Ebay and picked up a full set of core cards for half the RRP of a boxed set. I'm not planning on scaling beyond 2 players - but if friends show an interest then I will be happy to buy a 2nd core set, which will then give me 3 copies of the core cards. Don't know why someone would want to sell just the cards out of the box - but I would think core sets will eventually appear on the 2nd hand market for stripping down at some point.\n\nI have collected CCGs such as LotR, Star Trek and Tomb Raider - when throwing 1000's of common and uncommon cards into the bin was a regular occurence. I am new to the LCG format and hopeful that it will avoid the awful waste of the 'traditional' distribution format.\n\nStill getting caned by the game - and loving it.\n\nBest Wishes to all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463637","commentId":463637,"userName":"Toqtamish","timestamp":1304531119,"content":"I plan on getting 2 and maybe 3 core sets anyway but don't see any waste in it as any extra encounter cards I will just sleeve and bundle together so that I have all 3 of the scenarios ready to go at all times.\n\nThere has not been a second hand market for the other LCG's really so I don't forsee one happening here. The LCG format just doesn't offer the same market for selling cards individually as the traditional TCG's do. Or the profits either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463893","commentId":463893,"userName":"scottindeed","timestamp":1304580097,"content":"I got my second core set the other day as in addition to the cards you get threat trackers for up to four players, plus loads more tokens (I ran out of resource tokens with my Leadership/Spirit deck the other day!)\n\nI can't see myself getting a third set though.  Very expensive for a handful more cards that i probably wouldn't even use a third copy of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=463916","commentId":463916,"userName":"Paul Grogan","timestamp":1304582066,"content":"I think buying 3 sets is a bit silly.  You are paying all that money again for lots of stuff you do not need.\n\nHowever, if you want 3 of each card and dont have any other friends with their own copy, you dont really have a choice.\n\nI'm playing just using 2 sets and proxying other cards for now using photocopies of my cards.  This means I can build whatever decks I want.  If I were to ever play in an official tournament (highly unlikely), I would need to borrow some cards that I dont actually own 3 of the original."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=464173","commentId":464173,"userName":"FiendishDevil","timestamp":1304614022,"content":"I and many others bought 3 core sets.\n\n \n\nDid you see the news page? They're sold out of core sets. If they had done triplicate plus 4 player support in a single core set, jump the price a bit, they probably still would have sold out, but also had the game reach many, many more people.\n\n \n\nShrug. I really hope I don't burn out on this like I did with WH: Invasion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=464202","commentId":464202,"userName":"Toqtamish","timestamp":1304618150,"content":"WH:I is just not a good game really. Was imbalanced right from the get go. This one is much better prepared. One of the things I love is the turn sequence chart at the back of the book would like to see AGoT get the same treatment in its rulebook."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=464726","commentId":464726,"userName":"qwertyuiop","timestamp":1304703777,"content":"Toqtamish said:\n\nWH:I is just not a good game really. Was imbalanced right from the get go. This one is much better prepared. One of the things I love is the turn sequence chart at the back of the book would like to see AGoT get the same treatment in its rulebook.\n\n\n\nI thought the core set was pretty good for W:I. It's when Chaos sucked the least! And drafting was good. Love the turn sequence as well. Maybe it's a Nate French requirement as it is also in the CoC LCG rules.\n\nto the OP, More than 1 Beorn is too many Beorns..for now.  Two copies should be fine forever...unless decent sanctioned tournaments arise. (prize support should totally be FFbux)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=465411","commentId":465411,"userName":"Evil Mushroom","timestamp":1304879015,"content":"Gearhead said:\n\nWhy not offer a \"special\" pack of cards with duplicates of those cards not given 3 copies of in the core game? You could even make it \"print on demand\".\n\n\n\nAgree.  The way my gaming group does customizable card games is that we always build from the same pool of cards. In the case of Lord of the Rings, we would each chose three spheres.  If someone chooses leadership, leadership, tactics.  That person gets 2 of each leadership card and one of each tactics card from which to build their deck.  To make a decent card pool for my group I would have to buy 6 copies of the game. and 2 of each expansion.  That is a bit much when it comes to wasted cards for the core game, so I will probably only end up getting 3 copies of the core game and keep hoping FFG will release an expansion like what you just described."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=465475","commentId":465475,"userName":"Toqtamish","timestamp":1304895070,"content":"Not going to happen. For more info see this post by Christian.\n\nHi All.\n\nFFG *will not* do this scheme with our core sets. We feel that having a diverse card experience in the core sets is vastly more important than having 3 of each card. This is also the case with other sets that we believe to be \"core\" (such as the \"Siege of Ulthuan\" for WH Invasion) set.\n\nWe do understand that players whom wish to play tournament style decks will want 3 copies of the core set, but keep in mind that 3 copies of any LCG core set is still less than *1* booster display of a CCG like Magic TG (of which you typically need to buy 3-4 copies to have a \"full playset\" of every card, and in which far more waste will be incurred with common cards).\n\nIt is not efficient for FFG to create \"supplements\" that up the core set cards to 3 of each.\n\nThanks\n\nChristian\nFFG\n\nwww.fantasyflightgames.com/edge_news.asp [http://www.fantasyflightgames.com/edge_news.asp?eidn=2243]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=465528","commentId":465528,"userName":"FiendishDevil","timestamp":1304909822,"content":"Toqtamish said:\n\nNot going to happen. For more info see this post by Christian.\n\nHi All.\n\nFFG *will not* do this scheme with our core sets. We feel that having a diverse card experience in the core sets is vastly more important than having 3 of each card. This is also the case with other sets that we believe to be \"core\" (such as the \"Siege of Ulthuan\" for WH Invasion) set.\n\nWe do understand that players whom wish to play tournament style decks will want 3 copies of the core set, but keep in mind that 3 copies of any LCG core set is still less than *1* booster display of a CCG like Magic TG (of which you typically need to buy 3-4 copies to have a \"full playset\" of every card, and in which far more waste will be incurred with common cards).\n\nIt is not efficient for FFG to create \"supplements\" that up the core set cards to 3 of each.\n\nThanks\n\nChristian\nFFG\n\nwww.fantasyflightgames.com/edge_news.asp [http://www.fantasyflightgames.com/edge_news.asp?eidn=2243]\n\n\n\n \n\nAnd yet AGoT gets the \"royal\" treatment and gets reprints with 3x 'core sets' (Greyjoy and Martell expansion core sets). preocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]\n\nAll the new house expansions (Stark, Baratheon, and Targs) were 3x 'expansion sets' as well. sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]\n\nAh well, I'm okay to buy 3 \"core sets\", but I really hate all the wasted cardboard... I still think they'd do much better selling at 3x copies in one set and upping the price a little -- I suppose that's up to their marketing team. corazon_roto.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/corazon_roto.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=465598","commentId":465598,"userName":"Toqtamish","timestamp":1304924791,"content":"Those are not core sets, those are expansions. The AGoT core set comes with 4 decks, one each for Lannister, Stark, Baratheon and Targaryen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46255-duplicates-of-core-game-cards/?do=findComment&comment=465637","commentId":465637,"userName":"faith_star83","timestamp":1304932793,"content":"Well, I guess that's a decision of ffg that can be accepted. The hardcore fans still have the option to buy three core sets and the casual players can enjoy the core set and then the expanions.\n\nI for one, won't play tournament, so even though it would be nice to have that extra celebrian's stone I can live without it. And 30 bucks for a core set is rather reasonable priced in my eyes.\n\nBy the way, there are Agot single available onine...just not in such masses as tcg cards since there is not much profit to make obviously...who knows maybe we'll still see some lotr singles ;-)"}]}