{"url":"https://community.fantasyflightgames.com/topic/46364-engagement/","title":"engagement","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464259","commentId":464259,"userName":"kingsoyboy","timestamp":1304626436,"content":" Quick question.\n\n \n\n     During the encounter phase when you pick 1 enemy to engage and then preform engagement checks does the one you chose to engage get to attack first or just defend.   The combat rule says all enemies attack first, but doesnt say that the one you chose only defends.  I would think that is the advantage to picking one to attack so you dont waist one guy on defending. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464273","commentId":464273,"userName":"Toqtamish","timestamp":1304628482,"content":"The advantage to choosing one is to pull it away from attacking your fellow player(s). It's like pulling an enemy in WoW to your tank so it leaves the mage alone. The enemy still attacks as normal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464614","commentId":464614,"userName":"cazantyl","timestamp":1304689648,"content":"Toqtamish said:\n\nThe advantage to choosing one is to pull it away from attacking your fellow player(s). It's like pulling an enemy in WoW to your tank so it leaves the mage alone. The enemy still attacks as normal.\n\n\n\n \n\nExactly :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] You can also use it in situations where damage is guaranteed to take place, so you may as well have it dealt to someone that can \"take advantage\" of having damage dealt to them (such as the guy that gets a supply for each point of damage taken, or the guy that gets +1 attack for each point of damage taken)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464689","commentId":464689,"userName":"Warth0g","timestamp":1304700595,"content":"But also it's there to pull the enemy out of staging so that you don't have to cope with the additional threat. My understanding is that all enemies attack first regardless of whether tehy engage first via an engagement check or if the player enagged them via the once-per-turn rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464700","commentId":464700,"userName":"Casamyr","timestamp":1304701743,"content":"My question on engagement is this - last night while playing I wanted to pull the Hummerhorns out, but couldn't figure out if it's forced text applied to me engaging the Card, the card engaging me or both.\n\nForced: When Hummerhorns engages you, deal 5 damage to 1 hero. I assume this means that if the Hummerhorns engages you 1 hero is  basically dead, unless they have citadel Plate on. If you engage it, does the Forced text still apply - it never engaged me, I engaged it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464714","commentId":464714,"userName":"qwertyuiop","timestamp":1304703077,"content":" Congratulations on your recent engagement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464717","commentId":464717,"userName":"player359984","timestamp":1304703146,"content":"I'd think the damage would only apply if the Hummerhorn engages, not if you choose a player engagement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464727","commentId":464727,"userName":"Apophenia","timestamp":1304703917,"content":"Whether an enemy is engaged through an engagement check, through a card effect, or through a player’s choice, the end result is the same, with the enemy and the player engaging one another. In all cases, the player is considered to have engaged the enemy and the enemy is considered to have engaged the player.    \n\n \n\nThe Hummerhorns always deal 5 damage to hero whether you engage them or they engage you. They would hardly be worth victory points if their bad effect could be avoided so easily. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464779","commentId":464779,"userName":"Bohemond2","timestamp":1304717487,"content":"This has been another edition of \"what Apophenia said.\" Barring Citadel Plate Hummerhorns kill a hero if they engage you or you engage them. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464836","commentId":464836,"userName":"Casamyr","timestamp":1304738897,"content":"Thanks Apophenia. That makes them absolutely nasty at threat 40. Unless you have Citadel Plate or Dunhere kills them while in the Staging Area you are in for a world of hurt late game when you need every resource to control the feild.\n\n****."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464885","commentId":464885,"userName":"Titan","timestamp":1304754557,"content":"If you can spare his effect, Gandalf is also very effective against Hummerhorns, since he can kill them in the staging area without them ever becoming engaged. I have managed to defeat them this way more than once."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46364-engagement/?do=findComment&comment=464924","commentId":464924,"userName":"Dam the Man","timestamp":1304766210,"content":"Only time so far (2 plays) I've seen Hummerhorns in the staging area, I was all set to kill them with Dunhere (who can attack enemies in the staging area for 3 dmg, just enough to kill HH), but stupid Ungoliant's Spawn came up that turn, so threat went up and Hummerhorns instead engaged. Luckily, Spirit deck had Raise Dead (aka Fortune or Fate) ready and made a zombie out of Thalin."}]}