{"url":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/","title":"Cards arts not from movie, opinions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=464255","commentId":464255,"userName":"Ucayali","timestamp":1304625718,"content":"Im sorry if that subject was discussed before, maybe is worth refresh it anyway\n\nMany my friends that play with me LOTR lcg after first time see game their reactions are like this.. omg this is Aragorn ? omg Gimli looks weird !! sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]\n\nIf anyone readed books before seen movie, haved hes own imagination about heroes, monsters, places in this epic book. And i can't stand why most my friends react like this game is BAD becouse arts on cards are not similar with movie trilogy, for them Legolas  = Orlando Bloom, becouse they are not able imagine Legolas look in any other way, just can't.\n\nFor me fact that LOTR LCG is based on book not on movie its just GREAT, i love arts on cards , i love look of monsters and locations, it give this great feeling of discover amazing middleearth  once again, created by artists imagination .\n\nWhat you guys thinkpreocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=464275","commentId":464275,"userName":"Toqtamish","timestamp":1304628613,"content":"I am thrilled the game is based on the books and not Peter Jacksons movies. Books are superior in all aspects and honestly every time I see the movies past the 1st one I find them more and more annoying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=464279","commentId":464279,"userName":"cattman","timestamp":1304629431,"content":"Toqtamish said: Published on 5/5/2011 - 20:50:13\n\nI am thrilled the game is based on the books and not Peter Jacksons movies. Books are superior in all aspects and honestly every time I see the movies past the 1st one I find them more and more annoying.\n\n \n\nI totally agree.  I have been making my children read the books before watching the movies for this very reason.  Using the books instead of the movies will give the game much more depth.  I am not keen an all of FF's art but their LOTR stuff is just beautiful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=464297","commentId":464297,"userName":"servant of the secret fire","timestamp":1304635302,"content":"Toqtamish said:\n\nI am thrilled the game is based on the books and not Peter Jacksons movies. Books are superior in all aspects and honestly every time I see the movies past the 1st one I find them more and more annoying.\n\n\n\nDon't forget that also the movies are based on the books and his friends had promblem with the art and not with the story.P.J and his team did a great job with the costums,characters,places,weapons etc.\n\nAs for some characters like Aragorn and Faramir in this game even if you only know them from the books their image is not so close to Tolkien's description and if you ask me i prefer those in the movies than those in this game.\n\nIf his friends have never raid the books and they only know Lotr and its characters from the movies then we can't blame them. I must to admit that i like Sir Ian mackelen as Gandalf more than any Gandalf's image i have seen so far.\n\nps:Books indeed are far superior in all aspects.I don't think that we can find anyone in this world who can say the oposite."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=464324","commentId":464324,"userName":"InfernalZebra","timestamp":1304641601,"content":"I really enjoy the game's interpretation of Legolas, particularly.\n\nArt is important to me in a game. Although I loved the films, the movie stills used in the previous card game by Decipher guaranteed I would never take a look at it. I just can't take a game seriously that didn't bother to use some decent artwork for its cards.\n\nSo yes, quite happy that they used artistic interpretations of the characters rather than the actors from the film."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=464366","commentId":464366,"userName":"richsabre","timestamp":1304651579,"content":"as ive said on other threads i bought this mainly because it wasnt based on the movies, i read the hobbit/ lotr before the movies came out, and as good as they are, they were never going to beat the books for me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=465943","commentId":465943,"userName":"snibe_8","timestamp":1304973451,"content":"I know I would have been very disappointed if they'd have used the movies for the artwork.  There is so much amazing LOTR artwork out there that you would have so much more to work with, so it makes more sense to use this huge body of art.  The fact that the books are so descriptive means that it's easy for a great artist to work with the books to create this great artwork."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46362-cards-arts-not-from-movie-opinions/?do=findComment&comment=466027","commentId":466027,"userName":"timbolton","timestamp":1304994379,"content":"The films are their own thing, self contained, and I'm more than happy that the LOTR LCG is not based on that side of the franchise. I think it was in one of the earlier interviews on here where one of the creators said the only problem they face is they have avoid the Peter Jackson look to the LOTR things - locations, orcs, etc. I'm happy with that. The look for this game has a similar look to the upcoming The One Ring rpg, something I'm really happy about - check out these images from that game - http://www.facebook.com/?ref=logo#!/media/set/?set=a.103419733002590.7319.100000036926026 [http://www.facebook.com/?ref=logo#!/media/set/?set=a.103419733002590.7319.100000036926026] (Art folder from the C7 FB page)"}]}