{"url":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/","title":"No mix-and-match of future encounter sets","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/?do=findComment&comment=464561","commentId":464561,"userName":"Arma virumque2","timestamp":1304683912,"content":"I just realized something about the structure of the adventure packs that I hadn't realized before:  Because FFG has to make each adventure pack independent (requiring only the core set as a prerequisite), there can't be any mixing and matching of encounter sets between the adventure packs.  For example, if Adventure Pack 1 introduces a new encounter set, that set can't be used in the scenario for Adventure Pack 2.  So every adventure pack will be limited to mixing only its own encounter set(s) plus the seven encounter sets in the core set.  That's kind of a bummer for me.\n\nI'm still trying to figure out what that means for the structure of the adventure packs.  I hope it doesn't lead to a lot of duplication and reprinting of encounter cards between adventure packs.\n\nI was also hoping that future adventure packs would introduce new cards to add to previous encounter sets, to give older scenarios additional replayability.  Looks like that could only happen with the core encounter sets, though, if they do it at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/?do=findComment&comment=464577","commentId":464577,"userName":"cazantyl","timestamp":1304685593,"content":"Arma virumque said:\n\nI just realized something about the structure of the adventure packs that I hadn't realized before:  Because FFG has to make each adventure pack independent (requiring only the core set as a prerequisite), there can't be any mixing and matching of encounter sets between the adventure packs.  For example, if Adventure Pack 1 introduces a new encounter set, that set can't be used in the scenario for Adventure Pack 2.  So every adventure pack will be limited to mixing only its own encounter set(s) plus the seven encounter sets in the core set.  That's kind of a bummer for me.\n\nI'm still trying to figure out what that means for the structure of the adventure packs.  I hope it doesn't lead to a lot of duplication and reprinting of encounter cards between adventure packs.\n\nI was also hoping that future adventure packs would introduce new cards to add to previous encounter sets, to give older scenarios additional replayability.  Looks like that could only happen with the core encounter sets, though, if they do it at all.\n\n\n\nFrom the looks of it, I believe they'll continue to go with their \"arch-type\" styled classifications for encounters and locations (i.e. - orcs, goblins, spiders, undead, forests, mountains, smurf villas, etc.). This will keep monsters/locations generic enough that you'll be able to move them from one expansion to the next without having to worry about which set it's from. It may seem a little odd thematically, but I think it will work out fine. They'll be able to introduce new types as well throughout expansions, you just won't encounter them during quests that don't involve that type.\n\nFor instance, I can't see any reason why they couldn't release a new set of orcs in AP 1 that would be compatible with other orcs added in AP 27. Yes, your deck may be different from another person's deck due to the differences in expansions owned, but I can't see it adversely affecting gameplay in any way shape or form. \n\nI'd also expect to see encounter deck building rules implemented eventually once the diversity of enemies goes up (i.e. - total threat for your encounter deck must be at least 100 for an easy game, 150 for a medium and 200 for hard. Totally arbitrary numbers, just throwing them out there).\n\nRegardless, I have high hopes for the packs.  My solution is simply to buy all of them, that way I don't have to worry about any missing elements ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/?do=findComment&comment=464636","commentId":464636,"userName":"richsabre","timestamp":1304692949,"content":"indeed as above, i doubt many here are just 'dabblers'  in this game, and will buy all the packs as i will :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/?do=findComment&comment=464742","commentId":464742,"userName":"jhaelen","timestamp":1304706387,"content":"Arma virumque said:\n\nI just realized something about the structure of the adventure packs that I hadn't realized before:  Because FFG has to make each adventure pack independent (requiring only the core set as a prerequisite), there can't be any mixing and matching of encounter sets between the adventure packs.\n\nThat's a good point I hadn't considered either. For me, I'd either buy every AP in a cycle or none of them. If LotR is anything like the other LCGs, all the cards in a cycle will have been designed to complement each other.\n\nI guess this means it's up to fans to create scenarios that mix and match encounter sets in new and interesting ways.\n\nThen again, maybe this would be a chance for FFG to utilize their print-on-demand offer? They could create a mini-set including nothing but quest cards (and maybe a bunch of objective cards)! That would be super-cool!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/?do=findComment&comment=464841","commentId":464841,"userName":"Casamyr","timestamp":1304740592,"content":"The idea of building encounter decks based on threat values is an interesting one that could well be explored down the line. There could also be a a couple of other ways though.\n\nI think we may see a combination of cards - possibly a new archetype encounter deck + new cards for the current encounter decks per Adventure Cycle which then makes previous quests infinitely replayable as over time they will begin to change and grow and encourage you go back and play them again with new heroes and deck builds.\n\nI can't see the point in releasing one off sets to be only used for a single quest (though Dominion does this and does it well) - I can see the current encounter decks getting bigger and a formula being released to determine how many cards need to be dealt to create the encounter deck. example: the orc deck has grown to 45 cards thanks to Adventure packs so when you are setting up a quest you would shuffle the orc deck and randomly deal out 17 cards and put the rest away.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/?do=findComment&comment=464873","commentId":464873,"userName":"guciomir","timestamp":1304752369,"content":"Seems like we will get 27 player cards, 1 hero, couple of quest cards (lets say 3). This means there will be around 29 encounter cards. They can make a new encounter deck with 29 cards but I do not think this is likely. I do believe they will split it somehow among old encounter sets from base game and among new encounter decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46391-no-mix-and-match-of-future-encounter-sets/?do=findComment&comment=464880","commentId":464880,"userName":"Titan","timestamp":1304753610,"content":"In the early going, yeah, they are going to have to rely on the core set's encounter deck as there won't be too many options outside of it. It will be interesting to see what happens once the first cycle is over and several more encounter decks have been added. However, if Warhammer is any guide, there may be another boxed expansion at that point, which will introduce some other \"core\" encounters. I wonder also, how much retouching they will do with older sets. For example, the introductory quest should remain as is, since it is a good way for new players to learn the game. And as more and more scenarios become available to play, there would probably be less of a demand to go back and play the older ones. I think it was mentioned before, you could always increase the difficulty by playing a \"house rules\" encounter bolstered by cards from other decks that may fit thematically and play style wise."}]}