{"url":"https://community.fantasyflightgames.com/topic/46410-lockdown/","title":"Lockdown","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=464769","commentId":464769,"userName":"Durgum","timestamp":1304714607,"content":"I was testing out the leadership deck on the intro scenario. I ended up at the location where you can not draw cards. Before I could complete it I the deck drew more locations 4 turns in a row. I ended up in a situation where i was out of allies, and could not draw more as I could not complete the quest.  So I was locked down.  Is there some location card rule I am missing that prevents this or is that just the way of things?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=464775","commentId":464775,"userName":"Bohemond2","timestamp":1304716822,"content":"You played it properly.  Never approach an Enchanted Stream without an exit strategy. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=464784","commentId":464784,"userName":"Durgum","timestamp":1304718708,"content":" I thought I had it covered, but apparently not. Getting locations 4 turns in a row was not expected. This game kicks my butt. 5 plays 4 losses.  I am convinced I got lucky the time I won.   \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=464786","commentId":464786,"userName":"Toqtamish","timestamp":1304719276,"content":"I had it happen to me too, 4 locations in staging area and I was already traveled to one and was unable to get any progress on it. Threat just kept going up. Getting too many locations is bad luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=464787","commentId":464787,"userName":"qwertyuiop","timestamp":1304719306,"content":" Man, you got Bombur'd.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=464788","commentId":464788,"userName":"Bohemond2","timestamp":1304719439,"content":"Playing with the starter decks can be rough, even with the first scenario.  It's not always possible, but when I travel to the Enchanted Stream, I try to have other options available to help resolve the location.  Guides, Scouts, Legloas and the like can all help you escape the lockdown when the encounter deck starts punching you in the face. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=464803","commentId":464803,"userName":"Paul Grogan","timestamp":1304725851,"content":"I've played quite a bit solo, with the starter decks on Quest 1.  Note, I havent yet played quest 2 but built 2 decks last night and want to try them today.\n\nWhat started out as a 'negative play' experience has turned positive.  Some of the starter decks are just really weak on their own (tactics for me) and can only win quest 1 due to luck (monsters come out and not locations).\n\nHowever, unlike the core set for the other LCG's which are totally playable out of the box without any deck construction, this one sort of isnt.   Once you've played through a few games solo with the starter decks, you've got the hang of it.  Deck construction is where it is at.\n\nIf they made the quests so that the starter decks were able to beat them, then when you went and constructed your own deck, you would probably win every time.  So I was happy that I wasnt really able to beat the quests easily solo-play.  It taught me what I needed to know to build up my own decks.  Now that I have build 2 decks (using 2 core sets and some proxies) and played the first quest again, I won easily and on turn 5.  I want to try it again, tweak my deck and make sure I can always beat quest 1 with my deck.   Then onto quest 2 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=465135","commentId":465135,"userName":"Durgum","timestamp":1304821875,"content":"I am five games in. First game i played all wrong and lost with spirit.  Second game I won with spirit. . I think I could win with Leadership,  I just ended up locked down.  I was trounced with lore, I made it to the end but could not defeat the big spider.  I was trounced with tactics as well, completing quests was abysmal.  Time to start building decks!\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46410-lockdown/?do=findComment&comment=466991","commentId":466991,"userName":"jhaelen","timestamp":1305139401,"content":"That reminds me of a game vs. the second scenario in which I got busted by two East Blights blocking access to two Brown lands. When the game ended there was a total of 25 threat in the staging area sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]"}]}