{"url":"https://community.fantasyflightgames.com/topic/46423-hill-troll/","title":"Hill Troll","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46423-hill-troll/?do=findComment&comment=464878","commentId":464878,"userName":"Mighty Jim 83","timestamp":1304753209,"content":"Just had a first attempt at joruney down the Anduin- 2-player, Core Set Leadership and Spirit.\n\nTwo locations from set-up, 1 Hill Troll from first quest card. Second Hill Troll from first round.\n\nOther than dying, any suggestions?\n\nmore generally, any thoughts on how a non-tactics deck can take out hill trolls? we were dead (5/6 heroes killed and second player over 50 threat level, withough doing more than 3 points of damage on either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46423-hill-troll/?do=findComment&comment=464879","commentId":464879,"userName":"guciomir","timestamp":1304753535,"content":"A lot of ways. Lore has forest snare, all spheres have gandalfs, especially useful with sneak attack. Spirit can keep threat low so troll engages when player is prepared (or can be killed with multiple gandalf strikes from the distance)\n\nbut yeah, it is pretty brutal :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46423-hill-troll/?do=findComment&comment=464882","commentId":464882,"userName":"Titan","timestamp":1304754133,"content":"I've found that one of the biggest keys to this scenario is to be able to lower your threat within the first couple of rounds(assuming you are below 30, that is). This gives you time to prepare for the troll. Another must have is a fast deck, you need a few options in hand quickly. I just beat this scenario myself in solo mode. I had to contend with both Hill Trolls and Marsh Adder, all in the first few turns. But with fairly low threat, you can pick and choose and engage them piecemeal. If they start coming fast and furious, then you are done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46423-hill-troll/?do=findComment&comment=464896","commentId":464896,"userName":"Oshio","timestamp":1304757387,"content":"I second Titan. The way I've been able to handily defeat this scenario very consistantly is a deck that starts with low threat and is designed to keep it low. My deck starts at at threat of 26. That alone buys you 4 turns to prepare, which is often all you need. But it also packs Sneak/Gandalf, Galadrim's Greeting & Dwarven Tomb (to recycle Galadrim's Greeting) to further lower my threat, and with the mulligan rule and those extra turns to prepare it's not too tough to draw into.\n\nBut that's with Spirit/Leadership. Forest Snare was mentioned as a good solution for Knowledge, but that's heavily reliant on one card. Overall I'd say the best option is to approach it with a deck that starts at a fairly low threat. I attacked the thing with an awesome Leadership/Knowledge deck...that started at 30 threat. I lost almost every game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46423-hill-troll/?do=findComment&comment=464904","commentId":464904,"userName":"Titan","timestamp":1304761006,"content":"My own was a triple threat leadership/spirit/lore which incorporates Beravor and Wealth of Lorien for some serious draw power. It starts at 27 threat, so it's not too bad. One of my favorite tactics is to build a big pool of allies quickly, then drop Gandalf in to damage the troll. He is also a great blocker against it. Then, a couple of heroes and some allies to finish him off and voila! I managed to do this a few times, but it is resource intensive and can backfire if not timed right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46423-hill-troll/?do=findComment&comment=464967","commentId":464967,"userName":"TheLightdarker","timestamp":1304775000,"content":"Like others have mentioned, I think the most important approach to the second scenario is to start with lowish threat to give you enough time to prepare for engaging the troll(s).  I was able to kill not one, but two very early on during my first successful Journey Down the Anduin, and I can see a few different approaches to make this relatively painless:\n\n- Leadership: Aragorn can soak up a Hill Troll attack, and Sneak Attack can allow for easy access to Gandalf or you can use it with a Son of Arnor to prevent a Hill Troll from attacking one turn.  I suppose it could also be combined with Beorn to dole out some serious early damage, too.\n\n- Lore: Forest Snare will incapacitate a Troll, and if combined with Son of Armor during the Planning Phase you can prevent it from having a free phase of attacking before you can play the attachment.  Denethor has 3 defense, and with Protector of Lorien he can soak a Hill Troll attack for one turn.\n\n- Tactics: Gimli can soak up a Hill Troll attack (and Swift Strike will speed up it's death), whereas Feint will save you from having to deal with an attack for one round.  If you have a beefy enough Gimli, Quick Strike could be pretty effective.  Stand Together when combined with \"ready character\" effects such as Grim Resolve would also be effective.  Thicket of Spears would also work quite nicely if you're using that many Tactics heroes.\n\n- Spirit: Since Dunhere can attack creatures in the staging area, if you keep your threat low and put some attachments/events on him you could slowly chip away at the trolls, though this would probably take an awfully long time.\n\n- Neutral: Gandalf can obviously toss out huge direct damage, and is a very capable defender and attacker.\n\nGenerally, I found what worked best for me was to delay engagement until you have some way to survive or prevent one attack and can respond in turn by smashing them in one round, by zerging him with Allies or whatever."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46423-hill-troll/?do=findComment&comment=464975","commentId":464975,"userName":"scottindeed","timestamp":1304777683,"content":"I've been giving a new deck a go and just beet Journey Down The Anduin with it.  Tactics/Spirti with Thalin/Legolas/Eowyn.  A lowish threat of 27 gives you a few turns to use various options:\n\nBeorn can soak up a few turns of Hill Troll\n\nCitadel Plate can soak an attack\n\nFeint so Hill Troll can't attack for a turn\n\nGandalf to blast it for four damage and/or Defend against its attack\n\nFailing that a cheap Ally to sacrific and just take the extra Threat on the chin.  Hopefully you can reduce Threat again later with Galadrim's Greeting or Gandalf.\n\n \n\n \n\n "}]}