{"url":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/","title":"Custom Solitaire House Rules","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465079","commentId":465079,"userName":"Titanium Man","timestamp":1304805522,"content":"After a few games, it feels like the encounter deck is a bit stacked against the solo player, so in an attempt to even the playing field, I'm testing some solitaire house rules.\n\n1. The staging area is currently limited to a maximum of five cards.\n\n2.  Questing is optional.\n\n3. The required amount of progress tokens to explore quest and location cards are reduced by half, rounded up. (To even this out, I'm thinking that a four-player game adds half of a quest/location card's progress token requirement to the base total. For example: to explore a 10-token location, you pay 5 tokens in one-player, 10 tokens in two-three player, and 15 in four player.)\n\n4. Instead of having the enemy attack first before the characters, both enemies and characters exchange damage at the same time. However, when you engage an enemy determines who does damage first. If a player voluntarily engages an enemy, his character will do damage first. This is a good way to quickly kill weakened enemies and come out unharmed. Otherwise, the enemy will do damage first. Exhausting characters and having the ability to \"gang up\" with multiple characters still applies in their respective phases, but this way, choosing who to block still gives you the opportunity to make your mark.\n\nSo far, one game brought me close to an even-handed victory, and this time it feels like it's more of an uneven deck than an overpowering encounter deck.  Time will tell where these rules go, but you're free to try them yourself and suggest changes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465081","commentId":465081,"userName":"Toqtamish","timestamp":1304805729,"content":"I don't see a need for this myself. If you are finding the game too hard modifying the game to make it easier to win is not the way to go. You should modify your deck builds to make them so you can beat the scenario you are on. Somehow changing the game to me feels like cheating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465095","commentId":465095,"userName":"Titanium Man","timestamp":1304808555,"content":"No, I definitely feel it's more balanced when two players are involved, and it comes more down to luck when it's solo.  Deck construction does matter but that's not the only part of the equation to consider.  My goal is to even things out all-around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465108","commentId":465108,"userName":"conykchameleon","timestamp":1304812701,"content":"Titanium Man said:\n\nMy goal is to even things out all-around.\n\n\n\n \n\nBecause I'm sure that this wasn't done in the year+ of R&D or anything..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465187","commentId":465187,"userName":"Toqtamish","timestamp":1304837461,"content":"Again I don't see this as the way to win. If you have to change the game to win you are cheating. I have beat the game solo with a deck I built so it can be done as is. It is hard yes, but I would rather it be hard than easy. If it was easy it would get boring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465191","commentId":465191,"userName":"Titanium Man","timestamp":1304840761,"content":"conykchameleon said:\n\nBecause I'm sure that this wasn't done in the year+ of R&D or anything...\n\n\n\nI want you to say to me with a straight face that every game ever passed through R&D has been balanced and playable out of the gate.\n\nPlease think about what you are saying for a minute here.\n\n \n\nAnyway, I'm not cheating, it's simply too uneven for a solo player, so I'm working on a fix."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465201","commentId":465201,"userName":"wookie78","timestamp":1304843010,"content":"Titanium Man said:\n\nAfter a few games, it feels like the encounter deck is a bit stacked against the solo player, so in an attempt to even the playing field, I'm testing some solitaire house rules.\n\n1. The staging area is currently limited to a maximum of five cards.\n\n2.  Questing is optional.\n\n3. The required amount of progress tokens to explore quest and location cards are reduced by half, rounded up. (To even this out, I'm thinking that a four-player game adds half of a quest/location card's progress token requirement to the base total. For example: to explore a 10-token location, you pay 5 tokens in one-player, 10 tokens in two-three player, and 15 in four player.)\n\n4. Instead of having the enemy attack first before the characters, both enemies and characters exchange damage at the same time. However, when you engage an enemy determines who does damage first. If a player voluntarily engages an enemy, his character will do damage first. This is a good way to quickly kill weakened enemies and come out unharmed. Otherwise, the enemy will do damage first. Exhausting characters and having the ability to \"gang up\" with multiple characters still applies in their respective phases, but this way, choosing who to block still gives you the opportunity to make your mark.\n\nSo far, one game brought me close to an even-handed victory, and this time it feels like it's more of an uneven deck than an overpowering encounter deck.  Time will tell where these rules go, but you're free to try them yourself and suggest changes.\n\n\n\nI play this game solo most of the time - around 25+ plays now in total - and for me personally the above mods would take away most of the suspense and challenge in this game, and to be totally honest - quite dull!  As others have said, the game is challenging solo but (perhaps with the exception of Escape from Dol Guldur) is perfectly winnable.  Due to the absence of any \"intelligent / living\" opponent, a game of this nature needs to be challenging otherwise it would quickly become stale.  In some ways I liken this to the Lord of the Rings boardgame - you are playing \"against the game\" and success is far from guaranteed.  I've taken many a beating in both games but have also experienced the joys of winning on several occasion; each victory feels well earned and very satisfying, and after every beating I can't wait to just have \"one more go\" in an attempt to win.  This for me gives this game excellent replay value.  \n\nThe game rules currently scale the challenge appropriately in my opinion for 1 player by reducing the number of encounter cards drawn during the staging step of the quest phase (for instance).  \n\nThat said, I am yet to have any real success against the 3rd scenario but the cynic in me says that FFG have added this as a tease - its a great scenario in concept but if you want a chance then you need to spend more money on the monthly adventure packs (which hopefully will provide new cards to bolster solo decks and provide a greater chance of beating the scenario).  As I have every intention of getting the adventure packs I don't feel too hard done by this and I can't really blame FFG for taking that approach.  They want to suck people into a game system (they are a business at the end of the day) - when a game is this good it doesn't take much to become absorbed in the game.  Bring on the adventure packs!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465211","commentId":465211,"userName":"Titanium Man","timestamp":1304844522,"content":"I just think it doesn't scale enough.  Consider that the solo player has to do the work of both players - he has to address all the locations and enemies by himself, he has to put all the tokens on himself.  The rules seem balanced at first glance, but it assumes there's a second player helping out.  By yourself, you're simply not able to clear locations and kill enemies fast enough without the deck stacking too quickly.\n\nI'll admit the combat fix was due to personal taste, and it could definitely be left out in the future, but since it's pretty easy to find yourself battling three enemies at once, who have shadow cards and who can swing first, it makes the game a desparate struggle.  Nothing wrong with that if you enjoy it, but I'm not a fan of pointlessly hard scenarios.  I don't want to win super easily but I don't want to feel like I have to fight tooth and nail to win a game.  (Those struggles are better saved for the real world, I find!)\n\nAlso consider the prisoner scenario - in a two player game, this still gives you five heroes worth of resources, but in a one-player, it only gives you two, which is far more crippling.\n\nAs mentioned before, some of these problems can be fixed with the right deck setup, but that's kinda lame to me.  I want options, and every deck should get a sporting chance.  I don't want it to be a game that only centers around a few viable deck types when you're solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465213","commentId":465213,"userName":"Toqtamish","timestamp":1304844800,"content":"It's lame to you that you need the right deck setup ? You realize this is a game of deck building right ?\n\nThere is no reason to apply your mods to the rules and it takes too much away from the game. The game is fine solo as is. I have had no trouble building one winning deck already, leadership/tactics. Instead of changing the game to make it so you can win, change yourself and your decks so you can win. Rise to the challenge of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465217","commentId":465217,"userName":"servant of the secret fire","timestamp":1304845179,"content":"Toqtamish said:\n\nIt's lame to you that you need the right deck setup ? You realize this is a game of deck building right ?\n\n \n\n\n\nThis."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465232","commentId":465232,"userName":"Titan","timestamp":1304849638,"content":"I agree with Toqtamish in that I don't think you are taking the right approach to this. I can see maybe easing up on a couple of rules, if you are having a rough time. But the changes you have implemented just about cripple the encounter deck. The challenge of any card game is to find decks and combos that work against the best your opponent can throw at you. If you are concerned that successful decks are all going to be somewhat similar, you are right. The card pool is limited and therefore, so are the combos. Those are the growing pains of a new game. If you are satisfied playing this way, then so be it, at least you are enjoying your version of the game, but I know I couldn't do it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465255","commentId":465255,"userName":"Titanium Man","timestamp":1304854003,"content":"Toqtamish said:\n\nIt's lame to you that you need the right deck setup ? You realize this is a game of deck building right ?\n\nThere is no reason to apply your mods to the rules and it takes too much away from the game. The game is fine solo as is. I have had no trouble building one winning deck already, leadership/tactics. Instead of changing the game to make it so you can win, change yourself and your decks so you can win. Rise to the challenge of the game.\n\n\n\nDeck building doesn't mean sticking with one deck type.\n\nI want to mention these rules aren't in stone yet - as I mentioned, I was testing them.  They're bound to change and/or disappear, because as I've said before, I don't want to win super easily.  But I've got no desire to beat something so clearly stacked against the solo player.  I'll grant that the limited card pool and this being a new game is a part of that - fair enough.  But right now, it's uneven and I'm only looking to slide the scale so it's more reasonable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465285","commentId":465285,"userName":"conykchameleon","timestamp":1304859521,"content":"Titanium Man said:\n\nconykchameleon said:\n\n \n\nBecause I'm sure that this wasn't done in the year+ of R&D or anything...\n\n \n\n \n\nI want you to say to me with a straight face that every game ever passed through R&D has been balanced and playable out of the gate.\n\nPlease think about what you are saying for a minute here.\n\n \n\nAnyway, I'm not cheating, it's simply too uneven for a solo player, so I'm working on a fix.\n\n\n\n \n\nOf course not every game, because there's usually the element of player vs player that is more difficult to account for. If you don't think that an army of playtesters played thousands of solo games and the encounter deck was tweaked along the way then you're the one who needs to 'think about what you are saying for a minute here'.\n\nAlthough ultimately its your game and you can play it however you want. It's just getting really annoying coming on here and seeing that every other post is \"this game is too hard.... but I don't want to have to build/tweak decks\". Like people said above this is a DECK BUILDING game. And there are many different deck types that have emerged just out of the Core Set. And I wonder what we can chalk that up to? Wait for it... ... good R&D and playtesting! aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465312","commentId":465312,"userName":"Titanium Man","timestamp":1304862944,"content":"Playtesters have done poorly before.  They have done so here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465314","commentId":465314,"userName":"wookie78","timestamp":1304863155,"content":"Titanium Man said:\n\nPlaytesters have done poorly before.  They have done so here.\n\n\n\nI think the current rating on boardgamegeek and the general consensus of public opinion that I have read so far would beg to differ here?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465317","commentId":465317,"userName":"conykchameleon","timestamp":1304863745,"content":"Titanium Man said:\n\nPlaytesters have done poorly before.  They have done so here.\n\n\n\nThis is my issue with your argument. You think that you know better than the DESIGNER OF THE GAME and the playtesters who have spent exponentially more time playing the game than you have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465407","commentId":465407,"userName":"Toqtamish","timestamp":1304877521,"content":"Titanium Man said:\n\nToqtamish said:\n\n \n\nIt's lame to you that you need the right deck setup ? You realize this is a game of deck building right ?\n\nThere is no reason to apply your mods to the rules and it takes too much away from the game. The game is fine solo as is. I have had no trouble building one winning deck already, leadership/tactics. Instead of changing the game to make it so you can win, change yourself and your decks so you can win. Rise to the challenge of the game.\n\n \n\n \n\nDeck building doesn't mean sticking with one deck type.\n\nI want to mention these rules aren't in stone yet - as I mentioned, I was testing them.  They're bound to change and/or disappear, because as I've said before, I don't want to win super easily.  But I've got no desire to beat something so clearly stacked against the solo player.  I'll grant that the limited card pool and this being a new game is a part of that - fair enough.  But right now, it's uneven and I'm only looking to slide the scale so it's more reasonable.\n\n\n\n \n\nWhere in anything I said did I say one deck type, if anything you need 3 for the core set, one for each of the scenarios. What you have done is essentially create a different solo game entirely than the one that we are all playing and that was playtested and designed by FFG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465694","commentId":465694,"userName":"Soulbearer73","timestamp":1304938689,"content":"I agree with the idea that this seems like cheating to change the rules to make it more playable because you are losing.  I think instead of changing the rules you may want to try working on building a two-sphere deck and tweaking it down.  the solo portion of this game is challenging but not impossible.  Solo play works fine and it is a lot of fun.  Just keep working on understanding deck building if that is where you are hitting a wall.\n\nJust my two copper...\n\nSoulbearer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465771","commentId":465771,"userName":"BenjoBaker","timestamp":1304946228,"content":"I'm gonna have to say that although solo play is more difficult, I feel as though it has to be.  A challenge is always needed in any game to offer any fun.  When you're working with two or more people, there is a fun factor in cooperation.  But when you are alone, the fun comes from overcoming exteremely difficult circumstances.  I have played the game solo only twice now and have lost brutally both times.  But I see, that in order to win I'll need to create a better, balanced deck.  I love the fact that it is extremely challenging when played solo.  Otherwise, it would have no allure for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465821","commentId":465821,"userName":"Entropy42","timestamp":1304952873,"content":"Why does it really matter to anyone if he makes up his own rules?  Its not like he's going to go compete in tournaments and insist on using his modifed ruleset.  If you are playing a solo game, and not having fun, it makes a lot more sense to change things up than it does to just quit or keep playing and not having fun.\n\nDoes anyone really think a single core set is balanced SOLO for all 3 scenarios?  To me, this game seems like it was playtested with 2 players.  I have no doubt they played games with 1, 3 and 4, but the focus seems to have been on balancing it for 2.  The game is disproportionately hard solo compared to 2 player, and really easy with 3-4 players.  2 players is challenging, but manageable.  The quests don't even scale properly with additional players, often times being 50% more difficult for 1 player as they are for 2.  1st quest phase for Journey Down the Anduin: SOLO - 3 enemies vs 1 player, a 3:1 ratio.  DUO - 4 enemies vs 2 players, a 2:1 ratio.\n\nMost of the reports of people beating the 3rd scenario solo are people who have made good decks out of 2-3 core sets, and then played the scenario a TON of times until they got a lucky set of cards that made it possible.  I'm not saying the won only because of luck, I'm sure they made many good deckbuilding and play decisions throughout the game.  But I believe the first person to post that they did it had a starting reveal of 2 Treachery cards that had no effect, and a Jailor.  If you get Caught in a Web to start that game, or in the first couple turns, you are probably done for. \n\nI'm sure others will disagree with me, but I find the single player pretty unsatisfying right now.  For a person with only a single core set trying to enjoy playing the game solo, making some tweaks to the rules sounds like a lot more FUN than just \"rolling the dice\" with my deck until I get a set of cards that makes it possible.  Many of my solo games are effectively over in the first 2 turns.  I don't find it fun to realize there is nothing I could have done differently to produce a better outcome.  And nothing I can realistically change in my deck to give myself better odds in the next game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465842","commentId":465842,"userName":"Entropy42","timestamp":1304955101,"content":"My computer crashed before I could edit the last post.  I had the numbers wrong in my scaling example, for Journey Down the Anduin 1A/B its actually\n\nSolo 3:1, Duo 5:2, 3 player 7:3\n\nFor the 2nd phase of that quest each reveal is 2:1, 3:2, and 4:3, respectively."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=465886","commentId":465886,"userName":"Penfold3","timestamp":1304961385,"content":"I suspect what needs to be improved is your ability to play the game. It is a new game, there is little chance that you are playing it as good as you can. You are undoubtedly making play mistakes (as we all are). The thing is changing the rules will not lead to real improvement in your game. It is the equivalent of playing a video game and upon dying your first handful of times using the same strategies you look for a cheat code that halves all the enemies strengths and  doubles your ammo and health.\n\nWhat decks have you been using against the quests? What heroes? What strategies have you tried?\n\nI have a friend that has beat all three quests without resetting his Threat dial. Of course he is obsessive and played the game for something like four hours over three days before he created the right deck and developed the right strategy.\n\nThen again, I beat the first quest on my first game through just using the unaltered Leadership deck. It as hard and each hero was a single HP from being killed, but I did it.\n\nStrongly recommend you play more games before you muck around with the rules of the game. Ask questions here for the parts where you are having the most difficulty. You will undoubtedly receive plenty of help on ways to beat the game without having to change the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466122","commentId":466122,"userName":"Titan","timestamp":1305015815,"content":"Entropy42 said:\n\nWhy does it really matter to anyone if he makes up his own rules?  Its not like he's going to go compete in tournaments and insist on using his modifed ruleset.  If you are playing a solo game, and not having fun, it makes a lot more sense to change things up than it does to just quit or keep playing and not having fun.\n\n\n\n\n \n\nWell, obviously none of us can stop him from playing as he sees fit on his own. It's just that I believe people think he is circumventing the spirit of the game. If you can't hit a baseball, do you go and practice to get better or do you ask them to slow pitch it to you? It wouldn't be too bad to relax on a couple of rules while you take a deep breath and work from there. But he has changed several of them to the point where a good (not great) deck should breeze through some of those scenarios. It's not easy, but is it really that hard? Quest one is very beatable even with some of the starter decks. Quest two takes a lot more work, took me 12 tries before I've came up with a deck that has now beaten that scenario twice in a row, but it is not unbeatable. Quest three I haven't tried, and I understand it's extremely difficult, but not unbeatable, either. The point is to adjust, adapt and overcome, not invent a brand new version of the game. While I don't want to discourage anyone from playing this game, if you have to change the game rules to such an extent, maybe it's just not for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466171","commentId":466171,"userName":"Entropy42","timestamp":1305021538,"content":"My point is just that (particularly with a single core set), there are quests you aren't going to beat with \"practice\".  To take your analogy, if you are facing a major-league pitcher and he strikes you out 99% of the time, but sometimes you just get lucky and make contact with the ball, are you going to want to keep batting?  Or are you going to want them to slow the pitches down?  I can practice all I want, I will never reliably hit fastballs from a pro pitcher. \n\nPersonally, I wouldn't want to use any of these rules on the first quest, as its reliably beatable for me out of the box.  Quest 2 is probably also reliably beatable if you construct the right deck.  Quest 3 is simply not balanced for solo.  How does it make any sense that you lose 1/3 of your heroes and resources in a solo game, but only 1/6 in a 2 player game?  There are clear scaling issues with this game, and if people can address them with rule mods, I'm always interested to see them.  That said, I agree that these rules seem to be over the top.  It should be pretty easy to win if all those bonuses are given."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466183","commentId":466183,"userName":"remm2","timestamp":1305022971,"content":"I think it's really a lot about what the quests do.\n\nQ3 takes away one hero among all players, so it's obviously much much harder solo. If, say, one hero per player was captured, it wouldn't be the same thing. OTOH, a solo player is almost unaffected by the restriction to one ally total per turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466305","commentId":466305,"userName":"Penfold3","timestamp":1305035102,"content":" The mistaken assumption here is that each quest scales the same way depending on the number of players. Quest 1 may scale in a symmetrical format keeping everything easy and predictable. Quest 2 may scale in a symmetrical way, but it is clearly a bit more difficult for a solo player to win than a four player group. Quest 3 may scale in an asymmetrical way, where the loss of the Hero is much more painful for the solo player but the Ally restriction is much more costly for the four player group. Considering the other LCG's, I'd actually be a little surprised if this wasn't done on purpose.\n\nSome people just want a nice easy time fiddling with cards, just like some people play solitaire, something to do to pass the time. Other solo players will approach the game as if it were a solo run on a PvP MMO, purposefully throwing themselves into the deep end to prove that they can do it. While I'm not that last player, I wouldn't even bother having bought this game if I were the former. The rules given here are much closer to the former than they are the latter. Winning 25 out of 25 games is just boring to me. I'd rather lose 25 out of 25 but see continual progress toward beating the Quest. YMMV"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466313","commentId":466313,"userName":"dvang","timestamp":1305036468,"content":"The game plays just fine solo. I'm 5-3 with the Tactics deck on scenario #1, considered the most difficult core deck. the other core decks are practically 100% wins on scenario #1. I haven't played the second scenario more than once or twice, but from what I gather it is more of a challenge, but still relatively winnable by customized solo decks.  I haven't tried Scenario #3 solo, but heard it is near-impossible solo.\n\nSo, I think if you are losing consistently on scenario #1 you are probably doing something wrong or need to think out your strategy more.\n\nOtherwise, to be constructive, I'd recommend rather than changing the game rules, create an easier scenario and/or Encounter cards. The scenarios are designed to have different difficulties while using the same rules. A big difficulty multiplier, especially for solo-play, is the scenario.  If you find scenario #1 too difficult, try starting without the location and/or Forest spider in play. Try reducing the first and 3rd quest card progress requirements by 1 or 2. Etc.\n\nAlso, if you're having difficulty with soloing the first scenario, post up an example game report and ask for suggestions from the forumites. You'll get plenty of tips and suggestions on how to best use and win with all 4 core decks. Taking advantage of the mulligan redraw, for example, can be very important."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466367","commentId":466367,"userName":"Entropy42","timestamp":1305042895,"content":"dvang said:\n\n \n\nThe game plays just fine solo. I'm 5-3 with the Tactics deck on scenario #1, considered the most difficult core deck. the other core decks are practically 100% wins on scenario #1. I haven't played the second scenario more than once or twice, but from what I gather it is more of a challenge, but still relatively winnable by customized solo decks.  I haven't tried Scenario #3 solo, but heard it is near-impossible solo.\n\n \n\nNot that you didn't provide good suggestions, but saying the game plays fine solo when you've only played 1/3 of the solo game isn't particularly useful.  I also don't see how you can say it plays \"just fine\" and then go on to say you've heard its near-impossible (to me, a near impossible game is not \"just fine\", perhaps you have different tastes).  I'm not trying to be a **** about it, but a lot of the people defending the balance of solo play seem to have mostly played the first scenario. \n\nOn the subject of tips and tricks though, I'd be curious to know how you got such a good record with the stock tactics deck.  I've found that scenario extremely difficult with the Tactics deck, as you have almost no Willpower.  2 locations at once in the staging area was usually all it took for me to have my threat spiral out of control.  Yes, Legolas with a Blade on him is key, but if you flip up a few locations it quickly becomes impossible to overcome the enemy threat strength."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466404","commentId":466404,"userName":"Arma virumque2","timestamp":1305048386,"content":"I'll add one more voice of support for the OP (who may have given up on this thread after the response he got from what has usually been a fairly supportive community).  I'll add three points to the discussion:\n\n1) For those who argue that this is a deckbuilding game, please remember that FFG has consistently promised that all the LCGs would have an enjoyable experience out of the box.  The game may get better with deckbuilding, but it shouldn't require it in order to be fun.\n\n2) For some people, tweaking the rules is just as much fun as tweaking decks.  In each case, the player is engaging a problem-solving part of the brain, playing the game repeatedly, tweaking some more, and building something that feels \"better\" than what he started with.  It's the same sort of creative effort that we all enjoy -- the OP is merely applying it to a different part of the game than the rest of us.  Outside a tournament, that's his right.\n\n3) (I don't know if this applies to the OP or not, but....) Those of us who are experienced at CCGs/LCGs sometimes forget that this is a challenging hobby.  New players can be overwhelmed by the number of moving pieces in play.  Deckbuilding adds another gigantic layer of complexity.  For LCG novices who are having a hard time, changing the rules is a faster and more reliable fix than deckbuilding.  With experience, the need for rule changes will go away naturally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466433","commentId":466433,"userName":"servant of the secret fire","timestamp":1305053425,"content":"Arma virumque said:\n\n \n\n \n\n1) For those who argue that this is a deckbuilding game, please remember that FFG has consistently promised that all the LCGs would have an enjoyable experience out of the box.  The game may get better with deckbuilding, but it shouldn't require it in order to be fun.\n\n \n\n \n\nRealy?I thought that deckbuilding is 50% of what makes a card game fun and interesting.Why someone wants to buy a card game if he does not like deckbuilding?\n\nAlso this game is indeed fun and enjoyble out of the box.Because someone can't win one of the 3 secenarios solo don't mean that this game sucks.First and second scenario gives you an excelent experience for solo play and you can win the third scenario with 2 players.The box writes 1-2 players not only solo.Solo play is one option not the only option.\n\nBe sure wen adventure packs comes live we will have the chance to win third scenario solo.I have seen Radagast and this Wizard will kick this scenario's ***sgran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466738","commentId":466738,"userName":"Eryx_UK","timestamp":1305108968,"content":" I'm going to try using four heroes in solo play rather than three. The first mission is easy regardless of solo or multiplay but the second and third and incredibly hard for solo play. I don't consider that cheating, as the game obviously isn't balanced between solo and group play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466928","commentId":466928,"userName":"dvang","timestamp":1305129117,"content":"Entropy42 said:\n\n \n\nNot that you didn't provide good suggestions, but saying the game plays fine solo when you've only played 1/3 of the solo game isn't particularly useful.  I also don't see how you can say it plays \"just fine\" and then go on to say you've heard its near-impossible (to me, a near impossible game is not \"just fine\", perhaps you have different tastes).  I'm not trying to be a **** about it, but a lot of the people defending the balance of solo play seem to have mostly played the first scenario. \n\nOn the subject of tips and tricks though, I'd be curious to know how you got such a good record with the stock tactics deck.  I've found that scenario extremely difficult with the Tactics deck, as you have almost no Willpower.  2 locations at once in the staging area was usually all it took for me to have my threat spiral out of control.  Yes, Legolas with a Blade on him is key, but if you flip up a few locations it quickly becomes impossible to overcome the enemy threat strength.\n\n\n\nWhy doesn't it matter? The mechanics of the game are the same whether playing the first scenario or the second/third. The mechanics of the game work. If a scenario is proving too difficult, that is specific to the scenario, not the game mechanics. The first scenario is designed as the primary solo scenario, as well as being an intro scenario for larger groups. The second scenario is designed to prove a difficult challenge for solo, and an even challenge for 2+ players. The third scenario is not designed to be won by most solo-decks, and is meant to be a reasonable/difficult challenge for 2+ players. From what I gather, this is exactly how the scenarios work. AFAIK, the third scenario is NOT intended to be soloable with a single deck (at least not a core deck).  It is a scenario designed and assuming multiple players.  Again, difficulty really isn't scaled much by the game mechanics, and mostly scaled by the scenario. Which Encounter types to include, starting locations/enemies/restrictions, progress points needed for quest cards, etc, are all controlled by the scenario, not by the mechanics of the game. Thus, as I said, the primary difficulty control is not the game mechanics but the scenario. If the scenario is too hard (or too difficult) for you, and you want to do something about it, I suggest adjusting the scenario variables rather than the core gameplay. <shrug> Add or reduce starting enemies/locations. Remove some nastier Encounter cards from the encounter deck. Reduce the number of progress tokens needed on some of the quest cards. Don't jail a Hero at the start of the third quest, etc.\n\nI've posted up two session reports on BGG of wins with core tactics vs scenario #1. Admittedly, one of those wins I posted(the second) I had some excellent card draws. The first is a more typical game, with about average card draws (for me, anyway). As long as you keep questing with both Gimli and Thalin, and as long as you get an enemy at least every 3rd card or so (very usual and doable), you can progress through the quest. It isn't necessarily easy, and a string of bad cards can be difficult to recover from, but it is winnable if you play smart. The Tactics deck is the most difficult one to win with of the four."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=466994","commentId":466994,"userName":"Entropy42","timestamp":1305140056,"content":"dvang said:\n\n \n\nWhy doesn't it matter? The mechanics of the game are the same whether playing the first scenario or the second/third. The mechanics of the game work. If a scenario is proving too difficult, that is specific to the scenario, not the game mechanics. The first scenario is designed as the primary solo scenario, as well as being an intro scenario for larger groups. The second scenario is designed to prove a difficult challenge for solo, and an even challenge for 2+ players. The third scenario is not designed to be won by most solo-decks, and is meant to be a reasonable/difficult challenge for 2+ players. From what I gather, this is exactly how the scenarios work. AFAIK, the third scenario is NOT intended to be soloable with a single deck (at least not a core deck).  It is a scenario designed and assuming multiple players.  Again, difficulty really isn't scaled much by the game mechanics, and mostly scaled by the scenario. Which Encounter types to include, starting locations/enemies/restrictions, progress points needed for quest cards, etc, are all controlled by the scenario, not by the mechanics of the game. Thus, as I said, the primary difficulty control is not the game mechanics but the scenario. If the scenario is too hard (or too difficult) for you, and you want to do something about it, I suggest adjusting the scenario variables rather than the core gameplay. <shrug> Add or reduce starting enemies/locations. Remove some nastier Encounter cards from the encounter deck. Reduce the number of progress tokens needed on some of the quest cards. Don't jail a Hero at the start of the third quest, etc.\n\nI've posted up two session reports on BGG of wins with core tactics vs scenario #1. Admittedly, one of those wins I posted(the second) I had some excellent card draws. The first is a more typical game, with about average card draws (for me, anyway). As long as you keep questing with both Gimli and Thalin, and as long as you get an enemy at least every 3rd card or so (very usual and doable), you can progress through the quest. It isn't necessarily easy, and a string of bad cards can be difficult to recover from, but it is winnable if you play smart. The Tactics deck is the most difficult one to win with of the four.\n\n\n\nI wasn't questioning the base game mechanics, but I would lump quest instructions under game mechanics, and I am questioning those.  I was saying the game (which right now consists of 4 decks and 3 quests) does not work well solo.  I don't think anything in the game or rules indicates that one scenario is designed for solo play while others are designed for multiplayer, though I agree with your assessment that those are about how they ended up in terms of balance.  I just don't see the same fundamental difference that you do between changing what the rulebook tells you to do vs changing what the quest instructions tell you to do (though I agree that modifying it on a per-quest basis is probably easier). \n\nUltimately, I think they could have taken steps to ensure the quests scaled better as you added/removed players, and for the most part, they didn't. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467021","commentId":467021,"userName":"jhaelen","timestamp":1305145621,"content":"servant of the secret fire said:\n\nRealy?I thought that deckbuilding is 50% of what makes a card game fun and interesting.Why someone wants to buy a card game if he does not like deckbuilding?\n\nAlso this game is indeed fun and enjoyble out of the box.Because someone can't win one of the 3 secenarios solo don't mean that this game sucks.First and second scenario gives you an excelent experience for solo play and you can win the third scenario with 2 players.The box writes 1-2 players not only solo.Solo play is one option not the only option.\n\nWell, after comparing gameplay using one deck vs. using two decks in over 100 games I feel confirmed in my opinion that the game (or at least the quests) simply doesn't scale.\n\nDeckbuilding, in my experience doesn't matter at all if you play the game with two or more players. It's already too easy using the starter decks! I won 27 out of 36 games (12/12 games vs. the 1st scenario, 7/12 vs. the 2nd, and 8/12 vs. the 3rd) playing two games with each two-sphere combo.\n\nWith a single deck I won 8 games out of 66 (6/8 vs. the 1st scenario, 1/25 vs. the 2nd, and 1/33 vs. the 3rd). In other words: The first scenario plays well solo, the other two: not really.\n\nDid anyone of you who thinks the game scales 'just fine' notice the other thread about scaling? It's about finding a house-rule to make the game harder when playing with three or four players!\n\nTitanium Man had the right idea: 'Something' must be changed to make the game more enjoyable when using a single deck. He just overcompensated. It definitely doesn't take all of the suggested changes to work better.\n\nAnd Entropy42 is almost certainly absolutely right: Playtesting _must_ have concentrated on the two-player game and getting the first scenario right. Otherwise the egregious scaling issues in the second and third scenario could not be explained.\n\nNote that I'm not saying the game isn't fun. If it was all bad I would have stopped playing long ago. But let's be honest folks: The scaling sucks. Big time.\n\nBut it's a problem that can be fixed by more carefully designed scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467032","commentId":467032,"userName":"dvang","timestamp":1305147913,"content":"You do realize that the Core Set box says it is for 1-2 players. Playing with 3 or 4 players is doable, but I don't think that it is reasonable to expect that quests designed for 1-2, which are all 3 quests that we have right now, are perfectly balanced for 3-4. You can play them, but because you're basically doubling the number of players (and heroes) the quest is designed for, of course they are going to be easier. <shrug>\n\nAs I said, alter the scenario to make it harder if you'd like. Try starting scenario 2 with 2 Hill Trolls.  Jail 2 or 3 heroes in scenario 3, etc. The mechanics of the game work fine for 3-4 players. The problem is that with 3-4 players you are playing quests designed for 2. Beef the quests up, or design you own specifically for 3-4 players, if you want more of a challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467126","commentId":467126,"userName":"jhaelen","timestamp":1305171317,"content":"dvang said:\n\nYou do realize that the Core Set box says it is for 1-2 players. Playing with 3 or 4 players is doable, but I don't think that it is reasonable to expect that quests designed for 1-2, which are all 3 quests that we have right now, are perfectly balanced for 3-4. You can play them, but because you're basically doubling the number of players (and heroes) the quest is designed for, of course they are going to be easier. <shrug>\n\nAnd you do realize that the worst scaling problems are when you add a second deck, i.e. when switching from 1 player to two players?\n\nThe chance to win increases from 'almost impossible' (i.e. 3-4%) to 'easily doable' (i.e. 50-66%). That's not what I'd call proper scaling!\n\nAnd \"As I said, alter the scenario to make it harder if you'd like.\" is a perfect example of the Oberoni fallacy (as we call it in the world of RPGs):\n\n“There is no inconsistency/loophole/mechanics issue with Rule X, because you can always Rule 0 the inconsistency/loophole/mechanics issue.“ \n \n\nIn my own words: Just because you can solve an issue by houseruling the game doesn't mean it isn't an issue. In fact you're admitting it is an issue because you suggest to introduce a houserule!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467272","commentId":467272,"userName":"Entropy42","timestamp":1305192427,"content":"dvang said:\n\nYou do realize that the Core Set box says it is for 1-2 players. Playing with 3 or 4 players is doable, but I don't think that it is reasonable to expect that quests designed for 1-2, which are all 3 quests that we have right now, are perfectly balanced for 3-4. You can play them, but because you're basically doubling the number of players (and heroes) the quest is designed for, of course they are going to be easier. <shrug>\n\nAs I said, alter the scenario to make it harder if you'd like. Try starting scenario 2 with 2 Hill Trolls.  Jail 2 or 3 heroes in scenario 3, etc. The mechanics of the game work fine for 3-4 players. The problem is that with 3-4 players you are playing quests designed for 2. Beef the quests up, or design you own specifically for 3-4 players, if you want more of a challenge.\n\n\n\nThe Core Set is not designed to be used only by 1-2 players.  Right on page 2 of the rules it says \"(Up to four players can play the game cooperatively with a second copy of the core set.)\"  The only reason a single box says 1-2 instead of 1-4, is that you can't make 4 legal (50 card) decks with the contents of the core set and they didn't want to mislead players (there is a post in this forum from TheSpaniard which directly stated this).  The quests even include some mechanics for scaling (like deal out 1 encounter card for each player), so I don't think it is unreasonable to expect that the quests that come with the base game would be scaled properly for 1-4 players.  As you said, yes, there are ways to modify the rules to accommodate a number of players other than 2, but that's really exactly the point I've been defending in this thread, as it is about making custom house rules to make the game more balanced.  Lots of people have come in saying the game is balanced and doesn't need rule modifications, and I just strongly disagree with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467321","commentId":467321,"userName":"Toqtamish","timestamp":1305196982,"content":"And others strongly disagree with you. The main thing EVERYONE needs to remember is everyone is entitled to their own opinion and no one should trample someone else for having a different opinion. You and jhaelen believe the game has flaws, others do not. Let's all just agree to disagree and get back to having some fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467330","commentId":467330,"userName":"servant of the secret fire","timestamp":1305197573,"content":"Entropy42 said:\n\ndvang said:\n\n \n\nAs you said, yes, there are ways to modify the rules to accommodate a number of players other than 2, but that's really exactly the point I've been defending in this thread, as it is about making custom house rules to make the game more balanced.  Lots of people have come in saying the game is balanced and doesn't need rule modifications, and I just strongly disagree with that.\n\n\n\nSorry mate but no.At your first post your exact wards are:after a few games,it feels like the encouter deck is a bit stacked against the solo player,so in an attempt to even the playing field i am testing some solitaire house rules.\n\nSolo and 2 players coop the rules are fine and i don't see any promblem with the game mechanics.The promblem with solo play so far is that  everyone  here have promblem  with the third scenario and not with the game rules so no house rules are needed, only scenario rules if you feel that a scenario is too hard.\n\nIf you say that we need rule modifications for solo and 2 players coop game then no i disagree with you.But as for 3-4 players coop i agree that the game is way too easy  and FFG must do somethink for this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467461","commentId":467461,"userName":"jhaelen","timestamp":1305212299,"content":"servant of the secret fire said:\n\nSolo and 2 players coop the rules are fine and i don't see any promblem with the game mechanics.The promblem with solo play so far is that  everyone  here have promblem  with the third scenario and not with the game rules so no house rules are needed, only scenario rules if you feel that a scenario is too hard.\n\nI agree that the scenario rules are the main cause of the scaling problems.\n\nThere is only one general game rule I consider problematic and that's the surge keyword: Surge always adds a single card to the staging area, no matter how many players/decks are present. That's the one area where the general rules do not scale properly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=467980","commentId":467980,"userName":"dvang","timestamp":1305284618,"content":"<shrug> Scenario mechanics are not the same as core game mechanics, IMO.  Changing a scenario is not \"house ruling\". It is essentially making a new scenario that increases the difficulty, which is part of the reason of scenarios.\n\nI stand by my opinion that the game plays fine with the underlying mechanics it has. If a particular scenario is too easy or too difficult, adjust the scenario or play a different scenario with a different difficulty rating. Right now we only have 3 scenarios, so adjustment is most likely what you'll need to do. Or, create your own scenario that is specifically designed for 4-players.\n\nThat is really all that needs to be done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=468075","commentId":468075,"userName":"jhaelen","timestamp":1305296345,"content":"dvang said:\n\nOr, create your own scenario that is specifically designed for 4-players.\n\n\n\nActually, that's what I think FFG should have done: Design each scenario for a specific number of players and provide guidelines how to adjust it if you want to play it with a different number of players. That would have been a lot easier than trying to come up with auto-scaling scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=468096","commentId":468096,"userName":"Entropy42","timestamp":1305299575,"content":"servant of the secret fire said:\n\n \n\n \n\nSorry mate but no.At your first post your exact wards are:after a few games,it feels like the encouter deck is a bit stacked against the solo player,so in an attempt to even the playing field i am testing some solitaire house rules.\n\n \n\n \n\nI'm not the one who started this thread, so those are not my exact words at all.  I was just defending the idea of modifying the rules.  Though after all this back and forth, I agree with Dvang that its probably a better idea to just tweak the quests rather than tweaking the game mechanics if I think the balance is off. \n\nI'll probably do that at some point and post them up here for people to critique and balance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=468120","commentId":468120,"userName":"servant of the secret fire","timestamp":1305303158,"content":"Entropy42 said:\n\nservant of the secret fire said:\n\n \n\n \n\nSorry mate but no.At your first post your exact wards are:after a few games,it feels like the encouter deck is a bit stacked against the solo player,so in an attempt to even the playing field i am testing some solitaire house rules.\n\n \n\n \n\nI'm not the one who started this thread, so those are not my exact words at all.  I was just defending the idea of modifying the rules.  Though after all this back and forth, I agree with Dvang that its probably a better idea to just tweak the quests rather than tweaking the game mechanics if I think the balance is off. \n\nI'll probably do that at some point and post them up here for people to critique and balance.\n\n\n\nOOOPS.I am so sorry mate my fault.\n\nI agree that FFG must have different scenario rules or set up for solo and different for 2-4 players.Scenario's 3 set up for solo and 2-4 players is not balacned and its unfair.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=468158","commentId":468158,"userName":"Penfold3","timestamp":1305309719,"content":"jhaelen said:\n\n\nAnd Entropy42 is almost certainly absolutely right: Playtesting _must_ have concentrated on the two-player game and getting the first scenario right. Otherwise the egregious scaling issues in the second and third scenario could not be explained.\n\nNote that I'm not saying the game isn't fun. If it was all bad I would have stopped playing long ago. But let's be honest folks: The scaling sucks. Big time.\n\nBut it's a problem that can be fixed by more carefully designed scenarios.\n\n\n\nI'm wondering if Titanium Man is playing the Basic game, where you don't deal out Shadows cards. Also if the quests are two easy for a 2 player team (and yes, when the core says 1-2 players I'm going to dismiss your complaints of quests being to easy as a failure of the games ability to scale or the designers and playtesters not being thorough enough), then try playing in nightmare mode.\n\nWhich brings me to the question whether or not he is playing with the unadulterated decks or if he has combined two spheres to create a single deck. If he is still playing with the single sphere decks it is not surprising that he is running against problems. Which of course is his prerogative but having problems and choosing not to use the full set of tools at his disposal (which are outlined in the rule book even) is just that, a choice. Not something you can really blame on the game, designer, or play testers.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2917091","commentId":2917091,"userName":"ctdemeco","timestamp":1502131109,"content":"I realize this is an old post, but I had something to contribute that I posted on BGG, and seemed to apply here...\n\nIt's interesting - you get a lot of pretty definite for/against folks for house rules. Some feel it destroys the spirit of the game; others feel it's fine if it gives you more enjoyment. \n\nSo - I'm a big fan of ONE thing with games: Fun. \n\nAnd that makes me one of the latter types that believes (almost) anything goes as long as you're having FUN. \n\n(I guess this is why FFG's notes in the game booklets that say I should \"NEVER\" do this or that, or it's 'forbidden' always strike me as Draconian. \"Ease off, dude! I already paid for this game.\" But I get it, tournament rules, etc. Still, let me have fun... ANYway.)\n\nWhen it comes to exceptionally difficult games, I just don't have the patience to spend dozens of hours to get good at all of them. But some are so good, I feel the need to \"mod\" them a bit until I've got the hang of it. And then I start jacking up the difficulty by removing said mods, or tweaking it up in skill.\n\n- Stay with me... I'm going somewhere - \n\nSo one of the ideas we've implemented as an optional house rule in both LOTR as well as Arkham Horror LCG is this: \n\n** YOU choose your first hand. **\n\nThat's it. YOU select the best cards going in that are realistic for the scenario. \n\nWhy? \n\nBecause, in an effort to mimic reality, I thought: Wouldn't you CHOOSE what you set off on an adventure with? I mean, *most* of the time you would get at least a small amount of choice in what you grabbed before you left the house to face a goblin war party. *(Not that many scenarios are \"in media res\" - dropping you right into a shocking situation, after all.)\n\nSo if a scenario is rapidly driving us insane with the difficulty, we'll tweak it slightly to increase our odds slightly. (And in some of these scenarios, you really do need a little sumthin'-sumthin' to keep from avoiding the game entirely. I just don't do well with ritual masochism in my gaming. As much as some people say they love the challenge, it can wear on you a bit.)\n\nSo for LOTR, I will simply do the \"double resource\" easy rule and leave it at that. Sometimes we'll do a first-hand-pick if it's a really new or kickass scenario.\n\nAnyway, it's a more extreme version of the mulligan rule, but one that puts me in an enabled position. I chose these cards, now I'm going to make it work. Or find out why these don't and learn more about the dynamics of the play.\n\nYES - I realize that those opposed to modding the game in the name of it being more winnable (the \"purists\" if you will) will not like this. I get it, and you do have a LOT of valid points. \n\nI just wanted to share my opinion and a bit of philosophy we have toward gaming. I hope this helps someone..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2918174","commentId":2918174,"userName":"Maktorius","timestamp":1502192620,"content":"@ctdemeco [https://community.fantasyflightgames.com/profile/312153-ctdemeco/] I remember there being a \"Enjoyable mode\" variant in BGG's variants forum. It \"allows\" each hero to chose a card from their sphere to be part of the starting hand, instead of you choosing your whole hand. Maybe that is less extreme? I have not tried it though and as a MTG fan I would prefer to add cards that \"fish\" for key cards.\n\nSince i try to play thematic decks instead of power decks, I do plan on trying the solo 5-hero, draw 2 cards and add to encountet cards per turn variant. My hope is that this variant will allow me to \"explore\" more of both the quest (due to more encounter cards drawn) and enjoy more of the card pool (due to larger decks with more draw in planning phase). I don't mind a difficult quest (though I do mind near impossible quests with my thematic decks), so my hope is that it does not altet the difficulty to much either way. If anyone has experience or tips, I would appreciate them :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI'm also planning on testing letting Ranged characters to exhaust to do an attack when an enemy engages and Sentinel charactets exhaust to add defence value to a defender. My hope is that this gives more features to solo games without breaking the game. Once again I'm happy to hear anyones experience :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2918348","commentId":2918348,"userName":"dalestephenson","timestamp":1502200263,"content":"I'm not inherently opposed to modding the game to be more winnable, but I wouldn't enjoy the variant as a base way to play.  I think it would suck the variety out of the player deck.\n\nAs an occasional method of going against tough quests, it's defensible in that given enough tries, your deck would eventually produce that chosen starting hand randomly, you're just saving time by skipping all those auto-concede hands that were suboptimal.  Sort of like picking your hero to be captured for Dol Goldur, only much more so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2918384","commentId":2918384,"userName":"Rouxxor","timestamp":1502201183,"content":"Good point ctdemeco. The only purpose of this game is to have fun! The only one(s) you must care about when you play is those who are actually playing this adventure. It is absolutely right to rewrite part of rules or cards, even on the middle of a game if everyone enjoy this most than the original one.\n\nTo my own I do only a few \"mod\" because I love to share experiences with others people, and this is only possible if I play the same rules that they does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2926903","commentId":2926903,"userName":"BigKahuna","timestamp":1502730437,"content":"I have Noted on many occassions and i Will do so again here that when it comes to cooperative games, for the game to have longevity and maintain interest of players it must feel \"impossible\" to beat.  This is absolutely the most vital component in Lord of the Rings the living card game.  If i was able to beat every quest i own, i would never play this game again.  The only reason i keep coming back is because at least half of the quests on my shelf i have never beat and trying to figuire it out IS the game and solving these really difficult puzzles is the most rewarding aspect of this game. \n\nFor what its worth i do understand the frustration of not being able to beat certain quests but for example a few months ago I found Conflict At The Carrock impossible to beat, today using the exact same card pool I can beat it 80% of the time and with a wide range of decks and heroes.  I solved te puzzle, it was super hard, it took a lot of tries, but in the end i made it.  It was really rewarding to finally post that win in my quest tracker.\n\nI don't see anything wrong with changing the rules of the game to make it easier to win, but I do think you are depriving yourself the oppertunity to dive deeply into the game, gain some mastery and over coming the challenge.  In a way what your doing is kind of a reflection of western society, aka, its too hard so we change the rules to make it easier.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2927275","commentId":2927275,"userName":"banania","timestamp":1502742194,"content":"BigKahuna hit it. We can now close the debate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2927417","commentId":2927417,"userName":"PocketWraith","timestamp":1502745407,"content":"> 4 hours ago, BigKahuna said:\n> \n> I have noted on many occassions and i will do so again here that when it comes to cooperative games, for the game to have longevity and maintain interest of players it must feel \"impossible\" to beat.  This is absolutely the most vital component in Lord of the Rings the living card game.  If i was able to beat every quest i own, i would never play this game again.\n\nYour experience and perspective are not universal. I've beaten almost every quest I've played, I fully expect to beat every quest there is, and yet I retain enough interest in the game to not only continue playing it but also write a blog about it for over two years now.\n\n \n\n> 4 hours ago, BigKahuna said:\n> \n> I don't see anything wrong with changing the rules of the game to make it easier to win, but I do think you are depriving yourself of the opportunity to dive deeply into the game, gain some mastery and overcome the challenge.\n\nThis part I'm right behind you on though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2927455","commentId":2927455,"userName":"dalestephenson","timestamp":1502746603,"content":"Preferred win percentage is highly individualistic for a cooperative and/or solo game.  Here's how I would rank various LOTR outcomes (solo play, either one-handed or two-handed) in my preference:\n\n1) I win, but it wasn't easy and I could have very easily lost.\n\n2) I lose, but I had a chance to win and I could have very easily won with different decisions.\n\n3) I stomp the quest.\n\n4) The quest stomps me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2927656","commentId":2927656,"userName":"Rouxxor","timestamp":1502757717,"content":"For me it is:\n\n1) I lose, but I had a chance to win and I could have very easily won with different decisions.\n\n2) The quest stomps me. (since it stay occasional and if it is in way that improve my deckbuilding decisions, not something decided only by random)\n\n3) I win, but it wasn't easy and I could have very easily lost.\n\n4) I stomp the quest.So yeah, it is really different from a player to another.\n\n> 7 hours ago, BigKahuna said:\n> \n> I don't see anything wrong with changing the rules of the game to make it easier to win, but I do think you are depriving yourself the oppertunity to dive deeply into the game, gain some mastery and over coming the challenge.  In a way what your doing is kind of a reflection of western society, aka, its too hard so we change the rules to make it easier.  \n\nIt is also a personal approach. So it could absolutely don't fit it way to play. And you shouldn't teach your way as the \"good\" way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2927701","commentId":2927701,"userName":"jnicol","timestamp":1502760195,"content":"> 3 hours ago, dalestephenson said:\n> \n> Here's how I would rank various LOTR outcomes (solo play, either one-handed or two-handed) in my preference\n\nYour first two preferences match mine, but I would prefer to be stomped than to do the stomping. Provided I only get stomped once or twice in a row!\n\nI like it when the encounter deck chews me up and spits me out on the first attempt. That means I need to rework my deck and figure out how to beat the quest, and makes victory much more satisfying when it eventually comes, since I feel that I earned it. \n\nAs for the whole house rules thing, I am fine with people tweaking the rules to make the game more enjoyable for themselves, but I personally don't feel that I can be proud of a victory unless I followed all the rules, and that is important to me. It would be like solving the Rubik's Cube by moving the stickers around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2939437","commentId":2939437,"userName":"BigKahuna","timestamp":1503254171,"content":"One thing to keep in mind as well is that you do have easy mode (aka no shadow cards).  This keeps the game very difficult in particular for new players, but you don't have a lot of house rules to deal with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2940620","commentId":2940620,"userName":"dalestephenson","timestamp":1503319765,"content":"\"Easy mode\" is officially defined as removing the gold-ringed cards and giving each hero an extra resource at setup.  It is played with shadow cards.  Not using shadow cards is the \"Basic Game\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46446-custom-solitaire-house-rules/?do=findComment&comment=2952778","commentId":2952778,"userName":"banania","timestamp":1503730889,"content":"And I guess you coul do both : easy mode (extra resources, no hard encounter cards) + basic mode (no shadow cards)."}]}