{"url":"https://community.fantasyflightgames.com/topic/46448-the-word-condition/","title":"The word &quot;Condition&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46448-the-word-condition/?do=findComment&comment=465102","commentId":465102,"userName":"Decker1613","timestamp":1304809945,"content":"So, on the card Caught in a web, it has in bold the word \"Condition\" does this mean it is a one time deal or does it stay on the hero until a card or a character gets rid of it. ie. I spend the two resource points to ready a hero, does this mean the treachery card is now discarded or does it stay on the hero? If so can some one tell me where in the rule book it talks about the word  Condition, I would figure that it is in bold so it would be in there some where. Thanx\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46448-the-word-condition/?do=findComment&comment=465122","commentId":465122,"userName":"TheLightdarker","timestamp":1304818191,"content":"According to page 9 of the rulebook, \"Attachment cards represent weapons, armor, artifacts, equipment, skills, and conditions.\"\n\nCondition is the type of Attachment for Caught in a Web, just like Self Preservation is a Skill attachment.\n\nThe Treachery card in this case stays on the Hero until you are able to play something to cause it to be discarded, i.e., Miner of the Iron Hills (Response: After Miner of the Iron Hills enters play, choose and discard 1 Condition Attachment from play.), or, as the rules say \"If the card to which an attachment is attached leaves play, the attachment card is discarded.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/46448-the-word-condition/?do=findComment&comment=465147","commentId":465147,"userName":"richsabre","timestamp":1304824950,"content":"yes unforntunatly it stays on there until otherwise stated! Minor of the iron hills is your best bet if you play that deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46448-the-word-condition/?do=findComment&comment=465238","commentId":465238,"userName":"Kzer-za","timestamp":1304851520,"content":"\"Condition\" is a trait just like \"Dwarf\" is a trait some characters have or \"Orc\" is a trait some enemies have. The traits do nothing by themselves, but certain cards interact with certain traits. In this case, Miner of the Iron Hills can discard condition attachments, and there may be similar cards in the future."}]}