{"url":"https://community.fantasyflightgames.com/topic/46455-my-first-deck-aragorndenethor%C3%A9owyn/","title":"My first deck (Aragorn/Denethor/Éowyn)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46455-my-first-deck-aragorndenethor%C3%A9owyn/?do=findComment&comment=465137","commentId":465137,"userName":"InfernalZebra","timestamp":1304822369,"content":"Well, I thought I'd post the first 50-card deck I've had victory with in solo play. I tried to make a Tactics/Spirit deck but as I've seen discussed elsewhere it's very hard to make it work. Aragorn and Éowyn were natural choices, and originally I tried to just run Leadership/Spirit with them and Théodred, but he's not that great in solo since he has to commit to a quest to make him work.\n\nThere's a thread floating around here about Denethor as a wall, so, as defense was sorely lacking, I threw him in. Here's the result I cooked up:\n\n \n\nHeroes (Threat: 29)\nAragorn\nDenethor\nÉowyn\n\nAllies (Total: 20)\n1x Beorn\n2x Erebor Hammersmith\n2x Faramir\n3x Gandalf\n2x Gléowine\n3x Guard of the Citadel\n3x Lórien Guide\n2x Miner of the Iron Hills\n2x Northern Tracker\n\nEvents (Total: 14)\n3x A Test of Will\n3x Hasty Stroke\n2x Lórien's Wealth\n3x Sneak Attack\n3x Stand and Fight\n\nAttachments (Total: 16)\n2x Celebrían's Stone\n3x Forest Snare\n3x Protector of Lórien\n3x Steward of Gondor\n3x The Favor of the Lady\n2x Unexpected Courage\n\nOriginally I ran 2x Will of the West instead of 2x Gléowine, but I was simply not drawing enough cards and therefore Will of the West never mattered. Gléowine has significantly smoothed out my card drawing.\n\nSince I can sneak Beorn into play with Sneak Attack, or Stand and Fight in a pinch, he's my fourth Gandalf. I don't want to run two because he already gets used as fodder for Éowyn fairly often with only one of him taking up a card.\n\nThe Hammersmith and Miner have been invaluable against Caught in a Web and having to discard my attachments due to Shadow effects. I typically pitch them to Éowyn as soon as possible and dredge them up with Stand and Fight when needed.\n\nI've yet to see Faramir or Forest Snare in action, since I never seem to draw them.\n\nI'm running Passage Through Mirkwood with reasonable results. Now on to Anduin...\n\nAny thoughts/comments/suggestions are appreciated! I know we're all working with a limited card pool so I apologize if this is just rehashing things.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46455-my-first-deck-aragorndenethor%C3%A9owyn/?do=findComment&comment=465146","commentId":465146,"userName":"richsabre","timestamp":1304824843,"content":"seems a good deck, i made a lore/spirit deck, and got good results from passage through mirkwood, however the real test is in the other two quests!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46455-my-first-deck-aragorndenethor%C3%A9owyn/?do=findComment&comment=465154","commentId":465154,"userName":"servant of the secret fire","timestamp":1304825975,"content":"richsabre said:\n\nseems a good deck, i made a lore/spirit deck, and got good results from passage through mirkwood, however the real test is in the other two quests!\n\n\n\nYeap, second scenario is the real test for your decks and if manage to complete the second scenario with decent results then you can try your luck at the third scenario.\n\nSo far i am in love with the spirit shpere and i am testing a deck with Aragorn,Eowyn and Eleanor at the moment.I use 3 core sets so things are a little more easier for me.\n\nps:sneak attack with Beorn and 3x Gandalf is a great combo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46455-my-first-deck-aragorndenethor%C3%A9owyn/?do=findComment&comment=465157","commentId":465157,"userName":"TheLightdarker","timestamp":1304828267,"content":" Looks like your deck is very similar to something I just recently designed, but haven't had the chance to test out yet (I've been playing mostly two-player in my spare time). Here's what I was looking at putting together, I'm very excited to try it out.\n\nHeroes (Starting Threat: 26)\nGloin\nDenethor\nÉowyn\n\nAllies (Total: 21)\n3x Snowbourne Scout\n3x Guard of the Citadel\n2x Faramir\n2x Miner of the Iron Hills\n2x Erebor Hammersmith\n2x Henamarth Riversong\n2x Gleowine\n2x Northern Tracker\n3x Gandalf\n\nEvents (Total: 12)\n3x Sneak Attack\n3x Stand and Fight\n3x A Test of Will\n3x Hasty Stroke\n\nAttachments (Total: 17)\n3x Steward of Gondor\n2x Celebrian's Stone\n3x Favor of the Lady\n3x Unexpected Courage\n3x Forest Snare\n3x Self Preservation\n\nI had a very hard time deciding which heroes to go with in this deck. I was very tempted to pick Beravor over Denethor for her card draw, but I think his defense might be necessary in protecting a tri-sphere deck while its most vulnerable, before its given the time it needs to acquire resources and really establish itself. His high defense will also mean that I won't often have to sacrifice any Allies just to soak up enemy attacks, so I think that will give me a lot \"more\" in some ways for my resources. My thoughts for picking Gloin over Aragorn were primarily so that I could keep my beginning threat low (so I'm not immediately smashed by the Hill Troll in scenario 2), but also for his superb resource generation once I can drop a Self Preservation on him (he would take over primary defense duty for Denethor at that point). For Spirit, Eowyn was definitely a no-brainer, and I would plan on dumping all of the +Willpower Attachments on her.\n\nI would probably drop the Steward of Gondor on my Lore hero as soon as possible, and between that and Gloin (once he gets Self Preservation), I should be able to crank out a lot of useful Allies with an abundance of resources. Spirit would have the weakest resource generation, but its mostly composed of rather inexpensive counter cards (A Test of Will and Hasty Stroke), and most likely I'll have several turns pass where I can just save up resource tokens to eventually use them to pay for pricy cards like Northern Tracker. I would love to include 3 of them in this deck, but I'm not sure if I'll have that many resources to throw around. I'm also not sure if I should switch my Allies around to include a 3rd copy of Henamarth Riversong since he's so cheap and useful, but I think that 2 each of him, Miner of the Iron Hills and Erebor Hammersmith provide a nice mix of cheap Lore Allies (the miner has a necessary ability, but the hammersmith is more durable and has 1 Willpower, etc).\n\nAnyhow, hope being able to compare my deck with yours is helpful! I'll have to post my results once I actually get to try it out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46455-my-first-deck-aragorndenethor%C3%A9owyn/?do=findComment&comment=465178","commentId":465178,"userName":"servant of the secret fire","timestamp":1304834202,"content":"Ok i just finished 2 games.First game was with only one core set and my score was 32 and the second with 3 core sets and my score was 22.\n\nBecause i don't want to write a big wall of text if you like the heroes i use tell me wich of those 2 decks you can create (with 3 core sets or with one core set) and i will write the cards i use.\n\nI don't know if this a sure win deck for the first 2 scenarios but i enjoy it a lot.\n\nGood luck with your deck i hope it will work well."}]}