{"url":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/","title":"Another Scenario 3 triumph!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=465318","commentId":465318,"userName":"scottindeed","timestamp":1304863768,"content":"Another win against scenario 3, though not with a solo deck.  I decided to play with two decks, on my own.  It occured that this scenario gets easier with more players as only one Hero is ever imprisoned.  Also the effect of cards like Caught In A Web is lessened with more players, and thus more heroes.\n\nI played mono Lore and mono Spirit.  I have two Core Sets so each deck had about 45 cards each, including 3 Gandalfs each.\n\nThe quest was definitely easier!  Eleanor from the Spirit deck was imprisoned which was good for me.  Threat was getting reduced here there and everywhere from all the Gandalfs and Galadhrim's Greeting.  There was plenty of cross deck card play, including playing Protector Of Lorien on a Hero from each deck :-)\n\nAnother advantage of more than one deck is you get to spread the detrimental effects of the Objective cards.  I took the Shadow Key first with Glorfindal who had Self Preservation and could thus heal the damage done to him every turn.  Once the prisoner was rescued I had a Forest Snare to stop the Nazgul in its tracks.  Later I gave the Map to Eowyn (who I never attack or defend with anyway), and the Torch was given to another Spirit hero (as Spirit had the lowest Threat at this point).\n\nI thought I might come unstuck at one point, as though I was seeing off the Enemies fairly effeciently, more and more Locations were stacking up in the Staging area (literally about 9 at one point).  But good old Northern Tracker wiped out nearly all of them in a couple of turns!  Special mention must go to my three Daughters of Nimrodel who were able to merrily heal pretty much any damage that came my way.  I lost Denethor though, as I took a risk with him Defending against Ungoliant's Spawn and drew a +1 Attack Shadow Card :-(\n\nI definitely want to try more games with two decks now.  It is a major headache keeping track of all the cards, but alot of fun.  It will be great to see some of the Ranged attack Heroes and Allies come into their own as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=465330","commentId":465330,"userName":"ClydeCloggie","timestamp":1304864775,"content":"How on Earth did you keep Threat down with so many locations? Even Spirit would have a hard time dealing with that, I would think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=465334","commentId":465334,"userName":"conykchameleon","timestamp":1304865193,"content":"Congrats man! I beat this one time solo, so I know how rewarding it feels when you finally beat it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=465339","commentId":465339,"userName":"scottindeed","timestamp":1304866487,"content":"ClydeCloggie said:\n\nHow on Earth did you keep Threat down with so many locations? Even Spirit would have a hard time dealing with that, I would think?\n\n\n\nI had a fair few Allies out, plus Protector of Lorien on two Heroes.  Eowyn also had two Favours of the Lady, and I nearly always used Gandalf to Quest when I played him.  Plus some timely plays of the Secret Paths card.  Questing with total Willpower of 17 of more towards the end!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=465726","commentId":465726,"userName":"DrNate","timestamp":1304942458,"content":"How do you handle objective cards? You need all three of them attached to a her to get to part three of the quest, but after that, they aren't needed, they just hurt. What can I do to be rid of them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=465796","commentId":465796,"userName":"ClydeCloggie","timestamp":1304949754,"content":"Hope that they get eaten by a shadowy spider, but not too soon"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=465806","commentId":465806,"userName":"scottindeed","timestamp":1304950879,"content":"First off make sure you only take them at the last possible moment (i.e. just before advancing to the next part of the quest).  Leave the Torch as one of the last ones as this is a killer.\n\nAs I said Lore is good as it can take the Shadow Key and use Healing allies, Glorfindal's ability or Self Preservation to overcome its effects.  With the Map, don't forget you can still Quest with the character, so just assign it to your main questing character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=466178","commentId":466178,"userName":"faith_star83","timestamp":1305022287,"content":"After numerous amounts in the true solo mode, I decided today, too, to give this a try with a \"simulated second player\". Since I manage two decks and six heroes I obviously have a small advantage over real two-player mode: I know all cards on both hands, which allows for perfect coordination.\n\nI beat the deck in a single attempt...it was quite easy actually!\n\nI played the Leadership and Spirit decks from the box and added a second Gandalf to each. Luckily.\n\nI had a real bad start encounter deck wise: I drew in the second turn a Hummerhorns and Ungolianth's Spawn, followed by Chieftain Ufthak in round three. But they didn't stand a chance: I had so many allies, that I could constantly play one each round (except the ones I played Gandalf of course). Gandalf helped me to defeat the Spawn and the Humerhorns in the same turn and after that I was just too powerful.\n\nEowyn had The Favor of the Lady and Celebrian's Stone and together with Faramir, Gloin and Theodred + Aragorn I was questing every round easily. Thanks to Unexpected Courage I could use Aragorn to quest, defend and attack which made a big difference. Dunhere, two Elven Archers, Son of Arnor and Aragorn killed off quickly that moved my way.\n\nI was so fast that threat wasn't even a real issue. I used one time Sneak Attack + Attack for the Leadership deck and one time The Galadhrim's Greeting for the Spirit deck.\n\nIn the end I guess I had the perfect run. I had a bit a steep start, but I drew perfectly curved allies and I was always lucky with Shadow cards and Treacheries so no hero nor ally died during the whole run. Thus, I had a massive force in play by the end and once I had 15 progress token on quest 2B I equipped the last two objectives to my character and committed everyone to the quest (for a total of 21). That lead to an instant victory in the first quest phase of quest 3B."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=467000","commentId":467000,"userName":"jhaelen","timestamp":1305141217,"content":"After I had won all three scenarios with a single deck, I also started playing solo with two starter decks. I played a total of 36 games, two attempts at each scenario using each of the six two-sphere combinations:\n\nUnsurprisingly, I won 12 out of 12 games vs. the first scenario. There would have to be a pretty amazing streak of bad luck to lose this one!\n\nI won 7 out of 12 games vs. the second scenario and a surprising 8 out of 12 games vs. the third scenario. To be honest I felt the third scenario is actually a bit easier than the second.\n\nThe two most successful sphere combinations were Leadership/Spirit (no surprise there!) and Lore/Spirit (now that _was_ a bit surprising!) with no losses.\n\nNext came Leadership/Tactics with 5 wins and Spirit/Tactics with 4 wins.\n\nThe weakest combos were Leadership/Lore (though a bit of bad luck was involved here) and Lore/Tactics with 3 wins out of six each. The latter was the only combo that felt like it didn't really work at all.\n\nSo far I don't feel the game has a real 'sweet spot'. Using a single deck is way too hard for my taste and using two decks it's already almost too easy. I really hope for the future scenarios to be better balanced."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=468343","commentId":468343,"userName":"Mestrahd","timestamp":1305366349,"content":"I have a question regarding this scenario, and I didn't feel it was worthy of a new thread.\n\nIn my 2-player game, one of my heroes was prisoner, and I was quickly overrun by enemies killing my remaining two heroes. My partner had all 3 heroes available. My question is two parts. Am I still considered to be \"in the game\" with my prisoner hero? If so, would the enemies that engaged me remain engaged, since the prisoner hero could not be damaged?\n\nWe played it as yes to both questions. I remained in the game, keeping track of my threat, and kept the enemies on me rather than returning them to the staging area. It turned out to be moot since he could not make any progress on the quest to get to the second phase to rescue my hero.\n\nOn topic: I will definitely consider the Lore / Spirit combo for our next attempt. I think we used two dual sphere decks of Tactics/Lore and Spirit/Leadership."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=468356","commentId":468356,"userName":"Oshio","timestamp":1305368403,"content":"I think that things will be a little more fun with 2 player when you can build legal solo-sphere decks. Right now using 2 decks IS too easy, because the decks are not legal. Spirit is insanely good with a 30 card deck. Once the first pack comes out, try building a 50 card solo-sphere deck then play using 2 decks. I think you'll have the 'sweet spot' you want, at least for awhile.\n\nFor me it's a bit worse because even using a single deck the game is too easy, except for the third scenario which is unplayable. I'm considering playing the third scenario but keeping three heroes just for a slightly different play experience than scenario 2 over and over, which I have yet to not get a negative score on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=468662","commentId":468662,"userName":"jhaelen","timestamp":1305437048,"content":"Mestrahd said:\n\nIn my 2-player game, one of my heroes was prisoner, and I was quickly overrun by enemies killing my remaining two heroes. My partner had all 3 heroes available. My question is two parts. Am I still considered to be \"in the game\" with my prisoner hero? If so, would the enemies that engaged me remain engaged, since the prisoner hero could not be damaged?\n\n\n\nIn my games I've assumed, you lose the scenario if the player with the prisoner has no other heroes left. The rules are silent on this, though. Imho, there 'should' be a rule that the prisoner is killed, if no free heroes are left, but there isn't. Something for the FAQ, I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46483-another-scenario-3-triumph/?do=findComment&comment=468764","commentId":468764,"userName":"scottindeed","timestamp":1305460553,"content":"To those Scenario 3 doubters - check out my current Lore / Spirit deck which has won three out of three times against Scenario 3! (needs two Core Sets).  Note I updated it to now include Denethor / Berevor / Dunhere, rather than Glorfindal.\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=490363 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=490363]"}]}