{"url":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/","title":"Deck Critique: Eowyn, Dunhere, and Thalin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=465376","commentId":465376,"userName":"conykchameleon","timestamp":1304872812,"content":"Hey all,\n\n \n\nI'm starting to have some consistent success with this one on Quest 2 (I'm talking like a 25%ish win rate which is FAR more consistent than anything else I've built so far, even though its low). I've done some tweaking already, but I was wondering if anyone on here had any suggestions they'd like to throw my way. (And note that I only have two Core Sets, which is why a couple of these are 2x instead of 3x\n\n \n\nHeroes\n\nEowyn (Spirit)\n\nDunhere (Spirit)\n\nThalin (Tactics)\n\n \n\nAllies\n\nGondorian Spearman 3x\n\nVeteran Axehand 3x\n\nLorien Guide 3x\n\nNorthern Tracker 3x\n\nGandalf 3x\n\nBeorn 2x\n\n \n\nEvents\n\nStand and Fight 3x\n\nThe Galadhrim's Greeting 3x\n\nStrength of Will 3x\n\nDwarven Tomb 2x\n\nA Test of Will 3x\n\nA LIght in the Dark 3x\n\nHasty Stroke 3x\n\nFeint 3x\n\nBlade Mastery 3x\n\nSwift Strike 2x\n\n \n\nAttachments\n\nCitadel Plate 3x\n\nUnexpected Courage 2x\n\n \n\nThe change that I'm thinking of right off the bat is -3x Blade Mastery, +3x Dwarven Axe. What other suggestions do people have?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=465382","commentId":465382,"userName":"conykchameleon","timestamp":1304873059,"content":"Sorry for the double post, forgot to talk a bit about how I play it:\n\n \n\nBasically I slow play everything by reducing threat early and often, and building up allies (preferably tracker/scouts). When I land into the proper amount of Gandalfs/Beorn, I can engage the troll. Once past the first stage, it gets quite a bit easier. Just quest with trackers/scouts/Eowyn to deal with locations. I let Dunhere take out smaller enemies, and engages the bigger ones, soak up damage with allies, and kill them as necessary."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=465398","commentId":465398,"userName":"Titan","timestamp":1304875247,"content":"Why Thalin rather than Legolas? The combo with Thalin's and Dunhere's abilities is good, but I think Legolas would make more of a difference. Dunhere would be almost as effective without Thalin and you would gain a secondary way to place tokens on quests. Plus, the threat level would stay the same. With Blade of Gondolin, this could really help through the second scenario. You might also want to consider Horn of Gondor for some extra resources when your allies leave play.  And no Favor of the Lady for Eowyn?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=465408","commentId":465408,"userName":"conykchameleon","timestamp":1304877547,"content":"Well initially, I took Thalin over Legolas because of his power. That extra damage on each enemy lets Dunhere one-shot enemies that he might not have been able to otherwise, and makes the Eastern Crows null-in-void. And if he gets unexpected courage on him, it gets really excellent (his 2 DEF saves a lot of situations, as with Legolas, everyone's DEF would 1). I will definitely test with Legolas though and see how that runs.\n\n \n\nHorn of Gondor and Favor of the Lady were right on the bubble for being included, but honestly I'm not sure what to take out to fit those in. Any thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=465472","commentId":465472,"userName":"Kzer-za","timestamp":1304894128,"content":"How often do you actually get to play Citadel plate? It seems to me that with one Tactics hero and no resource acceleration, it's not very practical at 4 cost. I would replace it. Horn of Gondor and/or Dwarven Axe are possible replacements, or maybe Favor of the Lady if you think you need it.\n\nHave you considered using Quick Strike? It's a possible alternative to Swift Strike and Blade Mastery, or it can work well in combination with Blade Mastery and Dwarven Axe.\n\nAlso, Faramir is a fun option for Spirit decks. You can dump him with Eowyn and then play him with Stand and Fight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=465482","commentId":465482,"userName":"Titan","timestamp":1304897597,"content":"As mentioned above, Citadel Plate seems slow and expensive in this deck. I would add Blade of Gondolin instead. I would also exchange two Blade Mastery for the two Horns and that would leave you the last Blade Mastery and perhaps one of the Hasty Stroke(you don't always get shadow effects) and you could add at least two The Favor of the Lady."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=465489","commentId":465489,"userName":"conykchameleon","timestamp":1304900910,"content":"These are good suggestions! I think I'll try it next time I play with:\n\n \n\n-1 Thalin\n\n-3 Citadel Plate\n\n-1 Hasty Stroke\n\n-3 Blade Mastery\n\n \n\n+1 Legolas\n\n+3 Blade of Gondolin\n\n+2 Favor of the Lady\n\n+2 Horn of Gondor\n\n \n\nwith Quick Strike being on the bubble if something else doesn't fly. I'll report back when I try it out. Thanks to all who made suggestions!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=466109","commentId":466109,"userName":"Titan","timestamp":1305014125,"content":"I wish you good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46490-deck-critique-eowyn-dunhere-and-thalin/?do=findComment&comment=466410","commentId":466410,"userName":"conykchameleon","timestamp":1305049781,"content":"So I played a couple games this evening, and the edits are quite solid. They seemed make the deck more consistent. I think this has lot to do with Legolas. I was able to pretty much keep the staging area completely clear of enemies. I think I'm going to try replacing Favor of the Lady with Quick Strike though. In both the games I played for Scenario 2, I didn't draw it until the end, and it didn't really make that much of a difference. I could have used Quick Strike pretty often though, as those darn Eastern Crows turned Legolas into a wasted defender on several turns, where he could have been +2 Progess tokens and some dead crows instead. But anyway, I think it's just some very fining tuning with this one from here on out. Thanks to all who helped! (On a side note, this deck is definitely built for the second scenario. I put it against the 3rd scenario a couple times...it was pretty ugly)"}]}