{"url":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/","title":"Would this combo work? ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466427","commentId":466427,"userName":"Titan","timestamp":1305052738,"content":"A recent game situation in which I had two weak enemies engaged has prompted me to think abou this:\n\nLegolas with Unexpected Courage attached. Could I attack with him and kill one enemy, then ready him using Unexpected Courage and have him participate in a second attack against a different enemy? With a Blade of Gondolin also attached, this could be a devastating strategy to add counters onto quests or locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466430","commentId":466430,"userName":"Toqtamish","timestamp":1305053150,"content":"Yes it would. Each attack is individual attack, it works quite well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466435","commentId":466435,"userName":"servant of the secret fire","timestamp":1305053793,"content":"I think Toq is right.If i remember the rules well you can't attack the same monster twice with the same character but i don't remember says anywere that you can't attack more than once with the same character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466471","commentId":466471,"userName":"faith_star83","timestamp":1305059845,"content":"I agree, too. The rules state that each enemy can only be attacked once, but it doesn't say that heroes cannot attack multiple times. Just that they need to be ready in order to be able to attack.\n\nI really like Legola's ability. It's just a bit unrealiable since he is almost useless when there's a lot of locations but only few enemies :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466487","commentId":466487,"userName":"BudSinigaglio","timestamp":1305062594,"content":"Hey folks I'm not sure you can use Unexpected Courage after an attack to ready Legolas (or any hero) to allow that hero to attack again. Page 23 talks about cards with the keyword \"Action\" and it says that they may only be triggered \"...by their controller during any action window in the game sequence.\" Later on the same page, \"Actions without a specified phase can be triggered during any action window throughout the round. (See the \"Turn Sequence\" chart on pages 30-31.)\" If you go to page 30 and 31 you can see the player action windows indented throughout the phases. If you look under 6. Combat Phase you will notice that players may trigger these actions right after all the enemies have received their shadow cards. The next action window isn't until all combat has resolved by all players. Unexpected Courage would have to wait until the end of the Combat Phase to ready up the hero it is attached to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466490","commentId":466490,"userName":"Casamyr","timestamp":1305063023,"content":"It also says that Action cards can be played during any of the green highlighted sub-phases, not just in the designated parts on the flowchart. There are actually only a very few times where you cannot play a card, such as when shadow cards are dealt to enemies in combat - that always happens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466503","commentId":466503,"userName":"Titan","timestamp":1305066207,"content":"Ah, good. Thank you for your thoughts, everyone!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466516","commentId":466516,"userName":"BudSinigaglio","timestamp":1305069640,"content":"Casamyr said:\n\nIt also says that Action cards can be played during any of the green highlighted sub-phases, not just in the designated parts on the flowchart. There are actually only a very few times where you cannot play a card, such as when shadow cards are dealt to enemies in combat - that always happens.\n\n\n\nI looked at the rules again.  Paragraph 4 on page 18 and paragraph 3 on page 20 specifically say players can take actions at the end of each step while defending and while attacking. Thanks for pointing that out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46584-would-this-combo-work/?do=findComment&comment=466548","commentId":466548,"userName":"Casamyr","timestamp":1305078068,"content":"No Probs Archer. I thought that you could only play cards in the set places that the action flowchart displayed at the end of the rules, until I read through them a couple of times and realised that you can play action cards before and after each step. Makes it a bit easier."}]}