{"url":"https://community.fantasyflightgames.com/topic/46632-multiple-cores-stronger-decks-and-encounter/","title":"Multiple Core&#039;s, Stronger Decks, and Encounter?.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46632-multiple-cores-stronger-decks-and-encounter/?do=findComment&comment=466853","commentId":466853,"userName":"getrichordietrying","timestamp":1305122161,"content":"Hi @ll,\n\ni've bought 2 Core Sets, to maximize deck building options (the left 12 Single Cards were filled with Proxies/Scans).\n\nI've playin 2 Kinds of Decks, one very very strong Leadership/Spirit Deck and one less powerful but killing machine Tactic/Lore Deck.\n\nBut whats about to happen with the encounter deck? I've played it like everybod else with one Core Set Encounter Deck, but i don't know if its right or a little too easy for now, since i maximized my built options, but the encounter deck, has the strong cards only 1 time?\n\nHow do you guys play it? Did you add the single's and 2nd's now that every encounter deck has every card 3 times? have anyone testet it before?\n\nHow do you like the idea?\n\nHope this thread will be filled with comments and input.\n\nThx @ll\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46632-multiple-cores-stronger-decks-and-encounter/?do=findComment&comment=466866","commentId":466866,"userName":"Titan","timestamp":1305122962,"content":"The encounter deck is supposed to stay the same, no matter how many core sets you buy. I don't know if a house rule adding cards to it is good or not. The idea, for those souls adventurous enough, would be to increase the difficulty. But adding more cards can also water down the encounter deck. I would just leave it as it supposed to be, unless you find it to be a very poor challenge. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/46632-multiple-cores-stronger-decks-and-encounter/?do=findComment&comment=466881","commentId":466881,"userName":"Dam the Man","timestamp":1305124836,"content":"Some have mentioned the idea of only adding Enemies/Treacheries from the 2nd CS to the Encounter deck, thus diluting the Location probability, reducing the chances of having 3+ locations in the staging area. On the flipside, having 2 Hummerhorns engage you in one turn, you would gladly take those Locations partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46632-multiple-cores-stronger-decks-and-encounter/?do=findComment&comment=466932","commentId":466932,"userName":"Dwnhmcntryboy","timestamp":1305129777,"content":"If you think your deck is too powerfull just combine all of the quests and play them in order."}]}