{"url":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/","title":"Son of Arnor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468392","commentId":468392,"userName":"lleimmoen","timestamp":1305374506,"content":"Hello,\n\nat first I thought this card is terrible but then (neither of which is probably a surprise for an experienced player) I realized he may be a good progress mechanism. I have him in my deck now but have not had a chance to prove his worth. What is your experience?\n\nAlso, is A Light in the Dark as bad as I think? I know it is a different sphere but compared to Feint, it is more expensive and will hinder the quest the following round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468428","commentId":468428,"userName":"TheLightdarker","timestamp":1305381936,"content":" In my experience, I thought that Son of Arnor would be a little bit more useful than he has turned out to be. I included 3 copies in my 2 player Leadership & Tactics deck, and I've played about five games with it over all three scenarios partnered with another deck, Lore & Spirit (only one loss, first attempt at scenario 2).  I included him to pull enemies out of the staging area during stage 2 of Journey Down the Anduin (goblin snipers, etc), as well as to rescue fellow players from engagement with something nasty, but so far it seems that almost every time I draw him, I end up choosing not to play him specifically because I want to leave creatures in the staging area. There are even times when I have plenty of free resources and would appreciate having the extra 2 attack strength ally, but would rather wait to engage with enemies than lay him down on the table, and his response doesn't allow you an option not to engage.  Especially once my partner started using Dunhere, the only time I ever found myself playing a Son of Arnor was when the staging area was completely empty.  When I think of something, I'll probably try swapping them out for something more useful.\n\nI personally haven't used Light in the Dark in a deck, but it does seem like an awful lot of resources to just delay engagement with a single enemy one round (and increase the Threat in the staging area), unless you play it and then a The Galadhrim's Greeting or Gandalf to reduce Threat.  I suppose the latter could be fairly useful in a few situations during single player, if you happen to have that combo ready to play, and happen to have 5 to 7 resources, but even then it only buys a little bit of time and would put you a lot of resources away from being able to afford stuff to remedy your situation in the long term.  Or, maybe by throwing a creature in the staging area, if you have Dunhere it'll let you not only prevent having to eat one attack, but his 3 attack may be sufficient damage whereas an attack of 2 wouldn't be?  Or, I suppose if you're somehow getting swamped with creatures it could allow another player to engage it instead of it coming back to you, but really, A Light in the Dark only seems useful in very specific situations.  I'm not seeing a whole lot of appeal there, but there could of course be other uses I'm not thinking of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468441","commentId":468441,"userName":"Mestrahd","timestamp":1305383825,"content":"Responses are optional, are they not? Only Forced occurs whether the player wants it or not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468442","commentId":468442,"userName":"TheLightdarker","timestamp":1305383973,"content":"Mestrahd said:\n\n \n\nResponses are optional, are they not? Only Forced occurs whether the player wants it or not.\n\n \n\n \n\nHuh, so they are, according to page 23.  Sweet, that makes Son of Arnor a little bit more useful, though most of what I mentioned still applies.  Thanks for the heads up!\n\nEdit: Hahahah, they even use Son of Arnor as the example for a Response in the rulebook."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468447","commentId":468447,"userName":"Mestrahd","timestamp":1305384532,"content":"No problem.\n\nThe Son of Arnor is useful, as you mentioned, for getting Goblin Snipers (especially when you stage 2 of them) or pulling a baddie that your partner can't handle. Even if you don't have anyone to engage, he's still relatively strong for his cost.\n\nA Light in the Dark is nice to delay the beating for one turn when you have more attacking enemies than defenders. As you said, it's also great for tossing someone back for Dunhere to gain an extra attack point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468666","commentId":468666,"userName":"jhaelen","timestamp":1305437525,"content":"lleimmoen said:\n\nAlso, is A Light in the Dark as bad as I think?\n\nIt is. It's the first card I use to pay for effects that are payed by discarding cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468758","commentId":468758,"userName":"Mestrahd","timestamp":1305460307,"content":"The first card I discard is Gandalf's Search. I just can't see paying more than 1 for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46771-son-of-arnor/?do=findComment&comment=468853","commentId":468853,"userName":"lleimmoen","timestamp":1305472961,"content":"Thanks for your thoughts, gentlemen. I still have hope in Son of Arnor, I will let him prove his worth."}]}