{"url":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/","title":"Captured Hero only","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470047","commentId":470047,"userName":"Rashley","timestamp":1305643059,"content":"Had a nightmare 3rd quest - 2 player - which started badly when Aragorn was the random Hero captured.  However, later on, that player lost all their characters except the captured Aragorn.  Taking the rules literally, that player is still technically playing as they havn't lost all their Heroes?  Have they?  There were 3 enemy engaged on that side, but what happens to them?  Stictly speaking that player hasn't left play, so they are not returned to the staging area fully healed.  That effectively removed 3 enemy threat and damage unless the fruitless Shadow cards affected other things than combat.  Also, since that player was still in play, they could engage future enemies to reduce threat and have them combat nothing!  This seemed a little strange, but, unless I have overlooked something else, within the rules.  Has it been covered before?  Have I missed something?  Is it just strange but legal?  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470055","commentId":470055,"userName":"Toqtamish","timestamp":1305643249,"content":"Strange for sure but sounds like you did everything right from what you described in your post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470058","commentId":470058,"userName":"Titan","timestamp":1305643433,"content":"Good question, a player is eliminated if all of his heroes are killed. But a captured hero isn't dead, just not under the player's control. I don't know if it was intended that way, but until the rules are more precise I say the player can remain in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470108","commentId":470108,"userName":"Ismar","timestamp":1305649144,"content":"This is how I would do it, if the captured hero is the only hero remaining with a player.  Sort of a quasi-state between in and out of the game.\n\n \n\n1. All Allies leave play, but player keeps his hand of cards\n\n2. All engaged enemies return to the staging area (after all, there isn't anyone to fight)\n\n3. Cannot engage enemies to help reduce threat\n\n4. That player remains, but effectively becomes a spectator until either the hero is rescued of other heroes are returned to play\n\n5. Once the hero is freed, or other heroes are \"revived\", the player can join back in with his companions\n\nJust my opinion on how to play it out.\n\nThanks,\n\nDon"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470141","commentId":470141,"userName":"Rashley","timestamp":1305652157,"content":"Isma's solution looks like common sense, but it really does need sorting out officially.  Also, if the player with only a captured Hero left is removed from the game say, by reaching 50 threat, does the whole quest fail then and there as there is no Hero to rescue?  Maybe the remaining player(s) continue, but ignore all references to rescue.  Are the 'Objectives' still needed?  Does the Nazgul attack?  Is the quest to rescue a Hero or just to get to the end?  Yes, this needs a bit of thought!  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470243","commentId":470243,"userName":"Titan","timestamp":1305662619,"content":"If the player with the still captured hero is eliminated by threat, the game won't be over, I suppose, but there is no way to win it, as you can no longer meet the advancement conditions for the second scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470310","commentId":470310,"userName":"TheLightdarker","timestamp":1305671831,"content":" If a player with a captured hero remains in the game (which seems like it would make sense, as the \"captured\" hero can still be rescued), I'm not sure why his enemies would return to the staging area, as there is no elimination.  At the same time, the one remaining player would definitely have to contend with two encounter cards per staging (assuming two players), so the odds would be pretty stacked against him or her... I think.\n\nEdit: in reading the rules, page 22 says \"a player is eliminated from the game if all of his heroes are killed, if his threat level reaches 50, or if a card effect forces his elimination.\"  As a captured hero is not killed, I think that any allies that player had would remain in play, he just wouldn't have any way to earn future resources to play anything else.  The player would pretty much be stuck with what they have left until they were either lucky enough to have their hero rescued, whereupon they could resume generating resources, or they had a hero resurrected.  In any case, the player would continue to gain threat, and could definitely be eliminated that way.\n\nTo put it more simply, I think it would happen like this:\n\nPlayer A starts with a captured hero.\n\nPlayer A has his not-captured hero(es) killed; his Allies and Attachments stay in play, and creatures remain engaged with him or her.\n\nPlayer A no longer generates resources, but can play cards with a cost of 0 if he satisfies other requirements, and can otherwise take turns \"as normal.\"\n\nPlayer A continues to generate Threat, and enemies will continue to engage with this player.  The encounter deck will reveal it's additional card to represent this player as it would normally.\n\nIf at any point the quest progresses and Player A's captured hero is rescued (or they have a dead hero resurrected), he or she will once again generate resources and play \"as normally.\"  I would imagine that that player would have a lot of cards in their hand by this point, but that their lone hero would probably be torn to bits in short order by creatures engaged with him or her, though.\n\nI would also imagine that Player B would likely be swamped or otherwise overcome by the encounter deck pretty quickly having to deal with 2 draws all by him or her self (assuming 2 players), and in any case I imagine that Player A's threat would max out and he would be eliminated in relatively short order.\n\nI also just want to add that if you're on quest stage 3B, and player A (with the captured hero), is eliminated, you can still win the scenario according to the quest card.  \"Players cannot defeat this stage while Nazgul of Dol Guldur is in play.  If this stage is defeated and Nazgul of Dol Guldur is not in play, the players have won the game,\" and of course the rulebook states on page 22, \"if at least one player survives through the completion of the final stage of the scenario, the game ends in a victory for the players.\"  So, it looks like it'd be possible for Player A to have his non-captured heroes killed during 1B, be rescued during quest card 2, and then end up being eliminated during quest card 3 and the players can still win... with more than a little luck, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470573","commentId":470573,"userName":"Vyron2","timestamp":1305705648,"content":" My solution as follows: \n\nthe following applies if player's threat count is under 50:\n\nthe player with the captured hero takes turns as normal - draws cards, can play cards that do not cost anything and all his cards remain in play - otherwise he is a spectator. engagement checks toward this player are made, so enemies engage him as long as he has sth to FIGHT against enemies, i.e. allies. if there are no allies left (no heroes anyway), the enemies retreat to the staging area with their wounds, attachments (forest snare, e.g.). player cannot engage any enemies until he regains an ally (wandering took given by other player, e.g.) or one of his heroes is revived through fortune or fate.\n\nthe game proceeds as if 2 normal players played the game - which actually is the case :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nwhen the prisoner is rescued, normal play resumes...\n\n \n\nif the threat is OVER 50: all cards of beforesaid player are discarded, i.e. allies, attachments, no cards are drawn by him, enemies return to the staging area, the game proceeds as if 1-player played it, only his hero stays for the purpose of rescue. once the prisoner is rescued, he is also removed from play, because his controller has lost the game... the remaining player must try and finish...\n\n \n\nthis seems logical to me, as a player has not lost a game UNLESS ALL his heroes are eliminated OR his threat is OVER 50...\n\n \n\nlet me know, what you think..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470577","commentId":470577,"userName":"ClydeCloggie","timestamp":1305706094,"content":"I don't agree with the suggestion that a player with just a prisoner but no other hero can still play 0-cost cards. The requirement for playing such a card is that you have a hero of the correct sphere in play, which cannot be met."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470582","commentId":470582,"userName":"Vyron2","timestamp":1305706883,"content":"ClydeCloggie said:\n\nI don't agree with the suggestion that a player with just a prisoner but no other hero can still play 0-cost cards. The requirement for playing such a card is that you have a hero of the correct sphere in play, which cannot be met.\n\n\n\n \n\nyeah!! sorry, I totally agree! rulebook p. 12... totally forgot that angel.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/angel.gif]so no playing cards at all :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470649","commentId":470649,"userName":"TheLightdarker","timestamp":1305715840,"content":"ClydeCloggie said:\n\nI don't agree with the suggestion that a player with just a prisoner but no other hero can still play 0-cost cards. The requirement for playing such a card is that you have a hero of the correct sphere in play, which cannot be met.\n\n\n\nOops, forgot about that rule!  I agree with you, then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470658","commentId":470658,"userName":"Mestrahd","timestamp":1305716826,"content":"I agree that any engaged enemies will stay engaged regardless of whether or not you have any allies. My reasoning is that the prisoner hero \"cannot be damaged\". Why would they include that if there were no opportunity for him to BE damaged? So those enemies stay engaged, attack as normal, but no wounds are placed on the prisoner hero.\n\nHmmm. While writing this, I came up with another question. If this is the case, could you just leave all attacks undefended and assign the damage to the prisoner? That would seem like an unintentional benefit to having the prisoner on your side."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470661","commentId":470661,"userName":"Vyron2","timestamp":1305717297,"content":" Imagine even a worse scenario: \n\nwhat if one - as permitted by the rules - plays ONE hero only - and THAT hero exactly gets captured???? what can one do when being in such a quandary?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470663","commentId":470663,"userName":"Ismar","timestamp":1305717501,"content":"Mestrahd said:\n\nI agree that any engaged enemies will stay engaged regardless of whether or not you have any allies. My reasoning is that the prisoner hero \"cannot be damaged\". Why would they include that if there were no opportunity for him to BE damaged? So those enemies stay engaged, attack as normal, but no wounds are placed on the prisoner hero.\n\nHmmm. While writing this, I came up with another question. If this is the case, could you just leave all attacks undefended and assign the damage to the prisoner? That would seem like an unintentional benefit to having the prisoner on your side.\n\n\n\nMestrahd said:\n\nI agree that any engaged enemies will stay engaged regardless of whether or not you have any allies. My reasoning is that the prisoner hero \"cannot be damaged\". Why would they include that if there were no opportunity for him to BE damaged? So those enemies stay engaged, attack as normal, but no wounds are placed on the prisoner hero.\n\nHmmm. While writing this, I came up with another question. If this is the case, could you just leave all attacks undefended and assign the damage to the prisoner? That would seem like an unintentional benefit to having the prisoner on your side.\n\n\n\nI disagree with this.  My original reply stated that allies leave, but I can acquiesce on that point and allies can hang around if the only hero is the captured one.  Monsters would stay and fight the allies, but I feel if there are no allies left, and no active heroes, the monsters should return to the staging area.  There's nothing for them to fight any longer.  Again, my opinion.\n\nAs for the rule on a prisoner hero cannot be damaged, there are plenty of shadow effects and treachery cards that deal auto damage, outside of direct combat.\n\nWhat it really comes down to is until an FAQ is released, we'll all play it with our own interpretation of the rules for the situation.\n\nThanks,\n\nDon"},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470713","commentId":470713,"userName":"jhaelen","timestamp":1305721770,"content":"Ismar said:\n\nAs for the rule on a prisoner hero cannot be damaged, there are plenty of shadow effects and treachery cards that deal auto damage, outside of direct combat.\n\n\n\nThe scenario rules definitely need to be clarified.\n\nAs written, the scenario has even more loop holes. E.g. it doesn't say you cannot exhaust the prisoner. It's also silent on attachments.\n\nTo me it would make more sense if the scenario rules said 'You cannot choose to wound the hero'. I.e. you cannot use the prisoner to soak damage from undefended attacks, but the prisoner would be wounded by effects wounding every hero or if the prisoner's the only hero left. I would also be fine with an added rule saying: 'If the prisoner is the only hero left to a player, it will be killed the next time a hero would take damage.'\n\nWhen I played the scenario I always stopped playing when the prisoner was the only hero left to the controlling player, even if the rules don't seem to require it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/46934-captured-hero-only/?do=findComment&comment=470848","commentId":470848,"userName":"Rashley","timestamp":1305731868,"content":"Thanks for all the feedback on this thread I started.  It hopefully won't turn up much and we can continue in our own ways until an official ruling is made.  It just surprised me that FFG missed this obvious loophole.  Taking the rules as written literally, is normally the best option but can lead to some strange situations like this.  Still enjoying the game though.  Cheers!"}]}