{"url":"https://community.fantasyflightgames.com/topic/47007-what-is-the-point-of-scenario-symbols/","title":"What is the Point of Scenario Symbols?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47007-what-is-the-point-of-scenario-symbols/?do=findComment&comment=470974","commentId":470974,"userName":"karat","timestamp":1305749754,"content":"As far as I can tell, the scenario symbols on quest cards serve no purpose.  Why are they there?  The encounter deck is made up of all the quest's symbols, so the symbol on any one card is irrelevant, right?  Perhaps there are specific cards that reference the symbol or symbol matching?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47007-what-is-the-point-of-scenario-symbols/?do=findComment&comment=470977","commentId":470977,"userName":"TheLightdarker","timestamp":1305750118,"content":"The only point of the scenario symbols on quest cards is to remind the player of which specific encounter card sets (i.e., Spiders of Mirkwood), should be combined together to make the encounter deck used for that scenario.  Any encounter sets with a symbol that is not pictured on the quest card should not be included to compose that scenario's encounter deck.  This information is of course included in the rulebook, but it's handy to have directly on the quest cards, so it's there.  For the sake of uniformity I suppose they chose to print it on all the cards, and not just 1A or something.  I don't think there's any other point for those symbols?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47007-what-is-the-point-of-scenario-symbols/?do=findComment&comment=471007","commentId":471007,"userName":"karat","timestamp":1305756652,"content":"Note: You are thinking of side A, whereas I was thinking of side B.\n\n \n\nSide A tells you all the symbols that go in the encounter deck.\n\nSide B seems to be a symbol unique to that scenario, so that you know the cards that go together.\n\n \n\nI was being confused and wondering why the symbol on side B was only a subset of the symbols that go in the encounter deck (which are the symbols on side A)."}]}