{"url":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/","title":"OT: FFG&#039;s other LCGs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471004","commentId":471004,"userName":"Mestrahd","timestamp":1305756114,"content":"So I'm fascinated with this idea of LCG after coming from CCGs and I wanted to get the opinions of FFG loyalists. I've watched the demos for all 3 of their LCGs and I'm interested in this order: WI, AGOT, and lastly COC. I've heard WI is imbalanced pretty bad with just the core set, but how about AGOT? I might buy either WI or AGOT based on positive feedback, but probably not both. I'd prefer my initial investment to be low, so which one is best out the gate with 1 core? Both have been around for what looks like years but shouldn't be too hard to find if I like them.\n\nThanks for any advice!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471010","commentId":471010,"userName":"Carnivean","timestamp":1305757419,"content":"Hey Mestrahd,\n\nWell I have 2-3 Cores of AGOT, WI and LOTR.  Personally of those three, AGOT is easily the best out of the box.\n\nHaving played LOTR, you know that the Event cards eat into player decks in the core set and that is understandable.  Characters are limiting in terms of customisation.  Also the LOTR card pool is bare.  Neither WI and AGOT are going to have this issue.  The decks are larger out of the box and are broader in scope.\n\nOur group isn't as heavily into WI as AGOT, but reading around the balance in WI is getting there now.\n\nAGOT I love to death.  Some players are still just using the CS and have a great time in our group.  A lot of that has to do with imagery as much as anything, but it is a solid game, enjoyable play and as balanced as anything can be is something like a Core Set.\nAdd in that there are deluxe boxes now for all but one house (Lannister) and there are plenty of options for people in your group to go forward with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471206","commentId":471206,"userName":"Toqtamish","timestamp":1305787965,"content":"AGoT is by far the best right out of the box and overall. Best thing now is if you get the core set and like it you can buy the house expansion for the house that you like and using that and just 1 core set you can build decks that were designed for using just those. In each of the newer house expansions they have put in a little insert that gives you two decks to build and explanation on how to use them. Princes of the Sun and Kings of the Sea do not have this, instead they have alternate play format rules. If you ever get Princes of the Sun or Kings of the Sea, make sure it is the Revised edition as they now come with 3 of each card in them. When originally released Princes had 2 of each and Kings of the Sea had 1 of each and a special resin house card.\n\nI started buying LCG's back in the fall of 2009 and started by buying Warhammer invasion, and then AGoT couple weeks later, then I started to collect both games packs buying 2 of each as at the time packs were 10 cards in 1 copies and 10 cards in 3 copies. We got bored of Warhammer after playing in the Canadian regionals in 2010 and haven't touched it since. Game is horribly imbalanced and from what I see from the occasional read on W:I forums, still has some issues, this was just after the second cycle had started that we stopped.\n\nAGoT I now own every card for. It really was quite easy getting the old packs, some my FLGS got for me and rest I got on ebay and miniature market.\n\nSo for the best core set experience get the AGoT core set box and if you want to expand I would start with the House expansions as they are the best investment, Lannister is only one not out yet and will likely I am guessing be out later this year."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471315","commentId":471315,"userName":"Mestrahd","timestamp":1305803608,"content":"Thanks guys. It sounds like AGOT is ahead so far. Which expansions or cycles do you deem \"necessary\"? You mentioned House specific packs? Are they labeled as such in the product description?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471361","commentId":471361,"userName":"Toqtamish","timestamp":1305809400,"content":"It really depends on what house you want, what kinds of decks you wanna build etc. as to what packs to get. The cycles since Brotherhood without Banners cycle are all 3 of each card so they are good investments. Ones prior to that were the older LCG pack model but may see reprinting down the road like they are doing with Cthulhu's older packs, maybe.\n\nThe House boxes are the big deluxe expansions each of which focuses on one of the Houses, Kings of the Sea Revised(introduced Greyjoy to the LCG enviroment), Princes of the Sun revised(introduced Martell to the LCG enviroment), Lords of Winter(Stark expansion), Kings of the Storm(Baratheon expansion), Queen of Dragons(Targaryen expansion). Kings of the Sea and Princes of the Sun come with new play format rules and the others come with two deck lists and how to play with them and the Targaryen one also has the rules for shadow cards. You can also download all the rules on the AGoT support page."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471469","commentId":471469,"userName":"Arma virumque2","timestamp":1305824217,"content":"I also like AGOT better than WI.  Here are a couple more points to think about:\n\n1) If you think you might want to play a game with more than 2 players, AGOT is the only way to go.\n\n2) The AGOT learning curve is steeper than WI, in several ways:  The gameplay is more complex (and the FAQ is larger).  The cards in the core set are all singletons, so it takes many games to become familiar with all the cards in your deck.  And there are more expansions available.\n\nPersonally, I recommend AGOT for experienced CCG players, people who want multiplayer, and people who want to be devoted to their LCG.  WI might be a better choice for less experienced players and people who just want a core set to throw on the table once in a while."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471487","commentId":471487,"userName":"Toqtamish","timestamp":1305826166,"content":"1 thing some cards in AGoT are in multiple copies 2 or 3 copies. Most unique cards people only use 1 of anyway in even most competitive decks. We played for a few months with just the core set with 3 to 4 players and it was great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471522","commentId":471522,"userName":"sputang","timestamp":1305832896,"content":"As a recent fan of the LotR CCG, I was actually going to ask the original poster's same question and was really looking at AGoT.  However, among my group, I will most likely be the only one purchasing the game and will treat try to pull it out on board game night every now and then.  With this in mind, besides the core set, what deluxe set would be most varied to have 4 pre constructed decks ready whenever I'd like to bring this out?  And is this even good for this style of play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471550","commentId":471550,"userName":"Toqtamish","timestamp":1305839822,"content":"Each of the deluxe expansions focuses on one of the Houses but each gives you cards to add to the core set and make full size decks. However, playing with just the core set is fine and works well. I was the only one in my group getting it but I got others hooked into it quite easily. Now is an even better time as the HBO show is really getting people excited for it. The core set has 4 pre constructed decks in it ready to use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471551","commentId":471551,"userName":"Mestrahd","timestamp":1305840236,"content":"Arma virumque said:\n\nI also like AGOT better than WI.  Here are a couple more points to think about:\n\n1) If you think you might want to play a game with more than 2 players, AGOT is the only way to go.\n\n2) The AGOT learning curve is steeper than WI, in several ways:  The gameplay is more complex (and the FAQ is larger).  The cards in the core set are all singletons, so it takes many games to become familiar with all the cards in your deck.  And there are more expansions available.\n\nPersonally, I recommend AGOT for experienced CCG players, people who want multiplayer, and people who want to be devoted to their LCG.  WI might be a better choice for less experienced players and people who just want a core set to throw on the table once in a while.\n\n\n\nArma virumque said:\n\nI also like AGOT better than WI.  Here are a couple more points to think about:\n\n1) If you think you might want to play a game with more than 2 players, AGOT is the only way to go.\n\n2) The AGOT learning curve is steeper than WI, in several ways:  The gameplay is more complex (and the FAQ is larger).  The cards in the core set are all singletons, so it takes many games to become familiar with all the cards in your deck.  And there are more expansions available.\n\nPersonally, I recommend AGOT for experienced CCG players, people who want multiplayer, and people who want to be devoted to their LCG.  WI might be a better choice for less experienced players and people who just want a core set to throw on the table once in a while.\n\n\n\nThank you for the further points. I have to compare the two games now.\n\n1) I don't see a time where I would ever have more than 2 players, so does AGOT begin to pale in that regard vs WI? Which is a better straight-up 2 person game?\n\nAs for your recommendations, I am an experienced CCG player, but I do not care about 3+ player capability, and I'm already \"devoted\" to at least 2 other games at the moment. So would you recommend Warhammer at that point? I plan on asking my friend's opinion on both games too, and that will carry a lot of weight, but as I said, good reviews always help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471567","commentId":471567,"userName":"Carnivean","timestamp":1305842387,"content":"I think the 3+ thing is more just if your group is that dynamic.  AGOT is great with 2-4, no dramas at all.  WI doesn't seemed as well designed as AGOT when talking 3 or more players.  What you will find is that some cards have an effect that scales meaning it is definitely more effective in a 4-player game.  You will likely end up with a deck built for 4-player Melee games in case people want to have a go at that level and a 2-player Joust deck which you use most of the time.\n\nThe different game types can be fun as well, so that can offer a break from standard game.\n\nIn our group now we are finding the following happens . . . AGOT at 2 players, then AGOT or LOTR as more players turn up depending on what people what to do.  WI seems to get pushed to the side more often than not.  WI got played a little pre-LOTR, but since then not much at all.\n\nThe Core Set really is great though for AGOT."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471591","commentId":471591,"userName":"Arma virumque2","timestamp":1305848345,"content":"Mestrahd said:\n\n \n\n \n\nThank you for the further points. I have to compare the two games now.\n\n1) I don't see a time where I would ever have more than 2 players, so does AGOT begin to pale in that regard vs WI? Which is a better straight-up 2 person game?\n\nAs for your recommendations, I am an experienced CCG player, but I do not care about 3+ player capability, and I'm already \"devoted\" to at least 2 other games at the moment. So would you recommend Warhammer at that point? I plan on asking my friend's opinion on both games too, and that will carry a lot of weight, but as I said, good reviews always help.\n\n \n\n \n\nAGOT's a fantastic game for 2 players, so no worries there.  However, there are a small number of cards in the core set that are pretty lame in 2-player matches; you'll figure out which ones they are pretty soon, and swap them out for other cards.\n\nThere's no easy answer to your other question, about whether Warhammer would be better for you because you're \"devoted\" to 2 other games (which I assume means that you would play AGOT/Warhammer only sporadically).  Let me share one observation that may help:\n\nIn my opinion, there's more tactical depth in AGOT.  What I mean is that it's very hard to win AGOT, even with a great deck, if you make poor tactical decisions during play.  By comparison, about 50% of my Warhammer games seem to run on autopilot -- my deck/strategy vs. the opponent's deck/strategy, with only a few key tactical decisions each game.\n\nThe flip side of the tactical depth is that AGOT creates more \"brain burn\" for casual players:  The tactical decision trees can be overwhelming, and lead to analysis paralysis.  With experience, of course, this isn't as big a problem.\n\nI hope that helps.  I'm a sporadic player myself, and would definitely choose AGOT over Warhammer if given a choice.  Unfortunately the only person I can make time to play with doesn't own AGOT cards, so I haven't played it in over a year.  I miss it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471592","commentId":471592,"userName":"Arma virumque2","timestamp":1305848973,"content":"Arma virumque said:\n\n \n\nIn my opinion, there's more tactical depth in AGOT.  What I mean is that it's very hard to win AGOT, even with a great deck, if you make poor tactical decisions during play.  By comparison, about 50% of my Warhammer games seem to run on autopilot -- my deck/strategy vs. the opponent's deck/strategy, with only a few key tactical decisions each game.\n\n \n\n \n\nIs it self-centered to quote yourself in a post?  gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nI want to add one clarification:  I was referring to my experience with constructed decks, not the core set.  I didn't play too many games with just the core sets, but I have a vague memory that perhaps this generalization doesn't hold true in that instance.  I'd be interested to hear a second opinion from somebody like Toqtamish who said that he played extensively with just the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471602","commentId":471602,"userName":"TheLightdarker","timestamp":1305852757,"content":"This may be far too vague of a question to ask (or demand too long of an answer to bother responding to), but having no experience with the other LCGs, just how similar are all of them (considering that Nate French also designed CoC and aGoT)?  From what I've read, there seem to be quite a few mechanics that they share, but just how alike are these games?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471614","commentId":471614,"userName":"Mestrahd","timestamp":1305855321,"content":"@Lightdarker - Having just watched all the tutorial videos, with no actual gameplay, they all look quite different from each other. Of course they are dramatically different than LOTR being pvp games, but I think the variety between them is impressive too. Maybe someone else could clarify further?\n\n@Arma - Your response was great! Now I hope my friend agrees with AGOT, because that's where I'm leaning now. And you're right about my devoted comment, with AGOT only acting as \"filler\" between releases (LOTR mostly, because my other 3 games are \"dead\"). Now that I think about it, it might be better to have a pvp game that scales with more people, just in case. I already have several 2 player only games and nothing that accomodates more except LOTR which I just got a month ago. As for \"brain burn\", I don't mind that because it feels like you've accomplished something at the end. We used to get that occasionally playing Vs, and those games tended to be more fun than the autopilots."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471823","commentId":471823,"userName":"Arma virumque2","timestamp":1305886860,"content":"Lightdarker said:\n\nThis may be far too vague of a question to ask (or demand too long of an answer to bother responding to), but having no experience with the other LCGs, just how similar are all of them (considering that Nate French also designed CoC and aGoT)?  From what I've read, there seem to be quite a few mechanics that they share, but just how alike are these games?\n\n\n\nI haven't played COC, so I can't comment on that.\n\nAGOT feels similar to LOTR in some of the mechanics, such as exhausting a character to attack or defend (so you can't do both with the same character).  (Of course, that particular mechanic is shared by other CCGs as well.)  In addition, AGOT and LOTR both have detailed turn sequences, with many phases.  But as you would expect, AGOT has nothing remotely similar to the encounter deck or any of the mechanics that set up your opposition in LOTR.\n\nThe biggest similarity, I think, is in the card templating.  Examples include the bold text in front of an action that specifies (sometimes) if an action can only be performed during certain phases (i.e., \"Quest Action:\"), or if an action can only be triggered as a response (\"Response:\").  In addition, there are some concepts that travel well from game to game, such as the difference between \"played\" and \"put into play.\"\n\nWarhammer, on the other hand, is quite different.  There's no kneeling to attack or defend.  And instead of having defined \"Response\" triggers, Warhammer uses a Last-in-First-Out stack (similar to Magic), where any action can be played as a response to almost any other action, but resolve first.  (I happen to really dislike this mechanic.)  Plus, the card template allows for restricting actions to certain zones of play but not certain phases of the game.  (Warhammer fans are still waiting for a thorough, comprehensive turn sequence.)  In my completely uninformed opinion, it appears that a fair amount of designer effort since the game's release has gone into clarifying these mechanics, or into clarifying cards because the templating language for describing the game's concepts isn't as well defined.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471831","commentId":471831,"userName":"Arma virumque2","timestamp":1305887808,"content":"(Boy, I haven't done this much posting in months!)\n\nOne other difference:  The AGOT forums are generally filled with thoughtful, reasonable discussions, and the people I've met at tournaments have all been kind and generous.  It's an outstanding group of players.  I've never been to a Warhammer tournament, and I'm sure there are lots of kind, generous Warhammer players too, but the online forums have a higher level of snarkiness and rude behavior.  I enjoy reading the AGOT forums for fun, just like I enjoy the LOTR forums, but I don't get any enjoyment from reading the Warhammer forums.\n\nI don't mean to give anyone the impression that Warhammer is a bad game.  It's not!  As I said earlier, I play it nearly every week, simply because that's the game my friend owns, and I have a good time.  But if I could magically change all my friend's cards into AGOT cards, I would.\n\nAs always, this is just one guy's opinion.  Your mileage may vary."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=471841","commentId":471841,"userName":"Toqtamish","timestamp":1305888719,"content":"AGoT has a great community of which I am glad to be part of. Warhammer on the other hand the forum used to be great in the start but it devolved pretty quickly. I have been to the Canadian regionals for Warhammer and if you are not playing Orc rush you might as well have just auto lost I came in 5th with my Dark Elf deck, we have not touched the game since then and that was over a year ago now. I have taught friends both games and they always say I like AGoT better. Not to say W:I is bad it is just for them and me that AGoT is better between the two.\n\nAGoT on the other hand is my main game and the one I push a lot of. It is fun, tactical, and I have 10 different decks for it. Plus I enjoy a game where you can support your faction kinda like L5R."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=472793","commentId":472793,"userName":"Mestrahd","timestamp":1306093558,"content":"I tried some demo decks for AGOT and it seems like once you get a lead, it's very hard to catch up. It kind of rolls downhill. Any of the challenges is potentially helpful either by board control, hand control, or gaining power. And I'm not sure I like the way initiative is determined. It seems the person that goes first is usually going to make headway. It's entirely possible I'm playing something wrong as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=472981","commentId":472981,"userName":"Toqtamish","timestamp":1306136209,"content":"Sounds like you might be. AGoT can go back and forth very quickly between two players. It does take a bit to get used to so it might just be because you are new at it. Come on over to the AGoT forums and can talk over there and ask questions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=473253","commentId":473253,"userName":"Arma virumque2","timestamp":1306160176,"content":"Mestrahd said:\n\nI tried some demo decks for AGOT and it seems like once you get a lead, it's very hard to catch up. It kind of rolls downhill. Any of the challenges is potentially helpful either by board control, hand control, or gaining power. And I'm not sure I like the way initiative is determined. It seems the person that goes first is usually going to make headway. It's entirely possible I'm playing something wrong as well.\n\n\n\nI had the same feeling about the core set decks, in 2-player.  The problem's not as bad with 3-4 players (because the losers will gang up on the leader), and it's not as bad with constructed decks (because there are some very effective control possibilities).\n\nI agree with Toqtamish -- now that you've tried the game, the guys over in the AGOT forums would love to discuss pros and cons."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=473380","commentId":473380,"userName":"Mestrahd","timestamp":1306169365,"content":"Ok. I'll start a thread today. The question now is, which subforum? There's like 80 for AGOT."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=473384","commentId":473384,"userName":"Toqtamish","timestamp":1306169428,"content":"I would like to see the same sub forums here. General is fine for most things. Each forum has a specific purpose over there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=473387","commentId":473387,"userName":"Soulbearer73","timestamp":1306169513,"content":"I'm going to throw in my 2 copper on this discussion.\n\nLet me start by saying that I have NOT played AGoT or CoC yet, but both looked very interesting once I discovered FFG's LCGs.\n\nI started with WI first mainly because LotR was not out yet.  I had a tough decision on which one to start with but landed on WI.  I and my friends have played WI a lot and we feel that it reminds us a lot of what Magic the Gathering felt like except with better play mechanics and no blind purchasing with booster packs like MTG was.  We feel that WI is a very quick game to learn and was tested on my daughter who has never played any card games like Magic or the like etc.\n\nWe also play LotR's a lot and we really like this game a lot but because it is new we find ourselves asking lots of questions about terminology and such, but overall the game is a lot of fun.  We have not been so concerned with the whole Core Set and playing more than two players with one core set.  While have a second core set will have some advantage, I feel like I would be wasting money because I would get all the quests and their respective deck cards all over again with no real purpose or need for them and paying the money just to get more of the cards for the player decks seem pointless unless you plan to play at tournaments or leagues which we will never do as we just enjoy playing as a group of friends.\n\nAs for the LCG's I do not have yet, I have always felt that AGoT was going to be the last one I was planning on buying and really have been wanting to try CoC more.  After reading the other players comments on how AGoT's plays etc it is still last on my list as it seems it will take much more time to learn and would really seem to need 4 players as opposed to the other ones.\n\nDon't get me wrong AGoT sounds like a lot of fun but we are still learning the other ones and that one may have to wait a bit before I consider buying it at this time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=473461","commentId":473461,"userName":"Arma virumque2","timestamp":1306176846,"content":"Mestrahd said:\n\nOk. I'll start a thread today. The question now is, which subforum? There's like 80 for AGOT.\n\n\n\nThe General Discussion forum is a fine place.  Or the bottom of the main forum page (for uncategorized threads) looks like it's getting a lot of attention these days."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=473627","commentId":473627,"userName":"Ratatoskr","timestamp":1306206340,"content":"Soulbearer73 said:\n\nAfter reading the other players comments on how AGoT's plays etc it is still last on my list as it seems it will take much more time to learn and would really seem to need 4 players as opposed to the other ones.\n\n\n\n \n\nHaving only ever played AGoT out of the LCG's, I can't really compare its learning curve to the others. I feel the need to correct what I think is a severe misconception regarding the 4 players thing, though. You do not need to have 4 players for AGoT at all, regardless of the kind of card pool you have at your disposal. AGoT plays great as a 2 player game. In fact, I personally prefer the 2 player variant (\"joust\") to the multiplayer variant (\"melee\"), and so do most players I know. Both variants play differently, but both are definitely very viable,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47010-ot-ffgs-other-lcgs/?do=findComment&comment=473706","commentId":473706,"userName":"jormungandr","timestamp":1306220092,"content":"I have played and bought CoC quite intensively for a while, but I'm ultimately disappointed by the game. It's just too much calculation, there are no valid scissors>paper>stone deckmechanics (in non coop games i'm 110% boromir) and FFG is joking around with the bannedlist too much.  "}]}