{"url":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/","title":"Location Overload in the staging area - Strategy ideas?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=471713","commentId":471713,"userName":"pumpkin","timestamp":1305871684,"content":" \n\nBeen trying out my Lore/Lore/Tactics deck on the first scenario and it is handling pretty well unless I get location overload in the staging area, because it then ends up in a vicious circle with insufficent willpower Vs threat to get progress, so the active location can't be completed, so a new location can't be moved out of the staging area and pretty soon afterwards its death by threat.\n\nI'm sure we have all been there.\n\nThere are some obvious cards that can help here, Northern Tracker and Legolas, but It's a Lore/Tactic deck and I'm wanting to use Gimli for his hitting power combined with healing/questing of Lore.\n\nAnyone found any clever methods of keeping locations down without using Northern Tracker?\n\nI was experimenting with using the encounter card viewing capabilities of Denethor and Riversong, to try and limit pulling new locations into staging until I was ready for them, but that was met with mixed success.\n\nI don't have blade of Gondolin in the deck at the moment and perhaps thats the missing critical point? Might swap a few cards about tonight and give that a go.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=471733","commentId":471733,"userName":"sWhiteboy","timestamp":1305875106,"content":"Neither Lore nor Tactics effectively deal with locations in the staging area.  You want to use Gimli for damage (which works fine in a duo game where someone else handles locations), but in a solo Lore/Tactics deck, your best bet is to run Legolas over Gimli.  This will allow faster progress, and slightly lower your beginning threat.  I don't know what else you are running but:\n\nSince you only have 1 Tactics Hero, running Citadel Plate is crazy.  Dwarven Axe is \"ehh\" without a Dwarf (maybe run 1-2 copies).  2-3 Blade of Gondolin should be an auto-include.  You might as well include 1 Horn of Gondor (it speeds up resource generation, and 1 copy won't leave your deck with useless copies of a unique).  2-3 Feint is an auto-include.\n\nOn the Lore side, running Daughter of the Nimrodel AND Self-Preservation is redundant.  Run DotN over Self-Preservation.  1-2 Henemarth Riversong is good for a 1-cost Ally.  You might want to run Secret Path since you are having trouble with locations (I normally wouldn't run it).  2-3 Forest Snare is awesome.\n\nSo, those are the cards I would use to deal with the locations and creatures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=471753","commentId":471753,"userName":"pumpkin","timestamp":1305877163,"content":"Yer, one of the reasons I was running Gimli is that in the back of my mind I was wanting to take the deck forward against the second scenario so I was already planning how to take on the Hill Troll, so I was constructing a deck good enough to get through the first scenario (which to be fair \"most\" decks should do) if not an ideal deck for the first scenario. I wonder if this might be an impossible dream though, at this stage, with so few card choices, and deck constructon really does need to be based specifically on the scenario attempted.\n\nNot running Citadel plate or Dwarven Axe for reasons you describe, but I am missing BoG and think that could be the key. Just overlooked it for some reason (I think because I had also dismissed Legolas, and in my mind they go hand in hand!)\n\nI am running DoN and Self Preservation, so that's worth a swap out, certainly, although changing Lore cards for Tactics will make the deck heavy for a single resource sphere. HoG can help there though, certainly. I already pack a couple in the deck because PoL can be used to get rid of useless uniques."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=471830","commentId":471830,"userName":"avgzxc","timestamp":1305887713,"content":"Play quest pumps and Legolas. (9) Legolas > (11) Gimli. 2 less threat = 2 more cards and 6 more resources before Troll comes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497184","commentId":497184,"userName":"Shelfwear","timestamp":1310198528,"content":"I'm trying a solo tactic/lore/lore deck now and had the same problem - more than 1-2 locations in the staging area tend to be a real problem.\n\nI play with Legolas (Attacking+progress tokens), Denethor (Defender) and Glorfindel (Questing+Healing) for a starting thread of 29\n\nI try to compensate the exploring weakness of tactics/lore with:\n\nProtector of Lorien on Glorindel and dumb cards (gotten via card drawing abilities of Lore, multiple of the same uniques and even attachments when I have Erebor Hammersmith on hand to retrieve that attachment afterwards)\n\nBlade of Gondolin on Legolas - its a no brainer\n\nSeveral Secret Path in case of emergency\n\nLots of cheapish Lore creatures with Willpower which I use for aditional questing when I know that's not dangerous during that turn (peek on encounter deck via Denethor or Henemarth Riversong). I use Erebor Hammersmith, Gleowine, Henemarth and Daughter of Nimrodel in this case.\n\nAdditionally, I only use Tactic cards with a cost of 1 or 2 as there are no real ressource generators in Tactics/Lore. I added two Horns of Gondor for Legolas for extra Tactic resources.\n\nIn contrast to the other posters I have included two dwarven axes as I have many dwarves in my deck: Erebor Hammersmith, Veteran Axehand and Miner of the Iron Hills, one of them equiped with an axe plus Legolas kill most of the enemies in one phase after Denethor blocked them.\n\nThe deck is slow, it need a bit time to develop but when you have a couple of attachments out plus henemarth as a spy you're safe from most enemies.\n\nThe \"Hunt for Gollum\" add-on will include Striders Path which acts as an emergency card against locations whith high thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497207","commentId":497207,"userName":"Mestrahd","timestamp":1310204509,"content":"Shelfwear, that looks like a good plan! I got 2 good ideas just from that post.\n\nDiscarding attachments to POL when you have Erebor in hand. I knew he was more useful than just reactionary.\n\nUsing Dwarven Axe on a non-hero! I had never really considered this before, it opens up a lot of Dwarves to put it on..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497214","commentId":497214,"userName":"Shelfwear","timestamp":1310205262,"content":"Bugger, just realized that you can attach the dwarven axe only to a hero. Well, that rules out that combo :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497215","commentId":497215,"userName":"Mestrahd","timestamp":1310205436,"content":"Haha. That could be why I hadn't considered it before!\n\nYour other proactive use of Erebor still has merit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497258","commentId":497258,"userName":"ArachneJericho","timestamp":1310212556,"content":"This thread is starting to make me think that three-sphere decks are the way to go for scenario 2. Each sphere specializes in important things the others don't, so lacking one sphere will give you several weaknesses (such as not being able to deal with locations effectively).\n\nIn multiplayer games, you can definitely have two-sphere decks, as it's likely you'll have three or even all four spheres covered. But in solo mode, with single- or merely two-sphere decks? The game is much harder. Which isn't necessarily a bad thing, but it is interesting that something seemingly resource-ineffective (a single hero per sphere) would yield, but given that resources accumulate over multiple turns, it's not necessarily a bad thing to have a few high-cost cards in such decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497266","commentId":497266,"userName":"servant of the secret fire","timestamp":1310213158,"content":"ArachneJericho said:\n\nThis thread is starting to make me think that three-sphere decks are the way to go for scenario 2. Each sphere specializes in important things the others don't, so lacking one sphere will give you several weaknesses (such as not being able to deal with locations effectively).\n\n\n\nYou don't need a three sphere deck to win scenario 2.A 2 sphere (lore/spirit or leadership/spirit ) deck can do the job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497271","commentId":497271,"userName":"Shelfwear","timestamp":1310213692,"content":"I agree that with the card pool of the core set dual-sphere decks are not really suited for solo play, there arent just enough cross-sphere cards. I guess FFG will publish more songs (like Song of Kings) in the future that will yield resource icons from all 4 spheres.\n\nAnd I'm not sure about the solo playablity of LotR LCG, bc you can have a decent deck but completely fail at some quest specific mechanics bc it maybe demands something the spheres you have chosen cant deliver.\n\nFor example like Tactics/Lore in quest 2: I rather easily kill the Troll but once I start boating down the Anduin I really cant manage the 16 Progress token requirement with 3 encounter cards drawn each turn - my deck is just too weak explorationwise..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497283","commentId":497283,"userName":"Bindlespin","timestamp":1310215752,"content":"I am using a quasi-four sphere deck w/ Aragorn, Beravor, and Legolas. I have two copies of Celebrian's Stone and I use Protector of Lorien so I include some cards from the Spirit sphere even w/o any Spirit heroes. If I can get Celebrian's stone out then I can use Unexpected Courage, Northern Tracker, Strength of Will and The Galadhrim's Greeting.  If not then I can discard them to pump Protector of Lorien to smash through locations in the quest phase. Once I make it past the Hill troll I usually all right ( usually with Feint until I can get a Forest Snare on him), but with some unlucky draws the threat can pile up pretty quick. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497285","commentId":497285,"userName":"Bohemond2","timestamp":1310216230,"content":"Pumpkin, hang in there for Strider's Path in Hunt for Gollum.  it's a lore card that will help you tack some of the tougher locations as soon as they hit the table."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497327","commentId":497327,"userName":"ArachneJericho","timestamp":1310224451,"content":"servant of the secret fire said:\n\nYou don't need a three sphere deck to win scenario 2.A 2 sphere (lore/spirit or leadership/spirit ) deck can do the job.\n\nI didn't say it was impossible; I just said it was harder. Although using Spirit (and Eowyn) in this scenario is key, whether you have two or three spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47071-location-overload-in-the-staging-area-strategy-ideas/?do=findComment&comment=497354","commentId":497354,"userName":"servant of the secret fire","timestamp":1310232376,"content":"ArachneJericho said:\n\nAlthough using Spirit (and Eowyn) in this scenario is key, whether you have two or three spheres.\n\n\n\nYes, this is true."}]}