{"url":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/","title":"tactics/Spirit Deck thoughts. ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472485","commentId":472485,"userName":"Casamyr","timestamp":1306029400,"content":"This is my first LCG, though I did play magic way back when it first came out, but deck building hasn't been my greatest strength. I just wanted to share with the community this and gets thoughts. I'll try and explain some of my choices here. I guess the biggest thing is that this is made off one core set (the game is still to release in New Zealand and my wife won't let me purchase a new set).\n\nSo without further ado.\n\nHeroes (starting threat 29):\n\nGimli; Legolas: Eowyn.\n\nAllies:\n\nGandalf x3; Gondorian Spearmen x3; Horseback Archer x  2; Veteran Axehand x 3; Lorian Guide x 3, Beorn x 1\n\nAttachments:\n\nBlade of Gondolin x 2; Citadel Plate x 2; Dwarven Axe x 2; Horn of Gondor x 2; Favor of the Lady x 2, Unexpected Courage x 1\n\nEvents:\n\nSwift Strike x 1; Feint x 2; Quick Strike x 2; Rain of Arrows x 2; Blade Mastery x 3; Test of Will x 2; Dwarven Tomb x 1; Hasty Stroke x 2; Strength of Will x 2; The Galadhrim's Greeting x 2; Will of West x 2; Stand and Fight x 3\n\n \n\nThere are a few cards I would swap out if I could in order to beef up other cards (3x Dwarven Tomb for instance, or 3x Swift strike for the Spearmen).\n\n \n\nThe idea for this deck is to totally control the staging area/engagements through events. My thought with Allies is to use them (excepting Lorian Guide) as damage takers, while Gimli and Legolas go to town and should be killing an enemy each turn with 3 progress counters going onto the quest just Legolas' ability + BoG. Will of the West is then used to cycle allies back into your deck once you start getting low.\n\nEowyn with 2 Favour of the lady on her will have an effect Will of 6 (+ 1 for her discard) and Lorian Guide (+1 progress on Active Location when questing should be enough to quest effectively each round. You should be drawing out enemies in the Engagement phase to blitz with L & G.\n\nGimli used with Quickstrike should be able to kill an enemy (generally a big nasty) before they can attack, especially with the Dwarven axe, Citadel Plate and a few wounds should kill anything, or use with Legolas if you can kill it and get the Progress tokens would be preferable.\n\nI am tempted to swap out the Horseback Archers for Wandering Took Primarily for Strength of Will to Blitz through Locations even quicker, which would also mean getting rid of Rain of Arrows (tempted to anyway as there shouldn't really be a large number of enemies engaging you)\n\n \n\nSo thoughts anyone.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472560","commentId":472560,"userName":"lleimmoen","timestamp":1306050387,"content":" \n\n \n\n \n\nHello. I'll try. First though, are you totally sure about Tactics/Spirit? Off the 6 dual coloured decks, I find this probably the least fit. This is only based on a month of playing the game but still, are you sure, is it a personal thing, or would you be willing to switch to a different combination?\n\nAssuming you want to stick to this one, I can tell you what I'd do. It may be very wrong, of course. All my opinions, only.\n\nHeroes: Dunhere is much better than Eowyn but I see you need someone to quest. This is one of the reason why I think other combinations are better. Dunhere is the best Tactics hero but he is not a quester, thus it is better to combine Spirit with those who are. Ayways. Gimli seems super strong at first, I used to play him a lot. He is worse than he seems. Tends to die when there you have no way to heal - as you do not in this kind of deck.\n\nAllies: Northern Tracker! Way better than Lorien Guide. Locations tend to accumulate in the staging area, unless they don't and that's not lucky either. It is better not to travel to them and get rid of them via NT. And Legolas can make progress directly. Why Horseback Archer? Are you playing coop? Cause otherwise he is quite useless. I am not a big fan of the Axehand either. You can even do better with the Fool of a Took, the ability is useless when playing solo but for the cost of two you get 1/1/1 - not too bad.\n\nEvents: Yes, get rid of Rain of Arrows, was useless for me.\n\nBottom line: buy another set (or two). It will help a great deal: Beorn, Northern Tracker, Feint, Swift Strike, Dwarven Tomb, A Test of Will, Hasty Stroke. etc. (I think the last two are there only twice in the core, are they not?). Talk to your wife! Don't spend on more useless things.\n\nGood Luck!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472618","commentId":472618,"userName":"Titan","timestamp":1306062014,"content":"The first two sphere deck I built was very similar to this. It breezed through the introductory scenario, but got hammered going down the Anduin. It won't draw extra cards because of the lack of lore and won't build up resources very quickly because there's no leadership. All of that makes it too slow, in my opinion. It is very difficult to make real good two sphere decks with one core set because you don't have enough of the better cards, you are forced to swap in the less useful ones.  \n\nTry it, nothing to lose by doing so, but you should be prepared to make major changes. In theory, tactics and spirit should go hand in hand because one's weakness is the other's strength. But in my experience, this did not work too well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472692","commentId":472692,"userName":"Casamyr","timestamp":1306073783,"content":"Titan said:\n\nAll of that makes it too slow, in my opinion. It is very difficult to make real good two sphere decks with one core set because you don't have enough of the better cards, you are forced to swap in the less useful ones.  \n\n\n\n\nYeah, that's what I've found. There are a lot of cards in there that I wouldn't use had I had the choice. Based on experience of looking at other FFG LCGs here in NZ, they're around NZ$75-80 for the core set which is a little too expensive for me to consider buying more than one. I actually imported my coreset from the US since it still isn't even released here and no date is set yet which ties my hands.\n\nI'll most likely be buying the Adventure Packs from the States as well.\n\nThanks for the thoughts guys, I'll certainly keep it in the back of my mind. I tried out the the first quest (blitzed it in 4 rounds - primarily because Beorn's Path was to kill Ungoliant's Spawn rather than generate progress tokens, but ran out of time to try the Down the Anduin. I'll give it a go this afternoon and see what happens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472718","commentId":472718,"userName":"conykchameleon","timestamp":1306077339,"content":"I played a deck similar to this and I think you'll have quite a bit of trouble clearing scenario 2 or 3 with this one. The deck that I went to from this one is posted around here somewhere with Eowyn, Dunhere, and Legolas. It has the same kind of interactivty that I'm assuming you're looking for in Tactic/Spirit, but is better able to utilize the incredibly capabilities of Spirit to achieve a higher level of playability than Tactics/Spirit.\n\n \n\nHere's the link to the decklist if you're interested:\n\n \n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=487438&efpag=0#488474 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=487438&efpag=0#488474]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472835","commentId":472835,"userName":"DrNate","timestamp":1306102114,"content":"I also have a GimEowLeg deck. These are my three favorite heroes because I liked the characters in the novels. But right now it is getting beaten relentlessly every time I play against the Anduin. It's 55 cards, but I have no idea which 5 cards to drop...\n\n2 Beorn, 3 Blade of Gondolin, 3 Citadel Plate, 3 Feint, 3 Gondorian Spearman, 2 Horn of Gondor, 3 Swift Strike, 3 Veteran Axehand, 3 Dwarven Axe, 3 Horseback Archer, and 2 Swift Strike\n\n2 Dwarven Tomb, 3 Galadhrim's Greeting, 3 Stand and Fight, 3 Will of the West, 3 Northern Tracker, 2 Unexpected Courage, 3 Wandering Took, and 3 Favor of the Lady\n\nAnd let us never forget 3 Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472848","commentId":472848,"userName":"Hahma","timestamp":1306103725,"content":"I only have the one core set ( I gave my second, unopened one to my nephew yesterday to let him get some experience with it before we co-op again), so I finally tried to build a deck as I got through the first scenario with all the base spheres except Tactics. I was tired of getting smoked with the Tactics only deck, so I tried my hand at a Spirit/Tactics deck.\n\n \n\nI had Gimli, Eowyn and Dunhere as my heroes.\n\nI had Gandalf x2\n\nAll of base Spirit Sphere deck.\n\nFrom Tactics I used:\n\nBlade of Gondolin x2\nDwarven Axe x2\nCitadel Plate x2\nHorn of Gondor x1\nStand Together x1\nBlade Mastery x3\nSwift Strike x1\nGondorian Spearmen x3\nFeint x2\nQuick Strike x2\n \n\nI only drew Blade of Gondolin and Citadel Plate from my deck for Tactics and attached them to Gimli.\n\nNorthern Tracker helped a lot as did Gandalf and then getting him back with Stand And Fight. I had some decent luck, but The Galadrin's Greetings and Gandalf (second time) were very helpful in reducing my threat.  It was fun and I'll try it again before moving to scenario 2 for the first time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=472952","commentId":472952,"userName":"jhaelen","timestamp":1306130140,"content":"lleimmoen said:\n\n \n\nHello. I'll try. First though, are you totally sure about Tactics/Spirit? Off the 6 dual coloured decks, I find this probably the least fit.\n\nI think Tactics/Lore is even worse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=473035","commentId":473035,"userName":"lleimmoen","timestamp":1306142782,"content":"DrNate said:\n\nI also have a GimEowLeg deck. These are my three favorite heroes because I liked the characters in the novels. But right now it is getting beaten relentlessly every time I play against the Anduin. It's 55 cards, but I have no idea which 5 cards to drop...\n\n2 Beorn, 3 Blade of Gondolin, 3 Citadel Plate, 3 Feint, 3 Gondorian Spearman, 2 Horn of Gondor, 3 Swift Strike, 3 Veteran Axehand, 3 Dwarven Axe, 3 Horseback Archer, and 2 Swift Strike\n\n2 Dwarven Tomb, 3 Galadhrim's Greeting, 3 Stand and Fight, 3 Will of the West, 3 Northern Tracker, 2 Unexpected Courage, 3 Wandering Took, and 3 Favor of the Lady\n\nAnd let us never forget 3 Gandalf.\n\n\n\nDrop the Archers and Axehands. And Will of the West perhaps. Use Quick Strike when using Gimli and Legolas - that should be a great improvement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47149-tacticsspirit-deck-thoughts/?do=findComment&comment=473036","commentId":473036,"userName":"lleimmoen","timestamp":1306142868,"content":"jhaelen said:\n\nlleimmoen said:\n\n \n\n \n\nHello. I'll try. First though, are you totally sure about Tactics/Spirit? Off the 6 dual coloured decks, I find this probably the least fit.\n\nI think Tactics/Lore is even worse.\n\n \n\n\n\nI have Lore (major) Tactics (minor) and it plays very well coop with Leadership Spirit. It may suck in solo game though."}]}