{"url":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/","title":"Sprinting - is it possible?  is it wise?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=474690","commentId":474690,"userName":"BoundForGlory","timestamp":1306341444,"content":"The longer you take to make progress, the more your threat level creeps up.  \n\nOne could build a deck with enormous amounts of Willpower, in an attempt to place a ton of progress tokens early in the game.  You could finish the first quest card without much difficulty, and before your threat is high enough that enemies begin to engage.  But at some point, the enemies will engage you, or else their threat in the staging area will be too great for you to keep up the placing of the progress tokens.\n\nBut assuming you want to build that sprint deck, who would you include?\n\nEowyn 4 WP\n\nGlorfindel 3 WP\n\nAragorn 2 WP + ready for defending if needed\n\nThis deck won't work very well right now, since it is three colors.  Currently, the Stone helps, since it gives WP, and gives Aragorn Spirit, and eventually you will have Song of Kings to give leadership to another hero, and Rivendel Minstrel to help get the song.  Plus, Rivendel Minstrel has great Willpower for her cost.\n\nFavor of the Lady adds WP, too.\n\nWould this work?  Or is it too dangerous to have so many exhausted heroes and allies?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=474698","commentId":474698,"userName":"pwvogt","timestamp":1306342501,"content":" I think it will be viable, but right now, not so much. The key to making this deck work is controlling your threat, which to me means you're going to need a solo Spirit deck. You're right that a three sphere deck is too difficult to build right now, but the other big problem of your three heroes is their very high initial threat rating. You've gotta control that so you can sprint though and keep monsters in the staging area. This, I think, is already a very viable strategy. Next you need to just pick tons of abilities that target things in the staging area, both locations and monsters, so you can clear them out as quickly as possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=474701","commentId":474701,"userName":"servant of the secret fire","timestamp":1306342831,"content":" \n\n \n\nBryon said:\n\n \n\nThe longer you take to make progress, the more your threat level creeps up.  \n\nOne could build a deck with enormous amounts of Willpower, in an attempt to place a ton of progress tokens early in the game.  You could finish the first quest card without much difficulty, and before your threat is high enough that enemies begin to engage.  But at some point, the enemies will engage you, or else their threat in the staging area will be too great for you to keep up the placing of the progress tokens.\n\nBut assuming you want to build that sprint deck, who would you include?\n\nEowyn 4 WP\n\nGlorfindel 3 WP\n\nAragorn 2 WP + ready for defending if needed\n\nThis deck won't work very well right now, since it is three colors.  Currently, the Stone helps, since it gives WP, and gives Aragorn Spirit, and eventually you will have Song of Kings to give leadership to another hero, and Rivendel Minstrel to help get the song.  Plus, Rivendel Minstrel has great Willpower for her cost.\n\nFavor of the Lady adds WP, too.\n\nWould this work?  Or is it too dangerous to have so many exhausted heroes and allies?\n\n \n\n \n\n \n\nThe biggest promblem with this deck is the high starting threat especialy wen you play second scenario.The troll immidiatly engages you and your only defence  is a sneak attack+Gandalf combo.If 2 more enemies are in the staging area then you must restart the game cause this is over."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=474708","commentId":474708,"userName":"richsabre","timestamp":1306344041,"content":"this was basically my main strategy for the first quest, works great given that certain cards come out of the encounter deck, but it goes out of the window when it comes to fighting"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=474748","commentId":474748,"userName":"Titan","timestamp":1306350054,"content":"Starting threat of 33? Ugh, I wouldn't try that in the Anduin. I completely disagree though, that a tri-sphere deck doesn't work very well. My best deck is Theodred, Beravor, Eowyn. It works very well. It draws lots of cards and can collect resources to pay for them fairly well. It has passed the Anduin scenario several times and even nearly passed Dol Guldur, something no other decks I've tried has managed to even come close to doing. I've also gotten some good results with Gloin, Glorfindel, Dunhere in Anduin. Even a Gloin, Legolas, Beravor deck with no spirit cards has managed to get through Anduin. For me, tri-sphere is the best, allowing you to pool the best cards from those spheres as opposed to some so-so cards from two spheres.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=474930","commentId":474930,"userName":"Vyron2","timestamp":1306390635,"content":" wow... sounds great... I never tried a tri-sphere deck... maybe I should get on to it... though only with the core set I can imagine that it's difficult paying for resources... except you have theodred...\n\n \n\nwell... the starting threat is kind of high, I guess.... 33 is not good, you don't even have a turn to solidify your forces before the troll... hmmm...\n\n \n\nI guess sprinting per se is good, but I don't think it will be a viable option in scenarios where fighting takes prevalence over questing... e.g. kill a dragon to win the game, etc.... again, coop game, so a combination of both (in 2 decks :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]) is probably the best... solo will always be difficult and I can't imagine a deck in the near future beating all the scenarios consistently... solo that is..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=475045","commentId":475045,"userName":"avgzxc","timestamp":1306403892,"content":"Faramir + Ever Vigilant + ally swarm, Sneak Attack + Gandalf, card drawing + Protector of Lorien.\n\nI'd focus on these 3 combos. Also, lore quest pumps are extreamly cost efficient, so my vote goes to Lore/Leadership easily.\n\nThe quickest way for mass allies + Faramir would be:\n\nDraw ASAP -> Beravor, Gleowine, Valiant Sacrifice\n\nPay ASAP -> Theodred, Gloin, Steward"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=475204","commentId":475204,"userName":"Titan","timestamp":1306418695,"content":"Vyron said:\n\n wow... sounds great... I never tried a tri-sphere deck... maybe I should get on to it... though only with the core set I can imagine that it's difficult paying for resources... except you have theodred...\n\n \n\n\n\n\n \n\nI thought it would be really tricky too, but it has not turned out to be so. The catch is to have mechanisms in place to add resources. Usually Theodred helps Eowyn or himself, depending on what cards I've got in hand. Beravor gets Steward of Gondor. In games with Gloin, I equip him with Self Preservation(one of the most underated combos in the game) I do play him with some calculated risk, some times allowing attacks through to assign the damage to him, then heal him. Fast card drawing is also essential to be able to get all these attachments in place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47349-sprinting-is-it-possible-is-it-wise/?do=findComment&comment=476213","commentId":476213,"userName":"Kitsune Rei","timestamp":1306597779,"content":"Titan said:\n\nIn games with Gloin, I equip him with Self Preservation(one of the most underated combos in the game)\n\nI love this combo too :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}