{"url":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/","title":"Does Thalin&#039;s ability still trigger when an enemy card is revealed via Quest Card 3B &quot;Don&#039;t Leave the Path&quot;?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=474919","commentId":474919,"userName":"mpp7mato","timestamp":1306389022,"content":"Hello all,\n\nHave finally found the chance to sit down and play a couple of starter games.  I have thoroughly read the rules over the past several days and think I've got a pretty good handle on how things work now.\n\nI do have a question though, as titled above: \" Does Thalin's ability still trigger when an enemy card is revealed via Quest Card 3B \"Don't Leave the Path\"?\"\n\nThalins ability reads: \"While Thalin is committed to a quest, deal 1 damage to each enemy as it is revealed by the encounter deck.\"\n\nQuest Card 3B 'Don't Leave the Path' reads:  \"When revealed:  Each player must search the encounter deck and discard pile for 1 Spider card of his choice, and add it to the staging area\".\n\nI'm in the following situation:\n\nI have just successfully quested, placing the necessary travel markers on the quest card and thus proceeding to stage 3B.  I quested with Eowyn, a Wandering Took and Thalin, I have yet to continue to the Travel Phase as I am in the last step of the Quest phase; 'Player actions'.\n\nI have searched and put into play Ungoliant's Spawn from the Encounter Deck and not the Discard Pile, therefore can I deal the 1 damage from Thalin's ability?\n\nThe rulebook on p14 states that 'Characters committed to a Quest are considered committed to that quest through the end of the quest phase, unless removed from the quest by a card effect.\" \n\nAs I'm still in the Quest Phase and Thalin is committed I'm assuming this is a valid course of action, but it would be nice to get a second opinion ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nAny responses would be greatly appreciated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=474944","commentId":474944,"userName":"Vyron2","timestamp":1306391529,"content":" hey!\n\ngood for you, finally playing the game :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] you could go both ways, this is a bit unclear to me, too.\n\nafter putting the progress tokens, the quest phase ends--> revealing new cards because of a new stage is therefore a \"limbo\" phase\n\nthe quest phase includes the progress tokens, as well as arriving at a new stage... --> Thalin counts as committed and deals one damage...\n\n \n\nby logic, I'd take the second option... by intuition the first one... I think Thalin was intended to punish enemies coming out before comparing willpower... thus a new stage is a new quest... therefore new monsters... ah well... faq?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=474955","commentId":474955,"userName":"mpp7mato","timestamp":1306393507,"content":"Hey, cheers for the reply.  I must say I am enjoying this game.  I just got my first win on the Passage Through Mirkwood Scenario and scored a 38 in my solo game! Pretty pleased with that.\n\nAnyway,  with regards to my previous post and your remark to how the 'quest phase ends' when a new stage is reached.  I don't think that's the case.  I've been doing some more reading and on pg22 of the rule book under Quest Advancement it states the following:\n\n\"Players immediately advance to the next stage of a quest as soon as they place a number of progress tokens equal to or greater than the number of quest points the current quest card has.  Additional progress tokens earned against the quest do not carry over to the next stage.  All progress tokens on the quest are returned to the token bank when players advance to the next stage.  Players follow any instructions on the newly revealed quest card as it is revealed.\n\nThe game state of other cards does not change; cards in the staging area remain in the staging area, cards engaged with players remain engaged, exhausted characters remain exhausted, damage tokens and resources remain as they are placed, and the round sequence is NOT interrupted\"\n\nBased on this, and the situation I found myself in, I presume Thalin's ability would be a valid action then.  What do you think?  It seems to make enough sense..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=474956","commentId":474956,"userName":"YGrams","timestamp":1306393809,"content":" Personally, I feel that Thalin wouldn't deal any damage in this situation, based on some subtle wording. His text reads that he deals damage as cards are revealed by the encounter deck, but the card text of \"Don't Leave The Path!\" says that the player adds the Spider card to the staging area. I would interpret it that the encounter deck is not revealing the card as it would usually do, but rather the player is intervening and hence, in a way, is the one doing the revealing.\n\nMaybe I'm trying to read too much into it, but that's how it would seem to work out for me.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=474961","commentId":474961,"userName":"mpp7mato","timestamp":1306394354,"content":"Yeah, the subtle differences in the wording did also cross my mind, particularly the phrase, 'add it to the staging area' ...would be nice to get an official ruling on this.  I'm inclined to agree with you, but are we reading too much into it? hehe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=474977","commentId":474977,"userName":"pumpkin","timestamp":1306396144,"content":"I think the earlier intepretation is correct.\n\nIt is certainly still in the quest phase as this will occur during the resolve questing step or at most during the fnal player action step of the questing phase, so Thalin is certainly still considered to be questing.\n\nI think the subtlety of the wording, although there, probably isn't intended, so i would damage the spiders as they are revealed.\n\nIf the progress toekns had been added in some other phase though, due to Legolas killing an enemy for example, then in that case Thalin's ability certainly wouldn't trigger as he isn't considered to be questing at that point.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=475094","commentId":475094,"userName":"Vyron2","timestamp":1306407719,"content":"pumpkin said:\n\nI think the earlier intepretation is correct.\n\nIt is certainly still in the quest phase as this will occur during the resolve questing step or at most during the fnal player action step of the questing phase, so Thalin is certainly still considered to be questing.\n\nI think the subtlety of the wording, although there, probably isn't intended, so i would damage the spiders as they are revealed.\n\nIf the progress toekns had been added in some other phase though, due to Legolas killing an enemy for example, then in that case Thalin's ability certainly wouldn't trigger as he isn't considered to be questing at that point.\n\n \n\n\n\n \n\nyeah, I agree! that's a very viable interpretation... my mistake on not looking through the rules again... but nevertheless, thalin wouldn't deal damage then..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=475452","commentId":475452,"userName":"mpp7mato","timestamp":1306448502,"content":"Cheers for the replies all, it's always nice to get a second opinion.  I thought it could very well be a valid action, so until otherwise I'll permit this in any games I play.  Have fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=475665","commentId":475665,"userName":"sWhiteboy","timestamp":1306485599,"content":"The subtlety of the card wording almost always matters.\n\nThalin does not do damage to cards added to the Staging Area.\n\n\"Revaled\" and \"added\" should be handed differently.  It's essentially the Encounter deck variations of \"played from hand\" and \"put into play.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/47374-does-thalins-ability-still-trigger-when-an-enemy-card-is-revealed-via-quest-card-3b-dont-leave-the-path/?do=findComment&comment=476216","commentId":476216,"userName":"Kitsune Rei","timestamp":1306598012,"content":"YGrams said:\n\n Personally, I feel that Thalin wouldn't deal any damage in this situation, based on some subtle wording. His text reads that he deals damage as cards are revealed by the encounter deck, but the card text of \"Don't Leave The Path!\" says that the player adds the Spider card to the staging area. I would interpret it that the encounter deck is not revealing the card as it would usually do, but rather the player is intervening and hence, in a way, is the one doing the revealing.\n\nMaybe I'm trying to read too much into it, but that's how it would seem to work out for me.\n\n\n\nAlthough we'd love Thalin to whack everything as it comes in, this is also how we decided it was supposed to be played, based on the \"when revealed\" and \"add\" terminology being different."}]}