{"url":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/","title":"We need a new way of scoring","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=475894","commentId":475894,"userName":"Weeks","timestamp":1306515890,"content":"I really like this game, but there is one problem. There is no real incentive to make progress on a mission in a quick manner. If you can stay at the first questcard for a long time you will get more allies and attachements into play. After a while there is no more encountercards that can hurt you and the game is basically already over. The plus one threat per turn is not enought to counter this type of stalling. Threatreduction with Gandalf and Sneak attack is pretty basic. It is not hard at all to cycle through the deck and get everything in the deck into play and reduce the threat to zero. I have achieved a score of -24 on the Anduin mission playing like that. It took 32 gameturns to beat all the Victory cards. After that two more gameturns to achieve the second and third step of the quest.\n\nTo make the game interesting and challenging there should be an incentive to progress quickly. Counting the number of turns and using that as a score could be a solution. I really hope the genious minds at Fantasy Flight figures something out that is different from the system we have now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=475903","commentId":475903,"userName":"servant of the secret fire","timestamp":1306518092,"content":"Weeks said:\n\nI really like this game, but there is one problem. There is no real incentive to make progress on a mission in a quick manner. If you can stay at the first questcard for a long time you will get more allies and attachements into play. After a while there is no more encountercards that can hurt you and the game is basically already over. The plus one threat per turn is not enought to counter this type of stalling. Threatreduction with Gandalf and Sneak attack is pretty basic. It is not hard at all to cycle through the deck and get everything in the deck into play and reduce the threat to zero. I have achieved a score of -24 on the Anduin mission playing like that. It took 32 gameturns to beat all the Victory cards. After that two more gameturns to achieve the second and third step of the quest.\n\nTo make the game interesting and challenging there should be an incentive to progress quickly. Counting the number of turns and using that as a score could be a solution. I really hope the genious minds at Fantasy Flight figures something out that is different from the system we have now.\n\n\n\nThis is a best case scenario.Play more games with the same deck and you will see that things are not so easy.I play leadership/spirit form the first day and you can only do that with lucky draws and if you have  sneak attack+Gandalf in your hand from the first round.No sneak attack in your hand at the first round and a brown land,a troll and Marsh Adder(and many more combinations) in the staging area and you must restart your game cause you are doomed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=475914","commentId":475914,"userName":"Weeks","timestamp":1306520020,"content":"Well, if the start is to difficult and you lose the game then there is not much to do. And in that case the scoring-system is sort of irrelevant anyway. What I mean is that if you survive the first couple of turns there is nothing preventing you from hanging around the first step of the mission for a lot of extra gameturns just to build up resources and to reduce threat. As the game works now, there is really no need to hurry to the next stage by completeing the first questcard, until you have all your allies and attachements in play. Using Riversongs ability, it is possible to know in advance exactly how much willpower to devote to questing and thereby stalling the game.\n\nThis game is by design easier the longer it takes to finish. An encountercard on the first gameturn is on average equally difficult as an encountercard on the tenth gameturn. But on gameturn ten you have had at least 30 resourses to play cards with. I feel like there is a kind of threashold, once you pass that nothing can stop you from completing the mission. That is why I feel the need to impose some kind of pressure to progress quickly. I sincerely hope that the tournament rules will include the number of gameturns it takes to complete a mission in some way when comparing successes.\n\nI just tried the Passage through Mirkwood mission and completed it on turn 12 with a score of -4. By then I had cycled through my deck and played Gandalf 6 times. I reshuffled using will of the west and sneaked Gandalf three times on the last gameturn to reduce threat to zero. I could have finished the mission in half the time, but with a much higher score. Which is the greater achievement? Finishing on turn 6 with a score of 30 or on turn 12 with a score of -4?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476040","commentId":476040,"userName":"scottindeed","timestamp":1306554676,"content":" How do you manage questing when stalling like that?  Either your willpower is going to be higher than the threat and you'll make progress on the quest (which you don't want for stalling), or you'll be under and your threat will ramp up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476048","commentId":476048,"userName":"Vyron2","timestamp":1306556465,"content":" yeah... I really don't know with what cards your playing or what magical core set... but said scenarios are an exception at best!!!!!!!!!!!!!! 30 resources?°?°?\n\n \n\nare you sure, that you got the quest phase right? it seems to me, that you're not quite applying the rules in a correct manner??? you MAY commit characters to quest, but you HAVE TO compare your willpower (being zero if no one is committed) to the threat in the staging area every turn... that should prevent from stalling too much... -24 is EXTREMELY good, but nearly impossible... there's gotta be sth wrong with your mode of threat counting...\n\n \n\nhow do you do that exactly?\n\n \n\nEDIT: also, as a recommendation: count the turns, keep track of monsters killed, locations explored... and you have yourself a new incentive! also, it's an URGENT message for lady galadriel... I bet she'll be pissed of, if you deliver so slowly every time partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476053","commentId":476053,"userName":"Mighty Jim 83","timestamp":1306558987,"content":"Weeks said:\n\nI just tried the Passage through Mirkwood mission and completed it on turn 12 with a score of -4. By then I had cycled through my deck and played Gandalf 6 times. I reshuffled using will of the west and sneaked Gandalf three times on the last gameturn to reduce threat to zero. I could have finished the mission in half the time, but with a much higher score. Which is the greater achievement? Finishing on turn 6 with a score of 30 or on turn 12 with a score of -4?\n\n\n\nCycled? do you mean you've been re-shuffling your deck once it runs out? I thought once your deck ran out, that was it, no more cards for you, and only the encounter deck got re-shuffled.\n\nCan somebody with rules to hand/a better memory than me confirm this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476056","commentId":476056,"userName":"felix16","timestamp":1306559562,"content":" Using Will of the West allows you to re-shuffle your discards into your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476059","commentId":476059,"userName":"Weeks","timestamp":1306559877,"content":" \n\n \n\nVyron said:\n\n \n\n yeah... I really don't know with what cards your playing or what magical core set... but said scenarios are an exception at best!!!!!!!!!!!!!! 30 resources?°?°?\n\n \n\nare you sure, that you got the quest phase right? it seems to me, that you're not quite applying the rules in a correct manner??? you MAY commit characters to quest, but you HAVE TO compare your willpower (being zero if no one is committed) to the threat in the staging area every turn... that should prevent from stalling too much... -24 is EXTREMELY good, but nearly impossible... there's gotta be sth wrong with your mode of threat counting...\n\n \n\nhow do you do that exactly?\n\n \n\nEDIT: also, as a recommendation: count the turns, keep track of monsters killed, locations explored... and you have yourself a new incentive! also, it's an URGENT message for lady galadriel... I bet she'll be pissed of, if you deliver so slowly every time partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]\n\n \n\n \n\n \n\nWhat I mean by 30 resorces is just an example that by turn ten of the game you have had access to a total of 3 * 10 resources, many of those have been used to play allies and attachements that stay in play. That makes the game easier and easier for every turn. Each turn you get at least 3 more resources worth to play allies and attachements that build up your playarea. After a while you have enough cards in play to easily take care of every possible encountercard. Using spirit to cancel those few revealed effects that could be harmful.\n\nAnd its not an exception, I have a deck that has beaten the Anduin Journey five times in a row with a negative score each time. At that mission I can keep a troll alive in a forest snare for as long as I please. Thereby stalling the game until I have played all allies and attacehements I want. At other missions I use Riversong to have a look at the top card of the encounterdeck and then I know exactly how much willpower to commit to stall for another turn.\n\nAbout yor recomendation, that is exactly how I want the tournament rules to be. Counting gameturns instead of threatlevel or something in that direction. As it is now a stalling tactic is not punished in any way in the total score. Pissing lady Galadriel off for being slow will make your score better, and that is the contradiction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476064","commentId":476064,"userName":"Weeks","timestamp":1306560654,"content":"scottindeed said:\n\n How do you manage questing when stalling like that?  Either your willpower is going to be higher than the threat and you'll make progress on the quest (which you don't want for stalling), or you'll be under and your threat will ramp up.\n\n\n\nThe willpower could also be exactly the same as the threat, or the same as the threat plus remainder on the active location. Here is an example:\n\nAt the end of the combatphase I use Riversong to look at the top card of the encounterdeck, it's an orc with a two-point threat. I have an active location that requires one more progress-counter to get rid of. Now I know that the next turn I need exactly 3 willpower to get rid of the location without any progress being added to the questcard. At the next turn I quest with Faramir and Erebor Hammersmith for 3 willpower. The orc enemy is easily killed with my other Heroes and allies.\n\nAt the start of the game before you have built up your playarea, or when you look at a card with surge, just make a guess and you will be pretty close to a standoff. A few progresscounters on the questcard is not a problem and an extra threatlevel a few times is also acceptable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476088","commentId":476088,"userName":"Titan","timestamp":1306568444,"content":"I quite agree that the scoring system doesn't work very well. That and the fact that tourneys are supposed to be coop(which I do not care for) makes it almost certain that I will never go on to play in one. In just about every tournament I've seen, purposefully stalling a game is a big no-no. Yet, with this scoring system, it seems like that is exactly what players will do in order to get the scoring low enough to win. Since you can achieve negative numbers in threat, how low is low enough? Is there going to be a time limit for games? I imagine that is going to be a must. I like the idea of counting the number of turns you played, as long as you win the game. The player who successfully passes the scenario in the least amount of turns, wins. The only issue I have is that there may be a higher likelihood of ties this way. However,  you can then check the threat or threat based score system and use that as a tie breaker. It would be nice if they took something like this into consideration."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476093","commentId":476093,"userName":"avgzxc","timestamp":1306569529,"content":"Valid points. Yes, it's possible to loop easily with Beravor drawing, Protector of Lorien discarding the exact amount so that no progress is made and no threat is added. Beravor draws, draws, draws and in the end only unique attachments and events are in the deck which can be Will of the West'ed back into the deck. The score can easily be as low as desired.\n\nIMO, the best way to measure \"the real\" score would be to simply count the amount of turns needed for the win. That would also give tactics the tremendous boost because killing stuff fast would be much more desired and Legolas' skill would shine even more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476095","commentId":476095,"userName":"Mestrahd","timestamp":1306570414,"content":"Maybe they could just modify the scoring to \"+ # of turns\". That way if it took you 32 game turns to get a -24, your final score would be 8. Whereas if you got a 24 in 4 turns your score would be 28. It would still seem to favor stalling by a great margin, but it may be better? Maybe they could even say \"+ double the number of turns\"? That would even it out I'd think. In the above example, it would be 40 to 32 in favor of the quicker game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476102","commentId":476102,"userName":"servant of the secret fire","timestamp":1306572672,"content":"I am glad that more people now can see how powerful will of the west is.\n\nAs for tournaments less rounds+ time limit can do the job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476115","commentId":476115,"userName":"lleimmoen","timestamp":1306575025,"content":"Totally agree with OP about the scoring, it is far from good. I love the game but if the score should be taken seriously, it has to change dramaticaly.\n\nAn easy way of knowing how well you did is to count rounds, the quicker you get through a quest the better I say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476116","commentId":476116,"userName":"Weeks","timestamp":1306575560,"content":"avgzxc said:\n\nIMO, the best way to measure \"the real\" score would be to simply count the amount of turns needed for the win. That would also give tactics the tremendous boost because killing stuff fast would be much more desired and Legolas' skill would shine even more.\n\n\n\nAgree, counting turns gives the game the needed incentive to hurry along the quest and not sit back and wait. That would also make more different type of decks an opportunity to achieve good results. You would not be forced to play Spirit or to use Sneak attak on Gandalf to get a good result. That could give Tactics/Lore a chance to compete with Spirit/Leadership. Perhaps using a primary score based on gameturns and then use final threatvalue as a tiebreaker could be an alternative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476131","commentId":476131,"userName":"lleimmoen","timestamp":1306578329,"content":"Titan said:\n\n \n\nI quite agree that the scoring system doesn't work very well. That and the fact that tourneys are supposed to be coop(which I do not care for) makes it almost certain that I will never go on to play in one. In just about every tournament I've seen, purposefully stalling a game is a big no-no. Yet, with this scoring system, it seems like that is exactly what players will do in order to get the scoring low enough to win. Since you can achieve negative numbers in threat, how low is low enough? Is there going to be a time limit for games? I imagine that is going to be a must. I like the idea of counting the number of turns you played, as long as you win the game. The player who successfully passes the scenario in the least amount of turns, wins. The only issue I have is that there may be a higher likelihood of ties this way. However,  you can then check the threat or threat based score system and use that as a tie breaker. It would be nice if they took something like this into consideration.\n\n \n\n \n\nYeah, number of rounds, and in case of a tie, do the now-official score as a tiebreaker. No stalling that way and yet the threat and victory points relevant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476198","commentId":476198,"userName":"Kitsune Rei","timestamp":1306595195,"content":"I'd agree the scoring lacks depth and doesn't seem all that important or even a real measure of how you did. I just don't see this game in tournament play as it is, and I know to some people that hurts it, but it doesn't really matter to me. We scored a couple times, but it didn't really seem to be all that important, more bragging rights as to how well you did based on a small list of factors. I think most of the time you have an idea how well you did based on how fast you got though the questing and what kinds of difficulties you encountered. But I find it a fun game and scoring doesn't make much difference to me. Its just not one of those games that measures well in numbers since its cooperative and there's a lot of luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476230","commentId":476230,"userName":"felix16","timestamp":1306600364,"content":" You might even expand on the idea of counting turns by counting the turns double only after a certain number of turns. It adds some complexity, but then it starts to really hurt if you really stall. Each scenario could have its own number of turns as its \"par\" number of turns to complete.\n\nDid that make sense?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476500","commentId":476500,"userName":"luckritze","timestamp":1306675477,"content":"You mean as in:\n\nFor \"Mirkwood\" each round over 3 adds two points to your score.\n\nFor \"Anduin\" each round over 4 adds two points to your score.\n\nFor \"Dol Guldur\" each round over 5 adds two points to your score.\n\nSomething like that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476501","commentId":476501,"userName":"Bohemond2","timestamp":1306675570,"content":"I am unsure about those specific numbers, but something like what luckritze suggests might be a big help.  We would need to start tracking rounds to see how it would play out in practice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476508","commentId":476508,"userName":"luckritze","timestamp":1306676467,"content":"Yepp. I also like the idea a lot. Numbers have to be tweaked, of course.\n\nAnd I feel like the \"par\"-round would have to be the average number of rounds it would take to finish a scenario with a deck which is designed to \"rush\".\n\nThe \"penalty-points\" per round above \"par\" should also get adjusted to a number which represents the average \"threat-reduction per round\" of a stall-deck.\n\nThat would take a lot of playtesting and mathcrafting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476518","commentId":476518,"userName":"servant of the secret fire","timestamp":1306676930,"content":"Don't forget that in tournaments there is always a time limit.You can't play as time as you want so no one will have the time to make a perfect score.\n\nExcept that scenarios will be as hard as the third one so first try to find a deck which can complete a quest like this or harder and then we can talk about scoring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476547","commentId":476547,"userName":"felix16","timestamp":1306680471,"content":"luckritze said:\n\n \n\nYou mean as in:\n\nFor \"Mirkwood\" each round over 3 adds two points to your score.\n\nFor \"Anduin\" each round over 4 adds two points to your score.\n\nFor \"Dol Guldur\" each round over 5 adds two points to your score.\n\nSomething like that?\n\n \n\n \n\nAbsolutely. Although with my limited experience in actually playing the game (8 or 10 solo) those numbers are certainly something that I would be careful to comment on.gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476835","commentId":476835,"userName":"jhaelen","timestamp":1306726032,"content":"I like the idea of making #turns part of the scoring. Currently, the system is not very good. I particularly dislike how it favours the Spirit sphere and puts the Tactics sphere (or rather Gimli) at a disadvantage. All spheres should be equally able to reach a good score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=476875","commentId":476875,"userName":"Vyron2","timestamp":1306731758,"content":" guess we all have to wait for the 1.2 Patch :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\npoor ffg with such a thriving community and all the questions and suggestions... I wouldn't want to be in their shoes :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47455-we-need-a-new-way-of-scoring/?do=findComment&comment=477035","commentId":477035,"userName":"felix16","timestamp":1306757621,"content":" The scoring system as it is right now feels a bit tacked on. Let´s hope they get a quick revision, then we can start logging new scores on the new system."}]}