{"url":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/","title":"Here have someone who use to play before decipher lotr tcg?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476165","commentId":476165,"userName":"Glaurung","timestamp":1306585916,"content":"Hi fellows. Here we have someone who use to play lotr tcg from Decipher???  I use to play it for years until the game is die. \n\nFor me this new lotr lgg is combine of ideas Decipher previous game and Middle earth ccg.The last one die around 2000.\n\nIm just very happy to see new game based on Tolkien saga and looks like the game have a great future with all of this exp. packs and quests staff.....\n\nBut i still cannot understand how they will make the tournaments in this co-operative format? Some one have  a idea about????\n\nSorry for my english......"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476168","commentId":476168,"userName":"Toqtamish","timestamp":1306588482,"content":"The tournaments will be 2 players against an unique scenario(s) for the tournament, best score wins the day."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476174","commentId":476174,"userName":"Weeks","timestamp":1306590146,"content":"I used to play Deciphers game as well. Never tried METW though. There are a few things with this new game I think is better than Deciphers game. First the option of playing solo. That will give this game a lot more playtime from me. Second the art. This game has beutiful cards. As for deckbuilding and customization, Deciphers first set had more potential. But this game will probably catch up once a few adventure packs are released.\n\nI hope they make the tournaments into another way of releasing quests. If the special quests are printed in tournament packs or something similar. That can be a way to release more quests and increase the cardbase and variety.\n\nAllmost all ccgs I have played has had some sort of promotion-cards as give aways for tournament-play. Decipher used that as an opportunity to release cards with alternate images. That is something I would really like for this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476179","commentId":476179,"userName":"Glaurung","timestamp":1306590954,"content":"Ok and thanks for the quick answer. This also very good idea. You play against quest which one you never see before. Cool!!!\n\nBut how gamers will choose they companions???? Randomly from all players of the tournaments? Or you come already and declare you with your friend as a team???\n\nAnd  how they can be sure the players is not cheating during the game? They must add judge to every game???But this is quite difficult no?If you have 25 players how you can be sure all teams is playing without cheating??? You must have at least 12 judges........\n\nIn other card games your oponent always looks what you doing and you looks after him. But in this case what they will do????\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476181","commentId":476181,"userName":"Mestrahd","timestamp":1306591223,"content":"That's an interesting question. In pvp games, you always have your opponent watching for mistakes like you said. This game wouldn't have that as a check/balance. As for your first question, I would think you'd come with a partner so you'd have your heroes selected beforehand. I think if you just showed up stag with an Aragorn deck you'd likely get hosed (someone else would have him)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476185","commentId":476185,"userName":"Glaurung","timestamp":1306592043,"content":"Yes man you right about solo play.  I really like this option. And art is amazing too. Decipher game was limited by the pictures of the movie. Here is no limit.\n\nBut something they can  take from decipher  lotr design. For example when you play attachment card on your hero you cannot see bonus (will+..attack+.. ) until you read a game text.Why they  just dont add will, attack or life sigh +.. or -.. on the  left corner of the attachment card????  That makes calculations much more easy!!!But in future expansion they can do that.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476867","commentId":476867,"userName":"Vyron2","timestamp":1306730458,"content":" the last is actually a good idea! showing off stats on the cards may be nice... but ok, lots of ccgs don't have this either so...\n\nme too! I played METW (which died exactly 1998 after the last expansion ME The Balrog, but still has a loyal fanbase!!!!!!!! me me me :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]) and lotr ccg by decipher... while it had so much deckbuilding potential and the gameplay was awesome imo, the cards themselves were only movie pictures, which was quite fine during the movies, it was awesome watching the movies then playing with the same heroes... but after all these years, the pictures lost their touch... they seem so lifeless.... metw and lotr lcg on the contrary have awesome art! sometimes, I just like to stare at a card for 10 minutes and plunge into the artwork... e.g. mountains of mirkwood is one of my favourites..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=476930","commentId":476930,"userName":"Glaurung","timestamp":1306739842,"content":"Yes i remebmer in 2003 or 2004 first world cup of Decipher lotr tcg in Essen(Germany). I was there and my first game was against best ranking player in the world. I lose that game. But all other i win. Before the in the rules they dont have muligan and they add it to rules 5 min before world cup start.Was funny time.....\n\nBut now again we have a new game and in many aspect this game better than Decipher game. I like art more than photos from the movies.And game take already very special time like (The hunt for Gollum). Looks like ahead will be many adventures, new card and so on. This is my first game with FFG and i like it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47487-here-have-someone-who-use-to-play-before-decipher-lotr-tcg/?do=findComment&comment=477112","commentId":477112,"userName":"luckritze","timestamp":1306767762,"content":"I also played the Decipher game. Not just casual, but additionally on tournaments (also in Germany).\n\nI can't really say i liked it more or less than the LCG. You can't really compare both to each other. The TCG was competetive and would let you play companions and minions, while the LCG is cooperative and only lets you play the fellowship. Also there was way more complexity to the TCG (sure thing after more than a dozen expansions).\n\nI still have a couple of those TCG-decks and i keep them proudly, although I do not have the chance to play the game very often (maybe once in a year). It became a dead game after they stopped hosting tournaments / supporting the community / bringing new expansions."}]}