{"url":"https://community.fantasyflightgames.com/topic/47482-joplin-mo-charity-relief-auction/","title":"Joplin, MO Charity Relief Auction","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47482-joplin-mo-charity-relief-auction/?do=findComment&comment=476109","commentId":476109,"userName":"Kennon","timestamp":1306573915,"content":"Hey guys, I'll keep this brief, but we're wanting to start spreading the word on it as much as possible. What started as a handful of AGoT LCG players wanting to run a small local auction of game related promo items (uncut card sheets, promo house cards, etc) is beginning to pick up some steam.We've recieved word that George R.R. Martin is sending some auction items, as is Neil Gaiman. Many players have donated items, AEG and Wyrd Miniatures are both in, I believe, I'm speaking with artist Jeremy Haun to see what he might be able to donate, and we've got several more irons in the fire that I really, really hope pan out.\n\nAt the moment we're trying to spread the word. You fan find info about it on our Facebook group [http://on.fb.me/moiqUw], though the store we're partnering with (also in Southwest Missouri), Metagames Unlimted, should have information up on their website [http://www.mguinc.com] soon. Please, if you at all think that there might be items you would bid on, come join the group on Facebook or follow us on twitter @JoplinReliefAuc. We know items have been shipped, but we're waiting to start posting a list until they arrive and we can start cataloging. Please, spread the word as well. If I've pestered such busy men to donate items, I'm really hoping that we can reach a wide enough audience to justify it.\n\nAlso, if you happen to know anyone in the gaming/comic/sci-fi/fantasy/general geek fields that might want to donate, or just have a cool item that you would like to send our way, the address is on the Facebook page, or you're more than welcome to email joplinreliefauction@gmail.com\n\nThank you all so, so, so much.\n\n-Will Lentz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47482-joplin-mo-charity-relief-auction/?do=findComment&comment=476117","commentId":476117,"userName":"Mestrahd","timestamp":1306575582,"content":"I joined up even if just to see what's up for sale. I like the idea of uncut sheets as they make nice posters when framed. I have an uncut sheet for an old game on my wall right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47482-joplin-mo-charity-relief-auction/?do=findComment&comment=476129","commentId":476129,"userName":"Kennon","timestamp":1306577472,"content":"Awesome! Thank you so much!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47482-joplin-mo-charity-relief-auction/?do=findComment&comment=476142","commentId":476142,"userName":"Kennon","timestamp":1306580259,"content":"Slight tweak based on Twitter feedback. I've now started a public Facebook Page [http://on.fb.me/lZjJGc] so that people not on Facebook are at least able to view it. Come like us and follow there!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47482-joplin-mo-charity-relief-auction/?do=findComment&comment=476169","commentId":476169,"userName":"Toqtamish","timestamp":1306588564,"content":"I just joined the facebook page, Matt Nott. Will be interesting to see what is up there. Will bid what I can."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47482-joplin-mo-charity-relief-auction/?do=findComment&comment=476243","commentId":476243,"userName":"Kennon","timestamp":1306603241,"content":"Thank you so much, Matt. We're still working on official listings, but I can tell you that we've secured a couple more offers today, so the event continues to grow!"}]}