{"url":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/","title":"Nightmare mode makes the game easier?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476290","commentId":476290,"userName":"Bohemond2","timestamp":1306621218,"content":"I have a spirit/lore deck that I have been using in solo play. It always beats Mirkwood, has a solid success rate against Journey (as long as you get Gandalf or Greeting in the first few turns), and gets thumped repeatedly during Escape. On a lark, I tried nightmare mode this evening. The result was a far easier game. Since I reliably end the scenario with threat in the teens or single digits, sustain no damage, and can recycle my discard pile into the deck, I was in a vastly stronger position at the end of the first scenario. Even though I discarded all of my allies and attachments, the low starting threat meant I had plenty of time to set up for Journey before the Hill troll engaged. I started the third scenario with 0 threat, and though my threat did hit 41, I eventually go the deck rolling, dropped my threat into the teens, fire bombed the Nazgul and fled into the night. However, I would have never been able to beat the scenario under \"normal\" difficulty.\n\n\nSeveral people have mentioned the need to revamp the scoring system. I would go further, they need to revamp how they want to treat linked scenarios. Decks with healing, threat reduction, and card recursion can easily start scenarios in an improved position, which negates the whole point of higher difficulty. I would add that I was playing a deck that I frequently use in multiplayer, so I am sure that you could get even better results in a solo focused deck. For those who care, or want to experiment with the deck, I will post a list below.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476294","commentId":476294,"userName":"Bohemond2","timestamp":1306622046,"content":"Your basic game plan is to always send Eowin question, use Dunhere to fight (giving preference to snipping foes in the staging area), and Beravor as a jack of all trades.  Quest when you need more will, block when you need a defender, through in an attack when two more power gets you a kill, and then draw cards whenever you have the time.  Protector of Lorien should always go on Eowin, and Unexpected Courage always goes on Beravor to get her card drawing engine started.\n\nThe deck looks to reduce threat whenever possible. Play Galdhrim's Greeting aggressively , and get it back with dwarven tomb.  Use Gandlaf for threat reduction, and bring him back again and again with Stand and Fight.  Sit back with low threat, use Test of Will and Hasty Stroke to cancel ill timed effects. and lett Dunhere whittle down enemies in the staging area.  When your discard pile is full of those potent spirit events, toss in a Will of the West to restart the cycle.\n\nUsing the time you buy from spirit events, start setting up your potent lore allies.  Hemnath lets you know exactly how to plan each turn, the Daughters help you slough off damage you sustain (most of it from Dol Goldur Orcs and Necromancer's reach), the two dwarves give you extra beef and allow you to sluogh off conditions and recyle your forest snare.  Gleowine only augments the already potent card draw the deck has, and it's not uncommon to draw the entirety of your deck into your hand over the course of the game.  Your spirit allies, the Lorien Guide and the Northern Tracker, allow you to quest continually and take out locations. \n\nThe key is, slow and steady wins the race.  You have no resource acceleration, but you drag the encounter deck to a crawl.  You make it so very few foes can engage, build up a bevy of allies that help you overcome large threat in the staging area, and whittle away enemies with attacks.  If you want to try a \"control\" deck in the LotR LCG, this is the deck for you. \n\n \n\nHeroes\nBeravor, Dunhere, Eowin\n\nLore – 17 Cards\nAllies (10)\nX2 Daughter of the Nimrodel\nX2 Erbor Hammersmith\nX2 Gleowine\nX2 Hemnmath Riversong\nX2 Miner of the Iron Hills\n\nEvents (5)\nx3 Lore of the Imladris\nx2 Secret Paths\n\nAttachments (2)\nx1 Forest Snare\nx1 Protector of Lorien\n\nSpirit – 31 Cards\nEvents (18)\nx2 Dwarven Tomb\nx3 The Galdhrim’s Greeting\nx2 Hasty Strike\nx2 Strength of Will\nx3 Stand and Fight\nx3 Test of Will\nx3 Will of the West\n\nAttachments (5)\nx3 Favor of the Lady\nx2 Unexpected Courage\n\nAllies (8)\nx3 Lorien Guide\nx3 Northern Tracker\nx2 Wandering Took\n\nNeutral (2)\nx2 Gandalf\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476349","commentId":476349,"userName":"Weeks","timestamp":1306641142,"content":"Nice deck. A question: Why do you feel the need to include 3 Will of the west? When I have played a similar deck I have never had the need for more than 2. Even if a nasty random discard effect makes discard both of them there is always Dwarven Tomb to pick one up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476369","commentId":476369,"userName":"scottindeed","timestamp":1306645973,"content":"Similar to my my deck and tactics, though I go Lore heavy with Denethor, Berevor, Dunhere.  Having Unexpected Courage on Berevor (or even 2!) is a must."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476396","commentId":476396,"userName":"servant of the secret fire","timestamp":1306653967,"content":"They must change Denethor's action.With 2 unexpected courage on him (and riversong) and protector of Lorien you can't loose.You know what cards will come in the staging area and you can place one card to the bottom.Now imagine what happens with 2 UC on Denethor....pffffff\n\nThey must make Denethor's abilitie 1 per round(or you can only see the top card but you can't move it to the bottom) or else is like you are cheating.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476425","commentId":476425,"userName":"Bohemond2","timestamp":1306661478,"content":"@weeks - thanks for the compliment.  Your posts were some of the reasons I realized that nightmare mode was problematic.  As for Will of the west, I assumed that you play the card, it emptied the discard pile, and then you discarded it.  With that timing, you want two more in deck so you make sure an unlucky discarded two doesn't get your other will of the west and a dwarven tomb.  If the card goes straight to the discard pile and recycles itself, you would only want two cards.\n\n@scottindeed - Interesting idea.  I can't quite see how it would work, but I think that is just because I am focused on having two spirit characters at the moment.  Losing Eowyn would be rough for me, in part because I use her discard ability to try and make sure that I have a short deck with all of the right cards when I start a new game.  I would love to see the decklist."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476489","commentId":476489,"userName":"lleimmoen","timestamp":1306673413,"content":"With all respect I can give your deckbuilding, Protector of Lorien is such an important card and having it once in a deck is a pure folly. What is a chance of drawing it? I know if you play solo you basically just need it once but you can always discard - especially easily with Protector of Lorien on one of your heroes, haha.\n\nAlso, why so many types of cards, do you think it not fitter to use less but more frequently in general?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476493","commentId":476493,"userName":"Bohemond2","timestamp":1306674516,"content":"You never need more than one protector of lorien and you always draw the whole of the deck at least once.  In both the second and third scenario, there is absolutely no reason to travel quickly.  Advancing the quest only makes the game harder.  You want to go through all of your resources and then rush through the quest in a couple of fell swoops. Consequently, you don;t need more than one protector.  That applies to your second comment as well.  If you are going through your whole deck, you can certainly toss in more cards that are useful in corner cases. \n\nThat being said, the decklist is not optomized.  I only have two core sets, and keep four playable decks togeather at all times, and that accounts for some of the defficencies.  In a perfect world I would toss in another Gandalf, another dwarven tomb, and another unexpected courage.  Favor of the Lady, and Lore would probably be trimmed to make room. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476496","commentId":476496,"userName":"lleimmoen","timestamp":1306674858,"content":"Bohemond said:\n\nYou never need more than one protector of lorien and you always draw the whole of the deck at least once.  In both the second and third scenario, there is absolutely no reason to travel quickly.  Advancing the quest only makes the game harder.  You want to go through all of your resources and then rush through the quest in a couple of fell swoops. Consequently, you don;t need more than one protector.  That applies to your second comment as well.  If you are going through your whole deck, you can certainly toss in more cards that are useful in corner cases. \n\nThat being said, the decklist is not optomized.  I only have two core sets, and keep four playable decks togeather at all times, and that accounts for some of the defficencies.  In a perfect world I would toss in another Gandalf, another dwarven tomb, and another unexpected courage.  Favor of the Lady, and Lore would probably be trimmed to make room. \n\n\n\nThanks for explaining. I appologize for not reading your initial thread thoroughly, I was mostly interested in the deck. So you use this for a nightmare only? Thus the Will times three and so on.\n\nGood luck.\n\nAnd one question, how do you do the nightamare? At the end of a scenario 1 or 2, do you discard all cards in hand and draw new set of 6? I assume you discard all cards in hand and rescource but keep damage and threat. Sorry if this has been said in the thread also, I am kinda tired now to read through."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476499","commentId":476499,"userName":"Bohemond2","timestamp":1306675323,"content":"no need to apologize.\n\nAt the end of each game i discarded my whole hand, and discarded all of my attachments and allies.  I kept my damage and threat totals, and drew a new hand of six cards. \n\nAside from the will of the west, I use the same deck in multiplayer.  The point I was trying to make, and I guess I didn't make it forcefully enough, is that nightmare mode is too easy precisely because of the \"weaknesses\" of this deck.  It's a good deck, but hardly perfect.  It doesn't take advantage of those unique tactics cards that many players considered to be the strongest thing going in the game (Steward, Sneak Attack, Celebrain's Stone, Faramir), and as you pointed out, probably contains several cards that don't belong even in the spheres it uses. \n\nedit: I posted the deck primarily because of what happened to Weeks when he complained about the scoring system.  In that post several people expressed doubt at the scores he was putting up and questioned if he understood the game.  I wanted to be specific about the deck I used to people could see how it worked and see the problems it presented for both scoring and tracking ongoing threat in nightmare."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476564","commentId":476564,"userName":"lleimmoen","timestamp":1306681784,"content":"Thanks for the insight.\n\nI had debated few times that Nightmare is easier. It was when I thought it is played differently but I see it is (or can be) still easier even though you play it the hard way (as described by both of us above).\n\nAnd yes, fun of the game is in deckbuilding I'd say (for some, like me). And the best cards at the first glance are not necessarily the only ones that  do the trick."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476792","commentId":476792,"userName":"Narsil0420","timestamp":1306717780,"content":"My wife and I just ran through Nightmare mode, we kept attachments and kept one ally at the end of each scenario but it did feel a little too easy. I'm thinking next time don't keep an ally and don't keep attachments maybe. We had a lot of fun though! My wife got Beorn out who's her favorite character now and she couldn't part with him. She played solo tactics and I played your Eowyn/Dunhere/Berevor deck Bohemond. We spent some time getting our threat down during Mirkwood and so had some time to deal with the Hill Troll. It seems a shame to get rid of cards you payed for but it does make the game a little too easy it seems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476823","commentId":476823,"userName":"Vitimus","timestamp":1306723974,"content":"This definately seems like a great deck set up, I will try it some time. My problem is that I often get caught without resources, good cards in my hand, and stuck with several locations in the staging area, wich usually keeps me tied up until my threat reaches fifty. I've come to realize that it is hard to beat the scenario's without the Spirit deck wich both helps with questing and lowering threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476825","commentId":476825,"userName":"player545300","timestamp":1306724473,"content":"Bohemond said:\n\nAt the end of each game i discarded my whole hand, and discarded all of my attachments and allies.  I kept my damage and threat totals, and drew a new hand of six cards. \n\n\n\nAs a suggestion to make Nightmare Difficulty harder, I'd recommend that you only carry over your threat from the previous scenario if it is higher than your starting threat.  Otherwise, threat resets like attachments and allies.\n\n-Scatterbreak\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476832","commentId":476832,"userName":"jhaelen","timestamp":1306725698,"content":"servant of the secret fire said:\n\nThey must change Denethor's action.With 2 unexpected courage on him (and riversong) and protector of Lorien you can't loose.You know what cards will come in the staging area and you can place one card to the bottom.Now imagine what happens with 2 UC on Denethor....pffffff\n\n\n\nWith Denethor you can only look at the top card. So you only ever know one of the cards that will enter the staging area. Unless you choose to discard the top card, using the ability twice just means you get to look twice at the same card.\n\nHence the ability is not quite as good in multiplayer games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476841","commentId":476841,"userName":"servant of the secret fire","timestamp":1306726994,"content":"jhaelen said:\n\nservant of the secret fire said:\n\n \n\nThey must change Denethor's action.With 2 unexpected courage on him (and riversong) and protector of Lorien you can't loose.You know what cards will come in the staging area and you can place one card to the bottom.Now imagine what happens with 2 UC on Denethor....pffffff\n\n \n\nWith Denethor you can only look at the top card. So you only ever know one of the cards that will enter the staging area. Unless you choose to discard the top card, using the ability twice just means you get to look twice at the same card.\n\n \n\nHence the ability is not quite as good in multiplayer games.\n\n\n\nNo, you discard the top card and then you use Denethor again with unexpected courage and you see the next card too.With 2 UC you can see  and discard 3 cards from the encounter deck.This is too good for solo play.For coop yes it is not so grate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476853","commentId":476853,"userName":"lleimmoen","timestamp":1306728090,"content":"Scatterbreak said:\n\nBohemond said:\n\n \n\nAt the end of each game i discarded my whole hand, and discarded all of my attachments and allies.  I kept my damage and threat totals, and drew a new hand of six cards. \n\n \n\n \n\nAs a suggestion to make Nightmare Difficulty harder, I'd recommend that you only carry over your threat from the previous scenario if it is higher than your starting threat.  Otherwise, threat resets like attachments and allies.\n\n-Scatterbreak\n\n \n\n\n\nWell, you should get at least some possibility of an advantage. Assuming you're not a stalling maniac."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=476873","commentId":476873,"userName":"Vyron2","timestamp":1306731186,"content":" you don't discard, you put the cards under the deck with denethor... discarding would be way too powerful... ;-) also, denethor's usefulness is mostly imo in his blocking ability... 3 is WOW!!!!!!!!!! in 4-player games... his peeking ability is not that good"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=477303","commentId":477303,"userName":"jhaelen","timestamp":1306807891,"content":"servant of the secret fire said:\n\n \n\nNo, you discard the top card and then you use Denethor again with unexpected courage and you see the next card too.\n\n\n\nNo you don't. You only ever see the first card to enter the staging area, no matter how many cards you have removed using his ability, as I've already writtenn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=477396","commentId":477396,"userName":"servant of the secret fire","timestamp":1306823710,"content":"jhaelen said:\n\nservant of the secret fire said:\n\n \n\n \n\nNo, you discard the top card and then you use Denethor again with unexpected courage and you see the next card too.\n\n \n\nNo you don't. You only ever see the first card to enter the staging area, no matter how many cards you have removed using his ability, as I've already writtenn.\n\n \n\n\n\nOk lets take the events step by step with 2 UC on Denethor.\n\nYou exhauste him and you look the top card of the encounter deck.If you don't like what you saw you place the card to the bottom.Then you exhauste one of your UC and you can see the next one.If this card can't harm you you know what is coming, you know how much threat the staging area will have,how many allys and heroes you must sent to quest etc etc.If this card can harm you then you can place this card to the bottom ready Denethor with the second UC and see the next top card.You must be very unlucky if after 3 cards you removed if the fourth card is as powerfull as the 3 previous cards.I realy think in solo play this abilitie is way too strong.For 2-4 players i can agree that it is not so grate(and at the 2b quest card of the 2 scenario).\n\nAm i right or i am doing somethink wrong?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=477605","commentId":477605,"userName":"Apophenia","timestamp":1306841539,"content":"servant of the secret fire said:\n\nOk lets take the events step by step with 2 UC on Denethor.\n\nYou exhauste him and you look the top card of the encounter deck.If you don't like what you saw you place the card to the bottom.Then you exhauste one of your UC and you can see the next one.If this card can't harm you you know what is coming, you know how much threat the staging area will have,how many allys and heroes you must sent to quest etc etc.If this card can harm you then you can place this card to the bottom ready Denethor with the second UC and see the next top card.You must be very unlucky if after 3 cards you removed if the fourth card is as powerfull as the 3 previous cards.I realy think in solo play this abilitie is way too strong.For 2-4 players i can agree that it is not so grate(and at the 2b quest card of the 2 scenario).\n\nAm i right or i am doing somethink wrong?\n\n\n\nThat is how I play Denethor except that since I play a Lore/Tactics deck instead of a Lore/Spirit deck I don't have access to Unexpected Courage. Solo I think his ability is really good and combined with Henamarth Riversong you will always know what is happening next. In my case however I almost always leave the card on the top of the deck unless it has surge or is Hummerhorns. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=477618","commentId":477618,"userName":"servant of the secret fire","timestamp":1306842823,"content":"Apophenia said:\n\nservant of the secret fire said:\n\n \n\nOk lets take the events step by step with 2 UC on Denethor.\n\nYou exhauste him and you look the top card of the encounter deck.If you don't like what you saw you place the card to the bottom.Then you exhauste one of your UC and you can see the next one.If this card can't harm you you know what is coming, you know how much threat the staging area will have,how many allys and heroes you must sent to quest etc etc.If this card can harm you then you can place this card to the bottom ready Denethor with the second UC and see the next top card.You must be very unlucky if after 3 cards you removed if the fourth card is as powerfull as the 3 previous cards.I realy think in solo play this abilitie is way too strong.For 2-4 players i can agree that it is not so grate(and at the 2b quest card of the 2 scenario).\n\nAm i right or i am doing somethink wrong?\n\n \n\n \n\nThat is how I play Denethor except that since I play a Lore/Tactics deck instead of a Lore/Spirit deck I don't have access to Unexpected Courage. Solo I think his ability is really good and combined with Henamarth Riversong you will always know what is happening next. In my case however I almost always leave the card on the top of the deck unless it has surge or is Hummerhorns. \n\n\n\nYea this is what i mean.His abilitie for solo is really  good (with no UC) with 2 unexpected courage on him i think is way too good.Thats why i said they must make his abilitie once per round.\n\nMaybe i am wrong but this how i feel.Other people can say their opinion and see what most people think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478036","commentId":478036,"userName":"jhaelen","timestamp":1306896124,"content":"servant of the secret fire said:\n\nAm i right or i am doing somethink wrong?\nI have no idea what you are thinking, since I cannot read minds, but nothing you have written invalidates what I've already said.\n\nI'll try it differently: If you used Denethor's ability three times, twice to put the top card to the bottom of the deck and once to view the top card and leave it, how many cards have you seen that will be put in the staging area this turn?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478050","commentId":478050,"userName":"servant of the secret fire","timestamp":1306899075,"content":"jhaelen said:\n\n \n\n \n\nI'll try it differently: If you used Denethor's ability three times, twice to put the top card to the bottom of the deck and once to view the top card and leave it, how many cards have you seen that will be put in the staging area this turn?\n\n \n\n \n\nOne, but i am sure you can understand that there is a huge difference here.With no UC you can see the top card of the encounter deck only once and if you choose to place this card to the bottom then you can't see the next one so you can't make any plans.With 2 UC you place 2 cards to the bottom then you can see the third and you know how many characters you must exhauste for quest,def,attack and as i said before if 3 cards in a row can harm you then you must be the most unlucky man in the univers.\n\nDenethor with no UC you place one card to the bottom and you can't see the next one <<<<Denethor with 2 UC you place 2 cards to the bottom you can see the third and be prepared\n\nSorry i can't explain it better.Maybe someone with better English than mine can say it better(if he can understand what i mean)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478055","commentId":478055,"userName":"lleimmoen","timestamp":1306899789,"content":"Your English is very good, never worry. The misunderstanding was the following, I believe: the other mr thought you mean you can get to see all the cards that are coming during staging and was trying to inform you otherwise. I too had that feeling from your previous post. I believe now all is clear between us, haha.\n\nAnd yes, Denethor's ability does become more powerful with UC but I'd say other heroes' strength also increases massively with it. With 1 UC, Dunhere can target two enemies in the staging area (or even 1 twice - as the rules seem to imply), Legolas can also kill two enemies and thus seriously advance the progress, Aragorn can quest, defend and attack - and that is important for normaly he is your best defender and you use him thus but he is also a great attacker: Glorfindel is a similar thing, he is predetermined to quest but with UC he will also help greaty with the attack; Theodred, same thing, he always quests to gain resource but with UC he will help you kill as well; Beravor can draw and quest/defend/attack. The card (UC) is just very useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478176","commentId":478176,"userName":"jhaelen","timestamp":1306914513,"content":"servant of the secret fire said:\n\nOne, but i am sure you can understand that there is a huge difference here.\n\nSorry i can't explain it better.Maybe someone with better English than mine can say it better(if he can understand what i mean).\n\n\n\nI've understood you right from the start; I just don't agree with you! And it's you who didn't seem to understand me.\n\nSo, if language is the problem, it must be my English that is to fault gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478222","commentId":478222,"userName":"player737471","timestamp":1306917608,"content":"I play the same deck mechanic but I use 2 lore and 1 spirit.\n\n \n\nBera and Glorfindel for Lore and Eowyn/Dunhere for Spirit.\n\n \n\nThe main difference in my deck is that I don't use the Guides and the Trackers. This is a loss for the deck. But I think that I gain lot also.\n\n \n\nI use faster the daughters and self perservations. If I have 1 daughter or a perservation and I can peek for the shadow card dealt with henemarth or dark knowledge, then I can easily leave the attack undefended on Glorfindel and immediately heal him for 2. Even if I have 2 of daughers and/or perservations, 5 Glorfindel's hp are critical. I can let 4 dmg to Glor and I can immediately heal him. This, believe me, is a super great deal.\n\n \n\nI use all limited spirit resurces on Greetings, Tombs, Courages and reshuffles. Rest go to Lore.\n\n \n\nNow about the 'Eowyn/Dunhere'. Dunhere is better. In scenario 2 and 3 he is a major help killing these monsters. Hummer and that Sniper are not a problem anymore and with unexpected courage he can shoot 2 creatures at the same time. But you are forced to send Glorfindel's 3 attack to quest.\n\n \n\nIf you put Eowyn, you have the best questing hero. Berethor with courage is way too many cards so Eowin's ability plus protector of lorien is omg!\n\n \n\nSo this is a delemma. I use Eowyn and keep 3 Glor's attack around, or I sacrifice it sending him at quests, keeping the assassin Dunhere.\n\n \n\nThe most I play the deck, the more I see this. When I use Eowyn and stabilize threat at 1st scenario, I always wish I had Dunhere... So Dunhere might be the solution. It is a bit of a pain in the start, but once it gets rolling, it goes through victory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478277","commentId":478277,"userName":"lleimmoen","timestamp":1306923104,"content":"Krimi said:\n\n If you put Eowyn, you have the best questing hero. Berethor with courage is way too many cards so Eowin's ability plus protector of lorien is omg!\n\n \n\nIf you have Protector, you needn't Eowyn. Protector is much better than Eowyn's ability, you just need to get it and not lose it but the latter should not be that much of a problem. And if you have three in the deck (as you must if you take things seriously) you should get another by the time you lose one.\n\nAnyways, nice report on your strategy. I use Glorfindel, Beravor and Legolas. And Dunhere, Aragorn and Theodred in another deck. The coop of these has proven not to lose a scenario once the decks have been tuned."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478380","commentId":478380,"userName":"player737471","timestamp":1306932051,"content":"IIeimonen\n\n \n\nYes, you are right about Eowyn's ability. Once you get the Protector, it is useless. But Eowyn's advantage is that you free Glorfindel from questing, thus using his 3 attack more efficient. The bad thing about Dunhere is that in the 3rd scenario there are many enemies that have 2 and possibly 3 defence so his ability is not much effective.\n\n \n\nI have played way to many games using 1 deck. I was thinking the past days to start constructing 2 decks, playing them myself both. You gave me a very nice head start. I really like Lore - Tactic and Leadership - Spirit with these heroes. I will start immediately build two decks based on your proposal.\n\n \n\nFirst thing that comes in mind is Lore's threat. You can't play the Greetings for both players I assume because the 6 itself is very powerful. From the other hand, in the Leadership you won't have that drawing.\n\n \n\nYou say that you hardly lose a scenario. Even though I can imagine the 80% of the decks, I would really like to see your deck lists so I can start using them to get into the 2-player concept of the game. And of course a few tips on it.\n\n \n\nCan you use an attachment to a hero you don't control? That means to the other deck?\n\n \n\nI feel like I am gonna leave my loving Lore - Spirit just to get a second me on the table :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nThank you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478402","commentId":478402,"userName":"Mestrahd","timestamp":1306934315,"content":"Even with Eowyn on the table, the Protector isn't useless. You can still discard for a defense boost.\n\nAnd to answer your question, yes you can play your attachments on a friendly player's hero. You just have to pay for them with your own resources.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47504-nightmare-mode-makes-the-game-easier/?do=findComment&comment=478416","commentId":478416,"userName":"player737471","timestamp":1306935338,"content":"Mestrahd\n\n \n\nBy no means the Protector is useless, even on Eowyn.\n\n \n\nEowyn's ability can be triggered only once per turn. But Protector can be triggered as many times as you like, meaning of course that you have the cards to discard. So even Protector on Eowyn isn't useless at all.\n\n \n\nConcerning the attachments you said, of course you are right. I read carefully the cards and it showed itself. Abilities also are the same. Read Greetings and just found it out.\n\n \n\nThis is the problem of playing only solo. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI am working at this specific 2 deck combinations."}]}