{"url":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/","title":"U/R Legolas, Eowyn, Eleanor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476372","commentId":476372,"userName":"yashamaru","timestamp":1306647457,"content":"Hello guys,\n\n \n\nwhat do you think about this deck? How would you tweak it? Just please do not change heroes.\n\n \n\nMyFirstDeck U/R\n\n \n\nHero (3)\nEleanor (Core) x1\nEowyn (Core) x1\nLegolas (Core) x1\n\n\nAlly (8)\nGandalf (Core) x3\nLorien Guide (Core) x3\nNorthern Tracker (Core) x2\n\n\nAttachment (13)\nBlade of Gondolin (Core) x3\nCitadel Plate (Core) x1\nUnexpected Courage (Core) x3\nThe Favor of the Lady (Core) x3\nPower in the Earth (Core) x3\n\n\nEvent (29)\nA Light in the Dark (Core) x2\nA Test of Will (Core) x3\nDwarven Tomb (Core) x1\nFeint (Core) x3\nFortune or Fate (Core) x1\nHasty Stroke (Core) x3\nQuick Strike (Core) x3\nStrength of Will (Core) x3\nThe Galadhrim's Greeting (Core) x3\nStand and Fight (Core) x1\nRain of Arrows (Core) x3\nSwift Strike (Core) x3\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476383","commentId":476383,"userName":"Glaurung","timestamp":1306650682,"content":"Looks like you have only 1 core set to build it right??? I think you need more Dwarven tombs, rain of arrows on my choice quite useless card. But you dont have to much ally in your deck. But your starting treat as well very low. First quest is no problem but second maybe can be difficult for you. Personally i dont like Eleanor(you anyway have 3 test of will) but of you like her up to you. I prefer Legolas, Gloin, Eowyn deck. 3 colors but not expensive cards in the deck and is play very well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476393","commentId":476393,"userName":"luckritze","timestamp":1306652174,"content":"Glaurung said:\n\nLooks like you have only 1 core set to build it right??? [...]\n\n\n\n3x unexpected Courage doesn't look like only 1 CS to me.\n\nApart from that I can't say much on the deck. I am also no fan of \"Rain Of Arrows\", but I can see how this card could work on a deck with little help from allies. Could be a good strategy for \"Down the Anduin\" too, at least for the last part.\n\n10 enemies waiting for you?\n\n3 RoA on the hand and sufficient resources?\n\nWell done!\n\nFeels like a way to ideal scenario though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476418","commentId":476418,"userName":"Mestrahd","timestamp":1306660217,"content":"I think I too would worry about the lack of allies. You seem to be counting on keeping your threat low enough, but I've learned you certainly can't count on drawing into the Greeting when you need it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476426","commentId":476426,"userName":"Bohemond2","timestamp":1306661805,"content":"Before we get to cards, I want to ask what you see your heroes doing in this deck.  When your threat is low, what do legolas and Elanor do?  It seems like that they would wast a fair bit of time standing around.  Frodo, when he becomes available, will make a good sub for Elanor, since Test of will is far superior to her ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476430","commentId":476430,"userName":"yashamaru","timestamp":1306664226,"content":" Well I come from the MTG background so I have no problem with buying Core Set three times.\n\n \n\nYes even when my threat is low I usually leave Legolas and Eleanor just stand around and wait for nasty treacheries or enemies.\n\n \n\nSomehow I cannot find that Frodo you have mentioned... anywhere. Could you please point me the right direction?\n\n \n\nDeck does not work as good as I would like. I miss some kind of attachment which will make Legoland more bad ass. I often find myself overwhelmed by enemies.\n\n \n\nI do not like ally cards much. I try to avoid general random guys waiting for sacrificial chump block. It makes me sad and does not feel right to me.\n\n \n\nI would like to have deck which is stealthy, keeps head low and tries to avoid stuff. I see it as Legolas trying to protect the ladies and get the job done at the same time.\n\n \n\nHowever I understand that since there is not that many card at the moment I need to use some allies if I want to make deck more stable. What are your suggestions?\n\n \n\nThank you for all your help. I find Lotr community however small it is very kind. (As I said I come from mtg background) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476452","commentId":476452,"userName":"Bohemond2","timestamp":1306668743,"content":"Saddly, we have to wait a few months for Frodo; he is in one of the upcoming expansions. \n\nIf you want a deck that lurks around and ambushes, you might want to consider swapping out legolas and Elanor with Thalin and Dunhere.  That would allow you to keep your sphere balance, but throw a ton of damage tokens on incoming baddies.  additionally, it means your heroes waste actions sitting around. \n\nAs for the deck, I would ditch the Power of Earth and rain of Arrows.  I would add in Dwarven Axe.  If you can keep your threat down, send Thalin questing, give Dunhere a dwarven axe and a blade of Gondlin, he can one shot foes like a Beast Master and even kill a chieftan before he ever engages you.  I think that, at the end of the day, you are going to want more allies in the deck.  Without allies and without healing you are going to get worn down.  Tossing in a couple of goons from tactics or even wandering tooks would help fill out the deck. \n\nSo, something like this to start with\n\n-3 Rain of Arrows, -1 Strength of Will, - 3 Strength of Earth, -1 Hasty Strike\n\n+2 Dwarven Tomb, +3 Dwarven Axe, +1 Northern Tracker, +1Wandering Took, +1 Dwarven Axmen\n\nI still think you might need more allies, but I love the idea of the deck and think that the changes could maintain the concept"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476467","commentId":476467,"userName":"luckritze","timestamp":1306670821,"content":"Legolas wants to fight with his \"Blades Of Gondolin\", so he can get you markers on the quests.\n\nSpirit on the other hand wants to keep the Threat-Level low, to leave those minions in the staging-area.\n\nThis isn't a bad sinergy as one might think, because you can always pick the foes YOU WANT to fight against, one at a time. It also fits your \"sneaky\"-theme very well, because it feels like \"sniping\" single targets per round, while the rest of the enemies can't react to it.\n\nStill, as you already mentioned, you will find yourself overwhelmed over time. Attaching more \"bad ass stuff\" to Legolas won't change anything. \"Rain Of Arrows\" won't help you either, because even with 3x \"Unexpected Courage\" on Legolas AND 3x \"RoA\" you won't be able to defend AND kill those enemies alone. It would work against up to two enemies, maybe three if you didn't quest with your other two heroes (which is unlikely).\n\nSo you will need allies. Don't be too dependend on Legolas and get yourself a \"Horn Of Gondor\". This comes at some cost, because you can't attach two \"Blades Of Gondolin\" to Legolas anymore, but it is way better than dying to a swarm of minions. With the \"Horn Of Gondor\" you can actually effort to get some decent Tactics-Allies which aren't necesserily chump-blockers. Take a look at those fine \"Veteran Axemen\" and \"Gondorian Spearmen\". The first isn't just a chump-blocker. The letter can block without dying if he manages to kill his opponent. \"Swift Strike\" and \"Stand Together\" help that purpose a lot. If they didn't manage to kill the enemy... well, you got one step closer to butcher the enemy with your \"RoA\"s, right?! their purpose in the deck would be more than just twofold.\n\nThose allies are there to buy Legolas some time. Remember that he is a \"Hero\" for a reason. Allies can't be as good as him. But they can complement his fighting-style.\n\nAlso I agree about Dunhere for Elanor. He will help you get rid of enemies in the staging area and wield the other two \"Blades Of Gondolin\".\n\nI'd say:\n\n- 3x \"Strength Of Will\"\n- 2x \"A Test Of Will\"\n- 1x \"Citadel Plate\"\n- 1x \"Fortune Or Fate\"\n\n+ 3x \"Gondorian Spearman\"\n+ 2x \"Horn Of Gondor\"\n+ 1x \"Stand Together\"\n+ 1x \"Northern Tracker\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476477","commentId":476477,"userName":"Bohemond2","timestamp":1306672437,"content":"In a 50 card deck without anyway to draw additional cards, I wouldn't count on drawing all three of your Blades.  Even if a game goes for 12-15 rounds, you would be fortunate to pull two from your deck.  If you want to keep in rain of arrows, you need to add Horseback Archers.  Rain has miserable synergy with Legolas, voiding his special ability, the archers give you a way to play the card. \n\nI agree with luckrize that the Plate of the citadel, All of the strength of will, and probably fortune and fate should be cut.  I think that cutting the Test of wills is a mistake, because treachery can potentially punish you and without healing you have no way to recover.  Horn of gonder is a decent card, but I don't think it synergizes with the other elements of the deck.  If you want to selectivly snipe opponents, you won't be regularly losing enough allies to make the card with it. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476486","commentId":476486,"userName":"servant of the secret fire","timestamp":1306673171,"content":"Two things matters in this game:\n\nCan my starting heroes pass the first 3-4 rounds?\n\nCan i manage threat?\n\nIf you don't have both of them you will have  hard times in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476582","commentId":476582,"userName":"yashamaru","timestamp":1306683547,"content":" Yeah I am still learning the game and getting familiar with the cards. Today I have played my first cooperation and game is much much easier than solo play. I appreciate all your suggestions. I need some time to test them all out. \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476599","commentId":476599,"userName":"servant of the secret fire","timestamp":1306684828,"content":"Yeap,and some cards and abilities don't work wen you play solo but in a coop game they can make the difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476616","commentId":476616,"userName":"Bohemond2","timestamp":1306686824,"content":"I think the game is more fun in co-op anyway, and rewards a greater variety of decks.  Dunhere becomes less usefull the more players you have.  Someone is always playing the deck with Glorfindel, Aragorn and Gimli and starting out with 65,243 threat, which ruins your sneaking plans. \n\nOkay, that may be an exaggeration, but it IS a lot harder to keep the threat of a whole group low, which lowers Dunhere's effectiveness."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476634","commentId":476634,"userName":"Puzzle2","timestamp":1306689337,"content":"I have been running a similar deck, although I am limited to one core set right now. I am also using Dunhere instead of Eleanor to pick off enemies still in the staging area. If I get a Blade of Gondolin on him it also gives me some extra progress tokens on the current quest.\n\nI agree with some of the other recommendations here on Rain of Arrows. Especially with only one ranged character (Legolas), who you will want to save to actually attack and get some progress rather than exhaust for card effects. I recommend:\n\n- Rain of Arrows x3; - Fortune or Fate x1; - Citadel Plate x1\n\n+ Horn of Gondor x1; + Veteran Axehand x3; + Stand and Fight x1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476635","commentId":476635,"userName":"Puzzle2","timestamp":1306689411,"content":"Puzzle said:\n\n + Stand and Fight x1\n\n\n\nThat was meant to be Stand Together. Too many card names running through my head."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=476940","commentId":476940,"userName":"Maniacske","timestamp":1306741694,"content":"I'd switch the Citadel Plate for a Horn of Gondor too.\n\nI play a similar deck built around the same three heroes and like it very much. In 2 and 3-player games it performs very well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=477653","commentId":477653,"userName":"yashamaru","timestamp":1306845991,"content":" Hey all again. After some testing I would like to share this with you. It is my opinion on tactic/spirit deck and cards choice. Please note that below are just my personal impressions with which you can and most like will disagree. Anyway I would like to present what I have learned so far from playing the game.\n\n \n\nI focus on the solo play since for me it feels more challenging that cooperation mode. (Some cards are ridiculously strong in coop and just not that great in solo for example Horn of Gondor (it depends on deck though).\n\n \n\nFirst of all I have chosen tactics because I like combat theme in general (in fantasy). I have never been a big fan of magic stuff. There is nothing which cannot be solved by cold steel. Spirit is nice addition to tactic because weak side of one is strong side of another. I think of that as raw power synergy. You will be strong both in questing and in combat. Weakness is that you will lack support for example healing or draw engine which could be provided by lore.\n\n \n\nDue to lack of support it feels like you have only one shot. Either all goes well and you do a lot with what you have or something goes wrong and all goes to hell. To make sure we end up in the first category we need strong card which are consistent and as less conditional as possible.\n\n \n\nMy heres are Eowyn because she is very good in questing. I have changed Eleanor for Gimli because Legolas missed him. And Legolas because I love the guy.\n\n \n\nYou guys have convinced me that allies are necessity. I agree now after some testing they are great. I was worried that they would ruin my I have cool self -reliant group of heroes feeling but they do not. I use all available ones at the moment mostly because I have no other choice. First to go will be Horseback Archers since casting cost 3 is pretty steep. It feels like I pay one additional resource for ranged trait which I dont really need for solo deck.\n\n \n\nVeteran Axehand is kinda ok. Gondorian Spearmen is pretty good especially with Swift Strike.\n\n \n\nFrom the blue allies I use Lorien Guides and Northen Trackers. Their ability helps with Questing where you need every little edge you can get at the moment. (In the future I will probably trade Tracker guy for something cheaper from expansions).\n\n \n\nBlade of Gondolin, Faint, Quick Strike are great cards which I do not need to comment on.\n\n \n\nDwarven Axe is not as hot as cards above but with Gimli its ok to run them until better equipment is out. \n\n \n\nUnlike most of you I actually like Citadel Plate I need Gimli to absorb alot of damage and most importantly I need him to be able to kill the bosses. With attack of 10 he can punch pretty hard.\n\n \n\nAt the moment I am not fan of Horn of Gondor as it does not give me immediate support. Usually I am in need of cards which would help me now not later.\n\n \n\nI use Blade Mastery because it is cheap and sometimes +1 is important.\n\n \n\nUnexpected Courage is allowing Gimli to quest and defend or defend and attack in one round. In my opinion it is very good card.\n\n \n\nI run both Hasty Stroke and A Test of Will. Both are cheap good cards which will negate random stuff which could eventually cost you a game. With Dwarven Tomb it is like you are running six of those.\n\n \n\nThe Galadhrim´s Greeting has good cost/power ration so I run those too.\n\n \n\nThree Gandalves and one random Beorn and thats it.\n\n \n\nI thin Stand and Fight is great card because it can reanimate stuff from other colors for example Miner of the Iron Hills or Snowborn Scout. You can discard those into Eowyn but I am still testing this.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=477839","commentId":477839,"userName":"Mestrahd","timestamp":1306862247,"content":"I think your assessments nailed it except for possibly one. The Northern Tracker is the best ally Spirit has, and arguably one of the best in the game right now. You could probably cut the Lorien Guides if you need room as the Trackers function more efficiently."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=484219","commentId":484219,"userName":"Blepta","timestamp":1307887567,"content":"Hello,\n\nI think you can have in your deck only 1 copy of Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=484238","commentId":484238,"userName":"qwertyuiop","timestamp":1307890905,"content":"Blepta said:\n\n \n\nHello,\n\nI think you can have in your deck only 1 copy of Gandalf.\n\n \n\n \n\n \n\nThis is not true.\n\n \n\nTo the OP,\n\nStand and Fight is pretty good for playing Gandalf and extra  time, and it mixes well with other sphere allies and Eowyn's ability to dump a card to boost Spirit.  Gondorian Spearmen can get some extra use, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=484255","commentId":484255,"userName":"Blepta","timestamp":1307893864,"content":"In the rule book on the page 10 is written: Each starter deck should also include 1 copy of the neutral ally card, Gandalf.\n\nSo, I can have 3 copyies of Gandalf in my own deck? It would be great :-)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47514-ur-legolas-eowyn-eleanor/?do=findComment&comment=484261","commentId":484261,"userName":"Spirit Juggler","timestamp":1307894463,"content":"You can. It's for the basic starters that you can only have one Gandalf in as that makes up the 30 card deck limit. Also they don't provide enough Gandalfs for 3 in each. "}]}