{"url":"https://community.fantasyflightgames.com/topic/47547-storing-and-organizing-the-cards/","title":"Storing and Organizing the cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47547-storing-and-organizing-the-cards/?do=findComment&comment=476551","commentId":476551,"userName":"Ulairi","timestamp":1306680752,"content":" Hi All,\n\n \n\nThis is my first card game and I'm wondering what people are using to store and keep their cards organized? I just purchased some of the card protectors from the FFG website but once I recieve them, I don't want the cards just hanging loose in the box and risk some getting lost. Do you guys think any organizers will be released for the game? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47547-storing-and-organizing-the-cards/?do=findComment&comment=476767","commentId":476767,"userName":"geristor","timestamp":1306711799,"content":"if fantasy flight games themselves do not provide card cases, boxes etc. the cards themselves are the same size as standard magic cards for which there is a veritable plethora of cases and boxes available, though of course without a middle earth motiff.\n\nat the moment im using a standard small holder for the quest cards and just standrad clear sleeves for the rest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47547-storing-and-organizing-the-cards/?do=findComment&comment=476784","commentId":476784,"userName":"Narsil0420","timestamp":1306717186,"content":"I'm using Ultra-Pro Deck boxes, one in each color of the four spheres and a black box plus a black double box for the Encounter cards. I use a little draw string sack for the tokens. It's all very portable which is nice, I can throw it in my satchel and take the cards wherever I want!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47547-storing-and-organizing-the-cards/?do=findComment&comment=476881","commentId":476881,"userName":"Vyron2","timestamp":1306732559,"content":" let's hope that FFG provides us with some nice storage options... I already saw some nice artwork sleeves by ffg!!!!!! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47547-storing-and-organizing-the-cards/?do=findComment&comment=480584","commentId":480584,"userName":"Kitsune Rei","timestamp":1307279442,"content":"Yeah, the FFG sleeves look very nice! I'll probably pick up a set.\n\nI've just been using the Ultra Pro sleeves to sleeve my current decks and the scenario cards. The remaining cards I'm not using I keep in a regular cardbox, and my current decks I keep in the Ultra Pro boxes. They're regular size cards so you can use whatever you want really, there's tons of stuff on the market since they can be used for Magic and such too. I though I'd even seen plastic divider cards which may be useful."}]}