{"url":"https://community.fantasyflightgames.com/topic/47571-about-attack-twice-per-turn-and-about-dunhere/","title":"about attack twice per turn and about Dunhere","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47571-about-attack-twice-per-turn-and-about-dunhere/?do=findComment&comment=476807","commentId":476807,"userName":"Glaurung","timestamp":1306720246,"content":"Hi to everyone. I think i misunderstood some part of the rules about attack. Please help me with that!!!!\n\nSo if  after all enemy attacks resolves and i still have some ready heroes i can attack my self right???  Exchausts  any of my heroes to do so. After if i have UC on my hero i can ready him and  attack again right??? Only i cannot attack same enemy twice right??? So in case of Dunhere i can attack enemy engaged with me + after i can enemy on the staging area? I get it right??? \n\nIf so it make game more easy for me. Before i thought each hero can attack only once per turn. Now if i got it each hero can attack as many time as he can but each enemy only once right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47571-about-attack-twice-per-turn-and-about-dunhere/?do=findComment&comment=476824","commentId":476824,"userName":"Vitimus","timestamp":1306724383,"content":"The rules say \"When a card has been \"used\" for some purpose, such as to commit to a quest, to attack, to defend, or to use a character ability...\" so I have been playing that as soon as you do any of those, including attacking, your character is exhausted, so your characters cannot attack more than once."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47571-about-attack-twice-per-turn-and-about-dunhere/?do=findComment&comment=476831","commentId":476831,"userName":"Glaurung","timestamp":1306725366,"content":"Yes they cannot attack if they are exauhsted alreasy. But if you have some card or action for example Unexpected Courage you can ready them and attack again?\n\nThat was my question. I want to be sure can i do it or not????"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47571-about-attack-twice-per-turn-and-about-dunhere/?do=findComment&comment=476838","commentId":476838,"userName":"Glaurung","timestamp":1306726414,"content":"Let me clear my question once and for all!\n\nI have Aragorn ready with Unexpected Courage and game have a combat phase begin. I have 2 enemies engaged me, both have 2 hit point(Aragorn attack 3).\n\nThe enemies attack and i decide block 1 with another hero(legolas) and second enemy attack is undefended.\n\nAfter ememies attack is resolve and udefended damage token is place on the single hero i declare Aragorn to attack(exhaust him to do so)) 1 enemy and kill him, use U.Courage to ready Aragorn and attack(exhaust him again) second enemy and kill him too.\n\nCan i do that or not???\n\nSorry for my english but i hope you understand what i mean."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47571-about-attack-twice-per-turn-and-about-dunhere/?do=findComment&comment=476874","commentId":476874,"userName":"Vyron2","timestamp":1306731614,"content":" we had a previous thread where we discussed this, but to answer your question:\n\n \n\nOF COURSE! that's the beauty of UC - attack twice, only not the same enemy... so with dunhere, e.g. you can attack 2 different enemies in the staging area, 1 in the staging area, 1 engaged with you.... or with aragorn, you can attack 2 different enemies engaged with you!\n\n \n\nimage having THREE unexpected courage on a hero :DDDD e.g. gimli with citadel plate and 5-6 damage tokens and a dwarven axe... MMMMMMMMULTIKILL!!!!!! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47571-about-attack-twice-per-turn-and-about-dunhere/?do=findComment&comment=476901","commentId":476901,"userName":"Glaurung","timestamp":1306734538,"content":"Thanks man!!!! It change a lot for me. The game will be little bit easy from now. So i have more opportunity in my strategy.\n\n "}]}