{"url":"https://community.fantasyflightgames.com/topic/47596-gandalfs-boating-invitation-a-solo-session-report/","title":"&quot;Gandalf&#039;s boating invitation&quot; A solo session report","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47596-gandalfs-boating-invitation-a-solo-session-report/?do=findComment&comment=477076","commentId":477076,"userName":"Tranenturm","timestamp":1306764433,"content":"Denethor was visiting Rivendell in order to consult Glorfindel when Gloin happened upon them and offered an invitation.\n\n“Hey guys, Gandalf sent me this cryptic note about boats, the Aduin, and an urgent meeting. Sounds like fun, you guys in?”\n\nGlorfindel and Denethor, impressed by this Dwarfs charisma and leadership immediately joined in. Little did they know of Gloin’s evil plans …\n[Party starting Threat of 29]\n\nCrossing the Misty Mtns went surprisingly smooth, but soon they were beset upon by a Hill Troll. The Troll appeared to not notice them at first, but it was also in their path with no god ways around it. So they stalled looking for a plan. They began by recruiting a few allies they knew were close by.\n\nDenethor had brought a scout from Rohan with him. They didn’t seem too close as Denethor sent him straight into a orc attack coming our way. Glorfindel meanwhile had his personal minstral sing everyone a song to keep spirits up. This further irked Gloin, seeing as Glorfindel had pushed him to the front when the orcs from Dol Guilder ambushed the two of them as they searched for a way to the river. Who brings a minstal to a fight?\n\nRealizing they weren’t going to go around the Troll, they laid a trap for it. Denethor distracted it yelling “For Gondor” or some such. He succeeded into luring it into the largest snare you’ve ever seen. Good thing trolls are dumb.\n\nBut before they could finish it off, they were beset by a Marsh adder that crawled out of the nearby Gladden “Fields”. I say “fields” as there ain’t no solid ground anywhere in there. (Glorfindel would later go spray some snake poison all over it) Well, we couldn’t let a marsh adder go around and spook all the locals so Denethor again volunteered to be bait for another trap.\n[Party Threat up to 34 from a few sources, including the adder]\n\nSoon after, Chieftan Ufthak came around to visit his pet. He was pretty miffed we had killed it, so we invited him over to explain our side of things. Denethor listened to his arguments while Glorfindel and a few more friends explained our side.\n\nWell, we had finally gathered a grand ol party and finally decided it was time to roast the troll on the banks of the river. That night while celebrating, Gloin got out the ol cards. Never play poker with a dwarf. Pretty soon Denethor and Glorfindel were in pretty deep. I don’t what’s worse, Glorfindel losing Celebrian’s stone he was “keeping safe” for Aragorn, or Denethor having to give over his Steward of Gondor title to a dwarf. Evil plans accomplished.\n\nDenethor, being pretty steemed, just wanted to go home. He got his son Faramir to unpack his highly portable jet racing boat, and in two quick turns they were down the river.\n[With the help of Faramir and a large party, they generated 22 Will the first turn and 16 the next. A bunch of locations came up]\n\nWell, that boat apparently scared away most everything. The only things waiting on the banks were a few bats and two little goblins. Oh, and Gandalf appeared very briefly twice and then left right away, apparently embarrassed by needing assistance with such meager enemies.\n[Two Gandalf flashes: final threat of 24]\n[14 victory points from Ufthak, the Troll, the Adder, and the Gladden Fields]\n\n------------\n\nThe Deck:\nI obviously went with Denethor, Glorfindel, and Gloin for a Lore/Leadership deck made from a single core set. I find it amazing that all three characters are underused according to Fanatasy Flight’s quest log stats, particularly the lore side. Lore’s primary strength is healing which is great for a long slow grind of building up resources. Provided this deck can survive the early game, it will steamroll late. Leadership just rounds things out and gives the deck enough punch to make it through.\n\nDenethor provides encounter scouting which means the worst of the encounter deck will pass you by (well, be delayed to the bottom of the deck). Combined with Henamarth Riversong you can properly plan for the staging part of the quest phase. Plus Denethor’s ability works well with his defensive role (ie, you’re rarely going to send him questing so he’s still productive later)\n\nGloin goes from being rather mediocre to a Resource machine. With the ability to heal him from the lore side, he can take damage and then power out the more expensive Leadership cards balancing the resource needs pretty well. Slapping a Steward of Gondor on him helps as well, but that came relatively late in my game.\n\nGlorfindel worked as my early quester and then switched to beat stick once Gloin picked up the Stone. I needed the 3 attack more than I needed a 5 will (versus a 4 will) quester. Plus, there are enough encouter cards which damage people on quests so Gloin’s ability was triggering more often than as a beatstick. (Denethor was playing defense when I needed it)\n\nBanks of the Anduin was great for me. Denethor's encounter deck scouting allowed me to carefully plan Will levels in quest to make sure Banks didn't go on top just before combat. I did this many times to give an easy draw the following turn to concentrate on whatever my big problem was at the moment.\n\nEdited for grammer and style. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47596-gandalfs-boating-invitation-a-solo-session-report/?do=findComment&comment=477110","commentId":477110,"userName":"Kyle371","timestamp":1306767566,"content":"Really enjoyed reading the report - very entertaining.\n\nI wonder if the deck would perform as well in the Mirkwood?\n\nAny chance you could post the decklist?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47596-gandalfs-boating-invitation-a-solo-session-report/?do=findComment&comment=477188","commentId":477188,"userName":"Morbid666","timestamp":1306780500,"content":"That was pretty cool. If  you can i'd like to see you film  this stuff and put it up on youtube with a link here in the forums! keep posting."}]}