{"url":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/","title":"Hunt for Gollum retailers?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=477766","commentId":477766,"userName":"Ismar","timestamp":1306855417,"content":" Did i miss the announcment for which retailers will run the preview event?  My local game store did get selected, and I'm curious howmany others, if any, in my area will run it.\n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=477800","commentId":477800,"userName":"Ulairi","timestamp":1306858147,"content":"Ismar said:\n\n Did i miss the announcment for which retailers will run the preview event?  My local game store did get selected, and I'm curious howmany others, if any, in my area will run it.\n\nThanks\n\n\n\n \n\nThey haven't announced anything yet. The deadline to apply was this past Friday."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=477887","commentId":477887,"userName":"BoundForGlory","timestamp":1306867186,"content":"Ulairi said:\n\nIsmar said:\n\n \n\n Did i miss the announcment for which retailers will run the preview event?  My local game store did get selected, and I'm curious howmany others, if any, in my area will run it.\n\nThanks\n\n \n\n \n\n \n\nThey haven't announced anything yet. The deadline to apply was this past Friday.\n\n\n\nThe article said \"We will list the participating venues here on our website on Tuesday, May 31st.\"\n\nI'm looking forward to seeing this list, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=477968","commentId":477968,"userName":"Berning22","timestamp":1306881696,"content":" My LGS (Art of War) in Cincinnati got confirmation today. Put no list on the site.\n\nI would assume most stores will get a preview. What is the downside for FFG if all LGS had the preview??\n\nIt seems to me they threw this together to delay the release. Not sure why?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=477972","commentId":477972,"userName":"BoundForGlory","timestamp":1306882869,"content":"Berning22 said:\n\n My LGS (Art of War) in Cincinnati got confirmation today. Put no list on the site.\n\nI would assume most stores will get a preview. What is the downside for FFG if all LGS had the preview??\n\nIt seems to me they threw this together to delay the release. Not sure why?\n\n\n\nThe sets got delayed at the printer.  This is not new to card game companies.\n\nThe Hunt for Gollum is probably on the slow boat from China.  But, FFG was kind enough to air freight enough of them to send a few to some stores, so that players could experience a preview event.\n\nAnother company I know sometimes air freights just enough of the new product to bring to their national tournament.  Then the rest of the product arrives weeks later on the ship into California, and then is shipped across the country in a container, by truck or train.\n\nMy guess is that FFG realized that the players were looking forward to The Hunt for Gollum, and felt bad about the delay, so they paid some extra $ to air freight a few hundred THfG sets for the preview events, to tide over their most rabid fans.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=477978","commentId":477978,"userName":"Berning22","timestamp":1306884059,"content":" Really??? You think so? How can a 20 card set get delayed at the printer? Why would a company only print one set a time. Does not make good business sense. FFG is a very smart and strong company. They have people telling them when to release material and when to hold onto to try to increase demand. They are not just willy nilly releasing expansions. There is a purpose for all of their timing of releases.\n\nIf I were FFG, I would have had the core set and at least 6 of expansion printed at the same time & shipped at the same time!\n\nI think they were waiting for the second printing of the core set to hit the stores and let those players play with the core set for a while.\n\nJust my $.02"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478041","commentId":478041,"userName":"jhaelen","timestamp":1306897405,"content":"Berning22 said:\n\nIf I were FFG, I would have had the core set and at least 6 of expansion printed at the same time & shipped at the same time!\n\n\n\nI think you should send FFG your CV and resume ASAP! I have no idea how this company survived until today without brilliant people like you happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478061","commentId":478061,"userName":"KlAve","timestamp":1306900830,"content":"Berning22 said:\n\nHow can a 20 card set get delayed at the printer?\n\nIt's not a 20 card set. The first expansion includes 1 hero, 9 hero cards (3 of each) and a new quest, presumably with new encounter cards. Quite a bit more than 20 different cards, I would presume."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478149","commentId":478149,"userName":"Berning22","timestamp":1306912061,"content":"jhaelen said:\n\nBerning22 said:\n\n \n\nIf I were FFG, I would have had the core set and at least 6 of expansion printed at the same time & shipped at the same time!\n\n \n\nI think you should send FFG your CV and resume ASAP! I have no idea how this company survived until today without brilliant people like you happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n \n\n\n\n \n\nGood one - my point was they are not printing one set at a time. That would be good business. Have you guys ever seen an uncut sheet. They use to give them out back in the day for L5R. One expansion is probably on one sheet. They are not going to make one expansion, print it, package it up and then wait a month to do the same thing again for the next expansion. I am sure they had all of the first 6 expansions created and printed at the same time with the core box set. I would bet they are sitting at the FFG warehouse as we speak.\n\nStill not list for retailers for Hunt for Gollum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478179","commentId":478179,"userName":"jhaelen","timestamp":1306914832,"content":"Berning22 said:\n\nThey are not going to make one expansion, print it, package it up and then wait a month to do the same thing again for the next expansion. I am sure they had all of the first 6 expansions created and printed at the same time with the core box set. I would bet they are sitting at the FFG warehouse as we speak.\nI'd take your bet!\n\nYou may not have noticed, but FFG has released 'a few' games besides LotR. So, at the same time one (or more) APs for LotR went to print, one (or more) APs for the other LCGs went to print, too. Just check the 'Upcoming' page to get an idea what is currently at the printers.\n\nThe world doesn't revolve on the LotR LCG (yet)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478586","commentId":478586,"userName":"Ismar","timestamp":1306950304,"content":" They updated the preview event news page with a Tuesday June 1st (should be Wednesday maybe) date for the retailer list, but still no update today.\n\nHow long does it take to put the list up?\n\nI find it a bit ironic that thay (FFG) are behind, since they sent my local game store their email acceptance at 5pm on Friday, and told them to order the event kit by Tueday.  With Monday being a holiday, it didn't give much lead time.\n\nStill waiting for any news.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478667","commentId":478667,"userName":"Mestrahd","timestamp":1306956753,"content":"Well, the list is up now, and the closest one to me is about 2 hours away. Probably a little far, so I'll just wait patiently for it to release to the general public."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478741","commentId":478741,"userName":"Berning22","timestamp":1306969419,"content":"jhaelen said:\n\nJust check the 'Upcoming' page to get an idea what is currently at the printers.\n\n\n\nThis is getting boring - but do you really believe what they put up on the \"upcoming\" page? They always have lots of games at Gen Con that are still on the \"at the printers\" or \"shipping\" list and then retailers do not see them until December. They also had the Gears of War in the design phase up until a couple of weeks ago and now they are ready to release in less than 3 months??? We have already seen post production materials.\n\nBack to LCG - I think it is kind of funny that you think they only print one expansion at a time. Do you really think this would be cost effective? That is why I said I would bet they don't - it does not make good business sense to just print one at a time.\n\nAnd finally - not sure where you got that i thought everything revolved around LOTR game.\n\noh well - have a great night!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=478818","commentId":478818,"userName":"jhaelen","timestamp":1306987642,"content":"Berning22 said:\n\nAnd finally - not sure where you got that i thought everything revolved around LOTR game.\n\n\n\nYou proposed they should have printed every future release for LOTR already designed at the same time. Had FFG done that, it would have been at the expense of other game lines since they could not do the same for every forthcoming release of every game line. If they did that, they'd be insolvent in no time at all!\n\nAlso: Do you have any idea about the cost of storage? Printing tons (literally!) of cards just to keep them in storage for almost a year would be a pretty bad business decision. Print runs are planned in such a way that storage time is minimal. Ideally, after receiving the final product from the printer, it's forwarded to resellers immediately to avoid long time storage.\n\nPreviews of games, e.g. at Cons are either done using the results of test runs, i.e. they don't necessarily use the final product, or small volume runs created specifically so you can show and sell a few copies exclusively at the Con. Naturally, such small volume print runs are more expensive, so they have to judge if it's worth it having them for such preview events."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=479111","commentId":479111,"userName":"Berning22","timestamp":1307024541,"content":" I take it from your responses you do not know someone that works for FFG - nuff said!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=480591","commentId":480591,"userName":"Kitsune Rei","timestamp":1307280271,"content":"I also figure they'd want to see the response to the first expansion pack release to get an idea of how many they should print in subsequent runs. People will be pretty mad if they run out right away! And the core set is already scheduled for a 2nd print run. I think its pretty important to make sure the core set is available again to keep going with expansions. And hey maybe Gollum will end up needing another print run.\n\nMost FF games seem to use decks of cards. I'm sure they're all queued waiting their turn to be printed so there's always something printing. I know I have no idea how long it takes to make a normal size production run of cards plus how long shipping is. Its a shame Gollum, was delayed, but things happen, and I'm glad they decided to ship copies early to do an event rather than just making us wait.\n\nIn case you missed it, here's the list- www.fantasyflightgames.com/edge_news.asp [http://www.fantasyflightgames.com/edge_news.asp?eidn=2324]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=480939","commentId":480939,"userName":"jhaelen","timestamp":1307337340,"content":"Berning22 said:\n\n nuff said!\n\n\n\nExactly what I thought! demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47651-hunt-for-gollum-retailers/?do=findComment&comment=481241","commentId":481241,"userName":"JerusalemJones","timestamp":1307370116,"content":"In regards to how FFG prints their LCG expansions, their initial plan was to have all 6 packs in a cycle hit the printer at the same time, ship back to the USA at the same time, and then release them monthy, so there would (in theory) be no lag time between monthly releases.\n\nIn practice, this only happened with the first two/three cycles. By the time Warhammer was ready to hit the streets, FFG suddenly had enough product between the LCG lines and all their other product to be shipping packs on a month-by-month basis. Also, as was pointed out, paying for 6 months worth of product but selling it 1/6 at a time means less money is available for other projects.\n\nThe proof of this is their release schedule. If FFG had product in it's warehouse, they would always hit the 2/3/4 Tuesday of each month as a release date for their packs. Instead, they are often released 5 or 6 and occasionally even 8 weeks apart (and we're not talking between cycles, we're talking packs int he same cycle). It might be that FFg is accepting 2 or 3 packs at a time, but I doubt they are taking in all 6 at a time anymore."}]}