{"url":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/","title":"Singles Purchase","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=480278","commentId":480278,"userName":"The Strolling Bones","timestamp":1307214138,"content":"What do you think the likelihood of us being able to buy singles for this game is?  There are so many cards in the core set that I'd like to have at least 3 copies of but as it stands we have to purchase 3 core sets to make that a possiblility.  I cant justify that because I don't need more encounter cards, or quest cards or hero cards.  Just Player Deck cards.  So how can one get around this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=480292","commentId":480292,"userName":"SiCK_Boy","timestamp":1307217258,"content":"If you look on eBay and do a search on \"LOTR LCG\", you'll see some guy is selling singles (the \"unique\" cards form the Core Set). He's currently asking 3,00 $ each. He did try it earlier at 5,00 $ each, but I don't think he got any offer, thus the lower price now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=480453","commentId":480453,"userName":"The Strolling Bones","timestamp":1307258198,"content":"I found some @ Lord of the Rings Fantasy Flight Living Card Game [http://www.toywiz.com/lotrlcg.html]\n\nDont buy them all before i get a chance to ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=480473","commentId":480473,"userName":"Ulairi","timestamp":1307262858,"content":"At $3 a pop, singles most likely won't be a cost effective way of completing a play set. I just bit the bullet and bought three core sets which netted about $100 so that's not too big of an investment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=480579","commentId":480579,"userName":"Kitsune Rei","timestamp":1307278573,"content":"I really don't know why anyone would want to buy another set of the encounter cards (other than a handful of people who may have lost a card or who want to build their own encounter) so I'm not really sure how selling them singly could be profitable. But hey, glad to see someone did it! Looks like they're making their money back off the rares, but the prices aren't unreasonable. I would be tempted to pick up a couple of my favorites, there's only a few I'd really want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=480854","commentId":480854,"userName":"signoftheserpent","timestamp":1307324450,"content":"The core set has some of the worst distribution i've ever seen, and for no good reason.\n\nExpecting peopel to buy multiple core sets is pure avarice and has cost them my respect. I don't want the game anymore and I rather regret my purchase for this reason. The gameplay is fine, although no treally suitable solo.\n\nFFG really really should release the core set differently and not treat customers this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=480920","commentId":480920,"userName":"Mighty Jim 83","timestamp":1307335401,"content":"The Strolling Bones said:\n\nI found some @ Lord of the Rings Fantasy Flight Living Card Game [http://www.toywiz.com/lotrlcg.html]\n\nDont buy them all before i get a chance to ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n\n\n \n\n$44 for 1x each of the rares, or $35 for an extra core set. Doesn't seem like a great deal to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481208","commentId":481208,"userName":"Toqtamish","timestamp":1307366970,"content":"signoftheserpent said:\n\nThe core set has some of the worst distribution I've ever seen, and for no good reason.\n\nExpecting people to buy multiple core sets is pure avarice and has cost them my respect. I don't want the game anymore and I rather regret my purchase for this reason. The gameplay is fine, although not really suitable solo.\n\nFFG really really should release the core set differently and not treat customers this way.\n\n\n\n \n\nFFG is not mistreating anyone. All core sets for all LCGs are released this way. They release them for card variety not quantity. It will not change. YOU DON'T NEED 3 OF EVERY CARD TO PLAY. I cannot say that enough. I think people are too use to the ccgs that you need playsets of to build a deck. You don't need that in any of the LCGs and even less in LotR since it is cooperative game.\n\n(I changed your post to fix your spelling errors to make it more clear)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481393","commentId":481393,"userName":"SiCK_Boy","timestamp":1307387814,"content":"You don't need 3 of each, but having that 2nd or 3rd Unexpected Courage or Celebrian's Stone does make a major difference in a deck. Even being able to draw Henamarth Riversong more reliably makes Lore a much more attracting option (especialy when playing solo).\n\nIt isn't to say that additional copies of these cards are essential, but they change the way a deck plays. Even having a third Sneak Attack makes a difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481528","commentId":481528,"userName":"signoftheserpent","timestamp":1307411881,"content":"Toqtamish said:\n\nsignoftheserpent said:\n\n \n\nThe core set has some of the worst distribution I've ever seen, and for no good reason.\n\nExpecting people to buy multiple core sets is pure avarice and has cost them my respect. I don't want the game anymore and I rather regret my purchase for this reason. The gameplay is fine, although not really suitable solo.\n\nFFG really really should release the core set differently and not treat customers this way.\n\n \n\n \n\n \n\nFFG is not mistreating anyone. All core sets for all LCGs are released this way. They release them for card variety not quantity. It will not change. YOU DON'T NEED 3 OF EVERY CARD TO PLAY. I cannot say that enough. I think people are too use to the ccgs that you need playsets of to build a deck. You don't need that in any of the LCGs and even less in LotR since it is cooperative game.\n\n(I changed your post to fix your spelling errors to make it more clear)\n\n\n\nThis is just an excuse. FFG could very easily have provided 3x every card. The only alternative- the only way to get the necessary multiples - is to buy an entire core set...again. This won't even give you 3x certain cards either, which is inexcusable. The amount of redudant product, wasted materials and dimishing returns is costly. It's a very very poor way to treat paying customers impressed enough with the game that want to play it properly.\n\nYes you can 'play' the game as is. But you are not playing it properly: all you are doing is drawing cards from a random heap and hoping things go your way. That might appeal to you, fine, but it's not playing the game properly. That means deckbuilding, constructing decks from what they do give you - some cards are including in some multiple (just nowhere near enough). So FFG have rewarded people that want to get into the game at it's fullest level (the people more likely to buy the adventure packs) by making them buy at least 2 core sets. That's disgusting. You can't even play single sphere decks legally as there aren't even 50 cards per sphere. Instead you have to fudge it. So you aren't even playing the game at all. It's a ridiculous way to design a product."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481543","commentId":481543,"userName":"jhaelen","timestamp":1307415279,"content":"signoftheserpent said:\n\nThis is just an excuse. FFG could very easily have provided 3x every card. The only alternative- the only way to get the necessary multiples - is to buy an entire core set...again. This won't even give you 3x certain cards either, which is inexcusable. The amount of redudant product, wasted materials and dimishing returns is costly. It's a very very poor way to treat paying customers impressed enough with the game that want to play it properly.\nIt's not an excuse, it's a well-reasoned business decision.\n\nLotR is a strong license and the game sold very well because of it. I'd take every bet that the majority of buyers are NOT playing it the way you consider to be 'properly'. The game has sufficient appeal to be played casually without doing any kind of deckbuilding.\n\nPlayers that are attracted to the game because of the deckbuilding aspect, e.g. former (or current) MtG players will have no problem buying multiple core sets.\n\nLike it or not: You're in the minority."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481552","commentId":481552,"userName":"signoftheserpent","timestamp":1307415975,"content":"jhaelen said:\n\nsignoftheserpent said:\n\nThis is just an excuse. FFG could very easily have provided 3x every card. The only alternative- the only way to get the necessary multiples - is to buy an entire core set...again. This won't even give you 3x certain cards either, which is inexcusable. The amount of redudant product, wasted materials and dimishing returns is costly. It's a very very poor way to treat paying customers impressed enough with the game that want to play it properly.\n\nIt's not an excuse, it's a well-reasoned business decision.\n\n \n\nLotR is a strong license and the game sold very well because of it. I'd take every bet that the majority of buyers are NOT playing it the way you consider to be 'properly'. The game has sufficient appeal to be played casually without doing any kind of deckbuilding.\n\nPlayers that are attracted to the game because of the deckbuilding aspect, e.g. former (or current) MtG players will have no problem buying multiple core sets.\n\nLike it or not: You're in the minority.\n\n\n\nYou can't assume that people drawn to deckbuilding will have no problem spending another £30 on what is, in real terms, half the content (since the rest is wasted).\n\nI think it deeply sad that FFG couldn't go the extra mile to make it easier to get those cards - from players that are thus comitted to the game. Not catering to people that are committed to your product in this way is poor business sense. This isn't a masterstroek from FFG's bean counters, it's short sightedness.\n\nAnd for that reason I've been trying to sell my core set. I don't have the money to spare for a second set and as a result I'm deeply disappointed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481696","commentId":481696,"userName":"Toqtamish","timestamp":1307442137,"content":"I am sure you will not have a hard time selling it. Its sold out WORLDWIDE so its a hot item right now. So obviously FFG's core set model is perfectly fine. I don't see AGoT hurting either. I have two of its core sets and will happily buy a 3rd one when I get the chance. Good luck finding a ccg that lets you get a playset for as cheap as any of FFG's LCG's, hell you could buy a play set of ALL of FFG's LCG's and still wind up cheaper than buying a playset of some CCG's out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481774","commentId":481774,"userName":"signoftheserpent","timestamp":1307451076,"content":"Toqtamish said:\n\n \n\nI am sure you will not have a hard time selling it. Its sold out WORLDWIDE so its a hot item right now.\n\n \n\nNot that hot; noone's taken any interest and the price online has plummeted.\n\n \n\nWhether LCG's are cheaper than old style CCG's is not really the point.\n\nI have no problem with the core set being priced as it is.\n\nWhat i have a problem with is the dreadful card distribution. It's unplayable and being thus compelled to buy another core set (which would have half the cards wasted straight off the bat) I find objectionable.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481781","commentId":481781,"userName":"Mestrahd","timestamp":1307453564,"content":"I had absolutely no qualms about buying 3 sets. For $120 I got a playset of every card and extras of the rest. For $120 in ANY CCG, you could get maybe 2 booster boxes which only guarantees you about 48 rares, of which they are not all desirable. And you certainly would not get a playset of anything guaranteed. I do agree that the monthly packs should be 3x, but even if they weren't it's not the end of the world. The pricing on LCG's is so much better than CCGs it's not even funny."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481842","commentId":481842,"userName":"Bohemond2","timestamp":1307460383,"content":"signoftheserpent said:\n\nWhat i have a problem with is the dreadful card distribution. It's unplayable and being thus compelled to buy another core set (which would have half the cards wasted straight off the bat) I find objectionable.\n\n \n\nIf you want to complain about pricing, so be it.  But spare use the ridiculous claims about the game being \"unplayable\" with one core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481868","commentId":481868,"userName":"signoftheserpent","timestamp":1307463086,"content":"Mestrahd said:\n\nI had absolutely no qualms about buying 3 sets. For $120 I got a playset of every card and extras of the rest. For $120 in ANY CCG, you could get maybe 2 booster boxes which only guarantees you about 48 rares, of which they are not all desirable. And you certainly would not get a playset of anything guaranteed. I do agree that the monthly packs should be 3x, but even if they weren't it's not the end of the world. The pricing on LCG's is so much better than CCGs it's not even funny.\n\n\n\nThe pricing is better, but that's not really the point is it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=481900","commentId":481900,"userName":"Mestrahd","timestamp":1307468822,"content":"So, what IS your point? That FFG is a business and would like to make some money? That they realize not every player is a completionist or professional and one core set might appeal to that crowd? If you were able to just buy one of every set and have every card you need, you could count the number of players exactly by the units sold. If that number were low, the game would die from lack of income."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482000","commentId":482000,"userName":"Ulairi","timestamp":1307488735,"content":"signoftheserpent said:\n\nMestrahd said:\n\n \n\nI had absolutely no qualms about buying 3 sets. For $120 I got a playset of every card and extras of the rest. For $120 in ANY CCG, you could get maybe 2 booster boxes which only guarantees you about 48 rares, of which they are not all desirable. And you certainly would not get a playset of anything guaranteed. I do agree that the monthly packs should be 3x, but even if they weren't it's not the end of the world. The pricing on LCG's is so much better than CCGs it's not even funny.\n\n \n\nThe pricing is better, but that's not really the point is it.\n\n \n\n\n\n \n\nWhat is your point? The game is affordable if you want to build a complete play set. The game is completely playable for two players with just one box. The game has been found to be quite popular due to the sell out. You're complaining that FFG isn't placating your niche or minority desires? $120 and you have all the cards you need. That is quite inexpensive. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482033","commentId":482033,"userName":"Vyron2","timestamp":1307496863,"content":" I don't know about you guys, but coming from a rich ccg-background of several years - I can only say, that FFG's LCG model is awesome. 100 $ for 3 core sets! heck, 35$ for ONE core set is awesome! If I think about MtG or Decipher's Game where one deck costs roughly about 20 $ (!!!!!!!!) and you only get 60 cards, no tokens, no dials, no rulebook, etc.... THAT is avarice...\n\n \n\nthe core set is beautifully designed, the quality of the cards, dials, tokens is TOP NOTCH - and that of the rulebook, too, btw... for a fair price. As long as only the core set has such a distribution, this is FINE! the adventure packs will have 3x of all the cards, bar the hero, I presume, so that should be more than enough...\n\n \n\nthink about how much money you spent for other stuff.... I spent about 2-3k $ for LOTR Decipher back in the day and haven't got all the cards by far...\n\n \n\nccg=money grab, lcg=going easy on the casual and \"professional\" gamer alike... just quit smoking or drinking for a week - and you can buy yourself  a core set... ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482056","commentId":482056,"userName":"signoftheserpent","timestamp":1307500541,"content":"Mestrahd said:\n\nSo, what IS your point? That FFG is a business and would like to make some money? That they realize not every player is a completionist or professional and one core set might appeal to that crowd? If you were able to just buy one of every set and have every card you need, you could count the number of players exactly by the units sold. If that number were low, the game would die from lack of income.\n\n\n\nIf i begrudged FFG money i wouldn't have brought the core set at all. That's a fatuous argument. All i'm suggesting is they release the cards needed to fill out proper multiples in a friendlier way than having to pay for an entire core set again. What do i do with all the cards I won't need to own again - encounter cards, quest cards etc? Throw them away? It's not as if there is any other way of using them.\n\nLots of people may be buying the game, but whether they will be impressed enough to stay with the game is another matter entirely.\n\nI have no problem with anyone else spending their money as they please. That, again, isn't the point. The point is: the only way to get the extra carsd you need (and you will need them if you are going to play the game properly) is to buy an entirely new core set, warts and all.\n\nI think that is poor game design. It's inefficient and inelegant and it shows that FFG don't hold their fans in very high regard because the peopel most likely to get into the game are the ones most in need of the multiples. If you are happy with just tinking with the core set as is then you are more likely not going to invest in this game in the long run. That's the flaw in FFG's thinking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482098","commentId":482098,"userName":"jhaelen","timestamp":1307505145,"content":"signoftheserpent said:\n\nIf i begrudged FFG money i wouldn't have brought the core set at all. That's a fatuous argument. All i'm suggesting is they release the cards needed to fill out proper multiples in a friendlier way than having to pay for an entire core set again. What do i do with all the cards I won't need to own again - encounter cards, quest cards etc? Throw them away? It's not as if there is any other way of using them.\n\nYou could sell the cards you don't need or you could use/create fan-based scenarios using them.\n\n \n\nsignoftheserpent said:\n\nI think that is poor game design. It's inefficient and inelegant and it shows that FFG don't hold their fans in very high regard because the peopel most likely to get into the game are the ones most in need of the multiples. If you are happy with just tinking with the core set as is then you are more likely not going to invest in this game in the long run. That's the flaw in FFG's thinking.\nI beg to differ: It's actually brilliant.\n\nIt shows that FFG knows very well what pricepoint is appropriate and what they can and cannot sell to their customers.\n\nPersonally, I don't see any need to buy additional core sets, but judging by the number of posts I'Ve seen of customers buying two or even three core sets, there's been plenty who didn't mind the price or the 'useless' cards.\n\nAnd if you were right, and the game stops being considered 'hot', why, then you're in luck: It should then be easy to get the cards you want for an excellent price. All it requires is patience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482131","commentId":482131,"userName":"signoftheserpent","timestamp":1307511307,"content":"jhaelen said:\n\n \n\nYou could sell the cards you don't need or you could use/create fan-based scenarios using them.\n\n I beg to differ: It's actually brilliant.\n\nIt shows that FFG knows very well what pricepoint is appropriate and what they can and cannot sell to their customers.\n\nPersonally, I don't see any need to buy additional core sets, but judging by the number of posts I'Ve seen of customers buying two or even three core sets, there's been plenty who didn't mind the price or the 'useless' cards.\n\nAnd if you were right, and the game stops being considered 'hot', why, then you're in luck: It should then be easy to get the cards you want for an excellent price. All it requires is patience.\n\nI could sell the cards to who, exactly? Who is interested in buying a completely redundant set of cards they can't use alone and will already own if they play the game? There's no other market. That's the whole point. I have no interest in creating 'fan based' scenarios and why would I need extra encounter cards to do it - I already own them!\n\nClearly you don't understand any of this.\n\nThe need to buy the core sets is obvious: there aren't enough copies of all the player cards in the box. You need those cards to play the game properly.\n\nIf you're happy randomly building silly decks and not being able to play the game properly as opposed to drawing any old random rubbish, whether it fits a strategy or is even playable (such as including 3 cost cards paid for by one hero in your deck only) that's fine. But don't pretend that's playing the game properly. if it was FFG wouldn't have included multiples at all. This isn't Poker or Rummy, it's CCG deckbuilding which is entirely different. That's how the game is meant to be played, and that's why they tell you the rules for deckbuilding.\n\nHow you can defend a half baked marketing choice beggars belief. You simply don't understand at all what I'm saying to you. Either try and listen or don't respond because anything else is just insulting. No one has complained about the price of the core set: it's the distribution of cards. The people that buy 3x core set do so because they are happy to spend the extra money. That's their choice. It's also, again, irrelevant. The point is not whether or not some people can. It's whether they should have to. FFG could very easily rectify this mistake but they don't. That tells me they don't care about my money. That's fine, I don't have to support their game. Constantly defending this lazy nonsense is demeaning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482156","commentId":482156,"userName":"ClydeCloggie","timestamp":1307515351,"content":"Bohemond said:\n\n \n\nIf you want to complain about pricing, so be it.  But spare use the ridiculous claims about the game being \"unplayable\" with one core set.\n\n\n\n \n\n+1.\n\n \n\nHad a fantastic game against Anduin last night, solo with one core set. Was close to winning but just lost against a late horror encounter deck draw (Brown Lands, Crows surging a second Brown Lands, +9 threat taking me to 51 from the relative safety of 42 in one fell swoop). Best game so far. Unplayable, pfah."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482160","commentId":482160,"userName":"AUCodeMonkey","timestamp":1307516045,"content":"As described by Louis CK in the video above, this is a case of \"Everything's amazing, and nobody's happy.\" Here's how your situation should go:\n\nsignoftheserpent: Hey, there's an awesome new game I can play, and I can play it differently if I buy another copy or 2. Sounds AWESOME.\n\nAND THAT'S IT.\n\nInstead, your tack is this:\n\nsignoftheserpent: Hey, there's this game that I know, in my stupid brain, should be done differently. I want to play it differently than the designers intended coming out of the box, but I don't want to spend any more money. How DARE they not read my dumb mind and cave to my cheap nature! You know, I'm going to get on the forums for this game, and complain to the 85% of people who actually enjoy it for what it is. And if they ***** and moan about how they've thought more about this issue than me, since my dinosaur brain is incapable of drawing conclusions outside of myself, and have come to the conclusion that what I'm complaining about is crap, I am going to continue to try and convert them to my line of thinking by calling THEM dumb. HEY PEOPLE ON THE FORUM, JOIN MY CULT OF IGNORANCE AND HATE. WHERE ARE YOU GOING? THE KOOL-AID IS TASTY IF YOU LIKE BILE!!!!\n\nI know I shouldn't feed the trolls, but God bless... The fact that jhalen is always happy with 1 copy of every card (in this game and CoC), that I'm perfectly happy buying 3 core sets, and we represent the majority of the consumer base, hey guess what? FFG is not going to change their model because of the OVERWHELMING SATISFACTION OF ITS CONSUMER BASE. If it ain't broke...\n\nIf you need something to complain about, find something real. Go to Agra, India, and let them catch you stealing. Oh, you lost your hand? Hey there's something to complain about, especially with the likely infection you'll get from the impromptu amputation.\n\nCheers.\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482658","commentId":482658,"userName":"kufel2","timestamp":1307592717,"content":"I have spare Polish LOTR LCG cards.\n\nNow they are on Polish Trade site but if someone is interested I can put them on Ebay\n\nallegro.pl/listing.php/user [http://allegro.pl/listing.php/user?us_id=115260]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482788","commentId":482788,"userName":"jhaelen","timestamp":1307608933,"content":"signoftheserpent said:\n\nI could sell the cards to who, exactly? Who is interested in buying a completely redundant set of cards they can't use alone and will already own if they play the game? There's no other market. That's the whole point. I have no interest in creating 'fan based' scenarios and why would I need extra encounter cards to do it - I already own them!\n\nClearly you don't understand any of this.\n\nThe need to buy the core sets is obvious: there aren't enough copies of all the player cards in the box. You need those cards to play the game properly.\n\nIf you're happy randomly building silly decks and not being able to play the game properly as opposed to drawing any old random rubbish, whether it fits a strategy or is even playable (such as including 3 cost cards paid for by one hero in your deck only) that's fine. But don't pretend that's playing the game properly. if it was FFG wouldn't have included multiples at all. This isn't Poker or Rummy, it's CCG deckbuilding which is entirely different. That's how the game is meant to be played, and that's why they tell you the rules for deckbuilding.\n\nHow you can defend a half baked marketing choice beggars belief. You simply don't understand at all what I'm saying to you. Either try and listen or don't respond because anything else is just insulting. No one has complained about the price of the core set: it's the distribution of cards. The people that buy 3x core set do so because they are happy to spend the extra money. That's their choice. It's also, again, irrelevant. The point is not whether or not some people can. It's whether they should have to. FFG could very easily rectify this mistake but they don't. That tells me they don't care about my money. That's fine, I don't have to support their game. Constantly defending this lazy nonsense is demeaning.\n\n\n\nAfter buying a second core set you will have four copies of player cards that come with two copies in a single set. Since you only ever need three copies you can sell these to a player who has bought only one core set. To sweeten the deal you add any other cards you want to get rid of that noone would want to buy separately.\n\nAlso, my dear signoftheserpent, clearly you are the one who doesn't understand any of this!\n\nThe proper way to play this game is to play using a single core set with the pre-built decks.\n\nThe core set has been created with the goal to appeal to casual gamers and Tolkien fans. Casual gamers care about having fun. Toklien fans care about the theme and artwork. That the game has elements that may appeal to more 'serious' gamers and will eventually be appealing to players enjoying deckbuilding is clearly a bonus.\n\nObviously, your limited world-view revolves around competitive CCGs. That's fine but you may want to ponder on the difference between a competitive CCG and a cooperative LCG for a moment.\n\nI think, you need to understand that you belong to a minority. Your views do not represent everyone else's view.\n\nThe only person who's been insulting so far, has been you. Get a grip, dude! Chill down and think before you post!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482848","commentId":482848,"userName":"Titan","timestamp":1307614368,"content":"The factor that handicaps this game is the need for an encounter deck. Otherwise you could have every card be a player's card as opposed to 84 slots taken up by the opposition. FFG is attempting to appeal to all kinds of gamers, casual and hardcore. They keep the cost fairly low for the casual and are betting that the hardcore will be willing to spend extra for more cards. They've gotten it from both sides, as we have had people complain that there should have been less doubles and triples and more variety. \n\nThe core set already brings a grand total of 226 cards. In order to have 3 of each, that number would have had to be increased to about 280 cards. All in one package, which means that it would have been far more expensive to buy. If you can't afford to buy 2 core sets could you afford a more expensive one? Maybe, maybe not. But it certainly could scare off the casual players who make up the core of the game. It's either that or having 3 of everything but far less variety to keep the price the same.\n\nLastly, believe it not, FFG has improved the model already. Warhammer Invasion had a core set, a cycle of 6 packs and another box set out before they switched to a 3 of everything format. Here, we are getting 3 of everything already in the first pack. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482906","commentId":482906,"userName":"The Strolling Bones","timestamp":1307618025,"content":"Wow this thread took off like a bolt.  I agree about the price point of buying the singles from that website not making sense after doing the math, but I just cannot justify buying 2 core sets let alone 3.  I have no need for more hero, quest or encounter cards so why would I buy another core set?  I like the Idea of having 2 more threat trackers but not 4 more and why would I want 6 copies of \"The Old Forest Road\"?  I think that all of the player deck cards should've come in sets of 3 so that you had more viable deck building options.  I feel that the nature of this game and the freshness of it has it at a disadvantage when it comes to deck building.  I've tried to build solid decks but the options are too limiting.  If I had three copies each of \"Unexpected Courage\", \"Celebrian's Stone\", \"Steward of Gondor\" and \"Grim Resolve\" I could make a deck that the encounter deck would have a hard time beating.... well it would at least give me a fighting chance each time I sat down to play. \n\nThis game is hard enough as it is without adding in even more difficulty buy limiting the options of attaining singles from the core set. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482911","commentId":482911,"userName":"The Strolling Bones","timestamp":1307618407,"content":"Titan said:\n\nThe core set already brings a grand total of 226 cards. In order to have 3 of each, that number would have had to be increased to about 280 cards. All in one package, which means that it would have been far more expensive to buy. If you can't afford to buy 2 core sets could you afford a more expensive one? Maybe, maybe not. But it certainly could scare off the casual players who make up the core of the game. It's either that or having 3 of everything but far less variety to keep the price the same.\n\nLastly, believe it not, FFG has improved the model already. Warhammer Invasion had a core set, a cycle of 6 packs and another box set out before they switched to a 3 of everything format. Here, we are getting 3 of everything already in the first pack. \n\n\n\n \n\nI'm not trying to complain here, but the producers could've included the 54 cards for no more than a 15$ increase so I'd say that buying a core set for 55$ as opposed to 3 core sets for 120$ is a significant savings.  This would've provided a more \"user friendly\" product as opposed to a more \"business friendly\" model.  I'm sure that everybody who bought the game for 40$ would've bought it for 55$ if they knew that the game was more modifiable and flexible right out of the box.  I am glad that the LCG format is getting better; however, do I have to wait for the next LCG to come out before I'm greeted with deck maximum's of all cards in the core set?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482948","commentId":482948,"userName":"Titan","timestamp":1307621846,"content":"Who knows? However, according to what I've heard, this might be as good as it gets.................... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=482964","commentId":482964,"userName":"Kyle371","timestamp":1307622963,"content":"Maybe FFG would consider marketing a 'top up pack' for those 54 cards to make the single core set up to a full play set? Presumably this could only cost around the same as an expansion set as it would have about the same number of cards. \n\nOn the other side of the coin though, it may not be good business sense if people are buying more than 1 core set..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=483110","commentId":483110,"userName":"Mestrahd","timestamp":1307642787,"content":"Just a FYI to Strolling Bones, if you buy 3 cores, that means you have 3 sets of Orc cards, which means you can build each scenario and not have to resort between quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=483131","commentId":483131,"userName":"SiCK_Boy","timestamp":1307644888,"content":"Until expansion packs come along... (adventure packs will make use of the same encounter decks we have in the core set)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=483409","commentId":483409,"userName":"felix16","timestamp":1307708901,"content":" The fact that you can build multiple encounter decks if you have several core sets is actually a good one. That way you don´t need to separate and re-mix to play another scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=483772","commentId":483772,"userName":"The Strolling Bones","timestamp":1307780885,"content":"I can see a tiny bit of utility with the \"full\" encounter decks for each quest; however, the way that I have organized my cards makes swapping a few cards out to play a new quest relatively quick and painless.  I do like the idea of having more encounter cards for the possibility of creating custom encounter decks but the game is still so fresh that this seems like only a viable game plan later down the road.\n\nAll I want are the extra player relevant cards, not even the Heros, just the player deck cards.  Once again I'm not complaining just wishfully thinking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=483817","commentId":483817,"userName":"SiCK_Boy","timestamp":1307787753,"content":"Maybe the \"print on demand\" feature could be used by FFG to provide this \"core set completion pack\" to their players. Even if they were pricing it higher than a second core set, they could probably sell some (so long as the price is lower than for 2 additional core sets). A lot of the complains weren't so much about the additional cost of the extra core sets, but about the waste of cards and material they represent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=484200","commentId":484200,"userName":"Spirit Juggler","timestamp":1307882345,"content":"I play it fine with one core set though I will get a second core at some point when I have some money. I need more Gandalfs :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I want to be able to have two or three decks built up and ready to go without having to pull cards out and mix them around any more than necessary. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47885-singles-purchase/?do=findComment&comment=493224","commentId":493224,"userName":"Iver2","timestamp":1309405020,"content":"Hmm, really weird thoughts some people have here ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nNo offence, but on the one hand people complain the game is too easy and on the other hand they want 3 gandalfs and 3 unexpected courage in their deck...well, maybe for Solo that is necessary to win let say \"Anduin\" or \"dol gundor\", but still, after all the expansions have been released, image the amount of cards for each sphere. That will give players that only own one core set great deck building abilities!\n\nJust my 2 cents guys! When you play solo, you have a good enough choice of good cards for your deck (if its too hard for you, take a hero or two more if u need to... ), with 2 players, the game is really well balanced with the core sent from my experience! Its even playable with 3 players,  I did that and  we still had fun building decks and deciding which heros who takes and so on...\n\nAnd please stop the intolerance and rants here, this forum has been so greatly low on hate-carp, let's try to keep it that way please. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}