{"url":"https://community.fantasyflightgames.com/topic/47927-undefended/","title":"Undefended?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=480661","commentId":480661,"userName":"American63","timestamp":1307290078,"content":" Not too sure of how undefending works. Why do you undefend? Is it because you might have or do not want to exhaust another hero?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=480668","commentId":480668,"userName":"Dam the Man","timestamp":1307290977,"content":"American63 said:\n\n Not too sure of how undefending works. Why do you undefend? Is it because you might have or do not want to exhaust another hero?\n\n\n\nMaybe another Enemy got a Shadow Effect that exhausted your other character that was supposed to block another Enemy. Or you think you can take the damage and need to attack the Enemy, if you defend you'll be unable to attack with that character so you take your chances."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=480669","commentId":480669,"userName":"lleimmoen","timestamp":1307291041,"content":"Yes. One may choose to let an attack go undefended in order not to exhaust a character. The attacking enemy's attack strength (plus potential bonus) then goes all to a chosen hero. The un-exhausted character may then do actions requiring exhaustion, attacking for instance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=480736","commentId":480736,"userName":"Hahma","timestamp":1307301448,"content":"The scary thing about going undefended is that some Shadow cards hit you extra hard if the enemy's attack goes undefended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=480890","commentId":480890,"userName":"Doom1502","timestamp":1307330959,"content":"Jop, in most cases taking eastern crows undefended is no problem... but there is allways the one case when they get the dol guldur orcs as a shadow effect .... and gone is one hero (I know, except he ones with 5 hitpoints orr citadel plate).\n\nWhen taking an attack undefendet is is always nice to have a spiritdeck or a friendly player with spirit nerby to play the cancel-shadow-effect-card (don't kow the name right now) if things come to the worst."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=480902","commentId":480902,"userName":"Rashley","timestamp":1307333133,"content":"Everyone above has helped you with the 'undefended' problem, which boils down to taking a risk to save an exhaustion.  Just taking the basic Core Set, I worked it out at about 45% chance of getting a 'Shadow Effect', of which about 90% would be worse for being undefended.  These are only rough guides, but may help in deciding if the risk is worth it.  Just remember that undefended damage must go onto 1 Hero fully ie no defence reduction!   Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=481787","commentId":481787,"userName":"American63","timestamp":1307454363,"content":"Many thanks gentlemen, that's cleared it up. Thanks for your time and trouble. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=482373","commentId":482373,"userName":"Periculum","timestamp":1307540581,"content":"I've actually noticed a nice little play with Gimli and going undefended. Take the damage from the undefended attack and drop it on Gimli and POOF! Beatstick! I know normally the game will wound you anyway and you probably wont need to get tokens on Gimli, but in desperate situations, I can see this as a strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=482514","commentId":482514,"userName":"Mestrahd","timestamp":1307557382,"content":"Be careful with that though. I used that technique when he had 1 damage on him against a Beastmaster and pulled Dol Goldur Orcs and Despair as my shadow cards. That equals one dead Gimli!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=482740","commentId":482740,"userName":"ClydeCloggie","timestamp":1307604140,"content":"Mestrahd said:\n\nBe careful with that though. I used that technique when he had 1 damage on him against a Beastmaster and pulled Dol Goldur Orcs and Despair as my shadow cards. That equals one dead Gimli!\n\n\n\nUndefended against a Beastmaster is a big no-no because of the double Shadow whammy. i only go undefended against fairly harmless enemies like the Bats, Crows or a previously engaged Forest Spider.  And even then only in times of great necessity or when all Dol Guldur Orcs are in the discard pile.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=482778","commentId":482778,"userName":"Mestrahd","timestamp":1307608321,"content":"Technically I DID defend against the Beastmaster. I was expecting 2-3 damage tops but got 4 thanks to Despair."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=482801","commentId":482801,"userName":"Cabelos","timestamp":1307609936,"content":"I lost a hero in round one doing this one time. Ouch! We didn't beat the scenario that time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47927-undefended/?do=findComment&comment=482812","commentId":482812,"userName":"Titan","timestamp":1307610489,"content":"I do it too, but with Gloin instead. He takes damage, gains tons of counters and then I heal him either with Self Preservation or Daughter of the Nimrodel. Unfortunately, in my last game I had a very similar situation to the one described above. The Eastern Crows with Dol Guldur Orcs as shadow card. Goodbye Gloin. Fortunately, I had Brok Ironfist in my hand and he went right into play. I was also fairly advanced  at that point so, I managed to win the game."}]}