{"url":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/","title":"Dead Marshes, finally a preview","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/?do=findComment&comment=481238","commentId":481238,"userName":"richsabre","timestamp":1307369717,"content":"nice, sounds good, would like to have seen more than 1 card though"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/?do=findComment&comment=481286","commentId":481286,"userName":"Mestrahd","timestamp":1307374466,"content":"Especially one card that they don't really explain the mechanic of. I mean, what is Escape 3? What happens to Gollum if you fail the check? Heck, what IS Gollum, an ally, an objective, an encounter card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/?do=findComment&comment=481396","commentId":481396,"userName":"SiCK_Boy","timestamp":1307388087,"content":"Gollum is probably an objective card.\n\nEscape looks like a mechanic that requires you to \"test\" your Willpower. I'd bet it's something like: exhaust any number of characters, then reveal X cards (X being define by the Escape keyword... in the example provided, it would be 3) and compare your character's willpower to the threat of the revealed cards (similar to questing).\n\nRevealing cards from the encounter deck is pretty much the only way to generate random numbers in that game, unless you add dices.\n\nAs for what happens to Gollum, he probably either returns to the encounter deck or is set aside and you have to capture him again. It could be that the quest puts a restriction such as not being able to add progress unless you capture Gollum in the first place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/?do=findComment&comment=481399","commentId":481399,"userName":"Titan","timestamp":1307388833,"content":"It appears to be a quest-like mechanic, but it uses your attack as opposed to willpower. I wonder if you will have to exhaust characters for it, or whatever you happen to have in play at the time counts. The last one makes a little more sense to me because it is termed a \"check\" and would actually make sense that the more characters you have in play, beating the bush for Gollum, so to speak, the easier it would be to prevent his escape. It also appears different in that you do not increase your threat by the amount you fail the check but by a set amount. \n\nGollum must either be an objective or an enemy( I can't imagine him being an ally) You might probably have to separate him from the encounter deck at some point(A la Hill Troll or Nazgul) Wonder what the darn resource counters on him will do.\n \nIt also seems apparent that one reason why the new packs will not use the encounter decks from the core set is because these new sets have mechanics endemic to that particular encounter that the older encounters don't support."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/?do=findComment&comment=481411","commentId":481411,"userName":"servant of the secret fire","timestamp":1307389452,"content":"Don't follow the lights."},{"commentUrl":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/?do=findComment&comment=481510","commentId":481510,"userName":"timbolton","timestamp":1307409324,"content":"servant of the secret fire said:\n\nDon't follow the lights.\n\n\n\nWhere's the like button on here heh ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/47979-dead-marshes-finally-a-preview/?do=findComment&comment=482035","commentId":482035,"userName":"Vyron2","timestamp":1307497133,"content":" oh boy... that's one downside aspect - I just hope I don't end up with 30 different encounter sets and then having to mix them accordingly for each single scenario... that'd be a pain in the *** cool.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/cool.gif]"}]}