{"url":"https://community.fantasyflightgames.com/topic/48062-played-this-deck-recently-and-gandalf-seems-to-be-the-only-bomb/","title":"Played this deck recently and Gandalf seems to be the only bomb!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48062-played-this-deck-recently-and-gandalf-seems-to-be-the-only-bomb/?do=findComment&comment=482070","commentId":482070,"userName":"gone questing","timestamp":1307502433,"content":"I couldn't paste my decklist in the format i'd like to (as a table) so had to group cards in their mulitples, which is generally 'x3' of anyway.\n\n\nI wanted to play a deck with two spirit heroes, because i'd played them least, and because I wanted to make use of the beefy, Northern Tracker!\n\nI tried to make the cards in the deck, lop-sided towards spirit. At this stage of the game, i'm not sold on what the best way to play a 2, 1 hero setup is. My brother prefers to play the single hero sphere with 1 cost cards only.\nI decided to save my resources to play some of my lore cards for maximum effect since i'd only draw 3-4 a game. Gandalf's Search has cost X which works well in this setup. If I draw too many lore cards, I can cycle it, if I don't see a lore card for a while, it can be used as a one shot manipulator, as it did in one game paying 4 for it.\n\nNOTE: Lorien's Wealth would have been as good or better in that instance as I used Gandalf's Search to find Gandalf, who drew 3.\nAny card draw seems more imporant in this game than other CCGs since you can often play it on either player and at times, while trying to manage two spheres, there is just a glut of resources and no cards to use them with!\n \n\nIn regard to spirit, I planned to not always move to locations, depending on my cards in play/hand and the game status. If I had an enemey I would need to battle soon, I may quest and move to the location so that next turn, I didn't have to commit too much to the quest, instead battling.\nI would also plan on taking some attack undefended if I needed an extra body, as these two spheres don't look too battle ready. Henemarth, A Light in the Dark, Hasty Stroke, Stand and Fight (with Gandalf) could help this.\n\n\n\nGlorfindel\nDunhere\nEleanor\n\nLore (15)\n\nx3 (ie. 3 of...)\n1 Protector of Lorien\n1 Henemarth Riversong\n3 Daughter of the Nimrodel\nX Gandalf's Search\n\nx2\n2 Gleowine\n\nx1\n5 Beorn's Hospitality\n\n\nSpirit (32)\n\nx3\n1 A Test of Will\n1 Hasty Stroke\n1 Power in the Earth\n2 A Light in the Dark\n2 Unexpected Courage\n2 Wandering Took\n3 The Galadhrim's Greeting\n3 Lorien Guide\n4 Northern Tracker\nX Stand and Fight\n\nx2\n0 Strength of Will\n\n\nx3\n5 Gandalf\n\n\n\nIn this two player game, my brother used Aragorn, Theodred, Legolas. Legolas was very useful and in general, Ranged and Sentinel are quite good.\n\nOur 6 heroes got stomped in the Journey Down the Anduin on the first turn, where we never recovered, losing convincingly with few progress tokens. We quested with 8 willpower with Eleanor available to use her ability as the only ready hero, and both players < 30 threat, but had a total threat level of 12 from 5+ cards, and the Troll was a wrecking ball on the first turn!\n\nNOTE: I find it really hard to believe that The Galadhrim's Greeting is the card to have in this scenario, which is the impression I get from the LotR LCG community... and thus, that spirit is being overplayed. It simply delays the inevitable.\nThere is rarely a turn more fragile than turn 1!\nThere have been two player games where 6 cards come out from the encounter deck in a single quest phase, where Necromancer's Reach, Evil Storm, Necromancer's Reach appears on the final stage of the Anduin scenario ... the encounter decks are made really well! It doesn't matter that there is no opponent to play against as they are just built that nicely, and freak combinations do come out and wreak havoc!\n\n\nAnyway, in the second game we got rolling a little bit more normally and built up well. We were questing for ~18 on the second quest of the scenario, and just broke even! :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\nGandalf's Search was used as the only card that could use Glorfindel's resources, besides him, which could be a bad deckbuilding choice, but it did allow Steward of Gondor tokens to be used to their fullest where they had been stockpiling.\nNorthern Tracker removed 11 threat from the staging area when questing, at one point where we could not escape a location glut!\nWandering Took wasn't that bad, and comboed well with The Galadhrim's Greeting to effectively reduce each player's threat by 3.\nHasty Stroke was good.\nGandalf seemed to be played too much! I played him twice by his text, then once with Stand and Fight, while my brother played him up to four times with Sneak Attack and Gandalf's own text. He did manage to get Gandalf returned to hand as well via Pursued by Shadow, which was nice. Also, it seems to be that of Gandalf's optional entering-play effects, he seems to always come out guns blazing!\n\n\nI hope you've enjoyed this post :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48062-played-this-deck-recently-and-gandalf-seems-to-be-the-only-bomb/?do=findComment&comment=482153","commentId":482153,"userName":"SiCK_Boy","timestamp":1307514906,"content":"The Galadrim's Greetings delays the inevitable, but also allows you to build your army while waiting for the inevitable. It can also give you some turns to find Gandalf, which is usually key in killing the Troll.\n\nI think the main weakness of your deck is not using Eowyn. She's a monster for questing, even more so with 2 players. By simply switching Eowyn instead of Eleanor and adding Denethor instead of Glorfindel, you actually lower your starting threat and get a better setup. You still keep a \"quester\" and get a defender in Denethor (similar to the role you'd give to Eleanor anyway)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48062-played-this-deck-recently-and-gandalf-seems-to-be-the-only-bomb/?do=findComment&comment=482374","commentId":482374,"userName":"servant of the secret fire","timestamp":1307540651,"content":"Glorfindel,Eowyn and Eleanor is my favorite lore/spirit deck.Unexpected courage on Glorfindel makes him a beast and forest snare is not only the way to kill the troll but also to stay as log as you want in the 1B card and build your army.Give it a try and you will see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48062-played-this-deck-recently-and-gandalf-seems-to-be-the-only-bomb/?do=findComment&comment=482417","commentId":482417,"userName":"Bohemond2","timestamp":1307545442,"content":"I would add, though I like both Dunhere and Glorfindel, they don't work especially well together.  With his high threat and top-notch attack and spirit, Glorfindel wants to be paired with a top notch defender who he can heal.  Though he can quest at times, you want him attack as well, or he is an over -costed Eowyn.  Dunhere, in contrast, benefits from a very low threat and works best in a team that can operate under the radar. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48062-played-this-deck-recently-and-gandalf-seems-to-be-the-only-bomb/?do=findComment&comment=482563","commentId":482563,"userName":"gone questing","timestamp":1307563566,"content":"@ SiCK_Boy: Glorfindel, Eowyn was my previous deck, so am mixing it up a bit. Switching two characters makes the deck a fair bit different. I feel that spriit's weakness is that it has no teeth, and moving away from Glorfindel emphasises that. I would have little attack in that setup.\n\nEowyn is great, but very boring. Even if you have four allies questing later in the game, it doesn't free her up since she doesn't do anything else remotely well. I would prefer to use her with Beravor, Dunhere, or with Leadership or Tactics.\nI'm not sure if I like a pure questing deck, where player 2 does all the battling. Even with the option to engage an enemy, depending on who goes first, an enemy will sneak in and become engaged with you. You really need to be able to defend and attack back, which usually means not questing as much in a given turn. I don't want Denethor tied up all game defending against the same enemy ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThat's not soley directed at what you wrote, but what you wrote made me think about the above.\n\n\n@ Bohemond: Some of those points I totally agree with... the other point, Glorfindel paired with a defender he can heal... never really thought about that, thanks! Quality post, good info :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}