{"url":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/","title":"Favourite Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=482312","commentId":482312,"userName":"lleimmoen","timestamp":1307534094,"content":"As I promised in my Sneak Attack thread, I will ask about your favourite cards. I will start with my ranking in each category (excluding Heroes).\n\nAlly\n\n1 Gandalf\n\n2 Northern Tracker\n\n3 Faramir\n\n4 Beorn\n\n5 Daughter of the Nimrodel\n\nAttachment\n\n1 Steward of Gondor\n\n2 Unexpected Courage\n\n3 Protector of Lorien\n\n4 Celebrian's Stone\n\n5 Forest Snare\n\nEvent\n\n1 Sneak Attack\n\n2 Ever Vigilant\n\n3 A Test of Will\n\n4 Feint\n\n5 The Galadhrim's Greeting\n\n...of course this could/will change easily with time/experience. Just to run out a brief sphere summary:\n\nTactics: #4 Ally,  #4 Event\n\nLeadership: #3 Ally, #1&4 Attachment, #1&2 Event\n\nSpirit: #2 Ally, #2 Attachment, #3&5 Event\n\nLore: #5 Ally, #3&5 Attachment\n\nI think Lore does not have clearly exceptional cards for the first look but is very strong overall, probably my favourite sphere, also thematicaly. Leadership is obviously great although most of their Allies are terrible. Spirit is the best helping sphere, I'd say. Tactics may well improve with new cards and challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=482557","commentId":482557,"userName":"SiCK_Boy","timestamp":1307562464,"content":"Hemanarth Riversong should be there in your ally list. His power is especially useful when playing solo, as it allows you to perfectly plan your questing phase. I also prefer Gleowyne over Daughter of the Nimrodel. In both cases, making use of Denethor or Bereavor (respectively) reduces the usefulness of those allies as their powers are redundant. I'm also finding the Miner of the Iron Hill more and more useful: it gets rid of the Caught in a Web attachment and also lets you play an early Steward of Gondor on a hero and then getting rid of it to play a second copy on a different hero.\n\nI think the Tactics attachments should also be given more consideration, especially over Protector of Lorien. The Dwarven Axe and the Horn of Gondor are both better, in my opinion. The Citadel Plate requires a much heavier commitment to the Tactics sphere, which isn't as easy to do (and still keep a very effective deck), but is also generally better. Even the Blade of Gondolin comes in more useful than the Protector in my view."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=482581","commentId":482581,"userName":"servant of the secret fire","timestamp":1307566998,"content":"SiCK_Boy said:\n\n \n\nI think the Tactics attachments should also be given more consideration, especially over Protector of Lorien. The Dwarven Axe and the Horn of Gondor are both better, in my opinion.\n\n\n\nRealy???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=482636","commentId":482636,"userName":"Narsil0420","timestamp":1307578424,"content":"SiCK_Boy said:\n\n I'm also finding the Miner of the Iron Hill more and more useful: it gets rid of the Caught in a Web attachment and also lets you play an early Steward of Gondor on a hero and then getting rid of it to play a second copy on a different hero.\n\n\n\nSorry to spoil your fun but you can't use Miner to get rid of an attachment card. It only works on Conditions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=482774","commentId":482774,"userName":"lleimmoen","timestamp":1307607614,"content":"SiCK_Boy said:\n\nHemanarth Riversong should be there in your ally list. His power is especially useful when playing solo, as it allows you to perfectly plan your questing phase. I also prefer Gleowyne over Daughter of the Nimrodel. In both cases, making use of Denethor or Bereavor (respectively) reduces the usefulness of those allies as their powers are redundant. I'm also finding the Miner of the Iron Hill more and more useful: it gets rid of the Caught in a Web attachment and also lets you play an early Steward of Gondor on a hero and then getting rid of it to play a second copy on a different hero.\n\nI think the Tactics attachments should also be given more consideration, especially over Protector of Lorien. The Dwarven Axe and the Horn of Gondor are both better, in my opinion. The Citadel Plate requires a much heavier commitment to the Tactics sphere, which isn't as easy to do (and still keep a very effective deck), but is also generally better. Even the Blade of Gondolin comes in more useful than the Protector in my view.\n\n\n\nI like Henamarth Riversong very much, even though I almost always play coop where his ability is not that strong. Still for the cost, he is a no-brainer addition to almost any Lore deck, I'd say.\n\nOff the Tactics Attachments the one I like by far the most is Blade of Gondolin. But I play Legolas also who's progress boost becomes even more prominent with it and in a few cases the Orc bonus is also significant. I have considered Horn of Gondor but since my deck is never that Ally heavy, I cut it out. It should certainly be much more powerful with the raising number of players.\n\nI find Daughter to have best healing potential, thus I included her although obviously there are so many good allies (already) and their use just depends on the circumstances.\n\nAre you sure you play Protector of Lorien right? The card can be discarded repeatedly in each turn. I saw in the quest log that Eowyn is a favourite Hero around this forum, I don't quite share that sentiment since Protector of Lorien's ability is infinitely better than hers for questing (although only one player can discard) and it also helps in defending. Attached on Aragorn, it has proved super-strong as he almost always both quests and defends. Of course you do not want to discard cards all the time but in combination with Beravor, Lorien's Wealth or say Valiant Sacrifice, you should have enough cards to discard when the need is most dire.\n\nPublish [../../../edge_public/img_edge/spacer.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=483034","commentId":483034,"userName":"SiCK_Boy","timestamp":1307631491,"content":"I stand corrected regarding the Miner and attachments... He still gets rid of those Caught in a web however, which is already a nice bonus (unless you play with multiple core sets and have access to multiple Unexpected Courage to bypass them).\n\nAs for Protector of Lorien, I'm often reluctant to discard cards to use it. The main use I've seen for it is when you're on the last stage of a quest and you can just drop your whole hand to complete it in one turn. I almost always play Leadership which means I often have more resources than cards (or I can play most of my cards), so dropping cards isn't really an option I often consider.\n\nAs for why Eowyn is a favorite, I think it's the simple fact that all by herself, she can handle questing in the initial turns where you don't want to have your full team committed. No other hero comes near her in terms of questing power. The closests are Glorfindel (but with 12 threat rather than 9) and Aragorn with a Celebrian's Stone (again, without multiple core sets, a non-reliable strategy). Her ability is just a bonus, but doesn't come into effect that often."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=483038","commentId":483038,"userName":"lleimmoen","timestamp":1307631994,"content":"SiCK_Boy said:\n\nAs for Protector of Lorien, I'm often reluctant to discard cards to use it. The main use I've seen for it is when you're on the last stage of a quest and you can just drop your whole hand to complete it in one turn. I almost always play Leadership which means I often have more resources than cards (or I can play most of my cards), so dropping cards isn't really an option I often consider.\n\nAs for why Eowyn is a favorite, I think it's the simple fact that all by herself, she can handle questing in the initial turns where you don't want to have your full team committed. No other hero comes near her in terms of questing power. The closests are Glorfindel (but with 12 threat rather than 9) and Aragorn with a Celebrian's Stone (again, without multiple core sets, a non-reliable strategy). Her ability is just a bonus, but doesn't come into effect that often.\n\n\n\nYeah, as I said, you needn't use the Protector all of the time, just when it's really worth it, when it saves your skin from a great trouble or wins you a game. But of course, you gotta kinda build your deck around this strategy. I use Beravor, Lorien's Wealth, Valiant Sacrifice to get some extra cards sometimes. I wish Lorien's Wealth was a little better, I don't play it very often due its cost but I still have it in my deck and sometimes I'm really glad that I do. You can always send flush it down the Protector itself.\n\nAs for Eowyn, I play a Spirit-minor deck and Dunhere has always seemed a better option, Theodred and Aragorn questing. I know they sum up 1 point of Willpower less than Eowyn herself but they're a good combo and Aragorn just gets better with the Protector, Stone, Steward, Courage. The start may be slower but it pays of in latter part of the game. Also, Dunhere is just very special for his ability of dealing with the likes of Hummerhorns, Sniper or the entire part 2 of the Journey Down the Anduin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=483784","commentId":483784,"userName":"The Strolling Bones","timestamp":1307782740,"content":"Aragorn\n\nCelebrian's Stone\n\nSteward of Gondor\n\nof course Gandalf\n\nSneak Attack\n\nFeint\n\nand\n\nQuick Strike"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=484402","commentId":484402,"userName":"jesseolivier2","timestamp":1307931864,"content":" For me Sneak attack is my #1. It will continue to grow as new allys become available. (dropping a eagle for a quick block and other unseen things...?) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48075-favourite-cards/?do=findComment&comment=484426","commentId":484426,"userName":"lleimmoen","timestamp":1307936843,"content":"JesseOlivier said:\n\n For me Sneak attack is my #1. It will continue to grow as new allys become available. (dropping a eagle for a quick block and other unseen things...?) \n\n\n\nOh yeah. That's what I think. Some situations are more powerful than others but it is almost always useful. Even with a card that I don't even play now, Snowbourn Scout. Imagine there is a nasty location in the staging area, or two, say Brown Lands and you cannot travel to them since the East Bight is active. You then Sneak the Scout in during resource phase, then play him normally during planning, both locations explored."}]}