{"url":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/","title":"About attack,After attack (Wargs, Ufthak and other things)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483450","commentId":483450,"userName":"Glaurung","timestamp":1307713276,"content":"I know there is a lot of confusion about this things in the game . Let me explain how i understand this.\n\nWargs.  Forced: if wargs a deal a shadow card with no effect, return wargs to the the staging area after it attacks.\n\nThere is another card in the Emyn muil Set:http://www.fantasyflightgames.com/edge_news.asp?eidn=2248\n\nLocation and also first location with shadow effect: after this attack is RESOLVED return attacking enemy to the staging area.\n\nSo here is quite clear : (after it attack) is one termin and (after attack is resolved) is also another termin. And this is suppose to be two different things. \n\nAfter attack he get shadow card, no effect and comeback straight away to staiging area (no damage tokens) and after attack is resolved (first put damage tokens than comeback to the staging area). I suppose here is no doubts, otherwise for what we have 2 different termins to discribe same things.\n\nSo same with Ufthak and Dol guldor Beast master.Termin 1:after  attacks Ufthak get his token straight away after you decide who is defender, and beast master dealt a additional shadow card in this case. Here is nothing about second termin: After attack is Resolved.\n\nBut according to this logic if you play feint in the beginning of combat phase on this enemy, Ufthak dont get the the token and Beast master dont get the additional shadow card.\n\nSomething like this.Sorry for my English.I try my best.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483488","commentId":483488,"userName":"lleimmoen","timestamp":1307719602,"content":"Wargs and Chieftain.\n\nThere simply must be consistency. Only Ufthak is mentioned in the errata. And it says he's strength 5 during the first attack. Then Wargs unengage (if no shadow effect is dealt) before they hit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483696","commentId":483696,"userName":"pumpkin","timestamp":1307761673,"content":"An attack consists of 4 steps, rulebook P.18, which includes dealing damage.\n\nAfter an attack and after an attack is resolved are effectively the same thing; the reason there is slight inconsistency between Wargs and the location is that possibly in the case of the Warg, it is the Warg attacking, whereas in the case of the location it merely has an effect on an attack from something else. Alternatively, perhaps FFG designers realised the confusion of not being totally clear and therefore conciously added the word resolved to the location to avoid further confusion, and perhaps we will see this change made to the Warg card in future printings?\n\nFrom the FAQ (official and thread) everyone now knows that CU and DGB should say \"when\"rather than \"after\", so they are the main word distinctions to be looked out for and used when determining exactly when things happen during an attack resolution.\n\nThere isn't and shouldn't be a distinction between \"after an attack\" and \"after an attack has resolved\", IMHO.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483781","commentId":483781,"userName":"The Strolling Bones","timestamp":1307782019,"content":"Ufthak is a bastard.  I don't mind the Wargs too much cos I like Dunhere's ability.  I agree that the language needs to be streamlined, but all card games have suffered from these growing pains.  The game can only get better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483808","commentId":483808,"userName":"lleimmoen","timestamp":1307786378,"content":"So you guys agree and play it the way that Chieftain has Attack of 5 the first time round and Wargs run back to the staging area if they don't get a shadow effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483870","commentId":483870,"userName":"pumpkin","timestamp":1307796896,"content":"lleimmoen said:\n\nSo you guys agree and play it the way that Chieftain has Attack of 5 the first time round and Wargs run back to the staging area if they don't get a shadow effect?\n\n\n\nThe Wargs run back to the staging area after they have dealt damage as dealing damage is the final step of an attack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483879","commentId":483879,"userName":"Glaurung","timestamp":1307799058,"content":"Q: When do the Forced effects on Chieftan Ufthak and Dol Guldur Beastmaster resolve?\nA: These effects resolve during step 1 of enemy attack resolution, immediately after choosing to resolve the attack.\n\nSo i think there is no damage. Chieftan Ufthak get his token immediately, so and wargs immidiately go to the staging area if no shadow effect on the card.\n\nBut we need to wait official FAQ. Actually i like if they do damage(more hard more interesting for me) but looks like not...... But my proof is quite clear if there is (after attack is resolve) there is no doubt damage is done.But there is not.\n\nAnd we have card who have it. So will see in future......"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483892","commentId":483892,"userName":"pumpkin","timestamp":1307800838,"content":"Glaurung said:\n\n \n\nQ: When do the Forced effects on Chieftan Ufthak and Dol Guldur Beastmaster resolve?\nA: These effects resolve during step 1 of enemy attack resolution, immediately after choosing to resolve the attack.\n\nSo i think there is no damage. Chieftan Ufthak get his token immediately, so and wargs immidiately go to the staging area if no shadow effect on the card.\n\nBut we need to wait official FAQ. Actually i like if they do damage(more hard more interesting for me) but looks like not...... But my proof is quite clear if there is (after attack is resolve) there is no doubt damage is done.But there is not.\n\nAnd we have card who have it. So will see in future......\n\n \n\n \n\nMy point is that CU and DGB were clarified in the FAQ because their text was confusing and not totally accurate, so they actually resolve during step 1, even though their text says after. The Wargs were  NOT included in the FAQ because their text IS totally accurate, they return to the staging area after their attack has completed, i.e. after they have dealt damage, exactly as their card says.\n\nSure this is just my opinion, so play how you want, but trying to play strictly to what the cards says and comparing cards from different expansions for clarity without applying a modicum of common sense will likely end up in even more confusion.\n\nAsk yourself this, What is the benefit of the Wargs card text if it forces them to return to staging before they have dealt damage?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=483897","commentId":483897,"userName":"Glaurung","timestamp":1307801522,"content":"So Pumpkin looks like only me and you really interesting that thing a??? Anyway is still not clear. We cannot be for sure.\n\nWargs is nasty a lot. And i use to play them before like they did damage. But after i sow this location with shadow effect i start to be doubt. As i say for me is better if they do damage. My deck is alweys win against this quest so i like to get it more harder. But i want to know for sure.\n\nThe comeback to staging area and this is nasty  already. coward beast.i always want to grasp them and i do (with quick strike).\n\nWhy i wonna be sure???? I proff player before Mtg and Lotr Tcg decipher. So i ready my self for the tournaments.This is like sport for me.\n\nThanks for your support in this topic. You have a point. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484034","commentId":484034,"userName":"Paul Grogan","timestamp":1307842049,"content":"Sorry to moan, but people are right.  FFG is a big company with a lot of playtesters.  There should be no excuse for bad wording on cards which could be misinterpreted it.  10 minutes after I'd seen those cards (along with most people on here), we were confused about what they meant and started arguing.  This should have been picked up in playtesting and better wording provided.\n\nAlso, the fact that the Wargs were not mentioned in the FAQ is also inexcusable.  I personally mailed them about this card, and the questions about them were all over this forum, it would have taken an employee a matter of hours to read the forums, find all the questions that people are asking.\n\nRant over. For now.\n\n \n\nAs for the wording on the new location.  I 'think' they have realised their mistake with putting the word \"after\", so the new card says \"after it resolves\".  So \"after\" really means \"when\", and \"after it resolves\" means just that.  What they should have done is to just accept their mistake and issued errata for CU and DGB and reword them to \"when\".\n\nAs for Wargs, it could be played either way.  You deal it a card, then when the card is turned over, if it isnt a shadow effect, the wargs runs away before any damage is dealt.  Or, you could play it that the attack resolves, and then it runs away.\n\nThe FAQ says \"Q: When do the Forced effects on Chieftan Ufthak and Dol Guldur Beastmaster resolve?\nA: These effects resolve during step 1 of enemy attack resolution, immediately after choosing to resolve the attack.\"\n\nHowever, the Wargs cant resolve their effect at this time, because in step 1, the shadow card hasnt been revealed yet.  But, by the FAQ, they are saying that the effect of UC and DGB happen pretty much at exactly the same time at they are declared as an attacker.  This is not AFTER, but WHEN. \n\nSo, the most logical interpretation of the wargs based on FAQ is that as soon as the card is revealed, if it doesnt have a shadow effect, they bugger off back to the staging area.   Just seems odd.\n\nMaybe if everyone here emails them about the wargs, it may appear in the FAQ, or maybe not.  FFG seem to like their players getting frustrated by not answering all of their questions, but only some of them.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484048","commentId":484048,"userName":"Glaurung","timestamp":1307846336,"content":"Paul Grogan said:\n\nSorry to moan, but people are right.  FFG is a big company with a lot of playtesters.  There should be no excuse for bad wording on cards which could be misinterpreted it.  10 minutes after I'd seen those cards (along with most people on here), we were confused about what they meant and started arguing.  This should have been picked up in playtesting and better wording provided.\n\nAlso, the fact that the Wargs were not mentioned in the FAQ is also inexcusable.  I personally mailed them about this card, and the questions about them were all over this forum, it would have taken an employee a matter of hours to read the forums, find all the questions that people are asking.\n\nRant over. For now.\n\n \n\nAs for the wording on the new location.  I 'think' they have realised their mistake with putting the word \"after\", so the new card says \"after it resolves\".  So \"after\" really means \"when\", and \"after it resolves\" means just that.  What they should have done is to just accept their mistake and issued errata for CU and DGB and reword them to \"when\".\n\nAs for Wargs, it could be played either way.  You deal it a card, then when the card is turned over, if it isnt a shadow effect, the wargs runs away before any damage is dealt.  Or, you could play it that the attack resolves, and then it runs away.\n\nThe FAQ says \"Q: When do the Forced effects on Chieftan Ufthak and Dol Guldur Beastmaster resolve?\nA: These effects resolve during step 1 of enemy attack resolution, immediately after choosing to resolve the attack.\"\n\nHowever, the Wargs cant resolve their effect at this time, because in step 1, the shadow card hasnt been revealed yet.  But, by the FAQ, they are saying that the effect of UC and DGB happen pretty much at exactly the same time at they are declared as an attacker.  This is not AFTER, but WHEN. \n\nSo, the most logical interpretation of the wargs based on FAQ is that as soon as the card is revealed, if it doesnt have a shadow effect, they bugger off back to the staging area.   Just seems odd.\n\nMaybe if everyone here emails them about the wargs, it may appear in the FAQ, or maybe not.  FFG seem to like their players getting frustrated by not answering all of their questions, but only some of them.\n\nVery good Arguments My friend. They should to be more specific with all that ^when , after, resolves ans so on^. Will sew when FAQ is coming. But until we can bet a???? Joking\n\n \n\n \n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484055","commentId":484055,"userName":"pumpkin","timestamp":1307848045,"content":"Paul Grogan said:\n\n \n\n \n\nSo, the most logical interpretation of the wargs based on FAQ is that as soon as the card is revealed, if it doesnt have a shadow effect, they bugger off back to the staging area\n\n  \n\n \n\n \n\n \n\nAh you see, I would argue that because the Wargs are specifically NOT mentioned in the FAQ there is no basis for assuming they should be treated the same as CU or DGB, so in fact the Wargs should be treated exactly as the text on their cards, they return after they have attacked, which is after step 4 of an attack has resovled (dealing damage).\n\nIf they were to be treated differently to how their text could sensibly be interpreted, then FFG would have included them in the FAQ entry, just like CU ans DGB.\n\nI do agree though its not 100% clear, but we may be waiting a long time for clarification on this when you compare the content of the official FAQ to the FAQ thread, there are a whole raft of questions that haven't been formally answered yet, and with the next expansion looming, that will only increase I think...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484057","commentId":484057,"userName":"pumpkin","timestamp":1307848298,"content":"Glaurung said:\n\nSo Pumpkin looks like only me and you really interesting that thing a??? Anyway is still not clear. We cannot be for sure.\n\nWargs is nasty a lot. And i use to play them before like they did damage. But after i sow this location with shadow effect i start to be doubt. As i say for me is better if they do damage. My deck is alweys win against this quest so i like to get it more harder. But i want to know for sure.\n\nThe comeback to staging area and this is nasty  already. coward beast.i always want to grasp them and i do (with quick strike).\n\nWhy i wonna be sure???? I proff player before Mtg and Lotr Tcg decipher. So i ready my self for the tournaments.This is like sport for me.\n\nThanks for your support in this topic. You have a point. \n\n\n\nI think you are right that it does need some official clarification, perhaps we will get a serious update to the official FAQ in line with the release of the next expansion?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484079","commentId":484079,"userName":"lleimmoen","timestamp":1307855439,"content":"pumpkin said:\n\nlleimmoen said:\n\n \n\nSo you guys agree and play it the way that Chieftain has Attack of 5 the first time round and Wargs run back to the staging area if they don't get a shadow effect?\n\n \n\n \n\nThe Wargs run back to the staging area after they have dealt damage as dealing damage is the final step of an attack\n\n\n\nBy this logic, Chieftain would have only gotten its resource token after the damage was dealt and thus had no bonus during the first attack; however, according to the errata, it is NOT so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484088","commentId":484088,"userName":"pumpkin","timestamp":1307858297,"content":" lleimmoen said:\n\npumpkin said:\n\n \n\nlleimmoen said:\n\n \n\nSo you guys agree and play it the way that Chieftain has Attack of 5 the first time round and Wargs run back to the staging area if they don't get a shadow effect?\n\n \n\n \n\nThe Wargs run back to the staging area after they have dealt damage as dealing damage is the final step of an attack\n\n \n\n \n\nBy this logic, Chieftain would have only gotten its resource token after the damage was dealt and thus had no bonus during the first attack; however, according to the errata, it is NOT so.\n\n\n\nAnd as I keep saying, people are using a FAQ to another card to try and clarify how Wargs should work. If Wargs were meant to work exactly the same way as CU and DGB why didn't FFG also include the Warg card in that section of the FAQ? All three cards are in the core set and so could easily have been clarified at the same time. I assume that FFG didn't include Warg because the clarification on timing for CU and DGB does not apply to the Warg card.\n\nI could be wrong, but until FFG do clarify I don't think it is safe to assume that just because CU and DGB have had their action timings altered slightly in relation to their card text, it is then a given that all other cards with that same card text also should have their action timings altered to match.\n\nHaving the Wargs return to the staging area before they deal damage doesn't really make a great deal of sense - what is the actual gaming mechanic point of doing that? It doesn't really hinder the players in any great sense, sure they might \"waste\" a card in defending only for the Warg to disappear, but more often than not the player will leave the Warg attack undefended, hoping to turn a blank shadow card, it actually gives the players more tactical options not less.  Whereas if the Warg does deal damage, the players tactical options are removed - defend or take damage - but then having it return and not being able to attacked it back always a hindrance to the players.\n\nSure, play how you want, I just don't think you should be relying on a FAQ for 2 completely different cards to determine how Wargs works.\n\nI could well be wrong (I was wrong in relation to CU, where I assumed his timing would be clarified differently (add resource after aatack step 4) to DGB in the FAQ, when they both ended up being the same), but we could be waiting a long time for an official answer on this, unfortunately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484100","commentId":484100,"userName":"lleimmoen","timestamp":1307860110,"content":"You are making sense overall, I argue that not. But does it not make sense that wording \"after attack\" means same thing on two cards?\n\nAs for the Wargs, if they run back before dealing damage, it is easier to the players, yes, no denying that. And you could have a point that things that make the game easier for the players are against the logic of the game? Perhaps although we have seen otherwise, already.\n\nAs for the thematic sense, it actually feels more fit to me that when the Wargs don't feel like being strong (having not been dealt their shadow boost), they run back immediately. If they could run back without waiting for response, they would have done so everytime, right?\n\nOn the other hand, it seems more fit to me that CU gets his bonus the next round, he's shed blood he feels stronger, something along those lines. However, I will play it as they sat. And I actually hope to get an official call on Wargs as well although I wonder if it could not be consistent with the Chieftain.\n\nBe well. And thanks for discussion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484128","commentId":484128,"userName":"Paul Grogan","timestamp":1307867430,"content":"pumpkin said:\n\nAnd as I keep saying, people are using a FAQ to another card to try and clarify how Wargs should work. If Wargs were meant to work exactly the same way as CU and DGB why didn't FFG also include the Warg card in that section of the FAQ? All three cards are in the core set and so could easily have been clarified at the same time. I assume that FFG didn't include Warg because the clarification on timing for CU and DGB does not apply to the Warg card. \n\n \n\nThe FAQ is a clarification on the wording on 2 particular cards.   It is NOT errata for the cards.  They are saying the cards are correctly worded, and telling us how to interpret them.  They are telling us how to interpret the word \"after\"\n\nWhat you are saying is that all 3 cards are worded the same, but because 2 of them are mentioned in the FAQ, you will play those 2 one way, and the one that wasnt mentioned, you will interpret the word \"after\" in a different way. \n\nIf they said \"We messed up, CU and DGB should be errated to say \"when\" \", then it would be a different story. But it isnt, they simply clarified when these abilities happen. And thus, surely any other card which is worded the same way, should also be interpreted that way.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484183","commentId":484183,"userName":"Glaurung","timestamp":1307878736,"content":"That what i say. Wargs a cowards not support from shadow???? They run...... That because they strange is 3. But this is still not clear. Pumkins have his point too.\n\nWe need to wait to be sure"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484277","commentId":484277,"userName":"noosphear","timestamp":1307898106,"content":"Wargs leaving before damage is still always a hindrance to the players as they have to deal with the extra threat they add in the next phase of questing as well.\n\nWe play it that they do their damage and then run off, but they would still be a pain in the butt if they didn't because it's 2 extra threat we have to quest against every turn.  Official word would be great because every standard that anyone has applied to the argument doesn't fix the problem."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=484412","commentId":484412,"userName":"pumpkin","timestamp":1307934899,"content":"Paul Grogan said:\n\npumpkin said:\n\n \n\nAnd as I keep saying, people are using a FAQ to another card to try and clarify how Wargs should work. If Wargs were meant to work exactly the same way as CU and DGB why didn't FFG also include the Warg card in that section of the FAQ? All three cards are in the core set and so could easily have been clarified at the same time. I assume that FFG didn't include Warg because the clarification on timing for CU and DGB does not apply to the Warg card. \n\n \n\n \n\nThe FAQ is a clarification on the wording on 2 particular cards.   It is NOT errata for the cards.  They are saying the cards are correctly worded, and telling us how to interpret them.  They are telling us how to interpret the word \"after\"\n\nWhat you are saying is that all 3 cards are worded the same, but because 2 of them are mentioned in the FAQ, you will play those 2 one way, and the one that wasnt mentioned, you will interpret the word \"after\" in a different way. \n\nIf they said \"We messed up, CU and DGB should be errated to say \"when\" \", then it would be a different story. But it isnt, they simply clarified when these abilities happen. And thus, surely any other card which is worded the same way, should also be interpreted that way.\n\n \n\n \n\n\n\nIf it honestly makes more sense for you to remove Wargs before their attack resovles, then play it that way. Its your game, afterall"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=492776","commentId":492776,"userName":"Glaurung","timestamp":1309341552,"content":"So now is clean they bite and run. So i like eat now Wargs is more danegorus. You was right Pumkins there is my hat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=492902","commentId":492902,"userName":"soupy89","timestamp":1309356822,"content":"Paul Grogan said:\n\nSorry to moan, but people are right.  FFG is a big company with a lot of playtesters.  There should be no excuse for bad wording on cards which could be misinterpreted it.  10 minutes after I'd seen those cards (along with most people on here), we were confused about what they meant and started arguing.  This should have been picked up in playtesting and better wording provided.\n\n\n\nI really appreciate what FFG is doing in terms of trying to provide a market-viable alternative to CCGs, and I wouldn't begrudge them some oversights along the way. Even people who love MTG admit that it was a mess for at least 5 years before it really got streamlined and consistently well designed and balanced. There is still controversy ( frex, Jace) despite their sets usually being well thought out. It may seem like these text oversights would be really easy to spot, but they have a lot to deal with, and let's face it, everybody's human and makes mistakes.\n\nOn the one hand, FFG has the benefit of learning from WotC so they don't have to reinvent the wheel. On the other hand, if they borrow too heavily from MtG what's the point of designing the LOTR card game? Why not quit their jobs and work for Wizards? They are walking a fine line and I applaud them for even attempting to get their LCG line off the ground. I think it is a great step in a direction that is sorely needed.\n\nI like the idea of a broader market for customizable deck games and I think FFG is a big part of that. However, these kinds of games are complex and hard to design and implement. I'm willing to be patient in order to support this endeavor, and I hope other people are too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=492995","commentId":492995,"userName":"lleimmoen","timestamp":1309366323,"content":"Glaurung said:\n\nSo now is clean they bite and run. So i like eat now Wargs is more danegorus. You was right Pumkins there is my hat.\n\n\n\nIt's hard to say who was right because the ruling on CU has changed since the previous FAQ. And now the wording matches."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=493133","commentId":493133,"userName":"Glaurung","timestamp":1309382711,"content":"lleimmoen said:\n\nGlaurung said:\n\n \n\nSo now is clean they bite and run. So i like eat now Wargs is more danegorus. You was right Pumkins there is my hat.\n\n \n\n \n\nIt's hard to say who was right because the ruling on CU has changed since the previous FAQ. And now the wording matches.\n\n\n\nYes rules changes since first FAQ but feelings. You must feel the game. So Pumkins do...... Just joking. \n\nAnyway FAQ explaine a lot for now. I satisfied. Wait for Gollum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=493179","commentId":493179,"userName":"Paul Grogan","timestamp":1309391633,"content":"lleimmoen said:\n\nGlaurung said:\n\n \n\nSo now is clean they bite and run. So i like eat now Wargs is more danegorus. You was right Pumkins there is my hat.\n\n \n\n \n\nIt's hard to say who was right because the ruling on CU has changed since the previous FAQ. And now the wording matches.\n\n\n\n \n\nNobody is right or wrong here. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Technically I was 'wrong' because I said the wargs should be played one way, and the new FAQ says they should be played the other way.   However, turns out I was actually correct with my reasoning, which is why I got an email from Nate to discuss the new FAQ.  It was along the lines of \"Based on the first FAQ, your interpretation of the wargs is right, and since this isnt right, we need to change it back so that the wargs work as intended\".  Thanks to Pumpkin for helping me help them with the new FAQ.\n\nI used to play the wargs did damage and ran away.  Then FAQ 1.0 came out and I played them the other way.  Now I'll go back to playing them the original way, which is now correct again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=493190","commentId":493190,"userName":"Glaurung","timestamp":1309394649,"content":"Paul Grogan said:\n\nlleimmoen said:\n\n \n\nGlaurung said:\n\n \n\nSo now is clean they bite and run. So i like eat now Wargs is more danegorus. You was right Pumkins there is my hat.\n\n \n\n \n\nIt's hard to say who was right because the ruling on CU has changed since the previous FAQ. And now the wording matches.\n\n \n\n \n\n \n\nNobody is right or wrong here. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Technically I was 'wrong' because I said the wargs should be played one way, and the new FAQ says they should be played the other way.   However, turns out I was actually correct with my reasoning, which is why I got an email from Nate to discuss the new FAQ.  It was along the lines of \"Based on the first FAQ, your interpretation of the wargs is right, and since this isnt right, we need to change it back so that the wargs work as intended\".  Thanks to Pumpkin for helping me help them with the new FAQ.\n\nI used to play the wargs did damage and ran away.  Then FAQ 1.0 came out and I played them the other way.  Now I'll go back to playing them the original way, which is now correct again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nI do same. Before i use to play them with damage. But after FAQ i start to play them no damage. Also there is confusion with the location from Hill Of Emyn Muil  Adv pack shadow effect: after the attack is resolved return this enemy to the staging area. So i though should be different between 2 game termins :After Attack and :After attack is resolved. But looks like they them self dont know where they going. Anyway now is clean and i like it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=493246","commentId":493246,"userName":"lleimmoen","timestamp":1309409223,"content":"Paul Grogan said:\n\nlleimmoen said:\n\n \n\nGlaurung said:\n\n \n\nSo now is clean they bite and run. So i like eat now Wargs is more danegorus. You was right Pumkins there is my hat.\n\n \n\n \n\nIt's hard to say who was right because the ruling on CU has changed since the previous FAQ. And now the wording matches.\n\n \n\n \n\n \n\nNobody is right or wrong here. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Technically I was 'wrong' because I said the wargs should be played one way, and the new FAQ says they should be played the other way.   However, turns out I was actually correct with my reasoning, which is why I got an email from Nate to discuss the new FAQ.  It was along the lines of \"Based on the first FAQ, your interpretation of the wargs is right, and since this isnt right, we need to change it back so that the wargs work as intended\".  Thanks to Pumpkin for helping me help them with the new FAQ.\n\nI used to play the wargs did damage and ran away.  Then FAQ 1.0 came out and I played them the other way.  Now I'll go back to playing them the original way, which is now correct again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nIt makes sense. The first FAQ was bad in this sense. Because I played both as it is now then changed both because of the FAQ, now switched back to previous. I also had this reasoning that the wording should match. I am glad thematically also now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48195-about-attackafter-attack-wargs-ufthak-and-other-things/?do=findComment&comment=493317","commentId":493317,"userName":"pumpkin","timestamp":1309422241,"content":"Paul Grogan said:\n\n Thanks to Pumpkin for helping me help them with the new FAQ.\n\n \n\n\n\nnp, I will continue to keep he FAQ thread up to date as much as I can with new questions and you have my email so if Nate asks you to help with the next inevitable installment of the FAQ you know how to contact me if you need to.\n\nI think the new FAQ is a great improvement, although the attack limitations section could still be a bit clearer, I think I get what they are saying but there's still plenty of questions about it appearing on the forums."}]}