{"url":"https://community.fantasyflightgames.com/topic/48342-quick-noob-help/","title":"Quick Noob help","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48342-quick-noob-help/?do=findComment&comment=484747","commentId":484747,"userName":"RedWingJamie","timestamp":1307983760,"content":" I am having a problem with the Encounter Deck.\n\nI have the quest card and an active location card. When I draw my staging card for solo play (1 Card); I get another location card. Fine, it is inactive. But I use its threat.\n\nBut I seem to end up with 3 or more location cards in a row in the staging area after a few turns and the threat is raised past 10+ and I am just flying to 50 after about 6 turns.\n\nAm I to discard an inactive location card once it has been used as a threat once...or do they stock pile and lead to these high threat levels?\n\nAny help you can provide would be helpful.\n\nThanks\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48342-quick-noob-help/?do=findComment&comment=484751","commentId":484751,"userName":"Spirit Juggler","timestamp":1307984339,"content":"They stack up in the staging area adding their threat each time you quest. You need to deal with them in order to keep the threat down so that you can quest successfully. Once you've quested you can choose to travel to one of these locations by making it the active location. You no longer add it's threat during the quest phase but you must add progress tokens to that instead of the quest.\n\n \n\nNorthern tracker from the spirit sphere is the best way to deal with locations in the staging area. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48342-quick-noob-help/?do=findComment&comment=484766","commentId":484766,"userName":"Apophenia","timestamp":1307985958,"content":" Also, if you are using the Tactics deck solo you should stop and use one of the other decks until you get a handle on the game. The Tactics deck has lots of trouble questing and makes a poor solo choice. \n\nMake sure you can reliably get 2-3 progress tokens out a turn. That will let you at least travel to a location and then next turn finish it before too many extra locations come out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48342-quick-noob-help/?do=findComment&comment=484783","commentId":484783,"userName":"RedWingJamie","timestamp":1307987842,"content":" You've been peeking at my table! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI have been trying the tactics deck and it has been a struggle to get anywhere on a quest. Not even over the first 1b card sometimes.\n\nNo wonder I was having a hard time and everyone else is posting low scores then. \n\n \n\nThanks for the help. I am sure I will be back with more questions...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48342-quick-noob-help/?do=findComment&comment=485353","commentId":485353,"userName":"DurinIII","timestamp":1308083505,"content":" Yeah, you guys are absolutely right. The tactics deck is extremely hard to succeed with. I have made it to Beorn's Path with the tactics deck, and then promptly got murdered by a swarm of enemies (ugly stuff).  The real bad part about the tactics deck being so hard to use is the loss of using two of the books most beloved characters to their full effect...Legolas and Gimli. I hope they fix this and make it worth taking these two!"}]}