{"url":"https://community.fantasyflightgames.com/topic/48382-how-good-are-theme-decks-all-dwarves-all-gondorian-etc-also-highlander-rules/","title":"How good are &quot;theme&quot; decks? (All dwarves, all Gondorian, etc) also, &quot;Highlander&quot; rules?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48382-how-good-are-theme-decks-all-dwarves-all-gondorian-etc-also-highlander-rules/?do=findComment&comment=485187","commentId":485187,"userName":"gatharion","timestamp":1308060473,"content":"As I mentioned in another thread, I'm just getting into this game. I've only played the intro scenario and only with the starter decks. I'm anxious to start deck building, but I can't really start tinkering too much until I've taught my wife the game.\n\nHow useful are decks built around a single common theme?\n\nIs a deck with only Rohirrim likely to hold up?\n\n \n\nAlso, I noticed that some allies have a generic title like \"Gondorian Spearman\", playing two or three of them seems fine, but what about distinct \"named\" characters like Faramir?\n\nI've played other card and minis games that impose a rule where-in one can not use duplicates of \"named\" characters (often called the \"Highlander Rule\", as in \"there can be only one\"). As I play these sorts of games for the thematic and immersive elements, as you might guess from my question above, I tend to be fond of that rule. However I didn't see anything of the sort in the rules. \n\nObviously I can house-rule things however I like, but should I manage to find any organized play in my area I guess I'd like to know what I should be expecting. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48382-how-good-are-theme-decks-all-dwarves-all-gondorian-etc-also-highlander-rules/?do=findComment&comment=485189","commentId":485189,"userName":"Kzer-za","timestamp":1308061028,"content":"Right now, there aren't enough cards to really build theme decks. You can use a thematic grouping of heroes like  \"the three hunters\", but you can't really build a deck with that theme because of the limited card selection. However, there are cards that trigger off certain characters traits (like events in the first expansion that lets you search for Rohan or Eagle characters), and theme decks will become more viable as more cards are released and there are more characters or support cards of various types.\n\nCharacters with a circular icon next to their name are unique and can only have one in play at a time. It's in the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48382-how-good-are-theme-decks-all-dwarves-all-gondorian-etc-also-highlander-rules/?do=findComment&comment=485225","commentId":485225,"userName":"lleimmoen","timestamp":1308065721,"content":"We play two decks, a human and non-human. The human has Dunhere (Rohan), Aragorn (Dunedain), Theodred (Rohan) as heroes, with allies being Son of Arnor (Dunedain), Northern Tracker (Dunedain), Faramir (Gondor), Gandalf (Istari - well, not a human) and Beorn (Beorning). The non-human has Glorfindel (Noldor), Bilbo (Hobbit), Legolas (Silvan) as heroes, with allies being Henamarth Riversong (Silvan), Erebor Hammersmith (Dwarf), Daughter of the Nimrodel (Silvan), Rivendell Minstrel (Noldor), Haldir of Lorien (Silvan - well, he's not out officially yet) and Gandalf (Istari). The decks seem to play well together and I find them thematically pretty nice although connections like Elf-Dwarf probably were very cold at the time..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48382-how-good-are-theme-decks-all-dwarves-all-gondorian-etc-also-highlander-rules/?do=findComment&comment=485342","commentId":485342,"userName":"DurinIII","timestamp":1308081119,"content":" The Starter decks are tons of fun...I love this game! I favor the dwarves (could anyone tell?) Yeah, tactics feels a bit under-prepared to take on quests...especially early on. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] I hope tactics gets some cards that pump willpower in the following expansions. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48382-how-good-are-theme-decks-all-dwarves-all-gondorian-etc-also-highlander-rules/?do=findComment&comment=485343","commentId":485343,"userName":"DurinIII","timestamp":1308081186,"content":" Nice, sounds like a lot of fun...thanks for the tips. I look forward (as I sure you do) to being able to really start customizing these decks as more cards come out. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"}]}