{"url":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/","title":"3rd quest is so tough","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=486283","commentId":486283,"userName":"daveman006","timestamp":1308226388,"content":"Wow after 15 times me and my friend actually beat the 3rd quest.  Its so tough not only losing a hero but only able to bring out one ally a round.  Denethor (encounter manipulation) and Aragorn (obvious) proved really helpful along with a Northern tracker (one of best allies right now besides Gandalf) getting through the nastiest cards.  Has anyone else had a tough time with this quest.  It seems that you have to get really lucky or have multiple core sets (I only have one so not that many of the good cards).  Unexpected courage is one of the best attachments ever!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=486292","commentId":486292,"userName":"Spirit Juggler","timestamp":1308227620,"content":"I've yet to manage it solo but two player hasn't been terribly hard. The real killer is only one ally being allowed to come out each turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=486396","commentId":486396,"userName":"daveman006","timestamp":1308238794,"content":"Yeah that is very crippling condition of this quest because there was some rounds where I could bring out an ally but then my buddy wouldn't be able.  Attachments are key for this for one not able to bring out allies that round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=486626","commentId":486626,"userName":"Maniacske","timestamp":1308279090,"content":"We beat it with three players on our first try :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=486833","commentId":486833,"userName":"daveman006","timestamp":1308309120,"content":"Well yeah 3 players is easier than 2.  It seems that getting alot of tough characters such as Aragorn, Glorfindel and Gimli helps. My buddy started out with threat 32 and we beat it no problem.  It just doesn't work for the second quest though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=487172","commentId":487172,"userName":"TheLightdarker","timestamp":1308358982,"content":"I was able to beat the 3rd quest (with 2 players) on my first attempt, and I think the most important thing to keep in mind is that you should always have a clear plan of how and when to advance to the next quest stage.  \n\nThe heroes used were : Theodred, Gloin (captured) & Legolas ; Eowyn, Dunhere & Beravor\n\nBeing able to control quest progression and minimize time holding objectives is key.  Some things that come immediately to mind:\n\nNever attach an objective to a hero until you absolutely have to and are prepared to advance to the next stage of the quest. Since every objective penalizes you in some way, you want to avoid that as long as possible.\n\nEowyn sees a lot of play, and she is the perfect candidate to hold the objective \"Gandalf's Map.\"  This is typically the first objective I grab, and any dedicated quester should pick this up when you're ready.\n\nThere are a lot of locations with nasty travel effects in this scenario, making Northern Tracker fantastic. During my first play of the third scenario, having two of these guys out meant I never had to travel to a single location, so I didn't have to worry about generating Orc guards or having to discard cards at random.\n\nHave a plan for dealing with the Nazgul.  The FFG errata removed Forest Snare as an option, so make sure you have an ally you're willing to throw away, plenty of attack strength, and maybe something like Feint.\n\nRemember that during the third stage of the quest, the restriction on the number of allies you can play is lifted.\n\nLegolas, especially with Blade of Gondolin(s), is great for murdering Orc guards. He also makes an excellent target for Unexpected Courage or Common Cause to take out multiple enemies in one round for huge quest progress.  The final stage of the quest is very much a race to the finish, and he will do very well to wrap things up if you don't have any trouble with the Nazgul."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=487175","commentId":487175,"userName":"guciomir","timestamp":1308361191,"content":"I managed first win solo against 3rd quest.\n\nHeroes: Gimli (captured), Eowyn, Theodred. The beginning of the game was lucky since I was drawing mostly locations in the first part of the quest and I proceeded to fight nazgul when I had a spell which prevented nazgul from attacking. Once nazgul is defeated it is really important to decrease the threat, so there is enough space for picking up last items.\n\nI can't say that the deck will beat scenario consistently. Only Gimli can be captured because losing Theodred or Eowyn will result in either resources problem or in serious issues with questing. And you really don't want to see multiple enemies at the beginning of the quest. .  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=487469","commentId":487469,"userName":"daveman006","timestamp":1308430843,"content":"wow a solo with 3 spheres that is bold.  I see what you are saying with Theodred or Eowyn being captured.  Eowyn is great for this quest and Legolas as well.  Seems that when we did it several times we were getting tough monsters right away like one game the chieftain and the spawn spider came up in setup!  Needless to say we started over real quick cause that is too much to handle.  If you get a few locations and the tracker out yes it is alot easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=487807","commentId":487807,"userName":"Klaen","timestamp":1308504877,"content":"It is a satisfyingly hard quest.\n\nMy friend and I both recently defeated it on the first attempt...however this was after having really honed our deckbuilding skills on repeated plays of Journey along the Anduin and 2 core sets worth of card pool which makes an ENORMOUS difference.\n\nHaving said all that, we still came right down to the wire, with me on 49 threat and my friend on 47...got extremely lucky with a Faramir card pull on the turn before and so was able to smash the last quest (3B) in one foul swoop. A great adrenaline rush regardless!\n\nWe played - Gimli, Legolas, Eowyn and Aragorn, Theodred and Beravor (captured). The Aragorn deck runs three spheres (Leadership, Lore and a splash of Spirit for when/if Aragorn gets the Celebrain's Stone.\n\nAwesome fun, and totally replayable, as I would love to see if we can improve on our final score of 97.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=487817","commentId":487817,"userName":"Kauzu","timestamp":1308508275,"content":"@ guciomir\n\nWhich spell did you use on the nazgul?  Multiple feints or something?\n\nI haven't convinced my playing partner to try the third quest yet so I'm considering trying a solo round.  I don't really want to mess around with my deck much though.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=488294","commentId":488294,"userName":"guciomir","timestamp":1308581189,"content":"I played spell with 1 cost which prevents an enemy from attacking. It is \"feint\" in english LOTR, right?\n\nAnd I had zillions of way to put Gandalf into play, starting with hardcasting, through X mana cost reviving spell and 1 leadership mana sneak attack. Plus I had Beorn as a forth \"Gandalf\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=488507","commentId":488507,"userName":"Lotr_Nerd","timestamp":1308612565,"content":" Just remember that this quest is supposed to be hard I mean it's not like you can simply walk into Dol Guldur and walk out with a prisoner that easily."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=488571","commentId":488571,"userName":"Spirit Juggler","timestamp":1308628955,"content":"For four player I'd possibly consider having to hero's captured at the start. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=488589","commentId":488589,"userName":"ClydeCloggie","timestamp":1308631956,"content":"guciomir said:\n\nI played spell with 1 cost which prevents an enemy from attacking. It is \"feint\" in english LOTR, right?\n\nAnd I had zillions of way to put Gandalf into play, starting with hardcasting, through X mana cost reviving spell and 1 leadership mana sneak attack. Plus I had Beorn as a forth \"Gandalf\".\n\n\n\nUgh. MtG talk."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=488648","commentId":488648,"userName":"Bohemond2","timestamp":1308643035,"content":"Lotr_Nerd said:\n\n it's not like you can simply walk into Dol Guldur.\n\n\n\nYes you do.  You totally do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=490104","commentId":490104,"userName":"DrNate","timestamp":1308853719,"content":"I think I discovered two of the keys to beating the third quest as I attempted it on my last day off from work and proceeded to get destroyed sans any significant progress.\n\nOne, especially in a solo game, I advise just choosing which hero gets captured. Or, if that feels like cheating, pick which hero you can live without and set the game up over and over until your chosen hero gets captured. Sure, a great deck/player should be able to handle losing any of the three, but I have neither of those things.\n\nThis other one may not be considered possible until the expansion hits, but I think a single-sphere deck may be needed to be successful. With a 2/1 deck or a 1/1/1 deck, I don't think you can win. one resource per sphere each turn (or worse, a completely lost sphere) is just too big a disadvantage.\n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=490349","commentId":490349,"userName":"Nico Deluxe","timestamp":1308906412,"content":"We played it once with four players. At first we had a hard time making some progress and at the same time keeping the enemies at bay. When we lost the third hero and locations became too many to overbare, we thought we soon would go down for good. But then a Northern Tracker hit he table and two turns later an other one. They cleared up locations easily - we didn't even travel anymore - and so we managed to get the upper hand. The climax came when Gimli, with the citadel plate and the dwarven axe, took undefeated damage from the nazgul only to strike back with a mighty attack of eleven to kill it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=490639","commentId":490639,"userName":"daveman006","timestamp":1308943376,"content":"Yep Gimli is a beast when properly decked out.  Takes down Trolls and Nazgul no problem. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=490849","commentId":490849,"userName":"Morbid666","timestamp":1309011003,"content":"happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nTried it for the 1st time last night and won. I had been eliminated and my 3 friends where at 49, 49 and 48 for thier threat when you finally beat the last quest..talk about close! It was a blat and i enjoyed the challange. I wll agree with some other people, without a northren tracker we would have lost, that card is invaluable!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=491156","commentId":491156,"userName":"npole","timestamp":1309093119,"content":"daveman006 said:\n\n \nYep Gimli is a beast when properly decked out.  Takes down Trolls and Nazgul no problem. \n \n\n \nI love Gimli equipped with a Citadel Plate plus a Dwarven Axe ;-)\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=495828","commentId":495828,"userName":"Anduril82","timestamp":1309962358,"content":"I finally beat it playing a two player game.  I was using a solo-sphere leadership deck for player 1 and a solo-sphere spirit deck for player 2.  Gloin ended up being the imprisoned hero at the start of the game.  Things were pretty tough at first, especially considering that I didn't have Celebrian's Stone for the first few turns to boost Aragorn.  I did manage to acquire both Favor of the Lady cards, which I used to boost Eowyn.  After surviving a few turns, I was able to gain multiple allies with the leadership deck, which was a big help in taking down enemies.  Northern Tracker was a big help too for dealing with locations in the staging area.  I suggest progressing fully on the 1st stage of the quest but waiting until you clear out the staging area before you grab your first objective card.  This will allow you to get a bigger boost when you commit to questing at the start of the 2nd stage of the quest, which is needed since the Nazgul comes into play the moment you progress and rescue your imprisoned hero.  I also recommend getting Gandalf's Map first since all it does it prevent attack and defending for a single hero.  The obvious choice is to have your primary questing character grab Gandalf's Map, which in my case was Eowyn.  I also recommend trying to kill the Nazgul during this stage as well if you can.  Gandalf will be a big help here if you are fortunate enough to have him in your hand.  After I had enough progress to complete the 2nd stage of the quest, I grabbed the other two objective cards.  I gave the Shadow Key to Aragorn since he had the most health, and I gave the Dungeon Torch to Dunhere since my spirit deck had the lower threat level.  At that point, it came down to questing like mad.  You only have gain 7 progress tokens for the 3rd stage, and if you killed the Nazgul during the 2nd stage, it shouldn't stop you from winning.  You definitely want to hurry through the 3rd stage since both the Dungeon Torch and the Shadow Key are dangerous to hold onto for too long.  I hope this helps.  I'm still trying to figure out how to beat this scenario solo though.  In the words of Gandalf, \"Fly, you fools!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/48483-3rd-quest-is-so-tough/?do=findComment&comment=496049","commentId":496049,"userName":"Jimson","timestamp":1309991901,"content":"DrNate said:\n\nI think I discovered two of the keys to beating the third quest as I attempted it on my last day off from work and proceeded to get destroyed sans any significant progress.\n\nOne, especially in a solo game, I advise just choosing which hero gets captured. Or, if that feels like cheating, pick which hero you can live without and set the game up over and over until your chosen hero gets captured. Sure, a great deck/player should be able to handle losing any of the three, but I have neither of those things.\n\nThis other one may not be considered possible until the expansion hits, but I think a single-sphere deck may be needed to be successful. With a 2/1 deck or a 1/1/1 deck, I don't think you can win. one resource per sphere each turn (or worse, a completely lost sphere) is just too big a disadvantage.\n\nThoughts?\n\n\n\nI agree with choosing the hero.  I was playing a Leadership/Spirit deck (Aargon, Theodred, and Ewoyn), and I knew if Ewoyn was randomly picked, it wouldn't be worth my time trying to make it through, and Aragon is pretty important since he can ready himself.  After a few times, I just chose Theodred as my captured hero.  I have beaten the third scenario once solo (the cards were just in my favor), but I guess that's bound to happen after 40+ attempts.\n\n "}]}