{"url":"https://community.fantasyflightgames.com/topic/48518-guards-guards/","title":"Guards, Guards!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486678","commentId":486678,"userName":"Mighty Jim 83","timestamp":1308287593,"content":"A few questions about the third scenario, and the associated \"guarded\" business.\n\n \n\nDo enemies that are attached to objectives as gaurds engage you? or do they stay guarding the card.\n\nAre cards currently attached to objectives classed as being in the staging area (for purposes of using Dunhere to attack, or Northern Tracker to explore?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486693","commentId":486693,"userName":"Spirit Juggler","timestamp":1308289543,"content":"They stay guarding the card. You have to choose to engage them. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486704","commentId":486704,"userName":"pumpkin","timestamp":1308291421,"content":"spirit said:\n\n \n\nThey stay guarding the card. You have to choose to engage them. \n\n \n\n \n\nWhat are you basing that on?\n\nIf your threat is high enough they would still engage would they not - I'm not aware of anything relating to the guarded keyword that suggests enemies guarding something are treated any differently to enemies not guarding something.\n\n \n\nTo answer the second question, I think encounter cards guarding an objective are still classed as in the staging area, unless they aren't in the staging area! (i.e. you make a location an active location, or you engage or are engaged by an enemy guarding an objective)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486824","commentId":486824,"userName":"Eldil","timestamp":1308308031,"content":"From Page 24 of the rules:\n\n\nGuarded\nThe guarded keyword is a reminder on some objective cards to reveal and attach the next card of the encounter deck to the objective when it enters the staging area from the encounter deck, and place them both in the staging area. The objective cannot be claimed as long as any encounter card is attached. Once that encounter is dealt with, the objective remains in the staging area until it is claimed. If another objective card comes up while attaching a card for the guarded keyword, place the second objective in the staging area, and use the next card of the encounter deck to fulfill the original keyword effect.\n\nEnemy and location cards attached to guarded objectives do still count their threat while the enemy or location is in the staging area. An encounter card attached to a guarded objective is dealt with in the\nfollowing method, depending on its card type:\n\nEnemy: The enemy leaves play, either by being defeated or as the result of a card effect.\n\nLocation: The location leaves play, either by being fully explored or as the result of a card effect.\n\nTreachery: The treachery’s effects resolve, or are canceled. (Treachery cards are immediately triggered when they are revealed.)\n\nOnce all encounter cards attached to a guarded objective are dealt with, the players can claim the objective in the manner specified by its card text.\n\nYeah, I don't see anything about \"not engaging\" here. It's confusing because the objective is \"attached\" to the the enemy, so you would imagine where the enemy goes, it goes. But if you engage and kill the enemy (causing the enemy to leave play) \"\"the objective remains in the staging area until it is claimed.\"\n\nBut I would say it doesn't \"remain\" in the staging area; it is placed in the staging area as soon as the enemy is killed (the same as it would if it were attached to a location), and that's where it stays until claimed.\n\nMy two cents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486839","commentId":486839,"userName":"pumpkin","timestamp":1308309738,"content":"Eldil said:\n\nBut I would say it doesn't \"remain\" in the staging area; it is placed in the staging area as soon as the enemy is killed (the same as it would if it were attached to a location), and that's where it stays until claimed.\n\nMy two cents.\n\n\n\n \n\nYep, thats what I do, it just easier to track when the objective can be claimed that way.\n\nIt goes with the card that guards it, wherever that card goes,  until that card is removed from play by whatever means then the objective goes (back) into staging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486875","commentId":486875,"userName":"Morbid666","timestamp":1308313460,"content":"I have to agree with what Spirit said. You have to choose to  engage the \"guard\". Even though the rules are not clear, think about it. The Object is being \"guarded\". The \"guard is going to stay at his post until someone comes to try and take that object."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486883","commentId":486883,"userName":"jesseolivier2","timestamp":1308315120,"content":" man i agree with both sides logic. however the rules dont make any such reference to not engaging, therefore ill have to lean it can engage you to. these are orcs and such and arnt the smartest of beasts...?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486900","commentId":486900,"userName":"Mighty Jim 83","timestamp":1308319157,"content":"glad to know I'm not the only one who found it unclear - \"attach\" suggests it stays where it is, but nothing says explicitly.\n\nMaybe another one for the FAQ, it sounds like there's some variation out there, so some of us must be wrong!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486966","commentId":486966,"userName":"felix16","timestamp":1308328937,"content":"Morbid666 said:\n\nI have to agree with what Spirit said. You have to choose to  engage the \"guard\". Even though the rules are not clear, think about it. The Object is being \"guarded\". The \"guard is going to stay at his post until someone comes to try and take that object.\n\n\n\nUnfortunately that kind of logic can´t be applied to what is actually a game. The rules say nothing about the creature not engaging, and so it is treated exactly as normal in this regard. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=486978","commentId":486978,"userName":"Eldil","timestamp":1308329817,"content":"Morbid666 said:\n\nI have to agree with what Spirit said. You have to choose to  engage the \"guard\". Even though the rules are not clear, think about it. The Object is being \"guarded\". The \"guard is going to stay at his post until someone comes to try and take that object.\n\n\n\nI think it could be equally argued that an enemy \"guarding\" an object would attack (engage) any heroes who were sneaking around (presumably to steal the object) as soon as it noticed them (aka, as soon as their threat got high enough).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48518-guards-guards/?do=findComment&comment=487248","commentId":487248,"userName":"Titan","timestamp":1308386264,"content":"I've always played that a card(be it an enemy or a location) behaves in the exact same manner it would if it had no objectives to guard. I think this is the most common sense approach. If a situation isn't clear, then you should default to the rules, until otherwise specified."}]}