{"url":"https://community.fantasyflightgames.com/topic/48544-attachments/","title":"Attachments","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48544-attachments/?do=findComment&comment=486957","commentId":486957,"userName":"Blepta","timestamp":1308327683,"content":"Hello,\n\ncan I play for example Horn of Gondor - tactics sphere and attach it to a hero from different sphere?\n\nThanx for answer.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48544-attachments/?do=findComment&comment=486973","commentId":486973,"userName":"felix16","timestamp":1308329222,"content":" Attachments can be attached to any cards you control, subject to the rules given on the attachment card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48544-attachments/?do=findComment&comment=486976","commentId":486976,"userName":"Apophenia","timestamp":1308329454,"content":" Also attachments can be played on other player's characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48544-attachments/?do=findComment&comment=487033","commentId":487033,"userName":"felix16","timestamp":1308336413,"content":"Apophenia said:\n\n Also attachments can be played on other player's characters.\n\n\n\nIs this actually clear and certain? Rulebook is a little unclear as I see it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48544-attachments/?do=findComment&comment=487053","commentId":487053,"userName":"TheLightdarker","timestamp":1308342466,"content":" Page 25, control and ownership.\n\n\"When a player plays an attachment card, he has the option of giving control of that card to another player by attaching the card to one of that player's characters.  Players always assume control of attachments that have been played on their characters.  If control of that character changes, so does the control of any attachments on that character.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/48544-attachments/?do=findComment&comment=487143","commentId":487143,"userName":"Casamyr","timestamp":1308348696,"content":"Actually this is a little unclear when some attachments - such a caught in a web are not under the control of the player to whom it is attached. But yes you can give an attachment to any character. Sometimes it makes more sense tactically to chuck that Horn of Gondor to a different player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48544-attachments/?do=findComment&comment=487168","commentId":487168,"userName":"TheLightdarker","timestamp":1308357762,"content":"I thought about specifically mentioning \"Caught in a Web\" when I made my first post, specifically because that was something that confused me in the beginning (I assumed it was under the player's control, per page 25, and could therefore be optionally discarded via certain shadow effects).\n\nHowever, someone pointed out to me that Caught in a Web is never actually played.  \"When a treachery card is revealed from the encounter deck, its text effects are resolved immediately, and it is then placed in the encounter discard pile.\"  The rulebook only ever mentions playing Ally, Attachment, and Event cards, and on page 12, under the Planning Phase, they even use fancy text for the word \"play,\" in regard to Attachments or Allies.\n\nSo, I agree with Casamyr, it is definitely a little confusing until you have that \"aha\" moment."}]}