{"url":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/","title":"Really Good Deck.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=487430","commentId":487430,"userName":"DurinIII","timestamp":1308421650,"content":" So, I really like dwarves and decided to try taking Gimli, Thalin, and Gloin; thus, this deck mixes Tactics and Leadership. Because the core deck is the maximum cards available at this time, you practically used all of the red and purple cards to make up this deck...it is in the way you play it that makes it so successful.  The trick is to go easy on questing early on, while beasting the heck out of enemies (using your various combat events), and then once you have enough allies in play you quest to the end. I have had EXTREME success with this deck against quest 1 and 2...quest 3 however is quite a bit more challenging and I am still working on it. I am fully confident that this deck can beat the first and second quest almost (if not every) time. Give it a try!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=487436","commentId":487436,"userName":"servant of the secret fire","timestamp":1308422942,"content":"I will not say anything about first quest cause it's very easy but for the second you have a low starting will power and a very high starting threat.Very bad choice for the second scenario.A lore/spirit or a leadership/spirit deck are better choises for second scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=487463","commentId":487463,"userName":"Bohemond2","timestamp":1308429254,"content":"I play a very similar deck in my two-player games.  I have found it to be quite effective.  For my tastes, it struggles in solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=487571","commentId":487571,"userName":"lleimmoen","timestamp":1308468472,"content":"I don't doubt your word, Durin. But I can also see this be better in coop. I've once made the deck (from the cards and heroes left...) but never gave it much of a try."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=488501","commentId":488501,"userName":"Lotr_Nerd","timestamp":1308611527,"content":" It seems to me that this deck is very random have you done multiple tests it may be it can beat a scenario once or twice but multiple times might be key not making fun of your choice I might try making it when I get the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=488922","commentId":488922,"userName":"DurinIII","timestamp":1308678024,"content":" Hey again all!\n\nAlright, so after having posted my previous thread, I realized that I had been horribly misreading some rules of the second scenario and so I concede that once I began playing it right, this deck began to fail majorly.  It goes to town on the first quest (which seems to be the case with any deck combination); hence, quest one is extremely easy. Anyway, yeah, the deck lacks high questing willpower as well as threat removal.  One way I have changed the original cast is by removing Thalin and adding Legolas.  This gives the much needed ability for Legolas to participate in a combined attack and triggering his amazing ability...adding two travel counters to the current quest.  This is much needed as winning quests early on with this cast is hard to do.  Quit frankly I still haven't been able to come up with a deck that can beat quest 2.  I got extremely close with a Spirit/Lore deck...but still can't beat it. Any help?  Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=488947","commentId":488947,"userName":"Apophenia","timestamp":1308680505,"content":"DurinIII said:\n\n Hey again all!\n\nAlright, so after having posted my previous thread, I realized that I had been horribly misreading some rules of the second scenario and so I concede that once I began playing it right, this deck began to fail majorly.  It goes to town on the first quest (which seems to be the case with any deck combination); hence, quest one is extremely easy. Anyway, yeah, the deck lacks high questing willpower as well as threat removal.  One way I have changed the original cast is by removing Thalin and adding Legolas.  This gives the much needed ability for Legolas to participate in a combined attack and triggering his amazing ability...adding two travel counters to the current quest.  This is much needed as winning quests early on with this cast is hard to do.  Quit frankly I still haven't been able to come up with a deck that can beat quest 2.  I got extremely close with a Spirit/Lore deck...but still can't beat it. Any help?  Thanks!\n\n\n\nIs it stage two of scenario two that you are having trouble with solo? My main advice is to complete it was quickly as possible. Using Protector of Lorien (if you are using Lore) to gain lots of Willpower is a good way of doing it. Since enemies don't engage you unless you want to don't be afraid to send everybody questing and get as much progress as possible. You can't afford to let that stage hang around it solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48645-really-good-deck/?do=findComment&comment=489260","commentId":489260,"userName":"ClydeCloggie","timestamp":1308739330,"content":"Apophenia said:\n\n \n\nIs it stage two of scenario two that you are having trouble with solo? My main advice is to complete it was quickly as possible. Using Protector of Lorien (if you are using Lore) to gain lots of Willpower is a good way of doing it. Since enemies don't engage you unless you want to don't be afraid to send everybody questing and get as much progress as possible. You can't afford to let that stage hang around it solo.\n\n\n\nYes, stage two is all about racing as fast as you can. Ideally it should not take more than two turns. Having a Gandalf available for 4 WP is almost a must (and you can also take out a staged enemy).\n\nThink of anything that could boost your passage on Anduin 2B and see if it fits the deck. Even otherwise fairly lame cards like Power in the Earth, Radagast's Cunning, Secret Paths etc. as the -1 threat could end up making a one turn difference to completing the stage.\n\n \n\n \n\n "}]}