{"url":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/","title":"Limited Number of Player Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488306","commentId":488306,"userName":"Kooning","timestamp":1308581901,"content":"First of all I would like to say that I like this game. The solitaire play is fun and the game play and design is good. However there is one thing that I find severely lacking: card options.\n\nI've played many card games over the years and one of the most enjoyable parts of the experience is going through all the cards I own and seeing what exciting decks I can come up with. However, with the Lord of the Rings Living Card Game we are limited to basically using all the cards. If I want to build a proper 50 card deck I basically only pick about 5 card to leave out... that's not very much fun, in my opinion.\n\nI guess that there isn't much I can do about it, but I was wondering whether some other players out there are having the same frustrations?\n\nI was looking forward to the first expansion deck, but was utterly disappointed to find out that it will only include TWO new (unique) cards per sphere! I'm seriously reconsidering whether to spend the money or not. Will it be worth the two cards? Two cards will not come close to solving my biggest concern with the game...\n\nA simple fix for this (in future expansions) might be to rather only include 2 copies of each card, thus having more unique cards in total. This will also be a good idea for those people that want to own 3 copies of all cards by giving them incentive to by another box.\n\nWhat do you think will the expansions be worth it from a deck building perspective?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488378","commentId":488378,"userName":"qwertyuiop","timestamp":1308589069,"content":" Nope. Give me play sets every day of the week.  Right now I like the idea of getting fully playable encounters in every expansion. I wouldn't complain if an expansion cycle required encounter sets from the core set if it freed up a little more space for player cards, though.\n\nThe limited number of cards is a minor gripe, but I think it's exacerbated by the long wait between the core set and the expansion. I certainly hope it doesn't take two plus months for each AP to be released in the future. That runs the bigger risk of dwindled interest in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488458","commentId":488458,"userName":"jesseolivier2","timestamp":1308601196,"content":" yeah. i feel it is a little early to start moaning about the card selection. Honestly, we dont even have one AP yet!!! (although we are all yearning for it). plus we shouldnt compare this to a CCG as they make about 170 different cards per block. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488550","commentId":488550,"userName":"Spirit Juggler","timestamp":1308624605,"content":"The games only just come out with the first AP not readily available yet. It's going to take at least a year before we have a really decent play list to have properly customizable decks maybe even a little longer. Give it time and they will come :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488558","commentId":488558,"userName":"jhaelen","timestamp":1308625046,"content":"Kooning said:\n\nA simple fix for this (in future expansions) might be to rather only include 2 copies of each card, thus having more unique cards in total. This will also be a good idea for those people that want to own 3 copies of all cards by giving them incentive to by another box.\n\n\n\nThat fix would be an excellent way to immediately get me to stop investing any more money in the game. This is definitely the worst idea I've seen in a long time here.\n\nIf you don't enjoy the game because there's not enough deck.-building possiblities yet, here's what to do:\n\nStop looking at the game for a year or two. Play something else in the meantime. Then come back to LotR and enjoy the wealth of cards that have become available during your abstincence."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488613","commentId":488613,"userName":"The Strolling Bones","timestamp":1308636376,"content":"I happen to agree that the options are frustratingly minimal.  However I'm happy to wait for more cards.  I wish that there were more multiples in the core set so that you could have a 50 card single sphere deck. \n\nI wish that the options where there but the game is rather new and I can't yet complain about customization just yet.  Also they better give three copies of every player deck card or that will really turn me off of the game.\n\nThe reason that I like the LCG format is the promise that you'll get enough cards to use 3 each of every card in your deck, I've found that this has not been the case, the core set is a perfect example of a disapointing card distribution.  I'm not buying 3 sets just to get that 3rd copy of only 6 cards and then having a whole bunch of extra encounter cards that are useless to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488634","commentId":488634,"userName":"soupy89","timestamp":1308640266,"content":"What they should do is release a core set \"tournament pack\" that fills out the copies in the core set. IE if there was one copy in the core set of a given card, include two in the tournament pack, if there were two copies, include one in the tournament pack.\n\nIt would be a great profit to them and I think all the players would appreciate it. They wouldn't need to design any new cards, could sell it with minimal packaging, and make deckbuilders happy.\n\nIt would also be cool to sell a \"full\" core set (3x core player cards) independently without rules and counters and such so that you could maintain multiple decks that had 3 copies of the same card for the really hardcore people (or people who don't want to have to remake their decks all the time).\n\nSorry if this has already been suggested, just thought I'd throw in my two cents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488753","commentId":488753,"userName":"Kooning","timestamp":1308656897,"content":"Thanks for all the replies. I think some of you are correct in saying that maybe I'm just a little impatient. I definitely think that in about a year from now things will look a lot better. I'll just have to wait it out...\n\nI thought about it a bit more and I agree it would suck if we only get 2 copies of each card in the expansions, especially since this is supposed to be a LCG after all.\n\nBut I have to admit as well that I would have loved it if we got 5 new cards for each sphere per expansion, especially in the first few packs to get things going gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif] .\n\nI would also have liked to see 3 of each card in the core set..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488847","commentId":488847,"userName":"Mighty Jim 83","timestamp":1308667221,"content":"Sadly, tournament players are likely to measure the game by CCG standards, and be the people happiest to fork out for 3 core sets, so soupy's idea of a \"tournament pack\" is never going to happen (which is a shame)\n\na 3x of each card core set was probably never likely, but the card distrbution as it stands is just crazy - compare Game of tHrones core set, where you get 1x of almost every card (maybe 3 or 4 exceptions) - at least that way a second or third core set purchase is almost all useful (assuming it's not supidly out of print just at the time of a major television series and first book release for 5 years, but that's another story...) As it stands I managed to jsutify the expense of a 2nd core set for LoTR, but a third one at £30 for about a dozen usable cards (in the UK we get particularly screwed as Fantasy Flight products are much more expensive) is beyond sensible or practical for most ordinary players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48779-limited-number-of-player-cards/?do=findComment&comment=488929","commentId":488929,"userName":"DurinIII","timestamp":1308678788,"content":" Agree with most of you...totally limited in the number of card options, however, this game is so fun to play! C'mon, it's Tolkien! "}]}