{"url":"https://community.fantasyflightgames.com/topic/48816-lore-or-leadership-beravor-vs-thedred/","title":"Lore or Leadership (Beravor vs Thedred)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48816-lore-or-leadership-beravor-vs-thedred/?do=findComment&comment=488679","commentId":488679,"userName":"lleimmoen","timestamp":1308647234,"content":"I have not been playing much solo until recently, although I have played well over hundred games coop. Now for about a week I have been practicing solo play and deck-building. I have come to appreciate Eowyn's power and also utilized Dunhere. This couple and thus Spirit-major deck is what I find most fit to solo play thus far. However, I am undecided about the third member and the minor sphere. Theodred and Beravor have been competing for the prestigeous spot and both have represented their spheres very well. Theodred has a thematical edge as he completes the Rohan trio. It also makes the event portion of the deck stronger in my opinion. Beravor brings Lore and better allies.\n\nHave you ever been undecided between these? What would be your choice?\n\nps: When I choose Beravor, I still play some Leadership cards using Song of Kings...Sneak Attack for Gandalf and Dunedain Mark for Dunhere are some super combos that are hard to omitt...they're much more easilly accessible with Theodred though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48816-lore-or-leadership-beravor-vs-thedred/?do=findComment&comment=488778","commentId":488778,"userName":"avgzxc","timestamp":1308659274,"content":"IMO, Beravor wins the last spot easily.\n\n1. Unexpected courage. Theodred and Eowyn are weak with it, Dunhere is average, Beravor is insanely good.\n\n2. She can draw easily what is needed fast - for example Song of Kings, which leads to..\n\n3. 3 cultures > 2 cultures and Steward of Gondor really makes the absence of Theodred much less unpleasant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48816-lore-or-leadership-beravor-vs-thedred/?do=findComment&comment=488857","commentId":488857,"userName":"Narsil0420","timestamp":1308668280,"content":"I used Glorfindel with Eowyn and Dunhere the other day and it worked very well. Gave me one of my few solo wins agains Anduin. I wanted him because of his healing ability and because he's good as an attacker or quester, or to sop up some damage if need be.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48816-lore-or-leadership-beravor-vs-thedred/?do=findComment&comment=488861","commentId":488861,"userName":"Kiwina","timestamp":1308668671,"content":" I lean toward Theodred, but that is mostly for the thematic Rohan trio.  A weakness with that trio is that they all have 1 defense, and not many allies from either sphere that can continuously act as defenders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48816-lore-or-leadership-beravor-vs-thedred/?do=findComment&comment=488907","commentId":488907,"userName":"lleimmoen","timestamp":1308676007,"content":"Thanks for your insight, gentlemen. Boromir and Bilbo are constantly in argument over deck-building. They like each other but can hardly ever come to easy answers."}]}