{"url":"https://community.fantasyflightgames.com/topic/48832-deck-size-for-core-set/","title":"Deck Size for Core Set","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48832-deck-size-for-core-set/?do=findComment&comment=488792","commentId":488792,"userName":"Maggical","timestamp":1308660898,"content":"Hi all,\n\nI've noticed that in the first quest you are recommended to play with any of the decks (just 1 sphere) and 1 Gandalf in each, making it a 30 card deck. What happens if I want to build a deck of my own? If I go by the 50 card deck that's used on tournaments there won't be much building, since I'll have to fit all of 1 sphere and most of the other.\n\nPersonally I think that building custom 30 card decks is better if you only own 1 Core Set, what do you think?\n\nJavier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48832-deck-size-for-core-set/?do=findComment&comment=488936","commentId":488936,"userName":"Kiwina","timestamp":1308679353,"content":" I think 30 card decks work fine for now.  40 might work as well, but I haven't tried building any 40 card decks yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48832-deck-size-for-core-set/?do=findComment&comment=489017","commentId":489017,"userName":"Mestrahd","timestamp":1308694337,"content":"I have 3 sets and I use single-sphere decks. So even with 3 copies of everything I can't make a 50 card deck for Lore or Tactics. I believe they top out at 48 using all their cards. I'm able to do 50 with Leadership and Spirit only because they can use out of sphere cards. (Celebrian's Stone and Stand And Fight) If you only have one core set, you should be able to do 30 or 40 card decks of a single sphere. If you increase to 2 spheres it's easier to max out that number."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48832-deck-size-for-core-set/?do=findComment&comment=489156","commentId":489156,"userName":"ClydeCloggie","timestamp":1308725179,"content":"I use 50 card decks with one core set. Single sphere is impossible, double sphere essentially means all of the major sphere and most of the minor sphere (or a few out of sphere cards if you can use Celebrian's Stone, Sneak Attack or Stand and Fight). So I've gone...triple sphere. Quite a lot of fun actually and I have been chopping and changing the deck based on play experiences. It's the closest you can get to proper deckbuilding from one core set currently."}]}