{"url":"https://community.fantasyflightgames.com/topic/48846-sneak-attack-gandalf-awsome/","title":"Sneak Attack + Gandalf = Awsome. :)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48846-sneak-attack-gandalf-awsome/?do=findComment&comment=488959","commentId":488959,"userName":"DurinIII","timestamp":1308682389,"content":" That's pretty much it...I just figured this combo out for the first time. The ability to trigger Gandalf's card ability multiple times is amazing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48846-sneak-attack-gandalf-awsome/?do=findComment&comment=489096","commentId":489096,"userName":"lleimmoen","timestamp":1308714079,"content":"DurinIII said:\n\n That's pretty much it...I just figured this combo out for the first time. The ability to trigger Gandalf's card ability multiple times is amazing.\n\n\n\nYeah, it's my favourite. It'd been known long before the game release but it's still hard to beat now after months of play. The Mr. Combo Man (cannot recall his name now) who has a very nice combo site has it on around #2 behind Beravor plus Unexpected Courage. I personally like Sneaky Gandalf little more for its decisiveness (if that be a word). The drawing combo is easier to get and is overall awesome (can last the whole game) but you usually don't win by just drawing cards. Although having Protector of Lorien, too, is getting closer to that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48846-sneak-attack-gandalf-awsome/?do=findComment&comment=493066","commentId":493066,"userName":"Jimson","timestamp":1309371767,"content":" I would like to run this by people here.  Based on the flow of Turn Sequence on page 30 in the rules, you should not be able to use Sneak Attack to have Gandalf help in a quest since player actions (i.e. play Sneak Attack) take place after you commit characters to a quest. And you can't play Sneak Attack prior, since that would be in the Planning Phase and Gandalf will leave prior to the questing phase (at the end of the Planning Phase).  Am I reading this right? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48846-sneak-attack-gandalf-awsome/?do=findComment&comment=493214","commentId":493214,"userName":"Doom1502","timestamp":1309401497,"content":"There are spaces for player actions in the overwiew on the last two pages and other spaces that are red or green. You can take actions in all the green ones. That means playing gandalf at the beginning of the quest phase with sneak attack is legal. The extra spaces with nothing but player actions printed on them just state that you can in most times take actions at the end of a phase but there is nothing coming from the game mechanics right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48846-sneak-attack-gandalf-awsome/?do=findComment&comment=493330","commentId":493330,"userName":"Jimson","timestamp":1309423753,"content":" Ahhh...now I see that.  Thanks for pointing that out.  I was hoping I was wrong."}]}