{"url":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/","title":"Thinking About Taking the Plunge, Questions About Deckbuilding","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489338","commentId":489338,"userName":"TakeshiKovacs","timestamp":1308749061,"content":"I've been on the fence about the LotR LCG but a couple of guys in my gaming group have the game so I'm taking a harder look at it. I've been a Tolkien fan since the early 80s, back when amassing Tolkien lore was almost like work, no internet. We had to walk uphill 3 miles in the snow with no shoes to read Tolkien but that's beside the point.I've read reviews, watched videos on BGG (too much debate and op-ed on the game over there to ask questions) and I have a learning game coming up with someone else's cards. I have some questions about the game in case I go on a buying spree at the LGS after i play the game..\n\nWhat are my deckbuilding options with 1, 2, or 3 core sets plus the upcoming first expansion? I would prefer to buy 2 cores at most but buying 3 isn't out of the question if I like the game, one of my gaming buddies will be teaching me with his cards in the near future. I have no problem with spending time building decks and actually that's part of the appeal for me. I've been having a lot of fun with the AGoT LCG since I got into that a couple of months ago. Yes, I know they are different games. I have no problem with buying expansions either.\n\nHas anyone built and played any serious tournament decks and what kind of card collection are we talking to be competitive?\n\nWhat's the story with people saying they are happy with the decks they build from 1 core set? Everything I read prior to the game's release said YOU HAVE TO HAVE 3 SETS to build decks.  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489389","commentId":489389,"userName":"lleimmoen","timestamp":1308753759,"content":"There are few cards that appear only once in the core set. And majority of them are quite essential for one sphere or another. But as the pics are all over the internet, I think it is not a big deal to print a copy. I myself have bought 3 sets. The deck-building options will surely come with the expansions. It already takes some consideration to create a great deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489398","commentId":489398,"userName":"Glaurung","timestamp":1308754474,"content":"Hallo friend.I also huge fam of tolkien and aslo remember wild time of my childhood...... I was born in Soviet union and this book was forbidden there.....\n\nI use to play lotr tcg from decipher for years. Now game is death already no update but it was very good game...... So we have now the new game and this game quite cool. I like it a lot. Specially for solo playing.Not really have time to play with someone. But i sometimes i  do this with my friends and game  shining in coop mode.\n\nAnyway 2 core sets is enough to start. You will get everything what you need.After you can buy couples of singles cards like U.courage...... The adventures packs really delay (make me angry like mordor) but in the end i hope we shall get it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489416","commentId":489416,"userName":"TakeshiKovacs","timestamp":1308756672,"content":"lleimmoen said:\n\n It already takes some consideration to create a great deck.\n\n\n\nThis is good. If I read you right there are already some actual deckbuilding options with more to come. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489418","commentId":489418,"userName":"TakeshiKovacs","timestamp":1308756895,"content":"Glaurung said:\n\nHallo friend.I also huge fam of tolkien and aslo remember wild time of my childhood...... I was born in Soviet union and this book was forbidden there.....\n\nI use to play lotr tcg from decipher for years. Now game is death already no update but it was very good game...... So we have now the new game and this game quite cool. I like it a lot. Specially for solo playing.Not really have time to play with someone. But i sometimes i  do this with my friends and game  shining in coop mode.\n\nAnyway 2 core sets is enough to start. You will get everything what you need.After you can buy couples of singles cards like U.courage...... The adventures packs really delay (make me angry like mordor) but in the end i hope we shall get it.\n\n\n\nHallo friend. I played the Decipher game through the first expansion as well. I'm not sure what the singles buying option are here in the middle of the USA but it's encouraging that 2 cores are enough for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489597","commentId":489597,"userName":"Glaurung","timestamp":1308790181,"content":"I saw somewhere in internet (and in this forum also have some topic about this ) on amazon or ebay singles cards for sale. U. courage for example 5 usd. If you buy 2 core set you need only couples of cards like: 1 more U. courage , Celebrian stone and another 2 3 cards.\n\nAnyway i have 2 core sets my friend also have 2 so we can build up any deck what we want. Actually waiting for the first tournament!!! Hunt for gollum will arrive soon to our town. We want to make private pre-realise tournament. The lowest shore get pack for free."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489675","commentId":489675,"userName":"lleimmoen","timestamp":1308803786,"content":"TakeshiKovacs said:\n\nlleimmoen said:\n\n \n\n It already takes some consideration to create a great deck.\n\n \n\n \n\nThis is good. If I read you right there are already some actual deckbuilding options with more to come. \n\n\n\nThere certainly are. Quite a few. With a limited amount of cards, so far. The options will surely multiply with the expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489957","commentId":489957,"userName":"overdog","timestamp":1308838545,"content":"I bought 3.  I would say 2 is essential unless you don't mind proxing.\n\nReasons I bought 3 at $29 each.\n1. 1 playset of each card.\n2. Each quest deck is creatable.\n3. 2 playsets of some of the uncommon powerful cards like sneak attack, etc..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=489985","commentId":489985,"userName":"TakeshiKovacs","timestamp":1308841403,"content":" Ok it looks like I can get away with just 2 cores. I'll play the game and then throw some decks together to see where I'm at with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=490380","commentId":490380,"userName":"Iver2","timestamp":1308910861,"content":"hey guys,\n\n\nNew here, so greetings to all the Tolkien fans in the world from Ireland first of all.\n\n\nI love your statement Glaurung: (makes me angry like mordor)! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] Me too!\n\n\nSo far, I have only played with one core set, two and three player games. Sure, your options are more limited but well, so far i only got the impression that adding more decks which results in having much stronger cards in your deck and that only makes the game easier? Right?\nOr would you experts say because that the amount you need to pay for a better card equalizes that fact? Does it really make sense to include as many super great cards as possible? You will have to pay for them as well...right? And also, let’s be realistic, even in the second or third quest you will every even draw half of your cards.\n\nAre  those \"pimped\"  decks supposed to be used for those campaign or \"nightmare\" game modes? where you play through several quests at once???\n\n\nI also heard about people on the forum putting 3 Gandalfs in theirs decks. Is it not mentioned in the Rulebook that this is not allowed?\n\n\nI will surely buy all the expansions and therefore increase options anyway but I don't really get the point of buying more than one core so far, especially with all the expansions coming out.\n\n\nI don’t really appreciate easy games. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=490511","commentId":490511,"userName":"felix16","timestamp":1308926846,"content":"Iver said:\n\n \n\nI also heard about people on the forum putting 3 Gandalfs in theirs decks. Is it not mentioned in the Rulebook that this is not allowed?\n\n \n\n\n\nNo, your deck can include up to three copies of each player card. The one Gandalf per deck is how you set up the beginner decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=490519","commentId":490519,"userName":"Iver2","timestamp":1308927808,"content":"Felix said:\n\nIver said:\n\n \n\n \n\nI also heard about people on the forum putting 3 Gandalfs in theirs decks. Is it not mentioned in the Rulebook that this is not allowed?\n\n \n\n \n\n \n\nNo, your deck can include up to three copies of each player card. The one Gandalf per deck is how you set up the beginner decks.\n\n\n\n \n\nah, ok! lol\n\n \n\nthanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=490547","commentId":490547,"userName":"Rashley","timestamp":1308931119,"content":"Obviously money is a big issue for most people and is the main reason I resist buying multiple sets.  If money is no object, then multiple sets do give you more options as you get choices of cards.  However, think of what is wasted.  Do you need multiple copies of unique heroes?  Of course, one could get damaged or lost, but they aren't needed.  2 core sets give you the luxury of 4 threat dials and spare tokens, but this is easily overcome with a little ingenuity.  3 core sets seems an expensive extravagance when people still sell off old sets or single cards.  It looks like things are going back to the 'bad old days' of ccgs where money spent equates to better chances and easier games.  Remember when a rare trading card could change hands for hundreds of pounds/dollars.  It is still only a single card.  I have no objection to great companies like FFG making a profit so that they can continue, but it can lead to a temptation to 'Print Money'.  Still, if you can afford it, who can stop you?  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48885-thinking-about-taking-the-plunge-questions-about-deckbuilding/?do=findComment&comment=490726","commentId":490726,"userName":"felix16","timestamp":1308976625,"content":" I for one am certainly considering buying at least one more core set. It expands your options for deckbuilding by giving you multiple copies of cards that were not included as full playsets, and allows you to have several different decks constructed. It even makes it possible to have several quests´ encounter decks readily constructed and available for play. This might be a minor thing, but I would like to be able to avoid the hassle of changing the cards around when I feel like playing a different quest."}]}