{"url":"https://community.fantasyflightgames.com/topic/48908-the-quest-and-growings-dangerous/","title":"The quest and growings dangerous","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48908-the-quest-and-growings-dangerous/?do=findComment&comment=489608","commentId":489608,"userName":"Glaurung","timestamp":1308793400,"content":"I use to play a lot of games (solo and coops.) and after 1 months have some though i want to shares with you.  Also i would like to hear your conclusion about this.\n\n1 Easy to play again encounter deck.\n\nFor the first games is definitely hard to play but when you build up the power deck is so easy and boring. With good deck and with good playing skills this is start to be really boring. \n\nBut more better player you start to be more challenge you should meet right?Otherwise on the certine level you start to lose interest of game.\n\n In the beginning of the game (the first stage of quest ) is always more hard than in latest stage of the game.\n\nWhen you start your heroes a weak and you need to play attachments to make them stronger , build up you defense line and so on.\n\nBut encounter deck is strong already and sometimes start with couples of cards in staging area in the beginning.Beginning is always challenge and hard.That make this part of game amazing.\n\nSo what happen on the latest stages of the games??? Right . Your heroes a strong by attachments , you have allies who is helping you and what about encounter deck???\n\nYes encounter deck is still on the same level. The most problem of the game is Encounter deck is not Build up and grow with his strategy against you. He is stil all the time on the same level. And from certine point encounter deck is no dangerous anymore for you. \n\n2 How to fix it?\n\nMake  encounter deck also grow up with the levels of the game. You heroes get attachments and allies??? And encounter cards also get some kind of attachments or treachery cards to make parmanents effect for encounter cards.For examples Make shadow effect almost on all cards. This make combat is much more interesting.  \n\nSome kind of treachery or shadow artefacts who is stay all the time on the staging area and provide some effects every round. All orcs get attack +1 on the first quest cards on the second quest cards attack +2 and on the thirds quest cards attack +3.\n\nThe encounter deck MUST grow up with the game progress and make more powerfull effect as your heroes strart to be more powerfull. For examples card: Eye of the forest which is discards any event in your hands. Why is only one per deck???? Should be 2 or 3. Than is already much more dangerous. I understand for core set , for beginning of the game quest is more easy. But i really hope the future quest will be more hard and if the players progress to be stronger the encounter deck strike back with also more stronger effect of his cards.\n\nThanks to read all of this and sorry for my English. I try my best.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48908-the-quest-and-growings-dangerous/?do=findComment&comment=489691","commentId":489691,"userName":"Jules17","timestamp":1308806227,"content":"I could imagine that a scenario will consist of more than only one encounter deck. Then you have to change the encounter deck with the progress of the scenario. I like this idea very much, because it forces the feeling of traveling. Locations and encounters change during the scenario and still fit to the adventure. For example: A scenario starts before you enter Moria. Other locations would be needed as when the scenario lead you in to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48908-the-quest-and-growings-dangerous/?do=findComment&comment=490393","commentId":490393,"userName":"Iver2","timestamp":1308912018,"content":"Jules said:\n\nI could imagine that a scenario will consist of more than only one encounter deck. Then you have to change the encounter deck with the progress of the scenario. I like this idea very much, because it forces the feeling of traveling. Locations and encounters change during the scenario and still fit to the adventure. For example: A scenario starts before you enter Moria. Other locations would be needed as when the scenario lead you in to it.\n\n\n\n \n\nNice idea, i hope a future quest will include something like that!\n\n \n\nBasically Glaudrung, I think the fact that as a quest progresses, its normally should get harder and harder, equalized what you have described. When I remember correctly, quest two and three have such an increase in difficulty, right? But basically, i get what you mean, the increase doesn't match the increase in your own strengh. Also keep in mind, that you get damage and damaging attachments during the play.\n\nAlso as i posted in another thread, I don't really see the point of creating super-decks with 2-3 cores with which you could beat the third quest completely drunk solo let say. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}