{"url":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/","title":"Hummerhorns Damage","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=489838","commentId":489838,"userName":"Svenn","timestamp":1308826703,"content":"Is the damage from the Hummerhorns lowered by defense or is it just a straight 5 damage to a hero with no reduction? It seems like it's a straight 5 damage with no reduction, but that means it's basically an insta-kill on one of your heroes. Is that right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=489847","commentId":489847,"userName":"Kiwina","timestamp":1308827388,"content":" I'm pretty sure that's how it works, otherwise they're not that intimidating.  That's also why they give you 5 victory points for defeating them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=489882","commentId":489882,"userName":"mrtoadz","timestamp":1308831718,"content":"A hero's defense only factor's in if the hero is a declared defender during the combat phase.  Otherwise, any time a card instructs to \"apply X damage,\" like Kiwina said above, it's applied directly to your hero's health.  There are other ways to deal with hummers--a spirit deck can keep the threat low and use Dunhere to whitle away while Hummers are in staging, a tactics deck could have a couple citidel plates on a hero, a lore deck could send the Hummer card to the bottom of deck or snare the Hummers... but yeah, it's a beast of a card to deal with for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=489886","commentId":489886,"userName":"Svenn","timestamp":1308832328,"content":"Yeah, that's what I figured, I just wanted to double check. It popped up in a game last night (my third game, the first game for my 2 friends) and it was basically just a \"Well, someone has to die\". Seemed rather excessive, so I thought maybe there was a catch.\n\nThanks for the tips though, I see from the forums that there are a few ways to deal with it, so we'll know next time it comes up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=490006","commentId":490006,"userName":"ClydeCloggie","timestamp":1308843802,"content":"From mrtoad's list, the Forest Snare wouldn't work as it has no effect on engaging. Your best bet is to kill the Hummerhorns in the SA with Gandalf's ability or Dunhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=490139","commentId":490139,"userName":"gatharion","timestamp":1308859311,"content":" There's also that armor attachment that gives four Health to a Hero. I put that on Gimli and just let the Hummerhorns smack him. Then, just because it amused me, I gave Gimli the Dwarven Axe. He ended up with an 11 attack or something crazy like that.\n\n \n\nThis does bring up a question I've been pondering though, what happens if your hero takes a bunch of damage while wearing the armor, but then has to discard said armor. Would all the damage taken now apply to his unmodiffied Health levels?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=490142","commentId":490142,"userName":"Kiwina","timestamp":1308860317,"content":" I've played it that way.  I've lost Gimli to the Forest Spider's shadow effect a couple times because of that too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=490183","commentId":490183,"userName":"TheLightdarker","timestamp":1308870248,"content":"gatharion said:\n\nThis does bring up a question I've been pondering though, what happens if your hero takes a bunch of damage while wearing the armor, but then has to discard said armor. Would all the damage taken now apply to his unmodiffied Health levels?\n\n\n\nAccording to the rulebook, hit points are \"the number of damage required to destroy [a] card.\"  Therefore, as soon as a card has a number of damage tokens on it equivalent to its hit points, it is immediately destroyed.  So if Gimli had five damage tokens on him, but was still alive thanks to Citadel Plate, the moment that attachment was discarded, Gimli's hit points would of course be returned to their normal value (5), and he would be destroyed.\n\nTo make matters worse, if he had to discard the Citadel Plate due to, lets say, Forest Spider's shadow effect, the player wouldn't even have any opportunity to heal or remove any of those damage tokens before the attachment is discarded since shadow effects are resolved immediately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=490856","commentId":490856,"userName":"Morbid666","timestamp":1309012571,"content":"Actually all you need to do is  choose to engage the Hummerons 1st. Remember card says deal 5 damage when THEY engage YOU. You`ll still have to fight it as normal but do not suffer the 5 damage...read the wording carefully, that is why you have an oppurtunity to engage enemies if you so choose instead of waiting for your threat to get so high that they attack you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=490857","commentId":490857,"userName":"felix16","timestamp":1309013037,"content":"Morbid666 said:\n\n \n\nActually all you need to do is  choose to engage the Hummerons 1st. Remember card says deal 5 damage when THEY engage YOU. You`ll still have to fight it as normal but do not suffer the 5 damage...read the wording carefully, that is why you have an oppurtunity to engage enemies if you so choose instead of waiting for your threat to get so high that they attack you.\n\n \n\n \n\nI´m afraid that doesn´t work. Read the rules on page 16 (paragraph 3 of step 2). Wether you choose to engage or the enemy engages you, you count as having engaged it and it counts as having engaged you. The purpose of voluntary engagement is to remove from the staging area enemies that wouldn´t engage you otherwise, but you want them gone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48929-hummerhorns-damage/?do=findComment&comment=490871","commentId":490871,"userName":"Morbid666","timestamp":1309016077,"content":"Yea i went back and read that. You are right, o well i thought i had an idea:)"}]}