{"url":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/","title":"Alternate Scoring System","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/?do=findComment&comment=489940","commentId":489940,"userName":"soupy89","timestamp":1308837238,"content":"Basically a first criteria with a list of tie-breakers. I'm mostly basing the order on the \"theme\" of Lord of the Rings, so feedback on the game balance would be good.\n\n1. # of Rounds X # of Players (ie solo taking 4 rounds = 4, two player taking 4 rounds is 8)\n\n2. Threat Cost of Each Dead Heroes\n\n3. # of Encounter Cards in play and in discard\n\n4. Damage Tokens on Remaining Heroes\n\n5. Final Threat Level\n\n6. Victory Points\n\nNumber of rounds is first because stalling is boring and isn't in line with the theme.\n\nThreat cost of dead heroes is important, because heroes aren't thrown away needlessly in the books. They only die when necessary. I think there is also nice juxtaposition between the first two criteria. You want to finish the quest as quickly as possible while also preserving your heroes. Is it worth it to commit that one extra character in questing and bank that no engaging enemies will be revealed?\n\n# of Encounter cards is the only way I can think of to reward players for the potential swing of the encounter deck (besides victory points which are actually probably going to be bad for tournament play since they are too few and will wind up being random boosts for some and not others). Basically more cards seen increases probability of fighting harder monsters, getting worse Reveal effects and Shadow effects. Other ideas (other than assigning points value to every card) are welcome. (I also thought about suggesting that each encounter deck be set up identically so the scoring would sort of be like duplicate bridge, but I think that would be a nightmare if there was more than one round)\n\nDamage tokens, basically same as above with dead heroes. Except that I think it makes more sense to reward players who potentially saw harder cards than to reward players who are too cautious to put their heroes in danger.\n\nFinal threat level is last because I think the game (and books) are exciting when there is a lot at stake. I think it's silly to penalize players for getting in just under the wire in terms of threat, it makes the experience better.\n\nVictory points are last because they are pretty arbitrary (as above).\n\nSo you go down the list until there isn't a tie.\n\nI think Encounter Deck variability is the biggest problem. Thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/?do=findComment&comment=490023","commentId":490023,"userName":"jesseolivier2","timestamp":1308845371,"content":" yeah the encounter deck wont work very well. I know i would sacrifice a few turns to try and delplete it if it was close to being gone so it gets reshuffled. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/?do=findComment&comment=490047","commentId":490047,"userName":"soupy89","timestamp":1308847914,"content":"I was actually thinking that more cards in discard/play from Encounter would be better (IE represent seeing more threats, and therefore a greater accomplishment to win) but I didn't even think of reshuffling it. I guess then the first criteria would be reshuffles followed by number of cards out.\n\nEDITED:\n\n1. # of Rounds X # of Players (ie solo taking 4 rounds = 4, two player taking 4 rounds is 8) (less is better)\n\n2. Threat Cost of Each Dead Heroes (less = better)\n\n3. # of Times Encounter Deck Reshuffled (more = better)\n\n3. # of Encounter Cards in play and in discard (more = better)\n\n4. Damage Tokens on Remaining Heroes (less = better)\n\n5. Final Threat Level (less = better)\n\n6. Victory Points (more = better)\n\nAre there cards that would let you take advantage of the idea that seeing more Encounter cards is better for you in terms of scoring? IE cards that put lots of stuff in the Encounter discard without any chance of having to face it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/?do=findComment&comment=490955","commentId":490955,"userName":"jesseolivier2","timestamp":1309034670,"content":" wouldnt you want to reshuffle the deck less?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/?do=findComment&comment=491033","commentId":491033,"userName":"felix16","timestamp":1309065352,"content":" I think the point was that the more the encounter deck has been shuffled, the more challenges you have faced, but it could be just a lot of shadowcards with little effect. Shouldn´t really be a very important aspect imho."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/?do=findComment&comment=491084","commentId":491084,"userName":"noosphear","timestamp":1309080434,"content":"Reshuffling the deck really shouldn't have any bearing on the game.  If number of turns is how you are going to put a clock on the players then giving a bonus for reshuffling the deck seems pretty counter-productive.\n\nFor instance, I'm trying to score as many points as possible and we are two turns away from reshuffling the deck.  If I stall those two turns to make sure we reshuffle then I'm just doing exactly what this scoring system is trying to stop.  By using the reshuffle as a bonus then you will still have situations where stalling is the way to score the most points.  In order to eliminate stalling there really needs to be 0 incentive to do it and having rounds played as a clock accomplishes that.\n\nThere isn't a way to take the randomness of a card game out of the scoring.  Some games it is going to be easy, some games it is going to be tough and take longer but the victory cards are there to offset that.  I understand that makes tournament scoring inherently unfair, but card games can be like that.  There is an element of randomness to the cards you draw and that's what keeps the game fresh and exciting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/48941-alternate-scoring-system/?do=findComment&comment=491232","commentId":491232,"userName":"soupy89","timestamp":1309104162,"content":"@Noosphear: Actually, the reshuffles and round count aren't in opposition because this scoring system is basically a list of criteria, not a summative score. For example, if team 1 takes 3 rounds to beat a quest, has 2 dead heroes, and 1 reshuffle, that is better than a team that takes 4 rounds with 0 dead heroes and 1 reshuffle. You only use the criteria after # of rounds as tie-breakers. IE if team 1 takes 2 rounds to beat a quest but has 1 dead hero, they are beaten by team 2 who took 2 rounds to beat the quest with 0 dead heroes.\n \n\nI agree that in casual play the variation is really good for playability but I think for tournaments it is bad because there is too much variation in the encounter deck. For example, on Mirkwood, there is a low chance of having to fight Ung. Spawn twice, but if you do it seriously changes the outcome of the adventure.\n \n\nI have two other main ideas to control the randomness of the encounter deck:\n\n1) Create special highly consistent encounter decks for tournaments. IE make it so that all cards are within a +/-2% range of probability of appearing. For example, right now Ung Spawn makes up 2.7% of the Dol Guldor encounter deck (not including Nazgul & objectives). The chance of flipping it as an enemy is much lower (comparatively) than flipping Dul Goldor orcs (8.3% of the deck). BUT if you do wind up fighting Ung Spawn, that's a totally different game than someone who doesn't fight it. This could be solved by having fewer individual cards in the deck and more copies of the remaining cards to make it more consistent. Since the tournament organizers could still keep the included cards hidden, there would still be surprise in what was in the deck. Also, using longer scenarios would help to make sure that the percentages evened out and that participants were more likely to have to face all the cards at least once.\n\n2) Have the opposing team play the encounter deck. I have yet to try this, but think that each of the opposing players could hold 2 encounter cards. They could collaborate like the hero team. When they play one (alternating between them) they immediately draw a new one. This would make the encounter deck more controlled because it would be played intelligently instead of randomly. It would also make the game way harder which could mean that even Mirkwood might be a challenge and tournament playable. Denethor and Henmarth could peak at one of the opposing players hands (so they'd actually see two cards that will eventually come up, but don't know for sure which one is next, which I think is an ok tradeoff)\n\nIf either of these are implemented the alternate scoring gets easier:\n\n1. # of Rounds X # of Players (ie solo taking 4 rounds = 4, two player taking 4 rounds is 8) (less is better)\n\n2. Threat Cost of Each Dead Heroes (less = better)\n\n3. Damage Tokens on Remaining Heroes (less = better)\n\n4. Final Threat Level (less = better)\n\n5. Victory Points (more = better)\n\n \n\nOne question I would like feedback on is this: do you count the number of actual rounds played by non-eliminated players or do you multiple the number of rounds taken to complete the whole quest by the number of players regardless of elimination? IE If I take 6 rounds to complete a quest with two players, but one is eliminated on turn 1, only 7 player rounds were really played BUT it could've been 12. Personally I would leave elimination out of it, as it creates a high incentive to keep the other player in the game which I think is both in line with the theme of LOTR and also more competitively interesting and honorable."}]}