{"url":"https://community.fantasyflightgames.com/topic/49105-eleanor-in-setup-phase/","title":"Eleanor in setup phase","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49105-eleanor-in-setup-phase/?do=findComment&comment=491472","commentId":491472,"userName":"Ileopsoas","timestamp":1309154189,"content":"I still have th question:can Eleanor be exhausted in the setup phase to prevent treachery cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49105-eleanor-in-setup-phase/?do=findComment&comment=491482","commentId":491482,"userName":"lleimmoen","timestamp":1309155405,"content":"I'd say yes but where's the FAQ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49105-eleanor-in-setup-phase/?do=findComment&comment=491490","commentId":491490,"userName":"Glaurung","timestamp":1309155857,"content":"Ah my friend. You know how many players have questions????  I also really wont to know about when revealed effect in setup is occur or not???\n\nThere is no clean explonation about this. If yes than you can exhaust her if not there is no point.\n\nAnd there is so many another question. We Waiting for that **** FAQ(sorry but may pations is already lost) and for the next and first adventures pack so long!!!! And actually i see activity on the forum start to be more low than before. People tired to wait and start looking for another games maybe?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49105-eleanor-in-setup-phase/?do=findComment&comment=491518","commentId":491518,"userName":"pumpkin","timestamp":1309160451,"content":"I'm pretty sure the FAQ is on the way, and that FFG and forum members are putting some serious effort into it to ensure if covers at lot more of the outstanding questions, but obviously this does all take time.\n\n \n\nAs for when revealed, there isn't anything in the rules to suggest those don't trigger during set-up is there, so I would have those trigger during set-up if they occurred, and therefore by association Eleanor should be allowed to respond and cancel a when revealed during set-up.\n\nThat's how I would play it until any FAQ comes out to contradict it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49105-eleanor-in-setup-phase/?do=findComment&comment=491525","commentId":491525,"userName":"Glaurung","timestamp":1309162010,"content":"pumpkin said:\n\nI'm pretty sure the FAQ is on the way, and that FFG and forum members are putting some serious effort into it to ensure if covers at lot more of the outstanding questions, but obviously this does all take time.\n\n \n\nAs for when revealed, there isn't anything in the rules to suggest those don't trigger during set-up is there, so I would have those trigger during set-up if they occurred, and therefore by association Eleanor should be allowed to respond and cancel a when revealed during set-up.\n\nThat's how I would play it until any FAQ comes out to contradict it.\n\n\n\nYes Pumkins is true, everyone have his own explonation about how i should be played.\n\nAnyway you proffesional player as i feel and good we still have some here.\n\nActually i have first game From FFG and i disppointed with all of this delay and unbalanced game engine(try to play core/leadership deck with Beravor draw which is almost impposible to lose). And this is in solo game. In coop. there is no point to play. You win for sure.\n\nMany of my hopes is crashed already.They not even support game much with some kind of interessting articles on home page.And i see the activity on the forum also go down now.  Maybe many people feel the same????\n\nI was really exiting for beginning New Lotr card game, Cool quest idea......... I propose the game for all of my friends.  \n\nSo i still waiting for the first Adv. pack, for the tournaments rules and than if everything will be same(rules not clean, Delay with product and so on) i give up.\n\nI use to play for years Magic the gathering , Lotr tcg decipher and never see so many problems in the same time.\n\nAll of this really make me feel sad......."}]}