{"url":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/","title":"Best deck so far (Invincible against quest 1 &amp;2)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=491868","commentId":491868,"userName":"DurinIII","timestamp":1309200288,"content":" Mix Leadership/Spirit/Lore. Start with Gloin, Eowyn, and Beravor. Play the cards right and you should win every time. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=491898","commentId":491898,"userName":"vermillian2","timestamp":1309206291,"content":" Deck list? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492006","commentId":492006,"userName":"Iver2","timestamp":1309227272,"content":"DurinIII said:\n\n Mix Leadership/Spirit/Lore. Start with Gloin, Eowyn, and Beravor. Play the cards right and you should win every time. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\n \n\nIt's a three sphere deck so I assume its designed for solo play, right?\n\nStill, i am am not really sure how  a 3-sphere deck works out at all...do you only take low-cost cards into it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492017","commentId":492017,"userName":"lleimmoen","timestamp":1309228566,"content":"This sounds promising. I still think that a 2 sphere is more efficient. Especially that you can have both Éowyn and Dúnhere. Dúnhere works best in Anduin stage 2. With Unexpected Courage he can defeat multiple enemies in one round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492045","commentId":492045,"userName":"jhaelen","timestamp":1309232283,"content":"DurinIII said:\n\nPlay the cards right and you should win every time. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\nLOL! partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]\n\nIf you're winning the second scenario every time, chances are you're playing something wrong. Every report of the 'magic bullet' deck so far has been proven wrong. I'd suggest you post your decklist and some hints about 'how to play the cards right' if you want anyone to take your claim seriously."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492114","commentId":492114,"userName":"Doom1502","timestamp":1309245400,"content":"jhaelen said:\n\nI'd suggest you post your decklist and some hints about 'how to play the cards right' if you want anyone to take your claim seriously.\n\n \n\n*second*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492501","commentId":492501,"userName":"DurinIII","timestamp":1309287765,"content":" Hey all,\n\nI certainly could be playing quest 2 wrong, but I don't think I am. So, the list only utilizes a single core box set, so it is not that hard to \"build.\" Just start with the heroes I mentioned, focus on killing the troll (obviously), use Beravor to draw cards as often as possible. You will most likely draw a sneak attack or Gandalf pretty soon as you draw alot of cards with this deck...the most any deck has ever afforded me actually.  Resource is boosted heavily by Gloin. Beravor provides ample healing for your characters.  Eowyn provides much of the willpower points you need when you start finally questing.  The point of this deck is to only quest when you absolutely can score a huge amount of progress (this is a general rule of course). While you wait and your threat goes up a notch each turn, you are busy clearing the enemies and drawing loads of cards with Beravor, Gleowine (ally), and that most awesome card Lorien's Wealth.  You will get the Gandalf's and Galadhirim's Greetings that you need to lower that early threat accruement.  This deck works wonders for me guys, and I think the key is in the ability to utilize at the least 4 very strong game factors: resource production, card drawing, threat removing, and wound healing cards. Have fun! and please, if anyone spots that I must be playing something wrong, please give me you suggestions and corrections! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492514","commentId":492514,"userName":"SiCK_Boy","timestamp":1309290029,"content":"I personnally tried a 4 sphere deck for a while, playing solo out of 2 Core sets, using Aragorn, Beravor and Thalin. The deck was performing just fine against the first 2 scenario (90 % win against scenario 1, 50 to 70 % win against scenario 2), but the problem with 3 or 4 sphere deck is against the 3rd scenario.\n\n[For reference, I was using mostly low cost cards, the only card costing more than 3 being Gandalf and Faramir I think (and Aragorn was always getting Steward of Gondor)... I was counting a lot on either a Gandalf + Sneak attack or a Feint to beat scenario 2. The spirit cards I played were The Galadrim's Greeting, Unexpected Courage and A Test of Will.]\n\nAgainst scenario 3, you just can't take appropriate mulligan because you never know which hero is going to be imprisoned (and it gets worst when Aragorn is the one made prisoner). In fact, I haven't yet found a solo deck that could beat scenario 3 more than 10 to 15 %. The last I tried was Spirit / Leadership with Aragorn, Eowyn and Dunhere (out of 3 Core sets now) and I couldn't get more than 2 wins in 12 games (and in both of them, Dunhere was prisoner).\n\nI'm not sure how effective it is to play solo wth less than 2 core sets. For example, having that extra Unexpected Courage or Celebrian's Stone really makes a huge difference in how the deck plays (as well as having 3 of each \"staples\", such as Sneak Attack).\n\nBeside seeing the OP's decklist (I also doubt his deck has such a systematic win rate against scenario 2), I'd be curious to hear of people's tentatives to beat all 3 scenario with the same deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492525","commentId":492525,"userName":"DurinIII","timestamp":1309291267,"content":"Against scenario 2 I have not lost with this deck yet. I beat scenario 3 first try with it, but haven't played it again as it is a longer one.  Gloin was the prisoner. I believe if Beravor becomes the prisoner the deck would be crippled horribly. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492529","commentId":492529,"userName":"DurinIII","timestamp":1309292073,"content":" Here is the haphazard, first try, thrown together, amazingly effective, card list for this deck I keep rambling about. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nHeroes: Gloin, Beravor, Eowyn.\n\nGandalf x3\n\nLeadership\n\nSneak attack x2\n\nSnowbourn Scout x3\n\nFaramir x2\n\nBrok Ironfist x1\n\nGuard of the Citadel x3\n\nSeward of Gondor x2\n\nCelebrian's Stone x1\n\nLore\n\nHenamarth Riversong x1\n\nGleowine x2\n\nDaughter of the Nimrodel x1\n\nErebor Hammersmith x2\n\nLore of Imladris x3\n\nForest Snare x2\n\nLorien's Wealth x2\n\nProtector of Lorien x2\n\nBeorn's Hospitality x1\n\nSpirit\n\nWandering Took x2\n\nNorthern Tracker x1\n\nLorien Guide x2\n\nDwarven Tomb x1\n\nWill of the West x2\n\nThe Galadhirim's Greetings x2\n\nHasty Stroke x2\n\nA Test of Will x2\n\nFavor of the Lady x2\n\nUnexpected Courage x1\n\n \n\nEnjoy!!!\n\n \n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492673","commentId":492673,"userName":"Glaurung","timestamp":1309327067,"content":"SiCK_Boy said:\n\nI personnally tried a 4 sphere deck for a while, playing solo out of 2 Core sets, using Aragorn, Beravor and Thalin. The deck was performing just fine against the first 2 scenario (90 % win against scenario 1, 50 to 70 % win against scenario 2), but the problem with 3 or 4 sphere deck is against the 3rd scenario.\n\n[For reference, I was using mostly low cost cards, the only card costing more than 3 being Gandalf and Faramir I think (and Aragorn was always getting Steward of Gondor)... I was counting a lot on either a Gandalf + Sneak attack or a Feint to beat scenario 2. The spirit cards I played were The Galadrim's Greeting, Unexpected Courage and A Test of Will.]\n\nAgainst scenario 3, you just can't take appropriate mulligan because you never know which hero is going to be imprisoned (and it gets worst when Aragorn is the one made prisoner). In fact, I haven't yet found a solo deck that could beat scenario 3 more than 10 to 15 %. The last I tried was Spirit / Leadership with Aragorn, Eowyn and Dunhere (out of 3 Core sets now) and I couldn't get more than 2 wins in 12 games (and in both of them, Dunhere was prisoner).\n\nI'm not sure how effective it is to play solo wth less than 2 core sets. For example, having that extra Unexpected Courage or Celebrian's Stone really makes a huge difference in how the deck plays (as well as having 3 of each \"staples\", such as Sneak Attack).\n\nBeside seeing the OP's decklist (I also doubt his deck has such a systematic win rate against scenario 2), I'd be curious to hear of people's tentatives to beat all 3 scenario with the same deck.\n\n\n\nI dont think the third quest is possible to beat solo. Yes maybe with certine luck you can do this once (easy encounter draw, good starting hand, not important hero prisoned) but normal is no possible.\n\nAbout 1 and 2 quest i have already the decks who win this quest almost 90%. Easy.\n\nBut hunt for gollum is more challenge. Much more.  And more players you have more difficult quest is. I love it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492727","commentId":492727,"userName":"lleimmoen","timestamp":1309336074,"content":"DurinIII said:\n\nAgainst scenario 2 I have not lost with this deck yet. I beat scenario 3 first try with it, but haven't played it again as it is a longer one.  Gloin was the prisoner. I believe if Beravor becomes the prisoner the deck would be crippled horribly. \n\n\n\nCongrats. I think I can claim I can beat Anduin \"almost\" every time but I have only once beaten Dol Guldur, and that came today after I cheated twice a little (it is afterall by birthday)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492760","commentId":492760,"userName":"KlAve","timestamp":1309339528,"content":"DurinIII said:\n\nEowyn provides much of the willpower points you need when you start finally questing.  The point of this deck is to only quest when you absolutely can score a huge amount of progress (this is a general rule of course). While you wait and your threat goes up a notch each turn, you are busy clearing the enemies and drawing loads of cards with Beravor, Gleowine (ally), and that most awesome card Lorien's Wealth.  \n\nIf you aren't questing in the early game, your threat will rise alot from the threat in the staging area. How do you deal with that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492849","commentId":492849,"userName":"player582283","timestamp":1309349814,"content":"Sorry to be cynical, but I would be very surprised if the deck posted wins in scenario 2 half the time let alone 90%+.  Some off the cuff comments (cards not in front of me):\n\nThe Troll is going to be tough to deal with out of the gate and with no questing, there is a good chance it comes down turn 1.  Short of a sneak attack/Gandalf or the Lore cards to ignore threat, how is it dealt with?  Protector of Lorien and discard a bunch of cards, gimping your upcoming turns?  The early threat of the Troll is one of the challenges with this scenario.  How does this deck deal with it 90%+?\n\nEven with Leadership resource generation (Gloin and Steward), I struggle with the number of high priced cards in the 3 sphere deck...Faramir I understand, but Brok and Beorn's feast along with a bunch of 3 resource cost cards?  Even if you get a handful of cards, it looks to me like you would be resource poor most of the time.  What offsets this?\n\nFinally, even with a great deck and a decent draw, my experience is that you can lose 2 regularly with some nasty encounter draws.  There's the card that increases threat out of the gate for each character not on the quest - draw that in the set up and it's hello Troll Turn 1.  How about 2 surges in a row in the set up?  Now there are potentially 5 encounter cards sitting there at the start(Troll+ set up+ surge draw+sure draw+1st quest stage draw)...you're drowning in locations or being overwhelmed with creatures...and likely Hello Troll turn 1.  I won't even mention the number of times that I've got everything under control, a hero defending an attack that bounces as shown and the shadow effect that ignores defense results in a dead and a tough win at best, defeat, bemoaning what could have been more likely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492911","commentId":492911,"userName":"DurinIII","timestamp":1309357326,"content":" well WOZ, why don't you just try the deck out and see? I told you the cards I keep winning consistently with. As for dealing with the threat, consider this...you start with a low cost of 28 threat, which already buys you two turns before you have to deal with combating the troll. The deck has about 7 cards that can assist you with threat reduction.  I have always consistently been able to lower it early on why I wait to go questing.  This is how I have dealt with it. I believe the success comes in with drawing so many cards with Beravor...that's drawing three cards a turn!!! All I can say is I have a 100% win rate with this deck and I have played about 12 games against scenario 2 with it.  You don't have to believe me, but I wouldn't lie about this...try the deck for yourself before you criticize it. lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492926","commentId":492926,"userName":"SiCK_Boy","timestamp":1309358555,"content":"I have to agree with a lot of Woz's comments.\n\nYou absolutely need Gandalf in order to reduce your threat within the first 2 turns (either via Sneak Attack or by hard casting him). The Galadrim's Greetings can't be played before turn 3 (maybe on turn 2 if you put Steward of Gondor on Eowyn.\n\nYou can probably quest enought that you'll manage not to get overwhelmed by the staging area with Eowyn alone (at least on turn 1), but it's hard to believe you get past the Troll systematically, every game. Even if you manage to reduce your threat and buy you some time, you'll need a solid turn to kill the Troll (again, Gandalf is probably your safest bet), unless you manage to trap it and then just wait until most of your army is in play.\n\nI'd be curious to see a few detailed examples of how things went for you. Like, describing your first 3 turns on a couple of games.\n\nI'm not saying it's impossible (although I doubt your deck realisticaly gets more than 50 to 70 % win against scenario 2). Once you're installed (such as having Henamarth Riversong to calculate how much to quest with, having the Troll jammed under a Forest Snare, etc.), yes, you can win. But those crucial first 2 turns can't always be as easy as you make them sound.\n\nBy the way, you do know that you must start with 1 encounter card in play in addition to the Hill Troll (unless you just happen to reveal the Hill Troll as your initial card)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=492932","commentId":492932,"userName":"DurinIII","timestamp":1309359543,"content":" Sick_boy, yes, I am aware that the staging area has an extra encounter card on side A in addition to the revealing of the Hill Troll on side B.  Again, I can only state that I am telling the truth, and at this point, I can say no more. If you are curious at how well it works, try it for yourself as I have already mentioned before. The reason I listed the cards was so that all of this doubt going around could be tested first hand by anyone who wanted to.  If you don't want to try the deck composition then don't. I have nothing more to say really guys...just trying to be helpful and tell you how successful I have been able to solo play with this card list.  Whether or not you guys believe me is your own choice, but it seems silly to pose so many concerning questions against my word when I have provided for you the evidence of my successes. Again, I stress in good charity, try the deck for yourselves and see if it works. The most important thing here is to have fun; I am in no sense a \"power gamer.\" I simply just threw the cards together and found them to be the best combination for consistent wins so far. I share this news not to brag in any sense, but to extend a powerful construct to all of you who are so sick of that darned Hill Troll! lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\nAlso Sick_boy, I only have had one game where the Hill Troll happened to be the first card revealed...I beat the tar out of that game too. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493048","commentId":493048,"userName":"player582283","timestamp":1309370679,"content":"Durin,\n\nSorry if my comments upset you.  I've not played that combination of heroes, but I've played similar 3 sphere combos.  I'll give it a try sometime.  I'm glad you're having fun with the game.  I certainly am. \n\nPlease understand that if you post comments that you can't lose with a deck with very little on the composition and strategy you are going to get some skeptical feedback.  The comments you did make...don't quest early in general, just kill the troll are a little vague and lead to further questions.  If you were questing with a 28 starting threat with 2 spirit heroes, I'd see how you could pretty consistently keep the threat low enough to avoid Troll for a while.  However, with the 3 sphere combo, and not wanting to quest on turn 1, I'd expect you to see the Troll on turn 1 more times that not as you only need 1 additional threat beyond the Troll with the extra set up card and first quest stage card.\n\nIf you don't care to provide further details on your strategy, that is certainly your perogative.  I'll try the deck some time and let you know if I'm having the same results..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493156","commentId":493156,"userName":"SiCK_Boy","timestamp":1309387208,"content":"Durin: I stand humbled. I took you to your word and tried your deck. Besides hoping to prove you wrong, I figured it would be a good opportunity to see how Gloin performs (I only played him in a Dwarf deck before).\n\nI think I had forgotten how good it is to play Beravor (and Lore in general), not having played her in a long time. The other big mistake in my analysis is that I assumed you needed 2 turns to reduce your threat before the Troll got on your back, but you actually have 3 turns since you can use the 3rd turn (when you have enough resource to play The Galadrim's Greetings) to still lower your threat before the combat phase.\n\nI don't think it'll produce 100 % win rate, but I'm willing to concede it's much better than I initialy thought against scenario 2.\n\nFor rerefence, here are the first few turns I played in 3 different games (all against scenario 2 Journey Down the Anduin, using the decklist provided by Durin).\n\nGame 1:\n\nStarting hand is Celebrian's Stone, Snowbourn Scout, Will of the West, A Test of Will, Protector of Lorien and Daughter of Nimrodel. I mulliganed into Faramir, The Galadrim's Greetings x 2, Unexpected Courage, Hasty Stroke and Gleowyn. The staging area started with Bank of the Anduin and Hill Troll.\n\nTurn 1: Draw Erebor Hammersmith. Quest with Eowyn into Eastern Crow and Misty Mountain Goblins. I discarded the Hammersmith to equalize the threat from the staging area. I traveled to the Bank of the Anduin and the Goblins engaged me. I did not defend (shadow card The Necromancer's Reach) and Gloin took 2 damage (gaining 2 resources). I drew with Beravor (Hemanarth Riversong and The Favor of the Lady) and attacked the Goblins with Gloin for 1 damage. Threat goes up to 29.\n\nTurn 2: Draw Wandering Took. Use Beravor to draw (Protector of Lorien, Guard of the Citadel). I played Faramir, Hemanarth Riversong and Protector of Lorien (on Eowyn). I quest with Eowyn into Eastern Crow and Bank of the Anduin (4 vs 4). No travel and no optional engagements. Faramir defends versus the Goblins (shadow card The Necromancer's Reach) and Gloin attacks for another damage. Hemanarth reveals Dol Guldur Orcs coming up. Threat is up to 30.\n\nTurn 3: Draw Sneak Attack. Play The Galadrim's Greetings (threat is down to 24). Quest with Eowyn and Faramir into the Dol Guldur Orcs (Faramir takes 2 damages). No travel and the Orcs engage me. Beravor defends against the Goblins from turn 1 (shadow card Necromancer's Pass) and Gloin defends against the Orcs (shadow card Goblin Sniper), taking 1 damage. Hemanarth reveals Evil Storm and threat goes up to 25.\n\nTurn 4: Draw Will of the West. Play Gleowyn and Guard of the Citadel, draw with Gleowyn (Beorn's Hospitality)... my notes stopped there, but I managed to get rid of the ennemies and took over soon after (I played a few more turns, I basically stopping once I had \"total control\", so technically I could have lost, but I didn't believe it would be possible with half my deck in hand).\n\nGame 2:\n\nStarting hand is a keeper: Snowbourn Scout, Steward of Gondor, The Galadrim's Greetings, Gleowyn, Hemanarth Riversong and Gandalf. The staging area contained Misty Mountain Goblins and Hill Troll\n\nTurn 1: Draw Sneak Attack. Bingo! Play Hemanarth Riversong. Quest with Eowyn into Evil Storm, making 1 progress. The Goblins engage me. I draw with Beravor (Celebrian's Stone and Snowbourn Scout) and I don't defend (shadow card is Eastern Crow). Gloin takes 3 damages. I play Sneak Attack and bring Gandalf, reducing my threat to 23 and killing the Goblins. Hemanarth reveals The East Blight. Threat goes up to 24.\n\nTurn 2: Draw Lorien's Wealth. Play Steward of Gondor on Beravor, use it (I used it every turn afterward). Draw with Beravor: Protector of Lorien, Wandering Took. Play Gleowyn and draw A Test of Will. Play Wandering Took and Celebrian's Stone (on Eowyn). I quest with Eowyn, Gloin and Wandering Took (9 versus 2), travel to the Blight and look at the upcoming card (Wargs). Threat is up to 25.\n\nTurn 3: I draw 4 cards (using Beravor and Gleowyn): Gleowyn, Guard of the Citadel, Hasty Stroke and The Galadrim's Greetings. I play Lorien's Wealth, drawing Gandalf, The Favor of the Lady and Lore of Imladris). I play Protector of Lorien on Eowyn and Snowbourn Scout. Eowyn quests, scoring 3 points. The Scout defends against the Wargs (shadow card Bank of the Anduin) and dies. I look and see another Wargs coming. Threat is up to 26.\n\nTurn 4: Draw Lore of Imladris and Faramir (from Gleowyn). Play Snowbourn Scout and quest with Eowyn, scoring 1 progress and clearing the Blight. The Scout dies defending against Wargs # 1 (shadow card Evil Storm) and I play Lore of Imladris on Gloin before using him to defend against Wargs # 2 (shadow card Enchanted Stream), taking 2 wounds. I use Beravor to draw Lorien's Wealth and The Favor of the Lady. The Necromancer's Reach is the next encounter card and threat is up to 27.\n\nTurn 5: I draw Unexpected Courage and play Gandalf (using 4 resources from Beravor and 1 from Gloin), reducing my threat to 22. Eowyn quests, taking 1 damage and scoring 1 progress. I immediately look at the top card: a Dol Guldur Orcs. I play The Galadrim's Greetings, reducing my threat to 16 and optionaly engaged Wargs # 1. I defend with Gandalf and counterstrike with Gloin and Beravor to kill it.\n\nI used the same trick on the next turn to kill the other Wargs and then sat on my low threat until I was ready to take on the Troll.\n\nGame 3:\n\nStarting hand is Snowbourn Scout, Guard of the Citadel, The Galadrim's Greetings, Dwarven Tomb, Will of the West and Gandalf. I keep, facing Eastern Crow, Dol Guldur Orcs and Hill Troll.\n\nTurn 1: Draw Snowbourn Scout. Quest with Eowyn and Gloin, reveal Evil Storm and score 2 progress. I draw from Beravor (Forest Snare, Protector of Lorien) and don't defend against the Orcs (shadow card Enchanted Stream). Gimli takes 2 damages and threat is up to 29.\n\nTurn 2: I draw Lore of Imladris and play Gandalf (using 4 resources from Gloin and 1 from Eowyn), reducing my threat to 24. Eowyn quests and a second Hill Troll enters the staging area. I score 1 progress. Beravor draws Guard of the Citadel and Lorien's Wealth) and I engaged the Crow. The Crow is undefended (shadow cards Misty Mountain Goblins clears my progress). Gloin takes 1 damage but is then cured by Lore of Imladris. The Orcs are also undefended (shadow card Treacherous Fog) and Gloin takes another 2. I kill the Orcs with Gandalf and the Crows with Gloin. Threat is up to 25.\n\nTurn 3: I draw Sneak Attacks and Beravor adds Unexpected Courage and Guard of the Citadel. I play Protector of Lorien on Eowyn, Unexpected Courage on Beravor and 2 Guard of the Citadel. Beravor ready and Eowyn quests along with a Guard (revealing Driven by Shadows, scoring 1). I draw again (Lore of Imladris and Hasty Stroke) and threat goes up to 26.\n\nTurn 4: I draw 5 cards: Wandering Took, Lorien's Wealth, Lorien Guide, Gleowyn and Snowbourn Scout. Eowyn and Guard of the Citadel quest, revealing Chieftan Ufthak and scoring 1 progress. Threat is up to 27.\n\nTurn 5: I draw again 5 cards: A Test of Will, Forest Snare, Gleowyn, Steward of Gondor and Gandalf.\n\nI stopped at this point.\n\nAll in all, the deck performed great. I had Henamarth in the first 2 games, which helped a lot in planning the quest, but the basic rule is to use only Eowyn. Also, I almost always had Protector of Lorien if extra Willpower was required. As stated above, my main mistake was thinking you had only 2 turns to deal with the Troll when in fact you have 3 (my main deck has 29 starting threat, which may explain why I made that mistake).\n\nPlease feel free to comment on the plays I made. Maybe we can turn this thread into a more strategic discussion rather than keep arguing on the actual win percentage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493187","commentId":493187,"userName":"Glaurung","timestamp":1309394023,"content":"Actually fellows this deck is one of the best deck for now. This deck is true almost impossible to lose. I have play this kind of deck!!!!Never lose.\n\nIf you play coop game with your friends and use same decks the game is walking in the park. Encounter deck can do nothing to you. But as i heard hunt for Gollum change it.  Otherwise is very unbalanced."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493229","commentId":493229,"userName":"avgzxc","timestamp":1309405850,"content":"As I understand this deck is kind of Gloin themed so I'd add 2 icings on a cake:\n\n+1 Dark Knowledge to know exactly when to let an attack go undefended\n\n+1 Self Preservation just to keep 1 enemy engaged and hurt Gloin over and over again.\n\nAlso, I'd change:\n\n+1 Northern Tracker\n\n+ at least 1 Ever Vigilant (Faramir on a river)\n\nProbably, +2 Secret Path vs annoying Brown Lands as well.\n\nI don't really like Lore of Imladris, Lorien's Wealth and Beorn's Hospitality so I'd probably start dropping from here but it depends.\nOther powerful cards that I'd definitely consider: Stand and Fight (Steward on Eowyn = mass Gandalf), Radagast's Cunning (very nice vs Adder)\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493264","commentId":493264,"userName":"SiCK_Boy","timestamp":1309412136,"content":"You're probably better with Daughter of Nimrodel instead of Self Preservation. She can only die to being engaged versus a Necromancer's Reach (just wait after questing to use her) or an Evil Storm (but threat should never go over 35 anyway), and she can chump block if required (and quest as well).\n\nI agree Dark Knowledge could be useful.\n\nLore of Imladris proved useful a few times. It's lower cost (2 versus 3 for most healing spell) is a major strong point and it's a good combination with Gloin (especially in this build with a single Daughter). Lorien's Wealth is never wasted and it can let you dig further for that extra A Test of Will you need to be save.\n\nI'd switch out Beorn's Hospitality as well however. I'm not sure about Stand and Fight. I'm usually a huge fan of the card, but from the few tries I did, it's not needed. Once your good allies are gone, you can simply reshuffle (Will of the West) and draw them anew."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493455","commentId":493455,"userName":"avgzxc","timestamp":1309438689,"content":"True, I forgot the deck doesn't run 3 Daughters, so I should have written +2 Daughter, +1 Self Preservation.\n\n3 resource for 2 heals every turn > 2 resource for 2 heals during only 1 turn, so for me Lore of Imladris is out of the deck\n\nLorien's Wealth is kind of wasted when most good cards are drawn and it's very wasted when it is drawn in the opening hand - it costs 3 resource and I think it's just better to play a lore ally or Gandlaf instead. The sooner enough allies is played, the sooner Beravor and Gleowine can start drawing. So even though Lorien's Wealth obviously draws cards, it also can delay drawing with Beravor and Gleowine by 1 or even more turns. Also, that is exactly why quest pumps (Radagast's Cunning and Secret Paths) are so good - besides obvious effect, they allow Beravor and Gleowine to draw safely much sooner.\n\nAlso, Valiant Sacrifice is much better that Lorien's Wealth - it costs only 1 and even that cost is not much of and issue as Gloin generates a lot of resources anyway.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493572","commentId":493572,"userName":"DurinIII","timestamp":1309454952,"content":" Hey Sick_Boy/all! Glad you are enjoying the deck and are having some success with it! Everything is cool with me, and I agree that \"arguing\" (I prefer \"intellectual conversation\" lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] is not necessary as the deck seems to be well received at the moment! I am just happy that others are having equal success in tearing up the forces of shadow! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]  But yeah, it is an interesting deck for sure...I love it's multiple card combinations. I think what gives this deck such a strong winning chance is it's high level of threat reducing cards (at least in comparison to other deck combinations). Anyone start to think \"wow, there are a ton of cards in my hand!\" when you are playing this deck? I am extremely curious what we could put together with more than one core set, following the same theme. Any one else own more than one set at the moment?  I am intrigued about putting the self preservation on Gloin, as he is constantly needing to produce resources and could use the instant heal each turn.  Well, play on, and defeat the forces of darkness everywhere, at whatever cost!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=493594","commentId":493594,"userName":"DurinIII","timestamp":1309459164,"content":" By the way SiCK_Boy, thank you kindly for the detailed game synopsis'. I enjoy reading about others' quest through Middle-Earth. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=494925","commentId":494925,"userName":"ArachneJericho","timestamp":1309794932,"content":"I played through a game myself with this deck. And even though I'm not the greatest player and did things like forget to include the three Gandalfs (I added them halfway through the game, but still got stinted for another few turns regardless), and played Steward of Gondor on Eowyn instead of Beravor, the deck did well. It seems to be the case that having the three spheres involved condensed into one player leads to a more efficient game, since you don't get the extra staging draws from another player. It's the magic draws from Beravor that make a multi-sphered deck like this work.\n\nFor deck construction with only one core set, three-sphere decks seem to be the way to go, even if they're rather tricky. You will almost always need incredible draw to pull it off, but that's what Lore is for.\n\n(If people are interested in the full, detailed game log, including unheeded prayers for Gandalf, it's on my blog [http://www.spontaneousderivation.com/2011/07/03/lonely-gamer-success-on-anduin/].)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=495024","commentId":495024,"userName":"Glaurung","timestamp":1309822983,"content":"Here is another also very good deck to play. I like this deck more then Beravur/Gloin/Eowyn. This deck play more fast more fun and you still have chance to lose.\n\nTotal Cards (50)\n\nHero (3)\nEowyn (Core) x1\nGimli (Core) x1\nTheodred (Core) x1\n\nAlly (11)\nFaramir (Core) x2\nGandalf (Core) x3\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\n\nAttachment (14)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDwarven Axe (Core) x3\nSteward of Gondor (Core) x3\nUnexpected Courage (Core) x3\n\nEvent (25)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nValiant Sacrifice (Core) x2\nHasty Stroke (Core) x3\n\nStrategy: Gimly is killing machine. With plate, axe and U.courage on him he is unbeaten. He can make 12 damage is enough to kill any enemy in the game for now with one strike. Quick strike kill them even before they can come close.\nTheodred for quest and add resources to heroes.He can died in the end if need it.\nEowyn she is for quest and counter some nasty with hasty stroke and test of will(and reduce threat with galadrimes greatings).\nFaramir for quest and Gandalf depend of situation.Kill, draw, reduce treat.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=495135","commentId":495135,"userName":"deadeb","timestamp":1309850934,"content":"A little off: I need sleep, i read dwarfen womb instead of dwarfen tomb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=495325","commentId":495325,"userName":"avgzxc","timestamp":1309877254,"content":"IMO, best deck:\n\n(8) Theodred\n(9) Eowyn\n(8) Dunhere\n\n3 Wandering Took\n3 Northern Tracker\n3 The Galadhrim's Greeting\n1 Will of the West - used when majority of power events(Sneak Attack, Valiant Sacrifice, Stand and Fight, Dwarven Tomb) are in a discard pile.\n3 A Test of Will - mainly vs fast Pursued by Shadow\n3 Stand and Fight - mainly for Gandalf and Gleowine\n3 Dwarven Tomb\n1 Fortune or Fate - the only form of healing in this deck\n3 Unexpected Courage\n\n3 Guard of the Citadel - can be played turn 1 if needed with Stand and Fight\n2 Faramir - he is needed later anyway, so 3 copies seem too many\n1 Son of Arnor - mainly vs Sniper\n3 Snowbourn Scout\n1 Ever Vigilant - mainly for Gandalf and Faramir\n3 Sneak Attack\n3 Valiant Sacrifice\n3 Steward of Gondor\n2 Celebrian's Stone\n\n3 Gandalf - I often use threat/wound skill too much and forget that sometimes drawing is the best option.\n2 Gleowine - 2 cards and 6 resorces per turn is much better than 1 card and 6 resorces per turn\n1 Henemarth Riversong - can be played turn 1 if needed with Stand and Fight and peeking is extremely useful\n\nDeck is a bit boring but very consistent, wins very easily and very fast.\n\nTurn 1 ally/UC is often very needed vs intial 3 (or even more if surge happens) shadow cards. I use bold to show which cards are a good turn 1 material."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=495430","commentId":495430,"userName":"DurinIII","timestamp":1309890191,"content":" Haha deadeb!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=495781","commentId":495781,"userName":"servant of the secret fire","timestamp":1309956662,"content":"I was right about Eowyn.For scenario 2 is a must and now they all can see this.Wen you start thinking the best deck for scenario 2 you always start your deck with Eowyn and then you  search the rest cards for your deck lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=495905","commentId":495905,"userName":"Dain Ironfoot","timestamp":1309972384,"content":" I have not been able to beat scenario 2 with any standard, mono-sphere deck that comes with the core set; so, I decided to try this deck. My first hand was a disaster (I hadn't shuffled very well, I got all Lore cards). I reshuffled and drew again, and low and behold, I won!!! Ending score of 26!\n\nIt was a little slow going; I had a lot of Spirit cards and few resources on Eowyn (and conversely, lots of resources on Beravor and Gloin, and few cards to spend it on). \n\nOnce Faramir was down, this was a power questing deck and I was able to keep threat down until I chose to engage the Hill Troll. Because I blazed through the Anduin so quickly, I only had 2 enemies to destroy (bats and beastmaster), which I was able to handle easily, with my plethora of allies.\n\nNow, all I have left to conquer (i've not even tried!) is quest 3..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=496113","commentId":496113,"userName":"Doom1502","timestamp":1310007232,"content":"Dain Ironfoot said:\n\nI only had 2 enemies to destroy (bats and beastmaster), which I was able to handle easily, with my plethora of allies.\n\nNow, all I have left to conquer (i've not even tried!) is quest 3...\n\n\n\n \n\nCongrats for beating the scenario :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI assume you mean the Eastern Crows with bats, do you? The bats are only in the passage thorough mirkwood-scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=496114","commentId":496114,"userName":"Dain Ironfoot","timestamp":1310007692,"content":" yeah, musta been crows! i just remember a lot of little black \"dots\" for the artwork and them being reshuffled back into the deck once defeated. \n\nit was so exciting to beat the scenario! i just gotta think a bit about how to beat scenario 3.\n\ni  can beat scenario 1 with leadership relatively consistently now. i've beaten it with tactics once. need to try it again with lore and spirit, just for kicks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=497089","commentId":497089,"userName":"Glaurung","timestamp":1310171389,"content":"Dain Ironfoot said:\n\n yeah, musta been crows! i just remember a lot of little black \"dots\" for the artwork and them being reshuffled back into the deck once defeated. \n\nit was so exciting to beat the scenario! i just gotta think a bit about how to beat scenario 3.\n\ni  can beat scenario 1 with leadership relatively consistently now. i've beaten it with tactics once. need to try it again with lore and spirit, just for kicks.\n\n\n\nIf you wonna beat a third scenario take your friend with you. For solo play is impossible. 2 players is ok . "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=497888","commentId":497888,"userName":"Iver2","timestamp":1310359947,"content":"Glaurung said:\n\nDain Ironfoot said:\n\n \n\n yeah, musta been crows! i just remember a lot of little black \"dots\" for the artwork and them being reshuffled back into the deck once defeated. \n\nit was so exciting to beat the scenario! i just gotta think a bit about how to beat scenario 3.\n\ni  can beat scenario 1 with leadership relatively consistently now. i've beaten it with tactics once. need to try it again with lore and spirit, just for kicks.\n\n \n\n \n\nIf you wonna beat a third scenario take your friend with you. For solo play is impossible. 2 players is ok . \n\n\n\nYep, my wife and I just beat it yesterday on the second try with the following mix (one core):\n\nGimli, Legolas (Prisoner), Breavor\n\nAragorn, Eowen, Dunhere\n\n \n\nWe just survived bascially due to the fact that i managed to reduce the thread for us both dramatically and I managed to use my one of my 2 Gandalf twice, so 3 Gandalf uses all in all. Otherwise, threat would have killed us, but we manged the fighting greatly I have to admit. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nStill, we will defenitely try that again. Guys, play the community created \"Helping friends\" scenario. Sorry, I don't remember the name of the guy who created it. But we lost this one with two players recently. Its really nice, and fullfills its mission to keep its difficulty steady and even become harder towards the end. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=498479","commentId":498479,"userName":"Glaurung","timestamp":1310425580,"content":"Iver said:\n\nGlaurung said:\n\n \n\nDain Ironfoot said:\n\n \n\n yeah, musta been crows! i just remember a lot of little black \"dots\" for the artwork and them being reshuffled back into the deck once defeated. \n\nit was so exciting to beat the scenario! i just gotta think a bit about how to beat scenario 3.\n\ni  can beat scenario 1 with leadership relatively consistently now. i've beaten it with tactics once. need to try it again with lore and spirit, just for kicks.\n\n \n\n \n\nIf you wonna beat a third scenario take your friend with you. For solo play is impossible. 2 players is ok . \n\n \n\n \n\nYep, my wife and I just beat it yesterday on the second try with the following mix (one core):\n\nGimli, Legolas (Prisoner), Breavor\n\nAragorn, Eowen, Dunhere\n\n \n\nWe just survived bascially due to the fact that i managed to reduce the thread for us both dramatically and I managed to use my one of my 2 Gandalf twice, so 3 Gandalf uses all in all. Otherwise, threat would have killed us, but we manged the fighting greatly I have to admit. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nStill, we will defenitely try that again. Guys, play the community created \"Helping friends\" scenario. Sorry, I don't remember the name of the guy who created it. But we lost this one with two players recently. Its really nice, and fullfills its mission to keep its difficulty steady and even become harder towards the end. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n\n\nYes i use to play this scenario. For one player is ok. But for 2 players like always too easy.\n\nThe most interesting and difficult still Dol-Guldur.\n\nAll NinjaDorg scenarios is also to easy.  I try all of them long time ago already (except the last one With HFG cards).And dont want to play again there no challenge at all.\n\nSo for now there is no any fan made scenario which one is really done properly . Still helping friends is the best from them on my choice.\n\nHave another scenario done by one german guy. Call Chasing the orc. Very interesting idea with some new cards added. Very interesting game play.\n\nBut still too easy again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=498707","commentId":498707,"userName":"hawkeyespf","timestamp":1310467540,"content":"DurinIII said:\n\n Hey all,\n\nI certainly could be playing quest 2 wrong, but I don't think I am. So, the list only utilizes a single core box set, so it is not that hard to \"build.\" Just start with the heroes I mentioned, focus on killing the troll (obviously), use Beravor to draw cards as often as possible. You will most likely draw a sneak attack or Gandalf pretty soon as you draw alot of cards with this deck...the most any deck has ever afforded me actually.  Resource is boosted heavily by Gloin. Beravor provides ample healing for your characters.  Eowyn provides much of the willpower points you need when you start finally questing.  The point of this deck is to only quest when you absolutely can score a huge amount of progress (this is a general rule of course). While you wait and your threat goes up a notch each turn, you are busy clearing the enemies and drawing loads of cards with Beravor, Gleowine (ally), and that most awesome card Lorien's Wealth.  You will get the Gandalf's and Galadhirim's Greetings that you need to lower that early threat accruement.  This deck works wonders for me guys, and I think the key is in the ability to utilize at the least 4 very strong game factors: resource production, card drawing, threat removing, and wound healing cards. Have fun! and please, if anyone spots that I must be playing something wrong, please give me you suggestions and corrections! \n\n\n\n \n\nI really don't understand what you mean by \"Eowyn provides much of the willpower points you need when you start finally questing\" and \"The point of this deck is to only quest when you absolutely can score a huge amount of progress.\" When you start questing? Only quest when... As in, you don't quest every turn? How do you handle the increase in your threat level when you have ZERO willpower to compare to the total threat in the staging area? Are you sure you're playing by the same rules the rest of us are?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=498838","commentId":498838,"userName":"SiCK_Boy","timestamp":1310486420,"content":"You quest every turn. But you don't \"overquest\". For example, if there's 4 points of threat in the staging area, you can assume revealing 1 additional card will add 2 or 3 points, so you try to quest with 6 or 7 points of willpower's worth of character.\n\nA good tool to manage when / how to quest is with Hemanarth Riversong. He lets you peak at the top card, so you use him before the end of the turn and you can then plan exactly what needs to be done on the next turn. That way, you can keep characters with special abilities ready and use them for other purposes than questing. Denethor can fullfil a similar function (as well as getting rid of a nasty card, but then you face the \"unknown\", which is often worse than the worst cards (personnally, for example, I never, ever quest with characters that have only 1 life if I may meet a Necromancer's Reach. But if I peek and see the Reach coming, I'll leave it there and play around it, even if it means taking 1 or 2 points of threat increase, rather than swap it and then face the unknown, which could just as well be another Necromancer's Reach)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=498857","commentId":498857,"userName":"hawkeyespf","timestamp":1310487205,"content":"I understand the intricacies of questing and overquesting and when it is appropriate to quest everyone and when you need to tone things down a bit, but DurinIII makes it sound in his post that I quoted above that he doesn't quest at all some turns, in particular against the Anduin scenario as he's talking about in that post, as if his threat will only go up at the end of each turn, by one, and he can just save up a few turns worth of resources before he plays anything, quests, and has to turn over any additional encounter cards.\n\n \n\ntldr; I know how to play, I'm not sure DurinIII does. (NOT meant as an attack, just summarizing)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=499665","commentId":499665,"userName":"Saramund","timestamp":1310642262,"content":"  I have played 4 times this deck and never lost:\n\nSolo Spirit/Tactics\n\n\nSolo Spirit/Tactics\n\nHero (3)\nEowyn (Core) x1\nThalin (Core) x1\nDunhere (Core) x1\n\n\nAlly (15)\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\nGondorian Spearman (Core) x3\nWandering Took (Core) x3\nGandalf (Core) x3\n\n\nAttachment (12)\nUnexpected Courage (Core) x3\nDwarven Axe (Core) x3\nBlade of Gondolin (Core) x3\nThe Favor of the Lady (Core) x3\n\n\nEvent (27)\nThe Galadhrim's Greeting (Core) x3\nHasty Stroke (Core) x3\nStand and Fight (Core) x3\nSwift Strike (Core) x3\nQuick Strike (Core) x3\nFeint (Core) x3\nBlade Mastery (Core) x3\nStand Together (Core) x3\nStrength of Will (Core) x3\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49145-best-deck-so-far-invincible-against-quest-1-2/?do=findComment&comment=499702","commentId":499702,"userName":"EGG2","timestamp":1310646747,"content":"Saramund said:\n\n  I have played 4 times this deck and never lost:\n\nSolo Spirit/Tactics\n\n\nSolo Spirit/Tactics\n\nHero (3)\nEowyn (Core) x1\nThalin (Core) x1\nDunhere (Core) x1\n\n\nAlly (15)\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\nGondorian Spearman (Core) x3\nWandering Took (Core) x3\nGandalf (Core) x3\n\n\nAttachment (12)\nUnexpected Courage (Core) x3\nDwarven Axe (Core) x3\nBlade of Gondolin (Core) x3\nThe Favor of the Lady (Core) x3\n\n\nEvent (27)\nThe Galadhrim's Greeting (Core) x3\nHasty Stroke (Core) x3\nStand and Fight (Core) x3\nSwift Strike (Core) x3\nQuick Strike (Core) x3\nFeint (Core) x3\nBlade Mastery (Core) x3\nStand Together (Core) x3\nStrength of Will (Core) x3\n\n \n\n \n\n\n\nI have a very similar deck that I posted on another site:\n\nVoltron Dunhere [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/voltron-dunhere-r56]\n\nthe only difference being you have some defensive cards where I tried to use Gleowine and Faramir.\n\nI have my best solo scores with this deck but still have no chance on Dol Guldur llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif]"}]}