{"url":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/","title":"FAQ on FAQ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493248","commentId":493248,"userName":"Ileopsoas","timestamp":1309409399,"content":"\"(1.11) Limitations on Attacks\nWhen a player is the active attacker during the combat\nphase, the game rules grant him the option to declare\n1 attack against each enemy with which he is engaged.\nIf, through card effects such as ranged, a player is able\nto declare attacks against enemies with which he is\nnot engaged, he is still only permitted a single attack\nagainst each of these enemies.\nCharacters are not limited as to how many times they\ncan participate in attacks against the same enemy,\nprovided each attack can be legally declared, and the\ncharacter is ready and eligible to be declared as an\nattacker.\"\n\nI dont understand this...Charachters can attack twice or more but just the same enemy?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493303","commentId":493303,"userName":"Ratatoskr","timestamp":1309419334,"content":"You might have overlooked that the FAQ entry you quoted differentiates between \"player\" and \"character\". That distinction is key here. You, the player, can declare one attack against each eligible enemy each combat phase. Each of your characters can participate in any number of these attacks, provided you find a way to ready them between attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493324","commentId":493324,"userName":"pumpkin","timestamp":1309422970,"content":"So I think what it is saying is that as part of the normal combat phase, each player can only declare a single attack against an eligible enemy (either those with which they are engaged or those engaged with other players if ranged keyword is being used) BUT if you are able to legally perform an attack through some other means, such as the quickstrike card, then that attack is possible and is outside of and has no effect on that players ability to declare a single attack against a single enemy as part of the combat phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493359","commentId":493359,"userName":"Doom1502","timestamp":1309426860,"content":"May I attack the same enemy in the staging area twice/multiple times with dunhere? (Without quick strike)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493384","commentId":493384,"userName":"Kiwina","timestamp":1309429276,"content":"Doom1502 said:\n\n \n\nMay I attack the same enemy in the staging area twice/multiple times with dunhere? (Without quick strike)\n\n \n\n \n\nI don't think so.  The FAQ states you can only declare a single attack against an enemy you're not engaged with.  I believe FFG worded it that way on purpose, so they wouldn't have to add another paragraph just for Dunhere.\n\n\"(1.11) Limitations on Attacks\nWhen a player is the active attacker during the combat\nphase, the game rules grant him the option to declare\n1 attack against each enemy with which he is engaged.\nIf, through card effects such as ranged, a player is able\nto declare attacks against enemies with which he is\nnot engaged, he is still only permitted a single attack\nagainst each of these enemies.\"\n\n(emphasis added)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493419","commentId":493419,"userName":"Doom1502","timestamp":1309433302,"content":"Thanks, must have missed that part."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493761","commentId":493761,"userName":"Ileopsoas","timestamp":1309488432,"content":"So I not even can declare an attack with Legolas and then with rohan acher in the same enemy engaged with a ffriend?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493900","commentId":493900,"userName":"reno1051","timestamp":1309511757,"content":"i think you can becuase you are allowed to have as many characters attacknig an enemy as you want.  i think the problem comes when you go to attack the next enemy, you cant use the characters you used for the first one because they are already exhausted.  so if you use legolas and another archer to help a friend defeat an enemy, you cant use them again that turn to help him fight another enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49277-faq-on-faq/?do=findComment&comment=493936","commentId":493936,"userName":"pumpkin","timestamp":1309517366,"content":" \n\nBasically, I think it is best explained like this.\n\n \n\nWhen you are the active player, you can only declare a single attack against each enemy you can legally attack. you can use any characters that can legally attack that enemy, and characters from any other player can join that attack if they are legally able to do so.\n\nWhen another player is the active player, any of your characters can join that attack if they are legally able to do so (not exhausted and with the range keyword probably) irrespective of whether you have already attacked that enemy with those same characters, when you were the active player, during this round.\n\nAny cards that provide addtional attack opportunities, such as Quick Strike, are in addition to the above and do not count against the single attack against each enemy rule."}]}