{"url":"https://community.fantasyflightgames.com/topic/49309-conflict-at-carrock-scheduled-for-late-july-release/","title":"Conflict at Carrock scheduled for late July release!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49309-conflict-at-carrock-scheduled-for-late-july-release/?do=findComment&comment=493565","commentId":493565,"userName":"pwvogt","timestamp":1309453888,"content":" Finally some good news regarding the release schedule front! Found over at Tabletop Gaming News, FFG has announced that Conflict at Carrock (the second adventure pack to be released) is slated for late July. I'm quite excited that FFG is doing their best to get back on track for their release schedule since the long, long Hunt for Gollum delay. Here's the link [http://www.tabletopgamingnews.com/2011/06/29/48102/] although it doesn't have anything more than what I just said."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49309-conflict-at-carrock-scheduled-for-late-july-release/?do=findComment&comment=493575","commentId":493575,"userName":"DurinIII","timestamp":1309455208,"content":" Good work friend! Thanks for the heads up! That is great news indeed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49309-conflict-at-carrock-scheduled-for-late-july-release/?do=findComment&comment=493644","commentId":493644,"userName":"DrNate","timestamp":1309464869,"content":" I want to believe this, but it's still listed at the printers. Even if it was put on the boat tomorrow, would that even be enough time for it to get here by the end of July? \n\nAnyway, shouldn't FFG be announcing a date for Hunt For Gollum instead? I'd personally rather know when that one will be in stores. \n\nI have my doubts, but I will be extremely happy to be proven wrong here. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49309-conflict-at-carrock-scheduled-for-late-july-release/?do=findComment&comment=493717","commentId":493717,"userName":"guciomir","timestamp":1309481036,"content":"Gollum is oficially announced at second half of July (as per polish publisher this is when worldwide release happens). I find it not likely that Carrock would follow up so soon. (but I really hope for it)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49309-conflict-at-carrock-scheduled-for-late-july-release/?do=findComment&comment=493736","commentId":493736,"userName":"miketheturtle","timestamp":1309484646,"content":" potomacdist.com had Hunt as a June 30th release and Conflict as a July 30th... and each set after on the 30th or 31st of the next month(s) in order... now it lists Hunt and Conflict as July 30th, I suspect that conflict will soon be moved to August, and each other bumped a month.\n\n \n\nit's sort of like the video game industry, if all else fails they list it on the last day of the month of the projected quarter it is to be released... sometimes it's better to take the ID Games approach \"Release date: when it's done\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/49309-conflict-at-carrock-scheduled-for-late-july-release/?do=findComment&comment=494503","commentId":494503,"userName":"Klaen","timestamp":1309674563,"content":"Thanks for the link. Definately dissapointing there has been a delay in distribution of Gollum. Let's hope it's related to them having needed to increase the volume of the first print run due to overwhelming popularity of the game (sales = Dev $$$ = More staff = increase chance of being on schedule).\n\nOh well, off to paint some ME Quest Minatures (another awesome LOTR product from FFG)!\n\n \n\n "}]}