{"url":"https://community.fantasyflightgames.com/topic/49315-stupid-questions-from-a-beginner/","title":"Stupid questions from a beginner","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49315-stupid-questions-from-a-beginner/?do=findComment&comment=493595","commentId":493595,"userName":"WombatDeath","timestamp":1309459229,"content":"Hi,\n\nI'm trying my first game alone to get a handle on the rules before I play it with my wife.  I've immediately run into a situation which has got me questioning my grasp of the rules (and my reading comprehension) and would be grateful if you could help me get things straight.\n\n1)  I'm playing the first scenario (Mirkwood) with the Tactics set, so I have a combined Willpower of 4.  As of round 2, the staging area has a combined threat of 4 (two locations each with a threat level of 2, not including the active location plus one engaged monster).  Does this mean that I am already effectively doomed to failure, and increasingly doomed as I draw a new encounter card with each turn and potentially add more threat to the staging area? \n\n2) If I have understood correctly, a character who commits to a quest will be exhausted at the start of the next combat phase.  Am I therefore right to assume that uncommitted characters still participate in the subsequent travel and combat phases, even though they haven't committed to the quest?  (Having typed that out it seems to be a pretty stupid question...I suppose it must be 'yes', implying a trade-off between supplying sufficient willpower to make progress in the active quest / location, and having enough ready characters to avoid undefended attacks).\n\n3) The first location card (Old Forest Road) states that \"After you travel to Old Forest Road, the first player may choose and ready 1 character\".  Does that mean that I can ready one character on every round that I spend here, or just the first time (since I'm already there once it becomes my active location)?\n\nSorry for inflicting my ignorance upon you; this sort of game is new to me and I would appreciate any guidance that you can offer.  Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49315-stupid-questions-from-a-beginner/?do=findComment&comment=493604","commentId":493604,"userName":"DurinIII","timestamp":1309460283,"content":" \"No such thing as a stupid question!\" lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] Well, you seemed to have already answered you first two questions my friend.  You are correct, once a hero commits to a quest, he can do nothing further that game round unless you have a card from hand or an ability to trigger from a card already in play that would allow the exhausted character to refresh. \n\nAs far as the last question is concerned, when you \"travel\" to a location, you only travel to it initially when you place it in the location area next to the current quest card.  So, when you first \"travel\" to Old Forest Road and place it in the appropriate area, you then may refresh one of your characters.  Any subsequent turns in that location are referred to (I believe I am remembering this correctly) with the keyword \"exploring.\"  In other words, you first \"travel\" to a location, and then subsequently \"explore\" it until it is fully \"explored.\" So, you wouldn't be able to refresh a character every turn you are engaged with this location as you are no longer \"traveling\" after the first time you engaged the location, rather you are \"exploring.\"\n\nGlad you are trying out the game; it is tons of fun! Hope this helps you...and I hope I am correct in the information I am telling you; if I am not, I apologize in advance.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49315-stupid-questions-from-a-beginner/?do=findComment&comment=493799","commentId":493799,"userName":"felix16","timestamp":1309496423,"content":"And you are not effectively doomed, since you might get allies  that can quest with you, but unfortunately you have discovered the great weakness of the tactics deck, the questing. The very important thing that makes the tactics base deck problematic to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49315-stupid-questions-from-a-beginner/?do=findComment&comment=493920","commentId":493920,"userName":"WombatDeath","timestamp":1309514890,"content":"Thank you both, that's very helpful!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49315-stupid-questions-from-a-beginner/?do=findComment&comment=493968","commentId":493968,"userName":"crichtonfarscape","timestamp":1309520840,"content":"Remember if there is no active location and all your characters are exhausted from questing you can then travel to an active location with all of those characters- you don't need someone refreshed to travel and all your characters are \"together.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/49315-stupid-questions-from-a-beginner/?do=findComment&comment=494400","commentId":494400,"userName":"gatharion","timestamp":1309630240,"content":" I find it kinda difficult to play any of the scenarios solo with one of the starter decks; Tactics in particular. Tactics is GREAT for killing monsters, but has a hard time handling questing and killing all on it's own. When I tried it, I was pretty much entirely dependent on Legolas' special ability to get any progress on the quest. It's a very nice compliment to Spirit or Lore though. My first game was two-player, I used Spirit and my brother used Tactics and we beat the Mirkwood scenario so easily that I was worried we had played the game wrong.\n\nLeadership doesn't have any high willpower Heroes either, but at least you can commit Aragorn to the quest and still use him for combat; so you might want to give that one a try."}]}