{"url":"https://community.fantasyflightgames.com/topic/49445-forest-snare-progress-tokens-and-gandalf-sneak-attack/","title":"Forest Snare, progress tokens, and Gandalf Sneak Attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49445-forest-snare-progress-tokens-and-gandalf-sneak-attack/?do=findComment&comment=494897","commentId":494897,"userName":"Zarrack","timestamp":1309789931,"content":" All the rules and the extensive faq still makes me wonder if I am playing the game correctly.\n\nAm I playing the Forest Snare (attachment) correctly? The card states that: \"Attach to an enemy engaged with a player.\" Thus I cannot play the Forest Snare on an enemy in the staging area. Neither can I play the Forest Snare directly after an enemy engages me since I can only play attachments in the planning phase. For example, a Hill Troll gets to attack me at least once before I catch it with the snare.\n\nIs it possible to have more progress tokens on a quest card than the stated quest points, if the quest card has another yet unfulfilled advance requirement? For example, the quest card \"To the River\" from \"Journey along the Anduin\" has two requirements: 8 quest points and \"Players cannot defeat this stage while any Hill Troll are in play.\" Can I stack more than 8 quest point on that quest card if there are any Hill Troll in play?\n\nLets say I have two Sneak Attack cards and Gandalf in hand. Is it correct to play the Sneak Attack card in the Planning phase and the other directly afterwards in the Quest phase for a total of two leadership resources to summon Gandalf (and his response) two times in a round and to have Gandalf commit to a quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49445-forest-snare-progress-tokens-and-gandalf-sneak-attack/?do=findComment&comment=494917","commentId":494917,"userName":"lleimmoen","timestamp":1309793452,"content":"Yes.\n\nYes.\n\nYes.\n\nYou're doing all of that just fine. Son of Arnor is a great help for Forest Snare. More progress tokens can be useful in case of Despair or Misty Mountain Goblins. Sneak Gandalf twice a round is possible and wicked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49445-forest-snare-progress-tokens-and-gandalf-sneak-attack/?do=findComment&comment=494956","commentId":494956,"userName":"Mestrahd","timestamp":1309803257,"content":"If you're going to Sneak Gandalf twice in a round, you're far better off doing it during quest and combat. Planning phase doesn't take advantage of any of his stats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49445-forest-snare-progress-tokens-and-gandalf-sneak-attack/?do=findComment&comment=494971","commentId":494971,"userName":"Jimson","timestamp":1309809013,"content":" It can be helpful if you have a ton of resource and very few cards in your hands.  Drawing three cards is sometimes handy.  happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49445-forest-snare-progress-tokens-and-gandalf-sneak-attack/?do=findComment&comment=497514","commentId":497514,"userName":"lleimmoen","timestamp":1310286840,"content":"Jimson said:\n\n It can be helpful if you have a ton of resource and very few cards in your hands.  Drawing three cards is sometimes handy.  happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\nGood point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49445-forest-snare-progress-tokens-and-gandalf-sneak-attack/?do=findComment&comment=497526","commentId":497526,"userName":"Shelfwear","timestamp":1310289740,"content":"Yes indeed, Gandalf is usually played because of the direct direct damage or the threat reduction but you can also quest with him or defend/attack on top of that if played in the proper phase.\n\nConcerning Troll and Forest Snare: yes, you have to defend one Troll attack (or use cards that prevent him from attacking like Feint etc) before being able to slap Forest Snare on him"}]}