{"url":"https://community.fantasyflightgames.com/topic/49669-what-are-we-doing-wrong/","title":"What are we doing wrong?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49669-what-are-we-doing-wrong/?do=findComment&comment=496793","commentId":496793,"userName":"RepairmanJacked","timestamp":1310123158,"content":"My wife and I just played our first game last night, and we got slaughtered.  We didn't even get one progress token placed on card 1b of the first quest.  It seemed we just didn't have enough heroes and allies to both make progress on the quest and defend and attack.  Is there something we should be doing that we're not?  We were also confused by engagement and combat.  So we have to exhaust a character to defend and a different one to attack?  That's what we were doing.  It was confusing to us that an exhausted hero can't defend, but an enemy that already attacked can defend itself.  We found our threat level going up at the end of every quest phase, and since we were committing multiple characters to questing, we didn't have enough to both defend AND attack, which left us either being undefended and taking wound tokens, or defending but leaving the enemies there for the next round (to hit us with even bigger threat level damage). \n\nWhat can we do differently?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49669-what-are-we-doing-wrong/?do=findComment&comment=496808","commentId":496808,"userName":"Kiwina","timestamp":1310124644,"content":"RepairmanJacked said:\n\nMy wife and I just played our first game last night, and we got slaughtered.  We didn't even get one progress token placed on card 1b of the first quest.  It seemed we just didn't have enough heroes and allies to both make progress on the quest and defend and attack.  Is there something we should be doing that we're not?  We were also confused by engagement and combat.  So we have to exhaust a character to defend and a different one to attack?  That's what we were doing.  It was confusing to us that an exhausted hero can't defend, but an enemy that already attacked can defend itself.  We found our threat level going up at the end of every quest phase, and since we were committing multiple characters to questing, we didn't have enough to both defend AND attack, which left us either being undefended and taking wound tokens, or defending but leaving the enemies there for the next round (to hit us with even bigger threat level damage). \n\nWhat can we do differently?\n\n\n\nI lost the first few times I played as well.  You did the attacking and defending correctly, but it sounds like you included engaged enemies' threat strength when questing.  You only include the threat strength of enemies in the staging area when questing.  Engaged enemies aren't in the staging area, and they don't disengage unless a card says otherwise.  That should make questing more doable.  Outside of that, just keep trying different things.  You'll find something that works for you soon enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49669-what-are-we-doing-wrong/?do=findComment&comment=496818","commentId":496818,"userName":"Iver2","timestamp":1310125862,"content":"one simple answer from my side: use allies ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThey are really like an extension to your \"party\" and they are most of the time absolutely crucial. I would always take a Mulligan if I did not get at lest 1 -2 allies in my first hand draw. Also, put allies into play asap.\n\nWhat kind of decks did you play? Starter decks with one sphere? Which heroes? Any more details? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nAnd yes, and enemy will always attack but not be exhausted afterwards.\n\nAlso, try to make use of your hand cards and don't forget you can play event cards with action or response keywords in between the different game phases and steps as opposed to allies and attachments!\n\n \n\nAlso, go through the rule book one or two more times just to make sure you got the rules 100% right. Not to speak about the updated 1.1 FAQ ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49669-what-are-we-doing-wrong/?do=findComment&comment=496926","commentId":496926,"userName":"Mestrahd","timestamp":1310138849,"content":"It definitely sounds like you should take Kiwina's advice. Engaged enemies do not contribute threat. Nor does an active location. You probably shouldn't quest with EVERYBODY specifically for that reason of having no defenders/attackers. In a 2 person game, if each person contributes an average of 2-3 you should be ok. save the bigger butts for defense and find ways of readying or saving the higher attackers.\n\nAlso, due to cards like Necromancer's Reach and Dol Goldur Orcs, you should be careful with your fragile allies committing to the quest. For example if you have a Daughter of the Nimrodel, questing with her could be fatal due to either of those cards. But if you don't quest with her and use her ability AFTER the staging phase, you're safe from all encounter threats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49669-what-are-we-doing-wrong/?do=findComment&comment=497078","commentId":497078,"userName":"RepairmanJacked","timestamp":1310168198,"content":"Ahhh, ok.  That seems like it will be an immense help.  We were unengaging the enemies and counting their threat level each round.  Hopefully that will make a big difference the next time we play.  I really appreciate the answers!\n\n \n\nOne more quick question:  Is the first quest only 3 quest cards long?  I ask because I have 2 copies of card 3a/3b, and was wondering if perhaps instead I should have a 4a/4b."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49669-what-are-we-doing-wrong/?do=findComment&comment=497090","commentId":497090,"userName":"Apophenia","timestamp":1310171465,"content":"RepairmanJacked said:\n\nOne more quick question:  Is the first quest only 3 quest cards long?  I ask because I have 2 copies of card 3a/3b, and was wondering if perhaps instead I should have a 4a/4b.\n\n\n\nRead quest stage 2, it will answer your question for you."}]}