{"url":"https://community.fantasyflightgames.com/topic/49711-what-extras-do-you-need-to-play-4-players-with-one-box-set/","title":"what extras do you need to play 4 players with one box set?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49711-what-extras-do-you-need-to-play-4-players-with-one-box-set/?do=findComment&comment=497137","commentId":497137,"userName":"TylerTT","timestamp":1310187897,"content":" question is in the topic. \n\nit looks like the game comes with four introductory decks? so then is the two player limit because of the threat counters? tokens? i have plenty of those."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49711-what-extras-do-you-need-to-play-4-players-with-one-box-set/?do=findComment&comment=497139","commentId":497139,"userName":"Glaurung","timestamp":1310188307,"content":"Looks like nothing only more gandalf  threat tracker and tokens.\n\nBefore i thought maybe 1 encounter deck per 2 players but look like no."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49711-what-extras-do-you-need-to-play-4-players-with-one-box-set/?do=findComment&comment=497149","commentId":497149,"userName":"Shelfwear","timestamp":1310189837,"content":"Technically you can play with 4 people, you just need need extra dice/counter and/or pen/paper to keep track of the threat for player 3-4, and to replace the damage and resource counters as they wont be enough for all players.\n\nOn the other side it will be a rather \"simple\" gaming experience, just take all the cards of one sphere and give them to a player (so no deck building involved). There could be a problem with the Gandalf card (included 4 times in the core set) - this is one of the best cards in the game, usable by any sphere and acts as a \"joker\" in nearly all situations. Every deck should have 3 of them. With only 1 for each deck, you'll playing without safety net and will be much more prone to an unlucky encounter/monster card draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49711-what-extras-do-you-need-to-play-4-players-with-one-box-set/?do=findComment&comment=497158","commentId":497158,"userName":"TylerTT","timestamp":1310192023,"content":"thanks guys\n\ni hear the game is easier to beat with more players so perhaps less gandalf is a good thing? i have plenty of extra health trackers and tokens, so i think i can make one set work as a 3-4 player game. \n\nplus i love my metal abacus style trackers anyway\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49711-what-extras-do-you-need-to-play-4-players-with-one-box-set/?do=findComment&comment=497160","commentId":497160,"userName":"Rashley","timestamp":1310193360,"content":"I have played 4 player games with only 1 core set, and the tokens rarely run out.  Keeping track of threat is easy.  As all scenarios get slightly easier with more players - the increased Encounters stop them being too easy - 1 Gandalf per player is no worry.  He can still appear at least 4 times and many cards increase the chances of finding/using him.  My reason for keeping to 1 set is the 'waste' of many cards.  Heroes are unique, and so extra ones are redundant, and I don't believe the Encounter decks were made to be doubled or more.  People seem to be complaining that the game is getting too easy with the ability to build 'killer decks', so I suppose you could add more of the nastier Encounter cards to balence things again.  You should have as much fun in just losing a game as just winning one.  It is the 'too easy' or 'nearly impossible' games that pall.  I will stick to one of each set, but have to admit, I am looking forward to the expansions.  My local games shop - Leisure Games Finchley - let me borrow their advanced copy of 'The Hunt for Gollum' until the horribly overdue proper sets arrive.  It allows a bit more variety and gives tasters of what will be added, like a 'Song' card for each sphere.  Cheers!"}]}