{"url":"https://community.fantasyflightgames.com/topic/49717-i-give-up/","title":"I give up !","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497193","commentId":497193,"userName":"TrooperShark99","timestamp":1310203691,"content":"This game was my first exeprience with FFG, I like the game, I think it has potential, but sadly I think I am done with it.  The LCG concept is interesting, but only if the company backing it up has it's act together, the lack of news and updates, the simple fact that weeks after pre-release events we don't even have a release date for the FIRST expension pack, leads me to believe these guys are not in control.  This is pathetically bad, a one man show in his garage should be able to at least post a release schedule for something like this, where the release of expensions is key to the entire concept of the offering.\n\nI think the game has enough potential to gather a sizable enough player base to be interesting, but the company supporting it does not appear to be ready and able to support something like this well enough for the player base to stick around, I see this becoming a niche game at best, I was hoping for something more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497200","commentId":497200,"userName":"Mestrahd","timestamp":1310204239,"content":"FFG has been making LCGs for at least 4 years now, so they may have some sort of plan. I have a feeling once the first AP comes out, you'll see the next 5 come out within weeks of each other, since they're all printed now. At least that's my hope. I've been keeping occupied with other FFG games in the meantime."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497244","commentId":497244,"userName":"servant of the secret fire","timestamp":1310209515,"content":" I have a different question after i saw the sold out article.Is this game realy so popular or they just sold out the box in the stores cause this is a LOTR title but people after they play tested it don't have any interest in this game?I am asking this cause LOTR tcg was very popular in my country(Greece) but this one is not even popular in our fantasy shops.So few people have it and most of them don't have any interest after they have played it.\n\nAny guys from rest of the world can answer how popular this game is in their country?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497252","commentId":497252,"userName":"Bohemond2","timestamp":1310210582,"content":"Um, we have a release date.  It was put on the boat June 2nd.  it takes 5-7 weeks from that time to hit the shelves.  That's the date.  We have known it for over a month. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497257","commentId":497257,"userName":"ArachneJericho","timestamp":1310212317,"content":"Sometimes games are unlucky when their boats are unexpectedly delayed by floods in another country. And no amount of ragequitting will fix that.\n\nFor myself, I just shelved the game for a few weeks, because it's not the only game out there (heck, it's not the only LCG out there), although it is the only LCG that can be played solo. (I keep wondering about solo rules for Call of Cthulhu though, now that I've experienced LotR:TCG). When I pulled it out again, I was happy with it again. Sometimes you just need to let games lie fallow.\n\nThe game's also new enough that it doesn't have the sheer card count that other LCGs have; once it reaches this point (i.e., once shipping troubles have passed), it'll be interesting for far longer periods of time.\n\nBut yeah... my advice is, you probably shouldn't waste the investment you made in the game, and rest it if possible.\n\nAlternatively, Middle Earth: CCG is out there in old decks and has solo rules and scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497291","commentId":497291,"userName":"Glaurung","timestamp":1310217235,"content":"Yes middle earth is cool game. I also wont t buy couple of middle earth decks.I use to play this game 10 years before. Very cool game.\n\nFor many reason i have the same feelings. They make new game and this is LORD OF THE RING!!!! This title so popular!!! they must really take care this game ans support it 200% careful. Yes they make a lot of mistake with a rules all this delay. Now is judgment time. They will fix it and everything going better or they game start slowly die. I sow 2 times already. With middle earth ccg and lotr tcg decipher.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497300","commentId":497300,"userName":"Shelfwear","timestamp":1310218657,"content":"servant of the secret fire said:\n\nAny guys from rest of the world can answer how popular this game is in their country?\n\n\n\nI think its a bit too early to say but in Germany the reception was mixed. It got less fanzine coverage than a boardgame and the couple of reviews were rather \"a good game\" than \"you must buy it\". It was clearly communicated that it appeals to fans of Collectible Card Games and Middle Earth Fans and less to the casual gamer. My feeling is that it was shelved to \"a solid and interesting game but for fantasy/tactic-nerds\". I know a couple of Middle-Earth fanatics myself who told me that they just cant relate to this type of card games. They stick to board and role-playing games instead.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497328","commentId":497328,"userName":"ArachneJericho","timestamp":1310224706,"content":"Glaurung said:\n\nNow is judgment time. They will fix it and everything going better or they game start slowly die. I sow 2 times already. With middle earth ccg and lotr tcg decipher.\n\nMaybe there's a curse on LotR-themed deck-construction style games.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497330","commentId":497330,"userName":"ArachneJericho","timestamp":1310224892,"content":"Shelfwear said:\n\nI think its a bit too early to say but in Germany the reception was mixed. It got less fanzine coverage than a boardgame and the couple of reviews were rather \"a good game\" than \"you must buy it\". It was clearly communicated that it appeals to fans of Collectible Card Games and Middle Earth Fans and less to the casual gamer.\n\nI'd expect the game to do better in a country where CCGs are popular; in Germany, they don't seem popular at all. The last deck construction game I'd heard of as doing well there was Blue Moon, which is like a very streamlined LCG. But I've been out of circulation for some time, so this might have changed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497353","commentId":497353,"userName":"servant of the secret fire","timestamp":1310232207,"content":"Shelfwear said:\n\nI know a couple of Middle-Earth fanatics myself who told me that they just cant relate to this type of card games. They stick to board and role-playing games instead.\n\n \n\n\n\nThen they must be very huppy now cause the new Lotr rpg is coming  at August."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497383","commentId":497383,"userName":"faith_star83","timestamp":1310238610,"content":"I actually am on the same page as Troopershark here. I am surprised at the sloppiness of ffg, especially since they already do LCGs for a long time. Of course a ship might be delayed by any kinds of reasons, but other companies have that problem, too, and they still manage to have a release schedule and stick to it. All this needs is some expert planning ahead. A professional way to do this would be to print ahead of time and start releasing once you're ready to do so. Any B to B sales enterprise cannot afford the sloppiness ffg is showing and its probably only a couple nerds like me that are excited enough about this game that are forgiving enough.\n\nSo really, not being able to give exact worldwide release dates and predicting sales figures...the company should have enough money to hire some professionals. Heck, they don't even manage to consistently post relevant articles on there homepage! I feel disappointed because ffg was getting the fans extremely excited about this game and got my hopes and expectations extremely high, but in the end failed to deliver. Maybe they should start doing things before they anounce them and get everyone excited about it. In other industries, if you don't manage to meet timelines you don't get a second chance..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497392","commentId":497392,"userName":"Narsil0420","timestamp":1310241864,"content":"Bohemond said:\n\nUm, we have a release date.  It was put on the boat June 2nd.  it takes 5-7 weeks from that time to hit the shelves.  That's the date.  We have known it for over a month. \n\n\n\nHear hear! It's only been three months, stop complaining. Has our capacity for patience grown so thin thanks to our \"immediate gratification\" culture that we will throw something great away just because it doesn't come out exactly when we want it to? Think how long you have to wait for a sequel to a video game, or movie, or how long it takes to release an expansion for any other board game! Three months is nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497403","commentId":497403,"userName":"Glaurung","timestamp":1310243621,"content":"There is a lot of mistakes FFG done. Of course the most problem is delay. Second, balance of the game is quite strange: Crazy draw, the game is to easy with expert 50 cards decks and more players, very unbalanced heroes and so on. One more  problem for me look like Hunt for gollum quest is quite easy and not provide enough challenge for the expert players. Tournament system also still unclear......\n\nAnd very important thing as well. More and more players start to feel disappointed. FFG must start to think really seruous about the game future. \n\nBut i hope they track forums and see what happen with the players and try to do something with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497408","commentId":497408,"userName":"servant of the secret fire","timestamp":1310244320,"content":"Narsil0420 said:\n\nBohemond said:\n\n \n\nUm, we have a release date.  It was put on the boat June 2nd.  it takes 5-7 weeks from that time to hit the shelves.  That's the date.  We have known it for over a month. \n\n \n\n \n\nHear hear! It's only been three months, stop complaining. Has our capacity for patience grown so thin thanks to our \"immediate gratification\" culture that we will throw something great away just because it doesn't come out exactly when we want it to? Think how long you have to wait for a sequel to a video game, or movie, or how long it takes to release an expansion for any other board game! Three months is nothing.\n\n\n\nIt's easy for you to say.After all you are the master of patiencelengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497425","commentId":497425,"userName":"Bohemond2","timestamp":1310249532,"content":"Complain all you want about the release schedule, but let’s not pretend FFG is a couple of gaming nerds with no idea of how to run a business. It’s a company with dozens of employees and revenues in the millions (probably tens of millions) of dollars. The company has achieved the status of one biggest players in the industry, and has done it, at least in part, because of extremely cost efficient production and delivery system.\n\nDo I want Hunt for Gollum yesterday? Yes! Am I not playing the game as much as I would like because of the limited number of scenarios? Of course.\n\nBut that doesn’t change the fact that a firm release date for something shipped from china overseas would either be a) completely unreliable or b) guarantee a later release of the product.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497436","commentId":497436,"userName":"SiCK_Boy","timestamp":1310254397,"content":"I think a lot of people would choose option B.\n\nThe worst thing about the delays with The Hunt for Gollum is the deception of not meeting expectations the company itself created. If they'd released the core set saying: \"We'll start releasing expansion packs in 3 months.\", people wouldn't be as frustrated as they are right now. Instead, they said \"we'll release one expansion per month starting in June.\". Well, we're approaching mid-July and the expansion isn't anywhere near hitting the shelves. And it looks like the following one is also being delayed. That's the mistake.\n\nNow, I understand it happens. But the lack of official update is still a big deception. Saying \"they said it had shipped on June 2nd, account for an extra 5 to 7 weeks before it hits the shelves\" isn't a professional response. Is it 5, 6 or 7 weeks? How come a movie company is able to annouce a year in advances the release date for their product, distribute it around the world and have it ready for the clients to purchase on time, as planned, 99,9 % of the time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497453","commentId":497453,"userName":"Glaurung","timestamp":1310265009,"content":"My nearest shop get the hunt for gollum release kit yesterday. So moment of true is come. I will play soon and will understand what going on with the game now and where we going. Anyway only after couple of adv. packs we can understand what really happen with the game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497505","commentId":497505,"userName":"faith_star83","timestamp":1310283992,"content":"Bohemond said:\n\nComplain all you want about the release schedule, but let’s not pretend FFG is a couple of gaming nerds with no idea of how to run a business. It’s a company with dozens of employees and revenues in the millions (probably tens of millions) of dollars. The company has achieved the status of one biggest players in the industry, and has done it, at least in part, because of extremely cost efficient production and delivery system.\n\nDo I want Hunt for Gollum yesterday? Yes! Am I not playing the game as much as I would like because of the limited number of scenarios? Of course.\n\nBut that doesn’t change the fact that a firm release date for something shipped from china overseas would either be a) completely unreliable or b) guarantee a later release of the product.\n \n\n\n\nBohemond, that is exactly my point. If the company was a small home-run based nerd-group producing awesome games I'd be willing to take a lot. But froma  company making millions (or tens of millions) of revenue I just expect matching professionalism. I think it is not even a question of professionalism not to guarantee something you cannot keep word for sure, but just a question of manner and (in this case) respect towards your client.\n\nAs SiCK_Boy said, there are numerous other industries that manage to deliver on time, and many of them produce in China or somwehere around the globe. You could say it is unfair to have higher expectations of a big multi-national company than of the home-based nerd-group, but that is the way I feel. And that is way I would always choose option B, because I don't care about an unreliable release date, but one that is realistic. And lotr being an lcg I feel it is very relevant to know when the next expansion is coming.\n\nActually, I think that is something even ffg might have underrated. Lotr gives us only about 50% (or less) of the cards to freely play with. The rest is event deck cards. Thus, a steady flow of new packs is more vital for lotr than for e.g. agot where I start with 4 perfectly usable decks with enough cards to provide variety in the core set. The three scenarios from the core set are played through quickly and the player cards give almost no variability. It is enough for 1 - 2 months maybe, but definitly not enough for 3-4  months. And I fear that 9 player cards per pack with only one new quest might not provide enough add value for 15 usd / month for me...although that is my personal oppinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497537","commentId":497537,"userName":"Bohemond2","timestamp":1310291587,"content":"SiCK_Boy said:\n\nNow, I understand it happens. But the lack of official update is still a big deception. Saying \"they said it had shipped on June 2nd, account for an extra 5 to 7 weeks before it hits the shelves\" isn't a professional response. Is it 5, 6 or 7 weeks? How come a movie company is able to annouce a year in advances the release date for their product, distribute it around the world and have it ready for the clients to purchase on time, as planned, 99,9 % of the time?\n\n\n\nMovie companies achieve their release dates by sitting on finished product for months. That isn’t a model we want FFG to emulate, since it would delay the product and increase costs. The problem isn’t communication; it’s that we all want the expansion packs ASAP. Demanding strict timetables to which a company must adhere doesn’t help achieve that goal; it hurts it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497558","commentId":497558,"userName":"SiCK_Boy","timestamp":1310295776,"content":"Then we disagree here. I personnally don't want them ASAP.\n\nI want them on schedule. I wouldn't mind that they push back their release schedule (and all the hyping up previews and marketing strategy) if it would mean no \"unexpected delays\" on future release.\n\nI'm sure other people do as well.\n\nAnd the movie industry doesn't sit on it's product for months. They often finish \"development\" (shooting, editing) a few weeks before release. If you watch the extras on the extended LotR DVD, you'll see that Peter Jackson was still making changes up to a few weeks before worldwide release.\n\nOne thing we don't know about FFG (and specifically in regard to LotR Card Game) is how the development cycle is organized. For example, have they already completed the design of all cards from all 6 expansion packs from the Shadows of Mirkwood cycle? One would think so, since they probably designed all 6 together. If that's the case, then there's no reason not to get them all printed at once. They can still delay the release to distributors so that they trickle in once a month, but I don't understand why the delay on Hunt for Gollum is rippling up to the next expansion as well. Unless they really are still working on the design (making up cards, playtesting, etc.) of the other expansions.\n\nIf the product is completely designed, then it's risk management on their part. They risk delays in distribution to save on storage costs and so as to be able (I guess) to print the appropriate quantity of products for the expected market (if sales plummet, they may not print as maybe copies of the 6th expansion as they do the first). There's probably also some marketing decisions involved. But in the case of THfG, their risk management strategy and the marketing campaign is making a number of people unhappy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497607","commentId":497607,"userName":"servant of the secret fire","timestamp":1310307238,"content":"Bohemod@\n\nMate this is not a game wich you can wait 3 months for a new scenario.I don't know the real reason for the delay but this is very bad for the company and the game and as faith star said i am not sure that 1 ap per month and 9 new cards can hold peoples interest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497615","commentId":497615,"userName":"Bohemond2","timestamp":1310307982,"content":"\nJust because one film finishes a few weeks before release doesn't mean that's true across the industry. Black Swan, The King's Speech and 127 Hours (just to pick some names from the best picture list), were all done several months before theatrical release. Also, movie making doesn't involve much in the way of manufacturing, or rely on container shipping, and its entire profit model is computed around release dates, so it’s not a very useful comparative example.\n\n\nBased on other LCGs, I am near certain that expansion cycles are designed as a whole. As for why you might not print them all together, as you point out, we need to remember that it’s a physical product. Once you make it, you have to put it somewhere. Also, remember that Fantasy flight makes a wealth of different games, and uses similar sized components (figures, dice, cards, boxes, inserts) across its entire line. So, the decision you are making in April* isn't \"do we print the hunt for Gollum on its own, or do we print the entire Mirkwood cycle?\", it's \"What do we need to print across our entire company for July?\"How much does advanced printing and storage cost? Would absorbing the costs be better than risking production delays? Hard for us to say without actually being in the business.\n\n\nAre some people pissed off? Sure. It's an internet forum, some people are always pissed off. More importantly, some people will be pissed off no matter what you do. It’s not like FFG has been sitting on their hands. For instance, FFG knew the product was going to be delayed, so they shipped copies of it ahead by air to host demo events to build an retain enthusiasm for the line. They aren't hiding a specific date from us. International cargo shipping is often imprecise. When they have a firm date, they will give it to us.\n\n\nIn terms of delays, I would be far more worried that Conflict at the Carrock hasn’t shipped than I would be about whether we get THfG arrives in mid July or late July.\n\n\n* I have no idea if this decision was actually made in April, i was just picking a random month as an example"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497618","commentId":497618,"userName":"Bohemond2","timestamp":1310308113,"content":"servant of the secret fire said:\n\nBohemod@\n\nMate this is not a game wich you can wait 3 months for a new scenario.I don't know the real reason for the delay but this is very bad for the company and the game and as faith star said i am not sure that 1 ap per month and 9 new cards can hold peoples interest.\n\n\n\nServant, that is exactly my point. Guaranteeing a release date means that you will have a later release. The problem isn’t lack of communication or an established time table. The problem is that the game needs expansions, and the company should focus on getting them in stores as quickly as possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497789","commentId":497789,"userName":"DrNate","timestamp":1310334284,"content":" It upsets me when dates and timetables are given and then it is so obvious that it is going to miss the dates; so clear even to the general public, like you and I. But then no updated information is released. I know I am not owed anything, but if a release date is put out there without any of us asking for one, then jerked away without explanation, I start to feel...well, jerked around. And that is a feeling that sucks, loyal paying customers deserve better. \n\nAlso, I do worry about the long term health of the game. With a single scenario and only two new cards per sphere in each release (plus a single Neutral), it doesn't feel like an expansion will have much legs. Ideally, it won't matter because the way things are set up, the next fix should be just a month away. But, is that going to happen? It feels like Gollum is way ahead of Carrock. \n\nI get the same problem with Cubicle 7. Release dates that they choose to set and announce, then miss and miss again without explanation. Then when finally they do get something released, it is sort of ho-hum. Fortunately, with them I can vote with my wallet (assuming they ever put anything out again). It's harder to vote with my wallet when I am addicted to collecting cards and trying to win the game. \n\nI want this game to survive and thrive. I don't know how much of a negative effect delays have on the survival and livelihood of games which are designed to steadily grow and expand. But I really wish that no new product wouldn't cut into the game's bottom line, and make it seem less economically viable to a business that wants to make money. \n\nI know it is just a game, but games are how I meet new people and make new friends, how I enjoy myself, and blow off stress from a meaningless job and all the little mundane things that pile up on each and every one of us daily. They are important  part of my life, and when I find one that I like, I want it to do well. I feel a little better now.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497868","commentId":497868,"userName":"Glaurung","timestamp":1310355724,"content":"There is also can be another negative  effect. We waiting for HFG long time already. So when is come and it will be not so difficult and dont give you some really good expirience???If you easy can beat it with your old decks??? And still in coop it will to easy so what you will feel. Mostly of us will feel disappointed.\n\nYou wait wait long time,  get it ,easy beat it and now you have to wait  again for the next one(Conflict in Carrock).\n\nThe Adv pack quest sshould to be really interessting and provide really different expirience from each other. And should to be more difficult then core set quest.\n\nAnd Also when you play coop the Difficult should increase with the number of players. And with stages of the quests also dangerous must grow.\n\nThan is will be ok. People will like to play, make coop decks preparing them self for more challenge on the tournaments with special tournaments quests.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=497875","commentId":497875,"userName":"Klaen","timestamp":1310356464,"content":"Wow, after reading this thread, I'm **** glad I'm not a game producer...such a fickle customer base.\n\nRealistically the expansion is only 11 days late at the moment.\n\nHas it not occurred to anyone that FFG may be hesitant to drop a new release date because there have been issues with the shipment. In context of business and the nature of the gaming customer base, I think it entirely wise that FFG hold back on a release date until the stock is in their hot little hands. Why risk more angst and flaming?\n\nFortunately my life does not gravitate around one measely card game...I'm sure there are tons of things I can fill the space between waiting and finally getting to play the next expansion to this great game...\n\n...like: beat it in nightmare, multiplayer, Middle Earth Quest, polish my car, clean my neglected house, paint some more miniatures...read LOTR again...\n\nYou get my point.\n\n \n\n(P.S. here was me thinking DrNate was the games creator Nate French...**** glad that is clear prior to me asking / pm'ing)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498101","commentId":498101,"userName":"Kristabelle","timestamp":1310386230,"content":"I'm almost enjoying the anticipation of acquiring more of this game. If it was a traditional CCG I'm sure that I would have purchased many boosters by now and quite possibly be regretting the outlay.\n\nInstant gratification is overrated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498113","commentId":498113,"userName":"Dain Ironfoot","timestamp":1310386835,"content":" I agree, Kristabelle.\n\nIn fact, I question why the original poster even felt it necessary to post this. Okay, you are frustrated and give up...why do we need to know this? Do you think FFG will read this and instantly (or more quickly) release HFG? Of course not. There are more constructive ways to express dissatisfaction. Telling the gaming community you \"give up\" is only worth a \"shrug\" from me.\n\nWhile the company could be a bit more forthcoming, it's not a deal breaker. Who knows if the reprinting of the core set threw off scheduling/printing/whatever in other departments. For me, I just got the core set (I had to wait for a second printing!). So, I know I haven't been waiting as long as those who bought the game on April 20th, and I can understand their frustration.\n\nHowever, when I played other CCGs, there were months and months between the original release and the first expansion. Many times a year (give or take). Now, I understand \"normal\" CCG first releases are a \"fuller\" release and LCGs can get away with the initial release being smaller with the promise of adventure packs coming out soon to fill out the card pool.\n\nEither way, FFGs \"Upcoming\" page says all of the Shadow of Mirkwood APs are \"At the Printer\" and HFG is \"On the Boat\"; so, hopefully things will be going smoothly soon. \n\nIn the meantime, I'm still having fun. Tweaking decks. I still get enjoyment out of the initial quests, even though I've beaten them many times now (except #3...haven't even attempted yet!). \n\nI suppose we all need places to vent...but sometimes it's less than productive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498180","commentId":498180,"userName":"Vyron2","timestamp":1310390742,"content":" Dain, I agree with you!\n\n \n\nalso the comment with the \"instant gratification culture\" is totally on the spot! I can't remember a time in my youth, that I had any patience problems with CCGs... I mean, even with MtG, the \"greatest\" of them all (commercially...), I NEVER had a FULL card pool, on the contrary - my card pool at the beginning was VERY limited, due to the fact, that you got only so many cards with a booster pack or themed deck - I played the **** out of my limited resources and it never got boring... people nowadays have no patience what soever! I want it all, and I want it now... for God's sake... just wait a couple of weeks more....\n\nI can see the same guys already complaining after HFG's release - how easy it was to beat, how it got boring again, how they want the next AP... chill dudes! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] my only concern as to this game is the acquiring of more people, i.e. a larger fanbase and good and balanced cards, as well as fun, so that the game lasts at least a couple of years and doesn't die out... hell I'd be happy with as much as 3 years, given that LOTR CCG's seem to be \"cursed\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] though they are the best of their kind, imo..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498187","commentId":498187,"userName":"servant of the secret fire","timestamp":1310391451,"content":"Vyron said:\n\n Dain, I agree with you!\n\n \n\nalso the comment with the \"instant gratification culture\" is totally on the spot! I can't remember a time in my youth, that I had any patience problems with CCGs... I mean, even with MtG, the \"greatest\" of them all (commercially...), I NEVER had a FULL card pool, on the contrary - my card pool at the beginning was VERY limited, due to the fact, that you got only so many cards with a booster pack or themed deck - I played the **** out of my limited resources and it never got boring... people nowadays have no patience what soever! I want it all, and I want it now... for God's sake... just wait a couple of weeks more....\n\nI can see the same guys already complaining after HFG's release - how easy it was to beat, how it got boring again, how they want the next AP... chill dudes! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] my only concern as to this game is the acquiring of more people, i.e. a larger fanbase and good and balanced cards, as well as fun, so that the game lasts at least a couple of years and doesn't die out... hell I'd be happy with as much as 3 years, given that LOTR CCG's seem to be \"cursed\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] though they are the best of their kind, imo...\n\n\n\nDon't compare other ccg with this game.MTG is a pvp game and Lotr is a coop game with standar scenarios.Wen you play a pvp game other people can make a new deck and you must find new strategies to win them.Here the scenarios are the same every time you play so if you can find a way to win nothing can stop you.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498275","commentId":498275,"userName":"Bohemond2","timestamp":1310398880,"content":"We now have an official release date and a substantive explanation for the shipping delays.  Time to find something new to complain about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498351","commentId":498351,"userName":"Kiwina","timestamp":1310405776,"content":"Bohemond said:\n\n \n\nWe now have an official release date and a substantive explanation for the shipping delays.  Time to find something new to complain about.\n\n \n\n \n\nCan you share a link with us?\n\nEdit: Nevermind.  I just found it, and the way they present the explanation is great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498366","commentId":498366,"userName":"Mestrahd","timestamp":1310407330,"content":"Yes, I enjoyed the little Middle Earth story to it. Can't wait for the 22nd!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498387","commentId":498387,"userName":"Narsil0420","timestamp":1310410218,"content":"Bohemond said:\n\nWe now have an official release date and a substantive explanation for the shipping delays.  Time to find something new to complain about.\n\n\n\nHa ha ha!!! Nice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498443","commentId":498443,"userName":"DrNate","timestamp":1310418818,"content":"Bohemond said:\n\nWe now have an official release date and a substantive explanation for the shipping delays.  Time to find something new to complain about.\n\n\n\nI don't like the errata!\n\nThese expansions are too small!\n\nThe Troll is too hard to kill!\n\nThere's no way that Carrock will be out a month after HfG. \n\nI never have enough resources. \n\nWhy does Leadership get all the good cards?\n\n...that's enough for now. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498505","commentId":498505,"userName":"timbolton","timestamp":1310433166,"content":"Helpful reading - www.fantasyflightgames.com/edge_news.asp [http://www.fantasyflightgames.com/edge_news.asp?eidn=2460]\n\ngui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498798","commentId":498798,"userName":"nelsonbaggins","timestamp":1310480707,"content":" I personally enjoy a more leisurely release schedule.  I think once a month is too much product for me to keep up with.  I'm still about 8 battle packs behind on Warhammer Invasion and I really want to pick up the new Legends Expansion--I just can't seem to catch up.  Now I'll be buying into LOTR LCG and that will be a another Adventure Pack every month, plus an expansion once a year maybe.  FFG can take their sweet time imho! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  That being said, I am pretty excited about Hunt for Gollum! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498816","commentId":498816,"userName":"Glaurung","timestamp":1310483074,"content":"Just finish one more game with my friend. We play 2 players against third quest Dol guldur. We have agreement dont use powerful heroes.\n\nSo i use Eowyn, Legolas and Theodred. My friend use Denetor, Bilbo (proxy) and Aragorn. NO Gilmy no Beravur. So what you guys think????\n\nWe win without any problem. Still card draw even with Bilbo make a game.  +Northern tracker and Faramir. My friend have about 15 cards in his hand all the time. The only thing what we care is make more victory points and remove more threat.  Gandalf jumping around almost  every turn like devil from tobacco box.\n\nIn my expirience i didn lose any game in cooperative game at all. Too easy.\n\nStill hope for the future Adv pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498842","commentId":498842,"userName":"Mestrahd","timestamp":1310486613,"content":"You tried not using \"powerful heroes\" but you played Eowyn, Legolas and Aragorn? What is your definition of powerful? The weaker heroes IMO are Denethor, Glorfindel, Elenor, Dunhere, Thalin, Gloin, and possibly Theodred. Seems to me you used all but 2 of the most powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=498976","commentId":498976,"userName":"Glaurung","timestamp":1310510857,"content":"Mestrahd said:\n\nYou tried not using \"powerful heroes\" but you played Eowyn, Legolas and Aragorn? What is your definition of powerful? The weaker heroes IMO are Denethor, Glorfindel, Elenor, Dunhere, Thalin, Gloin, and possibly Theodred. Seems to me you used all but 2 of the most powerful.\n\n\n\nI f you look on my topic (some cards errata)  you will see i talking about Gimly and Beravur. But as i understand even without them game to easy.\n\nYes look like if you wonna play coop game as a challenge (orherwise is boring ,walking in the park) you must include as well  Aragorn, Legolas and Eowyn.\n\nYou now what i want. I want to lose at least 1 time. For last 20 games i lose only 1 solo game. And it was Helping the friends fan made scenario.\n\nI never lose Any coop game.  Next time i try exclude Sneak Attack ,northern tracker and Faramir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499263","commentId":499263,"userName":"servant of the secret fire","timestamp":1310561688,"content":"Mestrahd said:\n\nYou tried not using \"powerful heroes\" but you played Eowyn, Legolas and Aragorn? What is your definition of powerful? The weaker heroes IMO are Denethor, Glorfindel, Elenor, Dunhere, Thalin, Gloin, and possibly Theodred. Seems to me you used all but 2 of the most powerful.\n\n\n\nGlorfindel a  weaker hero?Maybe you must take a second look on him.He is almost a broken hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499277","commentId":499277,"userName":"pumpkin","timestamp":1310564093,"content":"Glaurung said:\n\n \n\nYou now what i want. I want to lose at least 1 time. For last 20 games i lose only 1 solo game. And it was Helping the friends fan made scenario.\n\n \n\n\n\n \n\nTrying playing with a mono tactics deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499297","commentId":499297,"userName":"Glaurung","timestamp":1310566965,"content":"pumpkin said:\n\nGlaurung said:\n\n \n\n \n\nYou now what i want. I want to lose at least 1 time. For last 20 games i lose only 1 solo game. And it was Helping the friends fan made scenario.\n\n \n\n \n\n \n\n \n\nTrying playing with a mono tactics deck.\n\n\n\nNo point. You cannot win. maybe only first quest..... About  85%-15%  win/lose.\n\nI make new deck with Bilbo/Beravur/Denetor. Use cards from HFG. Good deck work very well solo.Dunedan Mark is very good Card + MInistrel And songs.....\n\nThis deck lore/leadership but there is no leadership heroes at all. Only songs. Work very well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499376","commentId":499376,"userName":"qwertyuiop","timestamp":1310578314,"content":"Kristabelle said:\n\nI'm almost enjoying the anticipation of acquiring more of this game. If it was a traditional CCG I'm sure that I would have purchased many boosters by now and quite possibly be regretting the outlay.\n\nInstant gratification is overrated.\n\n\n\nAlways purchase boosters by way of draft tournaments (official or otherwise)  for traditional CCG.\n\n \n\n \n\nI hate waiting on the expansions for this game because of all the early hype and the long wait for the core set, but it does give me more time to play FFG's Civ and/or ME Quest. Find that silver lining. Or silver line game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499490","commentId":499490,"userName":"pumpkin","timestamp":1310607253,"content":"Glaurung said:\n\npumpkin said:\n\n \n\nGlaurung said:\n\n \n\n \n\nYou now what i want. I want to lose at least 1 time. For last 20 games i lose only 1 solo game. And it was Helping the friends fan made scenario.\n\n \n\n \n\n \n\n \n\nTrying playing with a mono tactics deck.\n\n \n\n \n\nNo point. You cannot win. maybe only first quest..... About  85%-15%  win/lose.\n\nI make new deck with Bilbo/Beravur/Denetor. Use cards from HFG. Good deck work very well solo.Dunedan Mark is very good Card + MInistrel And songs.....\n\nThis deck lore/leadership but there is no leadership heroes at all. Only songs. Work very well.\n\n\n\nSorry, I guess the irony of my inital response was lost.\n\nYes I know it is almost impossible to win with a mono tactics deck currently, but your post was about how easy the game is and how you would like to lose more often.\n\nAs I see it you have created a well tuned deck or decks and then you seem annoyed because you keep winning? I'd be annoyed if my well tuned deck didn't keep winning.\n\nSomeone, was it Servant, made a good point in that this isn't a PvP game so unlike those games once you have worked out how the encounter deck \"works\" it should be possible to create a deck that can beat it more or less consistently, although I think that is still proving difficult for a lot of people for the 3rd quest, which incidentally do you play that solo, and what is your win rate there?\n\nBut creating a deck just to beat the encounter deck isn't all there is to this game, its about creating different thematic decks, its about being part of a journey in middle earth with your favourite characters etc etc - if all you want to do is beat the encounter deck but then complain that the game is then too easy, perhaps this isn't the right game for you?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499548","commentId":499548,"userName":"Iver2","timestamp":1310622930,"content":"pumpkin said:\n\nBut creating a deck just to beat the encounter deck isn't all there is to this game, its about creating different thematic decks, its about being part of a journey in middle earth with your favourite characters etc etc - if all you want to do is beat the encounter deck but then complain that the game is then too easy, perhaps this isn't the right game for you?\n\n  \n\n\n\n \n\ncame into my mind too... (no offence meat!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499647","commentId":499647,"userName":"servant of the secret fire","timestamp":1310639802,"content":"pumpkin said:\n\nSomeone, was it Servant, made a good point in that this isn't a PvP game so unlike those games once you have worked out how the encounter deck \"works\" it should be possible to create a deck that can beat it more or less consistently, although I think that is still proving difficult for a lot of people for the 3rd quest, which incidentally do you play that solo, and what is your win rate there?\n\nBut creating a deck just to beat the encounter deck isn't all there is to this game, its about creating different thematic decks, its about being part of a journey in middle earth with your favourite characters etc etc - if all you want to do is beat the encounter deck but then complain that the game is then too easy, perhaps this isn't the right game for you?\n\n \n\n \n\n\n\nYes after some games you understand that this game is not to find a killer deck but to make different thematic decks and make your journey threw Middle-Earth.As i said before the encounter deck stays the same so sooner or later you will find a deck wich can beat it consistently as pumkin said.\n\nHowever this is not the point wen you play with your friends or solo.Killer decks will shine at tournaments and there you can compare your skills at deck building."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499698","commentId":499698,"userName":"Glaurung","timestamp":1310646616,"content":"servant of the secret fire said:\n\npumpkin said:\n\n \n\nSomeone, was it Servant, made a good point in that this isn't a PvP game so unlike those games once you have worked out how the encounter deck \"works\" it should be possible to create a deck that can beat it more or less consistently, although I think that is still proving difficult for a lot of people for the 3rd quest, which incidentally do you play that solo, and what is your win rate there?\n\nBut creating a deck just to beat the encounter deck isn't all there is to this game, its about creating different thematic decks, its about being part of a journey in middle earth with your favourite characters etc etc - if all you want to do is beat the encounter deck but then complain that the game is then too easy, perhaps this isn't the right game for you?\n\n \n\n \n\n \n\n \n\nYes after some games you understand that this game is not to find a killer deck but to make different thematic decks and make your journey threw Middle-Earth.As i said before the encounter deck stays the same so sooner or later you will find a deck wich can beat it consistently as pumkin said.\n\nHowever this is not the point wen you play with your friends or solo.Killer decks will shine at tournaments and there you can compare your skills at deck building.\n\n\n\nOK . We can have long discuss here. Anyway i sow already many topics on this forum where is all my complains and conclusions was already present by another players. The main point is not about deck building , not about construct different themes decks. The main point is BALANCE OF THE GAME IS VERY BAD  NOW!!!!!! Only this!!!!! And this nothing to do with ::: maybe you want to much challenge from the game and so on.\n\nThe problem is ::: there is lot of mistakes of designers , bad calculation , some cards to much powerfull some to weak , scaling of the game is also terrible.\n\nSo at least with rules they clear alreay many things......... This give me hope they will do everything right. Also HFG card (i sow the encounter cards already) quite cool and better scaling (more players more dangerous cards effect). But still there is a lot of job before game and cards even the rules will be balanced.\n\nWhen is done you will see maybe in 6 months or something than i will be happy. Anyway i happy already (Tolkien game ).\n\nI think with adventure packs and with errata and rules correction they will fix it soon. Wnen we will have a tournament system everything should be ok. (i hope).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=499727","commentId":499727,"userName":"pumpkin","timestamp":1310649572,"content":"But... Balance isn't the be all and end all of a co-operative thematic game, is it.\n\nThe game is not so unbalanced that in a 50 card set everyone is choosing the same 50 cards and the same 3 heroes to play every time, are they?\n\nNaturally, some cards or card combos are currently more powerful than others and some heroes are currently more useful than others, but if I wanted to play a thematic all dwarf hero fellowship, it wouldn't bother me that I should really be playing with Eowyn because she is the killer questing hero and completely unbalanced when compared to the current dwarf heroes...\n\nI guess my question is, even if some cards are unbalanced, why does it matter? Who really cares? and there are always going to be cards that are better than others and some that suit different playing styles compared to others, and that is never going to change and I personally hope it doesn't.\n\nThe only point of yours I have some agreement with it that is doesn't scale well once you get to 3 or 4 players, but then 1 core box is only really a 2 player game anyway.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=506338","commentId":506338,"userName":"Glaurung","timestamp":1312017142,"content":"Actually looking on Next adv pack CITC encounter cards i start understand this one is real challenge. Looks like difficult level at least 5 or maybe even 6.\n\nThe trolls a nasty and location with immune to player card effect should be quite interesting. Looks like every pack will increase level of challenge. I like it.\n\nSounds cool!!!! Cannot wait for the tournament system!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=506364","commentId":506364,"userName":"SiCK_Boy","timestamp":1312023018,"content":"pumpkin said:\n\nI guess my question is, even if some cards are unbalanced, why does it matter? Who really cares? and there are always going to be cards that are better than others and some that suit different playing styles compared to others, and that is never going to change and I personally hope it doesn't.\n\n\n\nObviously, Glaurung cares. He made his points multiple times, on this forum and others.\n\nHowever, I agree with you that the \"unbalance\" isn't that extreme right now (at least not as extreme as Glaurung makes it sound).\n\nMost of the \"unbalanced\" aspects of the game right now aren't due so much to the game mechanics themselves, but rather to the design of the quests. We've already seen multiple suggestions to reduce these irritants (some incorporated in fan-made quests) and I'm sure they'll be included in the game at some point:\n\n- Having a \"harder\" sub-set of encounter cards that gets added once you advance to stage 2 or 3 of a quest could assuage the fact that the players get more and more resources at their disposal as the game progress while the encounter deck remains static.\n\n- Reseting the player's boards as the quest progresses (for example, removing your highest cost ally once you move to stage 2, etc.).\n\n- More cards that scale directly based on the number of players (The Hunt for Gollum already provided many of those).\n\n- Imposing a cost (resource, card, other) on every ally \"entering play\" (as opposed to being played) to limit Gandalf / Sneak Attack abuse.\n\nAlso, we may end up with further deckbuiling restrictions (restricted cards, cards that you can only have 1 of, etc.) if the game keeps being \"too easy\" when using \"expert\" decks.\n\nAll that to say that once we've got to the end of the current cycle, we'll be in a much better position to evaluate the quality of the game.\n\nIt doesn't mean there aren't valid complain about it: the distribution model of the core set (with not all cards being provided in 3 of), the delays in shipping the game and it's expensions, the lack of deckbuilding options (we still can't make mono-sphere 50 cards tournament legal decks without using crap such as Power in the Earth), etc.\n\nGlaurung: Have you tried playing in Nightmare mode? I don't remember seeing you comment on this \"official\" play option, which could be more suited to your research of a \"harder\" game experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=506418","commentId":506418,"userName":"Glaurung","timestamp":1312032651,"content":"SiCK_Boy said:\n\npumpkin said:\n\n \n\nI guess my question is, even if some cards are unbalanced, why does it matter? Who really cares? and there are always going to be cards that are better than others and some that suit different playing styles compared to others, and that is never going to change and I personally hope it doesn't.\n\n \n\n \n\nObviously, Glaurung cares. He made his points multiple times, on this forum and others.\n\nHowever, I agree with you that the \"unbalance\" isn't that extreme right now (at least not as extreme as Glaurung makes it sound).\n\nMost of the \"unbalanced\" aspects of the game right now aren't due so much to the game mechanics themselves, but rather to the design of the quests. We've already seen multiple suggestions to reduce these irritants (some incorporated in fan-made quests) and I'm sure they'll be included in the game at some point:\n\n- Having a \"harder\" sub-set of encounter cards that gets added once you advance to stage 2 or 3 of a quest could assuage the fact that the players get more and more resources at their disposal as the game progress while the encounter deck remains static.\n\n- Reseting the player's boards as the quest progresses (for example, removing your highest cost ally once you move to stage 2, etc.).\n\n- More cards that scale directly based on the number of players (The Hunt for Gollum already provided many of those).\n\n- Imposing a cost (resource, card, other) on every ally \"entering play\" (as opposed to being played) to limit Gandalf / Sneak Attack abuse.\n\nAlso, we may end up with further deckbuiling restrictions (restricted cards, cards that you can only have 1 of, etc.) if the game keeps being \"too easy\" when using \"expert\" decks.\n\nAll that to say that once we've got to the end of the current cycle, we'll be in a much better position to evaluate the quality of the game.\n\nIt doesn't mean there aren't valid complain about it: the distribution model of the core set (with not all cards being provided in 3 of), the delays in shipping the game and it's expensions, the lack of deckbuilding options (we still can't make mono-sphere 50 cards tournament legal decks without using crap such as Power in the Earth), etc.\n\nGlaurung: Have you tried playing in Nightmare mode? I don't remember seeing you comment on this \"official\" play option, which could be more suited to your research of a \"harder\" game experience.\n\n \n\n \n\n\n\nYes  as  i say before they should to make more powerful encounter cards which will react on players power and make quests more intetresting and different on every stage. And look like they do it. I think next quest will be much more difficult. Sound very promising.\n\nBut anyway we should keep talk about what we like and what we dont to help the designers make game better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49717-i-give-up/?do=findComment&comment=507496","commentId":507496,"userName":"Hayzuss","timestamp":1312261816,"content":"It's a shame you have given up.  It looks like this game is going along great and already peoples issues are slowly being put to rest with the expansion so far.  In the future no doubt the game will become more balanced and scale better.  I think Glaurung is right the more that we discuss the things we do and do not enjoy the better the game will get.  I certainly hope the game grows and improves.  I am looking forward to having a new adventure and deck building options each month.  Crazy to think because of one delay you would deprive yourself of that posiibility. Oh well thats how it goes I guess.  I do hope you are wrong that this will only be a niche game, the more the merrier!"}]}