{"url":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/","title":"First game review, tough, but fun!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=497494","commentId":497494,"userName":"peterstepon","timestamp":1310281268,"content":"I would like to share my first attempt at the game, my first impression is tough, but lots of fun!  I can see the brilliance of this game and why it has been flying off the shelves.  I would like some feedback about how I can win the next time.\n\nI started out with the first scenario and was a bit of a purist, I went with the pure spirit deck plus one Gandalf card.  I also went with all three Spirit heroes. The basic strategy was this.  Quickly in the game, I was able to get the elf scout ally, as well as the \"favoured by the lady\" card which I put to Eowyn.  She was the one I would use to get progress on the quests.  The others would be for attack and defence (Dunhere to attack monsters, Elonor to act in defence, a meat shield if you will).  Progress was good, I was able to complete 2 quests before getting crushed at the third.  I found that even the first quest made me sweat, getting progress can be a nerve wracking experience and even using Eowyn was no guarantee progress was going to be made.  Sometimes I would even avoid a quest just to clean up the staging ground before going forward.  Quest 2 went by quickly.  Quest 3 was where things went downhill because a Spawn of Uqualit (whatever the spelling was), basically Shelob`s sibling came to the staging ground.  With 2 other King Spiders the position was grim.  Basicially, I tried to hold them off using any cards I had but the overwhelming might of the enemies ment that I would fight to the end until death.  I was however, very satisfied with the game.\n\nI thought that scenario 1 would be a cakewalk.  If that is difficulty 1 I shudder to think about the other scenarios.  \n\nI am going to be a purist and try to win at least the first 2 scenarios with pure decks (leaning towards lore and spirit).  I hear scenario 3 is brutal to solo. If anyone can give me some strategies to get this bad boy finished I would much appreciate it.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=497503","commentId":497503,"userName":"Shelfwear","timestamp":1310283073,"content":"Exactly my impressions after a couple of games.\n\nSome facts to remember:\n\nThe game is easier with two players than playing solo (you get twice the resources/cards facing only one more encounter card per turn)\n\nWith the current card pool you'll most probably wont get past quest two with just a mono sphere deck\n\nFirst I started playing all quests with mono sphere decks, then switched to different dual-sphere decks and now I'll simulate a two-player game alone (controlling two dual sphere decks) in order to get a feel for the difficulty and sphere versality.\n\nHaving a second core deck makes things easier (having 3 copies of all basic and uncommon cards and 2 copies of the \"rare\" ones) plus the new cards introduced with the extra packages will make spheres less one-sided.\n\nWith a bigger card pool in the future the difficulty will be more balanced."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=497509","commentId":497509,"userName":"SiCK_Boy","timestamp":1310284817,"content":"The key with the spirit deck is to keep your threat low enough that you don't have to engage ennemies. I'd suggest to mulligan if you don't have The Galadhrim's Greetings or a Northern Tracker in your initial hand.\n\nDunhere can deal with most enemies from within the staging area. If you're lucky enough, the only enemies you'll have to engage are the ones with threat 20 and less ((King Spider being the thoughest one from the lot).\n\nGetting a few Wandering Took and Northern Tracker can make a huge difference. They are your better \"fighting allies\".\n\nAlso, once you find Gandalf, you must try to abuse him with Stand and Fight. Don't hesitate to use his 4 damage ability as you have other means to reduce your threat anyway and, unless you're getting stuck with locations, try to use him for combat (he can defend against Ungoliant's Spawn, for example; and he can kill most enemies in a single attack) rather than questing.\n\nYou may find scenario one easier if you get the \"Beorn's Path\" option at the end, as you can then escape the Ungoliant's Spawn (it can always show up, but you get better odds of not having to fight it)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=497511","commentId":497511,"userName":"peterstepon","timestamp":1310285466,"content":"I get the impression that playing solo with one deck is like playing with one hand tied behind your back.  Some people simulate the two player experience by controlling two decks and two sets of heroes.  I can imagine that commanding 6 heroes would give much greater flexibility and power in the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=497765","commentId":497765,"userName":"peterstepon","timestamp":1310328439,"content":"I was able to win the first scenario 2 times.  Once pretending to be two players in a spirit/lore teamup.  Then playing the Spirit deck solo.  The game is much easier with two people because it allows more ganging up on challenges (more people towards quests, more people able to fight monsters).  The second time I won through the skin of my teeth.  I lost a hero and literally had to shake Gandolf from the discard pile screaming \"get up and fight!\" (playing the card by that name) so I could kill the Spawn of Uqulit at the end. Literally Gandolf had to inflict 4 damage on him, and all my remaining characters had to jump in to finish him off.\n\nThe Spirit deck is hard to play solo since it does not have too many fighters, it is great when covering territory though. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=497785","commentId":497785,"userName":"Bohemond2","timestamp":1310332319,"content":"Congrats on your win!\n\nNow that you have a feel for the game, you might want to consider tinkering with your deck. The starting decks are a great way to learn the game, but I don't think that they are the best way to play the game.  No need to bang your head against the wall with the original package; deck building is a part of the game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=498855","commentId":498855,"userName":"peterstepon","timestamp":1310487139,"content":"After 4 tries of Passage through Mirkwood, I am still getting a hang of the game.  Absolutely love it and am looking forward to getting the hunt for Gollum expansion (and all the other expansions for that matter).  Here is the scorecard\n\n1/  First try, defeat.  Played a straight Spirit deck.  Finished 2 quests but got mauled at the end by a swarm of spiders\n\n2/  2nd try, victory, I played 2 decks (and took 2 encounter cards).  Played both Spirit and Lore.  Great matchup.  Spirit is great for progress and exploring areas, Lore is great for healing\n\n3/  3rd try, victory by the skin of my teeth, played Spirit again.  Had to use Gandalf early in the game.  Had to use all my resources to play the \"get up and fight card\" to crush the Spawn of Uliquit\n\n4/  4th try, Played the Leadership deck.  Pretty easy.  The deck is great for solo because you have an army of followers, and the ability of Aragorn to bounce back after questing is very helpful. \n\nTonight, I will solo with the Lore deck.  Once I get the hang of this I will try the tougher scenarios.  Then the Hunt for Gollum. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=498907","commentId":498907,"userName":"Dain Ironfoot","timestamp":1310493345,"content":"peterstepon said:\n\nTonight, I will solo with the Lore deck.  Once I get the hang of this I will try the tougher scenarios.  Then the Hunt for Gollum. \n\n\n\nI've beaten the first scenario with all of the spheres except solo Lore. I just can't seem to get it to work. Not enough Quest power and not enough Attack power and the Allies  (which are key) suck.\n\nI've only beaten the second scenario with a tri-sphere solo deck.\n\nAnyone else had luck with solo Lore? What was your strategy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=498914","commentId":498914,"userName":"Apophenia","timestamp":1310494549,"content":"Dain Ironfoot said:\n\npeterstepon said:\n\n \n\nTonight, I will solo with the Lore deck.  Once I get the hang of this I will try the tougher scenarios.  Then the Hunt for Gollum. \n\n \n\n \n\nI've beaten the first scenario with all of the spheres except solo Lore. I just can't seem to get it to work. Not enough Quest power and not enough Attack power and the Allies  (which are key) suck.\n\nI've only beaten the second scenario with a tri-sphere solo deck.\n\nAnyone else had luck with solo Lore? What was your strategy?\n\n\n\nUsing Denethor and Hennamarth to look at the top card of the encounter deck. This lets you allocate all your heroes and allies better and possibly free up Glorfindel for combat duty. Glorfindel is your heavy hitter so use him to fight when needed.\n\nAnd Protector of Lorien, that card gives a Lore deck lots of flexibility. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=498928","commentId":498928,"userName":"SiCK_Boy","timestamp":1310497127,"content":"I've had success with solo Lore/Leadership deck, but out of 3 Core Set + Hunt for Gollum. Playing with Denethor, Beravor and Bilbo, you can easily cycle through your whole deck. And the new Minstrel lets you play Song of Kings and a few key Leadership spells (Sneak Attack for Gandalf to manage your threat, Mark of the Dunedain to get a bit of fighting power - won't be needed once Haldir joins the fray, Steward of Gondor and Ever Vigilant).\n\nPlaying Bilbo + Beravor in solo means massive drawing, even without Unexpected Courage. And using 3 core sets means I'm almost guaranteed and early Hemanarth, which is key to getting a mono-lore deck to work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49740-first-game-review-tough-but-fun/?do=findComment&comment=498998","commentId":498998,"userName":"Glaurung","timestamp":1310513121,"content":"SiCK_Boy said:\n\nI've had success with solo Lore/Leadership deck, but out of 3 Core Set + Hunt for Gollum. Playing with Denethor, Beravor and Bilbo, you can easily cycle through your whole deck. And the new Minstrel lets you play Song of Kings and a few key Leadership spells (Sneak Attack for Gandalf to manage your threat, Mark of the Dunedain to get a bit of fighting power - won't be needed once Haldir joins the fray, Steward of Gondor and Ever Vigilant).\n\nPlaying Bilbo + Beravor in solo means massive drawing, even without Unexpected Courage. And using 3 core sets means I'm almost guaranteed and early Hemanarth, which is key to getting a mono-lore deck to work.\n\n\n\nYes good idea. I like this deck. I thinking about it in theory (still dont have HFG in my hand) As i say all quests what we have for now not design to play against them with 50 cards expert decks. Even in solo game you will win with this kind of decks easy. If you play coop with two 50 cards expert decks the game s booring and no challenge at all. Crazy draw provided by lore is something what is destroy all balance of the game now. Look like in the future adv pack should be some encounter cards to have some bonus for that. For exemple some enemies with boost attack for everycads in all players hand or something like this.\n\nBY the way what about HFG quest???? Is also beat easy with your deck? "}]}