{"url":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/","title":"Session reports - SiCK_Boy&#039;s adventures in Middle Earth","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497518","commentId":497518,"userName":"SiCK_Boy","timestamp":1310288181,"content":"I've decided to start posting session reports as I know I enjoy reading them from other players and I assume other people will enjoy reading them from me. One thing I want to try to do is combine the \"tactical\" reports (mechanical, step by step) with the more \"storytelling\" type of session reports we were seeing a lot of in the first few weeks after the game's release, but which have become rarer as time passed.\n\n \n\nHope you enjoy!\n\nLet me know if you see blatant mistakes and feel free to make suggestions and comments on the decks, the plays and the writing style!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497519","commentId":497519,"userName":"SiCK_Boy","timestamp":1310288228,"content":"Passage through Mirkwood - Session # 1\n\nAragorn: \"My lord, I'll be glad to take this message to the Lady of the Golden Wood. Too long has it been since I walked under the Malorn's boughts. Rest assured we shall proceed promptly.\"\n\nKing Thranduil: \"So be it, Dunedain. I'm counting on you and your companions to deliver this letter to Lady Galadriel herself as quickly as possible. I'm taking leave now; Dancing with the Stars is on tonight.\"\n\nAragorn: \"All right fellows! Let's go!\"\n\nDunhere: \"Huh... don't you think we should look at our equipment before leaving? Maybe take a few guards along with us? After all, this is the Mirkwood forest we're talking about.\"\n\nAragorn: \"Pfew... I know these woods like my own house. It'll be a piece of cake. Come on darling (grabing Eowyn by the hand), I'll show you some adventure along the way.\"\n\nDunhere: \"Yeah, but I thought you were homeless... and there might be spiders and orcs on the way... Hey guys, wait for me!\"\n\nRushing outside the elf king's palace, Dunhere barely caught up with Aragorn and Eowyn as they were taking a left turn along a little used trail.\n\nAragorn: \"This way. I know this Old Forest Road. I don't know why, but I always feel refreshed walking along this path. It should take us toward the mountains further inside the forest very soon. Dunhere, try to relax man! Eowyn will scout ahead if it may help you feel safer!\"\n\nDunhere: \"No need for her to go far! Spiders are already on us!\"\n\nAragorn, turning around: \"What? Ouch!\". The ranger's parry wasn't fast enough and the Forest Spider dropped on his back, biting his shoulder. Dunhere immediately striked at the monster, forcing it to retreat in the underbrush.\n\nDunhere: \"Will you believe me now? That creature won't leave us alone for sure. Who knows when it'll come back! I'll take the first watch tonight.\"\n\nEowyn: \"Did I miss anything boys? Oh, dear! Are you bleeding?\"\n\nArgagorn: \"Nah... just a scratch.\"\n\nDunhere spent most of the night jumping at the mearest sound and noise coming from the surrounding woods. With the light of dawn starting to show amongst the trees, he heard whistling further down the path. To his surprise, a jolly hobbit appeared around a bend in the road. Seeing the nervous warrior, he started laughing!\n\nWandering Took: \"What's wrong with you? Have you been attacked by a spider or what?\" Aragorn and Eowyn awoke at the noise. \"By the way, were you just about to have breakfast? Mind if I join you?\", added the hobbit.\n\nAragorn: \"See Dunhere. You wanted companions; fate is serving you one!\"\n\nDunhere: \"Looks to me like I'm the one that'll have to serve him... and probably more than one helping, if what I heard of the halflings is true. Still, it's better to have a small companion than no companion at all! But you want to be careful around here, Took: there are spiders in those woods.\"\n\nThey started ascending the mountains later that day, leaving the road behind them.\n\nAragorn: \"Unless I'm mistaken, we should come through the Necromancer's Pass if we keep going toward those peaks. It's a dangerous area where the air is stiffling and discouraging. But it's a shortcut to get through the woods and we'll soon be out of it.\"\n\nDunhere, murmuring: \"If the spiders don't catch up with us...\"\n\nAragorn: \"We only saw one! Stop being so negative about this trip! Look at Eowyn instead! She's plowing along and moving forward without complain.\"\n\nWandering Took: \"My cousin went through this pass once. He says it's full of orcs, nasty warriors and beastmasters.\"\n\nAragorn: \"Nonsense! If it was so dangerous, how come your cousin came out of it? I've had enough of this dark mood. Let's sing some happy songs and show some sp...\"\n\nDunhere, interrupting: \"SPIDER!!!\"\n\nThis time, Aragorn had time to react and he dived aside as a huge Forest Spider tried to drop on him again. The Took wasn't so fast, however, and he took a bite in the middle of the stomach before Dunhere could repel the monster with his sword. While Aragorn was standing up, a second spider bounced on him out of the bushes. He quickly brushed it aside (it was much smaller than the first one), but felt a tug around his neck as the creature was already fleeing on the other side of the road.\n\nAragorn: \"My stone! Help! It took my stone!\"\n\nWandering Took: \"Yeah, and it almost took my arm. Give us a break. By the way, thanks Dunhere.\"\n\nDunhere: \"Don't thank me yet. It'll be back. That's the same spider we met yesterday. It was still bearing the mark of my sword on its hind leg. I'm sure it followed us all day, waiting for the right time to attack. These woods are so unnatural... What wouldn't I give to be back on the plains of Rohan instead!\"\n\nAll day long and during the next, they kept making progress and climbing along the mountainous slopes under the shadow of the woods. An hour after lunch, they happened upon a sorry sign. A man was laying flat on his back, bearing the uniform of the citadel guards of Gondor.\n\nDunhere: \"So far from the White Tower he is. What may have lead him here? And how did he die? He doesn't seem to have any injury.\"\n\nAragorn bent over the stranger, hoping to confirm whether he was effectively dead or not. As soon as he reached with his hand, a black arrow fell from the sky and struck him in the right shoulder. Three orcs were running down the path from the mountain, howling with glee and brandishing long scimitars. Dunhere went ahead to meet them, but the leading orc, a huge creature standing at least a foot taller than the Rohirrim, dove under his strike and pushed him in the ditch beside the path. The following orc took a swipe at him. Dunhere rolled further away and sustained only a slash to his leg rather than being skewered on the rusty blade.\n\nBefore Aragorn could draw his own blade, another foe came at him: the Forest Spider chose this moment to drop from the trees. The ranger managed to parry its attack (the spider moved much slower, probably still injured from Dunhere's attack the day before), but he felt a shadow pass across his eyes. For a moment, he was certain the monster was more than a simple spider: some horrible creature from beyond time, maybe.\n\nAlerted by the noise, Eowyn and the Took came running back from their exploration of the surrounding area. Eowyn intoned a warrior's chant and at the sound of her voice, the orcs froze. Unseen by all, the \"dead\" guard also opened his eyes. He saw the spider trying to overwhelm the ranger next to him and reached out for his spear. He stabbed at the monster's belly, forcing his weapon deep inside the bulbous creature's body. The spider emitted a high pitched scream. Dunhere took the opportunity to stand up and racing toward his companions, he finished the spider with a mighty sword swipe. They all turned around toward the orcs, who were coming out of their daze. Seeing the odds turning against them, they chose to retreat. Aragorn went to pursue them, but Eowyn held him back.\n\nEowyn: \"Let them go for now. They won't surprise us another time, and you need to see to your injury. Also, I want to know who our new companion is\".\n\nAragorn was able to bandage his shoulder after taking out the arrow. He would have to use his left hand to hold his sword for a few days. As for the guard, he had absolutely no idea what happened to him.\n\nGuard of the Citadel: \"We were supposed to deliver a message to the elf king, me and my two companions. But we got lost in the woods and when we came in view of this moutain pass, the sun seemed to disappear and I fell into darkness. I only remember dark dreams until your clear voice pierced through the haze. 'Stand and fight', I heard you say from within my nightmare. Thank you again, milady. I shall repay my debt by escorting you along your way.\"\n\nWhen they made camp, Aragorn got some Athelas leaves to boil over the fire. A sweet fragrance surrounded them and even Dunhere felt calmer than he had for days. Having got rid of the spider and finding courage in their number, he stayed awake long into the night, discussing with Eowyn of their upcoming approach of the pass at the top of the mountain, which they expected to reach the next day. Aragorn fell in a daze and had a strange dream: in it, he met an escort of elves from the Golden Wood. They didn't say anything, simply marching and passing along, saluting him. However, when he awoke, he felt refreshed and more aware of his surroundings.\n\nThey reached the top of the mountain as planned early during the day. They had a good view of the surrounding lands, gathering a number of strategic information on their situation. Before plunging into the pass, they discussed their plans for the next steps of their quest. A low buzzing sound could be heard from beyond the pass, but they couldn't determine what it was.\n\nAs they entered the pass, Aragorn brought them all to a halt.\n\nAragorn: \"Look! Orc trail. Looks like we've caught up with our three 'friends' from yesterday. Follow me, we'll try to surprise them this time.\"\n\nThe ranger didn't have any trouble tracking the orcs. Soon enough, their heard the grunts and snarls that made up the orc speech coming from behind a small hill.\n\nAragorn: \"I'll meet them from this side, try to get at them from the other way and we'll flank them. They won't stand a chance!\"\n\nHe kept walking and arrived upon the three creatures who were arguing over some blackened piece of meat. They spotted the ranger as soon as he came into view and immediately jumped toward him, snarling and drawing their blades. He had a hard time parying their attacks, but they were clumsy and more often than not, they stood in each other's way. Dunhere and the Took had finally made it along the other side of the mountainous ridge and were coming to their companion's help. The orcs never heard them coming and quickly fell down to Dunhere's arrows and the hobbit's short sword.\n\nThey made their way across the Necromancer's Pass and were out of it, going down on the other side of the mountain and reentering the denser part of the woods before the end of the afternoon. The poor guard from Gondor had a moment of panic in the evening when a cloud of bats surrounded them, but Dunhere dispersed them quickly enough with the help of the Took.\n\nOn the morning of the next day, while they were eating breakfast, a man showed up, coming down from the pass.\n\nAragorn: \"Roger! What are you doing here?\"\n\nRoger the Northern Tracker: \"I had to find you. Wasn't easy, I arrived at the palace two days after you'd gone. I'm bringing sad news from Gondor, sir. The steward has passed away. I've been told the mantle of stewardship now rest on your shoulders.\"\n\nAragorn: \"Well, so long as the increased salary, why not! And you'll be coming with us, I hope? We're on our way to Lorien.\"\n\nThe company left soon after. The day was uneventful, but they kept feeling a presence, as if Eyes were constantly watching them from the woods. With the clouds gathering over them, it was almost as dark as twilight by the middle of the day. The buzzing sound they'd started to hear a few days ago kept pestering them, but they never saw the source.\n\nAt one point, Aragorn had them all stop.\n\nAragorn: \"See those tracks. Another orc. Looks like it may be accompanied by some beast, a wolf or other. We want to be careful.\"\n\nDunhere: \"That's a first. Not that I'll complain. I'll keep my bow ready. If we spot it, it won't stand a chance.\"\n\nThey did spot it later on, but Dunhere barely got time to shoot at it that it left in a hurry. They didn't press after the creature, confident that they'd catch up with it sooner or later.\n\nThey started to make good progress through the woods now that the company was getting along and finding its pace.\n\nGandalf: \"Well met, friends!\"\n\nAragorn: \"Gandalf! Always where you're the least expected. And, as usual, your presence is welcome. Hopefuly, you'll stay with us for a while.\"\n\nGandalf: \"Well, you know how it is. I show up, take care of some threat, and then I leave without trace.\"\n\nDunhere: \"Still, even if only temporary, your presence is more than welcome amongst us. By the way, who's your companion?\"\n\nGandalf: \"Never travel without an archer! Straight from the Silverlode to your company. I decided to bring you reinforcement. I figured you may need it before you exit the woods.\"\n\nEowyn: \"Welcome aboard, archer!\"\n\nWith Gandalf walking amongst them, they quickly went ahead with their quest. They fell into another orc ambush (the foolish monsters attacked Gandalf, as if their weapons could seriously injure him), but Roger the Northern Tracker defended the group from the orcs and Aragorn dispatched them, repaying them for all his misfortunes since leaving the palace.\n\n\"ZZZZZZZZZZZZZZZ-Tchak\"\n\nAragorn: \"Dude! What did you do that for?\"\n\nDunhere: \"Didn't you see them? Hummerhorns. I shot them before they could get any closer. The legend says that no single hero in the world can survive their sting. Why take the chance?\"\n\nWhile the two warriors were arguing, Gandalf left as quietly as he had appeared, leaving the Silverlode Archer to complete the quest with the company.\n\nTom the Silverlode Archer: \"By the way, we should be meeting my brother Tim later on. He was to wait for us near the fork in the road.\"\n\nTim effectively joined them and took part in a little skirmish they had with a patrol of orcs. Aragorn sustained another injury while fending off the monster's attacks. The proud ranger was starting to feel the pain and he walked with a limp the rest of the way.\n\nDunhere: \"I told you we should have made better preparation. I think you should leave the fighting to some of our companions until you feel better. We don't want lose you for ever. And by the way, while you were dealing with that patrol, that Dol Guldur Beastmaster we saw two days ago tried to sneak up on us, but I made it flee again. It won't survive another encounter, if I judge by the amount of blood left behind.\"\n\nThey finaly reached the Fork in the Road.\n\nDunhere: \"Well, where do we go now? I'm sure one of these paths leads to unnamable dangers, but which one?\"\n\nLorien Guide: \"Allow me to help you, sir.\"\n\nDunhere: \"Who the hell are you?\"\n\nLorien Guide: \"A guide. You're trying to find your way, I may help you.\"\n\nDunhere: \"Cool then. So, which way?\"\n\nLorien Guide: \"I recommend going along the left side. It's the path that leads toward Beorn's home. The path is long, but smooth and well cleared. The only problem is the huge orc chieftain who guards the road a few miles from here.\"\n\nDunhere: \"We've killed our share of orcs already. One more won't be a problem. Let's go!\"\n\nEffectively, after an hour of walking along the path, they saw a huge orc, at least seven feet tall and holding a wicked looking axe in his hands, barring the way.\n\nChieftan Ufthak: \"You shall not pass!\"\n\nRoger the Norther Tracker: \"Hello, sir. Will you accept a challenge? If you kill me, my friends will turn back and not bother you. If I manage to dispatch you, well, you won't care about whether we pass or not, will you?\"\n\nChieftan Ufthak: \"Whahaha! You don't stand a chance. En garde!\"\n\nThe orc started circling around with the tracker, the fighters exchanging blows and studying each other. The tracker got injured and was beginning to lose ground against his massive opponent.\n\nAragorn: \"Guys, screw this challenge. FIRE!\"\n\nHe threw is dagger at the orc while the two archers and Dunhere shot it down. Never understanding what happened, the chieftain fell down in a widening pool of blood.\n\nDuring the lunch break, Aragorn searched amongst his backpack and uttered a cry of surprise: \"My stone! I thought it was lost!\"\n\nDunhere: \"I bet you had it there all along.\"\n\nAragorn: \"No, I swear the shadow spider took it.\"\n\nDunhere: \"Well, how could that be. I thought this jewel was unique.\"\n\nThey let this mistery be and kept advancing along the path, Aragorn leading the way with the green stone shining proudly around his neck.\n\nSuddenly, out of nowhere, lighting fell out of the sky. Aragorn was miraculously spared, but Eowyn, Roger, the guide and the guard all sustained injuries. The poor Northern Tracker was barely able to stand up.\n\nRoger the Northern Tracker: \"Guys, I think I'll take it easy for a few hours. I'll leave the exploration to you until I feel strength coming back to my legs.\"\n\nAragorn: \"What the heck just happened?\"\n\nEowyn: \"The Necromancer. He must have been angered at our disruption of his pass earlier. His arm is long and can reach far.\"\n\nThey came across the dead body of the Dol Guldur Beastmaster not far from there.\n\nDunhere: \"Oh yeah, forgot to tell you. I finally killed it. Dumb bastard kept staying away, maybe thinking we were not seeing it coming. Well I was.\"\n\nAragorn: \"Finally! Hey everyone, see the gate over there? That's the end of our quest and the end of those **** woods!\"\n\nEveryone: \"HOORAY!\"\n\nNow for the technical report:\n\nDecklist (built from 3 Core Sets)\n\nHeroes\n\n * Aragorn\n * Eowyn\n * Dunhere\n\nAllies - Leadership\n\n * 3 x Faramir\n * 1 x Guard of the Citadel\n * 2 x Silverlode Archer\n\nAttachments - Leadership\n\n * 3 x Celebrian's Stone\n * 3 x Steward of Gondor\n\nEvents - Leadership\n\n * 2 x Ever Vigilant\n * 2 x Grim Resolve\n * 3 x Sneak Attack\n * 1 x Valiant Sacrifice\n\nAllies - Spirit\n\n * 3 x Lorien Guide\n * 3 x Northern Tracker\n * 3 x Wandering Took\n\nAttachments - Spirit\n\n * 3 x Unexpected Courage\n\nEvents - Spirit\n\n * 3 x A Test of Will\n * 2 x Dwarven Tomb\n * 1 x Fortune or Fate\n * 3 x Hasty Stroke\n * 3 x Stand and Fight\n * 3 x The Galadhrim's Greetings\n\nNeutral - Allies\n\n * 3 x Gandalf\n\nStarting hand: Guard of the Citadel, Celebrian's Stone, Grim Resolve, Fortune or Fate, Stand and Fight, The Galadhrim's Greetings\n\nNo mulligan.\n\nStaging area contains Old Forest Road and Forest Spider. Starting threat is 29.\n\nTurn 1: Collect resources (Aragorn = 1, Eowyn = 1, Dunhere = 1); Draw Sneak Attack. Quest with Aragorn and Eowyn; Reveal Mountains of Mirkwood; Score 1 progress on quest 1B (1/8). Travel to Old Forest Road; Ready Aragorn. Engage Forest Spider. Aragorn defends against Forest Spider; Shadow card is Old Forest Road (no effect); Aragorn takes 1 damage (1/5); Dunhere attacks Forest Spider; Forest Spider takes 1 damage (1/4). Threat increases to 30.\n\nTurn 2: Collect resources (Aragorn = 2, Eowyn = 2, Dunhere = 2); Draw Wandering Took. Play Celebrian's Stone on Aragorn (0 resource left on Aragorn); Play Wandering Took (0 resource left on Eowyn). Quest with Aragorn and Eowyn; Reveal Necromancer's Pass; Score 3 progress on Old Forest Road (3/3, explored). Travel to Mountains of Mirkwood; Reveal Dol Guldur Beastmaster. Engage no ennemy. Wandering Took defends against Forest Spider; Shadow card is Forest Spider (discard Celebrian's Stone from Aragorn); Wandering Took takes 1 damage (1/2); Dunhere attacks Forest Spider; Forest Spider takes 1 damage (2/4). Threat increases to 31.\n\nTurn 3: Collect resources (Aragorn = 1, Eowyn = 1, Dunhere = 3); Draw Silverlode Archer. Quest with Aragorn, Eowyn and Wandering Took; ready Aragorn (0 resource left on Aragorn); Reveal Dol Guldur Orcs; Aragorn takes 2 damages (3/5); Discard Guard of the Citadel to increase Eowyn's Willpower; Score 1 progress on Mountains of Mirkwood (1/3). No travel. Engage Dol Guldur Orcs. Dol Guldur Orcs attack undefended; Shadow card is Caught in a Web (no effect); Dunhere takes 2 damages (2/4); Aragorn defends against Forest Spider; Shadow card is Ungoliant's Spawn (Threat increases to 35); Aragorn takes no damage; Play Stand and Fight on Guard of the Citadel (0 resource left on Eowyn; 2 resources left on Dunhere); Dunhere and Guard of the Citadel attack Forest Spider; Forest Spider takes 2 damages (4/4, dead). Threat increases to 36.\n\nTurn 4: Collect resources (Aragorn = 1, Eowyn = 1, Dunhere = 3); Draw The Galadhrim's Greetings. Play The Galadhrim's Greetings (0 resource left on Eowyn; 1 resource left on Dunhere); Threat decreases to 30. Quest with Aragorn, Eowyn and Guard of the Citadel; Ready Aragorn (0 resource left on Aragorn); Reveal Hummerhorns; Discard Grim Resolve to increase Eowyn's Willpower; Score 2 progress on Mountains of Mirkwood (3/3, explored); Look at the top 5 cards (Faramir, Steward of Gondor, Valiant Sacrifice, Dwarven Tomb, Stand and Fight) and select Steward of Gondor. Travel to Necromancer's Pass; Randomly discard Sneak Attack and Fortune or Fate. Engage no ennemy. Aragorn defends against Dol Guldur Orcs; Shadow card is Forest Spider (no attachment to discard); Aragorn takes no damage; Dunhere and Wandering Took attack Dol Guldur Orcs; Dol Guldur Orcs takes 3 damages (3/3, dead). Threat increases to 31.\n\nTurn 5: Collect resources (Aragorn = 1, Eowyn = 1, Dunhere = 2); Draw Stand and Fight. Quest with Aragorn, Eowyn and Guard of the Citadel; Reveal Black Forest Bats; Remove Guard of the Citadel from the quest; Score 2 progress on Necromancer's Pass (2/2, explored). No travel. Engage Black Forest Bats. Wandering Took defends against Black Forest Bats; Shadow card is Necromancer's Pass (no effect); Wandering Took takes no damage; Dunhere attacks Black Forest Bats; Black Forest Bats takes 2 damages (2/2; dead). Threat increases to 32.\n\nTurn 6: Collect resources (Aragorn = 2, Eowyn = 2, Dunhere = 3); Draw Northern Tracker. Play Steward of Gondor on Aragorn (0 resource left on Aragorn); Exhaust Steward of Gondor (2 resources left on Aragorn); Play Northern Tracker (0 resource left on Eowyn; 1 resource left on Dunhere); Quest with Eowyn, Guard of the Citadel and Northern Tracker; Reveal Eyes of the Forest; Discard Stand and Fight and The Galadhrim's Greetings; Score 3 progress on quest 1B (4/8). No travel. Engage no ennemy. Dunhere attacks Dol Guldur Beastmaster in staging area; Dol Guldur Beastmaster takes 2 damages (2/5). Threat increases to 33.\n\nTurn 7: Collect resources (Aragorn = 3, Eowyn = 1, Dunhere = 2); Draw Gandalf. Exhaust Steward of Gondor (5 resources left on Aragorn); Play Silverlode Archer (2 resources left on Aragorn); Play Gandalf (0 resource left on Aragorn; 0 resource left on Eowyn; 0 resource left on Dunhere); Threat decreases to 28. Quest with Eowyn, Gandalf and Guard of the Citadel; Reveal Dol Guldur Orcs; Gandalf takes 2 damages (2/4); Score 4 progress on quest 1B (8/8, completed). No travel. Engage Dol Guldur Orcs. Northern Tracker defends against Dol Guldur Orcs; Shadow card is Mountains of Mirkwood (no effect); Northern Tracker takes no damage; Aragorn attacks Dol Guldur Orcs; Dol Guldur Orcs takes 3 damages (3/3, dead); Dunhere attacks Hummerhorns in staging area; Hummerhorns takes 3 damages (3/3, dead). Discard Gandalf; Threat increases to 29.\n\nTurn 8: Collect resources (Aragorn = 1; Eowyn = 1; Dunhere = 1); Draw Silverlode Archer. Exhaust Steward of Gondor (3 resources left on Aragorn); Play Silverlode Archer (0 resource left on Aragorn). Quest with Eowyn, Guard of the Citadel and Northern Tracker; Reveal East Blight Patrol; Score 1 progress on quest 2B (1/2). No travel. Engage East Blight Patrol. Aragorn defends against East Blight Patrol; Shadow card is Dol Guldur Beastmaster (no effect); Aragorn takes 1 damage (4/5); Silverlode Archer and Wandering Took attacks East Blight Patrol; East Blight Patrol takes 2 damages (2/2; dead); Dunhere attacks Dol Guldur Beastmaster in staging area; Dol Guldur Beastmaster takes 2 damages (4/5). Threat increases to 30.\n\nTurn 9: Collect resources (Aragorn = 1; Eowyn = 2; Dunhere = 2); Draw Lorien Guide. Exhaust Steward of Gondor (3 resources left on Aragorn); Play Lorien Guide (0 resource left on Eowyn; 1 resource left on Dunhere). Quest with Aragorn, Eowyn, Guard of the Citadel and Lorien Guide; Ready Aragorn (2 resources left on Aragorn); Reveal Chieftan Ufthak; Score 4 progress on quest 2B (5/2, completed); Move to random quest 3B Beorn's Path. No travel. Engage Chieftan Ufthak. Northern Tracker defends against Chieftan Ufthak; Shadow card is Forest Gate (no effect); Northern Tracker takes 1 damage (1/3); Aragorn, Dunhere, Silverlode Archer (#1) and Silverlode Archer (#2) attack Chieftan Ufthak; Chieftan Ufthak takes 6 damages (6/6, dead). Threat increases to 31.\n\nTurn 10: Collect resources (Aragorn = 3; Eowyn = 1; Dunhere = 2); Draw Celebrian's Stone. Exhaust Steward of Gondor (5 resources left on Aragorn); Play Celebrian's Stone on Aragorn (3 resources left on Aragorn). Quest with Aragorn, Eowyn, Lorien Guide, Guard of the Citadel and Northern Tracker; Ready Aragorn (2 resources left on Aragorn); Reveal The Necromancer's Reach; Eowyn takes 1 damage (1/3); Lorien Guide takes 1 damage (1/2); Guard of the Citadel takes 1 damage (1/2); Northern Tracker takes 1 damage (2/3); Score 9 progress on quest 3B (9/10). No travel. Engage no ennemy. Dunhere attacks Dol Guldur Beastmaster in staging area; Dol Guldur Beastmaster takes 2 damages (6/5, dead). Threat increases to 32.\n\nTurn 11: Collect resources (Aragorn = 3; Eowyn = 2; Dunhere = 3); Draw A Test of Will. Exhaust Steward of Gondor (5 resources left on Aragorn). Quest with Aragorn, Eowyn, Dunhere, Silverlode Archer (#1), Silverlode Archer (#2), Northern Tracker, Lorien Guide, Wandering Took and Guard of the Citadel; Ready Aragorn (4 resources left on Aragorn); Reveal Forest Gate; Score 13 progress (22/10; completed).\n\nFinal score: 32 threat + 0 dead hero + 7 damages - 9 victory points (Hummerhorns; Chieftan Ufthak) = 30 points in 11 turns.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497585","commentId":497585,"userName":"Glaurung","timestamp":1310301517,"content":"Very cool. That what i like about this game. Any other ccg tcg i use to play not make the people make some kind of novels. This game do it.\n\nSo lets hope the game will be ok. All now in FFG hands.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497602","commentId":497602,"userName":"servant of the secret fire","timestamp":1310306109,"content":"Glaurung said:\n\nVery cool. That what i like about this game. Any other ccg tcg i use to play not make the people make some kind of novels. This game do it.\n\nSo lets hope the game will be ok. All now in FFG hands.\n\n \n\n\n\nI am on the other side.If this was a DND card game it would be a good game to make stories but now i can't read more than 2 lines.I quit reading wen i see for example Denethor away from Gondor with the palandir in his hands being outside questing with Frodo???That ruines Tolkien's lore and for me makes a very bad story.Ofcourse this is not Sickboy's fault (or any other who likes write stories for this game).Tolkien made a perfect story and it is very hard to make your own story without braking the lore.\n\nSick_boy@\n\nI raid a little and the way the characters talk (for example Aragorn) made me think that this is not Aragorn from Lotr but someone else.Especialy wen he speaks to Eowyn and use the ward darling.My lady, is a ward Aragorn should use.He is a noble man who speaks to a noble woman.Darling is not the right ward to use.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497609","commentId":497609,"userName":"Glaurung","timestamp":1310307417,"content":"servant of the secret fire said:\n\nGlaurung said:\n\n \n\nVery cool. That what i like about this game. Any other ccg tcg i use to play not make the people make some kind of novels. This game do it.\n\nSo lets hope the game will be ok. All now in FFG hands.\n\n \n\n \n\n \n\nI am on the other side.If this was a DND card game it would be a good game to make stories but now i can't read more than 2 lines.I quit reading wen i see for example Denethor away from Gondor with the palandir in his hands being outside questing with Frodo???That ruines Tolkien's lore and for me makes a very bad story.Ofcourse this is not Sickboy's fault (or any other who likes write stories for this game).Tolkien made a perfect story and it is very hard to make your own story without braking the lore.\n\nSick_boy@\n\nI raid a little and the way the characters talk (for example Aragorn) made me think that this is not Aragorn from Lotr but someone else.Especialy wen he speaks to Eowyn and use the ward darling.My lady, is a ward Aragorn should use.He is a noble man who speaks to a noble woman.Darling is not the right ward to use.\n\n \n\n\n\nHey Servant command!!! That was good story!!! Dont be so pedant!!!! But anyway now i know you are the Bilbo player. You follow the book to much.\n\nThis is cool about this the game. We create our own story in the Middle earth.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497620","commentId":497620,"userName":"servant of the secret fire","timestamp":1310308492,"content":"Glaurung said:\n\n \n\n \n\n \n\nHey Servant command!!! That was good story!!! Dont be so pedant!!!! But anyway now i know you are the Bilbo player. You follow the book to much.\n\nThis is cool about this the game. We create our own story in the Middle earth.\n\n \n\n\n\nDon't worry mate i am not saying somethink bad about sickboy and i know that many people like to make stories based on their games but as you said i follow the books too much and i am a Middle-Earth geek so i don't realy like alternative stories for Middle-Earth.\n\nAnyway good job sick boy and i am glad you enjoy the game so much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497690","commentId":497690,"userName":"SiCK_Boy","timestamp":1310316752,"content":"I'm glad you saw that the Aragorn I portrayed wasn't exactly the same as the one we all loved in the books. I was afraid it would be too subtle.\n\nObviously, I went ahead with an arrogant / foolish Aragorn personality and made Dunhere the more heroic member of the trio. There's no point in trying to tie those stories too much with \"canon\" lore. Instead, I tried to make fun / use it as much as I could while having the characters reflect on the game mechanic from an \"in world\" perspective (such as the Hummerhorns comment).\n\nI think my main idea for Aragorn's attitude started with my decision not to take a mulligan. This hand was bad; I had no good play to make and should have taken a mulligan. Anything else would have been at least just as good and almost certainly better. When I play this deck, I always consider Aragorn to be my primary hero (he gets Steward of Gondor, he gets Unexpected Courage, he's part of questing and fighting, etc.). Thus I decided he was the one that chose not to take a mulligan, making this quest much harder than it should be (I usualy get through it in less than seven turns). It did end up being the driving point of my storytelling.\n\nBy the way, if anyone has a better format / structure to suggest for the technical part of the report (I used a single paragraph per round, breaking down phases by a . and using ; to separate actions within a given phase, I'd like to hear it. I guess I could further break it down in paragraph, but the post is already almost a full page long so..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=497968","commentId":497968,"userName":"ClydeCloggie","timestamp":1310371057,"content":"Nice report, good to have both the technical and fancy version. I prefer the technical report to see how others play the game and pick up tricks.\n\nOne Q: on turn 10, why didn't you use Eowyn's ability to score the final progress point needed and end the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=498271","commentId":498271,"userName":"SiCK_Boy","timestamp":1310398229,"content":"I didn't have any card left in hand at this point. And since the card I drew was Celebrian's Stone, I needed to play it to boost the willpower for questing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=500477","commentId":500477,"userName":"Mestrahd","timestamp":1310812967,"content":"I don't have the card in front of me, but can you use Stand and Fight in any phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=500502","commentId":500502,"userName":"servant of the secret fire","timestamp":1310818472,"content":"Mestrahd said:\n\nI don't have the card in front of me, but can you use Stand and Fight in any phase?\n\n\n\nYes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=500687","commentId":500687,"userName":"Mighty Jim 83","timestamp":1310874423,"content":"SiCK_Boy said:\n\nPassage through Mirkwood - Session # 1\n\nDuring the lunch break, Aragorn searched amongst his backpack and uttered a cry of surprise: \"My stone! I thought it was lost!\"\n\nDunhere: \"I bet you had it there all along.\"\n\nAragorn: \"No, I swear the shadow spider took it.\"\n\nDunhere: \"Well, how could that be. I thought this jewel was unique.\"\n\nThey let this mistery be and kept advancing along the path, Aragorn leading the way with the green stone shining proudly around his neck.\n\n \n\n\n\nNice!\n\nAlso, good to know that the Northern Tracker's name is Roger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=500806","commentId":500806,"userName":"SiCK_Boy","timestamp":1310902323,"content":"Journey Along The Anduin - Session # 1\n\n Gimli: \"We put all of our economies into this project. It's got to work!\"\n\nThalin: \"Well, maybe we shouldn't have got rid of Bob the way we did. We could have given him back his share at least.\"\n\nGimli: \"Shhh! Here's our first client!\"\n\nEowyn: \"Good morning, gentle sirs. I heard there was a new 'extreme adventure descent' being offered along the Anduin. Am I at the right place to sign up?\"\n\nGimli: \"You certainly are, milady. We'll take you from here to the Argonath for a modest fee, allowing you to enjoy the pleasures of fast-paced rafting experience in total safety with my collegue and myself taking place aboard your raft. And for a little extra, we can arrange transportation back here via an overnight caravan.\"\n\nEowyn: \"Wonderful! Where do I sign? And by the way, will it be a problem if some of my horse-trainers follow us along the bank?\"\n\nGimli: \"No problem at all, if they can keep pace. We may even accommodate a few onboard the raft.\"\n\nThalin: \"Just come along, we'll embark on the pier further down. We just need to cross the East Bight and we'll be ready to take off.\"\n\nBob the Hill Troll: \"Rarghhhh!\"\n\nEowyn: \"What's that?\"\n\nGimli: \"What's what? I didn't hear anything.\"\n\nBob the Hill Troll: \"Gimli! I told you not to try to cut me off!\"\n\nGimli: \"Goddam'it, Bob! Can't we try to solve our different later? Don't you see we have a paying customer here?\"\n\nEowyn, murmuring to Thalin: \"Who is Bob, exactly?\"\n\nThalin, also murmuring: \"A former associate of us. We changed our mind after he tried to get his 'East Gang' involved in our business. But I think he wasn't totally satisfied with the arrangement Gimli made with him; something to do with his severance pay.\"\n\nGimli: \"Bob, you have 3 seconds to move and let us through. Otherwise...\"\n\nBob the Hill Troll: \"If that's how you want it... East Gang, attack!\" Coming up from nowhere, numerous orcs started to show up.\n\nGimli: \"Thalin, my axe! Miss, can you hold on to this horn for me? Just blow a note if you see we're getting overwhelmed. It may give them second thought. And if your horse-breakers are around, we could use their help.\"\n\nEowyn, nervous: \"Ok, sure... Rohirrim! Come along, we need help!\"\n\nA furious fight ensued across the East Bight. The two dwarves did their best to sustain the press of the East Gang, using feints left and right. Gimli even managed to knock down Bob the Hill Troll, but the numerous orcs kept the pressure on them. The poor Westfold Horse-Breakers were being thrown in harm's way to give breaks to the dwarves. Thalin was kept busy defending against Dol Guldur Orcs.\n\nIn the end, even with the unexpected assistance from a Gondorian Spearman looking for a quick way home after a vacation in the Mirkwood forest, they had to give up. The final straw was the appearance of Bob's favorite dog pack, a ferocious group of Wargs that kept jumping out of reach of the dwarves when they tried to counterstrike.\n\nGimli: \"Miss, miss, don't leave! We'll sort things out with those ruffians and we'll offer you a free descent along the Great River to compensate for your trouble. Just come back next week; we'll do it then!\"\n\nThalin, panting and defeated: \"I told you we should have given him back his share...\"\n\nNow for the technical report:\n\nDecklist (built from 3 Core Sets and 1 Hunt for Gollum Adventure Pack)\n\nHeroes\n\n * Gimli\n * Thalin\n * Eowyn\n\nAllies - Tactics\n\n * 2 x Beorn\n * 3 x Gondorian Spearman\n\nAttachments - Tactics\n\n * 3 x Blade of Gondolin\n * 3 x Citadel Plate\n * 2 x Dwarven Axe\n * 3 x Horn of Gondor\n\nEvents - Tactics\n\n * 3 x Feint\n * 3 x Quick Strike\n * 3 x Swift Strike\n\nAllies - Spirit\n\n * 2 x Lorien Guide\n * 2 x Northern Tracker\n * 3 x Westfold Horse-Breaker\n\nAttachments - Spirit\n\n * 3 x Unexpected Courage\n\nEvents - Spirit\n\n * 3 x A Test of Will\n * 3 x Hasty Stroke\n * 3 x Stand and Fight\n * 3 x The Galadhrim's Greetings\n\nAllies - Neutral\n\n * 3 x Gandalf\n\nStarting hand: Beorn, Dwarven Axe, Feint, Westfold Horse-Breaker, Hasty Stroke, Stand and Fight.\n\nNo mulligan.\n\nStaging area contains The East Bight and Hill Troll. Starting threat is 29.\n\nRound 1: Collect resources (Gimli = 1, Thalin = 1, Eowyn = 1); Draw Feint. Play Dwarven Axe on Gimli (0 resource left on Gimli, 0 resource left on Thalin). Quest with Thalin and Eowyn; Reveal Dol Guldur Beastmaster; Dol Guldur Beastmaster takes 1 damage; Score 1 progress on quest 1B (1/8). Travel to The East Bight. Engage Hill Troll. Gimli defends against Hill Troll; Shadow card is Evil Storm (no effect); Gimli takes 4 damages (4/5). Threat increases to 30.\n\nRound 2: Collect resources (Gimli = 1, Thalin = 1, Eowyn = 2); Draw Horn of Gondor. Play Westfold Horse-Breaker (0 resource left on Eowyn); Play Horn of Gondor on Eowyn (0 resource left on Thalin). Quest with Thalin, Eowyn and Westfold Horse-Breaker; Reveal Dol Guldur Orcs; Dol Guldur Orcs takes 1 damage (1/3); Thalin takes 2 damages (2/4); Score 2 progress on The East Bight (2/6). No travel. Engage Dol Guldur Orcs. Play Feint on Hill Troll (0 resource left on Gimli; Shadow card was not given [forgot to give one even if Hill Troll wasn't attacking]); Discard Westfold Horse-Breaker to ready Thalin; 1 resource left on Eowyn (Horn of Gondor); Thalin defends against Dol Guldur Orcs; Shadow card is Eastern Crows (+1 Attack); Play Hasty Stroke to cancel shadow effect (0 resource left on Eowyn); Thalin takes no damage; Gimli attacks Hill Troll; Hill Troll takes 5 damages (5/9). Threat increases to 31.\n\nRound 3: Collect resources (Gimli = 1, Thalin = 1, Eowyn = 1); Draw Westfold Horse-Breaker. Quest with Eowyn; Reveal Dol Guldur Beastmaster; Score no progress. No travel. Engage no enemy. Play Feint on Hill Troll (0 resource left on Gimli; Shadow card was not given [forgot to give one even if Hill Troll wasn't attacking]); Thalin defends against Dol Guldur Orcs; Shadow card is Goblin Sniper (no effect); Thalin takes no damage; Gimli attacks Hill Troll; Hill Troll takes 5 damages (10/9; dead). Threat increases to 32.\n\nRound 4: Collect resources (Gimli = 1, Thalin = 2, Eowyn = 2); Draw Gondorian Spearman. Play Gondorian Spearman (0 resource left on Gimli, 1 resource left on Thalin); Play Westfold Horse-Breaker (0 resource left on Eowyn). Quest with Thalin, Eowyn and Westfold Horse-Breaker; Reveal The East Bight; Score 1 progress on The East Bight (3/6). No travel. Engage Dol Guldur Beastmaster (the one just revealed with full life). Discard Westfold Horse-Breaker to ready Thalin; 3 resources left on Eowyn (Horn of Gondor); Gondorian Spearman defends against Dol Guldur Beastmaster; Dol Guldur Beastmaster takes 1 damage (1/5); Shadow cards are Goblin Sniper and Treacherous Fog (no effect); Gondorian Spearman takes 2 damages (2/1; dead); 4 resources left on Eowyn (Horn of Gondor); Thalin defends against Dol Guldur Orcs; Shadow card is Chieftan Ufthak (no effect); Thalin takes no damage; Gimli attacks Dol Guldur Beastmaster; Dol Guldur Beastmaster takes 7 damages (8/5; dead); Play Stand and Fight on Westfold Horse-Breaker (2 resources left on Eowyn); Discard Westfold Horse-Breaker to ready Gimli; 3 resources left on Eowyn (Horn of Gondor); Gimli attacks Dol Guldur Orcs; Dol Guldur Orcs takes 8 damages (9/3; dead). Threat increases to 33.\n\nRound 5: Collect resources (Gimli = 1, Thalin = 2, Eowyn = 4); Draw Westfold Horse-Breaker. Play Westfold Horse-Breaker (2 resources left on Eowyn). Quest with Thalin, Eowyn and Westfold Horse-Breaker; Reveal Wargs; Wargs takes 1 damage (1/3); Score 1 progress on The East Bight (4/6). No travel. Engage Wargs. Discard Westfold Horse-Breaker to ready Thalin; 3 resources left on Eowyn (Horn of Gondor); Thalin defends against Wargs; Shadow card is Marsh Adder (no effect); Thalin takes 1 damage (3/4); Wargs returns to staging area. Threat increases to 34.\n\nRound 6: Collect resources (Gimli = 2, Thalin = 3, Eowyn = 4); Draw Hasty Stroke.\n\nAt this point, I decided to concede. Facing two enemies with attack 3, I was bound to lose one of my heroes this round and there was no way I could come back from that.\n\nFinal score: Defeat in 6 rounds.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=500830","commentId":500830,"userName":"SiCK_Boy","timestamp":1310907830,"content":"Journey Along The Anduin - Session # 2 \n\nEowyn: \"Here I am, as agreed upon. I hope things will go better this time. I really want to do this descent!\"\n\nGimli: \"But certainly. We apologize once more for the inconvenients. We've settled on a different starting point this time: the Brown Lands. They're easy enough to get through and we should be able to escape last time's troubles.\"\n\nThalin, from the corner of his mouth: \"I though Bob said he'd find us anywhere along the banks. Are you sure your plan will work?\"\n\nGimli, also murmuring: \"Shh. Yes, things will be fine. Trust me.\" Turning toward Eowyn: \"Will any more of your horse-breakers accompany us this time?\"\n\nEowyn: \"I'm not sure. Their union made a lot of noise after the fight... apparently, they didn't like being treated as 'canon-fodder' for the orcs. There may still be some that will show up later.\"\n\nGimli: \"Well, there's more than enough room on the raft if they change their mind. Let's go!\"\n\nBob the Hill Troll: \"Rarrghhhh!\"\n\nThalin: \"Not again!\"\n\nBob the Hill Troll: \"Where do you think you're going, Gimli? You still owe me. No deal, no going to the river.\"\n\nGimli: \"Screw you, Bob! You came alone this time, I see. Big mistake!\"\n\nDrawing his Blade of Gondolin, he jumped forward to attack the Hill Troll.\n\nBob the Hill Troll: \"Alone? Big mistake for you! I've got a new associate now... and his reach is far.\"\n\nA bolt of lightning fell from the sky, singing Eowyn's hairs.\n\nEowyn: \"He must have enlisted the help of the Necromancer. I though your business was professional and you'd solved your different with Bob. You lied!\"\n\nGimli: \"We'll discuss your reclamation once we get rid of this troll, if you don't mind.\"\n\nGimli pressed against the troll but got slammed back.\n\nBob the Hill Troll: \"Wargs! Attack!\".\n\nThalin: \"Not those dogs again! Gimli, I'm not about to forget this one!\" Thalin joined the fray, helping Gimli attack the troll.\n\nWestfold Horse-Breaker union leader: \"There you are, Mrs. Eowyn. We have to talk. Two of my members are still in the hospital and here you are, enjoying your vacations while they suffer? I demand paid sick leave for both of them for the next 3 weeks!.. Hey, are you listening to what I say?\"\n\nThe poor union leader didn't have a chance to insist on the issue as he was squashed under the troll's boots.\n\nEowyn: \"I think this isn't the last I hear from that union...\"\n\nGimli quickly striked at the Wargs before they could join the fray. He killed one, but Thalin had to jump in front of the troll to protect Gimli's back. Knocked unconscious, the poor dwarf would have died there if Eowyn hadn't grabbed him by the arms.\n\nEowyn: \"Enough Gimli. You're no match for this troll. Retreat before he hurts you more!\"\n\nBob the Hill Troll: \"Don't forget Gimli! You won't get to the river until you're ready to negociate in good faith. I've got my eye on you, you little worm. Go take care of your loser friend and return not until you've got my money and a good extra.\"\n\nNow for the technical report:\n\nDecklist (built from 3 Core Sets and 1 Hunt for Gollum Adventure Pack)\n\nHeroes\n\n * Gimli\n * Thalin\n * Eowyn\n\nAllies - Tactics\n\n * 2 x Beorn\n * 3 x Gondorian Spearman\n\nAttachments - Tactics\n\n * 3 x Blade of Gondolin\n * 3 x Citadel Plate\n * 2 x Dwarven Axe\n * 3 x Horn of Gondor\n\nEvents - Tactics\n\n * 3 x Feint\n * 3 x Quick Strike\n * 3 x Swift Strike\n\nAllies - Spirit\n\n * 2 x Lorien Guide\n * 2 x Northern Tracker\n * 3 x Westfold Horse-Breaker\n\nAttachments - Spirit\n\n * 3 x Unexpected Courage\n\nEvents - Spirit\n\n * 3 x A Test of Will\n * 3 x Hasty Stroke\n * 3 x Stand and Fight\n * 3 x The Galadhrim's Greetings\n\nAllies - Neutral\n\n * 3 x Gandalf\n\nStarting hand: Beorn, Gondorian Spearman, Blade of Gondolin, 2 x Quick Strike, Lorien Guide.\n\nMulligan into Blade of Gondolin, 2 x Quick Strike, Swift Strike, Westfold Horse-Breaker, A Test of Will.\n\nStaging area contains The Brown Lands and Hill Troll. Starting threat is 29.\n\nRound 1: Collect resources (Gimli = 1, Thalin = 1, Eowyn = 1); Draw Hasty Stroke. Quest with Eowyn; Reveal The Necromancer's Reach; Eowyn takes 1 damage (1/3); Threat increases to 31. Travel to The Brown Lands; Score 1 progress on The Brown Lands (1/1, explored). Engage Hill Troll; Gimli defends against Hill Troll; Shadow card is Gladden Fields (no effect); Gimli takes 4 damages (4/5). Threat increases to 32.\n\nRound 2: Collect resources (Gimli = 2, Thalin = 2, Eowyn = 2); Draw Unexpected Courage. Play Westfold Horse-Breaker (0 resources left on Eowyn). Quest with Eowyn; Reveal Wargs; Score 2 progress on Quest 1B (2/8). No travel. Engage Wargs. Play Quick Strike to attack Wargs (engage Gimli, 1 resource left on Gimli); Wargs takes 5 damages (5/3; dead). Westfold Horse-Breaker defends against Hill Troll; Shadow card is Eastern Crows (+1 Attack); Westfold Horse-Breaker takes 6 damages (6/1; dead; threat increases to 37). Threat increases to 38.\n\nRound 3: Collect resources (Gimli = 2, Thalin = 3, Eowyn = 1); Draw Unexpected Courage. Play Blade of Gondolin on Gimli (2 resources left on Thalin). Quest with Eowyn; Reveal The Brown Lands; Threat increases to 39. Travel to The Brown Lands; Score 1 progress on The Brown Lands (1/1; explored). Engage no enemy. Thalin defends against Hill Troll; Play Swift Strike (0 resource left on Thalin); Hill Troll takes 2 damages (2/9); Shadow card is Misty Mountain Goblins (remove 1 progress from Quest 1B [1/8]); Thalin takes 4 damages (4/4; dead); Gimli attacks Hill Troll, Hill Troll takes 3 damages (5/9). Threat increases to 40.\n\nRound 4: Collect resources (Gimli = 3, Eowyn = 2); Draw The Galadhrim's Greetings. Play Unexpected Courage on Gimli (0 resource left on Eowyn). Quest with Eowyn; Reveal The Necromancer's Reach; Eowyn takes 1 damage (2/3).\n\nAt this point, I decided to concede. I couldn't deal with another Hill Troll attack.\n\nFinal score: Defeat in 4 rounds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49745-session-reports-sick_boys-adventures-in-middle-earth/?do=findComment&comment=500931","commentId":500931,"userName":"SiCK_Boy","timestamp":1310935498,"content":"Journey Along The Anduin - Session # 3\n\nThalin: \"Wow, she's back! That woman is as hard-headed as any dwarf I've ever known.\"\n\nGimli: \"Don't you go spooking her away now. If we can deliver on our product, she'll make all of our publicity for us.\"\n\nThalin: \"But we still haven't solved our problems with Bob!\"\n\nGimli: \"We were unlucky the last times. I'm sure that old fellow will show up this time; after all, he almost always does. And if not, I've enlisted an old friend from the other side of the forest to help us. We'll get rid of Bob and his gang soon.\"\n\nEowyn: \"Gentlemen, I hope this time I'll be able to profit from that free ride you offered after the last fiasco. I really really want to see the Argonath. I've also brought that poor union leader's nephew along, as an escort.\"\n\nGimli: \"But certainly. Everything is ready. We can leave immediately.\"\n\nEowyn: \"I see we're going back through the East Bight now. And isn't that Bob I see waiting for us on the shore?\"\n\nA lighting fell amongst the party, slightly injuring Eowyn and Thalin.\n\nEowyn: \"And he's still got the help of the Necromancer.\"\n\nBob the Hill Troll: \"Rarrghhhh! You again?!?\"\n\nGimli: \"Yes, but this time, we're not alone!\"\n\nThe troll took a swipe with his club at the poor Westfold Horse-Breaker, sending him to rejoin his uncle in the afterworld.\n\nBob the Hill Troll: \"Whahaha! If that's all the help you've got, you may as well turn back right away!\"\n\nBeorn: \"Sorry for being late, Gee. I was doing number two in the bushes. Well, where's that tro... oh, I see!\"\n\nPursued by shadows, the party was making progress, having reached the Banks of the Anduin. Beorn started wrestling with the troll, trying to push it back in the water. Just as they were passing over an Enchanted Stream, a sudden metamorphosis happened. Beorn's clothes tore apart as he grew in size and dark fur grew on his body. A large brown bear was now standing in place of the warrior, almost as large as the troll itself. Gimli made a feint on Bob's left side, freezing him into place, and Beorn attacked along with Thalin. Gimli join the fray and they finally brought the troll down. While the dwarves were catching their breath in huge gulp after this effort, the bear roared and returned toward the forest. On the other side of the river, a group of elves saluted the party's victory over the troll.\n\nEowyn: \"I'm not sure we should celebrate so soon. The rest of his gang will certainly show up.\"\n\nGimli: \"Yes, but with my trusty blade, I'll deal with them. Also, we hired a couple of spearmen to guard us. They were just waiting for Bob to 'give up' before they joined with us.\"\n\nThe group had to face numerous goblins and orcs as they kept progressing along the river, but with the help of a Gondorian Spearman, they made quick work of them.\n\nEowyn: \"Is the raft far? Where do we embark?\"\n\nThalin: \"No lady. Not far. Just across the Gladden Fields, we'll find our raft.\"\n\nThey finaly found the boat. A ranger was standing beside it on the pier.\n\nGimli: \"Finaly! Alright everyone! All aboard!\"\n\nThey left the pier and quickly reached the middle of the current, flowing south with great speed.\n\nThalin: \"Gimli, can I have a word with you? Are you sure it was a good idea to put our armor on as we were embarking? And do you have any idea what you're doing? After all, it's the first time we make it on the raft since starting our business. I don't remember us discussing our navigation skills before.\"\n\nGimli: \"What? I thought you were supposed to take care of the boat. I was in charge of marketing, you were to take care of operations!\"\n\nThalin: \"But I never set foot on a boat before! Dude, we're in trouble.\"\n\nAs they progressed along the river, they saw the banks starting to fill with enemies: wargs and orcs, apparently lead by a large chieftan. They were seeing the Necromancer's Pass coming up along the horizon as well as the Gladden Fields extension.\n\nGimli: \"Miss, I'm sorry, but we must abandon ship.\"\n\nEowyn: \"What?!? That's it, I've had enough of you two.\"\n\nShoving Thalin aside, she took charge and quickly guided the raft toward the bank. As soon as they touched land, she started hitting the dwarves on the head with her umbrella, shrieking at the top of her lungs.\n\nGimli: \"Enough! Enough! We're leaving!\"\n\nThalin: \"None of this would ever have happened if we'd stayed in the Lonely Mountain like I always told you. And what happened to that grey beard fellow you were counting on? We never even saw him!\"\n\nEowyn, turning toward Anduin: \"I'll be back, river. I said I'd descend you from the forest to the falls, and by all the gods, I shall!\"\n\nNow for the technical report:\n\nDecklist (built from 3 Core Sets and 1 Hunt for Gollum Adventure Pack)\n\nHeroes\n\nGimli\nThalin\nEowyn\n \n\nAllies - Tactics\n\n2 x Beorn\n3 x Gondorian Spearman\n \n\nAttachments - Tactics\n\n3 x Blade of Gondolin\n3 x Citadel Plate\n2 x Dwarven Axe\n3 x Horn of Gondor\n \n\nEvents - Tactics\n\n3 x Feint\n3 x Quick Strike\n3 x Swift Strike\n \n\nAllies - Spirit\n\n2 x Lorien Guide\n2 x Northern Tracker\n3 x Westfold Horse-Breaker\n \n\nAttachments - Spirit\n\n3 x Unexpected Courage\n \n\nEvents - Spirit\n\n3 x A Test of Will\n3 x Hasty Stroke\n3 x Stand and Fight\n3 x The Galadhrim's Greetings\n \n\nAllies - Neutral\n\n3 x Gandalf\n \n\nStarting hand: Blade of Gondolin, Dwarven Axe, Feint, Swift Strike, 2 x Westfold Horse-Breaker.\n\nNo mulligan.\n\nStaging area contains Banks of the Anduin and Hill Troll. Starting threat is 29.\n\nRound 1: Collect resources (Gimli = 1, Thalin = 1, Eowyn = 1); Draw The Galadhrim's Greetings. Quest with Thalin and Eowyn; Reveal The East Bight. Score 2 progress on Quest 1B (2/8). Travel to The East Bight. Engage no enemy. Threat increases to 30.\n\nRound 2: Collect resources (Gimli = 2, Thalin = 2, Eowyn = 2); Draw Beorn. Play Westfold Horse-Breaker (0 resource left on Eowyn). Quest with Thalin and Eowyn; Reveal The Necromancer's Reach; Thalin takes 1 damage (1/4); Eowyn takes 1 damage (1/3); Score 3 progress on The East Bight (3/6). No travel. Engage Hill Troll. Westfold Horse-Breaker defends against Hill Troll; Shadow card is Hill Troll (no effect); Westfold Horse-Breaker takes 5 damages (5/1; dead; threat increases to 34). Threat increases to 35.\n\nRound 3: Collect resources (Gimli = 3, Thalin = 3, Eowyn = 1); Draw Northern Tracker. Play Beorn (0 resource left on Gimli, 0 resource left on Thalin). Quest with Thalin and Eowyn; Reveal Pursued by Shadows; Threat increases to 36; Score 3 progress on The East Bight (6/6, explored) and 1 progress on Quest 1B (3/8). Travel to Banks of the Anduin. Engage no enemy. Beorn defends against Hill Troll; Shadow card is Goblin Sniper (no effect); Beorn takes 3 damages (3/6). Threat increases to 37.\n\nRound 4: Collect resources (Gimli = 1, Thalin = 1, Eowyn = 2); Draw Gondorian Spearman. Quest with Eowyn; Reveal Enchanted Stream; Discard Dwarven Axe to increase Eowyn's Willpower by 1; Score 3 progress on Banks of the Anduin (3/3; explored; returned to the top of the encounter deck). Travel to Enchanted Stream. Engage no enemy. Play Feint on Hill Troll (0 resource left on Gimli); Shadow card was Banks of the Anduin (not resolved); Use Beorn's ability to increase his Attack by 5; Gimli, Thalin and Beorn attack Hill Troll; Hill Troll takes 9 damages (9/9; dead); Beorn is shuffled back into the player's deck. Threat increases to 38.\n\nRound 5: Collect resources (Gimli = 1, Thalin = 2, Eowyn = 3); No draw. Play The Galadhrim's Greetings (0 resource left on Eowyn); Threat decreases to 32. Play Gondorian Spearman (0 resource left on Thalin); Play Blade of Gondolin on Gimli (0 resource left on Gimli). Quest with Thalin and Eowyn; Reveal Misty Mountain Goblins; Misty Mountain Goblins takes 1 damage (1/3); Score 2 progress on Enchanted Stream (2/2, explored); *** I forgot to also score 1 progress on Quest 1B. No travel. Engage Misty Mountain Goblins. Misty Mountain Goblins attacks undefended; Shadow card is Eastern Crows (+1 Attack); Gimli takes 3 damages (3/5); Remove 1 progress from Quest 1B (2/8); Gimli attacks Misty Mountain Goblins; Misty Mountain Goblins takes 5 damages (6/3; dead); Score 1 progress on Quest 1B (3/8). Threat increases to 33.\n\nRound 6: Collect resources (Gimli = 1; Thalin = 1; Eowyn = 1); Draw A Test of Will. Quest with Thalin and Eowyn; Reveal Dol Guldur Orcs; Dol Guldur Orcs takes 1 damage (1/3); Play A Test of Will (0 resource left on Eowyn); Score 3 progress on Quest 1B (6/8). No travel. Engage Dol Guldur Orcs. Gondorian Spearman defends against Dol Guldur Orcs; Dol Guldur Orcs takes 1 damage (2/3); Play Swift Strike (0 resource left on Gimli; 0 resource left on Thalin); Dol Guldur Orcs takes 2 damages (4/3; dead); Shadow card was Eastern Crows (not resolved). Threat increases to 34.\n\nRound 7: Collect resources (Gimli = 1; Thalin = 1; Eowyn = 1); Draw Blade of Gondolin. Play Blade of Gondolin on Thalin (0 resource left on Gimli). Quest with Eowyn; Reveal Wolf Rider and Gladden Fields; Score no progress. Travel to Gladden Fields. Engage Wolf Rider. Thalin defends against Wolf Rider; Shadow card is Treacherous Fog (no effect); Thalin takes no damage; Gimli attacks Wolf Rider; Wolf Rider takes 5 damages (5/2; dead); Score 1 progress on Quest 1B (7/8). Threat increases to 36.\n\nRound 8: Collect resources (Gimli = 1; Thalin = 2; Eowyn = 2); Draw Citadel Plate. Quest with Eowyn; Reveal Necromancer's Pass; Score 1 progress on Gladden Fields (1/3). No travel. Engage no enemy. Threat increases to 38.\n\nRound 9: Collect resources (Gimli = 2; Thalin = 3; Eowyn = 3); Draw Gondorian Spearman. Play Citadel Plate on Gimli (0 resource left on Gimli; 1 resource left on Thalin). Quest with Thalin and Eowyn; Reveal Dol Guldur Orcs; Dol Guldur Orcs takes 1 damage (1/3); Thalin takes 2 damages (3/4); Score no progress. No travel. Engage Dol Guldur Orcs. Gimli defends against Dol Guldur Orcs; Shadow card is Dol Guldur Orcs (+1 Attack); Gimli takes 1 damage (5/9); Gondorian Spearman attacks Dol Guldur Orcs; Dol Guldur Orcs takes 1 damage (2/3). Threat increases to 40.\n\nRound 10: Collect resources (Gimli = 1; Thalin = 2; Eowyn = 4); Draw A Test of Will. Play Northern Tracker (0 resource left on Eowyn); Play Gondorian Spearman (0 resource left on Thalin). Quest with Gimli, Eowyn and Northern Tracker; Score 1 progress on Necromancer's Pass (1/2); Reveal The Necromancer's Reach; Gimli takes 1 damage (6/9); Eowyn takes 1 damage (2/3); Northern Tracker takes 1 damage (1/3); Score 2 progress on Gladden Fields (3/3, explored) and 2 progress on Quest 1B (9/8, completed). No travel. Engage no enemy. Gondorian Spearman defends against Dol Guldur Orcs; Dol Guldur Orcs takes 1 damage (3/3, dead); Shadow card was Eastern Crows (not revealed). Threat increases to 41.\n\nRound 11: Collect resources (Gimli = 2; Thalin = 1; Eowyn = 1); Draw Citadel Plate. Quest with Gimli, Thalin, Eowyn and Northern Tracker; Score 1 progress on Necromancer's Pass (2/2, explored); Reveal The East Bight and Wargs; Wargs takes 1 damage (1/3); Score 5 progress on quest 2B (5/16). Travel to The East Bight. Engage no enemy. Threat increases to 41 *** I think I forgot to increase threat at this point, or I made a mistake in my notes.\n\nRound 12: Collect resources (Gimli = 3; Thalin = 2; Eowyn = 2); Draw Feint. Play Citadel Plate on Thalin (1 resource left on Gimli; 0 resource left on Thalin). Quest with Gimli, Thalin, Eowyn and Northern Tracker; Reveal Dol Guldur Beastmaster and Chieftan Ufthak; Score 2 progress on quest 2B (7/16). No travel. Engage no enemy. Threat increases to 42.\n\nRound 13: Collect resources (Gimli = 2; Thalin = 1; Eowyn = 3); Draw Lorien Guide. Quest with Thalin, Eowyn and Northern Tracker; Reveal Gladden Fields and Necromancer's Pass; Threat increases to 48. No travel. Engage Chieftan Ufthak. Play Feint on Chieftan Ufthak (0 resource left on Thalin); Shadow card was Treacherous Fog (not revealed); Gimli attacks Chieftan Ufthak; Chieftan Ufthak takes 6 damages (6/6; dead); Score 1 progress on Quest 2B (8/16). Threat increases to 49.\n\nRound 14: Collect resources (Gimli = 3; Thalin = 1; Eowyn = 4); Draw Unexpected Courage. Play Lorien Guide (1 resource left on Eowyn). Quest with Gimli, Thalin, Eowyn, Lorien Guide and Northern Tracker; Reveal Misty Mountain Goblins and Evil Storm.\n\nAt this point, I conceded. I did do a few mistakes in that game (didn't score progress correctly during quest 1B, forgot to increase threat on round 11), but they would not have made any major difference I think.\n\nFinal score: Defeat in 14 rounds.\n "}]}