{"url":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/","title":"Do you have also the feeling that most of the game revolves around Gandalf?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499415","commentId":499415,"userName":"Shelfwear","timestamp":1310587240,"content":"After having studied a couple of successful decks in the internet I get the feeling that those are mostly build around Gandalf and how to get him into play over and over again.\n\nThose decks are usually: Sneak attack for a cheap Gandalf, Stand and Fight for resurrection of Gandalf, Dwarven Tomb to get Stand and Fight back and Will of the West to shuffle all these and all your Gandalf(s) back into your deck (that is 12 Gandalfs per shuffle). With Steward of Gondor out, resources are not a problem, Horn of Gondor makes Gandalf even cheaper. Add some cards for untapping - you guess right - Gandalf, so he can defend and attack. Then have some Lore cards for drawing more cards so that you get Gandalf(s) and those support cards even quicker on your hand.\n\nSo, since the game was published and the players had time to tinker with the cards most of the decks (and maybe even the game) turned into a \"Gandalf cameo contest\". Funilly, the rest of the cards dont even matter that much (as long as Unexpected Courage is included).\n\nAm I too critical? I somehow feel that there wasn't enough playtesting when most \"good\" decks follow the same Gandalf-Structure. And it is obvious that Spirit cards are by far the best in the game (followed by Leadership) and Tactic cards are the worst of the four spheres.\n\nBefore you say now: \"Then take Gandalf out if he bothers you\". Of course I play the game to win but it feels a bit shallow that despite having four different spheres and many different cards it boils down to Gandalf if I wanna beat the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499489","commentId":499489,"userName":"Bindlespin","timestamp":1310607131,"content":" You don't really need Gandalf to beat the first two scenarios. It is a great card though. You can make decks that revolve around Gandalf, but that seems really unnecessary. I still haven't gotten to the third scenario yet because I am still experimenting with different decks on the second. I am not interested in tournament play so there is no incentive for me to make a Gandalf deck at all. Plus, when you put him in a fifty card deck he doesn't really show up that often unless you are using Beravor to burn though the deck to get to him. The number one reason to use him is threat reduction and you can get that with the galadhrims' meeting. And, if you are sneak attacking with him he is only out for the  phase so you can't quest/attack/defend with him even if you could ready him twice. Maybe that is not what you meant, though. So in short I really do think you should play without him and I think you'll be surprised. Use the Sirit sphere though and maybe use two heroes instead of three to keep threat low. Good luck with Gandalf free gaming!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499537","commentId":499537,"userName":"Iver2","timestamp":1310621265,"content":"Well, I agree with most what Blindlespin said.\n\nI am playing 2 player games with just one core, so we used 2 Gandalfs so fare but just in one game I was a able to really play Gandalf often due to high card draw and nice spirit cards. Well, he makes a big difference but unless you would really play with 3 copies, high card draw and build your deck around having him really often its not a absolute winning guarantee . ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nBut, i am already also thinking about playing just one Gandalf per deck, so he will be really just a \"joker\" than.\n\nIn the end guys, it all comes down as to how difficult attempted quest is imo. Tournament decks which offer a 100% win guarantee would mean for me 100% wasted money on this game ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nIn a coop card game, the idea of tournament decks doesn't really make so much sense to me.\n\nWe need hard scearios, really hard ones I mean, so even a super-gabba-Gandalf deck won' t be a winning guarantee. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nyeah, and maybe we need some rule updates regarding Gandalf?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499606","commentId":499606,"userName":"reno1051","timestamp":1310634453,"content":"the only way tournaments will work, in my eyes, is the team ending with the least threat.  not sure what else you can \"judge.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499753","commentId":499753,"userName":"Nico Deluxe","timestamp":1310655454,"content":"I'm currently playing by controlling two \"players\", with two fifty card decks as by the tournament rules. Journey down the Anduin takes about 6-8 turns, Mirkwood about 3-4 to be completed. Both decks have 3x Gandalf, but there isn't much card drawing (one deck has 3x Gleowine), so Gandalf doesn't show up very often and I usually don't get more than one use out of him.\n\nI don't think it's possible to build a 50 card deck that can use Gandalf over and over again and do that all the time. After all, you need to get all those cards in your hand in a very limited number of turns, and you'll need at least one Gandalf card or the deck won't work at all. There is no guaratee.that you'll get Gandalf in your starting hand or the first few turns, leave alone all those other cards you'd need, too. It is just highly improbable and no reliable strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499815","commentId":499815,"userName":"servant of the secret fire","timestamp":1310664987,"content":" Someone else made this question before so i will say again what i said before.\n\nThis is a Lotr game and most abilities and card effects have their influnce from the books (for example Denethor's abilitie).\n\nNow ask your self what if:\n\nGandalf wasn't at Helms Deap or in Gondor or at Wheather top or in Moria etc etc...\n\nThe answer is the same to all those events.The free peoples are dead and Middle-Earth is Sauron's home.\n\nThats why you must have Gandalf in all your decks if you want to have high chances to survivegran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif].\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499831","commentId":499831,"userName":"Mighty Jim 83","timestamp":1310667619,"content":"The Hobbit:\n\nBad stuff happens, Gandalf appears and sorts it out. Then he leaves again\n\nRepeat.\n\nFor me, this Gandlaf card perfectly fits the story. He's amazing when he's there, but often he isn't. Outside of a Lore deck, there's really very little in the way of extra draw. Outside of Spirit there's little you can do to keep your threat down long enough to just wait until he shows up. Outside of Leadership there's little you can do to afford to keep playing him repeatedly. A Gandalf-dependent strategy needs at least 3 spheres to click for it to work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499876","commentId":499876,"userName":"Bindlespin","timestamp":1310672630,"content":" I don't think Gandalf was at Weathertop. Strider saves the halflings there. I think he claims he was trapped on Sarumans's tower in Isengard or something. There was a butterfly maybe... and some eagles got involved. And then he disappears again in the mines of moria, and he didn't help frodo at mount doom. he spends a lot of time off hunting gollum. who knows what he is really up to most of the time? lining his pockets with the wealth of the oil rights of the elves who he happily ships off to the grey havens.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=499946","commentId":499946,"userName":"qwertyuiop","timestamp":1310685419,"content":"Bindlespin said:\n\n I don't think Gandalf was at Weathertop. Strider saves the halflings there. I think he claims he was trapped on Sarumans's tower in Isengard or something. There was a butterfly maybe... and some eagles got involved. And then he disappears again in the mines of moria, and he didn't help frodo at mount doom. he spends a lot of time off hunting gollum. who knows what he is really up to most of the time? lining his pockets with the wealth of the oil rights of the elves who he happily ships off to the grey havens.    \n\n\n\n \n\nGandalf is at Weathertop days ahead of the hobbits.\n\n \n\nAs far as the game is concerned, Gandalf isn't really the end all be all of great cards.  Leadership can generate the resources to play him easily. Spirit can manage their threat well enough to save up and play him.  Lore can do what? Draw him?  Feed him to Protector of Lorien? Resources are usually better spent elsewhere. Tactics. Yeah.. If you handicap his cost down to two. Maybe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=500006","commentId":500006,"userName":"jhaelen","timestamp":1310701557,"content":"I was getting the feeling that everything revolves around Gandalf, too. So, at some point when recording my games (scenario 2 and 3 only) I also noted how many times I had played Gandalf. Here's my findings:\n\nI never lost a game in which Gandalf was played twice or more.\n\nI lost every game in which Gandalf wasn't played at least once.\n\nCurrently Gandalf is definitely crucial to win the game. It is the only card I'd rate 10/10 right now. Once more cards have been released you may be able to create a competitive deck without Gandalf, but at the moment you cannot really do without him if you want to have a good win/loss ratio."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=500017","commentId":500017,"userName":"Iver2","timestamp":1310709053,"content":"To to see how it goes we played \"Helping friends\" yesterday two times with just only one Gandalf per deck with 2 players. Before that we played with 2 each and we lost, and yesterday we also lost 2 times in a row, but the last time u could say it was close. (really great challenge btw! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )\n\nStill, he was a great help really and he managed showed up for each of us in a 50 card trournament deck. Without him we would have died much quicker for sure.\n\nWe will try do play again next time with 2 Gandalf each and see if there is a big difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=500031","commentId":500031,"userName":"felix16","timestamp":1310713970,"content":"Bindlespin said:\n\n I don't think Gandalf was at Weathertop. Strider saves the halflings there. I think he claims he was trapped on Sarumans's tower in Isengard or something. There was a butterfly maybe... and some eagles got involved. And then he disappears again in the mines of moria, and he didn't help frodo at mount doom. he spends a lot of time off hunting gollum. who knows what he is really up to most of the time? lining his pockets with the wealth of the oil rights of the elves who he happily ships off to the grey havens.    \n\n\n\nGandalf was at Weathertop. The hobbits and Aragorn saw the lightshow he made when fending off the Nazgûl. And he left his \"G\" rune on a stone for them to find."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=500431","commentId":500431,"userName":"Shelfwear","timestamp":1310802877,"content":"Hhm, I see two different topics mingled together here: storytelling and game design.\n\nFrom a story perspective it makes totally sense that Gandalf appears and lets you win the game (he was even part of the fellowship and always was delving into politics and action in Middle Earth), game design wise its weak to have one card out of of 61 game cards (thats the amount of different ally, attachment and event cards) that regularly massively decides over success or failure of the whole game. That was what I wanted to discuss here, not if the Gandalf (as a fictional character) is entitled to be a game winner or not :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=500466","commentId":500466,"userName":"Glaurung","timestamp":1310811202,"content":"jhaelen said:\n\nI was getting the feeling that everything revolves around Gandalf, too. So, at some point when recording my games (scenario 2 and 3 only) I also noted how many times I had played Gandalf. Here's my findings:\n\nI never lost a game in which Gandalf was played twice or more.\n\nI lost every game in which Gandalf wasn't played at least once.\n\nCurrently Gandalf is definitely crucial to win the game. It is the only card I'd rate 10/10 right now. Once more cards have been released you may be able to create a competitive deck without Gandalf, but at the moment you cannot really do without him if you want to have a good win/loss ratio.\n\n\n\nIS depend on the deck you play. My last game i play him 4 or 5 times..... And i lost anyway....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=500670","commentId":500670,"userName":"Doom1502","timestamp":1310871175,"content":"\"Do you have also the feeling that most of the game revolves around Gandalf? \"\n\nWell, for me: simply NO. Not with the decks I tend to build (except the zero-threat-deck^^, but that deck was a joke). And with the adventure-packs and more cards with the same keywords, there will be many decks with other focuses than gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=500678","commentId":500678,"userName":"snibe_8","timestamp":1310872982,"content":"I haven't played any games yet where Gandalf was a major/deciding factor yet.  He's definitely the most powerful card, but I just haven't had a make or break moment with him yet.  The first game I won, he didn't even make it into my hand.  I was using a lore/spirit deck and beat the game before I had a chance to see him.  In fact I won that game so fast, due to the way the cards came out, that I didn't have a chance to do anything  to bring the score down.  Other games I've lost even when I've gotten him at the times when I needed him most. \n\nThat being said, there are always going to be people that will set up there decks around certain powerful cards, especially for tournament play.  All the power to them if that's what they want, but I don't because I don't really participate in tournaments, and I couldn't enjoy playing a deck that won every time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=504891","commentId":504891,"userName":"FloLeBlanc","timestamp":1311754673,"content":"Well imho Gandalf is the best ally you can get atm and abusing him with sneak attack and recurring combos (tomb of the kings, etc.) is unfortunately the best choice to win with a good score atm. (in our local tournament everyone just built around abusing him - I left that tourney before it started after learning that, just too boring to waste my time)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=505063","commentId":505063,"userName":"Kiwina","timestamp":1311771179,"content":"FloLeBlanc said:\n\nWell imho Gandalf is the best ally you can get atm and abusing him with sneak attack and recurring combos (tomb of the kings, etc.) is unfortunately the best choice to win with a good score atm. (in our local tournament everyone just built around abusing him - I left that tourney before it started after learning that, just too boring to waste my time)\n\n\n\nI know this is side-tracking a little bit, but how did the local tournament operate?  How many players per team, scoring, deck rules, etc.\n\nI can see why Gandalf makes a good focus card, but to me it seems like bad strategy to build a deck just to play one card, even if there are three in your deck of 50.  There are a lot of useful cards that cost less, and accomplish the same goal.  I agree that Gandalf is the most powerful ally out there, but depending on your situation he may not be the best."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=505323","commentId":505323,"userName":"FloLeBlanc","timestamp":1311820199,"content":"2 players per team, originally minimum Threat after the win is the best (they changed that due to the Gandalf Combo)\nDeck Rules like in the manual (50 cards, 3 max/card)\n\nOf course not EVERY card is centered on Gandalf (there are not enough anyways) - but you take card draw (one player can help the other cycling through his deck) and blue for the recursion.\nTBH with the starter Set I'm very open to suggestions but if you manage to play to the recurring Gandalf point and smack the guy down every turn it doesn't really matter how you performed before and I didn't find a way for a better score yet.\nYou stall the game 'til you went down with your threat and win.\n (That said I our group doesn't play it like that because it is boring as hell)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=505993","commentId":505993,"userName":"ArachneJericho","timestamp":1311938603,"content":"Gandalf is a powerful card, and some people will only build their decks around powerful combos, rather than exploring the rest of what the game has to offer. It's why, every once in a while, Magic the Gathering tournaments have a shake-up paradigm shift when someone wins without the popular combos of the current cycle (this was, in fact, why what's called Big Green became a considered tournament-worthy archetype of deck: because some guy decided that he'd just enter the tourneys with a deck consisting of Spikes, which everyone else laughed at, until they played against him).\n\nI strongly dislike decks that center around one powerful combo or even a few; for a deck to work well against any scenario, you need synergy amongst all your cards. You can get away with less synergy the more players you have, but when you're battling solo, you best not rely only on Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=506995","commentId":506995,"userName":"jhaelen","timestamp":1312167677,"content":"ArachneJericho said:\n\nYou can get away with less synergy the more players you have, but when you're battling solo, you best not rely only on Gandalf.\n\n\n\nI disagree. Gandalf is the single best card and he's purposely been designed as a 'swiss army-knife'. Pretty much no matter what your current problem is (lacking cards, threat too high, tough opponents, lacking willpower), Gandalf is the solution. You'd be crazy not to exploit that, particularly in a single player deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=507125","commentId":507125,"userName":"reno1051","timestamp":1312193441,"content":"in my experience, when playing solo with the premade decks, I have rarely even seen a gandalf (i keep only the 1 in the deck) and I can still win.  when i play multiplayer, its either everyone else has a gandalf but saves him in case we need him or no one has a gandalf.  in both cases, we still win some and lose some.  so by saying that \"most of the game revolves around gandalf,\" i say NO.  its easy to make a deck rely around him, but i feel that relying on a single card is a huge crutch.  To me, he seems more of a \"deus ex machina\" sort of card.  I usually only save hime for the \"Oh ****\" moments, but even then I hold off unitl absolutely necessary.  There have been many solo and multiplayer games that I have played where gandalf is still on a players hand when we win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=507266","commentId":507266,"userName":"avgzxc","timestamp":1312211373,"content":"Let's just face it: Gandalf = joker. Holes are easily filled. And even if no holes, then +3 cards, yay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=507451","commentId":507451,"userName":"Hayzuss","timestamp":1312252945,"content":"Firsty I think going online to search for decks that make it easy to win a co-op deckbuilding game a thing that should be entirely avoided if you like to have fun, because for me the fun comes from learning what works with you and your buddies.  I do not think you are being to critical, you are just looking at the game in what seems to me the wrong way. One powerful card has lessened your enjoyment of this game for you after you searched to find powerful decks to win the game with.\n\nSecondly this seems like a pretty good question to ask.  I really think it depends on how you like to play and what type of gamer you are so that will sway how everyone answers.  I believe no it does not revolve around a single card.  I love building decks.  Just building around one card would be boring but would not stop you from building it into some decks as needed.  I am sure there are multiple ways to win without the Gandalf card some are mentioned here already.\n\nAlso it is always great to have a mixture of powerful and not so powerful cards.  If all things are even then how bland would the game be?  As more cards come out obviously feeling the 'need' for Gandalf will become less of a problem. No one is ever forced to play a certain card just because it is the best card available, that is a choice you make yourself.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=558774","commentId":558774,"userName":"snaggrriss","timestamp":1321951990,"content":"in agot, there are a couple of labled players we like to call a jaime player, or a nedly plyer. for a jaime player it's about the win. so gandalf seems to cheapen the victory for you. then there's the nedly who's in love with the artwork and the story.(i'm somewhere in between.) for anyone who's read the Hobbit(i do every winter-amazing book!) and you're playing through conflict at carrock, having gandalf win the game for you is wicked. the hobbits and dwarves were stew if it weren't for gandalfs wits. gandalf single handedly won the \"scenario\". for myself gandalf here is cool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559126","commentId":559126,"userName":"Zjb12","timestamp":1321997371,"content":" My understanding per the LOTR card game errata 10/28/11 is that you cannot use stand and fight on gandalf since he is a neutral ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559127","commentId":559127,"userName":"Zjb12","timestamp":1321997389,"content":" My understanding per the LOTR card game errata 10/28/11 is that you cannot use stand and fight on gandalf since he is a neutral ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559157","commentId":559157,"userName":"radiskull","timestamp":1322004089,"content":" You are correct - the errata breaks this combo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559308","commentId":559308,"userName":"Eric W","timestamp":1322037718,"content":"As well as stopping people from slowing the game down to eliminate threat with the 10 VPs/turn.\n\n \n\nGandalf is good, but I'm noticing that as more cards are coming out, he's less needed to pull off a win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559322","commentId":559322,"userName":"LEGA","timestamp":1322039719,"content":"I haven't played all scenarios yet, but imo Gandalf is useless in Rhosgobel. Just to decrease you threat level in the end of game for better score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559347","commentId":559347,"userName":"Dam the Man","timestamp":1322042204,"content":"LEGA said:\n\nI haven't played all scenarios yet, but imo Gandalf is useless in Rhosgobel. Just to decrease you threat level in the end of game for better score.\n\n\n\nDrawing cards if you use Lore (of Imladris) and don't have Beravor or killing flying Enemies when you have no Ranged people in play. I think I used Gandy for all three of his options when I played through Rhosgobel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559356","commentId":559356,"userName":"LEGA","timestamp":1322043749,"content":"Dam said:\n\nLEGA said:\n\n \n\nI haven't played all scenarios yet, but imo Gandalf is useless in Rhosgobel. Just to decrease you threat level in the end of game for better score.\n\n \n\n \n\nDrawing cards if you use Lore (of Imladris) and don't have Beravor or killing flying Enemies when you have no Ranged people in play. I think I used Gandy for all three of his options when I played through Rhosgobel.\n\n\n\nIf you play solo. I always play 2 players games. Most always we have Legolas (for flying enemies) and Beravor (for cards and healing) in Rhosgobel.\n\nBut yes, it depends on your deck. If you want to have good challenge and you don't take Ranged and Eagles allies to you deck, Gandalf will be really usefull)))"},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559501","commentId":559501,"userName":"Dam the Man","timestamp":1322060754,"content":"LEGA said:\n\nIf you play solo. I always play 2 players games. Most always we have Legolas (for flying enemies) and Beravor (for cards and healing) in Rhosgobel.\n\nBut yes, it depends on your deck. If you want to have good challenge and you don't take Ranged and Eagles allies to you deck, Gandalf will be really usefull)))\n\n\n\nI play 2-deck games mostly. But I have four decks, each gets paired with another deck once per quest, for a total of six plays per quest. Lore/Leadership has Denethor, Gloin, Glorfindel for no draw, no ranged among heroes, Leadership/Tactics has Aragorn, Legolas, Theodred, no draw, but ranged isn't an issue (one or two eagles I think), Tactics/Spirit at the time had Eowyn, Gimli, Thalin for no draw, no ranged (had eagles) and Spirit/Lore had Beravor, Dunhere, Eleanor for draw, but no ranged. Any of the first three when paired with each other, drawing was a problem, ditto for threat management and even killing, Wilyador was forced to defend quite often and undefended attacks weren't uncommon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559693","commentId":559693,"userName":"Lilian","timestamp":1322092870,"content":"I think that Gandalf must be limit once per deck.\n\nLook who don't put Gandalf 3 times in his deck ? One time in 4 player Games he is present all the game at every turn..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559697","commentId":559697,"userName":"juicebox","timestamp":1322093175,"content":"So far my playing experience leads me to this:\n\nGandalf's importance in the game is well calibrated to Gandalf's importance in the books.\n\nAnd just to be clear, I think that's fantastic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559723","commentId":559723,"userName":"OnkelZorni","timestamp":1322101358,"content":"Lilian said:\n\nLook who don't put Gandalf 3 times in his deck ? One time in 4 player Games he is present all the game at every turn...\n\n\n\nMe!\n\nI have up to two copies of Gandy Dandy in my decks. In non-leadership decks he is imo most times too expensive and I don't like having my hand full of grey-haired old men. Though in most games he doesn't even show up, he's quite useful when he \"precisely means to appear\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559731","commentId":559731,"userName":"LEGA","timestamp":1322102562,"content":"Dam said:\n\nLEGA said:\n\nIf you play solo. I always play 2 players games. Most always we have Legolas (for flying enemies) and Beravor (for cards and healing) in Rhosgobel.\n\n \n\nBut yes, it depends on your deck. If you want to have good challenge and you don't take Ranged and Eagles allies to you deck, Gandalf will be really usefull)))\n\n \n\n \n\nI play 2-deck games mostly. But I have four decks, each gets paired with another deck once per quest, for a total of six plays per quest. Lore/Leadership has Denethor, Gloin, Glorfindel for no draw, no ranged among heroes, Leadership/Tactics has Aragorn, Legolas, Theodred, no draw, but ranged isn't an issue (one or two eagles I think), Tactics/Spirit at the time had Eowyn, Gimli, Thalin for no draw, no ranged (had eagles) and Spirit/Lore had Beravor, Dunhere, Eleanor for draw, but no ranged. Any of the first three when paired with each other, drawing was a problem, ditto for threat management and even killing, Wilyador was forced to defend quite often and undefended attacks weren't uncommon.\n\n\n\nLast night I played Rhosgobel with Beravor, Eowyn, Eleanor and Legolas, Theodred, Aragorn (2 players game) and 3 Lore of Imladris were in last 7-10 cards of my deck. I used Beravor and had to use Gandalf to draw more 3 cards to catch at least one, because there were 18 damage tokens on Wylador and only one Athelas. But I got Gleowyne and then only he draw me one Lore of Imladris. So Gandalf really helped me yesterday in drawing cards. And also second player used Gandalf in game to defeat Hummerhorn. We had only Legolas (with Unexpected Courage and Axe) in game as Ranged and it was enough to defeat 3 Flocks and 1-2 Bats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/49919-do-you-have-also-the-feeling-that-most-of-the-game-revolves-around-gandalf/?do=findComment&comment=559735","commentId":559735,"userName":"jhaelen","timestamp":1322103211,"content":"Lilian said:\n\nI think that Gandalf must be limit once per deck.\n\nLook who don't put Gandalf 3 times in his deck ? One time in 4 player Games he is present all the game at every turn...\n\n\n\nMe! Since I only have one Core set, there's only four copies available lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"}]}