{"url":"https://community.fantasyflightgames.com/topic/50042-not-committing-any-heroes-to-a-quest/","title":"Not Committing Any Heroes To A Quest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50042-not-committing-any-heroes-to-a-quest/?do=findComment&comment=500522","commentId":500522,"userName":"Terracount","timestamp":1310822580,"content":"I recently bought my copy of the game and, so far, I've really enjoyed it. During my last run through of Passage through Mirkwood I wanted to use all of my heroes to defeat an enemy, but what happens if I do not commit any heroes to the current quest? Do I still compare my willpower of zero against the threat strength of the staging area and gain a large amount of threat? Or do I skip Quest Resolution since there aren't any committed heroes?\n\n \n\nThanks a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50042-not-committing-any-heroes-to-a-quest/?do=findComment&comment=500523","commentId":500523,"userName":"Dain Ironfoot","timestamp":1310822760,"content":" you would have a willpower of 0 and take (potentially) a big kick to your threat level. \n\ni dunno if this is always sound advice, but i've never not quested."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50042-not-committing-any-heroes-to-a-quest/?do=findComment&comment=500550","commentId":500550,"userName":"Jimson","timestamp":1310829190,"content":" I may do this when I'm at the end of 3b encountering Ungoliant's Spawn.  If my threat is relatively low, I do not see a reason with not questing.  The most you may get hit with is 3-5 I think.  So why not take the threat and kick the nasty spiders tail.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50042-not-committing-any-heroes-to-a-quest/?do=findComment&comment=500567","commentId":500567,"userName":"miketheturtle","timestamp":1310835231,"content":"I think I have just stumbled on to a mistake I have been making, thanks to this post... I didn't realize that the quest phase happened when you didn't commit to it. I thought if you didn't commit, you skipped - the penalty being you weren't making any progress. But according to this post, even if you do not commit,not only does the quest still happen, but you add encounters per player, still.... that greatly changes things... now I'm starting to wonder where else I may have missed something... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50042-not-committing-any-heroes-to-a-quest/?do=findComment&comment=500600","commentId":500600,"userName":"Terracount","timestamp":1310846215,"content":" Jimson, I tried exactly that earlier today and it worked like a charm. And Mike the Turtle, after playing with these rules I can tell you it really made the game more difficult. It's a good thing, though. I really enjoy not knowing whether or not my party will prevail. That pulls me into the game and makes me want to play. Hopefully my strategy will improve with time, but the feeling of encroaching doom I get when I battle swarms of enemies or turn the dials on my threat tracker fits right in with the books and I think FFG did a stellar job bringing that into the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50042-not-committing-any-heroes-to-a-quest/?do=findComment&comment=500682","commentId":500682,"userName":"pumpkin","timestamp":1310873735,"content":" \n\nI have added this to the unofficial FAQ, because it has been asked a few times by news players.\n\n \n\nIt's worth checking that thread for other mistakes you may be making, cheers\n\n \n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=479840#479840 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=479840#479840]\n\n "}]}