{"url":"https://community.fantasyflightgames.com/topic/50048-deck-building/","title":"deck building","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50048-deck-building/?do=findComment&comment=500573","commentId":500573,"userName":"miketheturtle","timestamp":1310835952,"content":" So I'm looking at various decks that have been built, with such a small pool to build from;\n\nbeing that there are only 15 cards per sphere, giving you 45 cards if you have 3 sets (48 counting Gandolf) - you can't build a one sphere deck (unless I'm missing something - heroes don't count toward the 50 card deck, right?) at least not until expansions start to fill in the sets.  it would be nice to see more \"generic\" cards...\n\nso what are you looking for when building a deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50048-deck-building/?do=findComment&comment=500603","commentId":500603,"userName":"Terracount","timestamp":1310846944,"content":"For my first deck I want to try using Aragorn, Gimli, and Legolas as my heroes. That's a pretty high starting threat, though. I'm sure it's been done to death already. I think I'll keep my deck at 30 cards for now until, like you said, I get more cards from Adventure Packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50048-deck-building/?do=findComment&comment=501022","commentId":501022,"userName":"Iver2","timestamp":1310967309,"content":"hmm, so far with one core, not too many opitons for 2 player games.\n\nWe stick to combining Leadership with Spirit due to \"favor of the lady\" and mainly play 2 leadership/1 spirit hero.\n\nThe other player would be Tactics/ Lore of course.\n\n \n\nFavor of the lady is just too good to be useless. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50048-deck-building/?do=findComment&comment=501553","commentId":501553,"userName":"Azarith_Stryffe","timestamp":1311062967,"content":"I actually made a Tactics/Leadership/Splash of Spirit, using Legolas, Gimli and Aragorn.  The songs from Hunt for Gollum are awesome and allowed me to do it.  With Steward on Aragorn, and a Song on one of the other two, and celebrian stone it's pretty great.  I only put a few spirit cards in, Favor of the Lady and UC of course hehehe.  I was gonna do Northern Tracker and Galahdrim's Greeting, but I figured those cost too much, the other two I have are 2 cost cards, so not too bad, especially Aragorn needs to keep a resource for questing.  But I really enjoy my deck, the high starting threat does suck, but there's ways to make it work, and I designed it not to be a solo deck so lol."}]}