{"url":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/","title":"A Few Questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=500861","commentId":500861,"userName":"player647862","timestamp":1310915582,"content":"The Questing Phase in the rule book states that \"This phase is broken into three steps: 1) commit characters,\" and it also says that \"Players have the opportunity to take actions and play event cards at the end of each step.\"  Step 1 is committing characters.  Since I cannot play event cards until the end of the step, after the characters are already committed, does this mean that I cannot Sneak Attack Gandalf and commit him to the quest?  I haven't been able to find anywhere that I can play events during a step.  Even on the last page of the rulebook, where it's all green and red, the green is defined as \"Any player can take actions generally, or between the game steps stated in the rules.\"  So part of it seems to be saying I can't SA Gandalf (between steps) and part of it kind of seems to be saying I can \"generally.\"\n\nCan I play 0 cost events from any sphere, even if I don't have a hero from that sphere?  Ex: can I play the Leadership 0-cost event Common Cause in my all-Lore deck by paying 0 Pink resources?\n\nI know our final score can be less than 0, but can our threat also be less than 0, or can only victory points take our score below 0?  If threat can also go below zero, what's to stop someone from using Spirit to score negative inifinity on the Anduin encounter, other than lack of time? (Dwarven Tomb + Will of the West + threat reduction + never attacking the last enemy on the board = whatever threat score you want).\n\nHow is FFG going to run tournaments?  With no opponent / integrity to keep some players honest, what's to stop the cheating?  Will FFG have a judge at every table watching every game to make sure no one is cheating?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=500872","commentId":500872,"userName":"Dain Ironfoot","timestamp":1310918339,"content":" i can answer one of these quickly, off the top of my head: no, you cannot play a spirit card with no spirit heroes (for example), even if the cost is 0."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=500876","commentId":500876,"userName":"Terracount","timestamp":1310920404,"content":" You cannot play event cards until the end of a step. The term \"player actions\" does not only apply to event cards. For example: exhausting a card to get rid of a Treachery effect would also be a player action."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=500925","commentId":500925,"userName":"Sylvicolus","timestamp":1310932729,"content":"The back of the rule book shows the Commit Characters step as green, meaning you can take actions during the step, and before the next step of revealing encounter cards. So Sneak Attack can be played. The \"any actions generally\" means during steps -- \"Action windows in which players are free to take actions are presented in green.\"\n\nAs Dain said, you need a hero matching the resource for cards that you play. However, resource match is not needed for the Ally card used with the Sneak Attack action or when using the response of Brok Ironfist.\n\nThe consensus may be that the threat dial does not go below zero but victory points can lead to a negative score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=500992","commentId":500992,"userName":"pumpkin","timestamp":1310959547,"content":"Terracount said:\n\n You cannot play event cards until the end of a step. The term \"player actions\" does not only apply to event cards. For example: exhausting a card to get rid of a Treachery effect would also be a player action.\n\n\n\nI'm not sure that's right. Is that just an assumption on your part, or is that based on something from the rulebook or FAQ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=503720","commentId":503720,"userName":"Bonus Card","timestamp":1311544034,"content":" Well said, it would seem to me that actions can be played whenever applicable within the context of their text, but actions within a loaded keyword can only be played in the action subphase of the  phase. However, I could be totally wrong, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=503721","commentId":503721,"userName":"Bonus Card","timestamp":1311544054,"content":" Well said, it would seem to me that actions can be played whenever applicable within the context of their text, but actions within a loaded keyword can only be played in the action subphase of the  phase. However, I could be totally wrong, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=503755","commentId":503755,"userName":"Veybo","timestamp":1311551950,"content":"The first step of the Quest phase is to commit characters.\n\nPlayers do not have a chance to play standard Player actions until the end of this step.\n\nTherefore whilst you can play Sneak Attack during the Quest Phase, the first chance you get to play it is after you have commited characters to a quest, meaning it is pretty useless.\n\nFrom the rule book:\n\n\"This phase (the Quest Phase) is broken into three steps.  Players have the opportunity to take actions and play event cards at the end of each step.\"\n\nCheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50078-a-few-questions/?do=findComment&comment=504303","commentId":504303,"userName":"Orci2","timestamp":1311648301,"content":"Veybo said:\n\nFrom the rule book:\n\n\"This phase (the Quest Phase) is broken into three steps.  Players have the opportunity to take actions and play event cards at the end of each step.\"\n\n\n\nThe diagram at the end of the book says something else..."}]}