{"url":"https://community.fantasyflightgames.com/topic/50118-difficulty-level/","title":"Difficulty Level","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50118-difficulty-level/?do=findComment&comment=501218","commentId":501218,"userName":"Terracount","timestamp":1310997872,"content":" I was wondering how FFG decided on the difficulty levels for the scenarios. Is it how many times you're going to be stomped out of 10 when using the starter decks?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50118-difficulty-level/?do=findComment&comment=501505","commentId":501505,"userName":"peterstepon","timestamp":1311054789,"content":"Good question.  I should point out that I have been stomped into the ground many times playing passage through mirkwood so I think it warrants a difficulty higher than 1.  I am sure that many players share that view.\n\nMaybe it is if you have an ideal deck.  If you play a solo game with either a 30 card tactics or Lore deck even an easy game can have the difficulty racheted up a great deal. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50118-difficulty-level/?do=findComment&comment=502600","commentId":502600,"userName":"Shelfwear","timestamp":1311269175,"content":"I'm not sure but it seems to me that the difficulty rate given by FFG applies for a two player game. If played solo the difficulty seems to go up, if you play solo with a mono sphere deck the difficulty goes up even more, if you play with a dual or tri-sphere deck made from two or three core sets difficulty goes down, two player game with dual-sphere decks difficulty goes down even more. Quest 3 from the core set is near impossible solo.\n\nIf you don't have anybody at hand to play with you might playing alone with two decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50118-difficulty-level/?do=findComment&comment=502816","commentId":502816,"userName":"Johnny Awesome","timestamp":1311325284,"content":"My take is similar.\n\nDifficulty = 2-player difficulty with mono-sphere decks.\n\nThe core game difficulty goes up when played solo and down with more players.\n\nThe Hunt for Gollum flips this around. It's easier solo and harder with more players.\n\nThe game gets easier in general with constructed multi-sphere decks and easier still if you use multiple core sets to get extra rare copies of certain powerful cards."}]}