{"url":"https://community.fantasyflightgames.com/topic/50283-collection-for-3-how-many-of-each-card/","title":"Collection For 3? How Many Of Each Card?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50283-collection-for-3-how-many-of-each-card/?do=findComment&comment=502689","commentId":502689,"userName":"Mattr0polis","timestamp":1311292085,"content":" Hi,\n\nOk, my friends and I are probably just going to share a collection and all build from that.\n\nIf you were doing something similar for 3 people, how many copies of each card would you aim for/keep in your collection?\n\nIn the most OCD, extreme example we could technically use 9x copies of a card if we all included 3x of the same card in a deck. But how reasonable is that?\n\nIt seems hard for even 2 people in a group to both use a bunch of stuff from the same sphere due to uniqueness rules, but I guess 2 of the 3 of us could run something like: 1 Hero from a shared sphere and 2 Heroes of a non-shared sphere and then include minor stuff. But do you think there'd ever really be a time where all 3 players could share a sphere decently? Or would that be pretty terrible? \n\nI keep thinking of stuff like:\n\nPlayer A: 2 Leadership Heroes, 1 Lore Hero\n\nPlayer B: 2 Tactics Heroes, 1 Lore Hero\n\nPlayer C: 2 Spirit Heroes, 1 Lore Hero\n\nAnd then all of us being able to include 3x Forest Snare, etc. or something. But is this worth the loss of a possible better 3rd Hero for everyone?\n\nAnd now with Bilbo out in the first Adventure pack, 2 players could both run 2 Lore Heroes, but would there be too many uniqueness overlaps or too much redundancy in those two decks for the team?\n\nI'm just trying to gauge what is worthwhile, and about how many more Core sets our group needs, and how many copies of each card to keep around.\n\nOh, except for Gandalf. We definitely already know how many Gandalf to keep around: 9. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\n \n\nThanks for any advice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50283-collection-for-3-how-many-of-each-card/?do=findComment&comment=502713","commentId":502713,"userName":"Kiwina","timestamp":1311297920,"content":"I think buying two of each adventure pack would give you enough options for the three of you.  If you ever do find a specific sphere or card in high demand among yourselves, you can always buy a third one later.  With the core set I would say that if you want to be more thrifty just buy two, but if you don't mind each buying one you'll have 3 copies of each of the \"rare\" cards."}]}