{"url":"https://community.fantasyflightgames.com/topic/50356-alone-in-the-dark-for-a-better-solo-experience/","title":"Alone in the Dark - for a better solo experience.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50356-alone-in-the-dark-for-a-better-solo-experience/?do=findComment&comment=503268","commentId":503268,"userName":"sortylege","timestamp":1311424730,"content":"Alone in the Dark\n-----------------\nA simple variant for a better solo game\n\nIntroduction\n------------\nWe see two problems in the core set scenarios when playing solo:\n1) the start is often too much difficulty and overwhelming (e.g. second and third core set scenario)\n2) if I manage to go beyond the first stage, I have too many allies and attachments and nothing stops my heroes: the second and third stage are really too much easy to complete.\n\nIn order to avoid the first problem, many people stop playing in real solo and play with 2 decks, 2 card hands and 2 sets of heroes, simulating a 2-player game.\n\nThese simple rules have been studied and successfully tested to obtain a better solo game: the difficulty is progressive and the game is still a real solo experience.\n\nPlay the game as per standard rules but with the following differences.\n\nSETUP\n-----\nRandomly choose 5 hero cards, it's better if they are at least of 3 different spheres. Don't choose them randomly only if you want to challenge a real difficult scenario.\nChoose 3 of these as Heroes and 2 of these as \"Special Allies\".\nPlace the Heroes face up in front of you - they are the only real Heroes of your game - and the Special Allies face up beside them.\n\nSpecial Allies\n--------------\nThey begin the game face up on the table just like the heroes, but you must consider them like Allies and not Heroes. For example, they cannot receive damage from an Undefended Attack and they cannot receive the \"Caught in a Web\" Attachment. Imagine them as two allies that follow the heroes at distance.\n\nThey have only a special feature: they receive the resource tokens just like heroes.\n*) These resource tokens can't be ADDED with hero resources to play cards (even neutral ones) or activate effects. For example you can't play a Gandalf that costs 5 tokens, using 3 tokens from the Special Allies and 2 tokens from the Heroes.\n*) when you spend them to play an Attachment, you can't attach it to a Hero. Special allies aren't close to heroes.\n\nStaging Step of Quest Phase\n---------------------------\nDuring the first stage of the scenario, reveal one encounter card, as per standard rules.\nDuring the second and third stages of the scenario, reveal TWO encounter cards.\n\nEven More Alone\n---------------\nJust like \"Alone in the Dark\" variant, but with only 1 Special Ally instead of 2.\nUse this variant when, after you see the 5 heroes, you feel pretty sure you will be victorious!\n\nHit me More!\n------------\nJust like \"Alone in the Dark\" variant, but during the third stage of the scenario, you reveal 3 encounter cards instead of 2. Use this variant when the third stage of the scenario seems too much easy for you."}]}