{"url":"https://community.fantasyflightgames.com/topic/50368-threat-spiralling-out-of-control-in-solo-game-and-therefore-making-no-progress/","title":"Threat spiralling out of control in solo game and therefore making no progress","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50368-threat-spiralling-out-of-control-in-solo-game-and-therefore-making-no-progress/?do=findComment&comment=503382","commentId":503382,"userName":"heptat","timestamp":1311453248,"content":"Just started playing (solo only at the moment) LotR LCG and I'm wondering if I've got a rule or two wrong.\n\nI've tried 3 out of the 4 spheres so far (haven't tried spirit yet), and in every game I find as the cards build up in the staging area (mostly location cards), the threat gets so high I can hardly score any progress. The best success I've had is with the lore deck and starting with three heroes (I've also tried starting with fewer heroes to keep threat low at the start).\n\nI've been playing that once a card goes into the staging area, it stays there until such time as you deal with it (engage an enemy or travel to the location). Is this correct?\n\nMaybe I'm doing something else wrong...but I have read the rules and the FAQ.\n\nAny help appreciated, thanks.\n\nGreat game by the way happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50368-threat-spiralling-out-of-control-in-solo-game-and-therefore-making-no-progress/?do=findComment&comment=503419","commentId":503419,"userName":"heptat","timestamp":1311462420,"content":" Finally won solo with a mono-sphere spirit deck. That deck keeps threat low so you can keep enemies in the staging area, but still lay down enough willpower to keep making progress. Nice. Will try the second scenario with the spirit deck..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50368-threat-spiralling-out-of-control-in-solo-game-and-therefore-making-no-progress/?do=findComment&comment=503481","commentId":503481,"userName":"Spirit Juggler","timestamp":1311480680,"content":"Are you still counting threat even once monsters have been engaged? When a monster is engaged it moves out of the staging area and you no longer count their threat. Same when you travel to a location. The active location does not add it's threat to those that are in the staging area.\n\nAlso just another thought. When you resolve the shadow effect of cards in  a fight are you just doing to text underneath the bold line at the bottom of the card? \n\nThese are some of the common mistakes that get made with this game and can make it much much harder to complete successfully."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50368-threat-spiralling-out-of-control-in-solo-game-and-therefore-making-no-progress/?do=findComment&comment=503485","commentId":503485,"userName":"heptat","timestamp":1311481713,"content":"spirit said:\n\nAre you still counting threat even once monsters have been engaged? When a monster is engaged it moves out of the staging area and you no longer count their threat. \n\n\n\nI definitely made this mistake for the first couple of games, but I'm confident now I'm doing everything correctly, thanks.\n\nI'm already thinking about combining spheres and building decks...this is a great game gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"}]}