{"url":"https://community.fantasyflightgames.com/topic/50421-hey-guys-just-wanted-to-congratulate-you-on-a-job-well-done/","title":"Hey Guys, just wanted to congratulate you on a job well done! ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50421-hey-guys-just-wanted-to-congratulate-you-on-a-job-well-done/?do=findComment&comment=503729","commentId":503729,"userName":"Bonus Card","timestamp":1311546582,"content":" Nate, you did an awesome job on this game. You have made LOTR card game players proud as well as general fans as far as I am concerned. \n\nPlus a card game that is as much fun solo as it is with friends, is a wonderful idea, and plus you made it fun.\n\nFor anyone who has been complaining about expansions. I say take your time, you should not rush a truly awesome game like this. For most of you, you are familiar with Decipher's LOTR CCG and how it turned out. Just let the creation of a stellar game take its time to become awesome. Creation, testing and rulemaking take time, after all, we don't want broken cards.\n\n \n\nAs for Lukas - I know you had a hand in the making and distribution of this game somewhere or another so thanks for that. And as I read the FAQ list I think I saw that you were involved with that, too. I'm not sure but I think I saw some of your input in there \n\n \n\nA: There is nothing in the rules that disallows this, although a player will need to find clever card interactions to make use of such cards.\n\n \n\nIt seemed a bit humorous to me, however, I find humor in the unfunny so it might just have been a rules clarification.\n\n \n\nAnyway, Luke, I am in Taiwan right now, as I have been for the past four years. Believe it or not this is the only game of FFG I could get my hands on over here. Very sad but true. I hope you can find it in your heart to hook me up with some promos for this game or AGOT LCG that I might have missed in my time abroad. Other than that I hope we can discuss other ventures very soon,  too."}]}