{"url":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/","title":"Strange Eons plugin for encounter cards and quest cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=503928","commentId":503928,"userName":"HilariousPete","timestamp":1311586285,"content":"Hi everyone,\n\nwhile waiting for the first adventure pack to be released, I decided to create a Strange Eons plugin for a more faster way of creating fan-made quest cards than through photoshop or likewise programs. Now here it is, the LotR encounter pack plugin for Strange Eons! You will be able to create encounter cards of all types (location, enemy, treachery and objective) and quest cards (but no hero or player cards). You can download the plugin from here:\nwww.4shared.com/file/_VH6sOk6/LotR.html [http://www.4shared.com/file/_VH6sOk6/LotR.html]\nIf you don't know Strange Eons, it is a great program from C.G. Jennings, originally written to make custom Arkham Horror cards, but very versatile and expandable:\ncgjennings.ca/eons/index.html [http://cgjennings.ca/eons/index.html]\nMany thanks to C.G.Jennings, Jon New and Hurlanc for their plugins (from which I learned how to do plugins) and to Zorbec for his advice.\n\nThe plugin is experimental and version 1.1 to date. I think most mistakes should be eliminated now ;-), but if you encounter something, don't hesitate to write here; comments and suggestions are always welcome.\nThe quality is somewhat inferior compared to the cards from FFG, but the differences should be little on home inkjet or laser printers, and I think the quality is well enough for fanmade cards.\n\nSo then, enjoy and happy card creating :-)\nHillarious Pete"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=504454","commentId":504454,"userName":"Rhuarc","timestamp":1311676378,"content":"Thank you so much, hoped someone would do that for this great game! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nNow only need to find someone to do the same for A Game of Thrones..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=504575","commentId":504575,"userName":"HilariousPete","timestamp":1311690472,"content":"Thanks, you're welcome! It's great to know that it'll be of use for someone ;-)\n\nBy the way, I uploaded a new version (v 1.2). In the last version, an option for changing the encounter sets on the front sheet of quest cards was missing. Now you can select up to 6 different icons in the tab for the front side.\n\nBest Regards,\nHilarious Pete"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=504620","commentId":504620,"userName":"Doom1502","timestamp":1311697039,"content":"Hi!\n\nWhat a great tool! Thank you very much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=504849","commentId":504849,"userName":"Rhuarc","timestamp":1311750033,"content":"Do you consider adding heroes and player cards as well at some point in the future, or will it 'only' support cards for the encounter deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=504905","commentId":504905,"userName":"HilariousPete","timestamp":1311756610,"content":"No, it's not planned for the next time. There are several reasons for it. The most important one - it's very time consuming (4 spheres + 1 neutral \"sphere\" makes 5 different suits - for  allies, events, attachments and heroes), and I have an exam coming. Another reason is balancing - in my opinion, creating balanced heroes and allies is very difficult. Some players (at least megui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]) could be tempted to create just the cards he looks for - e.g. a good fighter+defender ally for the Lore sphere, an hero or ally with high willpower strength for Tactics and so on. The specialty of each sphere could get lost. And the number of available heros is limited, too (consider e.g. the Hobbit: 13 dwarves, 1 Hobbit, Bard the Bowman, Thranduil, Elrond, Dain and perhaps an eagle), so chances are good that the hero will sooner or later be available in an adventure pack or another core set anyway.\n\nSo perhaps in the future I will change my opinion and support more card types in it when I have enough timehappy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif], but don't expect it in the next months..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=507444","commentId":507444,"userName":"edmil","timestamp":1312250581,"content":"Fantastic job on the plugin, works a treat well done.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50444-strange-eons-plugin-for-encounter-cards-and-quest-cards/?do=findComment&comment=543225","commentId":543225,"userName":"HilariousPete","timestamp":1318855292,"content":"I published a new version. More informations in a new thread:\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=565482 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=565482]\n\n \n\nGreetings,\n\nPete"}]}