{"url":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/","title":"1st and 2nd Age","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=504401","commentId":504401,"userName":"Rashley","timestamp":1311669580,"content":"Most stories, and thus games, revolve in and around the 3rd Age of Middle Earth.  Obviously so, because of the wealth of information from Tolkien.  Has there been much info about the first 2 Ages?  Is there enough for someone to take up the mantle, or would it all have to be 'made up' from scratch?  Am I right in thinking the 'Similarion' goes right back in time?  You could say that about a lot of novel and game material.  Westeros had a rich history before 'Song of Ice and Fire'.  'Star Trek' and 'Star Wars' got stretched in both directions.  Hmm, it has got my imagination juices flowing, what about anyone else?  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=504408","commentId":504408,"userName":"Spirit Juggler","timestamp":1311670337,"content":"To be fair there is quite a lot of info and stories in the other two ages so I doubt it would be that difficult to do. Would depend on the cost of licensing though I guess. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=504442","commentId":504442,"userName":"timbolton","timestamp":1311674585,"content":"The Silmarillion, Book of Lost Tales, The Tale of Hurin and more cover many various stories from the First and Second Age. There are plenty of fans out there who would love to see the two eras 'fleshed' out as a rpg, ccg, etc. Those books were put together for publishing by JRR Tolkien's son, Christopher. The History of Middle Earth covers more unpublished material from the earlier ages as well and was also by Christopher Tolkien.\n\nHowever all of those were published after JRR Tolkien's death and it was his son who was fundamental to them being published. From what I understand, the licence held by most current companies publishing LOTR stuff does NOT cover material published after JRR Tolkien's death - the First/Second Ages are covered a little by LOTR so they can be mentioned to an extent. Anything by Christopher is not in the paid for licence. That is my understanding."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=504715","commentId":504715,"userName":"geristor","timestamp":1311712018,"content":"There has also been a lot of roleplaying books, mainly by iron crown enterprises, which in part detail characters and events from the 1st and 2nd age.\n\n \n\nMiddle earth roleplaying (I.C.E) did character books, equipment books, early 3rd age stuff ie rise of Angmar.\n\n \n\nthere is a lot of stuff out there"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=504783","commentId":504783,"userName":"Rashley","timestamp":1311735969,"content":"Thanks everyone!  It looks like there is plenty of good source material out there, but it could be a matter of broking a deal for copyright.  With the renewed interest in LOTR - even the new film of The Hobbit would boost that - it could be some time before the interest in 3rd Age wanes, leaving a void to be filled by 1st / 2nd.  Imagination is a wonderful thing!  Anyone else curious about what happened to Bilbo and Frodo when they crossed the seas with the Elves?  Did Aragorn and his queen rule well in Minus Tirith?  Did Mordor get repopulated and by whom?  Burning questions which must be answered before I go mad.  Mad!  MAD!!  Sorry, I got carried away.  Any more of that and it could become literal - in a staight jacket!  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=504787","commentId":504787,"userName":"Mighty Jim 83","timestamp":1311736254,"content":"I can't remember the details, but if you look in the Return of the King (book, not film) don't the appendices have some details on Aragorn's reign and what came after? I don't think it says enormous amounts, but it might soothe your cravings for knowledge for a little while."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=505839","commentId":505839,"userName":"Iver2","timestamp":1311912717,"content":"Great thread! I have always dreamed of more games/movies/series??!! in the 1st and 2nd Age. I think there is enough stuff out there and i guess no Tolkien fan would bash a bit of imagination of a writer responsible for the story of one of those if done well. (for instance not the the \"ULTRA-hollywood\" way ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=507932","commentId":507932,"userName":"Cubsfan44","timestamp":1312315342,"content":"I would venture to say that there is more material concerning the first and second ages of middle earth than even the third. The silmarillion, along with the children of hurin, the book of lost tales, and unfinished tales cover a much broader history then The Lord of the Rings trilogy. Tolkien always considered the Silmarillion to be his greatest work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=508144","commentId":508144,"userName":"jhaelen","timestamp":1312342125,"content":"Cubsfan44 said:\n\nTolkien always considered the Silmarillion to be his greatest work.\n\n\n\nWhich Tolkien are you talking about? J.R.R. didn't live to see its publication, since it's initial version was (rightly) rejected as being too 'obscure'.\n\nYou have to be a pretty die-hard fan to like the Silmarillion. For more casual readers it's incredibly tedious. I know that I was skim-reading more sections than not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=508173","commentId":508173,"userName":"Iver2","timestamp":1312347554,"content":"jhaelen said:\n\nCu\n\n \n\nYou have to be a pretty die-hard fan to like the Silmarillion. For more casual readers it's incredibly tedious. I know that I was skim-reading more sections than not.\n\n\n\nhmm, i am not sure what you are talking about, the way the Silmarillion is written makes it the great epic book it is. True, its not linear story as LotR, but that's what makes it special."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=508237","commentId":508237,"userName":"timbolton","timestamp":1312359270,"content":"geristor said:\n\nThere has also been a lot of roleplaying books, mainly by iron crown enterprises, which in part detail characters and events from the 1st and 2nd age.\n\nMiddle earth roleplaying (I.C.E) did character books, equipment books, early 3rd age stuff ie rise of Angmar.\n\n there is a lot of stuff out there\n\n\n\nAgreed, though my understanding is that ICE didn't have the license either for 1st/2nd Age stuff and the Tolkien estate weren't too happy with the \"liberties\" they were taking.\n\nNo 1st/2nd age stories were ever published by JRR Tolkien. His son, Christopher, got them to a level where they could be published, after JRR Tolkien's death. There are people who there who don't consider them canon since it was the son and not JRR Tolkien himself who's version is out. I'm not that fussed, Christopher had unprecedented access and also grew up with these stories. I'll trust what he did.\n\nThere is a very different feel from 1st/2nd Age to 3rd Age stuff - I love all the eras. And yes, the books covering the earlier ages are less \"accessible\" than the Hobbit or LOTR, but there are some epic stories there, and are so worthwhile if you can read them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=508240","commentId":508240,"userName":"timbolton","timestamp":1312359376,"content":"Iver said:\n\njhaelen said:\n\n \n\nCu\n\n \n\nYou have to be a pretty die-hard fan to like the Silmarillion. For more casual readers it's incredibly tedious. I know that I was skim-reading more sections than not.\n\n \n\n \n\nhmm, i am not sure what you are talking about, the way the Silmarillion is written makes it the great epic book it is. True, its not linear story as LotR, but that's what makes it special.\n\n\n\nI think they are talking about the style of writing - closer to an Old English or Biblical feel (Old Testament especially) in the way it reads. It can be tough going for some, I believe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50495-1st-and-2nd-age/?do=findComment&comment=508634","commentId":508634,"userName":"Mighty Jim 83","timestamp":1312426262,"content":"The opening first few chapters of the Silmarilion are very different in style to the rest - as a previous poster said, it feels almost biblical in parts.\n\nBy contrast, the later stuff (for example the section that was expanded into The Children of Hurin) is a much more normal-style narrative, and I could see it making the transition to big screen/ LCG cards/ etc. quite easily (although given some of the rumours I've heard about the liberties being taken with the Plot in the Hobbit, I'm not sure whether that would be a good idea or not.)"}]}