{"url":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/","title":"Four player - 1 sphere each?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=504791","commentId":504791,"userName":"Mighty Jim 83","timestamp":1311736568,"content":"Simple question, if you're planning on a four-player game, would you go with 4 mono-sphere decks?\n\nobviously the advantages are in simplicity. Everyone can use any of their heroes to pay for any of the cards in their deck, and each of the four spheres gets some kind of coverage.\n\nOr else would you divide it up? even in a four-player game, do you need multiple players carrying spirit cards for threat reduction or Unexpected Courage. Are there simply too few tactics cards to be worth rrunning a whole deck, and you'd rather just have a few tactics attachments and allies as minor elements in several decks?\n\ndo you think the answer to this question will change as the number of heroes available and the card pool grows?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=504807","commentId":504807,"userName":"cootewards","timestamp":1311738840,"content":"The one time I've tried with four players and we just stuck with mono sphere decks. In fact we just used a single starter so they were the 30 card decks and it worked fine. Easy but fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=504827","commentId":504827,"userName":"Mighty Jim 83","timestamp":1311745728,"content":"which quest were you doing? 4-player Passage through Mirkwood is pretty straightforward- unless you run into a massive string of locations, and can't get a Northern Tracker out. I figure the division of spheres will be a bigger issue with trickier quests"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=504933","commentId":504933,"userName":"cootewards","timestamp":1311759154,"content":"We did all three of the quests in the core set one after the other.\n\nWe switched spheres each quest so people got to try something different each time.\n\nIt's pretty easy to beat the quests with 4 players even with just the starter mono decks. I'd think if you made up proper 50 card decks you'd walk all over any of the quests with 4 players.\n\nI think it works pretty well just thinking of it as a 4 player board game where each player has a single sphere deck, a bit easy but still it was an afternoon filled with fun.\n\nAlso hoping as the adventure packs keep coming they will get better and the scaling above 2 players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=504949","commentId":504949,"userName":"Kiwina","timestamp":1311760065,"content":" When I've played 4-player games we've used mono decks.  Partially because everyone was still learning the game, and I didn't want to deal with each player using two different resources, and partially because I didn't take the time to create the decks.  When we played Escape from Dol Guldur it was to prevent anyone from being more hampered than they already were by temporarily losing a hero.  I remember when the game first came out there were some people who posted about creating four two-sphere decks to create an extra challenge.\n\nThe only reason I can think of for needing a couple players to use the same sphere is for more copies of a card (six or nine instead of three).  Other than that I would just call it player preference.  I think as more adventure packs are released two things will probably happen.  Multi-player games will see two or more decks with the same strong sphere, and people will also start using mono-sphere more because there will be enough cards to create 50 card decks with one sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=505293","commentId":505293,"userName":"noosphear","timestamp":1311811387,"content":"My group plays a ton of four player and we always play dual sphere decks.  We follow all the deck building rules in the game (no repeat heroes, etc.) and the game is a blast.  The first two quests are extremely easy but the third one still presents a pretty decent challenge even though we usually win.\n\nHunt for Gollum adds some mechanics that start to really hurt with more players and that is pretty exciting.  The quest is really easy with four people, but the locations and effects that get meaner the more players you have seem to show that FFG has their eye towards making quests more difficult for more players.  It scales the quest well and makes it very interesting.\n\nWe also love deck building together and have for quite some time.  We played the crud out of the World of Warcraft TCG raids and spent a lot of time optimizing decks to beat them as efficiently as possible.  That type of co-op play is the main draw of the game for our group.  It probably not ideal but it is very possible to just swap some heroes to play multi-sphere decks with people you didn't build your deck with and will become even easier as more heroes are released."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=505843","commentId":505843,"userName":"Iver2","timestamp":1311913196,"content":"Guy, with 3 or 4 players, you have to try to beat the \"helping friends\" community scenario from \"letsdance\".\n\nIt harder with more players! Especially with just one core, as we used it. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEnjoy the challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=505854","commentId":505854,"userName":"shadowleaper","timestamp":1311916315,"content":" Do I need two core sets to play 3-4 players?  If so what's the setup, if not, how do i setup with an extra core set?  Please someone help! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=505892","commentId":505892,"userName":"Iver2","timestamp":1311925403,"content":"shadowleaper said:\n\n Do I need two core sets to play 3-4 players?  If so what's the setup, if not, how do i setup with an extra core set?  Please someone help! \n\n\n\nyour second quesiton doesn't make sense to me. ^^\n\nWell, basically, to get a troutnament deck togehter you would need 2 cores for 3-4 players, as you need at least 50 cards  per player at least. But you can even play with mixed spheres with one core with 3 players. Quite easy: Each player selects a major sphere and selects two heroes of this sphere and one hero of a sphere that is \"split\" between all three players a minor sphere (of which each player gets one heros). We always split spirit as it has the lowest cost cards.\n\nYou can also mix sphere with 4 players, although i didn't play with 4 players yet or mono spheres.\n\n \n\nOther than that you play the scenario normally.You do not double the encouter cards or so.... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nHope this helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=505898","commentId":505898,"userName":"reno1051","timestamp":1311926401,"content":"you can play with one core.  Each player would be one of the spheres.  You draw an encounter card for  each player (so 4 encounter cards a turn for a 4 player game).\n\nwith 2 core sets, you can get into psuedo-deckbuilding for 4 players, but i would guess that would only be adding whatever cards are missing from each sphere in 1 core set (1 uncommon and 1 rare card).  depending on the cards you use, you may be able to make 4 multi-sphere decks or at least 1 for a 4 player game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50536-four-player-1-sphere-each/?do=findComment&comment=506015","commentId":506015,"userName":"Kiwina","timestamp":1311940863,"content":"shadowleaper said:\n\n Do I need two core sets to play 3-4 players?  If so what's the setup, if not, how do i setup with an extra core set?  Please someone help! \n\n\n\nCurrently the benefit of a second core set is more player cards, more tokens, and two extra threat trackers.  You can still play the game with four people using only one core set.  I do.  You have to be willing to use decks with less than 50 cards and have substitute threat trackers.  As more adventure packs are released the number of cards won't be much of an issue.\n\nThe setup for a 3-4 player game will be the same whether or not you have two core sets.  You only use the encounter cards from one core set when setting up the game regardless of how many players there are."}]}