{"url":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/","title":"Frodo or Eleanor?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507132","commentId":507132,"userName":"Shelfwear","timestamp":1312195869,"content":"I'm tinkering around with my Leadership/Spirit deck. It is for questing and threat control and works in combination with a lore/tactics deck which has fighting, healing and card drawing duties.\n\nSo far I used Theodred (Questing/Resource gathering) + Eleanor (canceling treacheries/blocking small enemies) + Eowyn (questing) but I'm not sure about Eleanor because her ability is not as good as \"A Test of Will\". Sometimes we even decide not to cancel a treachery because we dont want to draw another encounter card.\n\nNow, with Frodo on the horizon, would you replace Eleanor with him in this deck? They both have the same starting threat, just Frodo has one more willpower and one less hitpoint. Obviously he would do questing and might be used for blocking when needed. My Spirit/Leadership deck normally does not get involved into fights much and has only \"utility\" allies (Northern Tracker, Lorien Guide, Faramir for questing), Took for threat control and Snowborn Scout/Silverlode Archer (Meat shield and helping the other deck).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507149","commentId":507149,"userName":"Kiwina","timestamp":1312198123,"content":" Frodo will help more with questing, but he'll make threat control more difficult.  However, you do have allies that can be good in combat, so using Frodo may not cause you to raise your threat too much.  It all depends on what the encounter deck sends at you, and how you use Frodo's ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507191","commentId":507191,"userName":"TheLightdarker","timestamp":1312204520,"content":"Shelfwear said:\n\n \n\nI'm tinkering around with my Leadership/Spirit deck. It is for questing and threat control and works in combination with a lore/tactics deck which has fighting, healing and card drawing duties.\n\nSo far I used Theodred (Questing/Resource gathering) + Eleanor (canceling treacheries/blocking small enemies) + Eowyn (questing) but I'm not sure about Eleanor because her ability is not as good as \"A Test of Will\". Sometimes we even decide not to cancel a treachery because we dont want to draw another encounter card.\n\nNow, with Frodo on the horizon, would you replace Eleanor with him in this deck? They both have the same starting threat, just Frodo has one more willpower and one less hitpoint. Obviously he would do questing and might be used for blocking when needed. My Spirit/Leadership deck normally does not get involved into fights much and has only \"utility\" allies (Northern Tracker, Lorien Guide, Faramir for questing), Took for threat control and Snowborn Scout/Silverlode Archer (Meat shield and helping the other deck).\n\n \n\n \n\nI vote yes, swap out Eleanor for Frodo.  I play a similar two-player setup as you do, so here are my decks to give you some food for thought regarding the upcoming expansion (they are designed to win against any scenario):\n\nSpirit/Lore Questing/Support Deck\n\nHero (3)\nBeravor (Core) x1\nDunhere (Core) x1 - (He will be replaced by Frodo.  I rarely get to use his ability, and I have the same complaints regarding Eleanor that you do.  Better ability to quest and emergency damage absorption would be more useful than him questing for 1 or just doing nothing)\nEowyn (Core) x1\n\n Ally (18)\nDaughter of the Nimrodel (Core) x3\nGandalf (Core) x3\nGleowine (Core) x2\nMiner of the Iron Hills (Core) x2\nNorthern Tracker (Core) x3\nWandering Took (Core) x2 - (Will be replaced by Eomund x2)\nWestfold Horse-Breaker (THfG) x3 - (Can ready Gimli for an extra swing)\n\nAttachment (12)\nSelf Preservation (Core) x3\nUnexpected Courage (Core) x3\nThe Favor of the Lady (Core) x3 - (Will probably be replaced by Wandering Took x3)\nForest Snare (Core) x3\n\nEvent (20)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x3\nHasty Stroke (Core) x3\nRadagast's Cunning (Core) x3\nSecret Paths (Core) x3\nStand and Fight (Core) x2\nThe Galadhrim's Greeting (Core) x3\n\nLeadership/Tactics Tanking/Combat Deck (No clue what changes CatC will bring.  I recently switched from 2 Leadership heroes to 2 Tactics heroes [swapped Gloin for Gimli], because resources were not the issue so much as Leadership having weaker allies than Tactics was [i.e., Silverlove Archer v Horseback Archer.  Plus, Gimli is an absolute tanking and damage beast with Citadel Plates)\n\nHero (3)\nGimli (Core) x1 - (Massive damage for high-HP trolls, can be readied through many effects)\nLegolas (Core) x1 (Ranged + sweet ability)\nTheodred (Core) x1 - (Tosses resources to Beravor for 2nd turn Forest Snare, etc or Spirit heroes as needed)\n\n Ally (23)\nGandalf (Core) x3\nFaramir (Core) x2 - (Expensive. Played more often than not through discard + Stand and Fight)\nGondorian Spearman (Core) x3 (Sentinel)\nGuard of the Citadel (Core) x3\nHorseback Archer (Core) x3 (Ranged)\nSnowbourn Scout (Core) x3 (Recently took out 2x Beorn [too expensive] and 1x Blade of Gondolin [too many restricted attachments] to add these cheap blockers that help a lone Northern Tracker pick off locations.  Plus, I've had one of these guys absorb Eastern Crows attacks for like 3 rounds straight)\nVeteran Axehand (Core) x3\nWinged Guardian (THfG) x3 (4 defense = the 4 attack of Nazgul of Dol Guldur.  Costs resources, but has sentinel, saves allies and leaves Gimli ready to attack)\n\nAttachment (18)\nBlade of Gondolin (Core) x2 (not as useful since Dunedain Mark was released)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDunedain Mark (THfG) x3\nDwarven Axe (Core) x3 (three may be excessive)\nHorn of Gondor (Core) x2 (swap an axe out for another horn?)\nSteward of Gondor (Core) x3\n\nEvent (9)\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\n\nedit: The way these decks work together is that the Leadership/Tactics essentially tries to engage every enemy it can, while leaving almost all of the questing to the Spirit/Lore.  The support deck tries to control treacheries, locations, etc when it can, and leaves most everything else to the combat deck.  It tries to get a card draw and enemy destruction engine going through Beravor and Gimli, respectively.  Steward of Gondor usually goes on Eowyn, and Theodred throws resources to various heroes as needed.  Horn of Gondor typically goes on Legolas, since Tactics occasionally has to scramble for adequate resources as well.  Leadership cards are all so cheap that there is usually no difficulty whatsoever getting those out, and both decks can manage threat relatively effectively through either The Galadhrim's Greeting or Sneak Attack + Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507204","commentId":507204,"userName":"Bohemond2","timestamp":1312205415,"content":"Kiwina said:\n\n Frodo will help more with questing, but he'll make threat control more difficult.\n\n\n\nUnless you have a surplus of available healing, I don't see how Frodo would make threat difficult to control.  Keep in mind that any situtation in which Frodo generates a substantial amount of threat is a situation which would kill Elanor.  And keeping a hero alive is almost always going to be more useful (and, in the long run, do more for controlling threat), than gaining a few points of threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507259","commentId":507259,"userName":"avgzxc","timestamp":1312210897,"content":"Frodo just doesn't die. You can't even lose actually. Even some ridiculous 3rd scenario 1st turn all in done by 2 spiders(when revealed = lol) and 3 orcs can't really kill you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507269","commentId":507269,"userName":"SiCK_Boy","timestamp":1312212050,"content":"I'd also do the swap.\n\nI've come to the same realization about Eleanor: her ability is really a last ditch effort and, most of the time, you're better off \"sucking up\" the treachery rather than risking replacing it by a worst threat.\n\nThe only true advantage of Eleanor is allowing you to cancel treachery revealed during setup. It can make a critical difference on Escape from Dol Guldur (if you reveal a Caught in a Web at the start) and The Hunt for Gollum (if you get the treachery that forces everyone to exhaust if they can't pay 1 resource), but other than that, you'll let most treacheries resolve.\n\nHowever, you deck with Frodo - Eowyn - Theodred still lacks a true defender. I'm always trying to use the quester - attacker - defender setup with my hero. In your case, you could consider Theodred to be the attacker (2 points of power), even if he often quests, but you still end up with 2 quester. Maybe swapping Theodred for Denethor? Or go for Aragorn, if you can deal with the increased threat (and with Celebrian's Stone, he would complement your team)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507273","commentId":507273,"userName":"Kiwina","timestamp":1312212363,"content":"Bohemond said:\n\n \n\nKiwina said:\n\n \n\n Frodo will help more with questing, but he'll make threat control more difficult.\n\n \n\n \n\nUnless you have a surplus of available healing, I don't see how Frodo would make threat difficult to control.  Keep in mind that any situtation in which Frodo generates a substantial amount of threat is a situation which would kill Elanor.  And keeping a hero alive is almost always going to be more useful (and, in the long run, do more for controlling threat), than gaining a few points of threat.\n\n \n\n \n\nPerhaps a better way of putting it is that your ending threat will probably be higher with Frodo than with Eleanor, because Frodo can increase threat instead of taking damage.  It may be a small amount, like one, because of Necromancer's Reach, but that's one threat higher than you'd have if Eleanor was your hero.  Eleanor has the ability to stop some nasty treachery cards, while Frodo can't.  I also was thinking about how I would play the two.  I would have Frodo quest unless I was already engaged with an enemy or knew I would engage an enemy during the round.  Eleanor, however would stay ready during questing until her power was needed, and like the OP said, it's not always needed.  If an enemy unexpectedly encounters you during a round, there is a greater chance Eleanor will be an available defender than it is that Frodo will be (the way I see myself playing him).  If there are no characters to defend, then Frodo's power is activated, and your threat goes up.  With Eleanor, I always try to make sure there is someone to defend, but that lessens my questing power.  Yes, if a big enemy comes at you and Frodo has to use his ability because he's defending, Eleanor would be defeated in such a situation, and Frodo would not.  However, I'm going on the assumption that the other deck is taking the majority of enemies, and especially the big ones since that is the job of that deck.\n\nUltimately I would play Frodo over Eleanor with that deck, but I believe that the ending threat will be higher, not by much, but higher.  Again, it depends on how you end up playing Frodo and what the encounter deck throws at you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507276","commentId":507276,"userName":"Shelfwear","timestamp":1312212803,"content":"SiCK_Boy said:\n\nHowever, you deck with Frodo - Eowyn - Theodred still lacks a true defender. I'm always trying to use the quester - attacker - defender setup with my hero. In your case, you could consider Theodred to be the attacker (2 points of power), even if he often quests, but you still end up with 2 quester. Maybe swapping Theodred for Denethor? Or go for Aragorn, if you can deal with the increased threat (and with Celebrian's Stone, he would complement your team).\n\n\n\nCheers for the insights.\n\nThis deck is set up for a two-player game. For solo play I agree that it needs a steady defender. The other players deck has Denethor and Gimli for the fighting and if some low threat enemy comes to my side I usually use a Snowborn Scout or Faramir to defend and kill them with Theodred or Silverlode Archer. Putting Aragon in it would raise the threat quite a bit making it more difficult to direct all enemies to the other deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507282","commentId":507282,"userName":"Shelfwear","timestamp":1312213043,"content":"Kiwina said:\n\nUltimately I would play Frodo over Eleanor with that deck, but I believe that the ending threat will be higher, not by much, but higher.  Again, it depends on how you end up playing Frodo and what the encounter deck throws at you.\n\n\n\nYes, there is the danger of accelerated threat increase due to Frodo blocking/taking damage. So far I always had 10-15 points less threat than the other player (3x Galathrims Greeting, 3x Dwarven Tomb and 3x Wandering Took)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507283","commentId":507283,"userName":"Bohemond2","timestamp":1312213167,"content":"SICK_BOY, I would agree with your assessment of the threat that Frodo's power may generate.  But, I think you are overlooking the threat reduction from Frodo's superior questing prowess.  If a deck with Eleanor' fails to quest once or twice over the course of the game, Frodo;s high willowper will offset any threat he generates from preventing small amounts of damage. \n\nThough her power is situationally useful, I would almost always replace Frodo with Eleanor.  However, I could also see a deck that strives for an incredibly low starting threat putting both of these heroes on the field."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507291","commentId":507291,"userName":"Glaurung","timestamp":1312214363,"content":"I think Frodo is super hero and he will appear in many different decks. Replace Eleaonor for him????\n\nI think use them both + Aragorn. This should be very coll control deck!!! Aragorn and Frodo quest, Eleanor wait and ready to avoid the treachery.\n\nStarting threat 7+7+12=26. Very low and very ok.\n\nAragorn +stone +frodo quest 6. Not bad. Than Eomund will power 2. +Trackers and Lorien guide. Threat reduce with G. greetings. Ouch. Aragorn can fight with Dunedan marks and support by some strong allies.\n\nthere is lot of cards to make this deck powerful. Very interesting.This deck will be one of the best it current metagame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50774-frodo-or-eleanor/?do=findComment&comment=507406","commentId":507406,"userName":"qwertyuiop","timestamp":1312238571,"content":" I fully intend to try a build using both of them for a two player deck."}]}