{"url":"https://community.fantasyflightgames.com/topic/50796-signs-of-gollum-question/","title":"Signs of Gollum Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50796-signs-of-gollum-question/?do=findComment&comment=507299","commentId":507299,"userName":"Phantom287","timestamp":1312215545,"content":"Okay, so Signs of Gollum is a guarded card, but what I want to know is where is the guard coming from? Am I supposed to draw the next card from the encounter deck and if it's a location or enemy, attach it to the objective, or do I assign a enemy or location still in the staging area to guard the objective?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50796-signs-of-gollum-question/?do=findComment&comment=507306","commentId":507306,"userName":"Strovengard","timestamp":1312216909,"content":"The rules say:\n\n\"Guarded\n\nThe guarded keyword is a reminder on some objective\ncards to reveal and attach the next card of the encounter\ndeck to the objective when it enters the staging area\nfrom the encounter deck, and place them both in the\nstaging area.\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50796-signs-of-gollum-question/?do=findComment&comment=510513","commentId":510513,"userName":"rwjohnson","timestamp":1312735717,"content":"So suppose an enemy card is the next one to come out.  That card attaches to the clue.  You defeat the enemy, then the clue returns to the staging area.  Does that mean that the next card out of the encounter deck will also guard the clue?  So the only way you can claim the clue after successfully questing is if a treachery comes out (because the clue will now be unguarded)?  Or if you can get rid of the enemy or location before the end of the quest phase.  is that correct? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50796-signs-of-gollum-question/?do=findComment&comment=510527","commentId":510527,"userName":"Doom1502","timestamp":1312737901,"content":"Yes, correct. The only way to claim a clue guarded by a location in the same turn it shows up is with Strider's Path as you can instantly travel and therefore explore the location in the same quest-phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50796-signs-of-gollum-question/?do=findComment&comment=510543","commentId":510543,"userName":"radiskull","timestamp":1312740739,"content":" To answer your first question:\n\nFrom the rulebook (emphasis mine):\n\n\"Guarded\n\nThe guarded keyword is a reminder on some objective cards to reveal and attach the next card of the encounter deck to the objective when it enters the staging area from the encounter deck, and place them both in the staging area.\"\n\nOnce you defeat the enemy guarding the clue, it will remain unguarded.  Future cards drawn from the encounter deck will NOT attach to the clue (or any other guarded objective card, unless the card says otherwise).\n\n \n\n "}]}