{"url":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/","title":"fixing locations / northern trackers","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=507849","commentId":507849,"userName":"letsdance","timestamp":1312307857,"content":"problem:\nwith larger player numbers you draw more locations than you can possibly explore each round, due to the limit of 1 exploration per round. to make the game still playable, ffg added northern tracker who take care of the problem, because they can discard any number of locations from the staging area.\n\n \n\nit's a bad fix in my oppinion because it causes the following problems:\n1. northern trackers are absolutely required to win scenarios with certain player numbers. for the gollum expansion scenario it seems you even need them in 2 player games.\n2. with northern trackers, the abilities of locations become obsolete, because you are just discarding them from staging area anyways. i often caught myself not even reading the effect on locations anymore, because i knew i won't travel to them anyways.\n\nboth points are a major issue for me. 1. because no single card should be absolutley required (it's not the case with any other card). and 2. because travel and persistent effects on locations are really cool, thematically as well as mechanically.\n\nso here's my suggested fix:\nA. The players may travel to multiple locations during travel phase.\nB. There may be one active location for each player. If there are multiple active locations with less progress markers than quest points, the start player decides on which location progress markers are placed.\nC. Only active locations may be discarded as explored, and this is only possible between the quest and the travel phase.\n\nthis means you cannot discard any location without triggering its \"travel\" effect, and you have the persistent effect active for at least one round. northern trackers can still scout the locations for you in advance, but you have to actually travel there in order to fully explore them.\n\ni created a rules card, to be used with my custom scenarios, that shows this. but it can as well be used with any other scenario:\nhttp://www.boardgamegeek.com/image/1054832/the-lord-of-the-rings-the-card-game [http://www.boardgamegeek.com/image/1054832/the-lord-of-the-rings-the-card-game]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=507925","commentId":507925,"userName":"reno1051","timestamp":1312314248,"content":"yeah but then questing gets easier...way easier with 4 people"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508022","commentId":508022,"userName":"Mestrahd","timestamp":1312324327,"content":"It also just shifts the necessary card from Northern Tracker to Lorien Guide. But I like where you're going with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508157","commentId":508157,"userName":"letsdance","timestamp":1312343726,"content":"questing becomes easier - yes a bit. but if you look at the whole picture, i think the game becomes harder in most scenarios.\n\ni don't see why this forces a need for lorien guides. besides the fact that lorien guide only gives 1 progress marker no matter how many active locations you have, you can as well get those progress markers by questing. the problem with large games under original rules is, that you MUST discard locations from the staging area, because you have NO other choice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508428","commentId":508428,"userName":"avgzxc","timestamp":1312382416,"content":"It makes more sense for sure. I'd even go further and make the rule that players needs to be in the same location to serve to each other with ranged and sentinel keyword."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508524","commentId":508524,"userName":"Mestrahd","timestamp":1312397396,"content":"Lorien Guides become necessary because you are allowing 4 active locations and Northern Trackers to place tokens but not \"explore\". Therefore, 3 Lorien Guides becomes far more useful than 2 Trackers at only one more resource point. You Lorien Guide 3 progress tokens possibly exploring 2 locations per turn with the questing, then make the fully tokened Tracker locations active and get rid of those as well, and the game is still just as hard or easy as it was before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508647","commentId":508647,"userName":"GhostWolf69","timestamp":1312427669,"content":"I agree (I think we all do, even the ones that argue against you) that Northern Tracker is a VERY good Ally. So much so in fact that I have a feeling they will be restricted from Tournaments. No argument there.\n\nBUT, it is not impossible to win a game without them. We've had 2, 3 and 4 player games in the Anduin Quest ending in success, without any Trackers coming into Play.\n\nWe've also had a Dol Goldur Quest ending in Success without any Trackers ever coming into in play. (3 Players)\n\nSo it can be done. They are NOT \"Absolutely Required\".\n\nBut you are right, I cursed every round I didn't draw one.... and had I got it we would probably have got a better score than we did.\n\nAnother Card that should be mentioned here is \"Strider's Path\" because clever use of this card will let you Explore 2 Current Locations Each round. Combined with Legolas and some daggers you could potentially Explore even 3 or more Locations... (Using \"Quick Strike\", and Readying Legolas in between using some of that cards that allow for that.) \"Strength of Will\" can also accommodate this.\n\nSo, yes Northern Tracker is Awesome, but there are other ways.\n\n/wolf\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508694","commentId":508694,"userName":"letsdance","timestamp":1312436984,"content":"to mestrahd: i still don't understand your reasoning. northern trackers are by far better than lorien guides. look at the stats besides their ability. they might change their function from discarding locations to fighting, which is a good change in my oppinion. but one northern tracker can still place more than 1 progress token, if there are multiple locations in the staging area, whereas lorien scouts cannot.\n\n@ghostwolf: with 4 players in some scenarios you draw an average of 2 locations per round, but can only discard 1. sure, you can be lucky, but usually this leads to locations stacking up in the staging area. this kills your questing, so you can't even discard the active location every round and the problem accelerates itself. you'd have to be very quick ending such a scenario. legolas cannot discard locations from staging area (maybe you played that wrong?) so i don't see how this fits here or how he can possibly help you to discard locations. i also don't see how striders path helps you to discard more than one location per round. you can only play it when the location is revealed (not when you choose). and you put the old location back in the staging area, so the total count stays the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508711","commentId":508711,"userName":"GhostWolf69","timestamp":1312439852,"content":"Forgive me if I wrongly assume that you could see the way this could work just by mentioning a bunch of card-names. My bad.\n\nLegolas can only place Progress Tokens on Current Quest. I know. So he will guarantee that you more or less Always Successfully remove the current Location. (I know he doesn't place anything in the staging area and we do not play him that way either.)\n\nLet me give you an example:\n\nYou start Planning phase with a Current Location already in place.\n\nYou play a Quick Strike to have Legolas Kill off some Orc somewhere.... Current Location is removed. 1 Location done.\n\nYou go into You go into Questing Phase, commit and start to reveal Encounter cards.\n\nOne of them Comes up a Location, so you play Strider's Path to immediately move it up as Current Location.\n\nAs a Response to this Travelling you play Strength of Will and immediately resolve that location as well (assuming it only takes 2 progress token to resolve...  at lot locations do, but not all.) So that is 2 Locations. (If you are extremely Lucky this procedure could even be repeated if more locations come up and you have the cards to deal with it... or maybe you can simply get a new location up.... but that is a real long-shot.)\n\nSo now you Quest... potentially removing a third Location if you have one up there... 3 Locations done.\n\nAfter Questing you Travel to a fourth Location...\n\nIn Combat you ready (using one of the many cards that allow you to: Unexpected Courage etc.) Legolas and have him kill another Monster... 4 Locations done.\n\n \n\nAnd I know, I know... what are the odds? I'm just saying it is POSSIBLE theoretically to resolve more than one location each round without a) using Northern Trackers or b) cheating / misunderstanding the rules. (As you suggested I was doing.)\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508712","commentId":508712,"userName":"GhostWolf69","timestamp":1312439963,"content":"Quite frankly we frequently resolve TWO Locations per round. One through Questing then, after travelling, during combat, one with Legolas.\n\nThat happens every other game-turn.\n\nAnd now, every time we have a Strider's Path on hand, we quite frequently resolve three.\n\n1st one when committing to Quest or in Planning phase, using Lorien Guide's and/or Snowbourne Scouts Response.\n\n2nd during questing through Strider's Path, and actual Quest Result.\n\n3rd after Travel during Combat... through Legolas.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=508720","commentId":508720,"userName":"GhostWolf69","timestamp":1312441349,"content":"Did some more thinking on how to explain this....\n\nThe limit is not how much you can Resolve but rather how many you can Travel to! I guess that is what you are trying to say? And you are right.\n\nTherefore I thought mentioning Strider's Path was very much relevant. It gives you the possibility to Travel to more than one Location each round.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=509297","commentId":509297,"userName":"letsdance","timestamp":1312530892,"content":"i still wonder if you play this correctly. besides that you now added about 3-4 more cards necessary to remove additional locations than you did before (with them it is indeed possible, rarely), there is still some errors in your reasoning.\n\n1. not so few locations need more than 2 progress markers, some even need 6. this kills all your ideas of discarding them so easily.\n\n2. then there is this:\nGhostWolf69 said:\n\nAs a Response to this Travelling you play Strength of Will and immediately resolve that location as well. So that is 2 Locations.\nSo now you Quest... potentially removing a third Location if you have one up there... 3 Locations done.\n\nyou can't travel to a new location before resolving your quest, which means that in this scenario you cannot explore a location with questing.\n\n \n\n3. unless you're playing with trimmed decks of 30 cards with 3 copies of all powerful cards in them, i don't see how you explore 2 locations every 2nd round without using northern trackers. of course, if you have such powerdecks i am sure there are northern trackers in them. anyways, you just add new fiction with every of your posts.\n\nif you don't see how locations without northern trackers are broken in 4ers, i guess this discussion with you is pointless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=509486","commentId":509486,"userName":"GhostWolf69","timestamp":1312553719,"content":"And if you don't see how Strider's Path allow you to travel before Resolving the Quest, then you haven't really looked at the card.\n\nThank you for playing. I bow out.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=509522","commentId":509522,"userName":"SiCK_Boy","timestamp":1312558431,"content":"I do not think Northern Tracker is so abusive as needing to redo the game rules to reduce its effectiveness.\n\nIt's a strong card, for sure, and everyone who plays spirit should play it. But all spheres have their staples. Who would play leadership without including Steward of Gondor or Sneak Attack?\n\nI tend to agree with Ghostwolf in that Northern Tracker are not absolutely necessary. You can build your deck around other solutions to get rid of locations. Snowbourn Scout is one that can help. I think the main point is that you simply find other ways to circumvent this intrinsic difficulty of locations (the fact that, normally, you only clear 1 / turn, even if you may add more than 1 to the staging area).\n\nStill, you put up your optional rules and it's nice to see people trying to contribute to the game. I don't intend to try them as a default rule, but I will apply them if I play your scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=509547","commentId":509547,"userName":"Spirit Juggler","timestamp":1312561528,"content":"GhostWolf69 said:\n\nQuite frankly we frequently resolve TWO Locations per round. One through Questing then, after travelling, during combat, one with Legolas.\n\nThat happens every other game-turn.\n\nAnd now, every time we have a Strider's Path on hand, we quite frequently resolve three.\n\n1st one when committing to Quest or in Planning phase, using Lorien Guide's and/or Snowbourne Scouts Response.\n\n2nd during questing through Strider's Path, and actual Quest Result.\n\n3rd after Travel during Combat... through Legolas.\n\n/wolf\n\n\n\n \n\nLegolas adds to the quest. Not the location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=509623","commentId":509623,"userName":"SiCK_Boy","timestamp":1312572225,"content":"Latest version of the faq confirmed he adds to the location:\n\n(1.00) The Golden Rule\nThe Golden Rule reads: \"If the game text of a card\ncontradicts the text of the rulebook, the text on the card\ntakes precedence.\"\nThe Golden Rule applies when there is a direct\ncontradiction between card text and rules text. If it is\npossible to observe both card text and the text of the\nrulebook, both are observed.\nExample: The rulebook (p. 15) reads: \"Any progress\ntokens that would be placed on a quest card are instead\nplaced on the active location.\" Legolas (CORE 5) has\nan effect that reads, \"...place 2 progress tokens on the\ncurrent quest.\" Legolas' effect would place 2 progress\ntokens on the quest; the core rule from page 15 instead\nplaces those tokens on the active location. Thus, the\nLegolas ability can successfully resolve, and the core\nrule can be observed, without creating a golden rule\nsituation.\n(If a card effect read, \"place a progress token on the\ncurrent quest, bypassing any active location,\" a direct\ncontradiction between card text and rulebook would be\ncreated, and the golden rule would then take effect.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=510092","commentId":510092,"userName":"radiskull","timestamp":1312660241,"content":" All progress tokens gained go to the location first, if possible.  All progress tokens removed are removed from the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=510206","commentId":510206,"userName":"Spirit Juggler","timestamp":1312683778,"content":"Hmmm. Fair enough. Not sure I'm convinced that it should work like that given the wording on the card but I'll take it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=510422","commentId":510422,"userName":"radiskull","timestamp":1312721347,"content":" Yeah, I thought it was odd too, but the rulebook states on p.15, (parentheses mine)\n\n \n\n\"Any progress tokens that would be placed on a quest card (by any means) are instead placed on the active location.\"\n\n \n\nAnd then we have from the FAQ (emphasis mine):\n\n \n\n\"(1.05) When a card effect removes progress tokens from a quest or quest card, the effect applies specifically to the quest card, and never to the active location.\n\n \n\nIt's rough out there for the heroes, I suppose!\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=510548","commentId":510548,"userName":"letsdance","timestamp":1312741686,"content":"SiCK_Boy said:\n\nI think the main point is that you simply find other ways to circumvent this intrinsic difficulty of locations (the fact that, normally, you only clear 1 / turn, even if you may add more than 1 to the staging area).\nbut there are (almost) no such ways. the only one is striders path (and that's just a patch to help you through one round maximum), provided that you have the gollum expansion (which shouldn't be required). play a 4er where you get average 2 locations per round and cannot get rid of them. quite soon their accumulated quest resistance kills you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=510981","commentId":510981,"userName":"Kiwina","timestamp":1312805669,"content":"letsdance said:\n\nSiCK_Boy said:\n\nI think the main point is that you simply find other ways to circumvent this intrinsic difficulty of locations (the fact that, normally, you only clear 1 / turn, even if you may add more than 1 to the staging area).\n\nbut there are (almost) no such ways. the only one is striders path (and that's just a patch to help you through one round maximum), provided that you have the gollum expansion (which shouldn't be required). play a 4er where you get average 2 locations per round and cannot get rid of them. quite soon their accumulated quest resistance kills you.\n\n \n\n\n\nYou could look at that as a form of balancing.  Combat gets easier with more players, so traveling gets more difficult."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=511345","commentId":511345,"userName":"player582283","timestamp":1312833624,"content":"For what it is worth, I completely agree with SiCK Boy.  Northern Tracker is a good, strong ally; A staple of the spirit deck; It is certainly not mandatory to win.  No reason to change rules for it.  I've won many scenarios, including HfG solo and duo, without him coming into play.\n\nI've found that as long as you keeping a good flow of locations and creatures, you can stay ahead of threat levels most of the time if you have the right cards in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=511468","commentId":511468,"userName":"letsdance","timestamp":1312858104,"content":"Woz said:\n\nFor what it is worth, I completely agree with SiCK Boy.  Northern Tracker is a good, strong ally; A staple of the spirit deck; It is certainly not mandatory to win.  No reason to change rules for it.  I've won many scenarios, including HfG solo and duo, without him coming into play.\nas i have stated every time i posted in this thread, it's only a concern for 3-4 player games. it doesn't matter at all if you play solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=511714","commentId":511714,"userName":"Bihor","timestamp":1312895880,"content":"I understand your beef about the 1 location/turn.\n\nThe easyess way, would be to change: ''When more than two players you can travel to a second location.''\n\n \n\nBut the accumulation of location can appen with a 2 player game too. Last night Me and my bud lost when we got served 27 treath."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=511869","commentId":511869,"userName":"letsdance","timestamp":1312909556,"content":"with the gollum scenario we also had the problem with 2 players.\n\nFFG seems to agree, that \"active location effects\" are redundant with northern trackers. i just played conflict at carrock and all positive location effects trigger only when you travel there, while all negative location effects trigger when it's in the staging area. assuming that this will also be done on future cards, it at least fixes that issue. it just sucks that \"old\" and \"new\" locations now follow different guidelines and it's not really thematic. the problem of accumulating locations without the use of northern trackers is also still unsolved."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=511912","commentId":511912,"userName":"SiCK_Boy","timestamp":1312913547,"content":"I don't think we should consider cards from the Core Set as old as opposed to cards from the Adventure Packs being considered new.\n\nThere's a good chance all the AP and the Core Set were developed as a whole by the same design team during the same period. To us they may look new, but to the design team, there was probably some \"plan\" in bringing new features to the players (such as the Evasion mechanic we'll see later, Ally objective cards, etc.)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=511952","commentId":511952,"userName":"player582283","timestamp":1312920464,"content":"But you did comment on 2 players.  I'm specifically addressing your comment (below, bolded )  that you seem to need them in 2 player HfG games.\n\nnorthern trackers are absolutely required to win scenarios with certain player numbers. for the gollum expansion scenario it seems you even need them in 2 player games.\n\nAs for the assertion that it is absolutely required to win with certain player numbers (3 or 4 based on your subsequent) comments, that assertion is simply not true from my experience with 3-4 player games.  While I've definitely played more 2 player or solo, my only complaint about the game is that it is too easy with 3 or 4 players...and that has nothing to do with Northern Tracker.  The last thing we need is to make the game easier for 3-4 players.  I don't believe that your rule would make it harder somehow.\n\nTo be clear, I'm not trying to belittle your opinion.  I just respectfully disagree with it and think that the rules are fine the way they are now for travelling.  I would also expect to see additional options for player cards in dealing with the travel limitation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=512112","commentId":512112,"userName":"letsdance","timestamp":1312948254,"content":"Woz said:\n\nBut you did comment on 2 players.\n\nnorthern trackers are absolutely required to win scenarios with certain player numbers. for the gollum expansion scenario it seems you even need them in 2 player games.\n\ntrue. though i put an \"it seems\" here, because i'm not sure. after playing HfG twice we decided to bag it again and leave it there, unless we want to use parts for a selfmade scenario. that's not really enough to make a qualified statement. but i don't think the problem persists with 2 player games in general, just if you have unlucky draws and in HfG because it has a very high percentage of locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=512120","commentId":512120,"userName":"Mighty Jim 83","timestamp":1312950006,"content":"Surely the problem we are talking about here, is with extremes. If you get a good mixture of cards out of the encounter deck, then things will generally be fine. The problem is when you get a run of a single type of card:\n\n Treachery cards have multiple ways of being cancelled/replaced, some do not effect at all (increased location threat with no locations, damage to characters of players on 35+ threat with no player on 35+ threat etc.)\n\nEnemies can be fought by all four players with varying degrees of effectiveness, and different spheres have different ways of dealing with them. Forest Snare/ Feint, Gondorian Spearman/Dunhere etc.\n\nA Run of locations though has VERY few possibilities for dealing with it. Yes Strider's path, particularly in combination with Strength of Will offers some expanded scope, but the fact remains that IF you get 3 or 4 locations revealed a round for more than one round, particularly if there are no enemies (and thus no progress tokens from Legolas or blade of gondolin) then you need a Northern Tracker to get those locations under control. It's not a guaranteed  occurance, regardless of the scenario or the number of players, but if it does happen, Northern Tracker is currently the only real option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50862-fixing-locations-northern-trackers/?do=findComment&comment=512289","commentId":512289,"userName":"Deleriad","timestamp":1312974555,"content":" To my eyes Northern Tracker looks like the sort of card that slipped through development. Generally in a game with named and un-named characters, named characters have bigger, splashy and more fundamental effects. That's because you want people to play with the named characters and named characters themselves have a drawback of being one per table.\n\nIn 3+ player games, Northern Tracker tends to dominate. It doesn't always win you the game but drawing him early vastly increases your odds of winning. Possibly more so than most (maybe all) other allies. \n\nThe easiest way to judge power levels is to consider whether Northern Tracker was named: you would still put 3 in every deck you could put him in. Similarly if he cost 6, you would still think he's a good deal but he would become more specialised. \n\nI am however wondering if the other side of the issue is locations so I'm wondering if at least as a house rule I might change what happens when duplicate locations show up. E.g. the deck produces a location of one already in play.\n\n1) the card is discarded and a replacement drawn (i.e discarded and gets surge) OR\n\n2) Each player gets +1 threat then the card is discarded.\n\n3) The duplicate attaches to the location (becoming a condition) that it is a copy of giving it +1 Threat and +1 Distance (i.e. need more progress tokens).\n\nMy temptation would be to try these (I like #3 best) and then ban northern tracker to see how the game changes. \n\n "}]}