{"url":"https://community.fantasyflightgames.com/topic/50861-suggestion-for-ffg-deck-builder-supplement/","title":"Suggestion for FFG: Deck-Builder Supplement","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50861-suggestion-for-ffg-deck-builder-supplement/?do=findComment&comment=507839","commentId":507839,"userName":"Voldigar","timestamp":1312306653,"content":"Having absorbed and obsessively played the Core Set and first Chapter Pack, I'd love to see a deck-builder pack come out that would flesh out the 60 Core sphered cards to 180 (each x3) instead of the current 116. For good measure, throw in 2 more gandalfs so that you and a buddy could use the Core Set to construct two solid tournament legal decks. Total: 66 cards. Price it as a chapter pack and we've got a sweet deal.\n\nI know we can all just buy 3 core sets, but come on. Some of us could never bring ourselves to do it. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nWhat do you say FFG? I'd sure buy it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50861-suggestion-for-ffg-deck-builder-supplement/?do=findComment&comment=507872","commentId":507872,"userName":"TheLightdarker","timestamp":1312309482,"content":"Voldigar said:\n\n \n\nHaving absorbed and obsessively played the Core Set and first Chapter Pack, I'd love to see a deck-builder pack come out that would flesh out the 60 Core sphered cards to 180 (each x3) instead of the current 116. For good measure, throw in 2 more gandalfs so that you and a buddy could use the Core Set to construct two solid tournament legal decks. Total: 66 cards. Price it as a chapter pack and we've got a sweet deal.\n\nI know we can all just buy 3 core sets, but come on. Some of us could never bring ourselves to do it. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nWhat do you say FFG? I'd sure buy it...\n\n \n\n \n\nAlas, that shall not happen.\n\nhttp://boardgamegeek.com/thread/654461/ffg-news-the-hunt-for-gollum-expands/page/2 [http://boardgamegeek.com/thread/654461/ffg-news-the-hunt-for-gollum-expands/page/2]\n\nFrom FFG:\n\n\"In our opinion, the core set provides a *great* experience (YMMV) for under $39.95, allowing players like the one above to enjoy the experience without further cost, and allows dedicated players to expand should they choose to do so.\n\nI realize there are some differing opinions on this. Know this: FFG had a choice of providing a more narrow replay experience (with fewer card types but more of each card) or a broader experience (with more card diversity and re-playability). For our LCG core sets, we choose the latter. There is no conspiracy, it is a choice between a retail price point, diversity, and card counts. Players who want to maximize every option can, at a very competitive cost, by getting additional core sets to increase the player count and number of cards. Casual players, or people who just want to sample the experience, can do so at a very reasonable cost. Since dedicated players are the ones likely to purchase expansions, we make 3 of every player card available in these monthly release.\n\nWith four different spheres, there are many different combinations and abilities to customize decks in the core set alone. Of course it won't yet compare to other LCG's which have years of support. Also, the LOTR LCG gameplay is a very different game style from anything on the market at this point. Yet, it will be supported vigorously and the diversity will quickly increase. We are working on great content for 2012 already, and I think you'll love what we are releasing in 4Q.\n\nIn terms of timing. The LOTR core set hit retail shops towards the end of April, and we expect to ship the first expansion within roughly 60-70 days of that date (barring unforeseen events) and monthly thereafter (with some small gaps between 6-pack cycles). While I understand, and appreciate there are many folks eager for this to happen sooner, I don't think this window is egregiously long or somehow indicative of FFG dropping the ball. In fact, we get severe complaints when we solicit these decks early (i.e. before the core set ships) which is necessary to do in order to properly inform the global wholesale marketplace of the upcoming product as soon as possible. Damned if we do...\n\nThe game is a huge success for FFG (and for our international partners, especially in Germany, Spain, and France) and we're having a ton of fun playing it in the office. We're flying a few hundred \"Hunt for Gollum\" decks into the country early for this event, so that players can see the new cards and quest even earlier than we had planned and meet other enthusiasts in a FLGS. Being angry at this event is quite silly, as it will be great fun, and has no bearing on the main delivery of the expansions.\n\nTake this information as you will. They are the facts as I know them, and decisions made as we see best for everyone.\n\nThanks,\n\nChristian\nFFG\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/50861-suggestion-for-ffg-deck-builder-supplement/?do=findComment&comment=507904","commentId":507904,"userName":"mason240","timestamp":1312312014,"content":"Given how they treat their other LCGs, the core set will they ONLY product that does not have 3x of every player card.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50861-suggestion-for-ffg-deck-builder-supplement/?do=findComment&comment=508036","commentId":508036,"userName":"Voldigar","timestamp":1312325802,"content":"Thanks for the link. Christian's reply is quite reasonable of course, but it's just like the PC or other technology markets: there's a vast group of us out there (\"prosumers\" in the aforementioned technology world) who love to go 90%. We'd go bananas for the little extra, but just can't commit to the full on obsession of buying 348 cards for the sake of obtaining the 186 we want. It's all about value. We just wanna get served yo?"}]}