{"url":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/","title":"Why has Leadership the worst allies?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508374","commentId":508374,"userName":"Shelfwear","timestamp":1312374246,"content":"Shouldnt be Leadership about leading allies into battle (or whatever)?\n\nSo far in the game Leadership isnt the sphere you'll want to include many allies even though it has more allies than the other spheres in the core set.\n\nThe only good one is Faramir (but he is unique though so you can only have one in play)\n\nBrok Ironfist is highly overpriced and has a crap ability\n\nGuard of the Citadel is weak compared to other 2-Resource allies\n\nSon of Anor has an interesting situational ability but weak stats for a 3-Resource ally\n\nSilverlode Archer is ok but not better than other 3-Resource allies\n\nSnowborn Scout is ok for a cheap blocker but still much worse than Henemarth\n\nLongbeard Orcslayer is overpriced too\n\n \n\nI value following allies as good/above average (ratio cost/attributes and usability of abilities):\n\nFaramir, Northern Tracker, Wandering Took, Beorn, Veteran Axhand, Horseback Archer, Erebor Hammersmith, Henemarth Riversong, Daughter of the Nimrodel, Gleowine\n\nThat gives this distribution of \"good\" allies:\n\nLeadership: 1\n\nSpirit: 2\n\nTactics: 3\n\nLore: 4\n\nI'm puzzled of the fact that Leadership has the worst allies..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508389","commentId":508389,"userName":"Kzer-za","timestamp":1312377277,"content":"I think it's because it can play the most allies with its ample resources and because it has the best support cards for its allies. Guard of the Citadel has pretty bad stats, but For Gondor! and Faramir help him out a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508431","commentId":508431,"userName":"lleimmoen","timestamp":1312382856,"content":"My view.\n\nLeadership. Faramir can be game-breaking. I like how he and his future wife are best for questing. Son of Arnor is situational maybe, yes, but I just love the card. And have used it to great results. Especially its Sneak Attack or Stand and Fight combo just rules (to pull an enemy which won't be able to attack and you hit it with all you've got, the now played Son included); Forest Snare also works better with it, big time. But then I agree, these two are the only two I play. I have tried and later considered and reconsidered Snowbourn Scout, he is not bad. I don't like the rest at all. I am not fond of Silverlode Archer, 1hp doesn't help his questing, and the picture sucks.\n\nLore. The best allies in general. Henamarth, Hammersmith, Gleowine, Daughter, all very good. And we can be looking forward to Haldir as well.\n\nTactics. I don't like Axehand one bit. I do like Spearman though, he has some good combos in his lance. Beorn, great, obviously, but still not always easy to get.\n\nSpirit. Northern Tracker is the top. Took is always at least decent and can be priceless in coop. The new Horse-breaker is interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508438","commentId":508438,"userName":"TheLightdarker","timestamp":1312383842,"content":"I just want to add that several of the Leadership allies (I'm thinking specifically of Silverlode Archer and Guard of the Citadel), have stat points thrown into Willpower.  This is specifically what made me rethink one of my decks I use for two-player, and convinced me to go from 2/3 Leadership 1/3 Tactics to instead 2/3 Tactics 1/3 Leadership.  Although its nice to have a little bit of flexibility in being able to add a point or two of extra Willpower here and there, using those allies for that purpose means that I won't get to use them to attack or defend; and, since each ally is only allotted a certain amount of stat points/ability goodness for their resource cost, I felt fairly gimped when I was using perhaps more flexible, but weaker in combat Leadership allies to do the same things Tactics allies would do, but better.\n\nWhile Veteran Axehand may not have any Willpower, for the same cost as a Guard of the Citadel it hits for 2 attack instead of 1, and has 1 defense up from 0, which means it can potentially block a 1 attack enemy indefinitely, and given that it retains the 2 hit points, it can block an attack value of 2 likely twice, even more if you have some way of healing it.  The same thing goes for Silverlode Archer; no willpower, but an extra hit point and 1 defense.\n\nLeadership might be able to crank 'em out (go go resource generation), but they're awfully weak, and despite being flexible remain pretty mediocre when it comes to attacking, defending, and questing.\n\nEdit: I'm curious to see what else Leadership gets to boost the power of their allies.  I've not been impressed enough by event cards like For Gondor! or Blade Mastery to use them very often, but that could change in time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508445","commentId":508445,"userName":"Shelfwear","timestamp":1312385421,"content":"Yes, Leadership allies can contribute to questing and can fight but they are not great in both aspects. The point is, if you want to quest with a heavy Leadership deck, you take allies from a second, support sphere (Spirit or Lore). Having points spread over all attributes wont make them good for fighting, nor you'll beat the game questing wise. Having combat allies that can quest but have no defense and only 1 or 2 hitpoints is a waste of resources, even more considering the fact Leadership allies cost more than comparable allies from other spheres.\n\nAll spheres except Leadership have cost 2 allies that have very good attributes plus a good ability (Wandering Took 5 points + ability, Ereborn Hammersmith 6 points + ability, Veteran Axhand 5 points) - Leaderships Guard has 4 points without an ability...\n\nSon of Anor is the only interesting ally of Leadership (next to Faramir of course) but it should have been cheaper and with more spread out attribute line (0/2/0/2 is really odd and 3 resources for situational use (which is a come into play effect and not even an exhaust effect), makes this card being left out of many decks I guess)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508448","commentId":508448,"userName":"__doom__","timestamp":1312385664,"content":"I haven't tried it, but couldn't they be pretty good if you did a 2/3 Leadership 1/3 Lore split? I figure the strategy would be to run Self Preservation on Gloin for some unfair resource gain. The deck would also need to have a ton of allies and three copies of Grim Resolve. That way you can take advantage of having a ton of dudes with willpower (not to mention Faramir) and have attack strength. I still feel like it would be a fairly weak deck perhaps, but could be fun to play, if only for the turn that you get to activate Faramir three times using Grim Resolve and Ever Vigilant...hmmm...this is starting to sound like a combo deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508456","commentId":508456,"userName":"TheLightdarker","timestamp":1312386638,"content":" Ya know, I suddenly feel pretty stupid for never realizing that you could use Faramir multiple times in one turn.  I assume his ability stacks each time? Dayum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508464","commentId":508464,"userName":"lleimmoen","timestamp":1312388719,"content":"I myself have been very much impressed by For Gondor! It has slowly but surely become one of my all-time-favourite cards. So, I recommend trying it out and I think you won't be disappointed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508467","commentId":508467,"userName":"lleimmoen","timestamp":1312388909,"content":"__doom__ said:\n\nI haven't tried it, but couldn't they be pretty good if you did a 2/3 Leadership 1/3 Lore split? I figure the strategy would be to run Self Preservation on Gloin for some unfair resource gain. The deck would also need to have a ton of allies and three copies of Grim Resolve. That way you can take advantage of having a ton of dudes with willpower (not to mention Faramir) and have attack strength. I still feel like it would be a fairly weak deck perhaps, but could be fun to play, if only for the turn that you get to activate Faramir three times using Grim Resolve and Ever Vigilant...hmmm...this is starting to sound like a combo deck.\n\n\n\nI use such a deck. Glorfindel, Denethor and Gloin as heroes. Gloin, with Dark Knowledge on Denethor and Self Preservation on himself, usually makes enough resource to play Faramir and Grim Resolve if you have them. And yes, I play a total of 24 allies in that deck. It is here where For Gondor! also rules the enemies as they drop like flies. It is fun to slay Nazgul with Daughter of the Nimrodel for instance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508576","commentId":508576,"userName":"qwertyuiop","timestamp":1312407057,"content":" I'm not going to provide a reason why you are incorrect, but you are."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508620","commentId":508620,"userName":"GhostWolf69","timestamp":1312422161,"content":"I play a mixed Spirit / Leadership combo deck with (Aragon, Eowyn, Eleanor).\n\nI use Celebrains Stone to give Aragon Spirit (and a total of 4 willpower for questing. Along with Eowyn that is 8 points.)\n\nI use the Song of Kings to give Leadership to Eowyn and Eleanor.\n\nIf I make that (I did last night) all Characters can pay for all cards.\n\n \n\nMy allies are:\n\nNeutral\n\n3x Gandalf (duh )\n\nSpirit\n\n3x Northern Tracker (duh again)\n\n2x Lorien Guide\n\n2x Westfold Horse-breaker\n\nLeadership\n\n3x Snowbourn Scout\n\n2x Silverlode Archer\n\n1x Faramir\n\nIt has worked out pretty well so far. I like the all around feel of the Leadership Allies in general. They can be mixed into almost any other Sphere without feeling like they are completely out of place. In my deck they contribute to Questing and has better Combat stats than the regular Spirit Allies. Besides being a cheap blocker, I like how Snowbourn Scouts complement Northern Tracker and Lorien Guide for instance, and I sometimes use it together with Sneak Attack to get to use is Response more than once. Faramir is there to also facilitate questing, and yes I've used Ever Vigilant to execute that ability more than once.... I don't know if that is correct but that is how I've interpreted it. Silverlode Archers are there to give me some more offence. and to be able to contribute to other players offence as well (I don't see any Ranged Allies in any other deck except Tactics, so I'd say this is a Leadership edge.)\n\nAnd don't forget: The Leadership cards are  about leading Allies for sure, but not just Leadership allies.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508632","commentId":508632,"userName":"Mighty Jim 83","timestamp":1312426011,"content":"Really? Leadership allies the worst?\n\nI would say that Tactics has the worst allies (Core set) although that's starting to be addressed. Aside from Beorn, who is both very expensive and unique, Tactics was the only sphere out of the box without a (Cost 4,) Defence-2+ ally. Given that this is essentially a fighting deck for dealing with baddies whilst others quest, i felt this was a major let-down. Obviously Winged guardian is a major help here, but expensive to keep going. Looking forward to some of the Eagle combos when we start to get more cards out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508664","commentId":508664,"userName":"Shelfwear","timestamp":1312429868,"content":"Mighty Jim said:\n\n \n\nReally? Leadership allies the worst?\n\nI would say that Tactics has the worst allies (Core set) although that's starting to be addressed. Aside from Beorn, who is both very expensive and unique, Tactics was the only sphere out of the box without a (Cost 4,) Defence-2+ ally. Given that this is essentially a fighting deck for dealing with baddies whilst others quest, i felt this was a major let-down. Obviously Winged guardian is a major help here, but expensive to keep going. Looking forward to some of the Eagle combos when we start to get more cards out.\n\n \n\n \n\nThat was my first impression too: \"This is supposed to be the badass fighting sphere?\" I thought. On first sight tactics allies dont seem very intriguing and in fact - they are not. No fancy abilities, but you get decent attributes for your resources Veteran Axhand and Horseback Archer are very solid for 2 respectively 3 resources. I'd take them into my deck instead of  Guard of the Citadel and Son of Anor. And comparing Beorn (Tactics) - who is indeed a late game ally - with Brok Ironfist (Leadership) really makes the former look even better imho."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508665","commentId":508665,"userName":"Shelfwear","timestamp":1312429900,"content":"qwertyuiop said:\n\n I'm not going to provide a reason why you are incorrect, but you are.\n\n\n\nThank you, you convinced me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=508800","commentId":508800,"userName":"avgzxc","timestamp":1312452565,"content":"Well, the fact remains that Steward can be played on any hero and it really makes those leadership allies look pretty silly. The only real defence for them is 3rd scenario becasue of that global 1 ally / turn thing. Gloin give a lot of $ but can hire only 1 so.. yeah, all those cost ineffective leadership allies still have their sweet little place to shine just a bit.\n\nIn the end it's a typical supply/demand scenario: leadership = easy to get more money = allies cost more, other sphere = hard to get more money = allies cost less."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=510036","commentId":510036,"userName":"qwertyuiop","timestamp":1312650178,"content":"Shelfwear said:\n\nqwertyuiop said:\n\n \n\n I'm not going to provide a reason why you are incorrect, but you are.\n\n \n\n \n\nThank you, you convinced me.\n\n\n\nI'm always glad to help a fellow LotR player.   I will agree that the unique dwarf is pretty bad, but I think the other allies are good for what they are. What they are is an army of meatshields, questers,  archers, ..etc.  They're pretty inexpensive considering Leadership's resource gathering ability. Faramir gives every other ally a secondary role which is as good if not better than their primary one. They're a functional army in a Leadership deck.  But for players who insist upon playing 50 card decks, multisphere is the only game in town and I am forced to admit that Leadership allies lose some of their luster in multisphere decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=510205","commentId":510205,"userName":"TheLightdarker","timestamp":1312683695,"content":"So, to paraphrase:\n\nShelfwear says (more or less), compared to other spheres, Leadership has somewhat lackluster allies.\n\nqwertyuiop says (more or less), compared to other spheres, Leadership has somewhat lackluster allies.\n\nSounds good to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=512592","commentId":512592,"userName":"qwertyuiop","timestamp":1313002576,"content":"Lightdarker said:\n\nSo, to paraphrase:\n\nShelfwear says (more or less), compared to other spheres, Leadership has somewhat lackluster allies.\n\nqwertyuiop says (more or less), compared to other spheres, Leadership has somewhat lackluster allies.\n\nSounds good to me.\n\n\n\nI see what you did there.  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=512865","commentId":512865,"userName":"Jekzer","timestamp":1313050474,"content":"Well after reading all of you, I'd like to share my thoughts about what I think of Leadership sphere.\n\nFor me, the leit motiv of Leadership cards are not only the idea of bringing a lot of allies under the \"leader's\" banner, but to have control of the whole situation. In this case (LOTR: LCG), the round.\n\nSo in this sphere there are cards that allow you to make things not supposed to be done because you are in different phases. For instance, you can only gain resources in Resource phase and spend them to play cards in Planning phase. That's not the case with Leadership (Sneak Attack, Théodred, Glóin, Steward of Gondor...). They can progress in locations without being in Mission phase (Snowbourn Scout). They can change the pace of a battle with engaged enemies (Son of Arnor). And so on.\n\nFor me the true word \"leadership\" in this game (and in this sphere) is the power to change the pace of a battle, of the recruitment of allies, of the success of a mission.\n\nThat's why I see Leadership as a jack of all trades deck. It mixes quite well with other spheres. In fact this sphere plays better (that's my opinion) with dual or tri-sphere than as a solo deck (and some of the things Shelfwear and other posted here like \"lack of good allies\" may enter here). They pull its \"leadershipness\" to other spheres, if you want to see it that way.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50913-why-has-leadership-the-worst-allies/?do=findComment&comment=513036","commentId":513036,"userName":"radiskull","timestamp":1313069754,"content":" I like your characterization, Jekzer :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}