{"url":"https://community.fantasyflightgames.com/topic/50922-noob-question/","title":"Noob question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/50922-noob-question/?do=findComment&comment=508462","commentId":508462,"userName":"Vase","timestamp":1312388554,"content":" Hey everyone, I've only had my core set for a week.  So far I love it!  My wife is the only person I have to play coop with, and she isn't in the mood to play all that often.  So I really love the solo-play ability of this game.\n\n \n\nAlright, here's my noob question.  Sorry if it has already been brought up.  I've searched the forums and I have read the rulebook and the errata but I can't find a clear answer:\n\n \n\nWith regard to the Spheres of Influence, the rulebook states, \"A hero's sphere dictates the types of cards that hero allows a player to use.\"  \n\n \n\nI'm having trouble interpreting that phrase.  It would seem that this refers to a hero's resource pool which directly effects which cards a player can play from his/her hand.  But does this also indirectly imply that a card of a given sphere may only be played on a hero of the same sphere?  For example, can I play Steward of Gondor as an attachment for Beravor?  Can I play Self Preservation on Gloin?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/50922-noob-question/?do=findComment&comment=508469","commentId":508469,"userName":"Shelfwear","timestamp":1312388979,"content":"\"to play\" means to play from your hand paying its costs from one (or more) hero's resource pool that share the same sphere as the played card. Tactic cards can only be played with tactic resources (generated by tactic heros) and so on. Once you paid a card's cost you can play/attach/put it on every character you like, even on characters of other players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/50922-noob-question/?do=findComment&comment=508505","commentId":508505,"userName":"Vase","timestamp":1312394561,"content":" Great.  I had hoped that that was the case.  Thanks for your help!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}