{"url":"https://community.fantasyflightgames.com/topic/51052-louis-morris-rupert-and-stewart-in-what-order-would-you-pick-them/","title":"Louis, Morris, Rupert and Stewart - In what order would you pick them?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51052-louis-morris-rupert-and-stewart-in-what-order-would-you-pick-them/?do=findComment&comment=509824","commentId":509824,"userName":"SiCK_Boy","timestamp":1312619242,"content":"What order would you choose to take on the 4 unique Trolls from Conflict at the Carrock?\n\nI've gone with Stuart (Defense), Louis (Threat), Morris (Attack) and Rupert (Reshuffle Sacked!) yesterday, but I was reaching threat 34 anyway when I picked Louis.\n\nI guess I would usualy try to keep him last (as long as the threat remains under 34).\n\nI have a hard time seeing Rupert's attack as being devastating... I guess I'm thinking you always manage to get rid of the Sacked! cards anyway...\n\nWould the presence of The Carrock as the active location influence your choice?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51052-louis-morris-rupert-and-stewart-in-what-order-would-you-pick-them/?do=findComment&comment=509981","commentId":509981,"userName":"Narsil0420","timestamp":1312638643,"content":"Well Carrock is always the active location when you're facing the trolls right? Or have you normally explored it before your threat reaches 34?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51052-louis-morris-rupert-and-stewart-in-what-order-would-you-pick-them/?do=findComment&comment=510053","commentId":510053,"userName":"SiCK_Boy","timestamp":1312652111,"content":"It is for the first turn,  but you can explore it once it becomes active, so it doesn't have to remain the active location forever."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51052-louis-morris-rupert-and-stewart-in-what-order-would-you-pick-them/?do=findComment&comment=510194","commentId":510194,"userName":"TheLightdarker","timestamp":1312682971,"content":"I just did my first attempt at CatC (2 player), and won by picking Stuart (+Def) one round, then Morris (+Atk) the next, and once they were both dead, Rupert (Sacked!) and Louis (+Threat) at the same time (scoring both kills that round).\n\nDecks were: 2Spirit/1Lore (questing) and 1Leadership/2Tactics (tanking)\n\nMy fairly easy victory came primarily from 3 damage token Gimli with Unexpected Courage dealing out huge damage, who by the end of the quest had 2x Dunedain Mark and 2x Dwarven Axe attached.  I picked Stuart first so Gimli could absorb his hit and I could put a measly 3 damage on the troll from all my characters combined, and the following round (my teammate fully explored The Carrock with us discarding 1 card each for Eowyn), I played Feint on Stuart while I lost an ally to Morris' attack.  I swung with enough damage to kill Stuart.  Since Morris was then left with 1 less defense, if I recall correctly, by readying Gimli and adding Legolas' attack I was also able to drop Morris... or it took one more round, with an ally dying, I can't remember.\n\nIn any case, the round after Morris died, my ally played gandalf and dropped 4 damage on Louis.  With 34 threat I was forced to engage both Rupert and Louis (digging for The Galadhrim's Greeting failed), but at this point Gimli had all of his attachments on.  Two allies ate the two troll attacks, Gimli swung with enough to finish off Louis by himself, and Gimli + Legolas killed Rupert, winning the game.\n\nEdit: Its important to keep in mind that if you're just using allies as meat shields, it really doesn't matter if a troll swings for 4 or for 6, the ally will pretty much die regardless.  Also, make sure to plan to have enough available attack according to how much defense the trolls have (i.e., anticipating exploring the Carrock, killing Stuart, etc)."}]}