{"url":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/","title":"Conflict at the Carrock - First thoughts","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=509843","commentId":509843,"userName":"SiCK_Boy","timestamp":1312620947,"content":"I played it twice, both with a mono-Lore deck using Song of Kings to splash Steward of Gondor, Ever Vigilant, Sneak Attack and Dunedain Mark.\n\nAfter reviewing the new cards, I decided not to include any of them in my deck. Obviously, Song of Wisdom isn't useful in a mono-Lore deck and I don't think Second Breakfast will see much play. I considered the Dunedain Warning attachment for a while, but decided to stick with the attack version as Denethor and Protector of Lorien already provide me with enough defense. Both Lore cards (Longbeard Map-Maker and A Burning Brand) seemed overpriced compared to what they do.\n\nOf the other player cards, I guess Born Aloft could see play in a Tactics deck that wants a way to reuse Gandalf (no Sneak Attack, no Stand and Fight) and the Beorning Beekeeper gives a little bit of questing power to the poor Tactics player. Nor Am I a Stranger seems totally useless, but Eomund could be played.\n\nAs for the quest, I quickly got destroyed on my first try. Those Muck Adder can be devastating with Despair as a shadow card. They got through 2 of my heroes this way. The fact that there aren't many allies with 2 defense means you must risk your heroes everytime or lose an ally to each of their attack. And their 4 lifepoints mean they are there for a few turns as well. The presence of this card (as well as Sacked!) means I'm going back to 3 Hasty Stroke in any Spirit deck I'll bring to the Carrock! It may also increase Dark Knowledge's value.\n\nOn my second try, I managed to pull a win even after loosing Denethor around turn 4. I spent most of the first half digging for a Forest Snare to deal with an engaged Hill Troll, letting my Threat skyrocket (I reached 49 before stabilizing and ending the game at 41) as I was throwing allies in his way (drawing 5 cards a turn with Bilbo, Beravor and Gleowin still took me 3 full turns to find my first copy of it after he engaged me). Once the Troll was locked, however, it lead me to 2 conclusions: threat management isn't critical to this scenario as it is with others (such as Journey Along the Anduin) until you're ready to move to the next step of the quest. Having Henamarth Riversong and revealing a single card per turn, I was able to pace myself, bring in Gandalf 4 times right at the end (2 remaining Sneak Attack plus 2 \"hard-casted\") and thus bring the threat back under 34. The second is that having a trapped enemy is a great way to pass Sacked! cards as \"wasted\" shadow cards.\n\nOverall, I loved the quest. For solo play, it's a big challenge, but I'm not sure it's as thought as Escape from Dol Guldur. The encounter deck isn't as agressive (only The Carrock remains in the staging area for most of the game, but after that, you only reveal 1 card per turn). The absence of The Necromancer's Reach and Dol Guldur Orcs means you can quest with all your 1-life allies without worry (hooray for Rivendell Minstrel!). What you need is a way to deal with shadow cards to prevent the Muck Adder from surprising you, something to bypass Sacked! (Miner of the Iron Hills does the job here) and a ready army for the final battle.\n\nI'd have much prefered to get the Spirit song rather than the Lore one in this expansion. Once I get it, I don't think this adventure will be much of a challenge for a solo-Lore-song deck as you'll easily cover your weaknesses and won't face any dangerous threat.\n\nI'll try it multi-player later. I expect the challenge to be much easier in multi-player than solo as the worst threat are enemies (none of the location, even The Carrock, are really evil - no nasty Travel cost) and having more players mean you can more easily deal with them. I think the complains about scaling that The Hunt for Gollum assuaged a little bit will resurface soon.\n\nStill, keep 'em coming, FFG!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=509927","commentId":509927,"userName":"guciomir","timestamp":1312630203,"content":"I believe multi may be harder than solo. First of all there would greater chance to encounter sacked! card (more cards will be drawn during the game and more sacked cards will be available). And also, threat management will be much much harder. When playing solo I was trying to not flip to stage 2A too soon. And yet, encounter deck was making surprises like big threat in the staging area or no threat (so I would place progress tokens when I did not want to). Quite a big part of this quest is sending enough willpower for a quest, but not send too much because you'll lose. In multi this threat management may be harder to pull off.\n\nBut this is purely speculation, based on several solo games and just 1 multi. Time will tell"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=509937","commentId":509937,"userName":"SiCK_Boy","timestamp":1312631714,"content":"I wouldn't worry too much about Sacked!.\n\nA Sacked! in multiplayer is much less devastating than solo since it removes a smaller percentage of your heroes (similar to the prisoner being much easier to assume with 2 or 3 players, when you only loose 18 % or 11 % of your heroes) than in solo.\n\nHowever, you're right that threat management and, more importantly, quest progress management, becomes much harder in multiplayer. I may be too used to always knowing the next card (Denethor and Henamarth Riversong)... as soon as you add a second player, there's always at least 1 unknown card, and as you said, threat value ranges from 0 to 5 (Brown Lands), meaning you could easily finish stage 1 before you're fully ready.\n\nI guess getting Grimbeorn the Old will be even more essential in multi-player than solo (he's still great in solo, but you can survive without him)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510079","commentId":510079,"userName":"marlow4","timestamp":1312655927,"content":"*takes notes*\n\nGood stuff. Thanks for the summary. I haven't been brave enough to try out CatC. Still getting the hang of things with the core scenarios. OK, I'll be honest, I've spent a lot of time staring at certain artwork mumbling about \"my precious.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510199","commentId":510199,"userName":"Spirit Juggler","timestamp":1312683250,"content":"Hoping Conflict at Carrock will arrive this week tp have a run at. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510293","commentId":510293,"userName":"lleimmoen","timestamp":1312703159,"content":"You say you got destroyed via Despair, perhaps there is the use of A Burning Brand, is it not? Especially if you do not have Hasty Stroke in the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510295","commentId":510295,"userName":"lleimmoen","timestamp":1312703320,"content":"SiCK_Boy said:\n\nI wouldn't worry too much about Sacked!.\n\nA Sacked! in multiplayer is much less devastating than solo since it removes a smaller percentage of your heroes (similar to the prisoner being much easier to assume with 2 or 3 players, when you only loose 18 % or 11 % of your heroes) than in solo.\n\nHowever, you're right that threat management and, more importantly, quest progress management, becomes much harder in multiplayer. I may be too used to always knowing the next card (Denethor and Henamarth Riversong)... as soon as you add a second player, there's always at least 1 unknown card, and as you said, threat value ranges from 0 to 5 (Brown Lands), meaning you could easily finish stage 1 before you're fully ready.\n\nI guess getting Grimbeorn the Old will be even more essential in multi-player than solo (he's still great in solo, but you can survive without him).\n\n\n\nAnd yeah, I really enjoy using Henamarth and the tactics when I know what is coming in the solo play. That is one of the few instances where the coop is disadvantaged."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510356","commentId":510356,"userName":"SiCK_Boy","timestamp":1312714219,"content":"lleimmoen said:\n\nYou say you got destroyed via Despair, perhaps there is the use of A Burning Brand, is it not? Especially if you do not have Hasty Stroke in the deck.\n\n\n\nI still wouldn't use it. At a cost of 2 resources, I'd rather use Dark Knowledge or keep my Henamarth / Denethor peeks to see what shadow card the Adder is getting.\n\nIf the Burning Brand was cancelling shadow effects on ALL enemies attacking you, I'd use it without a second thought (even at a cost of 3, I'd use it). Right now, the problem is that it only works for the character defending, which makes it even more situational. In my case, I often use either Bilbo or Denethor to defend, depending on a multitude of factors (Protector of Lorien on Bilbo, Daughter of the Nimrodel in play, Henamarth Riversong in play, Attack power of the enemy > 2, etc.), so I'd need to get 2 Brand to be safe. I don't know what I'd take out... Maybe I'll still give it a try, replacing a Secret Path and Radagast's Cunning (currently running 3 of each, more often than not they end up as fodder for Protector of Lorien)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510416","commentId":510416,"userName":"lleimmoen","timestamp":1312720944,"content":"SiCK_Boy said:\n\nlleimmoen said:\n\n \n\nYou say you got destroyed via Despair, perhaps there is the use of A Burning Brand, is it not? Especially if you do not have Hasty Stroke in the deck.\n\n \n\n \n\nI still wouldn't use it. At a cost of 2 resources, I'd rather use Dark Knowledge or keep my Henamarth / Denethor peeks to see what shadow card the Adder is getting.\n\nIf the Burning Brand was cancelling shadow effects on ALL enemies attacking you, I'd use it without a second thought (even at a cost of 3, I'd use it). Right now, the problem is that it only works for the character defending, which makes it even more situational. In my case, I often use either Bilbo or Denethor to defend, depending on a multitude of factors (Protector of Lorien on Bilbo, Daughter of the Nimrodel in play, Henamarth Riversong in play, Attack power of the enemy > 2, etc.), so I'd need to get 2 Brand to be safe. I don't know what I'd take out... Maybe I'll still give it a try, replacing a Secret Path and Radagast's Cunning (currently running 3 of each, more often than not they end up as fodder for Protector of Lorien).\n\n\n\nSame here. Secret Path and Radagast's Cunning I played from the start and still try them occasionaly but almost never end up using them for great benefit, compared to other cards in the deck. I'd take the Brand any day over those.\n\nOtherwise, your logic seems to correspond with my thoughts. I was just referring to your claim of getting in trouble with the Adders... hence my suggestion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510557","commentId":510557,"userName":"DurinIII","timestamp":1312743007,"content":" Man I am so jealous of some of you guys!!! I still don't have my copy of CATC yet...hopefully tomorrow? Looking forward to it immensely...thanks for the tips guys. Happy Gaming! How is the art? Awesome as usual?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=510711","commentId":510711,"userName":"Shelfwear","timestamp":1312775757,"content":"On BGG is a review on CatC now including images of all player cards. Cant say I'm impressed by the card art this time. All cards except Spirit have a rather goofy touch to them (sorry, cant post a link right now)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=511251","commentId":511251,"userName":"DurinIII","timestamp":1312822775,"content":" Yeah, got my pack today. I can see what you mean by the \"goofy touch.\" I am most concerned I didn't get a number 3 quest card in this set. How many are there supposed to be in the set? 2 or 3?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=511276","commentId":511276,"userName":"TheLightdarker","timestamp":1312824387,"content":"DurinIII said:\n\n Yeah, got my pack today. I can see what you mean by the \"goofy touch.\" I am most concerned I didn't get a number 3 quest card in this set. How many are there supposed to be in the set? 2 or 3?\n\n\n\nTwo, card 2B simply lacks the \"conditions for victory\" text, but it all wraps up nicely once you've finished that stage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=512074","commentId":512074,"userName":"Narsil0420","timestamp":1312941114,"content":"I didn't feel like this deserved its own thread but did anyone else notice that the picture for the River Langflood is the same as River Ninglor? To make it more confusing, it even has a different artist! David Lecossu is the artist on River Ninglor\n\nWhat is going on here?\n\nAs a side note for LOTR nerds: the picture (which features the Carrock in the distance) is actually more accurate for the Langflood than the Ninglor. The Langflood basically the Anduin but the northern end of the river which would look down on the Carrock which sits in the middle of the Anduin/Langflood. The Ninglor (also called the River Gladden) is far to the south and empties into the Anduin at the Gladden Fields so you probably could not see the Carrock from it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=512102","commentId":512102,"userName":"Doom1502","timestamp":1312947268,"content":"You're right. I assume, as two different artist are noted, they mixed up the pictures und printed the false one on the Ninglor card"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=512111","commentId":512111,"userName":"letsdance","timestamp":1312948204,"content":"i've played it twice yesterday (2 player monosphere decks with just all cards for that sphere from core, HfG and CatC). it seems there are 2 possible strategies, both include spending a few turns in stage 1 to power up a bit:\n\n1. keep threat low, using blue, and then kill the trolls off single. this was quite easy using red + purple decks. we've been lucky with draws, but considering that we used non-customized decks it looks like it's not hard to do. the main problem is getting enough quest points with 3-4 trolls in staging area but with faramir that was easily solved and we could even explore the carrock in 2nd round.\n\n2. play purple and get the ally quick. he's so overpowered that the fight isn't really hard with him. we played our 2nd game with green + red and didn't have the resources to buy him and enough threat to be attacked by all trolls as soon as we hit stage 2. still, the fight was surprisingly close, but we would have lost it even if our threat didn't go to 50 because of the trolls special feature. with the ally i am sure we would've won.\n\nthe scenario solves one basic problem of the basegame, which is the game being too hard at start and then too boring in the end. in CatC after you beat the hard part, it's already over. i like that, altough it makes for short games (especially if playing the low threat strategy). it also gives you some time to power up at the start, but while imposing a danger to you (similar to what i tried in my custom scenarios, so i like that too)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=518639","commentId":518639,"userName":"Iver2","timestamp":1314076860,"content":"I played 2 two-player games yesterday with one core and most of the new card from the adventure packs and I must say its really though! But still great.\n\nWe lost both times, but I hope the next time shall be a win after adapting our deck a bit to the quest.\n\nStill, I have some questions left:\n\nBorn Aloft: That means that you can always \"save\" your ally from being discarded? When exaclty can you take this action? I mean in which cases can you use it and in which not? let say when a character is damaged beyond its hitpoints, when playing gandalf with sneak atack, when a treachery card would cause damage to an character and its death? I am totally unsure about when to use this Action.\n\n \n\nA Frightened Beast\n[Treachery]\n\nWhen Revealed: Each player raises his threat by the total +1 of all cards in the staging area. Any player may choose to discard from play. 1 Creature ally card he controls to cancel this effect.\n\nOk, now does \"controls\" mean in this case.  it doesn't mean in play, right? So, you can also use creatures in your hand, right?\n\n \n\nSacked!\n[Treachery]\n\nWhen Revealed: Attach to a hero with no \"Sacked!\" cards attached controlled by the first player. (Cannot be canceled.) Counts as a Condition attachment with the text: \"Attached hero cannot attack, defend, commit to a quest, trigger its effect, or collect resources.\"\nShadow: If attacking enemy is a troll, resolve this card's \"when revealed\" effect.\n\nWhat about the usage of attachments of this character? Let say \"Dark Knowledge\" Can you still use that when defending with a Hero that is not \"sacked\"?\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=518709","commentId":518709,"userName":"radiskull","timestamp":1314091313,"content":"Born Aloft: this card's ability is an Action, which means that you can only use it while something else is not currently being resolved.  If a character is damaged beyond its hit points, it's too late.  If you play a Gandalf, you could use Born Aloft on him any time before the end of the round to prevent him from being discarded.\n\nThis card seems to be best on characters that have a \"come into play\" effect, or those that would otherwise go away at the end of a round/phase (like Gandalf or Beorn).\n\n \n\nA Frightened Beast: You \"control\" all cards in play in front of you.  You're missing the important text, though: \"discard from play\".  Cards in your hand are not in play, and therefore can't be used to pay the cost of this effect.\n\n \n\nSacked!: You can definitely use attachments on a Sacked! character.  Sacked! gives a list of things the character may not do, and activating attachments on a character is not on that list.  Dark Knowledge, Self Preservation, Steward of Gondor..all fair game.  Go nuts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=518711","commentId":518711,"userName":"Shelfwear","timestamp":1314091662,"content":"radiskull said:\n\nSacked! gives a list of things the character may not do, and activating attachments on a character is not on that list.  ...Steward of Gondor...all fair game.  Go nuts.\n\nRuling Gondor with your remote control while being held captive in a stinking Troll potato bag... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=518731","commentId":518731,"userName":"GhostWolf69","timestamp":1314093156,"content":"Does anyone Know what \"Destroyed\" means?\n\n\"Destroyed\" is not a game term defined anywhere in my Rule Book... yet it is used to describe what happens to a Hero that gets \"barbied-up-and-eaten\".\n\nWe assumed it meant it is Removed from Play entirely as opposed to just Discarded.\n\nBut I cannot find that anywhere in the rules.\n\nAn FAQ maybe?\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=518740","commentId":518740,"userName":"reno1051","timestamp":1314093968,"content":"destroyed is mentioned multiple times in the rulebook, mostly in regards to allies/heroes taking more damage than they have hit points; \"[card] is destroyed and put in discard pile.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=518746","commentId":518746,"userName":"GhostWolf69","timestamp":1314094914,"content":"reno1051 said:\n\ndestroyed is mentioned multiple times in the rulebook, mostly in regards to allies/heroes taking more damage than they have hit points; \"[card] is destroyed and put in discard pile.\"\n\n\n\nYupp... just searched my PDF and you are right.\n\nFunny thing is the word is NOT Used anywhere under the \"Hit Points and Damage\" section... (which is where I was looking for guidance).\n\nThat section only talks about \"defeated\" and \"leaves play\"... it never uses the word \"Destroyed\".\n\nHmmmm... I think terms like this should be more firmly Defined, especially if cards will use them like this. But thank you for the hint.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51058-conflict-at-the-carrock-first-thoughts/?do=findComment&comment=519253","commentId":519253,"userName":"Maniacske","timestamp":1314175086,"content":"Played two 3-player games last sunday. On our first run, we tried to rush and got whacked because we didn't have enough allies to take on the trolls in stage 2. On our second run we succeeded, but threat management was somewhat of a problem. We were lucky though, as the Hill Trolls didn't came out of the encounter deck till the very end of our game."}]}