{"url":"https://community.fantasyflightgames.com/topic/51097-played-my-first-successful-game/","title":"Played my first successful game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51097-played-my-first-successful-game/?do=findComment&comment=510160","commentId":510160,"userName":"Masterson","timestamp":1312673888,"content":"Played my first successful game tonight. I bought the core set launch week but was having some issues with the rules and because of my wedding I was unable to pick it up again for a while.\n\nSat down with a friend of mine tonight who's pretty good at teaching card games and we got the rules ironed out. We completed the first quest with a score of 53. Picked up my copy of search for gollum  and can't wait to play some more happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51097-played-my-first-successful-game/?do=findComment&comment=510187","commentId":510187,"userName":"TheLightdarker","timestamp":1312681738,"content":" Congrats on your first Passage Through Mirkwood (and getting married)!  I'm sure you'll be escaping from dungeons and stalking trolls like the rest of us in no time.  Feel free to share your any thoughts, progress, or questions with all of us on these boards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51097-played-my-first-successful-game/?do=findComment&comment=510363","commentId":510363,"userName":"marlow4","timestamp":1312715306,"content":"Grats!\n\nI managed to win a couple with the little core decks somehow but haven't been able to win solo with a 50-card deck yet. Don't think I'm hammering out a tight enough deck/strategy. Can't wait to have enough variety in cards to start making Rohan decks, Dwarf decks, etc. The main reason I got LOTR was for the solo play aspect so I can tinker around with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51097-played-my-first-successful-game/?do=findComment&comment=510368","commentId":510368,"userName":"Svenn","timestamp":1312715661,"content":"Grats on your first game and win! 53 is not a bad score for a first game with 2 players. What decks were you using?\n\nI tried my first game solo and lost, but then I came back with a 73 point 2 player win shortly after. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51097-played-my-first-successful-game/?do=findComment&comment=510415","commentId":510415,"userName":"Masterson","timestamp":1312720902,"content":"thank you!\n\nwe used tactics and leadership. the score would have been 9 points less if i hadn't commited my dwarf hero on the last quest attempt. he only had 1 life left and got taken out by a 1 damage treachery card"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51097-played-my-first-successful-game/?do=findComment&comment=510554","commentId":510554,"userName":"DurinIII","timestamp":1312742684,"content":" Indeed Congrats Materson! Quite a fun game. Mirkwood is still my favorite quest so far (on the same principle that Fellowship of the Ring is my favorite movie of the three)...it's the first taste.  Mirkwood feels really \"hobbity\" if you will; very Tolkien. Happy gaming!"}]}