{"url":"https://community.fantasyflightgames.com/topic/51160-cards-staying-in-play/","title":"Cards staying in play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51160-cards-staying-in-play/?do=findComment&comment=510662","commentId":510662,"userName":"Iluvatarmba","timestamp":1312764123,"content":" I am curious if an event card stays in play for the entire game once played (granted there is no text saying to discard it on any card) or just a round. An example would be Beorn's Hospitality (Lore). This card allows you to heal any character of all damage in any phase of the round as many times as you want to in the round (once per phase). Would it be discarded at the refresh phase or stay for the rest of the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51160-cards-staying-in-play/?do=findComment&comment=510671","commentId":510671,"userName":"TheLightdarker","timestamp":1312766533,"content":" Page 9 of the rulebook states, \"An event card is played from a player's hand, its text effects are resolved, and the card is then placed in its owner's discard pile.\"\n\nEvents are played, their effect takes place once, as the card specifies, and it is then discarded.  The card does not remain in play for any length of time (i.e., until the end of phase, or until the end of the round), it is discarded immediately after the effect is resolved."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51160-cards-staying-in-play/?do=findComment&comment=510674","commentId":510674,"userName":"radiskull","timestamp":1312767433,"content":" With Beorn's Hospitality specifically, the card reads: \"Action: Choose a player. Heal all damage on each hero controlled by that player.\"\n\nSo.... Choose a player.  Heal all of that player's heroes to full.  There's nothing to suggest that this would happen more than once."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51160-cards-staying-in-play/?do=findComment&comment=517422","commentId":517422,"userName":"Iluvatarmba","timestamp":1313831564,"content":" Thankyou very much for your help I must have missed that both times I read the Rules. I guess third times a charm."}]}