{"url":"https://community.fantasyflightgames.com/topic/51175-i-was-doing-it-wrong/","title":"I was doing it wrong","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51175-i-was-doing-it-wrong/?do=findComment&comment=510826","commentId":510826,"userName":"marlow4","timestamp":1312795247,"content":"Just figured out where I was messing up.\n\nFrom the unofficial FAQ:\n\n\"19. Do the threat of engaged enemies still count during the questing phase? Do engaged enemies disengage at the end of each round?\n\nOnly the threat of enemies in the staging area count when determining threat during the questing phase. When enemies move from the staging area to engaged with a player, the enemies stay engaged with that player over subsequent rounds unless a specific effect allows them to move back to the staging area. While engaged their threat is no longer counted, in the same way that the threat of an active location is no longer counted.\"\n\n \n\nI thought the enemies refreshed during the Refresh phase as well. I didn't realize they stay engaged through the rounds. Needless to say, I wasn't making much progress questing against all that accumulated threat. *bonk*\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51175-i-was-doing-it-wrong/?do=findComment&comment=510986","commentId":510986,"userName":"Kiwina","timestamp":1312806268,"content":" That has been a common mistake.  Hopefully your finding your quests more successful now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51175-i-was-doing-it-wrong/?do=findComment&comment=511010","commentId":511010,"userName":"Mighty Jim 83","timestamp":1312807367,"content":"Yeah, I did that for my first couple of games - made life pretty difficult.\n\nFAQs are useful things."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51175-i-was-doing-it-wrong/?do=findComment&comment=513395","commentId":513395,"userName":"evilidler","timestamp":1313117773,"content":" I got this on first read-through of the rules. I think the rules for this game really hammer the point in, compared to the somewhat confusing rules in all the other LCGs :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nMaybe that's the problem; you see two pages stating the same facts three or more times (explanation of resource use is a good example) and your eyes just glaze over, making you skip crucial information only stated once. If repetition were to be reduced the rules could probably be compacted to 4 pages + a 1-page turn sequence."}]}