{"url":"https://community.fantasyflightgames.com/topic/51220-jata-solo/","title":"JATA - Solo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511433","commentId":511433,"userName":"marlow4","timestamp":1312847646,"content":"Journey Along the Anduin is kicking my butt. I finally had a solid start with a 50-card Lore/Leadership deck tonight and got the rug pulled out from under me. I had my threat in good shape, had 8 damage on the Hill Troll thanks to Sneak Attack + Gandalf x2, a bunch of characters out, and a hand full of cards.\n\nThen Pursued by Shadow happened. Ouch. It added like 9 threat in one draw. And as I desperately tried to salvage the game, and thought I might still be able to push forward, I got rid of the first Hill Troll only to draw the second one before I could get to the second quest card.\n\nThis scenario just seems to destroy anything I send at it.\n\nI'm starting to wonder if the key to getting the upper hand on this scenario in solo play is to use just two heroes instead of three to give yourself more time to build up by starting with a lower threat? I mean, the rules state that we don't have to field three heroes, 1 to 3.\n\nOff to experiment. My tears will flow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511455","commentId":511455,"userName":"Spirit Juggler","timestamp":1312855337,"content":"I've only managed passage through Mirkwood Solo so far although I haven't tried HFG solo and I've not tried with the new cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511471","commentId":511471,"userName":"HilariousPete","timestamp":1312858692,"content":"I also never managed to finish Journey Down the Anduin successfully. The trolls are just way too heavy. In addition, usually a solo player will face 3 encounter cards in the first round (2 if he's lucky and drew the troll right in the beginning). So the start is pretty difficult.\n\nI tried a warrior-hero deck (Legolas, Aragorn, Glorfindel), together they have 9 attack strength, and many cheap allies (e.g. snowborn scout) to take the damage of the hill troll (or even better: citadel plate on Aragorn). I tried it 2 times, and lost both. I even was pretty lucky in the second time: 2 banks of anduin were on top of the encounter deck, so in every round I revealed the 1 lying on top of the deck, sucessfully quested the other 1 (it went on on the deck again) and travelled to the remaining one. But even then I had not enough willpower to finish the second stage fast enough, my threat level was just too high and reached 50.\n\nPerhaps a winning strategy is to use 2 heros and have a low starting threat, as you said. Dunhere and e.g. Eowyn would be ideal candidates generally, using Dunheres special attack. But without Dunedain Mark, Dunhere is useless because of the troll's 3 defense... sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif] A 2 hero deck will only be successfull if there is a good way of eliminating the troll, and there aren't many options for this (I can think of Gandalf and Forest Snare...)\n\nNext time I will try a deck based on drawing Gandalf, as DurinIII or SiCK_Boy proposed them in this forum (www.fantasyflightgames.com/edge_foros_discusion.asp [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=513998] and www.fantasyflightgames.com/edge_foros_discusion.asp [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=532601])\n\nGood luck to you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511495","commentId":511495,"userName":"lleimmoen","timestamp":1312866671,"content":"Try Beravor, Théodred, Éowyn. I have repeatedly beaten Anduin solo with these heroes with negative final score, and without stalling the end-game. If you want to see the decks, I shall provide.\n\nedit: The two hero strategy is better to be abandoned for now, surely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511507","commentId":511507,"userName":"SiCK_Boy","timestamp":1312869550,"content":"Not knowing which heroes the OP used makes it harder to analyze.\n\nA few pointers:\n\n- If your threat went up by 9 points because of Pursued by Shadows, it means you had a huge army of allies in play. By the time you get 2 or 3 allies, you should either engage the Troll or have gotten rid of him.\n\n- You're playing Lore so one of your initial objectives should be to lock the Troll with a Forest Snare. The best way to do that is to engage it and then use a Feint (which you don't have) or to block at least one attack. Your best shot at blocking one attack is Gandalf. He'll survive easily enough, except if you happen to hit a Despair as a shadow card. Another option is with Aragorn, who can survive one attack, but it's more risky as any attack boosting shadow card will kill your hero. Another option is Denethor with Protector of Lorien (in fact, any hero with Protector of Lorien can do it). Once you've blocked the Troll once, you trap him and then you can focus on building your army, managing your threat and dealing it a point of damage here and there.\n\n- Hitting the second Hill Troll is a downer, but it shouldn't hurt you so much unless you're totally unprepared (most defenders exhausted, hitting a Brown Land that screws your threat in the same round, etc.).\n\n- For this scenario, the Lore cards that reduce threat in the staging area (Radagast's Cunning, Secret Paths) as well as Strider's Path are very useful to prevent a too fast escalation of your threat. You don't want the Troll to come in too early.\n\n- Once you get into the second part of the quest, start getting rid of as many enemies as possible (at least one per round).\n\n- If possible, don't move to the last stage unless you have a lot of defenders (having a Grim Resolve ready is a good way to do it) or your threat is under 30 so that you won't get engaged by too many enemies at once.\n\n- Keep persevering!\n\n- Try having a low starting threat (27 and less is a good number, although it's easily possible to succeed even with 28).\n\n- If you have more than 1 core set, consider using Aragorn as a hero and adding some Spirit cards (A Test of Will, Hasty Stroke) via Celebrian's Stone. His high starting threat will be offset by the additional options you get. You could use maybe Denethor, Aragorn and Theodred."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511618","commentId":511618,"userName":"avgzxc","timestamp":1312886317,"content":"Marlow said:\n\nThen Pursued by Shadow happened. Ouch. It added like 9 threat in one draw. And as I desperately tried to salvage the game, and thought I might still be able to push forward, I got rid of the first Hill Troll only to draw the second one before I could get to the second quest card.\n\nPursued by Shadow is handled by adding spirit and 3 A Test of Will but that would change the deck a lot.. Hmmm. To kill a troll you need damage so the first thing that comes to my mind is using 3 For Gondor. You also can use Denethor(better use him if you do not already) to peak each turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511641","commentId":511641,"userName":"Bray","timestamp":1312888840,"content":"A few months ago I posted a deck on BGG that might give you some ideas. It's 30 cards with 1 Gandalf, built from a single core set. I wanted a 3 sphere deck without Leadership, since that sphere is so obviously overpowered compared to the others. The last time I played this versus the Anduin quest I scored an 11.\n\n \n\nwww.boardgamegeek.com/article/6735434#6735434 [http://www.boardgamegeek.com/article/6735434#6735434]\n\n \n\n== Heroes (3)\n1x Beravor\n1x Eowyn\n1x Legolas\n\n== Neutral (1)\n1x Gandalf\n\n== Tactics (11)\n3x Veteran Axehand\n2x Blade of Gondolin\n1x Horn of Gondor\n1x Stand Together\n2x Quick Strike\n2x Feint\n\n== Lore (9)\n1x Henamarth Riversong\n2x Daughter of Nimrodel\n2x Protector of Lorien\n2x Forest Snare\n2x Secret Paths\n\n== Spirit (9)\n1x Unexpected Courage\n2x The Favor of the Lady\n2x A Test of Will\n2x Hasty Stroke\n2x The Galadhrim's Greeting\n\nThe main goal versus Journey Down the Anduin is to keep your threat below 30 if at all possible. Above that, and especially at 35, the quest becomes much harder for this deck. Avoid attacks with Feint and Forest Snare, pick off engaged enemies with Legolas, and keep a spirit resource and A Test of Will in reserve for the truly disgusting treachery cards like Necromancer's Reach."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51220-jata-solo/?do=findComment&comment=511642","commentId":511642,"userName":"marlow4","timestamp":1312889370,"content":"Thanks for the advice guys, appreciate it. Still tweaking and trying.\n\nI used Denethor, Glorfindel, and Theodred in that attempt I refer to in the first post. With the idea that Theo could always give that resource to Glory for healing purposes. It was a little overkill as I only really took one damage the entire game, it was just a matter of losing because of my threat meter. (Edit: one healable damage that is, some blockers were killed off completely of course.)\n\nPeaking with Denethor helped a lot and was the reason I used him instead of going for more card draw with Bilbo or Beravor.\n\nCard draw was solid, resources were plentiful, and I was able to field a large army which ultimately kicked my butt as you figured thanks to Pursued by Shadow.\n\nI think ultimately having that second Hill Troll drop before I could move to the second quest was just too much of a stall. I used Gandalf to wound the first one instead of lowering my threat. Ran out of time after Hill Troll #2.\n\n \n\nTried again with a Spirit/Tactics deck with Eowyn, Eleanor, and Legolas and managed to get to the second quest but was overwhelmed after that. Goblin Snipers and Wargs are a pain. I have come to despise the Surge keyword. It's like nails in my coffin."}]}