{"url":"https://community.fantasyflightgames.com/topic/51348-low-wisdom-problem/","title":"Low Wisdom Problem","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51348-low-wisdom-problem/?do=findComment&comment=512708","commentId":512708,"userName":"BranWheatKillah","timestamp":1313021122,"content":"I am running into a low Wisdom problem while trying to be creative with deck ideas. Off the top of my head, the only two characters I can think of with Wisdom above a 2 are Glorfindel at 3 and Eowyn at 4.\n\nI was running Frodo (2), Thoedred (1), and Dunhere (1). My deck has allies with Wisdom, has the +2 Wisdom item in it, and has a myriad of threat lowering cards at its disposal. Unfortunately, even in Passage Through Mirkwood, I am finding that this only works for a turn or two as the locations begin to pile up and unless I draw into the perfect had to supplement my Wisdom, I find myself swimming in a sea of threat, which leads to multiple engagements despite Dunhere's best efforts. I've tried using the card that lowers a location's threat by 1, which has helped, but even this is just a stalling tactic.\n\nFor the time being I am going to switch out Theodred for Gloin, as he has an additional point of Wisdom, but I'm not sure that is going to be enough.\n\nHas anyone been successful with a low Wisdom party or has it been decided that Glorfindel or Eowyn are necessary to complete quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51348-low-wisdom-problem/?do=findComment&comment=512734","commentId":512734,"userName":"Spirit Juggler","timestamp":1313026011,"content":"It depends on the rest of the deck and depends on the allies you're using. I haven't found not having them in a deck to be terribly bad. With Northern tracker you can deal with locations in the staging area much more easily and legolas during combat can be used to add progress even if you don't manage it during the questing phase.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51348-low-wisdom-problem/?do=findComment&comment=513111","commentId":513111,"userName":"SiCK_Boy","timestamp":1313075773,"content":"The important thing is to keep emptying the staging area every turn. On average, playing solo, you'll face a new card with a value of 2 threat per turn.\n\nThe heroes you're using are fine. Except on the first turn, you should be able to generate enough Willpower (not Wisdom) to evercome the threat from the staging area.\n\nJust to be sure: you know that the active location and engaged enemies do NOT count their threat when you quest?\n\nTry playing low cost allies that add Willpower to your team. With Spirit, you have Wandering Took and Westfold Horse-Breaker. Leadership provides Guard of the Citadel.\n\nAgainst Passage through Mirkwood, mulligan until you get a Wandering Took or Westfold Horse-Breaker. You may consider keeping a hand with Northern Tracker as it also makes a solid turn 2 play. On turn 1, quest with everyone. You'll have 4 or 5 Will (if you played an ally) versus the Forest Spider (2), Old Forest Road (1) and another card. You should be fine. You can travel and untap Dunhere and then use him to attack (either leave the Spider in staging if your threat is still at 24 or engage it and take the damage/threat increase [using Frodo] if you went over 25). Then, on subsequent turns, try to bring out additional allies.\n\nDo NOT play Power in the Earth. Anything else is better.\n\nConsider using the Song of Wisdom to play Lore cards such as Strider's Path, Secret Path and Radagast's Cunning if needed.\n\nObviously, not using Eowyn makes questing harder, but not too hard.\n\nIf you want to post some starting hands / first 2-3 turns, we could provide additonal analysis."}]}