{"url":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/","title":"Lore/Tactics deck - Mission impossible?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514140","commentId":514140,"userName":"Shelfwear","timestamp":1313257048,"content":"I want to try Tactics/Lore for solo play but its really difficult to build a solid deck. On the internet there are nearly no deck ideas for this sphere combination (and those few are not very good either). We all know the weaknesses of Lore/Tactics: low willpower, no threat manipulation, no counter effects, nearly no extra resource generation.\n\nThe Strenghts of Lore/Tactics is card drawing, healing and burst damage, so I constructed a deck which isnt an utter failure but struggles in contrast to my Leadership/Spirit deck.\n\nI took Legolas (helps questing while attacking), Bilbo (lets draw cards without exhausting, will be main blocker), Glorfindel (highest Willpower for Tactics/Lore, will quest and take undefended damage, can attack if necessary). Drawback is the fairly high starting threat of 30.\n\nThe idea is to draw lots of cards, quest with Legolas' ability and Glorfindel+Protector of Lorien (plus other willpoer Lore allies). After some time you'll holding 15+ cards and can try to finish the final quest step in one go (discarding all cards for Protector of Lorien). After having played the central enhancements you can discard the rest and get them back with the Miners and discard them again (from the included 16 enhancements you need only 8 in play)\n\nBilbo is the main blocker (with Burning Brand, Protector of Lorien, Self Preservation). Slap Dark Knowledge on Legolas and you'll decide to leave one enemy undefended and put the damage on Glorifndel (who receives Self Preservation as well). In early game you can use Glorfindels healing ability if Bilbo gets damaged.\n\nThe Minstrels from Rivendel are for questing and fetching the one copy of Song of Wisdom, which goes on Legolas along with Horn of Gondor and Blade of Gondolin. There are only 14 Tactic cards in this deck and all are cheap ones. So Legolas will most of the time be used for his Lore resources.\n\nStrider's Path and Secret Path are for countering locations which are dangerous to this deck as you need a steady flow of small enemies for Legolas to kill.\n\n \n\nDo you have any idea to improve this deck further?\n\nHeroes\nLegolas\nBilbo\nGlorfindel\n \n\nLore - 32\nErebor Hammersmith x3\nMiner of the Iron Hills x3\nHennamarth Riversong x2\nRivendell Minstrel x3\nGleowine x2\nBurning Brand x3\nProtector of Lorien x3\nDark Knowledge x2\nSelf Preservation x3\nForest Snare x3\nSecret Paths x2\nStrider’s Path x3\n \n\nTactics - 14\nVeteran Axehand x3\nFeint x3\nQuick Strike x3\nBlade of Gondolin x3\nHorn of Gondor x2\n\nNeutral - 4\nGandalf x3\nSong of Wisdom x1\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514156","commentId":514156,"userName":"Bohemond2","timestamp":1313260911,"content":"Thanks for posting the deck; it has a number of interesting ideas.  Are you intending this deck for solo play or for group play?\n\nI have concerns over blocking with Bilbo in the early stages of the game.  There are a ton of shadow cards that turn a three attack monster into a hobbit murdering fiend.  Also, his low health total means half of any non-Glorfindel healing goes to waste on him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514160","commentId":514160,"userName":"Shelfwear","timestamp":1313261729,"content":"Its for solo play. In group play I use two tactic heroes insetad and dont have to cope with questing as the job of this deck is to fight and provide healing and cards for both players (50% of the cards are different for group play).\n\nIn the early stages I use Bilbo to block everything with an attack of up to 2, so even with a shadow +1 modifier he wont die (unless you draw despair, but such things can always happen). If there is anything bigger, I leave it undefended and assign the damage to Glorfindel (even though in early game your threat shouldnt attract larger enemies).\n\nYes, self preservation is somewhat half-wasted on Bilbo but he gets the second one after Glorfindel (to free up Glorfindels healing for other things). Once you have Burning Brand and Protetor of Lorien on Bilbo you're safe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514167","commentId":514167,"userName":"qwertyuiop","timestamp":1313264666,"content":" What encounter are you playing this against? I've been interested in a Loregolas deck for a while. I will play this build and see how it feels.  I see myself trying Beravor as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514172","commentId":514172,"userName":"Shelfwear","timestamp":1313265517,"content":"So far I've beaten Through Mirkwood and Hunt for Gollum with this deck after trying a couple of times. You need a good starting hand and need a bit luck on the first 2-3 of turns (no nasty encounter cards). The set up is fragile at the beginning. Worst is a location lock (when you much more locations than enemies) or attachment removing treacheries before you have played a burning brand.\n\nI havent tried this with beravor. Her defense is the same as Bilbos and she cant draw cards and block the same turn. She has more lifes but also more threat. At the end the most important cards are Protector of Lorien on the blocking and questing heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514181","commentId":514181,"userName":"qwertyuiop","timestamp":1313267287,"content":"I'd be putting Glorfindel on the bench instead of Bilbo when I try Beravor.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514212","commentId":514212,"userName":"SiCK_Boy","timestamp":1313274864,"content":"Take Glorfindel out. His starting threat makes things too difficult against the second scenario. Use Beravor instead. This will give you 28 starting threat and a better shot at dealing with the troll.\n\nReplace the Self Preservation with Daughter of the Nimrodel. It costs the same and can quest for 1. There aren't any allies in your deck that would justify getting Self Preservation anyway.\n\nAdd a third Gleowine (maybe taking out a Miner of the Iron Hills or the Song of Wisdom). You can always pitch extra copies to Protector of Lorien.\n\nThe most important change I could suggest to you is using Song of Kings to play Leadership cards (Sneak Attack, Steward of Gondor). You could put in 3 Song of Kings, 3 Sneak Attack and 3 Steward of Gondor, removing 1 Burning Brand, 2 Dark Knowledge, 2 Secret Paths, 3 Quick Strike and 1 Veteran Axehand. This will open up plenty of Gandalf play and the extra resources are always useful. Again, extra copies of Steward of Gondor can boost a Protector of Lorien.\n\nAlso consider replacing the other 2 Veteran Axehand with either Gondorian Spearman or Long-Beard Mapmaker. You want either the additional questing power and, if not, the Spearman can get rid of more enemies and makes a better blocker.\n\nYou want to get Henamarth Riversong out as early as possible in order to better plan your questing phase (you could also play Denethor instead of Bilbo for this, but then you wouldn't draw as many cards... the option is still there). They tell you when you'll face a Necromancer's Reach so that you can keep your Minstrels at home.\n\nDuring the first few turns, quest with Beravor (hopefuly adding a Erebor Hammersmith or a Minstrel) and try to get rid of locations via Legolas's attacks. Even consider questing with all characters on the first turn so that your threat won't skyrocket. You don't want to hit 35 too soon and Legolas and Beravor can usualy absorb at least 1 undefended attack. Once you've got more allies with Willpower, quest with Bilbo (he should be the one getting the Protector of Lorien, to block early and to quest later) and sit on Beravor to either draw, block or attack. You should go through your whole deck during most games.\n\nDon't worry too much about your threat (at least if you go with Sneak Attack Gandalf), as your multiple uses of Gandalf should bring you down at a reasonable level (always under 35, if possible under 30). Never use Gandalf to draw and only use the damage in a critical situation.\n\nI don't think you need the Quick Strike as you don't have any hero with massive power (like an armored and wounded Gimli). At best, with multiple blades against an Orc, Legolas could go for a quick hit, but most of the times, you should be able to defend and heal your heroes.\n\nYou mention \"location lock\". I don't think it should ever happen. You only get 1 card per turn, do all that you can to get rid of locations as they pop up. Throw cards via Protector of Lorien as needed, even if they are good cards.\n\nI believe you're making things harder than needed for yourself with Tactics. The hero is nice, but the cards aren't all that good. The best one remains Feint, that you can use before trapping a big enemy. But you could find other cards that are just as useful in Lore and with Songs and the Minstrels, you can make use of the best cards each sphere has to offer without using other heroes. Still, it's an interesting challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514297","commentId":514297,"userName":"Shelfwear","timestamp":1313308490,"content":"Thanks for the detailed input, more food for thoughts.\n\nSiCK_Boy said:\n\nTake Glorfindel out. His starting threat makes things too difficult against the second scenario. Use Beravor instead. This will give you 28 starting threat and a better shot at dealing with the troll.\n\n\n\nI will try this, this might be crucial for the Anduin scenario (but then if you dont have Forest Snare and/or Feint from the very beginning you're doomed anyway regardless of threat). One point less willpower could be desastrous as you'll need every single point of it at the beginning and you'll be drawing more cards than you can pay for anyway, so Beravors only benefit would be the lower threat. This deck really needs a Lore Hero with high willpower and low threat (like Eowyn). I will try Beravor and see how it works.\n\nSiCK_Boy said:\n\nReplace the Self Preservation with Daughter of the Nimrodel. It costs the same and can quest for 1. There aren't any allies in your deck that would justify getting Self Preservation anyway.\n\n\n\nWhen I constructed this deck I had to choose between these two, as both would be an overkill. I decided for the enhancements as I was afraid that allies might die by treachery cards and the synergy with discarding/getting back with the Blacksmith. Might try the Daughters instead and see how things work out.\n\nSiCK_Boy said:\n\nThe most important change I could suggest to you is using Song of Kings to play Leadership cards.\n\n\n\nLeadership cards are a boost for every deck, without doubt and this one would benefit as well. The main challenge here was to construct a solid Lore/Tacticts deck which is considered the least attractive combination of spheres. Adding Leadership cards would turn it in fact into a tri-sphere deck, something I wanted to avoid. The idea was to limit myself to the stuff these two spheres provide (call it masochism...)\n\nSiCK_Boy said:\n\nOnce you've got more allies with Willpower, quest with Bilbo (he should be the one getting the Protector of Lorien, to block early and to quest later) and sit on Beravor to either draw, block or attack.\n\n\n\nThanks for the pointer, I missed the strategy to change quester/blocker in midgame so Bilbo takes over questing.\n\nSiCK_Boy said:\n\nI don't think you need the Quick Strike as you don't have any hero with massive power .\n\n\n\nI agree, these three cards are more or less fillers. Not sure what to use instead of them from Tactics. I had 3x Born Aloft for them (for Gandalf and the Blacksmith) but this deck really doesnt has the resources to frequently play Gandalf and I ended up discarding Born Aloft for Protector all the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=514796","commentId":514796,"userName":"Apophenia","timestamp":1313409805,"content":" I played a Lore/Tactics deck for a while relying on both Denethor and Hennamarth Riversong to predict the future (playing solo). This let me allocate all of my characters efficiently. I used Denethor, Glorfindel, and Legolas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=2399086","commentId":2399086,"userName":"okrim83","timestamp":1473000159,"content":"Some time ago I built a deck with Beravor, Mablung and TactAragorn.\nI used Dunedain allies, Dunedain Hunter primarily going in combo with Mablung, but I was using the mechanism of the eagles also. The advantage of Beravor is to be able to use the traps and draw cards, of course, but above all to use Wingfoot of all Heroes accompanied by Henamarth Riversong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=2399123","commentId":2399123,"userName":"Lecitadin","timestamp":1473002230,"content":"Lore Aragorn has always been one of my favorite heroes, he gets you acess to good Doom cards in solo, and to Sword that was Broken (paid with Good Harvest or a Song). \n\nLore can work great with tactics, especially with Ents, but I would suggest, for solo, to go with 2 Lore heroes and one Tactics hero.\n\nA good combo can also be a traps deck with Damrod."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=2399138","commentId":2399138,"userName":"Network57","timestamp":1473003179,"content":"Ents and Rangers can cover multiple bases. Decent willpower, encounter control, and combat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=2399191","commentId":2399191,"userName":"Seastan","timestamp":1473006322,"content":">  but above all to use Wingfoot of all Heroes accompanied by Henamarth Riversong.\n\n \n\nHow do you use Wingfoot on all your heroes? It's unique..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=2399254","commentId":2399254,"userName":"okrim83","timestamp":1473010393,"content":"ops..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=2399272","commentId":2399272,"userName":"Authraw","timestamp":1473011550,"content":"Holy necro batman!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51513-loretactics-deck-mission-impossible/?do=findComment&comment=2400220","commentId":2400220,"userName":"Crabble","timestamp":1473087166,"content":"\"When there is no more room in hell the dead will walk the earth\" ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nBeside this being a massive necro thread the deck posted in the original post needs to cut Bilbo. It needs a defender so Lore-Denethor might be good if you have to work with \"old\" cards.\n\nEdited September 5, 2016 by Crabble"}]}