{"url":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/","title":"What am I missing? -Forrest Snare","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514129","commentId":514129,"userName":"Eyedunno53","timestamp":1313254531,"content":"Ok, so I just got this game, and tried out a lore deck.  Forrest Snare seems really good when used on powerful enemies.  Almost too good... So I was looking on here and everyone seems to be talking about blocking or \"Feinting\" before using the snare.  I am not understanding this.  The text reads \"Attach to an enemy that is engaged with a player.\"  So why couldn't you engage the enemy then use the snare before it ever gets a chance to attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514130","commentId":514130,"userName":"Bohemond2","timestamp":1313254855,"content":"Attachments can only be played during the planing phase (phase 2).  Since enemies normally engage during the encounter phase (phase 5) and attack during the combat phase (phase 6), you will not be able to play the card between the initial engagement and its first attack.  Some cards, I am looking at you son of Arnor, can change those basic rules, but, as a general rules, you need to deal with one attack from an enemy before using Forest Snare."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514133","commentId":514133,"userName":"Eyedunno53","timestamp":1313255080,"content":"Ahhhh, ok.  I feel dumb now.  For some reason my brain is having troubles keeping the flow of the game in the proper order.  I keep wanting to attack things before I resolve questing and things like that.  I'm gonna go find me a flow sheet... >.>"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514150","commentId":514150,"userName":"radiskull","timestamp":1313259888,"content":" There's a nice flowchart at the end of the rulebook."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514151","commentId":514151,"userName":"marlow4","timestamp":1313260101,"content":"Eyedunno52 said:\n\n \n\nAhhhh, ok.  I feel dumb now.  For some reason my brain is having troubles keeping the flow of the game in the proper order.  I keep wanting to attack things before I resolve questing and things like that.  I'm gonna go find me a flow sheet... >.>\n\n \n\n \n\n \n\nDon't sweat it. Some of us are learning it right beside ya. I've reread the FAQ like 3x now and still go back to it when I forget how something works. That's what these forums are for, to discuss and get clarification and whatnot. Folks here are real helpful with helping sort out how specific cards can work and timing issues.\n\nWelcome to the game. Keep tinkering with the decks and keep playing. It gets smoother and smoother. Watch out for Escape from Dol Guldur, it's a doozy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514162","commentId":514162,"userName":"Eyedunno53","timestamp":1313262536,"content":"Yeah, I didn't like the one in the back of the book.  I found one elsewhere.  Lets see if helps. :S\n\nI have tried all of the quests.  the Escape is nasty brutal.  The other three (I have Hunt for Gollum) are easy enough.  Especially hunt for Gollum, for some reason.  I need to go back and try the River again, now that I know how the Snare is SUPPOSED to work. \n\nAll in all, loving the game.  I think games are easier to learn when you have someone else there pointing out when you make a mistake though.  I bought the game to play solo, but I can see how a partner would benefit me while learning... ok, while playing too, but for now, all I have is me.\n\nThanks for the help guys."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514239","commentId":514239,"userName":"guciomir","timestamp":1313282786,"content":"Gollum was also \"easiest\" for me for some reason... But then I realised I have a problem with passing Anduin River quest so I changed my deck from \"location oriented\" to be more \"fight oriented\". And suddenly I was passing both quests, but Hunt For Gollum was not auto win anymore and was feeling more like challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51511-what-am-i-missing-forrest-snare/?do=findComment&comment=514253","commentId":514253,"userName":"Eyedunno53","timestamp":1313290977,"content":"Yeah, I figured that was my situation as well.  My deck was definately set up to quest like a mad bastard, in an attempt to finish Anduin.  So both Anduin and Hunt for Gollum were easy breezy.  So much so, they were almost let downs.  I mean, the \"final ambush\" of one of my games consisted of 1 creature... one!  Some ambush xD I think there was a fallback order and that poor guy didn't get the message."}]}