{"url":"https://community.fantasyflightgames.com/topic/51557-travel-phase-and-staging-during-quest-phase/","title":"travel phase and staging during quest phase ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51557-travel-phase-and-staging-during-quest-phase/?do=findComment&comment=514471","commentId":514471,"userName":"Agesilaos","timestamp":1313340920,"content":"Hi Guys,\n\nI have a couple of questions regarding the quest phase and the travel phase:\n\n1) If the players do not commit characters to a quest during quest phase, does the encounter deck still reveal one card per player (i.e. one card only in solo play) and place it in the staging area?\n\n2) During the travel phase\n\n   a) Does at least one hero have to travel to the location to make it an active location, or can a location be activated by an ally travelling to it as well?\n\n   b) Do you exhaust your heroes/characters if you travel to a location in the staging area and activate it?\n\n   c) Can exhauseted heroes/characters travel to a location in the staging area and activate it?\n\n   d) Or (last question) is the group of characters that committed to the quest during the quest phase also the one that travels to the location in the staging area?\n\nLooking forward to your answers, and my apologies if these questions have been answered already somewhere in the forum (I checked but couldn't find anything).\n\nRegards,\n\nA.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51557-travel-phase-and-staging-during-quest-phase/?do=findComment&comment=514479","commentId":514479,"userName":"HilariousPete","timestamp":1313342591,"content":"Hi Agesilaos,\n\n1.) Yes, 1 encounter card per player is always revealed (although there are some quest cards which change this behaviour). So you should commit enough characters to questing, or else your threat level will increase too much.\n\n2.) a.) You always travel as a group with all your characters. There is no company splitting or something like that. In 2 player games, you also travel to only 1 location, which is then the active location for both players.\n\nb.) No, you don't exhaust characters when you travel. But some locations do have other travel \"costs\" (e.g. Necromancer's Pass forces you to discard cards)\n\nc.) Yes, even if all your characters are exhausted you can travel to 1 location. But keep in mind that you can do this only after the quest resolution, in phase  4. This means that you can travel to 1 location in 1 round at the max. Also, the previous location has to be fully explored and discarded, before you can travel to a new location.\n\nd.) Yes, because all your characters travel to that location. But that should be clear with the answer for a.)    ;-)\n\nGreetings,\n\nHilarious Pete\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51557-travel-phase-and-staging-during-quest-phase/?do=findComment&comment=514481","commentId":514481,"userName":"Shelfwear","timestamp":1313342771,"content":"1) yes, every turn encounter cards are drawn and your willpower is matched to the threat in the staging area, regardless if you commit any Characters to the quest or not. So if you decide not to commit with any characters you'll get a big threat increase bc your questing willpower will probably be 0.\n\n2a) you dont need to commit anybody to travel to the region - you just decide to do it (except the location card specifically asks you to do something special)\n\n2b) no\n\n2c-d) see 2a"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51557-travel-phase-and-staging-during-quest-phase/?do=findComment&comment=514577","commentId":514577,"userName":"radiskull","timestamp":1313365933,"content":" I agree with everything that's been said so far - hopefully this will clarify things and not be overly confusing, but:\n\nYour characters don't travel to a location, you and your fellow players do.  Your \"fellowship\", as it were, decides as a group whether or not to travel, and individual characters don't really enter into the equation.  No one exhausts or anything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51557-travel-phase-and-staging-during-quest-phase/?do=findComment&comment=514622","commentId":514622,"userName":"Agesilaos","timestamp":1313378656,"content":"Dear Hilarious Pete, Shelfware and Radiskull,\n\nthanks very much for the prompt and comprehensive replies! Everything is clear and makes sense.\n\n \n\nBest wishes,\n\nA."}]}