{"url":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/","title":"Help with two decks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=514704","commentId":514704,"userName":"carolina_bryan","timestamp":1313398598,"content":"Hello all hope you are doing well.  I have lurked for the forums for a while, but rarely post.  I was wondering if I could get some advice from the community on constructing two decks.  Here's the deal:\n\n1)  When I play solo, I play with two decks.  I do this mainly because my wife plays LOTR with me occasionally and I like to have a second deck ready for her.  I also prefer the general tuning of the difficulty level with two decks versus one;\n\n2) When the game first came out, I played a lot, having reasonable success with Aaragorn/Eowyn/Dunhere and Legolas/Denethor/Berevor decks.  I was able to complete Nightmare Mode at least once (the FAQ way) with this pairing.  With the delay between release and The Hunt for Gollum, the game found its way to the shelf.  I own, but have not played, both expansion packs;\n\n3)  I have searched the forums and BGG prior to asking--the vast majority of decks posted on the interwebs address tuning one deck to perfection rather than tuning a pair to work together;\n\n4)  I prefer generalist decks over decks tuned to a particular encounter, because, as I said I like to try nightmare mode from time to time.  It would also help if one of the decks was fairly \"simple\", so I could hand it to my wife, explain the gist of it to her and then just start playing.  However, my wife plays games frequently with me and understands most mechanics pretty well, so it doesn't have to be \"beginner simple\";\n\n5) I have access to three core sets and both ex-packs.\n\nAny thoughts on two good decks?  Thanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=514741","commentId":514741,"userName":"Jekzer","timestamp":1313402065,"content":"I'll point you to one of the possible useful 2-sphere decks that were published in BGG boards:\n\nhttp://boardgamegeek.com/thread/648821/the-prancing-pony-finest-assortment-of-custom-bu [http://boardgamegeek.com/thread/648821/the-prancing-pony-finest-assortment-of-custom-bu]\n\nIt is highly defensive and good for quest advancing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=514742","commentId":514742,"userName":"carolina_bryan","timestamp":1313402678,"content":"Jekzer said:\n\nI'll point you to one of the possible useful 2-sphere decks that were published in BGG boards:\n\nhttp://boardgamegeek.com/thread/648821/the-prancing-pony-finest-assortment-of-custom-bu [http://boardgamegeek.com/thread/648821/the-prancing-pony-finest-assortment-of-custom-bu]\n\nIt is highly defensive and good for quest advancing.\n\n\n\n \n\nThanks for the response.  I found that in my previous search.  I didn't find that particularly helpful, in that it does not utilize three core sets and pre-dates both expansions.  Any other thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=514802","commentId":514802,"userName":"Shelfwear","timestamp":1313410439,"content":"There are a couple of decks at http://www.cardgamedb.com [http://www.cardgamedb.com] (Forums) but many of those are pre-expansion. But maybe you can take those blueprints and make them better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=514817","commentId":514817,"userName":"TheLightdarker","timestamp":1313411869,"content":"Being an owner of three Core Sets and both Adventure Packs myself, and also preferring to make \"generalized\" decks to use against any and all scenarios, I think I understand where you're coming from. The following two decks are works in progress (since I don't have as much opportunity as I would like to test them out, anymore), but they have been met with fantastic success thus far. They have been recreated just now from memory only, so please excuse if there may be some subtle differences between these ideas and my actual decks (especially for the second deck, since I normally play the first).  Of course, modify them as you see fit:\n\nEdit: Also, the second of the two decks I mention was played by my (up until recently) girlfriend (whom had no gaming experience whatsoever), so it should be pretty playable for your wife.\n\n\"Tanking\" Deck, 2Tactics/1Leadership\n\nThis deck's job is to deal with enemies.  By enhancing Gimli, you end up with a character that can destroy any enemy in the game, and fueled by lots of \"take extra action\" effects and supplemented by Legolas/allies, he becomes an utterly devastating powerhouse.  Theodred tosses resources to whomever needs them (typically the other player), as almost all Leadership cards in this deck have very low costs.  Faramir may be difficult to play, so it could be easier to just discard him (Eowyn in the other deck), and let them play Stand and Fight.  The Steward of Gondor typically goes on Eowyn (upon whom the other deck can play a Blessing of Wisdom, as well).  The Horn of Gondor typically goes on Legolas, as you may find yourself wanting more resources than you'll have access to and Gimli needs other restricted attachments.\n\nHero (3)\nGimli (Core) x1\nLegolas (Core) x1\nTheodred (Core) x1\n\nAlly (23)\nFaramir (Core) x2\nGandalf (Core) x3\nGondorian Spearman (Core) x3\nGuard of the Citadel (Core) x3\nHorseback Archer (Core) x3\nSnowbourn Scout (Core) x3\nVeteran Axehand (Core) x3\nWinged Guardian (THfG) x3\n\nAttachment (18)\nBlade of Gondolin (Core) x2\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDunedain Mark (THfG) x3\nDwarven Axe (Core) x3\nHorn of Gondor (Core) x2\nSteward of Gondor (Core) x3\n\nEvent (9)\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\n\n \n\n\"Questing/Support\" Deck, 2Spirit/1Lore\n\nThis deck takes care of questing and healing, and a primary goal should be to get out Northern Tracker.  The majority of cards are Spirit, but there are two copies of Song of Wisdom that the Rivendell Minstrels can fetch.  Theodred should toss Spirit heroes resources to get trackers out ASAP.  Unexpected Courage is of course great on Beravor or Gimli depending on the quest you're playing, and Westfold Horse-Breaker is a cheap way to add extra questing power and discard to give Gimli the ability to potentially drop one more big baddie one turn.  This deck is of course chock full of threat-reducing and shadow/when revealed effect cancelling abilities, and normally does a great job of taking care of questing and locations all by itself in two player games.  My only real complaint with this deck is that for some quests, getting lots of progress tokens doesn't matter as much as accomplishing certain objectives (i.e., killing the hill troll, or CatC's goal).  Still, it is exceedingly efficient at what it does (though I'm excited to add Haldir soon!).  Miner of the Iron Hills is included to get rid of Caught in a Web and Sacked!, but 95% of the time it is a throw-away card.  This deck rarely sees any combat, but Frodo will make for a good defender if it absolutely has to happen.  I used to use Dunhere in this deck before Frodo was released, but he never really had any opporunity to see any action, and really only existed as someone who was left readied... only to never end up attacking.  There are three copies of Forest Snare in this deck, but I very rarely end up using them.\n\nHero (3)\nBeravor (Core) x1\nEowyn (Core) x1\nFrodo Baggins (CatC) x1\n\nAlly (22)\nDaughter of the Nimrodel (Core) x3\nEomund (CatC) x2\nGleowine (Core) x2\nHenamarth Riversong (Core) x2\nMiner of the Iron Hills (Core) x2\nNorthern Tracker (Core) x3\nWandering Took (Core) x2\nWestfold Horse-Breaker (THfG) x3\nRivendell Minstrel (THFG) x3\n\nAttachment (11)\nForest Snare (Core) x3\nSelf Preservation (Core) x3\nSong of Wisdom (CatC) x2\nUnexpected Courage (Core) x3\n\nEvent (17)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nHasty Stroke (Core) x3\nStand and Fight (Core) x2\nThe Galadhrim's Greeting (Core) x3\nSecret Paths (Core) x2\nRadagast's Cunning (Core) x2\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=514821","commentId":514821,"userName":"carolina_bryan","timestamp":1313412455,"content":"Lightdarker said:\n\nBeing an owner of three Core Sets and both Adventure Packs myself, and also preferring to make \"generalized\" decks to use against any and all scenarios, I think I understand where you're coming from. The following two decks are works in progress . . .\n \n\n\n\nThis was great, and exactly what I was looking for! Thank you very much.  I will give these a try.  In the meantime, if anyone else would like to chime in I would appreciate it.\n\nIf nothing else, I'll post how this pairing fares.\n\nThanks again.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=514850","commentId":514850,"userName":"TheLightdarker","timestamp":1313415764,"content":"Not a problem, and I'm glad that you found what I posted helpful.  I would be very interested to read any comments or thoughts you end up having on those decks if you get the chance to try them out, but until then, good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=518629","commentId":518629,"userName":"Iver2","timestamp":1314075090,"content":"Guys, one question: How and why do you use wandering Took? I never thought this guy any useful..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=518781","commentId":518781,"userName":"TheLightdarker","timestamp":1314098836,"content":"Iver said:\n\n \n\nGuys, one question: How and why do you use wandering Took? I never thought this guy any useful...\n\n \n\n \n\nI used to use \"The Favor of the Lady,\" but I have replaced it with Wandering Took for a few reasons.\n\n1. He costs just as much as The Favor of the Lady, as he also gives +1 Willpower toward questing, making them more or less equal in this regard\n\n2. As he is an ally, he can be a blocker in a pinch, and as he has 1 Defense, he can potentially block indefinitely against very weak enemies (i.e., Eastern Crows)\n\n3. Two hit points means he won't be killed by a single The Necromancer's Reach or Evil Storm, etc.\n\n4. Faramir can give +1 Willpower to Wandering Took, whereas his ability has no effect on The Favor of the Lady attachment.\n\n5. I've never actually used him for this, but you can use his ability to give your ally an extra blocker (in my decks, this could be used to help set up Gimli to be free for a big attack).\n\n6. You can also use his ability to make sure that your threat is lower than your partner's threat, if you're using a non-combat focused deck.\n\nEdit: I've changed the above decks up a little bit to prepare for AJtR, I'll post the changes later today if I have some time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=518872","commentId":518872,"userName":"Dam the Man","timestamp":1314110616,"content":"I still have Favor of the Lady in my decks, Thalin in particular is in desperate need of Willpower boosting to make his ability worthwhile, WP1 isn't cutting it for long. Spirit decks have Wandering Took as well, nice barrier against Black Forest Bats when you quest with Eowyn and Took, won't get screwed out of Eowyn's 4+WP as you would if she were questing alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=520118","commentId":520118,"userName":"Iver2","timestamp":1314325184,"content":"Sorry, but if I play 2 player games with 2 sphere decks each and I normally mix Leadership and Spirit in one deck, and there are far more usable allies or cards than the Took. Your comments don't convince me at all...but thanks anyway for your input."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=520177","commentId":520177,"userName":"Mighty Jim 83","timestamp":1314334064,"content":"Generally I don't find the Wandering Took that useful, although once in a very close game, I managed to give him to another player to stop my threat from reaching 50 (i was already on 49, the Took only brought him upto 47. That gave us another two rounds, then he gave me back the Took to avoid hitting 50, and sent me well over, but left him alive long enough to kill the final enemy and win the quest.\n\nGenerally though, I don't think he's that great. Only time we've ever used the ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51593-help-with-two-decks/?do=findComment&comment=520390","commentId":520390,"userName":"TheLightdarker","timestamp":1314365065,"content":"Wandering Took is far from great, he just works well enough to include in my 2 Spirit / 1 Lore deck since I don't care for Lorien Guide and don't want to overdo the number of Lore cards.  I've never been \"floored\" by how useful he is, but he's not bad for what he is.  I'm sure once more card variety comes out, I'll end up ditching him, I just prefer him to The Favor of the Lady (and I don't use both, because my support deck when playing two-player is already massive questing overkill).\n\nFunny enough though, I happened to play Conflict at the Carrock a couple days ago with my brother, and being able to give him control of 2 Wandering Took one turn gave him enough chump blockers to engage with and absorb three troll attacks, and with Gimli + Unexpected Courage + other attackers he was then able to proceed to kill all three of them that same round, ended up being pretty sweet."}]}