{"url":"https://community.fantasyflightgames.com/topic/51616-noob-question-and-solo-deckbuilding-advice/","title":"Noob Question and Solo Deckbuilding advice","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51616-noob-question-and-solo-deckbuilding-advice/?do=findComment&comment=514948","commentId":514948,"userName":"player1649462","timestamp":1313430435,"content":"Hello all, I just got the game the other day and Liked it so much that i went out and got another core set so I could look into building a pretty solid deck.  So far I've been having difficulties with the first quest.  It's possibly because my custom decks are terrible.  I got all the way to the last card one time, but my threat was so high I got eaten by spiders (YUM!).  So, a few questions.\n\n1.)  Are the heroes considered to be part of the 50 card deck?  I know in aGoT, the plot deck is separate.  And I've seen some decks online that are 53 cards (I'm assuming the builders don't include the heroes in their number).  Simple question, could be in the book, I looked but didn't find the answer.\n\n2.)  Are there certain spheres that are a \"must\" for solo decks?  From what I can gather, green and blue seem very very good.  Purple also seems pretty good (considering it can multiply resources).  As I'm still learning the game, I'd like to stick to 2 spheres, but wasn't sure if I left 2 out it would totally destroy my ability to do anything in the game.  I've seen plenty of four color solo decks, but I'm leery of them, as they rely on the song cards to get certain spheres in play, which could be hit or miss.  \n\nI come from a MtG background, so I'm used to creating really tightly focused decks, but it seems were I to do that solo, it would not work well, because it'd be lacking questing, or abilities to deal with trechary cards/revealed effects.  I'm not opposed to running 3 colors, but I'm still worried I wouldn't be able to do much without steward of gondor, or one of the songs cards in play!\n\nThanks in advance for everyone's advice and time reading my nub post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51616-noob-question-and-solo-deckbuilding-advice/?do=findComment&comment=514953","commentId":514953,"userName":"Bohemond2","timestamp":1313431051,"content":"1) Heroes are not part of your deck.  They start in play and don't count towards the fifty card limit.\n\n2) You should be fine with a two sphere deck.  My solo deck is a Lore/Spirit deck, and does just fine against any scenario short of Escape from Dol Goldur. I'm not sure if there is a must include sphere for solo play.  If there is, I would argue for spirit, but I have seen some potent lore/tactics deck that use Gandal recycle to cover threat reduction. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51616-noob-question-and-solo-deckbuilding-advice/?do=findComment&comment=514983","commentId":514983,"userName":"Eyedunno53","timestamp":1313436472,"content":"I also use a Lore/Spirit deck for my solo (its the only way I've been able to play so far) and I've been successful on all the quests but the last one.\n\nThe thing I've noticed for playing solo (and perhaps for teams?) is that it really helps to be able to use your hero's more than once, if at all possible.  Aragorn is the obvious choice for that, since his ability is built in.  Another card that is great for that is Unexpeced Courage, which is a spirit card.  That lets me block and attack with a character, or quest and attack, or whatever you need.  VERY useful.  \"Dwarven Tomb\" lets you recycle any spirit card you want, so this is also a very good card.  \"Sneak attack\" and \"stand and fight\" will both let you get more mileage out of your ally's, which is especially useful for allys like Gandalf.\n\nThe other thing to keep track of is your threat level, obviously.  Which is yet another reason why I like spirit.  \"The Galadhrim's Greeting\" is awesome.  If I can play it first or second round, it give me a few rounds to breathe while I get other things set up.  Also dont underestimate Gandalf's ability to do this.  Unless a monster is currently kicking my butt, I would rather use him to lower my threat than put damage on monsters, honestly.  And even then, I would rather lower threat sometimes.  This keeps you in the game and if low enough it keeps more critters from jumping you before you're ready.\n\nThe other thing to look for is ways to make your cards do even better what they already do.  \"The Favor of the Lady\" and \"Celebrian's Stone\" both make a hero a better quester.  The better quester you have the less other heroes you have to commit to questing which leave other heroes open to attack and defend, OR you could quest them all anyway and finish faster before you get overrun.  (Celebrian's Stone also make Aragorn do double duty for his resource, which is a sort of \"mana fix\" since you're a MtG guy.  As are the songs, if you have the expansions, but these aren't quite as good.)\n\nNow, I've only talked about one or two spheres.  That doesn't mean these are the only ones, I would reccomend.  It all depends on your style of play.  But you get the general idea, that you have to be able to diversify your actions a little bit when you play solo.  If you over commit to one thing it could hose you in the end.  But that doesn't mean you cant tone your deck in.  For example, in Journey down the Anduin, and Hunt for Gollum, I know I'll be seeing a lot of locations.  So I really like to have \"Northern Tracker\" and \"Lorien Guide\" in my deck, as these help deal with locations efficently.  Legolas does too, if you like tactics.  If you know you're gonna face a nasty monster or two, you might consider using lore for \"Forrest Snare\" and Denethor, who has good defense.\n\n...Anyway, I've gone on, long enough :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51616-noob-question-and-solo-deckbuilding-advice/?do=findComment&comment=514996","commentId":514996,"userName":"player1649462","timestamp":1313439402,"content":"Thank a lot for the advice!  I built a lore/spirit deck to run through the first quest, just to see how well it could work (I based it on one I found online, but tweaked it because I now have 2 core sets and both expansions).  It turned out very well.  The ability to lower my threat and increase Eowyn's questing ability (through 2 different cards) was very useful.  It was nice to have Gandalf in my hand incase I needed some spike damage to a baddy that I knew was going to come out at me in the next few turns, or lower my threat to make sure it wasn't going to come at me for a few more turns.  I'm starting to see how many of the mechanics work together, and am thinking of working on a low-threat, attack in the staging area kinda deck (I forgot the name of the hero that can do this).\n\nI like the Lore/Spirit combination because it felt very much like a good blue/white control deck (Magic), which was one of my favored playstyles.  Grixis Cruel Control really was my favorite (really aggressive, direct damage, creature removal, kinda deal, if you haven't played magic recently, or at all), and I'm considering looking to building a deck to play like that, but I need far more experience with the cards.\n\nWhat I'll probably do is build a Leadership/Tactics deck to compliment this so I can play two-player, but I'm not sure if those decks synergize as well.\n\nI'm really interested in doing something with Frodo, but I can't seem to come up with a deck that will make him work.   \n\nSo I'll play around with what I've built, tweak it a bit, and when I feel a lot more comfortable try to come up with something unique.\n\nThanks for the tips, and starting points!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51616-noob-question-and-solo-deckbuilding-advice/?do=findComment&comment=515000","commentId":515000,"userName":"Bindlespin","timestamp":1313439831,"content":" use frodo to convert damage into threat and then use spirit sphere and gandalf to reduce the threat  gained from doing this.  then take care of business with your other heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51616-noob-question-and-solo-deckbuilding-advice/?do=findComment&comment=515002","commentId":515002,"userName":"Eyedunno53","timestamp":1313439939,"content":"Dunhere is one of my favorites as well.  He works well in the deck we both seem to have created.  Keep them off you and shoot them from a distance.  With Forest Snare, thrown in for just in case.  I often dont need it, but when I do...\n\nI also tried to create a Tactics/Leadership deck to complement... I've had less success with that so far, but I'm working on it.  Any ideas?"}]}