{"url":"https://community.fantasyflightgames.com/topic/51648-printing-cards/","title":"Printing Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51648-printing-cards/?do=findComment&comment=515161","commentId":515161,"userName":"JanB","timestamp":1313477011,"content":"Hi erverybody!\n\nI'm looking forward to print some fanmade szenarios, but i don't find acceptable paper. Perhaps you can give me a hint, where i can get those CardPaper?\n\nGrettings JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51648-printing-cards/?do=findComment&comment=515182","commentId":515182,"userName":"reno1051","timestamp":1313480142,"content":"im sure staples/office depot/amazon would have card stock.  i went ahead and purchased a laminator off ebay for $14 and printed out the scenarios on regular paper.  i cut out each side and used a glue stick to make them double sided, then i laminated.  worked great.  the double layered paper and lamination was durable enough for me, especially for  just the quest cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51648-printing-cards/?do=findComment&comment=515207","commentId":515207,"userName":"JanB","timestamp":1313483050,"content":" Hi reno,\n\nsounds interesting .. will try it!\n\nBut what about e.g. encountercards like the ones from Massing at osgilitah?\n\nThere it would be nice if they fit to the other cards from the coreset."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51648-printing-cards/?do=findComment&comment=515248","commentId":515248,"userName":"reno1051","timestamp":1313488668,"content":"well, afaik, MAO is a standalone adventure pack and doesnt use any of the core set encounter cards so laminating in the way i have done should be fine.  of course, other custom quests may utilize some of those cards which may pose a problem (would at least give away which encounter deck the next card is from).  even if you were to print them on the exact same card stock, you would have to cut them the same way by hand which would be near impossible to perfect, so there will still be signs of which encounter set the next card may be from.  \n\ni have no experience with any other POD for ccg/lcg's but maybe theres a company that can replicate the printing process? "}]}