{"url":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/","title":"Stand Together question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=515575","commentId":515575,"userName":"ricedwlit","timestamp":1313528193,"content":"First off, this is not about dealing damage - I have read the FAQ and know that if there is any damage to be dealt when using multiple defenders out then all of said damage goes to one defending character.\n\nInstead, it deals with how to apply the card to attacks. Here's the text from the card (my emphasis)\n\n\"Action: Chose a player. That player may declare any number of his eligible characters as defenders against each enemy attacking him this phase.\"\n\nMy question is: how does this play into the four phases for \"Resolving Attacks\" as laid out on p.18 of the rules?  The wording of \"each\" and \"this phase\" seems to me to imply that the chosen defenders are used to defend against all the attacks that turn.  In other words, for each enemy  engaged with the player that phase that is picked in step 1, the defenders declared with Stand Together are added to any other defenders picked in step 2. \n\nFor instance, suppose I am engaged with two King Spiders (3 damage each) and Ungoliant's spawn (5 damage).  I have three Veteran Axehand in play (1 defense each). If I play Stand Together and select the three Veteran Axehand allies, then using my interpretation and declaring no other defenders, if I resolve the attacks from the King Spider's first, the grouped Axehands block all damage from each King Spider (3 attack - (3x1) defense = 0) and then Ungoliant's spawn deals two damage (5 attack - (3x1) defense = 2) to one of the Axehands. \n\nPreviously I had read this card and thought it wasn't worth the trouble since I could only pool defenders for just one attack -- but if it's the case that they can be pooled for all the attacks, then this becomes a much more powerful card - especially when the Trolls attack at the Carrock!\n\nOf course, it's possible that the intended interpretation is just \"you can defend each attach with more than one character this turn\" which, while better than what I thought, is not as good as what I outlined above. I guess it comes down to a scope issue: are the characters who are standing together resisting all the attacks, or is just that each attack may face separate groups of characters that are standing together against just that attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=515597","commentId":515597,"userName":"Bonus Card","timestamp":1313531338,"content":" My take on this would be that as long as you have enough standing characters, those available characters may stand together during each enemy attack made this phase. meaning if I had 8 standing guys. 3 could be exhausted for defense of the first enemy, 2 could be exhausted for the defense of the second and the remaining 3 could be exhausted in defense of a third enemy. Of course I think (even though the card does not say it) that characters would need to exhaust in order to defend, therefore, unless readied by some other effect they could only effectively defend in one attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=515643","commentId":515643,"userName":"TheLightdarker","timestamp":1313537813,"content":" On page 18 of the rules, it says, \"a character must exhaust to be declared a defender.  Only one character can be declared as a defender for each attacking enemy.\"\n\nAn example Combat phase:\n\nKing Spider1 is chosen, Veteran Axehand1 exhausts to become declared as a defender and subsequently takes lethal damage.\n\nKing Spider2 is chosen, Veteran Axehand2 exhausts to become declared as a defender and subsequently takes lethal damage.\n\netc\n\nAs you point out, however, Stand Together reads, \"Choose a player. That player may declare any number of his eligible characters as defenders against each enemy attacking him this phase.\"  To be eligible to defend, a character must not be exhausted, and to be declared as a defender, the character must be exhausted.  However, you can do some tricks to make exhausted characters eligible once again to defend, for example:\n\nUngoliant's Spawn is chosen, you play the event Stand Together at the end of step 1 of the resolve enemy attacks part of the Combat phase.\n\nYou exhaust Veteran Axehand1 and Veteran Axehand2 to declare them as defenders, as well as Beorn.  Lets say the shadow effect gives +1 attack.  You subtract the total defense of all the allies (5) from the attack strength of the spawn (5+1=6), and end up with 1 point of damage that you must assign to one of the characters that were declared defenders.\n\nLets say there is also a King Spider engaged with you: you can \"choose\" it during step 1, and then proceed to play Grim Resolve, which readies all of your characters and makes them eligible defenders.  Plus, since \"any number of his eligible characters\" can be declared as defenders against \"each enemy attacking him this phase,\" you could exhaust your guys again to defend against the second spider.\n\nStill further, if you or your ally uses Westfold Horse-Breaker's ability (or Ever Vigilant, etc), you could have one of these same characters be declared as a defender against a third enemy (i.e., Beorn v King Spider2)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=515644","commentId":515644,"userName":"radiskull","timestamp":1313537924,"content":" I'm with Bonus Card here.  Read it as \"This phase, attacks against you can have more than one defender.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=515655","commentId":515655,"userName":"ricedwlit","timestamp":1313539239,"content":" I've no problem with the reasoning put forward by Bonus Card and Lightdarker. However, the issue of exhausting the characters does not necessarily render my reasoning invalid - simply play Stand Together before any of the enemies attack (that's why I pointed out that the card states \"this phase\"). Namely, after engaged enemies get dealt shadow cards, the first action I would take (before any enemy engaged with me attacks) is to play Stand Together and select a set of my characters to defend. I would exhaust these characters and they would then defend against every enemy engaged with me.\n\nI do think this is a loophole, as it makes the card very powerful.  Going with the BonusCards interpretation is fine with me - as it's still better than how i thought the card worked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=515784","commentId":515784,"userName":"Bonus Card","timestamp":1313567293,"content":"ricedwlit said:\n\n\nI've no problem with the reasoning put forward by Bonus Card and Lightdarker. However, the issue of exhausting the characters does not necessarily render my reasoning invalid - simply play Stand Together before any of the enemies attack (that's why I pointed out that the card states \"this phase\"). Namely, after engaged enemies get dealt shadow cards, the first action I would take (before any enemy engaged with me attacks) is to play Stand Together and select a set of my characters to defend. I would exhaust these characters and they would then defend against every enemy engaged with me.\n\nI do think this is a loophole, as it makes the card very powerful. Going with the BonusCards interpretation is fine with me - as it's still better than how i thought the card worked.\n\n\n\n \n\nNow, I do disagree just a bit, because it says nothing in the card about the ability for all enemies to attack at once. Just because it is during the same phase does not make their attack a single attack.  I think that in the rules it states that each enemy attacks independently, and I would have to side with the rules at least for that part."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=515942","commentId":515942,"userName":"radiskull","timestamp":1313580897,"content":" I disagree that the loophole you describe is possible.  Once you've exhausted defenders against the first attack, they are no longer eligible defenders for the second, unless you ready them.  I see that there is some ambiguity in parsing the language, but I really can't go along with the premise that exhausting a character once lets them defend against every attacker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=516183","commentId":516183,"userName":"ricedwlit","timestamp":1313609368,"content":"Radiskull: good point - we've got a clear precedence that characters need to exhaust to defend, hence any given character can only defend once.\n\nNow if you want a huge effect, I guess you could couple this card with any of the various ones that let you ready characters to then get some action.  Hmmm ... use Stand Together used with three Gondorian Spearman and then use Grim Resolve to let them defend again against another attack ....  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51687-stand-together-question/?do=findComment&comment=516203","commentId":516203,"userName":"radiskull","timestamp":1313613352,"content":" Stabbings abound. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}