{"url":"https://community.fantasyflightgames.com/topic/51706-the-carrock/","title":"The Carrock","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=515777","commentId":515777,"userName":"Mighty Jim 83","timestamp":1313566790,"content":"So the Carrock is immune to player card effects, which means it can't be taken out by Northern Trackers, Lorien guides, travelled to with Strider's path etc.\n\nOnce you have travelled to it (as a result of questing) what happens with Legolas?\n\nIs he a player card (or are heroes a separate category)?\n\nIf progress tokens for him killing an enemy CAN'T be added to the Carrock, do they go onto the quest instead? or is his ability just redundant?\n\n \n\nAbout to have a first play of this in a few minutes - I'm guessing it would help to have Legolas place the last token on quest card 1b, so that there's at least a chance to quest against the Carrock before fighting the trolls, although with 10+ threat automatically in the staging area, it doesn't sound particularly easy to make much progress on it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=515794","commentId":515794,"userName":"Glaurung","timestamp":1313568499,"content":"Mighty Jim said:\n\nSo the Carrock is immune to player card effects, which means it can't be taken out by Northern Trackers, Lorien guides, travelled to with Strider's path etc.\n\nOnce you have travelled to it (as a result of questing) what happens with Legolas?\n\nIs he a player card (or are heroes a separate category)?\n\nIf progress tokens for him killing an enemy CAN'T be added to the Carrock, do they go onto the quest instead? or is his ability just redundant?\n\n \n\nAbout to have a first play of this in a few minutes - I'm guessing it would help to have Legolas place the last token on quest card 1b, so that there's at least a chance to quest against the Carrock before fighting the trolls, although with 10+ threat automatically in the staging area, it doesn't sound particularly easy to make much progress on it...\n\n\n\nSo legolas ability put progress tokens on the quest i working. But if you have active location you must put tokens there. But this location is immune to player card effect ( here is a question: Hero cards a player cards or not) so nothing happen. Tokents just cancels. But if Hero cards is not players cards..........\n\nHero cards is dont belongs to player deck is for sure. But still they are the player cards right???  Otherwise to whom they belong during the game???\n\nSo look like no tokens....\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=515796","commentId":515796,"userName":"Dam the Man","timestamp":1313568681,"content":"Legolas is still a card effect:\n\n\"On the hero and player\ncards, card effects fall into one of 5 categories:\nconstant effects, actions, responses, forced effects,\nand keywords.\" (p. 23)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=515804","commentId":515804,"userName":"HilariousPete","timestamp":1313569792,"content":"Dam said:\n\nLegolas is still a card effect:\n\n\"On the hero and player\ncards, card effects fall into one of 5 categories:\nconstant effects, actions, responses, forced effects,\nand keywords.\" (p. 23)\n\n\n\nLegolas' tokens would be put on the Carrock, I think. The text in p. 23 distinguishes between player and hero cards, and also in the game components overview on p. 3 the 12 hero cards are not listed with the 120 player cards. So I think hero cards are no player cards, and the Carrock explicitly refers to a player card effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=515930","commentId":515930,"userName":"radiskull","timestamp":1313578906,"content":" No tokens.  Legolas is a card, his effect is a card effect.  As the Carrock is immune to card effects, Legolas would attempt to place tokens on the quest, the game rules would force those tokens to go on the Carrock, and the Carrock would force those tokens to not be placed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=515950","commentId":515950,"userName":"Mestrahd","timestamp":1313582220,"content":"I don't know about that. I'd have to agree with HilariousPete. The rulebook makes several remarks distinguishing hero cards from player cards and the Carrock is only immune to player card effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=515964","commentId":515964,"userName":"Shelfwear","timestamp":1313583512,"content":"For my understanding hero cards are also \"player cards\" because they are controlled by the player. Rulebook p. 8 says \"Hero cards represent the main characters a player controls in an attempt to complete a scenario.\"\n\nObvioulsy the Carrock is immune to normal effects and travel, trying to construct that Legolas is an exemption feels like trying to find a loophole in order to bypass the notion of a card to me..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=516026","commentId":516026,"userName":"radiskull","timestamp":1313589032,"content":"On further review, I think I have to abandon my previous position.  The Carrock itself refers to \"player cards\" and \"quest cards\", there are also \"encounter cards\", and \"hero cards\". I believe the game intended for these to be considered separately.  So Legolas could put tokens on the Carrock, but if Legolas had a Blade of Gondolin, the Blade could not add a token.\n\n \n\nCompare to Anduin Crossing, which states \"Progress tokens from card effects cannot be placed on the active location.\"  If the Carrock were intended to be immune to ALL card effects, why not use similar language?\n\n \n\nHilariousPete and Mestrahd, you've brought me around.  LEGOLAS 4 EVA!  Or some such.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=516055","commentId":516055,"userName":"Dain Ironfoot","timestamp":1313593540,"content":"radiskull said:\n\n \n\nOn further review, I think I have to abandon my previous position.  The Carrock itself refers to \"player cards\" and \"quest cards\", there are also \"encounter cards\", and \"hero cards\". I believe the game intended for these to be considered separately.  So Legolas could put tokens on the Carrock, but if Legolas had a Blade of Gondolin, the Blade could not add a token.\n\n \n\nCompare to Anduin Crossing, which states \"Progress tokens from card effects cannot be placed on the active location.\"  If the Carrock were intended to be immune to ALL card effects, why not use similar language?\n\n \n\nHilariousPete and Mestrahd, you've brought me around.  LEGOLAS 4 EVA!  Or some such.\n\n \n\n \n\n \n\nEvery time I read posts trying to find what are (according to some) \"loopholes\" I can't help but think that we all operate under the assumption that FFG (or any other game designer) knows what it's doing.\n\nNow, before you think I'm bashing FFG, I'm not. It's just sometimes these discussions delve into such nuance I wonder if the game designer(s) ever really thought about the text that literally.\n\nOf course, they *should* be thinking about the card text that literally. But we are all human. The left hand may not know what the right hand is doing (i.e. the creator of The Carrock may not have known about the wording on Anduin Crossing) -- another example: C@C quest cards don't have the customary \"You have beaten this quest\" notation. Is this oversight? Bad proofing/editing? New designer not knowing what came before?\n\nIf something like that can happen so easily, it makes me wonder if we delve too much into minutiae. \n\nI guess what I'm really getting at here is I would love a behind-the-scenes article about the design of cards by FFG.\n\nEither way, my take is that the designers meant for no card effect (the difference between player card and hero card seems absurd to me) to work for The Carrock. But, b/c of a wording oversight, I can see the FAQ/Errata allowing Legolas to slip through.\n\nJust my two cents!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=516108","commentId":516108,"userName":"Neffer","timestamp":1313598557,"content":" So aside from this small issue. Has any one had any luck completing the quest? I was unlucky enought to draw a hill troll during the encounter phase. Even with out the extra troll it seems like a heavy task."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=516229","commentId":516229,"userName":"TheLightdarker","timestamp":1313618499,"content":"Neffer said:\n\n So aside from this small issue. Has any one had any luck completing the quest? I was unlucky enought to draw a hill troll during the encounter phase. Even with out the extra troll it seems like a heavy task.\n\n\n\nI was able to beat it on my first attempt (2 player), using the two decks I wrote out in this thread:\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=536890 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=536890]\n\nWasn't too bad, you just have to plan carefully and make sure you have a way to deal with the trolls/not let them all engage you at once, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=516288","commentId":516288,"userName":"player582283","timestamp":1313628286,"content":"I've gone 1 for 3 against with two different decks. \n\nMy 'primary': Leadership/Spirit with Aragorn, Gloin and Eowyn was creamed the first time out, barely lost the second time (1 troll left with 6 hp left and Carrock quested but I hit 50)\n\nTactics / Lore was a challenge - I had Gimli (doing 8 dam), Legolas and Denethor.  Lost the first two but won with 49 threat on the 3rd play.\n\nI hope to get some multi player in tomorrow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=516319","commentId":516319,"userName":"Mighty Jim 83","timestamp":1313637889,"content":"Played it twice, both two-player.\n\nFirst time round, we quested too quickly, brought the trolls ino play on about the third turn, with very few allies in play, and got brutally slaughtered.\n\nSecond time round, we stalled a lot more, managed to get song of kings/steward of Gondor on the mostly Tactics deck, to bring in Grimbeorn, and had a burning brand and dunedain warning on Denethor for the Lore/Spirit minor deck, so maanged to see them off - we did say that Legolas could put tokens on the carrock when he killed a troll, but I don't think it would have affected the outcome if we'd have played it differently - maybe an extra turn, but I had a Galadhrim's greeting in hand, so the final score would have been pretty much the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=521619","commentId":521619,"userName":"Shelfwear","timestamp":1314630506,"content":"Found this on the Cardboard of the Rings site:\n\nhttp://cardboardoftherings.wordpress.com/2011/08/25/e8-one-and-three-are-odd/#comments [http://cardboardoftherings.wordpress.com/2011/08/25/e8-one-and-three-are-odd/#comments]\n\nFrom Jonathan Benton:\n\n\"As a playtester of LotR, I can confirm that anything written on a card is technically considered to be a “card effect.” Thus, only the game mechanic of questing will put tokens on the Carrock locations. Sorry for you Legolas fans.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/51706-the-carrock/?do=findComment&comment=521678","commentId":521678,"userName":"Kiwina","timestamp":1314638752,"content":" Good find.  Unfortunately that means the last time I played Conflict, we actually lost."}]}