{"url":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/","title":"Future Tournament Play in Nashville, TN","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=515883","commentId":515883,"userName":"Will Fuqua","timestamp":1313574658,"content":"Gamers at The Next Level Games in Madison, TN (north Nashville) are getting more and more players into LOTR LCG and we hope to have a tournament in the near future.  We plan on doing a few demos and then work out the tournament details.  The soonest we'd have a tournament is in the end of October.  I'd really like to hear if any would like to participate and also any suggestions on making this a great tournament. \n\nCheers, Will Fuqua"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=515905","commentId":515905,"userName":"Maggical","timestamp":1313576157,"content":"How will exactly a tournament work? I mean, rounds will have time? Is it played each player vs the same quest and then see the final score? What about if a player makes a rule mistake? Who will know?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=515937","commentId":515937,"userName":"Will Fuqua","timestamp":1313579754,"content":"We're actually trying to work all that out.  So far it's going to be 2 person teams and everyone will be going against the same scenario.  Also we may have the same sequence of cards in all the decks so it makes it more fair.  If all the decks were shuffled, then some teams would have it easier than others.  By having everyone have the same encounter deck it will make the play more based on skill than luck.  I'm thinking of having two teams sitting directly next to each other and do rounds in such a way that they can judge the team next to them.  Then have refs to be called on as well. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=516334","commentId":516334,"userName":"ClydeCloggie","timestamp":1313641917,"content":"Will Fuqua said:\n\nWe're actually trying to work all that out.  So far it's going to be 2 person teams and everyone will be going against the same scenario.  Also we may have the same sequence of cards in all the decks so it makes it more fair.  If all the decks were shuffled, then some teams would have it easier than others.  By having everyone have the same encounter deck it will make the play more based on skill than luck.  I'm thinking of having two teams sitting directly next to each other and do rounds in such a way that they can judge the team next to them.  Then have refs to be called on as well. \n\n\n\nI was thinking about standardizing the encounter deck sequence as well. It works at the beginning of the game, but after the first Eastern Crows or other card that gets shuffled back into the encounter deck you will get randomization anyway, as different teams will time killing the Crows differently for instance. That's why I decided against it in the end. (Haven't run a tournament, btw, but was just thinking about how it could work).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=516347","commentId":516347,"userName":"gatharion","timestamp":1313644797,"content":" I'd certainly come check it out if I lived in the area. Are you shouldering all of this yourself or are you getting some support from FFG?\n\nDoes anybody know if there is any glimmer of FFG-supported league play of some sort?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=516569","commentId":516569,"userName":"avgzxc","timestamp":1313672085,"content":"You could make 2 vs 2 game this way:\n\n2 players play heroes. The other 2 players play the encounter deck: each of them draws 2 cards, chooses 1 as the encounter, discard the other. Or maybe both \"shadow\" players draws 4 together and discard 2 together.\n\nOther idea would be to allow encounter deck customization and give it to the opponents to \"encounter\". Max 3 copies of each encounter card. Also, this way encounter cards from additional copies of the game would not be \"wasted\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=516583","commentId":516583,"userName":"radiskull","timestamp":1313673980,"content":" I believe FFG has some organized play stuff either in the works or already created.  They may simply be waiting until the card pool grows a bit bigger."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=516724","commentId":516724,"userName":"Masterson","timestamp":1313688167,"content":"it's a nice venue, was there for a wow minis regional a couple years ago"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=516763","commentId":516763,"userName":"Gherron","timestamp":1313695303,"content":"That sounds great!  I just purchased the game a couple of weeks ago and have only played solo-mode.\n\nI live south of Nashville (Spring Hill).  Not sure if I'm ready for a tournament, but I would love to check out some demos to make sure I'm doing things correctly.\n\nPlease let me know when you have some demos and the tournament scheduled.  I will see if I can make it up there!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=516847","commentId":516847,"userName":"Will Fuqua","timestamp":1313718527,"content":"The owner of the store, Donnie, who runs massive amount of Magic and Yu-Gi-Oh events will be helping us out.  We'll try contact FFG for help.  There's 8 of us who want organized play and we haven't done a single demo yet.  Hopefully two demos that are well advertised in the store will at least double the number of players in our store.  Even then it seems like such a small number compared to the CCG games, but we're doing what we enjoy.  I'll post on here again after we contact FFG for their suggestions for organized play. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=524604","commentId":524604,"userName":"Kotzen","timestamp":1315276722,"content":" I'd be very interested in this. Keep us in the loop."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=524740","commentId":524740,"userName":"Titan","timestamp":1315305862,"content":"Will Fuqua said:\n\n\n\n  I'm thinking of having two teams sitting directly next to each other and do rounds in such a way that they can judge the team next to them.  Then have refs to be called on as well.\n\n \n\n \n\nThis is a very interesting solution to the co-op dilemma of how to police players who don't have an opponent. One team does a round, watched by the other team, then that team does their round, watched by the first team. It could work, although the downside is that the team's playing flow will get interrupted. I think with standardized encounter decks it will also provide an advantage to the second team, which will now know what's coming. The standard encounter deck idea I don't like so much. \n\nWhat are you planning to use as a scoring system? I hope is not the system FFG has suggested so far, of counting the final amount of threat. Amount of rounds to beat a deck seems far better to me, maybe using threat as a tie breaker. Anyway, I'll be very interested to hear what you finally decide to do and how it turns out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=527436","commentId":527436,"userName":"Will Fuqua","timestamp":1315895301,"content":"On Monday, September 26th we'll be running a demo of the game at The Next Level Games in the Rivergate area (Madison, TN) from 6-9pm.  Come at any time. There will be at least three player owned copies of the game available to play as well as people to teach you the game if you haven't played before.  If you own a copy of the game, you're more than welcome to bring it in and run a table. \n\nWe've been also talking about having get togethers based around when the store gets the Adventure Packs/Expansion so we can enjoy the new material together.  Tournament play will happen when we have enough active players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=529046","commentId":529046,"userName":"Frayed","timestamp":1316178513,"content":"Tournament sounds good.  My buddy and I live in clarksville and nashville respectively, so we would be up for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=529069","commentId":529069,"userName":"Will Fuqua","timestamp":1316180163,"content":" Hey Frayed,\n\nif you're on Facebook join our 'Lord of the Rings LCG Nashville' group.  Once we see enough interested players, then the tourney is on!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=529201","commentId":529201,"userName":"Narsil0420","timestamp":1316194576,"content":"One of the problems I have with the scoring system is that it seems like it encourages people to just play the Spirit deck (and especially Eowyn).  So I was trying to think of a way to score a tournament that let simply the number times you beat the scenario be an important factor in addition to the score you recieve.\n\nI was thinking you could have each team play multiple scenarios, say the 3 Shadows of Mirkwood expansions, with the same decks. The winner of the tournament has to be a team who beat all three scenarios. Then you look at scores to determine 1st, 2nd, 3rd place.\n\nI think having to play three very different scenarios would force you to make a more well rounded pair of decks rather than just a threat managing deck (ie Eowyn, Eowyn, Eowyn). Playing multiple scenarios also reduces the luck factor you're worried about. I don't think setting up the same encounter order is a good idea. That just makes things more complicated and goes against the design of the game. All games have some luck involved, that doesn't make a winner less valid."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=529218","commentId":529218,"userName":"Will Fuqua","timestamp":1316197630,"content":" The encounter decks being the same are definitely out for all the reasons people have posted above.  A better scoring system would be nice along with multiple games for team to get a score so bad and good luck would play less of a role in scores."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=529298","commentId":529298,"userName":"bob10182","timestamp":1316223687,"content":"What about playing three games with your patner then averaging out your score over those three games. Setup a cutoff score for the bracket and eliminate teams, as the next round is played the difficulty of scenario increases. Limit the decks so no changes are made throughout the tournament, or allow a set amount of card changes per round, say 5 cards per team. then as you get to the higher scenarios allow the average of the scores determine the winner and the prize of a pre-ordered khaza dum set!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=529501","commentId":529501,"userName":"xBeakeRx","timestamp":1316279827,"content":"I agree with Bob10182, he sounds like he knows what he's talking about"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=529614","commentId":529614,"userName":"guciomir","timestamp":1316309828,"content":"You can't really use the sequence in encounter decks.Second team will ALWAYS know what the top encounter cards are because first team already encountered them.\n\nYou can forget about the scoring but instead give points to the team which win faster.\n\nFor example, 2 teams are playing first scenario. If any team wins , they get 3 points, but the team which win faster, gets 2 additional points. If the win comes in the same turn, share 1 extra point. If the team loses, then no points at all.\n\nAnd obviously, you'll need a couple of rounds, like round 1 playing against 1st core scenario, round 2 playing against 2nd core scenario etc. Just remember you'll need to find some algorithm to pair teams against each other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=530347","commentId":530347,"userName":"Frayed","timestamp":1316457142,"content":"I agree with beaker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=531700","commentId":531700,"userName":"xBeakeRx","timestamp":1316703448,"content":"Frayed, you gotta get in on one of our phone games.  It doesn't slow down the game too much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=531715","commentId":531715,"userName":"Svenn","timestamp":1316704520,"content":"xBeakeRx said:\n\nFrayed, you gotta get in on one of our phone games.  It doesn't slow down the game too much.\n\n\n\nPhone games? Like playing the game over the phone?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=531947","commentId":531947,"userName":"bob10182","timestamp":1316747409,"content":"Yeah, we started playing that way because we live on opposites sides of the country. We put the phone on speaker and one person is designated to draw the encounter deck. The other person hears what he draws and then gets the appropriate card from his encounter deck to put in tthe staging area. The only drawback is not seeing what your partner has but we just keep asking each other what allies do you have or how much willpower do you have? Its been a lot of fun and it has worked out so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51715-future-tournament-play-in-nashville-tn/?do=findComment&comment=532057","commentId":532057,"userName":"Svenn","timestamp":1316773198,"content":"My friend and I have started to play over the internet using video Skype. It actually works surprisingly well. You just download Skype, initiate a video chat, point your webcam at your playing area and then play like that.\n\nIt's essentially the same idea as what you are doing, but you can actually see the cards laid out. It's hard to tell what all the cards are sometimes but having a visual on the other person's playing field makes things much easier than trying to describe it over the phone I think. We usually have the player announce what card they putting down as well. Between that and being able to make out some of the pictures it's not too hard to keep track of the other player's cards."}]}