{"url":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/","title":"Hunt for Gollum 2b","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=517127","commentId":517127,"userName":"BeeGentle","timestamp":1313761370,"content":"Sorry if this has been answered before, but I looked and couldn't find an answer.\n\nDoes the \"draw 2, pick 1 encounter\" thing mean that I should do that in ADDITION to drawing a quest card or in place of drawing a card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=517129","commentId":517129,"userName":"Dam the Man","timestamp":1313761974,"content":"This text?\n\n\"Forced: At the beginning of the quest phase, the first player looks at the top 2 cards of the encounter deck. Reveal and add 1 of those cards to the staging area, and discard the other. \"\n\nIt happens even before anybody is committed to questing, prior to the first green box of the Quest Phase. After you've done the Forced, continue the Quest Phase as normal, commit characters, draw more cards from the Encounter deck and so on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=517154","commentId":517154,"userName":"BeeGentle","timestamp":1313765547,"content":"OK, that's what I thought. Thanks.\n\nDefinitely makes this quest harder, at least with the decks I'm trying it with. This quest definitely seems to roll through very easily or you get bogged down with locations and it just never ends(well, it does, when you hit 50 and cry under a pillow)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=517313","commentId":517313,"userName":"Bonus Card","timestamp":1313795373,"content":"BeeGentle said:\n\nOK, that's what I thought. Thanks.\n\nDefinitely makes this quest harder, at least with the decks I'm trying it with. This quest definitely seems to roll through very easily or you get bogged down with locations and it just never ends(well, it does, when you hit 50 and cry under a pillow).\n\n\n\n \n\nYup questing ability or stict attention to getting over one location a turn are a must here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=517870","commentId":517870,"userName":"Klaen","timestamp":1313949023,"content":"I have another question concerning the transition from 1B to 2B.\n\nWhere 1B states \"Forced\" After the players quest sucessfully, the first player...\". In the event that you end up questing successfully and put the final progress tokens needed to advance this quest to 2B, do you still resolve this Forced action in the same turn that the quest advances or is this effect now ignored as the quest card which states this is no longer in effect?\n\nMy answer was: The effect does not trigger as the rules on Quest Advancement state (page 22):\n\n\"Players immediately advance to the next stage of a quest as soon as they place a number of progress tokens equal to or greater than the number of quest points the current quest card had\".\n\nMy rationale was that as placing progress tokens is part of resolving 'questing sucessfully' then the quest advances. The condition on 1B states 'after' the players quest sucessfully, so it doesn't get a chance to trigger in this instance.\n\nAny other thoughts / opinions?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=517988","commentId":517988,"userName":"Dam the Man","timestamp":1313977665,"content":"Thought this issue sounded familiar:\n\nwww.fantasyflightgames.com/edge_foros_discusion.asp [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=523213&efpag=0#528267]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=518167","commentId":518167,"userName":"radiskull","timestamp":1314007552,"content":" Klaen, I'm in agreement with you.  It makes sense that if Signs of Gollum is attached to the active location, it won't become unguarded until after tokens are placed, and that you can claim it at that moment.\n\nThe post that Dam linked to comes to the opposite conclusion, but I believe strongly that \"questing successfully\" is something that is completed AFTER progress tokens are placed.  So you will skip this Forced effect on the turn that you advance the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=518477","commentId":518477,"userName":"Big Borg","timestamp":1314042318,"content":"I am confused.  My question is off topic of the specific issue being addressed, but my question has to do with the Hunt for Gollum quest.  I didn't want to create yet another thread for a single question.\n\n \n\nAre the Hunt for Gollum Adventure pack encounter cards the only ones used for The Hunt for Gollum quest?  I ask because the little Encounter icons adjacent to the Scenario Symbol includes the Jouney Down the Anduin and Sauron's Reach icons.\n\n \n\nThanks in advance for your help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51845-hunt-for-gollum-2b/?do=findComment&comment=518495","commentId":518495,"userName":"radiskull","timestamp":1314045971,"content":" Don't be shy about starting a new thread for questions!  Other people might have the same question as you, and would never think to look for the answer in the \"Hunt for Gollum 2b\" thread.\n\n \n\nThat having been said, you use all the cards represented by the scenario symbols, in this case, the 3 sets you mention."}]}