{"url":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/","title":"Radagast and resource match","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518328","commentId":518328,"userName":"ClydeCloggie","timestamp":1314022762,"content":"So Radagast can pay for Creatures to be brought into play, which sounds great. However, can I play the Tactics Eagles allies without a Tactics hero in play?\n\n \n\nThe exact wording of the resource match rule is:\n\n\"In order for a player to play a card from his hand (...), he must pay for it by spending resource tokens from the resource pool of a hero who has a resource icon that matches the card's sphere of influence. This is called a RESOURCE MATCH. (...) Cards with a cost of zero (...) do require at least one hero under the player's control to have a resource icon that matches the card's sphere.\"\n\n \n\nRight. Does Radagast's ability contradict the entire rule on resource matching, thus triggering the Golden Rule, or is he only contributing resources, thus not negating the need to have a Tactics hero for the resource match?\n\nI'm thinking it's option 1, given the exact wording of the resource match rule it seems you can only use Radagast's ability if you invoke the Golden Rule that card effects trump the rules if they directly contradict each other. But I would still like the forum's consensus on this one, and a ruling if there is no consensus.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518339","commentId":518339,"userName":"Shelfwear","timestamp":1314023446,"content":"Considering the fact, that you require an matching hero even for 0-cost cards I'd say you still need a corresponding hero for Radagast to pay for eagles belonging to a sphere (If you mix resources from Radagast and a hero to pay for an eagle this is obvious). The necessity to have a hero in game even for 0-cost cards makes me believe this...\n\nmy 2 cents"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518343","commentId":518343,"userName":"Titan","timestamp":1314023834,"content":"I think that makes sense. But then again, he also collects resources, which only heroes can do. He is just a walking contradiction to game rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518439","commentId":518439,"userName":"TheLightdarker","timestamp":1314034875,"content":"Here's my best guess (emphasis mine for quotations).\n\nAccording to page 6, the \"game text\" on each card is defined as \"the special abilities unique to this particular card when it is in play.\"  This appears to include everything save for traits and flavor text, which makes everything written on Radagast's card defined as an ability.\n\nOn page 12 of the rulebook, it says:\n\n\"Some cards have abilities that can be TRIGGERED from play, but still require the triggering player to pay resources.  Triggering a card ability from a card already in play requires no resource match, unless otherwise specified by the ability.\"\n\nRadagast's relevant abilities are: \"Radagast collects 1 resource each resource phase. These resources can be used to pay for Creature cards played from your hand.\"\n\n My best guess is that since Radagast is using an ability that requires the triggering player to pay resources, that this will override the necessity of a resource match when paying for Creature cards that have a greater of 1 or greater only.\n\nI believe that we are overriding the \"In order for a player to play a card from his hand (...), he must pay for it by spending resource tokens from the resource pool of a hero who has a resource icon that matches the card's sphere of influence. This is called a RESOURCE MATCH\" rule, BUT as we are not actually spending any resources from Radagast's pool to play for cost of zero cards, we cannot override the \"Cards with a cost of zero... do require at least one hero under that player's control to have a resource icon that matches the card's sphere\" rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518455","commentId":518455,"userName":"radiskull","timestamp":1314038308,"content":" I don't believe that the first half of Radagast's ability is a triggered ability; I believe it needs to have bold text in front of it for that to be the case.  I do believe that the phrase \"These resources can be used to to pay ...\" means that instead of being unable to use non-matching resources (as is normally the case), you can use these neutral resources to pay for Creature cards.  Which means that if you've got a 0-cost creature, you're not using Radagast's resources, which means you need to have a match elsewhere.\n\n \n\nWe agree that we're overriding part of the Resource Match rule, and we agree on the end result, but my reasoning's a bit different. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518471","commentId":518471,"userName":"Kiwina","timestamp":1314041200,"content":"I agree that if you only use Radagast's resources then you can play a creature from any sphere, even if you don't have a hero with that sphere.  Honestly though, it's seems like bad deck-building to rely solely on one expensive card in order to bring out 3+ cards.  I seems like you'd have a lot of games where an eagle is sitting in your hand and you're thinking, \"Now all I need is Radagast and a couple more turns,\" or something to that effect.  I see his ability acting more as an assist to your other heroes to pay for creatures in most gameplay situations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518496","commentId":518496,"userName":"radiskull","timestamp":1314046047,"content":" For now, I'd agree.  I can easily see a time a few months from now when it's possible to build a deck that's almost all Creatures, and maybe some resource acceleration on Radagast would be possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518514","commentId":518514,"userName":"TheLightdarker","timestamp":1314050680,"content":"radiskull said:\n\n I don't believe that the first half of Radagast's ability is a triggered ability; I believe it needs to have bold text in front of it for that to be the case.  I do believe that the phrase \"These resources can be used to to pay ...\" means that instead of being unable to use non-matching resources (as is normally the case), you can use these neutral resources to pay for Creature cards.  Which means that if you've got a 0-cost creature, you're not using Radagast's resources, which means you need to have a match elsewhere.\n\n \n\nWe agree that we're overriding part of the Resource Match rule, and we agree on the end result, but my reasoning's a bit different. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nHmm. Now that I do a Ctrl + F for \"trigger\" in the rulebook, Ragast's ability definitely isn't a triggered ability, but a \"constant effect.\"\n\nI suppose I will conclude that:\n\n1) Radagast's ability overrides the necessity of having a hero with a resource match to whatever Creature card you want to pay for, due to the golden rule\n\n2) Radagast will not override the resource match necessary for playing Creature cards with a cost of 0, as his ability would not be used"},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=518710","commentId":518710,"userName":"radiskull","timestamp":1314091378,"content":" Lightdarker - nicely put.  I agree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=526683","commentId":526683,"userName":"yagyu","timestamp":1315725202,"content":"So heres the thing my friends and i are confused on with Radagast. We get that he can pay to play the eagles, we get he can heal wiliador and the other unique eagle. The source of our arguements has been this.\n\nCan you pay the eagles maintenence cost when he defends in and must spend a tactic resource token, from Radagast pool?\n\nOr does this still have to be paid from your tactics pool?\n\nI notice with allot of these cards and rules they really did a poor job of properly phrasing the mechanics making the understanding of these abilities and rules very difficult to figure out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=526725","commentId":526725,"userName":"Svenn","timestamp":1315734167,"content":"yagyu said:\n\nSo heres the thing my friends and i are confused on with Radagast. We get that he can pay to play the eagles, we get he can heal wiliador and the other unique eagle. The source of our arguements has been this.\n\nCan you pay the eagles maintenence cost when he defends in and must spend a tactic resource token, from Radagast pool?\n\nOr does this still have to be paid from your tactics pool?\n\nI notice with allot of these cards and rules they really did a poor job of properly phrasing the mechanics making the understanding of these abilities and rules very difficult to figure out.\n\n\n\nNo, you cannot pay for maintenance with Radagast's resources.\n\n\"Radagast collects 1 resource each resource phase. These resources can be used to pay for Creature cards played from your hand.\"\n\nThe only thing Radagast's resources can be used for is to play a new creature card from your hand. You cannot spend his resources on anything else, even if it involves a creature in some way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=526744","commentId":526744,"userName":"Titan","timestamp":1315737595,"content":"Also, notice that it must be a Tactics resource that is spent to keep the eagle around. As Radagast is a neutral card, his resources cannot be considered to belong to Tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=526922","commentId":526922,"userName":"sWhiteboy","timestamp":1315788727,"content":"My best guess is that Radagast can pay for any creature, regardless of sphere.  I'm basing this on \"The Golden Rule\" from the rulebook, which states: \"If the game text of a card contradicts the text of this rulebook, the text on the card takes precedence.\"\n\nRadagast says that his tokens can pay for creatures, and it lists no exceptions.\n\nI realize this isn't the best reason, but...eh."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=526927","commentId":526927,"userName":"Spirit Juggler","timestamp":1315790759,"content":"If Radagast says you can use his resources to pay for cards from hand then you can't use him to refresh your eagles once you've defended with them. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=527117","commentId":527117,"userName":"sWhiteboy","timestamp":1315830766,"content":"That was already covered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=605503","commentId":605503,"userName":"kirkbauer","timestamp":1331713829,"content":" Official answer from Nate:\n\nRadagast's ability does break the need for a resource match if the resources are coming only from his pool. He does not count as a resource match to the extent that you can combine his resources with those of ,say a LORE, hero to play a TACTICS creature."},{"commentUrl":"https://community.fantasyflightgames.com/topic/51981-radagast-and-resource-match/?do=findComment&comment=605615","commentId":605615,"userName":"booored","timestamp":1331731589,"content":"Yeah this is the \"golden rule\" about card text over riding the manual. Just remember that it is only paying for the COST of the card.. you still need a tactics resource to Pay for Vessel and the 4Defend eagle to not be discarded after attack/block\n\n \n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"}]}