{"url":"https://community.fantasyflightgames.com/topic/52032-heroes-question/","title":"Heroes Question?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=518912","commentId":518912,"userName":"Soulbearer73","timestamp":1314116020,"content":"I am looking at how the expansions are currently being made, that being each expansion has one new hero for one of the spheres of influence.  But how many heroes can they keep going with this model?  Do you think that after these 6 get released that a newer model of expansions will be released that will not have as many heroes introduced due to lack of content in the books?  What hereoes do your foresee that they could have on their shelf waiting to introduce?  Or do you think that current allies may have hero versions of themselves introduced later making restrictions on using the alley versions of their cards?  Just curious to hear from the LotR book fans."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=518919","commentId":518919,"userName":"richsabre","timestamp":1314116434,"content":"well tolkein's worlds is extremely vast, theres a hell of alot of people to choose from, i think dwarves will play a big part in expansions- thinking along the lines of dwarves out of the hobbit- gloin, oin, bombur, bilfor, thorin, fili, kili, balin, thalin (i really cant remember more!), then you've got the elven heroes - gil galad, elrond must come out as a hero at some point,\n\n \n\nid really like to see saruman become a playable hero from before he became corrupted\n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519004","commentId":519004,"userName":"reno1051","timestamp":1314129231,"content":"you also are assuming that the 3 hero limit is going to stay for future expansions.  there is a possibility that once this cycle is done, you may be able to have 4 heroes because FFG has hinted that the 50 threat cap may at some time be increased.  also, as more cards become available, different style decks will be more prevalent.  if you ever played MTG, think of al the different TYPES of decks you can have.  Our card selection is limited in its current state but there is plenty of room for it to grow.  who knows what will happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519110","commentId":519110,"userName":"Iver2","timestamp":1314150055,"content":"I agree that the hero size, thread limit are likely to change with future expansion cycles or major expansions.\n\nAs to Saruman, I think could make it as an ally into the game, but he should have an very powerful ability  which will also cause let say your thread to rise every time you use him.\n\nI hope that we will see some news of the next expansion cycle in the following weeks! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519138","commentId":519138,"userName":"jhaelen","timestamp":1314156158,"content":"I expect to see no change in the next cycle, i.e. it will also feature one hero in every AP. After that we'll have six heroes for every sphere. That seems like a good point to make changes to the distribution. It might also be at that point that the first Deluxe expansion is released which may or may not introduce rule changes or rule variants."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519144","commentId":519144,"userName":"Glaurung","timestamp":1314157883,"content":"Iver said:\n\nI agree that the hero size, thread limit are likely to change with future expansion cycles or major expansions.\n\nAs to Saruman, I think could make it as an ally into the game, but he should have an very powerful ability  which will also cause let say your thread to rise every time you use him.\n\nI hope that we will see some news of the next expansion cycle in the following weeks! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\nOr Saruman can turn against you as a enemy on certain threat level???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519163","commentId":519163,"userName":"richsabre","timestamp":1314161292,"content":"these two are excellent ideas, would love to see it happen, and if i remember rightly saruman started to really turn to the dark after he delayed  the attack from the white council on dol guldor.  so i suppose the timing is correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519288","commentId":519288,"userName":"Eryx_UK","timestamp":1314179689,"content":"I don't think they'll allow more than three heroes per player (wish it was four standard though). I think the reference to scenarios with a higher than fifty kill point will before Moria and the Balrog, or perhaps ones that include dragons; Smaug, or any of the many other named ones that are around at this time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519916","commentId":519916,"userName":"BeeGentle","timestamp":1314287729,"content":"Maybe there will be one where you start with a super high threat and need to get it below 50 to win through a use of quest cards or w/e."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519954","commentId":519954,"userName":"Shelfwear","timestamp":1314292336,"content":"There also could be future Heros who have the ability to increase your threat limit before losing the game to 60 or higher for example"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52032-heroes-question/?do=findComment&comment=519988","commentId":519988,"userName":"richsabre","timestamp":1314295810,"content":"i think with balrogs, dragons and even sauron down the line they may have to have those abilities"}]}