{"url":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/","title":"Journey Down the Anduin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=519526","commentId":519526,"userName":"chainsaw_ash","timestamp":1314207534,"content":"I can't believe this question hasn't been asked already but when i did a search of \"Journey Down the Anduin\" it came back with  no hits in the forums. So either the search facility sucks or I'm doing something wrong, so apologies if I am.\n\nAnyway my question, we played  Journey Down the Anduin the other night with 4 of us and at the end of the  quest it states to skip the staging phase of the quest phase.\n\n \n\nDoes that mean we didn't have to comit characters to quest and could use them for combat. I ask as after we had each drawn 2 event cards which all seemed to be locations we had like a 8 locations out, with a threat of about 25+ when the critters were included and so we would have lost just on the threat in one step. Which seemed kind of unfair and left us feeling cheated.\n\nWe argued amongst ourselves and decided it seemed senseless to comit to quests, since we were at the end of the quest and went against the flavour of the game. Why would the characters when faced with the end scenario, take a detour to go somewhere else? It didn't make sense, so we decided to skip the quest step completley. This meant we discarded the locations from the staging area and battled the critters there.\n\nWe eventually won but I have this horrible feeling we did it wrong and should have lost!\n\non a similiar note, that has just occured to me, if when playing a multiplayer game, does every player's threat increase by the total difference in willpower and threat or is this total difference, shared out between the characters. eg if the threat is 6 higher than our willpowers, does each players threat dial go up by six or can one player take 3, another 2, another 2 and one player take none?\n\nIf its shared out then the last stage scenario, I've described above, may not have been such a disaster, as we could have at least distributed the threat between the players.\n\nthanks\n\nkevin\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=519533","commentId":519533,"userName":"TheLightdarker","timestamp":1314208212,"content":" The search function definitely leaves something to be desired lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\nThe rulebook on page 14 breaks down the questing phase:\n\nStep 1: Commit characters\n\nStep 2: Staging\n\nStep 3: Quest Resolution\n\nJourney Down the Anduin quest card 3B specifies that you skip the Staging step of the phase, which leaves the two steps where you can commit characters and then have to resolve the quest (compare your total committed willpower to the total threat in the staging area).\n\nI agree that it feels a little odd that you have to continue questing (especially considering that 3B requires 0 progress tokens to complete it), but instead of discarding all the remaining locations from the staging area like you said you did, you should have instead dealt with them normally, until you finally won (or lost), the scenario.  After all, there's still the chance that you could be overcome by the massive encounter card dump's combined threat when starting 3B and end up capping your threat at 50, and having to deal with all the locations you might amass prevents people from trying to rush through the scenario just ignoring them and hoping to hit 3B as soon as possible.\n\nYou still have to commit to the quest, but its really only important to \"break even,\" as opposed to gaining progress tokens (since they don't serve to move you any closer to winning the game).\n\nFor your second question, quest resolution works like this:\n\n[Total threat in the staging area] - [Total willpower of every character from every player committed to the quest] = the number of points that EVERY player must raise their threat tracker by (i.e., 20 - 15 = every player raises their threat by 5, regardless of how many players there are).\n\nHope that helped!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=519552","commentId":519552,"userName":"geristor","timestamp":1314210211,"content":"you would still need to quest a little just to equal the threat in the staging area. step 2 of the quest phase is skipped in the last part but steps 1,3 and 4 are not.\n\nas it says in the rule book pg 14 step 3 quest reslution paragraph 3, if the threat is higher than the committed willpower raise the threat dail of every player by the diffrence.\n\n \n\nBefore you got to another quest phase though you should not have had 25+ threat in the staging area, for 1 you would have had a travel phase (as you had just quested and finished part 2, laid out the extra cards then onto phase 4 of quest-travel), then you would have had engagement and taken those enemys out of the staging area that you could engage reducing the threat in the staging area.\n\nor conversly legolas could have slaguhtered an enemy with his blade of gondalin, its desperate last cry  summoning forth a horde that raced from the surrounding environs to attack the heroes.( ie kill enemy in combat phase and triggered next part of quest with his ability).\n\nthematically should the locations count to the threat as well in that last phase i think yes. what dark crooks and crannies have these enemies sallied from, had we best not explore them to make sure the enemy is not marshelling more foes to stop us. go quick anlong that ridge and kill that escaping orc least he summon more etc, it is the threat they represent you are exploring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=519745","commentId":519745,"userName":"GhostWolf69","timestamp":1314259330,"content":"I agree that it feels a little weird thematically, but the others are right. The Quest card tells you in effect that no NEW Encounter cards should be drawn, but you still have to deal with the ones that already are in the Staging area. This means countering their Threat, (through Questing), Travelling to Locations and Combating Monsters. But since you don't add any new cards it becomes simple math how much you really need. (i.e. you don't have to \"over-stack\" your Willpower to counter potential new cards.)\n\n/wolf\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=520527","commentId":520527,"userName":"chainsaw_ash","timestamp":1314389001,"content":"Hi\n\n thanks everyone for the replies, I thought we had played it wrong and now I know.\n\nI was playing with 2 core sets of encounter cards combined (is there any rule, that states a max number of the same card in the encounter deck btw I know only 3 of the same card are allowed in the players deck ?) and we did pull a threat of 25 plus in locations (bad luck I guess, we got several of those 5 threat locations in the 8 cards we had to draw at the final step.)\n\nIf we comitted to the threat (and we needed to comit all the characters) to match the threat, we would not have had any characters left to defend, never mind attack.\n\nBy the sound of it, I think bad luck screwed us basically, however as it was the first time I had showed the game to my gaming group, I'm not sure they will be impressed by this  ruling unfortunately.\n\n \n\ncheers\n\nguys\n\n \n\nkev"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=520536","commentId":520536,"userName":"radiskull","timestamp":1314391705,"content":" Well, you definitely don't want to be combining sets of encounter cards.  When you do a quest, you need to use exactly the cards specified by the quest, no more, no less.  Certain quests rely on there being only one of a particular card in the encounter deck (like Grimbeorn or the objectives in Dol Guldur).  You don't want to engage in any sort of deckbuilding with the encounter deck unless you're trying to invent your own quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=520596","commentId":520596,"userName":"Spirit Juggler","timestamp":1314414397,"content":"I agree with Radiskull. Particularly if you're new to the game or your gaming group is new to the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52099-journey-down-the-anduin/?do=findComment&comment=523429","commentId":523429,"userName":"gamestar10","timestamp":1314978491,"content":"radiskull said:\n\n Well, you definitely don't want to be combining sets of encounter cards.  When you do a quest, you need to use exactly the cards specified by the quest, no more, no less.  Certain quests rely on there being only one of a particular card in the encounter deck (like Grimbeorn or the objectives in Dol Guldur).  You don't want to engage in any sort of deckbuilding with the encounter deck unless you're trying to invent your own quests.\n\n\n\n \n\nWell said. Because if we had dealt with 2 hill trolls already and then found 2 MORE when we setup 3b, I would have raked up the cards and called it a night :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"}]}