{"url":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/","title":"Questing all heros, but who do enemies attack?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/?do=findComment&comment=519946","commentId":519946,"userName":"player648695","timestamp":1314291277,"content":"I have been playing for a while now, but every now and then we come upon a situation where one player puts all heros into questing, thus exhausting them. What happens during the encounter phase? Is there no one for the enem(y)ies to encounter? or  Do they attack the exhausted characters from questing? And if they do attack, are the points just taken off the hp of the hero in the combat round? Can't find in the rule book or fact sheet how to deal with this. Those I play with have different views on how to do this. Please help with the answer. Thank you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/?do=findComment&comment=519949","commentId":519949,"userName":"DurinIII","timestamp":1314291739,"content":" The way I understand it is if all of your characters are exhausted for the quest, then you have no blockers...if you have no blockers than the enemies that are engaged with you do still attack, you are just forced to take the damage \"unblocked\" and that translates into putting the wound tokens directly on any available Hero. The point is it is dangerous to quest with everyone when you are engaged with enemies because then you are unable to defend attacks and must take the damage directly to you heroes.  Hope this helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/?do=findComment&comment=519952","commentId":519952,"userName":"richsabre","timestamp":1314292289,"content":"+1 for above, thats why you should always keep an allay around to defend"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/?do=findComment&comment=520008","commentId":520008,"userName":"faith_star83","timestamp":1314299840,"content":"Also I think it is quite important to remember that often Shadow effects are far more devastating when being dealt by undefended enemies. It happened to me more than once that I lost a hero due to an undefended attacker that received a +2 bonus instead of a +1 bonus from a shadow card.\n\nRemember that all the damage from one enemy has to be dealt to the same one hero you choose to receive the damage..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/?do=findComment&comment=520026","commentId":520026,"userName":"evilidler","timestamp":1314302573,"content":" Yep, get your plate armour and Frodo out, because sending everybody questing is sure to be lethal ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThis is where sentinels and ranged characters with multiple players come in most handy. When you lose the quest phase EVERYBODY gains threat, so there are times it will be nice to have another player cover your defence for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/?do=findComment&comment=520295","commentId":520295,"userName":"player648695","timestamp":1314353509,"content":"Thanks for the replies. That is pretty much what we figured, but wanted to be sure. This game really kicks and kicks hard... but that is the way we like it!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52147-questing-all-heros-but-who-do-enemies-attack/?do=findComment&comment=523442","commentId":523442,"userName":"gamestar10","timestamp":1314981435,"content":"As it was noted above, if there are no blockers for engaged enemies, you cannot place undefended damage on allies. All damage must be placed on a hero.  Always good to have blockers.  The game is difficult from quest to quest and I agree...that's what makes it enjoyable!"}]}