{"url":"https://community.fantasyflightgames.com/topic/52269-gaurded-objectives-how-do-they-work/","title":"gaurded objectives - how do they work?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52269-gaurded-objectives-how-do-they-work/?do=findComment&comment=520885","commentId":520885,"userName":"player1994700","timestamp":1314490061,"content":"New to the game. First time poster.\n\nI was playing through a solo version of The Hunt for Gollum earlier today and I came across a snag. Let's say you reveal the Signs of Gollum objective., before you resolve the questing phase (you get to pick two and discard one). So, therefore, the next card (during the actual Questing phase) would be placed upon the objective because of it's guarded keyword. To my understanding, if it's a treachary card you simply resolve it's effects and then it discards. However, if it's an enemy or location you attach it to the objective.\n\nWell obviously you want to have those cards attached to your heroes in order to make progress during quest 3b. So I engage the enemy with the clue card attached to it. Declare defender against it's attack, no problem. Then when it's my turn to attack I swing big time and destroy the enemy. Since he is now dead do I get a chance to snag that objective card from him right then and there? Or does it immediately go back to the staging area (where most likely another encounter card (enemy / location) will be attached to it next turn.\n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52269-gaurded-objectives-how-do-they-work/?do=findComment&comment=520890","commentId":520890,"userName":"conykchameleon","timestamp":1314493107,"content":"Hey there, and welcome to the forums and the game! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWith regard to your question, guarded objectives are only attached with an encounter card when they are revealed from the encounter deck. So if it's attached to an enemy, as in your example:\n\nYou kill the enemy.\n\nThe objective is returned to the staging area.\n\nThe objective stays in the staging area, unguarded.\n\nWhenever the players successfully quest, they may claim the objective (as per the text of Signs of Gollum).\n\n \n\nHope that helps!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52269-gaurded-objectives-how-do-they-work/?do=findComment&comment=520891","commentId":520891,"userName":"Kiwina","timestamp":1314493623,"content":"Guarded actually works more like surge.  When you put a guarded card into play you immediately reveal another card from the encounter deck to function as the guard of the objective.  In this instance, Signs of Gollum is revealed, and the next card is also revealed and it guards the clue.  If it's a treachery, the effects happen and then the clue is left unguarded and can be picked up as soon as the right conditions are met.  With Signs of Gollum that means you must successfully quest in order to obtain the clue card.  If the card guarding an objective is an enemy or location, once they are defeated or explored the objective returns to the staging area, but it will remain unguarded.  An objective is only given one card to guard it, and that is when it's first revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52269-gaurded-objectives-how-do-they-work/?do=findComment&comment=521133","commentId":521133,"userName":"player582283","timestamp":1314543897,"content":"Kiwia and Conyk already answered your specific question, but to expand on it, make sure you read theobjective card.  The objectives in Dol Guldur are claimed a little differently than the clues in HfG.  Once they (Dol Guldur objectives) are unguarded you can claim them by simply raising your threat (don't have to successfully quest like HfG).  You also have an ongoing effect.  I think it's safe to say we'll see variations in new scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52269-gaurded-objectives-how-do-they-work/?do=findComment&comment=521135","commentId":521135,"userName":"player582283","timestamp":1314543911,"content":"Double post deleted"}]}