{"url":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/","title":"Is Bilbo&#039;s threat too high?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=520960","commentId":520960,"userName":"Style75","timestamp":1314516435,"content":"So far, Bilbo is the only hero who's starting threat is more than the sum of his attributes and his HP. This makes him a tricky addition to scenarios that need to have a low starting threat (ex. Anduin).  The question then is Bilbo's ability to draw two cards worth all that extra threat? Do you find him worth it or do you steer clear of him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=520965","commentId":520965,"userName":"Eryx_UK","timestamp":1314517433,"content":"I agree. He's too high. I tried him for the first time yesterday and in each game it was the extra threat that scuppered me.\n\nFor some reason card game designers feel that card drawing is a huge advantage, when with games that have limited resources you can't play everything you have anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=520971","commentId":520971,"userName":"richsabre","timestamp":1314518475,"content":"i agree, same with beravor- i hardly ever use her special ability"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=520995","commentId":520995,"userName":"gatharion","timestamp":1314523343,"content":"richsabre said:\n\ni agree, same with beravor- i hardly ever use her special ability\n\n\n\n \n\nI hardly ever use her special ability either, which is why I prefer Bilbo. That extra card draw *is* nice and that it isn't an action makes him more useful than Beravor, IMO. However, he's certainly not my favorite Hero to play. He doesn't add much in terms of Questing/Combat and his Threat is on the high side for those stats. I really really REALLY wish he just had one extra Willpower, than I think he'd be nigh perfect. (At least for the scholarly elder Bilbo; I wouldn't mind to see a \"burgler\" version who helps you acquire Item attachments.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521009","commentId":521009,"userName":"Titan","timestamp":1314526988,"content":"I find it ironic that Bilbo gets released with a quest that he is so poorly suited for. Having said that, card draw along with resource acceleration are two of the biggest keys to win in any card game. Don't underestimate the advantage of an extra card draw every turn. It does make a difference. I think Bilbo would do well paired with leadership heroes who can help in the resource gathering department. Maybe Protector of Lorien would be useful to increase his defense or willpower and grant him some usefulness beside his ability. Or maybe once the tactics' song becomes available you can give him the Citadel Armor and make him a pretty good stopper. Just throwing some ideas out. As for Beravor, I've used her ability many times, but it can be tricky to find a good spot to do so. Using Unexpected Courage with her is one of my favorite combos."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521034","commentId":521034,"userName":"lleimmoen","timestamp":1314530307,"content":"Beravor is very strong with Unexpected Courage. Anyone interested in this game should perhaps try this combo out some deal. And it is my reason for thinking Bilbo's threat cost is too high.\n\nI think he is quite suited for the Hunt because there is not the Orc encounter set, which means characters do not get hurt as they quest - thus his low hp is not that big of a deal it is for all three core set quests.\n\nEither way, as I said many times before, I am hoping for Bilbo's attachment that would balance his cost out, something like Mithril Coat and Sting, both of which could be perhaps passed to Frodo for a price."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521036","commentId":521036,"userName":"lleimmoen","timestamp":1314530604,"content":"As for Bilbo's obvious combos, it is surely A Burning Brand and Protector of Lórien (and Dúnedain Warning from the Leadership sphere), with those he becomes a very good defender who can still use his ability, and as for the Protector, Bilbo's ability is making its playability possible, and Bilbo can quest for some late game finish. Beravor has to exhaust for her ability but once you get Courage on her she becomes very powerful and can use both attachments as well as Bilbo Baggins. So Bilbo really needs something more to credit for his part in the Middle-earth history."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521270","commentId":521270,"userName":"gone questing","timestamp":1314566091,"content":"Yes.\n\nI'm exclusively playing 3-player right now. My team mates joked they are relying on their Bilbo draws ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\nDrawing wins games... free resources win games, but I think the starting heroes are the better free resource.\n\n\nBilbo may only be able to defend once, and I don't like to risk him much at all. He's at the mercy of Treachery cards that wound... his hit points are a real issue for me.\nBilbo is also part of the sphere that had the highest threat costs, so his 9 threat cost doesn't fit easily.\n\nI will rework a deck and try him again though. I will make healing a higher prioriy as i'm mostly using Wealth of Lorien, songs, and other Lore cards to shore up low willpower in my starting line-up. (On a side note, Radagast's Cunning has been so good in The Hunt For Gollum, that my team mates don't mind that I don't battle well.)\nI would also consider splashing him into a (sphere), (sphere), Lore deck where I mostly only have healing Lore cards and the rest the other sphere. I shouldn't need healing cards too early until Bilbo has built up some resources, which he will do slowly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521284","commentId":521284,"userName":"player582283","timestamp":1314568660,"content":"I don't think his threat is too high.  As mentioned, his disadvantages can be readily offset with cards in his own sphere such as Protector of Lorien and Burning Brand.  I think the passive ability to draw extra cards is very powerful.  Even if you don't, and you likely won't, have the resources to play all of them, you have a better chance of getting to the card that you NEED for the issue at hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521335","commentId":521335,"userName":"jhaelen","timestamp":1314588459,"content":"I think Bilbo's threat rating is fine.\n\nTitan said:\n\nAs for Beravor, I've used her ability many times, but it can be tricky to find a good spot to do so. Using Unexpected Courage with her is one of my favorite combos.\n\n\n\nI've used Beravor's ability at every opportunity unless I was extremely hard-pressed and simply had to use her to defend to avoid losing an important hero. Imho, she's the key to play a successful Mono Lore deck. Combine Lore with Spirit to quickly go through your whole deck repeatedly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521340","commentId":521340,"userName":"Mighty Jim 83","timestamp":1314589550,"content":"Yes. the Threat is too high. Having 13 heroes whose threat is exactly Willpower+Attack+Defence+Hit Points and 1 who is noticeably higher doesn't make sense. His ability is useful, but not that useful. Until we have attachments/events that synergise well with Hobbits, he's just not worth the cost.\n\n(Also, my wife refuses to play Bilbo, because she thinks he looks too much like a 1970s pimp with that hair)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521403","commentId":521403,"userName":"evilidler","timestamp":1314602108,"content":"Mighty Jim said:\n\n(Also, my wife refuses to play Bilbo, because she thinks he looks too much like a 1970s pimp with that hair)\n\n\n\nThat's what I thought, too!\n\nHave you lot noticed something obvious missing in terms of attachments? There are certain items I guess would be useful with either of the hobbits released so far. There will probably be some good attachments for them in the 6th pack of the current cycle :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=521939","commentId":521939,"userName":"Iver2","timestamp":1314696146,"content":"yes, its defenitely too high! He is still great!\n\nAs to Breavor: Great hero, we normally play her this way with my wife, that we wait until the end of the round, do not commit her and if possible use her ability. If necessary, she can always still be a great atacker or defender, but we normally try to use the ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522001","commentId":522001,"userName":"Bonus Card","timestamp":1314706731,"content":"I think that a \"hobbit\" dagger/short sword would be cool. +1 for a regular hero but +3 when weilded by a hobbit.restricted for regular heros but a hobbit cannot bear more than one. Something like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522006","commentId":522006,"userName":"Bonus Card","timestamp":1314707198,"content":"Or how about a card that when drawn as a surplus draw during the resource phase can be played directly after as a response. Maybe a really high cost card with a great ability. Therefore, it would inspire people to use Bilbo. And it would inspire people to exhaust Beravor way early in the round. This might change the game in a really nice way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522050","commentId":522050,"userName":"Spirit Juggler","timestamp":1314712480,"content":"I don't think his threat is too high and I use him over Beravor. I do think his hitpoints are dangerously low, though that's probably because I tend to use him to defend with in a lore deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522533","commentId":522533,"userName":"Kiwina","timestamp":1314794641,"content":"Bonus Card said:\n\nI think that a \"hobbit\" dagger/short sword would be cool. +1 for a regular hero but +3 when weilded by a hobbit.restricted for regular heros but a hobbit cannot bear more than one. Something like that.\n\n\n\nOr you could make it a unique card, like Sting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522538","commentId":522538,"userName":"Style75","timestamp":1314795451,"content":"I am 100% sure that Sting will enter the game as an artifact, probably once the timeline gets around to the hobbits arriving in Rivendell. I would also expect Frodo's mithril armor to make it in as well. These were iconic items from the books so I'm pretty sure FFG has a plan on how/when to use them. I hope hobbits get a nice bonus from them because I love it when game mechanics give a nod to the lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522695","commentId":522695,"userName":"BeeGentle","timestamp":1314819859,"content":"It is too high, but even if it were 7, I would still take Beravor. Yes, Bilbo's passive doesn't require him to exhaust to gain an extra card each round, but he has 2 HP and very mediocre stats. Beravor, on the other hand, has 2 in each stat and 4 HP combined with an amazing optional ability, making her the most versatile hero in the game.\n\nIt's possible that an attachment card will come out that only Hobbits can wear that'll give them more HP or some stat buff to make using them more viable but right now...nah.\n\nI could see Samwise as a hero as well, but what group would he fit in? He's not a leader...I guess he's mildly scrappy so he could be a very weak Tactics hero, but that kind of defeats the purpose. He seems more like a Spirit type than anything else.\n\nSamwise:\n\nWP 3\n\nAttack 1, Defense 2\n\nAction: Remove X counters on Sam and exhaust him. Ready that many Hobbit cards.\n\nThreat: 8\n\nFair?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522791","commentId":522791,"userName":"Mighty Jim 83","timestamp":1314849028,"content":"BeeGentle said:\n\nIt is too high, but even if it were 7, I would still take Beravor. Yes, Bilbo's passive doesn't require him to exhaust to gain an extra card each round, but he has 2 HP and very mediocre stats. Beravor, on the other hand, has 2 in each stat and 4 HP combined with an amazing optional ability, making her the most versatile hero in the game.\n\nIt's possible that an attachment card will come out that only Hobbits can wear that'll give them more HP or some stat buff to make using them more viable but right now...nah.\n\nI could see Samwise as a hero as well, but what group would he fit in? He's not a leader...I guess he's mildly scrappy so he could be a very weak Tactics hero, but that kind of defeats the purpose. He seems more like a Spirit type than anything else.\n\nSamwise:\n\nWP 3\n\nAttack 1, Defense 2\n\nAction: Remove X counters on Sam and exhaust him. Ready that many Hobbit cards.\n\nThreat: 8\n\nFair?\n\n \n\n\n\nHow many hit points?\n\nby 'remove x counters' do you mean pay X resources from his pool? or something else?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52280-is-bilbos-threat-too-high/?do=findComment&comment=522806","commentId":522806,"userName":"GhostWolf69","timestamp":1314853400,"content":"I just wanted to give my two cents, maybe not about Bilbo specifically but about \"Card Draw\" in general.\n\nDrawing Cards IS important!\n\nI do not agree with the people who claim it doesn't matter how manny cards you have on hand since you don't have the resources anyway. That is just plain wrong IMO. It matters A LOT because it gives you the ability to chose WHICH Cards to spend those resources on and when to do so. And THAT wins you the game.\n\nThe games we play I try to stick to as few cards in my deck as possible. even doing so I seldom go through more than 50% of my deck each game we play.\n\nThis means that any give card (even if I have three copies) are highly likely NOT to show up at all or only show up once.\n\nBeing able to draw more cards is crucial to secure, or at the very least greatly improve the chance of having the cards I need, when I need them.\n\nNow... is Bilbo over-prized? I can't say for sure, but let's put it like this: We have used both him and Beravor several times and we have NEVER felt cheated. It has always been highly appreciated.\n\n \n\n/wolf"}]}