{"url":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/","title":"Has anyone completed &quot;Escape from Dol Guldur&quot; solo?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521691","commentId":521691,"userName":"Metropolis Games","timestamp":1314639484,"content":"After many tries, I managed to get to the second quest card using a Spirit/Tactics deck with a smattering of Lore, before my remaining hero died. Has anyone managed to do better? Or is EfDG impossible solo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521694","commentId":521694,"userName":"Eryx_UK","timestamp":1314639808,"content":"I've been trying it all evening and I can't finish it solo. Did manage to get to the second stage once by sheer luck. It's a scenario that's too difficult for solo play. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521697","commentId":521697,"userName":"Titan","timestamp":1314639998,"content":"I managed to get to the last quest card once and was nearly in range, but an untimely draw of Ungoliant's Spawn as a shadow card sent my threat over the top. This was also before the Nazgul was changed to not have attachments, so I probably would have lost even faster. it is nearly impossible solo, at least with the current card pool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521782","commentId":521782,"userName":"Bohemond2","timestamp":1314652314,"content":"I could beat the scenario with some regularity with the original nightmare rules, since that allowed you to start with zero threat.  Other than that, I have only won once and that was with a ridiculously luck series of draws for both the player and encounter decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521784","commentId":521784,"userName":"Bray","timestamp":1314652620,"content":"I failed (yet again) three times tonight solo against this quest. I was playing Tactics / Leadership, and Caught in a Web was my undoing time and again. Drawn early it means that you're playing with 1 hero, although at least the webbed hero can generate resources and soak up damage unlike the prisoner.\n\nI'll probably have to build a deck specifically to fight this quest before I attempt it again. My more generic decks are slaughtered every time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521787","commentId":521787,"userName":"player582283","timestamp":1314653221,"content":"My best (but still futile) attempt has been with 3 Lore heroes, Glofindel, Beravor and Bilbo, splashed with 3 Songs of Kings to try to get Steward of Gondor, Sneak Attack  and Faramir in play.  The hope was to get a Protector of Lorien in (Bilbo if he's not the prisoner), have the Miner to deal with the Caught in the Web as a second hero going out of play is just completely debilitating.  Card drawing and healing with Lore.  Glorfindel and Beravor are robust and versatile enough to take on different roles.  Threat reduction has to come from Gandalf.  At least this is the theory...\n\nNo luck so far, but I only usually play a couple EfDG in a row and then I have to go kick the dogs and such."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521790","commentId":521790,"userName":"player582283","timestamp":1314653415,"content":"Bray - you're right, I gave up with my 'primary' Leadership/Spirit deck that I try against each scenario (and succeed a good % of time for the other four!) and am now trying to build a deck to deal with it.  Might have to pick up a second core to stand a chance...(and cheat)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=521804","commentId":521804,"userName":"Glaurung","timestamp":1314659529,"content":"On another forums i sow some session reports beating Dol-goldur solo. With New cards like BB from Carrock you have more chance to do it but still very hard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=522886","commentId":522886,"userName":"gatharion","timestamp":1314870538,"content":" I've yet to beat it with two players! I haven't even tried solo. Unfortunately, it's not a quest that scales up well and it becomes very easy with more than two players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523347","commentId":523347,"userName":"sWhiteboy","timestamp":1314962872,"content":"I've seen some people say they beat it, but with 40 card decks.  Since 40 card decks are illegal...I don't consider that an actual win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523384","commentId":523384,"userName":"Eyedunno53","timestamp":1314969204,"content":"I beat it probably 50% of the time solo.  I have two core decks and all the expansions up to Carrock.  I use Aaragorn, Eowyn, and either Frodo or Dunhere (though Frodo has served me better tbh).  Oh, and unlike some people I've seen, I use a 50 card deck... well actually it was 53 xD.  Couldn't decide what to take out.\n\nIf anybody is interested I can post the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523417","commentId":523417,"userName":"Rashley","timestamp":1314975033,"content":"This is the one scenario (so far?) that gains the most with more players.  The much lower % chance of losing your best Hero at the start and later to 'Caught in a Web', far outweighs the extra encounters.  You can almost determine your chance of success after seeing who is captured.  My success rate for 2 players has risen considerably once I realised that 'playing' an Ally is different from 'bringing an Ally into play'.  It hasn't helped solo so much, as resources are the problem, but I live in hope.  I still enjoy a valiant failure more than an easy win.  It is nice to see people still appreciating a good, hard challenge.  So much has been written lately about how easy the game has become.  It's your own fault if you have made it too easy.  It isn't difficult to make it hard again.  Just use less Gandalfs, Sneak Attacks, Stand+Fight etc., and add more Hummerhorns, Caught in a Web, Necromancers Reach etc..  The game is just a tool.  Use it how you like.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523439","commentId":523439,"userName":"Saej","timestamp":1314980606,"content":"Eyedunno52 said:\n\nI beat it probably 50% of the time solo.  I have two core decks and all the expansions up to Carrock.  I use Aaragorn, Eowyn, and either Frodo or Dunhere (though Frodo has served me better tbh).  Oh, and unlike some people I've seen, I use a 50 card deck... well actually it was 53 xD.  Couldn't decide what to take out.\n\nIf anybody is interested I can post the deck.\n\n\n\n \n\n50%?  Really?  You must be the best player in the world!\n\nPost the deck list for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523476","commentId":523476,"userName":"marlow4","timestamp":1314993905,"content":"I've only managed a Dol Guldur win with 4 players.\n\nSolo it just surgically removes my posterior and hands it to me. I daydream sometimes that once the spheres get fleshed out some more and have a good pool of cards to utilize that Dol Guldur will kneel before me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523652","commentId":523652,"userName":"Style75","timestamp":1315050433,"content":"Saej said:\n\nEyedunno52 said:\n\n \n\nI beat it probably 50% of the time solo.  I have two core decks and all the expansions up to Carrock.  I use Aaragorn, Eowyn, and either Frodo or Dunhere (though Frodo has served me better tbh).  Oh, and unlike some people I've seen, I use a 50 card deck... well actually it was 53 xD.  Couldn't decide what to take out.\n\nIf anybody is interested I can post the deck.\n\n \n\n \n\n \n\n50%?  Really?  You must be the best player in the world!\n\nPost the deck list for sure.\n\n\n\n \n\n50% success when soloing dol guldur is pretty incredible. Are you playing with the errata on the Nazgul (no attachments can be played)?  Are you using shadow cards?\n\nI've tried this one solo eleven times and still havn't beaten it. I came very close once only because of really lucky draws from both my player deck and the encounter deck. I would love to hear how you can beat it 50% of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523704","commentId":523704,"userName":"player582283","timestamp":1315062727,"content":"Beat it with three.  In fact, we' ve never lost any scenario with more than 2 - my only complaint on the game.  I realize we've never finished it with two.  Started it a few times and had to shelve it as the rest of the gaming group arrived and we did not want to hold up the rest of the crew.  Have to make a point of getting a couple duo games of EfDG in.\n\nI'm afraid I'm a little skeptical that anyone has a 50% win rate soloing Dol Guldur."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523768","commentId":523768,"userName":"gatharion","timestamp":1315080771,"content":" The next time I try Escape from Dol Guldur it will probably be with three players, but I definitely need to try it again with two. I'm honestly not even that interested in trying it solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523798","commentId":523798,"userName":"player582283","timestamp":1315089835,"content":"Gatharion I think I'll try it again with the new cards from JtR.  Eventually the expansions will provide enough power to beat it somewhat reliably.  We'll be on the forum talking about the Old Days when EfDG was almost impossible to win solo..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523831","commentId":523831,"userName":"Eyedunno53","timestamp":1315101218,"content":"Alright, so I would like to start by saying I am definately NOT the best at this game.  I just happened upon a combination that seems to work alright.  I took me many, many failed attempts at various decks to even start to get it right.  Secondly, in retrospect 50% is probably a bit much.  maybe closer to 30% or so?  And luck definately plays a part.  It does in this game in general... but especially with this quest. \n\nHere is my deck:\n\nAragorn\nFrodo (or Dunhere)\nEowyn\n\n \n\nA test of Will x3\nDwarven Tomb x2\nFortune or Fate x2\nStand and Fight x3\nThe Galadhrim’s Greeting x3\nHasty Stroke x3\nSneak attack x3\nValiant Sacrifice x3\n\nNorthern Tracker x3\nLongbeard Orc Slayer x3\nFaramir x3\nWandering Took x3\nGandalf x3\n\nUnexpected Courage x2\nCelebrian’s Stone x2\nDunedain mark x3\nDunedain warning x3\nSteward of Gondor x3\nSong of Kings x3\n \n\nThe strategy: First of all you really want a Steward of Gondor and/or an Unexpected courage in your opening hand.  If you dont get one of them, take you mulligan.  How you handle the first few round determines how much of the game will go.  And really it depends a lot on who gets captured.  The easiest is Frodo (or Dunhere).  This leaves Eowyn to quest and Aragorn to deal with monsters.  I will take a few wounds the first few rounds to keep the monsters low and kill with Aragorn.  Dont be afraid to discard a card to Eowyn.  If you lose the first few rounds, then those cards did you no good anyway, right?\n\nThe next difficult is having Eowyn captured.  This way I will do my best to kill monsters fast, so I can commit Aragorn and the other hero to questing.\n\nThe hardest is having Aragorn captured and I am not recalling winning that way.  You'll definately want one of the Song of Kings.\n\nAlright, other strategies I use.  Northern Trackers are amazing, and I get them asap.  With one or two of these in play I will often ignore locations (to an extent) and take a few turn for these guys to clear them instead of traveling to them, because so many of the locations have nasty travel effects.  Faramir can also make questing easier, especially late game.  Yes, these guys are kinda heavy resource wise, but the extra abilities and stats are worth it.  Especially the HP that helps them survive some trechery cards.  One location I dont avoid is Mountains of Mirkwood.  Yes, the travel to ability can suck, but it can be worth it when you complete the area and get to search your deck for that ONE card you need to not lose.\n\nAnother tactic is keeping my threat low.  So The Galadhrim’s Greeting to reduce it by six.  And I will use Dwarven Tomb to get it back and play again for another 6 reduction.  Sometimes all in the same round if the cards fall right.  being able to choose how you deal with monsters helps a lot.  Also, when I play Gandalf I will often use his ability to lower my threat more.\n\nSpeaking of Gandalf,  I use the Sneak Attack, and Stand and Fight cheapness. \n\nGet rid of Shadow effects and When Revealed effects as you can with Test of Will and Hasty Stroke.  BUT be selective.  Some effects will ruin you much faster.\n\nFor allys, Gandalf is in as I am sure he is with pretty much all decks.  Then Northern Trackers were explained.  As was Faramir.  From there it was harder.  I choose the Longbeard Orc Slayers because their extra hit point help them to survive a bit, and you need the extra attack to deal with the nazgul when it hits the board.  The Wandering Tooks are my least favorite, but they are somewhat rounded and decently priced. \n\nWhen it comes to picking up an Objective card for the first round I have Eowyn pick up the map.  She is questing pretty much every turn so I dont care if she cant attack or defend.  I only pick up this one to end the first encounter card.  I hurry to save the hero when I hit the second encounter card.  Hopefully by this time, I have little to deal with in the staging area, and a few allies to help.  When the Nazgul shows up, I hope to have saved up one or two Hasty Strokes.  Cancel the Shadow Effect and he doesnt off an extra ally.  Now, if you have Dunhere with you, you can pop a few Dunedains mark on him to be able to peck at him from the staging area, and maybe play some Gandalf's to kill him.  Personally, I prefer to have Frodo along, especially if I got a Dunedain Warning or two on him.  This lets me defend his 4 attack and absorb some damage as threat, and thus not lose a character to the attack.  Then, I attack the hell out of him.  Aragorn with a Dunedain mark, a northern tracker and a Longbeard Orc Slayer can do a fair bit of damage.  He can only last two or three rounds of some of that sort of action.  And if your threat is sufficently low, you wont worry too much about other things attacking you.\n\nSo, after I kill the Nazgul, and just before I finish the encounter card I pick up the other two objective cards.  I like to give the Shadow Key to Frodo, so he can absorb it as threat so it wont slowly kill a character.  Leaving the Torch for Aragorn.  Or if you have Dunhere, give the Key to whoever has the most HP left.\n\nHonestly at this point, if I have made it this far, I have things far enough under control that I can quest all my characters for the win. \n\nOne thing to keep in mind is to try to NEVER let the **** Dungeon Jailor shuffle the Objectives back into the deck.  If he does you have to wait for it show back up... and hope it isn't dealt as a shadow card.  If THAT happens you have to run the entire deck and go through it again and hope AGAIN that it doesn't come up as a shadow card (yes, this has happened to me) and trust me... nothing sucks more than facing the Nazgul twice in the same game.\n\nAnyway, there ya have it.... way more info than most people asked for, I'm sure...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523833","commentId":523833,"userName":"player582283","timestamp":1315101832,"content":"Thanks for the detailed breakdown.  I've only one core set, but I'll proxy some cards and give you deck a try when I can"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523887","commentId":523887,"userName":"Style75","timestamp":1315115221,"content":"Nice strategies, I'm definitely going to be giving this a try. It seems that it all hinges on the opening hand and the first few draws of encounter cards. If you get off to anything other than a really good start you're going to be in trouble. Thanks for the report. I'll post and let you know how I fare with your deck/strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52386-has-anyone-completed-escape-from-dol-guldur-solo/?do=findComment&comment=523983","commentId":523983,"userName":"Eyedunno53","timestamp":1315136410,"content":"Thats very true.  It does hinge on the first few hands.  Which isn't the best design ever.  I would rather play a scenario that is tough at the end.  But, once you get going, this scenario is fun.  For me there is a true sense of panic that come from trudging through a place like Dol Guldor.  Especially when the Nazgul hits.  Its better than running through Mirkwood again though >.>"}]}