{"url":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/","title":"Noob question -- is the &#039;quest&#039; phase mandatory?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/?do=findComment&comment=522713","commentId":522713,"userName":"McChubs","timestamp":1314824096,"content":"Hello there,\n\nme and my missus bought LOTR the card game today and are finding it strangely easy. So far, we played through the first scenario without even taking a single wound. I was just wondering, is the quest phase necessary? I.e. if there are enemies on the field, can you skip questing to engage them? Also, if an enemy has engaged you, can you choose the engagement phase to attack him with your free 'pick an enemy' move? All the reviews and people I've talked to said this was going to be a difficult game, but so far we've steamrollered it. I assume because we don't really know the rules. Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/?do=findComment&comment=522721","commentId":522721,"userName":"ricedwlit","timestamp":1314827954,"content":" Questing is mandatory: if you do not commit any characters to a quest, then you reveal the necessary cards and adjust your threat upward. Then you can proceed to engage enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/?do=findComment&comment=522722","commentId":522722,"userName":"Bohemond2","timestamp":1314828303,"content":"As mentioned above, questing phase happens whether or not you commit to the quest.  And, if you don't comitt, expect to see a huge boost in your threat. Also, your free engagement lets you engage an enemy, it does not let you attack an enemy.  Under normal circumstances, the enemy will always attack you before you can attack it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/?do=findComment&comment=522723","commentId":522723,"userName":"Squeinstein","timestamp":1314828420,"content":" The main point of the questing phase is to make progress on your quest (travel tokens), and to manage your threat.  If you skipped questing (aka 0 willpower) there would be locations & enemies in staging, you would add their threat to each players dial.  You lose at 50.  I keeping up with the staging area to be key ( and at the start of the game, quite difficult for me when playing solo).\n\nI have a semi-related question...\n\nFor end game quest stages where you are trying to kill enemies to win (usually, these stages have 0 progress needed... and kill all enemies, or kill the spawn, etc).  For those 0 progress quests, do you still need to keep up with questing ?  I assume yes, if only to offset the staging area threat? (since no progress is needed?) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/?do=findComment&comment=522729","commentId":522729,"userName":"McChubs","timestamp":1314830333,"content":"How much threat do you gather if you don't quest? Would it be the sum total of threat added to each player's threat counter? As for engaging, that means you can engage early but the enemy you engage would hit first, right? But what if you attacked with multiple creatures?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/?do=findComment&comment=522730","commentId":522730,"userName":"Svenn","timestamp":1314830522,"content":"Yes, even if your goal is to kill enemies you have to continue questing. The only real point then is to offset the enemy values and to get rid of locations.\n\nThere is no point at which you can skip the quest phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52510-noob-question-is-the-quest-phase-mandatory/?do=findComment&comment=522732","commentId":522732,"userName":"Svenn","timestamp":1314830724,"content":"McChubs said:\n\nHow much threat do you gather if you don't quest? Would it be the sum total of threat added to each player's threat counter? As for engaging, that means you can engage early but the enemy you engage would hit first, right? But what if you attacked with multiple creatures?\n\n\n\nYou gain 1 point of threat for every point the enemy beats you by. If your willpower total is 10 and the enemy total is 15 then you would gain 5 threat. If you don't quest then you just add up the enemy value and add that directly to threat (0 willpower vs however much basically). This goes to EACH player. So in the case above if you were in a 3 player game, all 3 players would increase their threat by 5.\n\nRegardless of whether you choose to engage the enemy or it chooses to engage you it will hit first (unless you have a card like quick strike to alter this). The point of choosing to engage is to either grab an enemy that wouldn't normally engage you (your threat is lower than it's threat requirement) or to grab something before it goes to another player."}]}