{"url":"https://community.fantasyflightgames.com/topic/52529-noobish-questions-about-deck-building-after-expansions/","title":"Noobish questions about deck building after expansions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52529-noobish-questions-about-deck-building-after-expansions/?do=findComment&comment=522875","commentId":522875,"userName":"player605513","timestamp":1314869413,"content":"Hi,\n\nThis will be my first post here. I have a question about new cards and new quests. I have two expansions.\n\n1) Have you guys just mixed new cards to old decks making them stronger or have you done new decks? I guess there will be time when the game supposes that we make dual sphered decks but it's not yet.\n\n2) Is there a max amount for a card in a deck?\n\n3) The quests of core set are now way less difficult and difficulty level is less now? How about new quests? Is the level count based on new cards given?\n\n4) Have you done any adjustments for game when playing 3 or 4way? I mean playing with three decks is way easier than playing with two."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52529-noobish-questions-about-deck-building-after-expansions/?do=findComment&comment=522876","commentId":522876,"userName":"radiskull","timestamp":1314869697,"content":" 1) I've played a lot with just mixing the new cards in with the core decks, and I've also made a couple of 2-sphere decks that work pretty well.\n\n2) 3 copies of a single card in a deck, minimum 50 cards (not including heroes).\n\n3) I'm not sure, really.\n\n4) I know some players have done some adjustments with 3 or 4 players, but I never do.  I do agree that the game seems optimally balanced for 2 players, though.\n\n \n\nWelcome to the forums :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52529-noobish-questions-about-deck-building-after-expansions/?do=findComment&comment=523050","commentId":523050,"userName":"Kitsune Rei","timestamp":1314893230,"content":"Hello, welcome to the forum :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI usually make new decks a lot, mixing in the new cards does help some, but each scenario has a different focus so its pretty rare one deck will do well at them all. Also new cards open up more exciting new themes so that invites a completely new deck (like we've been getting enough eagle cards now to start doing something with them, as well as rohan.)\nOne thing I like about the game is I like the mechanics for each color, so I think a lot about different ways I could build decks. I really like combining colors together because there's a lot of good synergies to be found.\n\nI don't really know how they figure difficulty for the new quests, but they seem pretty hard unless you get really lucky. We usually play each new one blind and get slaughtered, and then we rebuild to address the problems better. I consider each scenario like a puzzle to solve.\n\nI will say the game seems a lot easier with 3+ players. It also allows one person to focus more on a theme (for instance questing) without worrying as much about being able to fight or heal. Usually multiple player adjustments I do are just to not step on someone else's toes by making sure not to choose the same hero or deck theme. Only one person can really run Steward of Gondor etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52529-noobish-questions-about-deck-building-after-expansions/?do=findComment&comment=523263","commentId":523263,"userName":"Mighty Jim 83","timestamp":1314951135,"content":"Kitsune Rei said:\n\n\nI will say the game seems a lot easier with 3+ players. It also allows one person to focus more on a theme (for instance questing) without worrying as much about being able to fight or heal. Usually multiple player adjustments I do are just to not step on someone else's toes by making sure not to choose the same hero or deck theme. Only one person can really run Steward of Gondor etc.\n\n\n\n \n\nThat's true, but I wonder whether it's always for those reasons?\n\nwith 3 or 4 players, its easy to basically run mono-sphere decks, maybe with a small amount of something else tacked one. That seems to make a deck much easier to put together.\n\n2 players or 1, and you probably both need to be running a substantial number of cards from a sphere other than the main one. That require much more fine-tuning of the decks. Ratios of card spheres and costs, as well as making the luck of your card draw a much bigger factor- all of the cards for your minor sphere/ no songs can really screw up a multi-sphere deck, in a way that mono-sphere decks just don't suffer (unless it's that elusive northern tracker who's late again.)"}]}