{"url":"https://community.fantasyflightgames.com/topic/52588-a-journey-to-rhosgobel/","title":"A Journey to Rhosgobel...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52588-a-journey-to-rhosgobel/?do=findComment&comment=523441","commentId":523441,"userName":"Hastur360","timestamp":1314981202,"content":"So I am not sure how many of you out there approach your new scenarios each half  a month (or month when it gets on track) but I tend to open my packs and look through all the new player cards but I don't peak at the scenario cards. I then sleeve up the new scenario and take my most current deck against it. No forewarning or anything except the blurbs of information we get here from Fantasy Flight.\n\nSo the first adventure to Rhosgobel saw myself and two other players beginning play and eager to see what the new scenario had to offer us. After drawing three back to back wound a character if exhausted, or did not have an attachment treacheries we were off to a fine startpreocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]. We soon fell to having each losing a hero and just plain amazed at the brutality of the Journey. Needless to say we got to the second part of the scenario and died. llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif]\n\nThen usually after one play we go and tweak our decks. This time tweaking was done and again, we have not looked past the second scenario card and we lost a player so it was just my gf and I. We pulled through quite well and finished off the second scenario and felt very good with ourselves and then flipped to find out that those Athelas would thought we would have time to grab were now beyond our reach and we lost the scenario with only having grabbed one and not enough to heal Wilyador. sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]\n\nNow we know the scenario and plan to play again and will tweak once more and will probably make it through.\n\nMy main reason for the post is that I really enjoy the fact I usually get 4 or 5 plays of a scenario and then lo and behold we get another scenario. I like how we go about playing each scenario blindly , then tweak and sometimes fail, and play until victory. At times we will play an older scenario but I really like the freshness of having a new scenario each month. I was wondering if anyone else follows a similar way of approaching this game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52588-a-journey-to-rhosgobel/?do=findComment&comment=523627","commentId":523627,"userName":"richsabre","timestamp":1315044244,"content":"interesting idea, though personally i ratch through every last thing in the pack!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52588-a-journey-to-rhosgobel/?do=findComment&comment=523634","commentId":523634,"userName":"Kiwina","timestamp":1315046187,"content":" I'm similar to you Hastur.  I always look at the new player cards, and try to use some of them in my first run through of a quest.  I don't really look at the encounter cards until the first game or so, and never look at the quest cards.  It's really fun is not knowing what comes next, and you only get that on the first few sessions of any quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52588-a-journey-to-rhosgobel/?do=findComment&comment=523953","commentId":523953,"userName":"player582283","timestamp":1315131930,"content":"Hastur,\n\nI do the same thing - a blind playthrough with my 'primary' play deck every expansion.  I even get a little OCD about avoiding previews of the encounter cards. \n\nI managed to get through both stages of JtR.  Unfortunately I only had one Athelas - I was thinking that I'd bring it back; It would heal W up some, and I'd go back for more.  Unfortunately he died instead!\n\nI'm trying to build a deck that can handle all the Shadows of Mirkwood quests fairly consistently.  Looks like I'm going to have to splash some Lore healing in it (currently Leadership - Spirit) to have a chance on this one.  I tried just adding 2 Radagasts - won the first one after adding him in, but then lost 4 or 5."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52588-a-journey-to-rhosgobel/?do=findComment&comment=524268","commentId":524268,"userName":"jhaelen","timestamp":1315207159,"content":"Hastur360 said:\n\nI was wondering if anyone else follows a similar way of approaching this game?\nYup, that's how I'm doing it, too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52588-a-journey-to-rhosgobel/?do=findComment&comment=526580","commentId":526580,"userName":"gatharion","timestamp":1315690878,"content":"Woz said:\n\nHastur,\n\nI do the same thing - a blind playthrough with my 'primary' play deck every expansion.  I even get a little OCD about avoiding previews of the encounter cards. \n\nI managed to get through both stages of JtR.  Unfortunately I only had one Athelas - I was thinking that I'd bring it back; It would heal W up some, and I'd go back for more.  Unfortunately he died instead!\n\nI'm trying to build a deck that can handle all the Shadows of Mirkwood quests fairly consistently.  Looks like I'm going to have to splash some Lore healing in it (currently Leadership - Spirit) to have a chance on this one.  I tried just adding 2 Radagasts - won the first one after adding him in, but then lost 4 or 5.\n\n\n\n \n\nYup...\n\nJust tried \"A Journey to Rhosgobel\" for the first time today. I think it was my first quest without having looked at the cards ahead of time....and the exact same thing happened. We made sure we had a single Athelas before going into the final stage only to find that final stage was all or nothing!!!\n\nIt was fun though, we didn't get either Landroval or Radaghast out, but even so all of the Eagle cards are lots of fun. \n\nI really like Prince Imrahil too, I haven't played him yet, but he'll be a big part in an upcoming Gondor-centric deck that I plan on making.\n\n "}]}