{"url":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/","title":"Rules Question - A Journey to Thosgobel, Glorfindel &amp; Wilydar","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=523489","commentId":523489,"userName":"Bohemond2","timestamp":1314999205,"content":"If Glorfindel Heals Wilyador during the second stage of the quest, is removed from the game? \n\nIf he is removed from the game, how does that effect scoring?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=523527","commentId":523527,"userName":"player582283","timestamp":1315013757,"content":"I just ran into a similar situation with Radagast healing him.  I discarded Radagast when I did it.\n\nIt feels wrong, especially tossing Glorfindel, but is correct the way I read the card.  After a card effect heals Wilyador...  Glorfindel's action is definitely a card effect based on the definitions on page 23 of the rulebook. I wonder it they meant it to be events...I know it's just marketing, but it's funny that they touted Glorfindels innate healing as making him more useful for JtR, but he may have to leave play to do it.\n\nI'd be interested if someone has a different interpretation and why."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=523570","commentId":523570,"userName":"Shelfwear","timestamp":1315029112,"content":"I agree its hard to limit an ability of a Hero in this way but if you read the flavor text of the quest card it makes sense story wise:\n\n\"The Eagle's health has grown worse, but you have at last arrived at Rhosgobel, where Radagast examines the bird. He then asks you to head out into the wilderness to find the healing plant, Athelas. Meantime, any healing lore or supplies your party has at its disposal could be used to assist in comforting the Eagle until you return.\"\n\nThat means all Persons and aids (e.g. spells etc) that heal Wilydar stay at Radagast's hut with the eagle and therefore are seperated from the rest who are out to look for Athelas..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=523604","commentId":523604,"userName":"Kiwina","timestamp":1315040228,"content":"If that's the case, which going off of card text it is, then this quest just escalated in difficulty for a solo game.  I'm not sure if I have enough healing cards to complete the quest solo, unless I'm really lucky."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=523666","commentId":523666,"userName":"player582283","timestamp":1315054065,"content":"Kiwana,\n\nI faced that issue with my 'primary' deck made up of Leadership and Spirit.  I had no healing.  I played a couple times with a few of the new cards added in, losing both.  I added in a couple Radagasts and  was able to eke out a victory on the third.  Push really hard to get past the first stage so that you can start using W's ability to draw 3 cards from the encounter and put one (hopefully Athelas or the Glen that can get it) in play.  The game I won, I was able to get past the first stage on the first turn and really dig into the encounter deck before W starts wearing out.  We'll see if this is enough to have a decent win %.\n\nBesides Radagast being a new member of my stand by, I swapped a couple Citadel Guards for the Archers so that they could take one for the team from the new enemies that can only be blocked by archers.\n\nI've not tried my other standard - a Lore/Tactics, but I believe it will coast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=523791","commentId":523791,"userName":"Kiwina","timestamp":1315087469,"content":"Woz said:\n\nKiwana,\n\nI faced that issue with my 'primary' deck made up of Leadership and Spirit.  I had no healing.  I played a couple times with a few of the new cards added in, losing both.  I added in a couple Radagasts and  was able to eke out a victory on the third.  Push really hard to get past the first stage so that you can start using W's ability to draw 3 cards from the encounter and put one (hopefully Athelas or the Glen that can get it) in play.  The game I won, I was able to get past the first stage on the first turn and really dig into the encounter deck before W starts wearing out.  We'll see if this is enough to have a decent win %.\n\nBesides Radagast being a new member of my stand by, I swapped a couple Citadel Guards for the Archers so that they could take one for the team from the new enemies that can only be blocked by archers.\n\nI've not tried my other standard - a Lore/Tactics, but I believe it will coast.\n\n\n\nI totally misread the 2B response.  I thought it said to look at the top 3 cards of the player deck.  lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\nI'm going to have to go back and try it again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=523797","commentId":523797,"userName":"player582283","timestamp":1315089634,"content":"It makes a difference!  Normally it would be nice to get the player cards, but in this one you need to be getting through the encounter deck ASAP.  I love how the different scenarios make the game play differently. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=524463","commentId":524463,"userName":"Voldigar","timestamp":1315241741,"content":" \n\nThe preview we received teasing us the Glorifindel would finally be useful is now rather irritating:\n\n\"...they may prove tremendously useful in a scenario, like that of A Journey to Rhosgobel, that focuses on assisting others, rather than jumping into battle with fearsome enemies. Glorfindel, for example, might take a commanding position among the heroes of Middle-earth as they push toward Rhosgobel...\"\n\nAlas, that is totally incorrect and Glorfindel remains lame. Until Rhosgobel is cleared from the staging area you cannot use Glorfindel's ability on Wilyador and you cannot travel  to Rhosgobel until Stage 1 is done. Once you're in Stage 2, using Glorfindel's ability on Wilyador results in immediately removing Glorfindel from the game. This leaves me rather flat and disappointed in this release. It's seems like it went totally unplaytested. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=524471","commentId":524471,"userName":"player582283","timestamp":1315242780,"content":"Voldigar,\n\nThat seems to be a pretty extreme reaction.  I'd suggest that it means that the person writing the marketing blurb didn't fully understand the mechanics and the design folks should probably do a review of the marketing pages..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=524475","commentId":524475,"userName":"Bohemond2","timestamp":1315243064,"content":"I have had games where Glorfindel's ability to heal Wilyador 1 point was the difference between winning and losing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=524797","commentId":524797,"userName":"Voldigar","timestamp":1315317730,"content":"babeo.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/babeo.gif]\n\nAlright Woz, my post did sound like true nerd-rage. You're right. Still, I think the criticism (while brutal) is somewhat fair. For blind-players, the insta-loss 3rd card (with no explicit warning) was worth a fist-shake too. Blasted through card 1 and card 2 only to learn \"you lose!\" BAH!\n\n@Bohemond: oddly enough, just played a session myself that Glorfindel's 1 healing and subsequent exit would have won for me. Alas, I had booted him. Irony!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=525122","commentId":525122,"userName":"Shelfwear","timestamp":1315377559,"content":"Same old story in most companies (regardless of product): the communication/marketing guys write something to create attention and lure customers, the content/design guys create the product. Most of the time these two types never meet or when they meet, they dont agree on how to properly a illuminate product..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=525824","commentId":525824,"userName":"player582283","timestamp":1315514466,"content":"Voldigar,\n\nNo biggie.  Notice that I made a comment about the irony of the marketing blurb about Glorfindel earlier.  Funny about your blind play results though...I avoid reading any spoilers of the new encounter cards and really enjoy the first play through trying to figure out what I should do.  No surprises in HfG and I won.  CatC was hilarious.  I had a decent start and a few allies so I tackled the 2nd stage thinking that it would bring in a Troll every turn.  Surprise!! all 4 and 3 dead heroes soon after.  I blazed through JtR's first 2 stages, picking up 1 Athelas.  I thought that I'd heal W up some with that one and run back for more.  Nope!  I lose!  Still fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=525829","commentId":525829,"userName":"player582283","timestamp":1315514994,"content":"Bohemond,\n\nI've a similar experience in my first of very few wins playing JtR.  In a truly annoying combo, an Athelas was guarded by Hummerhorns.  No way in my deck to take out the Hummerhorns in the staging area except for Gandalf's entry.  When the time came, I had to bite the bullet and sacrifice Aragorn to engage and kill the Hummerhorns with others to free up the Athelas.  This was after discarding Radagast to get a much needed heal in for W.  Fortunately their sacrifice was not in vain..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=525839","commentId":525839,"userName":"Bohemond2","timestamp":1315516835,"content":"Ug... I had not even thought about that horrible combo.  Where is Dunhere when you need him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=525905","commentId":525905,"userName":"GhostWolf69","timestamp":1315532588,"content":"I have a related Question.\n\nIF you choose to use Glorfindel to Heal the Eagel.\n\nWill he THEN be counted as \"killed\" and give you negative points in the Scoring once the game is over?\n\nIt's not like he was defeated or killed... he was simply removed from the game.\n\nScoring only says \"Cost of Dead Heroes\"... and he's not really Dead is he?\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=526283","commentId":526283,"userName":"player582283","timestamp":1315603893,"content":"From a literal reading of the rules I would say that he does not count against you.  He is not dead, just discarded from play.  The difference is significant with some cards like Landroval and Fortune or Fate.  He's not coming back!  Someone made the comment earlier that the out of play fits the theme in that they are staying back with W while the rest search for Athelas, so he's safe and sound playing Nursemaid to the eagle!\n\nThink if I was keeping score I'd count any wounds on him when he went out of play against my score and leave it at that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=526405","commentId":526405,"userName":"guciomir","timestamp":1315643493,"content":"Glorfindel can be used to heal other characters, not only the Eagle. Sometimes this is a difference of death and life in this crazy-damage-dealing scenario. And yeah, I won one game only because Glorfindel healed this one point of the eagle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=530349","commentId":530349,"userName":"Shvide","timestamp":1316457519,"content":" I have a a related question about the way this quest plays out. The flavor text of the card justifies discarding a hero card (Glorfindel) or alies (Rhadagast) if you use their abilities to heal Wilyador, since using them would mean that they were at/ traveled back to Rhosgobel. So what happens with Wilyador? Once you enter 2b does he leave the play area? I leave him in play, and use him for questing, but if by the flavor text of the game he is severely hurt and at Rhosgobel, should I be setting him off to the side? And by turn Rhadagast, since he should be in Rhosgobel taking care of Wylador? Or have I taken this flavor text explanation too far and read way to much into it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52596-rules-question-a-journey-to-thosgobel-glorfindel-wilydar/?do=findComment&comment=530870","commentId":530870,"userName":"TheLightdarker","timestamp":1316544892,"content":"guciomir said:\n\nGlorfindel can be used to heal other characters, not only the Eagle. Sometimes this is a difference of death and life in this crazy-damage-dealing scenario. And yeah, I won one game only because Glorfindel healed this one point of the eagle.\n\n\n\nI was going to mention this too, as a way of illustrating that the person whom wrote the article was not  necessarily blowing everything entirely out of proportion in saying that Glorfindel would potentially be much more useful in AJtR than he has been in previous quests.  Admittedly, although I don't think he is by any means necessary to include in your deck to beat AJtR (and I still don't use him myself), there are plenty of occasions where characters take 1 or 2 damage here or there which Glorfindel would be able to remove relatively easily, and it seems that once characters take some damage, more tends to follow quickly, i.e., Eowyn with 1 damage + Festering Wounds = dead.  Eowyn with 0 damage + Festering Wounds = Eowyn with 0 damage.  Alternatively, Eowyn with 1 damage = alive, Eowyn with 1 damage and you reveal an Exhaustion?  Dead."}]}