{"url":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/","title":"Gandalf Combo, 2-Sphere Deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=523816","commentId":523816,"userName":"Alphabet Jimm","timestamp":1315097705,"content":" I built this and it has been doing pretty well for me. Only have 2 core sets. I think the deck does obvious combos with Gandalf but uses Aragorn to the fullest. The new Spirit draw card does some great things in the deck. Other allies add some extra attack. The deck struggles with the Journey to Rhosgobel because of the nature of the quest, but it does well against all the others, sans Dol Guldur. But here it is, in all its glory.\n\nHeroes:\n\nAragorn (12) Leadership\nEowyn (9) Spirit\nFrodo (7) Spirit\n\nAllies: 21\n\n3 Gandalf\n3 Silverlode Archer\n3 Son of Arnor\n3 Faramir\n3 Northern Tracker\n3 Eomund\n3 Escort from Edoras\n\nAttachments: 16\n\n3 Dunedain Warning\n2 Unexpected Courage\n2 Celebrian's Stone\n3 Steward of Gondor\n3 Ancient Mathom\n3 Born Aloft\n\nEvents: 13\n\n3 Test of Will\n3 Sneak Attack\n3 Ever Vigilant\n3 Stand and Fight\n1 Grim Resolve\n\nLet me know what ya think or any changes you would make. Thanks you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=523843","commentId":523843,"userName":"guciomir","timestamp":1315104274,"content":"You have no tactic hero, so you can't play born aloft. It is explained in rules section"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=523898","commentId":523898,"userName":"Bohemond2","timestamp":1315121292,"content":"Not having played the deck, it looks VERY dependent on Steward of Gondor.  Do you have enough leadership resources to play your leadership cards and untap aragorn if you don't draw it?\n\nedit: The more I think about it, the more I feel that this type of deck might run better with Prince Imrhail than with Aragorn.  Yes, you use some resource flexibility with Celebrain's stone, but, with two spirit heroes that isn;t the end of the world.  And Escort of Edoras + Sneak Attack + Stand and Fight means you have a lot of free untaps"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=523933","commentId":523933,"userName":"lleimmoen","timestamp":1315129891,"content":"I think it is very nice.\n\nOne card I would totally exclude is Silverlode Archer. To think of an ally replacement, Westfold Horse-breaker could do.\n\nÉomund has good stats but his ability seems useless in this deck. The only character you could ever ready is his daughter and she is not very useful for combat (in this game).\n\nI also utilize a deck where a single copy of Gandalf can be played four times: Sneak Attack, Borne Aloft, normal, Stand and Fight. Dwarven Tomb would be another way but I myself do not use it either although I quite like the card and use it in another deck.\n\n[edit] Oh, I missed the Tactics hero missing. That is a bit of a problem. 8) So you may now think of Dwarven Tomb instead as you could use the card for quite a few useful cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=523966","commentId":523966,"userName":"Alphabet Jimm","timestamp":1315134109,"content":" I was totally oblivious to the fact that you need a tactics hero to play a zero cost card. Also, I think Prince Imrahil would work very well as the deck is incredibly reliant on Steward of Gondor for resources. I like Silverlode Archer for his attack strength, however, he is easily replaced. I agree that Dwarven Tomb sounds like a good addition. I like Eomund for his questing, but I think its true his ability does not do much for the deck. Maybe I'll find a way to replace him.\n\nDeck Update: Gandalf Combos\n\nHeroes:\n\nPrince Imrahil (11)\nEowyn (9)\nFrodo (7)\n\nAllies: 18\n\n3 Gandalf\n3 Faramir\n3 Northern Tracker\n3 Escort from Edoras\n3 Westfold Horse-Breaker\n3 Son of Arnor\n\nAttachments: 14\n\n3 Steward of Gondor\n2 Song of Kings\n3 Ancient Mathom\n3 Dunedain Quest\n3 Dunedain Warning\n\nEvents: 18\n3 Valiant Sacrifice\n3 Sneak Attack\n3 Stand and Fight\n3 Test of Will\n3 Ever Vigilant\n2 Dwarven Tomb\n1 Grim Resolve"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=523977","commentId":523977,"userName":"lleimmoen","timestamp":1315135667,"content":"I like Imrahil so much. There are so many nice combos that go with him. He seems to combine well with Tactics though (which you may consider for the future - or alternative to this deck), Borne Aloft on Gandalf - ready him any time you need. Horn of Gondor to get extra benefit of the ready effects. Horse-breaker is the card to combo with Imrahil as you will ready two heroes at once. Escort is obviously great - to ready him after he quests. I quest just about every time with Imrahil and am usually able to ready him about twice in three rounds - and it will gain with more players. Then you have Valiant Sacrifice for some additional card drawing, nice. Eagles would also work well with Imrahil but it could be too many cards then. You already play Stand and Fight, Dwarven Tomb could bring even more. I think you are set up for a very strong deck here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=523995","commentId":523995,"userName":"Alphabet Jimm","timestamp":1315139994,"content":" Thank you. I can't wait to get my Rhosgobel pack so I can test it out. On a side note, this is one of the best gaming communities I have been a part of since I started into gaming. Thanks for the support. Keep it up and new players will continue to join."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52642-gandalf-combo-2-sphere-deck/?do=findComment&comment=524105","commentId":524105,"userName":"lleimmoen","timestamp":1315154270,"content":"My pleasure.\n\nEnjoy!"}]}