{"url":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/","title":"One deck to rule them all?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/?do=findComment&comment=523910","commentId":523910,"userName":"radioboyeric","timestamp":1315126312,"content":"Has there been a deck that players have used that last them thru all of the scenarios with some sort of success (at least the released ones)? As these new scenarios come out and as FFG advertises the scenarios it would seem that players should be able to take their characters thru the \"Shadows of Mirkwood\" cycle using one deck, hence the roleplaying aspect of using that same group going thru these adventures/cycles. It seems scrolling thru these forums that there just isn't enough card selection or that these scenarios require alot of different deck building techniques to really beat them. For example some decks are better to beat Anduin than the first scenario (although it doesn't seem like anyone has any measure of success with DOL GULDUR.\n\nDon't get me wrong. I love the game and will continue to buy the expansions. I just thought of this having my morning coffee while my 3 year old daughter finishes her tantrum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/?do=findComment&comment=523947","commentId":523947,"userName":"Titan","timestamp":1315131504,"content":"I don't think that using the very same deck solo in every quest is going to be practical. I think it can be done with the core set, but not with the expansions. I used a Theodred/Beravor/Eowyn deck there and it did well with the first two and once nearly defeated Dol Guldur. \n\nHowever, all the expansions seem to need a more custom fit to the decks. Gollum is quest heavy, Eowyn, Lorien Guide, Northern Tracker shine there. Carrock needs heavy hitters, Beorn, Gimli, and the more combat oriented allies. For what I've seen of Rhosgobel, healing is important there, perhaps necessitating Glorfindel, Daughter of the Nimrodel, etc.  And of course, the supporting cards for whatever theme fits best. This seems to be the direction the game is going with the packs.\n\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/?do=findComment&comment=523950","commentId":523950,"userName":"guciomir","timestamp":1315131760,"content":"radioboyeric said:\n\nHas there been a deck that players have used that last them thru all of the scenarios with some sort of success (at least the released ones)? As these new scenarios come out and as FFG advertises the scenarios it would seem that players should be able to take their characters thru the \"Shadows of Mirkwood\" cycle using one deck, hence the roleplaying aspect of using that same group going thru these adventures/cycles. It seems scrolling thru these forums that there just isn't enough card selection or that these scenarios require alot of different deck building techniques to really beat them. For example some decks are better to beat Anduin than the first scenario (although it doesn't seem like anyone has any measure of success with DOL GULDUR.\n\nDon't get me wrong. I love the game and will continue to buy the expansions. I just thought of this having my morning coffee while my 3 year old daughter finishes her tantrum.\n\n\n\nradioboyeric said:\n\nHas there been a deck that players have used that last them thru all of the scenarios with some sort of success (at least the released ones)? As these new scenarios come out and as FFG advertises the scenarios it would seem that players should be able to take their characters thru the \"Shadows of Mirkwood\" cycle using one deck, hence the roleplaying aspect of using that same group going thru these adventures/cycles. It seems scrolling thru these forums that there just isn't enough card selection or that these scenarios require alot of different deck building techniques to really beat them. For example some decks are better to beat Anduin than the first scenario (although it doesn't seem like anyone has any measure of success with DOL GULDUR.\n\nDon't get me wrong. I love the game and will continue to buy the expansions. I just thought of this having my morning coffee while my 3 year old daughter finishes her tantrum.\n\n\n\nMy Theodred - Eowina - Gimli deck was very succesful solo vs Hunt, Anduin, Mirkwood (almost all wins). It was quite succesful vs Osgilath and Carrock - definately more wins than loses. And it was moderately succesful vs Escape, I scored 3 wins and some loses, don't remember how many (but definately deck can't win if Eowin is captured).\n\nAnd then, Rhosgobel came. 0 wins, lots of failures. It is impossible for my deck to win this scenario. So this means:\n\na) I need to think about some new solutions\n\nb) it will be quite hard to create deck which is good against every scenario. When I make changes so I can win Rhosgobel, other quests will become harder for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/?do=findComment&comment=523963","commentId":523963,"userName":"player582283","timestamp":1315133095,"content":"I'm trying to put together a primary deck that can handle the Shadows of Mirkwood cycle solo.  I evolve the player cards with each expansion, but my goal is to finalize it after Return to Mirkwood and beat the full cycle in order.  I also have the constraint of one Core game at this point.  Up until JtR I was running Leadership - Spirit with Aragorn, Gloin and Eowyn.  I like Imrahil so much I replaced Gloin with him even though the threat is a little high (32). \n\nI ran the first 3 a bunch of times with the updated deck over the last few days (well nights!).  HfG is easy with it - I went 3 for 3 with it.   I had some issues with CatC - played it a few extra times and went 4-2.  Biggest issues with the two losses were early Sacks and/or Hill Trolls that derailed me.\n\nHowever, this deck just can't beat JtR.  Questing, threat reduction and ability to deal with creatures are its strengths, but these are secondary to success in JtR.  I need healing for W!  After 2 or 3 losses, I tried adding in a couple Radagasts, and actually won the next game-by the skin of my teeth.  However, I then lost 5 or so in a row.  Looks like I'm going to have to splash in some Lore healing to have a chance.  Oh well, that may help anyway - might as well add in the miner who gets rid of conditions.  Or maybe I'll get lucky and they'll add a Leadership card that provides a little healing in an upcoming pack. \n\nIt's fun for me to go this route - good deck building and gameplay challenge.  At the same time I experiment with some secondary decks as the quests play so differently with them.  Best of both worlds with a great game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/?do=findComment&comment=524006","commentId":524006,"userName":"gamestar10","timestamp":1315141733,"content":"radioboyeric said:\n\n \n\nDon't get me wrong. I love the game and will continue to buy the expansions. I just thought of this having my morning coffee while my 3 year old daughter finishes her tantrum.\n\n \n\n \n\nFirst of all, love this because I can relate.\n\n \n\nSecondly, I think the strength and playability of this game DEPEND on changing up decks to deal with different scenerios.  It's what gives the game so much flavor.  Mind you, this is coming from a \"Bilbo\" style player...one that enjoys the story and lore of the game over mechanics and combos. ( Ref: http://www.fantasyflightgames.com/edge_news.asp?eidn=2296 [http://www.fantasyflightgames.com/edge_news.asp?eidn=2296] ).\n\nMy friend and I play each scenerio with pure sphere decks and tweak after a defeat.  It's a long time spent but it's really helped us learn the cards and find combos while playing; we've only been playing for a couple weeks now.  We hit the scenerios blind for the initial discovery and story which we really enjoy.\n\nI should point out that I think attempting to build one deck to pass throught the Mirkwood cycle sounds like quite the fun challenge and really would be an accomplishment.  I think with the release of the Adventure Packs, this may be more of a reality.  Most of all, have fun with it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/?do=findComment&comment=524208","commentId":524208,"userName":"Glaurung","timestamp":1315190247,"content":"For me is quite simple. I always take this kind of games as a sport. I like to play tournaments!!! So for now i have my deck which is build to defeated every scenario.  Gimly/Eowyn/Theodred deck. Quite strong deck 80% OF Wining against 1,2 core set quests, HFG and Carrock. Massing in Osgiliath more difficult to winn 2-3 games from 10 sessions. JTR i still waiting so will se on the next week.\n\nBut back to our theme. I will build my deck according to play tournaments. All other fun is not interesting for me. So still wait for the tournaments system and will decide how i will build up my future decks. I thing maybe we will have some kind of sideboards of heroes and players cards like magic the gathering. Like your sideboard cards include 10 players cards and 3 Other Hereos??? You can change them from game to game??? But i heard rumors on the tournaments we will play against unknow scenario so there is no point change your deck in the firs game. But how many games we will have??? 1 or 2?? 1 game is long enough already???\n\nPrevious Lotr Tcg Decipher didn have any sideboard.  About old  Middle earth ccg i dont know. It was so long time ago i dont remember........ "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52657-one-deck-to-rule-them-all/?do=findComment&comment=524232","commentId":524232,"userName":"ClydeCloggie","timestamp":1315195877,"content":"Play almost exclusively solo, and have beaten Mirkwood, Anduin, Gollum and Carrock with a very similar four-sphere setup. Obviously the deck keeps changing as new cards are released, but the overall principle of 'include a bit of everything and cover all your bases' seems to work well against all those quests. I don't have Rhosgobel and Osgiliath as yet so can't comment on those. And then there's Dol Guldur which is really an odd one out. In solo play I think it needs three heroes from the same sphere with other spheres splashed in through Songs. That's so far removed from what I use in other quests that I don't think I can cover it with the same deck."}]}