{"url":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/","title":"How to beat Dol Guldur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=524352","commentId":524352,"userName":"peterstepon","timestamp":1315219943,"content":"I know that there was a forum about this, but I just tried the 3rd scenario from the core set and got crushed.  I was playing both the tactics and leadership decks out of the box.  Anyone have any suggestions for beating this scenario with 2 decks?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=524374","commentId":524374,"userName":"Bohemond2","timestamp":1315222821,"content":"You will need to start doing some deckbuilding, rather than using starter decks, if you want to beat Dol Goldur with 2 players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=662334","commentId":662334,"userName":"Gaffophone","timestamp":1343032133,"content":"I didn't find how to succeed with this scenario. I want to use only the coreset for 2 players (my wife & me).\n\nIs there someone who succeeded and could tell me with which decks ?\n\nThanks ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=662346","commentId":662346,"userName":"Glaurung","timestamp":1343035526,"content":"If you have onlu core set Dol-Guldor is a challenge. But if you have Some Adv. packs is much more easy. I can even beat it solo with my new deck. Thanks to new Glorifindel.\n\nTry to use in both decks spirit cards to cancel when revealed effect. Lore also very handy(forest snare on Spawn) and draw cards. Also use Miner to discard Caught in the web. Tactic can help with Feint to stop Nazgul for a while and leadership for Gandalf+sneak attack. Something like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=662403","commentId":662403,"userName":"schmoo34","timestamp":1343043315,"content":"Firstly, pick a hero to always be the prisoner.  I know that isn't in the rules, but you have a 1 in 6 chance of that hero being picked and just pretend that you forfeited the 5 times the other heroes were picked and went with this one.  It is necessary if you have any hope of winning.\n\nThat hero needs to be one of your tactics heroes because you can do without legolas or Gimli, etc. in the beginning.\n\nNow for your strategy, you need high willpower.  The reason for it is you want to push through that first stage as quickly as possible so you can rescue the prisoner.  Eowyn is the best at this, but it requires you to go spirit instead of tactics/leadership.\n\nThe leadership deck is challenging for you because they rely heavily on allies and you are limited to only one ally per round being useable.  That is a serious handcuff for you.  I'm not sure I ever beat it with a pure leadership player for that reason.  Although the bonus to willpower cards can be helpful.\n\nGoing back to the willpower thing…you want to finish the first two quests ASAP because the third quest card allows you to use as many allies as you want.  During the first two quests, you can be purchasing them and they will be ready for when you get to the third quest card.\n\nSo my strategy is to willpower as quickly as possible through the first two cards and simply survive until 3B shows up.  Then I unleash my fury and decimate the enemy.\n\nEven with that said, I have a less than 20% success ratio because it is a difficult quest.  As others mentioned, with some of the expansion pack cards and other heroes, I fare much better.\n\nI play with a spirit/lore deck and my son has a tactics deck (all dwarves) and we can win handily if it is one of his heroes captured and I draw fast hitch, light of valinor and unexpected courage quickly.  If those things don't happen, it is a struggle and we might lose.  As mentioned, that equates to around 20% or less success. \n\nWe still play it and enjoy it, though.  The humility factor alone gives me great parenting opportunities as my son gets frustrated.  Lotr gives great opportunities to parent and teach children!  Now when was the last time you heard that about a game?  I bet it was precisely as the designers intended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=662467","commentId":662467,"userName":"Gaffophone","timestamp":1343048996,"content":" Many thanks for your advices !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=668255","commentId":668255,"userName":"Mr Coffee","timestamp":1344010767,"content":"schmoo34 said:\n\n… We still play it and enjoy it, though.  The humility factor alone gives me great parenting opportunities as my son gets frustrated.  Lotr gives great opportunities to parent and teach children!  …\n\n\n\nThis was my favorite part of your post!  As a \"gamer with kids\", I definitely want to be able to get them into playing as they get old enough (6 years and 5 months old means I have a while to wait… lol), but I appreciate your ability to use a fun game as a teaching tool…  Too many of our kids are being raised with a \"everything should be fair\" mentaility in a world where real life and its gorey mess is ignored…  Thanks for the post!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=668259","commentId":668259,"userName":"booored","timestamp":1344011213,"content":"The trick to Dol Guldur is in hero selection. As Glaurung said you need spirit and lore as your main core decks. Tactics is very weak in the starter set.. and in honesty it has been a LONG time from when I played any restricted card sets.\n\nStill the trick is in Hero choice. You need to not choose heroes that are your only mana base. For a two p[lay core game I would go with 3xlore and 3xSpirt in two decks. This way no matter who gets nabbed your mana base is completely stable.\n\nAgain it is hard to advise as you have only the bare minimal card selection.. Still making mono sphere choices greatly aids this quest as the heroes getting nabbed do not really effect the game to much.\n\nThis quest is very beatable nowdays with the modern card pool.\n\nschmoo34 said:\n\nFirstly, pick a hero to always be the prisoner.  I know that isn't in the rules, but you have a 1 in 6 chance of that hero being picked and just pretend that you forfeited the 5 times the other heroes were picked and went with this one.  It is necessary if you have any hope of winning.\n\nWhile I agree that as this game is not competitive.. just do what you like… I think that the guy came her for advice on how to beat it with the official rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=668284","commentId":668284,"userName":"schmoo34","timestamp":1344014733,"content":"booored said:\n\nThe trick to Dol Guldur is in hero selection. As Glaurung said you need spirit and lore as your main core decks. Tactics is very weak in the starter set.. and in honesty it has been a LONG time from when I played any restricted card sets.\n\nStill the trick is in Hero choice. You need to not choose heroes that are your only mana base. For a two p[lay core game I would go with 3xlore and 3xSpirt in two decks. This way no matter who gets nabbed your mana base is completely stable.\n\nAgain it is hard to advise as you have only the bare minimal card selection.. Still making mono sphere choices greatly aids this quest as the heroes getting nabbed do not really effect the game to much.\n\nThis quest is very beatable nowdays with the modern card pool.\n\nschmoo34 said:\n\nFirstly, pick a hero to always be the prisoner.  I know that isn't in the rules, but you have a 1 in 6 chance of that hero being picked and just pretend that you forfeited the 5 times the other heroes were picked and went with this one.  It is necessary if you have any hope of winning.\n\n \n\nWhile I agree that as this game is not competitive.. just do what you like… I think that the guy came her for advice on how to beat it with the official rules.\n\n\n\n \n\nHe also came here to learn how to beat it with a tactics deck so we both took liberties in our response!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=668664","commentId":668664,"userName":"GrandSpleen","timestamp":1344116126,"content":"schmoo34 said:\n\nDuring the first two quests, you can be purchasing them and they will be ready for when you get to the third quest card\n\n\nI'm not sure I understand your meaning here… you can only play (\"purchase\") one ally per round on the first two cards, right?  \n\nI have been having just awful luck with this quest.  I've beaten it twice before with 2 players, but that was before I started logging our quests.  Now that I am logging, I want to get at least 1 win in the log for every quest I own… we've tried 7 times and failed every time, yuck!  We started with tactics/lore and spirit/leadership mixed decks, then switched to single-color decks to deal with the resource problem when a hero is captive.  We tried pure spirit and pure tactics (eagle deck with Radagast to help with resources), then switched to pure spirit and pure lore.  We got pretty close today but hit 50 threat on the 3rd card.\n\nThe main problem is dealing with the first 3 cards that come up when during setup.  And Ungoliant's Spawn keeps coming out in the early rounds.   Our card base includes the core set and all APs in the Mirkwood Cycle.  I wonder if this would be much easier if we had a bunch of cards from Dwarrowdelf.\n\nI'm gonna beat this again, without choosing the captive!!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52707-how-to-beat-dol-guldur/?do=findComment&comment=668685","commentId":668685,"userName":"schmoo34","timestamp":1344125988,"content":"GrandSpleen said:\n\nschmoo34 said:\n\nDuring the first two quests, you can be purchasing them and they will be ready for when you get to the third quest card\n \n\n \n\nI'm not sure I understand your meaning here… you can only play (\"purchase\") one ally per round on the first two cards, right?  \n\nI have been having just awful luck with this quest.  I've beaten it twice before with 2 players, but that was before I started logging our quests.  Now that I am logging, I want to get at least 1 win in the log for every quest I own… we've tried 7 times and failed every time, yuck!  We started with tactics/lore and spirit/leadership mixed decks, then switched to single-color decks to deal with the resource problem when a hero is captive.  We tried pure spirit and pure tactics (eagle deck with Radagast to help with resources), then switched to pure spirit and pure lore.  We got pretty close today but hit 50 threat on the 3rd card.\n\nThe main problem is dealing with the first 3 cards that come up when during setup.  And Ungoliant's Spawn keeps coming out in the early rounds.   Our card base includes the core set and all APs in the Mirkwood Cycle.  I wonder if this would be much easier if we had a bunch of cards from Dwarrowdelf.\n\nI'm gonna beat this again, without choosing the captive!!  \n\n\n\n \n\nI was meaning that once you get to the third quest, (yes you can only buy one ally per round but you can save resources and buy a bunch when you get to that point…if you get to that point).\n\n \n\nI never beat Dol Goldur until I got the Darrowdelf cards.  The dwarven items helped me to win with an all dwarf deck and Glorfindel and Loragorn are both helpful along with the many cards that pair with them.\n\n \n\nI don't proclaim expertise on the quest…and to restrict yourself to all tactics or leadership is indeed tough.  I've done it with an all dwarf (tactics, leadership mix)  Dain Ironfoot, Gimli and Gloin with Gloin captured.  Was able to get Dunedain cards to help with willpower and some allies to help.  It is still very tough.  Easier with two players as you mentioned.  I also dabbled with having Legolas and Dwalin and Dain.  The idea was when you kill an orc, you progress by two on the quest and lower threat at the same time.  This buys you time to win without going over 50 threat.    When you solo, though, it is very difficult to both quest and attack/defend with just two heroes and only one ally per round.  Feint cards, gondorian spearmen…whatever you can do to deflect and stay alive.  I don't enjoy it as much solo as I do when I play two players.  Just a few months ago, I was learning the game and I am glad that I perservered but I don't have a formula for success on that quest that gives more than 20-30% win rate."}]}