{"url":"https://community.fantasyflightgames.com/topic/52766-hunters-from-mordor-shadow-effect/","title":"Hunters from Mordor - shadow effect","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52766-hunters-from-mordor-shadow-effect/?do=findComment&comment=524852","commentId":524852,"userName":"Nerdmeister","timestamp":1315327036,"content":"Had a discussion in our gaming group tonight. The shadow effect states that all heroes with a clue card attached takes 1 damage (if blocked), which in turn removes the clue card back to the encounter deck.\n\nWe got the hunters as a shadow card just after 2 of us had claimed a clue each (of course :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]). One of my friends then say it can´t be all heroes in play and that shadow effects only affect the player being attacked. Usually I´d say that is the case but the wording on the card imo should have been all your heroes.\n\nLong debate ensues and we decided to find out which answer people on this forum prefer.\n\nAny and all thoughts will be appreciated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52766-hunters-from-mordor-shadow-effect/?do=findComment&comment=524890","commentId":524890,"userName":"Titan","timestamp":1315331001,"content":"In my opinion, it would be every hero that has a clue card, not just the defending player's hero. The sole condition for the damage to be dealt is that a hero must have a clue card attached. That's it, no other specifications are made and no difference is made between a defending player's hero or another player's hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52766-hunters-from-mordor-shadow-effect/?do=findComment&comment=524931","commentId":524931,"userName":"Bohemond2","timestamp":1315335587,"content":"A journey to Rhosgobel has several shadow effects that hurt all players.  Such effects are one of the best ways to ensure proper scalability of the game.  The shadow effect of Hunters most certainaly wounds all heroes who have a clue, not just those controlled by the defending player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52766-hunters-from-mordor-shadow-effect/?do=findComment&comment=524985","commentId":524985,"userName":"radiskull","timestamp":1315345045,"content":" It is absolutely every hero with a Clue card attached, regardless of control.  There are MANY shadow cards that say \"do X to the defending player\".  The game makes this distinction often.  Saying that shadow cards only affect the defending player by default is, sadly, wishful thinking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52766-hunters-from-mordor-shadow-effect/?do=findComment&comment=527146","commentId":527146,"userName":"jhaelen","timestamp":1315834710,"content":"radiskull said:\n\nSaying that shadow cards only affect the defending player by default is, sadly, wishful thinking.\n\n\n\nYep. Even in the core set there are shadow effects affecting other characters, e.g. the one that requires you to exhaust a character."}]}