{"url":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/","title":"Radagast and resources","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=524850","commentId":524850,"userName":"player1994700","timestamp":1315326030,"content":"Okay, so we all know that Radagast collects 1 resource during the resource phase. However, can you use his resources to pay for any color (sphere) of card?\n\nNOTE\n\nThe text reads: \"These resources can be used to pay for Creature cards from your hand.\"\n\nThe wording is throwing me off. It says can, but does not mention anything about only being used towards the cost of creature cards. If his resources are not only (or exclusively) for creatures then I should be able to use them for events, attachments, and such. Right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=524853","commentId":524853,"userName":"Melkor","timestamp":1315327041,"content":"I think the word can is used because you may choice to use this resource in two way: to pay for creature card or to heal a creature"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=524863","commentId":524863,"userName":"Svenn","timestamp":1315328185,"content":"I think these can ONLY be used to pay for Creatures, not other cards. Radagast is an ally and ally cards do not normally collect resources nor do the rules say that you can spend resources from an ally to pay for any cards. In this case the card is specifically allowing you to play Creature cards and pay for it with resources on this ally, instead of from a Hero like usual."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=524898","commentId":524898,"userName":"Titan","timestamp":1315332016,"content":" He can only pay for creature cards, not anything else. Radagast is a card that is governed by the Golden Rule because he goes against the game's normal rules for allies. However, when doing so, a card's text must be very specific in how it differs from those rules. If it does not specifically say so in the text, then it can be assumed that it cannot be done as per game rules. In Radagast's case, his text only specifies creature cards played from hand, therefore that's all he can do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=527144","commentId":527144,"userName":"jhaelen","timestamp":1315834405,"content":"derrstar said:\n\nIf his resources are not only (or exclusively) for creatures then I should be able to use them for events, attachments, and such. Right?\n\n\n\nCheck the rules. Playing cards requires matching spheres, even if the cost is zero. Since Radagast doesn't have a sphere, the only argument that could be made is that he might be able to use his resources to pay for neutral cards. I doubt it, though, since he's not a hero. instead of 'can' the card text should probably say 'can only'."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=527173","commentId":527173,"userName":"radiskull","timestamp":1315838675,"content":"There is an identical thread on this topic already. Here's my reply from that other thread:\n\nI believe that the phrase \"These resources can be used to to pay ...\" means that instead of being unable to use non-matching resources (as is normally the case), you can use these neutral resources to pay for Creature cards, regardless of sphere.\n\n \n\nUsually allies cannot use their resources (if they have any, like Grimbeorn) to play any cards.  Radagast can."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532452","commentId":532452,"userName":"jhaelen","timestamp":1316846295,"content":"radiskull said:\n\nThere is an identical thread on this topic already. Here's my reply from that other thread:\n\nI believe that the phrase \"These resources can be used to to pay ...\" means that instead of being unable to use non-matching resources (as is normally the case), you can use these neutral resources to pay for Creature cards, regardless of sphere.\n\n \n\nYup, and you're as wrong here as you are in the other thread gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532491","commentId":532491,"userName":"player582283","timestamp":1316859157,"content":"It's pretty clear to me that Radagast can only pay for creature allies.  The rules state that heroes' resources pay for cards on page 12 under planning (in a couple places).  Radagast breaks the rule...for creature allies per his card.  Where's the ambiguity?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532496","commentId":532496,"userName":"radiskull","timestamp":1316860300,"content":"jhaelen said:\n\n\nYup, and you're as wrong here as you are in the other thread gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n \n\n \n\n \n\n \n\nNice well-reasoned argument there, refuting what seems to be the general consensus.  Your argument makes Radagast useless, especially in Rhosgobel, the pack where he was introduced.  I doubt that outcome very much.\n\n \n\nI did check the rules, as per your suggestion, however.  Resource match is a concept that applies to heroes' resources.  I choose to believe that Radagast's first ability was intended to be usable in the current card pool.  We have here a case where a card's ability does something not normally possible within the rules.  This happens all the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532502","commentId":532502,"userName":"Svenn","timestamp":1316862801,"content":"Why do people try to grasp at things that aren't there?\n\nRadagast gains resources. Radagast can use his resources to pay for creatures. It doesn't say neutral creatures. It doesn't say creatures of a specific sphere. It says creatures. This is a very simple card. Allies do not normally collect or spend resources, so you follow what the card allows you to do. The card tells you to give one resource a turn to this ally card. It then says that this ally card can pay for creatures. It doesn't say it can pay for anything else.\n\nRadagast was an Istari that became obsessed with animals, so this fits his character as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532504","commentId":532504,"userName":"player582283","timestamp":1316863141,"content":"Regarding Radagast and his ability to pay for creatures if you don't have a hero of their sphere, I sent an email to FFG and received this response from Nate French. \n\nYes. Radagast's ability allows his resources to pay for Creatures\nwithout a resource match. (Since he has no sphere icon, he'll never\nhave a match.) There is no need to have a hero with the same icon as a\nCreature being payed for with Radagast's resources.\n\n \n\nNate French\nSenior Game Designer\nFantasy Flight Games\nnfrench@fantasyflightgames.com\n\nI'd say Nate gets the final word!  By the way, he responded very promptly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532511","commentId":532511,"userName":"Kiwina","timestamp":1316864193,"content":"jhaelen said:\n\n\nderrstar said:\n\n \n\nIf his resources are not only (or exclusively) for creatures then I should be able to use them for events, attachments, and such. Right?\n\nCheck the rules. Playing cards requires matching spheres, even if the cost is zero. Since Radagast doesn't have a sphere, the only argument that could be made is that he might be able to use his resources to pay for neutral cards. I doubt it, though, since he's not a hero. instead of 'can' the card text should probably say 'can only'.\n\n \n\njhaelen said:\n\n \n\nradiskull said:\n\n \n\nThere is an identical thread on this topic already. Here's my reply from that other thread:\n\nI believe that the phrase \"These resources can be used to to pay ...\" means that instead of being unable to use non-matching resources (as is normally the case), you can use these neutral resources to pay for Creature cards, regardless of sphere.\n\n \n\nYup, and you're as wrong here as you are in the other thread gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n \n\n \n\nI don't see much difference in these two arguments.  It sounds like both say Radagast has resources that, if they are used to pay for a card, are only able to pay for a creature card.\n\nMelkor said:\n\n\nI think the word can is used because you may choice to use this resource in two way: to pay for creature card or to heal a creature\n\n \n\n \n\n \n\nI think Melkor is close to the bullseye with his answer.  The card doesn't say the resources can only be used to pay for creature cards, because the resources can be used for something else.  The resources can also be used to heal a creature.  As a side note, I think Radagast can use his resources to play an event or attachment provided said card has the creature trait, because his card doesn't say anything about being exclusively for allies just creatures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532517","commentId":532517,"userName":"radiskull","timestamp":1316864921,"content":" Well, that settles that!\n\nI think the difference in argument was whether Radagast could pay for neutral creatures only, or if he could pay for all of them.  But it turns out that I was just as right in this thread as I was in the other. :-P\n\n \n\nI also agree that if a Creature event (or attachment or whatever) existed, Radagast could pay for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=532529","commentId":532529,"userName":"player582283","timestamp":1316865899,"content":"Yes, I fully agree that Radagast can pay for any cards that we see with the creature trait.  Sorry - I think I misunderstood the point of the OP."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52765-radagast-and-resources/?do=findComment&comment=533055","commentId":533055,"userName":"jhaelen","timestamp":1317005559,"content":"Woz said:\n\nSorry - I think I misunderstood the point of the OP.\n\n\n\nAnd I guess I misread radiskull's post. Of course Radagast doesn't have to match resources for Creature cards.\n\nThe OP's point was a completely different one, though: The OP suggested you could use Radagast to pay for all kinds of cards, regardless of their sphere."}]}