{"url":"https://community.fantasyflightgames.com/topic/52775-deckbuilding-conundrum/","title":"Deckbuilding conundrum","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52775-deckbuilding-conundrum/?do=findComment&comment=524933","commentId":524933,"userName":"DrNate","timestamp":1315335823,"content":"I just pieced together a Leadership/Spirit deck that I believe will be pretty successful in play. This one feels like it has a real chance of contributing to victory in almost any scenario. However, it feels like it is against the spirit of the decks I usually make for the game.  I usually like to pick cards based on a character, race or affiliation that I like: Eagles, Rohan, Dwarves, Beornings. Even something silly like \"That guy has bees! He should be in my deck!\" or \"He took the time to grow that long beard, the least I can do is let him join the quest.\"\n\nMy question is: how obligated should I feel to my teammate(s)? Do I need to play an optimal deck that is less fun for the satisfaction of beating the scenarios? How do you weigh the two factors against each other?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52775-deckbuilding-conundrum/?do=findComment&comment=524943","commentId":524943,"userName":"dbeman","timestamp":1315338423,"content":"With any game, I typically try to find a balance between the two. On one hand you want to play with characters that you enjoy or, at the very least, not play with characters that you don't like. On the other hand the whole point of a cooperative game is to, well, cooperate with your fellow players to beat the game.\n\nAs long as a card plays well with the rest of your deck it should be fairly easy to justify its inclusion.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52775-deckbuilding-conundrum/?do=findComment&comment=525315","commentId":525315,"userName":"qwertyuiop","timestamp":1315415660,"content":"As long as your Lore/Tactics deck gives your teammate a lot of stuff to do, you should be fine :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}