{"url":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/","title":"Building the Encounter Deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/?do=findComment&comment=525228","commentId":525228,"userName":"qkershner","timestamp":1315400998,"content":"I've got 4 sets of the Core Set (in order to build all of the deck combinations) and realized that there doesn't appear to be a clarification on the number of cards that go into the Encounter Deck.  I know I match symbols, but how many of each individual card go into the Encounter Deck?  Player Decks are 50/3.  Does Encounter Decks follow the same rule?  Do I ignore all of the extra encounter cards I have, and just play as though I only have a single set of encounter cards, but more of the others?\n\nSecondly, has anyone tried to 'tweak' the encounter decks by adjusting the quantities?  For example, in the Passage Through Murkwood scenario, I've played with the list to be heavy goblins (3/card max), as well as a deck with stronger spider themes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/?do=findComment&comment=525229","commentId":525229,"userName":"Svenn","timestamp":1315401203,"content":"The encounter deck should be played with the cards from a single core set. You should not mix multiple sets in together. They are specifically balanced for the quantity in a single set.\n\nThe best thing to do is use the multiple sets to build each quest deck so you don't have to pull from one quest deck to run another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/?do=findComment&comment=525242","commentId":525242,"userName":"qkershner","timestamp":1315402779,"content":"THAT is an awesome idea.  Hadn't thought of that.\n\nOf course, the more chapter packs that come out, the more Core sets I'll need.\n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/?do=findComment&comment=528158","commentId":528158,"userName":"player1652207","timestamp":1316028380,"content":" I am also wondering if the encounter decks are subject to the 3 card max rule for cards, as it is not described anywhere in the rulebook.\n\nAnyone have an answer for this? Are 4+ cards of the same type allowed in encounter decks?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/?do=findComment&comment=528164","commentId":528164,"userName":"Svenn","timestamp":1316028769,"content":"Any number of cards are allowed in Encounter decks, they are custom built by FFG. I don't know that they'd necessarily put more than 3 of a card in an Encounter deck, but if they did that's how it should be played. Basically, play it as it came in a single box. It's not meant to be customized and modified, or combined in the case of multiple copies of the same sets."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/?do=findComment&comment=528205","commentId":528205,"userName":"ricedwlit","timestamp":1316034615,"content":" To back up the point of \"any number of cards\": Return to Rhosgobel has four copies of the Athelas card.  I wouldn't want to play with fewer!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52802-building-the-encounter-deck/?do=findComment&comment=528298","commentId":528298,"userName":"Glaurung","timestamp":1316054736,"content":"Yes lot of examples::: Hunters from Mordor 5 copies in HFG. Some spiders also 4 copies in core set first quest. somewhere you can find a list of encounter sets orders."}]}