{"url":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/","title":"Spirit/Lore Tactic for Rhosgobel ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/?do=findComment&comment=525270","commentId":525270,"userName":"wraith428","timestamp":1315407997,"content":"Tried this recently and found it effective... but figured I'd see if I'd done anything wrong.\n\n \n\nSpirit/Lore Deck (Eleanor/Beravor/Glorfindel) - Main Idea is to use Northern Tracker to take out Rhosgobel during the first phase of the quest and post pone heading to stage 2 until you can rush it and have Wilyador healed.\n\n \n\nNorther Tracker takes out Rhosgobel\n\nDaughter of the Nimrodel, Lore of Imladris and Radagast heal Wilyador\n\nEleanor takes out treachery cards\n\nBeravor draws cards\n\nHasty Stroke takes out Shadow Cards\n\nThe Galadhrim's Greeting keeps threat down\n\nDwarven Tomb Brings back Hasty Stroke or The Galadhrim's Greeting as needed.\n\nHenemarth Riversong let's you know what's coming so you can manipulate how you deal with Phase 1\n\nHaldir of Lorien and Gandalf Deal with annoying Enemies that can only be hit with Ranged or Eagles.\n\n \n\nThat's the gist... there is a leadership splash with Song of Kings, Rivendell Minstrel, Steward of Gondor and Sneak Attack.\n\n \n\nAnyways... unlike Carrock which specifically says its immune to card effects Rhosgobel doesn't.  This seems like an effective tactic.  It tough though .  You need to get a Northern tracker out quick and pick up some healing cause Wilyador will be in bad shape by the time you scout out Rhosgobel, but once Rhosgobel is out of the picture you can heal up Wilyador and prepare for your assault on Phase 2. \n\n \n\nWraith428"},{"commentUrl":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/?do=findComment&comment=525278","commentId":525278,"userName":"Bohemond2","timestamp":1315409179,"content":"Unless I am missing something, it takes at least 7 turns for this combination to remove Rhosgobel, more if you have to play Hasty Stroke or Test of Will. So, minimum 14 damage on Wilyador. That would seem to give you a relatively small margin for error, with the abundance of treachery and shadow cards that can damage the eagle.\n\nIf you want to make this strategy work, maybe mixing in snowborn scouts and ways to replay them (sneak attack, born aloft, stand and fight) would make your plan work a bit faster.\n \n\nedit: whoops, missed your plan to splash kings and get steward out.  So, possibly faster than 7 turns, but with most draws, probably not much faster.  But, you already have kings!  Start throwing in those scouts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/?do=findComment&comment=525406","commentId":525406,"userName":"Kiwina","timestamp":1315431164,"content":"Daughter of Nimrodel can only heal Heroes, and Wilyador is an ally, so they won't help him much.  Overall it's an interesting strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/?do=findComment&comment=525585","commentId":525585,"userName":"lleimmoen","timestamp":1315478077,"content":"Eleanor is certainly the hero to go with in Rhosgobel. Unlike elsewhere where the next card can likely be even worse than the treachery she cancels, here you want to go through the deck faster to get to Forest Grove and Athelas.\n\nGreat thinking about getting rid of Rhosgobel without travelling there. Then Radagast certainly would be more worth it. Beside Northern Tracker, Snowbourn Scout is certainly a help - with Borne Aloft especially. But it may be hard to fit all the cards into a deck (or even two) effectively. You do need eagles and Haldir here, well it is not required but it is certainly good and fun. Haldir is super good here as he is surely the best ranged defender we have seen thus far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/?do=findComment&comment=525654","commentId":525654,"userName":"wraith428","timestamp":1315488261,"content":"Doh... I think I've been playing Daughter of the Nimrodel wrong since the beginning.\n\n \n\n****... that shoots the viability of this concept out the window.  Even with a Radagast and Glorfindel combined that's only negating two damage a turn (you might get an innitial heal boost early on from Radagast but after that he gets 1 resource per round.\n\n \n\nSo the only things that can heal Wilyandor are Glorfindel, Radagast and Lore of Imladri?  Is there anything else beside Athelas?\n\n \n\nI suppose you could use Parting Gift from Leadership to pump Radagast up so do some healing?\n\n \n\nWraith428\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/?do=findComment&comment=525721","commentId":525721,"userName":"lleimmoen","timestamp":1315496942,"content":"No, you cannot use Parting Gifts to move resources to Radagast who is not a hero.\n\nLore of Imladris is your best healing card here. I played it some when the game was released, then I neglected it for a long time as I adopted Daughter of the Nimrodel or Self Preservation in a combo with Gloin. For a while I was thinking of reintroducing Lore of Imladris to a deck with Glorfindel and yesterday, as I finally got a Journey to Rhosgobel, I did indeed without doubt included it in the deck. It is a very nice card for this quest but I am sure it can be used elsewhere.\n\nAltogether I find Glorfindel Eleanor Legolas to be the best trio for this quest - probably not solo but as a supporting deck surely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/52811-spiritlore-tactic-for-rhosgobel/?do=findComment&comment=525732","commentId":525732,"userName":"wraith428","timestamp":1315498975,"content":"I apparently need to pay more attention to card text invoking heroes and allies!\n\n \n\nAlright this quest was already brutal when I was playing it wrong.  Now its doubly so.  Best case scenario for this concept now involves using the Northern Tracker and Snowbourn Scout to take out Rhosgobel in phase 1.  Use Glorfindel and Radagast to heal the two damage Wilyandor takes at the end of each turn and hope to pick up Lore of Imladri to go some larger healing to make up for the bonus damage Wilyandor will take from shadow and treachery cards that I'm not able to cancel.  All the while I try to stay in phase 1 where healing doesn't discard my cards from the game while I search out all four Athelas.\n\n \n\nCould still work but its sounds like a hell of a slog.\n\n \n\nWill try again tonight playing correctly this time I hope.  Thanks for the tips and corrections.\n\n \n\nWraith428\n\n \n\n "}]}