{"url":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/","title":"question about ad. packs difficulty","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527252","commentId":527252,"userName":"richsabre","timestamp":1315853552,"content":"will FFG continue to make adventure packs and quests that are easier and/or more aimed at solo play? i would hate for them to keep putting out level 7/8 quests that are way too hard for solo\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527254","commentId":527254,"userName":"Dwnhmcntryboy","timestamp":1315854295,"content":" They will be doing more without a doubt. But what you are seeing is also what has been asked for. A lot of players wanted harder quests. I am a medium skilled player so I like all of them. I cannot wait to get a hold of the GenCon mission previewed. lvl 9 challenge is awesome!\n\nSpeaking of...any news on The Massing at Osgiliath's PoD date? Or anyone wanna sell me their GenCon copygran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527271","commentId":527271,"userName":"TheLightdarker","timestamp":1315856678,"content":"I would imagine that the scenarios will tend to become progressively harder as more are released, in attempt to keep players challenged and therefore interested in, playing and purchasing the game.  I don't think that they would become dramatically harder (except for maybe the final adventure pack in a series of six), as that might discourage players from continuing to buy and play the remaining adventure packs in that series yet to be released.\n\nI would think (and hope), that the print on demand scenarios will tend to be more difficult than the typical monthly releases, too, as in many ways they appeal to a smaller, potentially more \"hardcore\" audience, whom are probably the same people that call for much more challenging adventures to play (since print on demand releases are entirely optional purchases and you don't miss out on part of the cycle \"story arc\" if you don't pick up a copy, it wouldn't be so hurtful to players' pride or whatever you want to call it if they can't beat it).  As the card pool expands, the players will have more options for deck building than ever before, will have more potent cards and combos at their disposal, and will be more capable of tackling more difficult quests, etc.\n\nWhat I'm really curious about, though, is how far in advance FFG has designed future adventure packs and deluxe expansions.  For example, did they have the Khazad-Dum cards all designed and ready to print when the Core set was released, or did they have a few months or more to consider player feedback from the Core set before everything was finalized?  Are all six of the dwarrowdelf adventure packs already designed and finalized, or is there any room for FFG to change things up to make things harder/easier depending on how the community responds to the remaining releases in Shadows of Mirkwood?  I'm very curious as to what kind of \"delay\" there is or will be before FFG can really attempt to integrate player feedback into their game design."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527278","commentId":527278,"userName":"Dwnhmcntryboy","timestamp":1315858376,"content":" Coming from personal Design experience you can usually figure that for however long a saga is twice that time has gone into planning R&D.  Figure that the Next arc is in the last 6 months of tweaks and well on the way to being shipped to the printer. Our test team was working on 3-4 projects at a time just to keep things fresh and combat burnout.\n\nI don't know about FFG though they have a ton on their plate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527279","commentId":527279,"userName":"DurinIII","timestamp":1315858681,"content":" I agree richsabre. For Solo play most of the quests now available are freaking hard!!!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527290","commentId":527290,"userName":"marlow4","timestamp":1315860958,"content":"Maybe one of the three quests in K. Dum will be low difficulty (1-3) to give a gradual increase in danger through those three scenarios?\n\nThen again, we may never see a difficulty 1 scenario again since Passage was designed as an introduction to the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527343","commentId":527343,"userName":"Glaurung","timestamp":1315870761,"content":"What happen with you guys???? Game is hard for solo???? Step by step with rule changed, with card erratas , with new quests coming they start to make game not so easy as before.All the adventures under difficult 5 is piece of cake!!!! We cannot back to 1 or 3 level quest. Game is still to easy!!!!\n\nJust play more, sharp your game skill and you will see the game is still so easy if you are expert player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527353","commentId":527353,"userName":"marlow4","timestamp":1315874501,"content":"Glaurung said:\n\nWhat happen with you guys???? Game is hard for solo???? Step by step with rule changed, with card erratas , with new quests coming they start to make game not so easy as before.All the adventures under difficult 5 is piece of cake!!!! We cannot back to 1 or 3 level quest. Game is still to easy!!!!\n\nJust play more, sharp your game skill and you will see the game is still so easy if you are expert player.\n\n\n\nGlaur, Glaur, Glaur...\n\nWhat are we going to do with you?\n\nHere's how I picture Glaur's keys to victory:\n\n * Step 1 - Buy three core sets.\n * Step 2 - Draw five cards instead of one each resource phase.\n * Step 3 - Shadow cards count against enemies instead.\n * Step 4 - No need for step 4, game is too easy.\n\nGlaur, I want you to acquire a video camera of some kind and film one of your play sessions and post it online. That way the rest of us can take notes and reach the next level of play and we'll stop holding the game back. Maybe they can use your expert level video to replace the LOTR demo video.\n\n;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527376","commentId":527376,"userName":"Glaurung","timestamp":1315880692,"content":"Marlow said:\n\nGlaurung said:\n\n \n\nWhat happen with you guys???? Game is hard for solo???? Step by step with rule changed, with card erratas , with new quests coming they start to make game not so easy as before.All the adventures under difficult 5 is piece of cake!!!! We cannot back to 1 or 3 level quest. Game is still to easy!!!!\n\nJust play more, sharp your game skill and you will see the game is still so easy if you are expert player.\n\n \n\n \n\nGlaur, Glaur, Glaur...\n\nWhat are we going to do with you?\n\nHere's how I picture Glaur's keys to victory:\n\n * Step 1 - Buy three core sets.\n * Step 2 - Draw five cards instead of one each resource phase.\n * Step 3 - Shadow cards count against enemies instead.\n * Step 4 - No need for step 4, game is too easy.\n\nGlaur, I want you to acquire a video camera of some kind and film one of your play sessions and post it online. That way the rest of us can take notes and reach the next level of play and we'll stop holding the game back. Maybe they can use your expert level video to replace the LOTR demo video.\n\n;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n\n\nYes make video is good idea. I want to do it long time already. Actually about the rules...... But can put some session as well.\n\nBut the game is really easy. Massing in Osgiliath yes this one is ok. Difficult 9. Difficult 6 or 7 or even 5 is ok. But go down to 4 or 3??? For what??\n\nTell me how many games you lose against HFG????? Almost impossible to lose.  And we never ever lose any 2 player game until Yesterday.\n\nBut im happy. We lose our first 2 player session ever for 4 months. Carrock!!!! We lose the game yesterday!!! We was happy!!!! And now when me and my friends start to feel game is going to right level  many people complain is to difficult???? Please no!!!! For us the game just come to the right level.\n\nI promise to make my video sure!!! With my session and some rules question and my conclusion.\n\nP.S.  Stand in fight errata is really good. Make game more difficult!!!!!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527407","commentId":527407,"userName":"Dam the Man","timestamp":1315888428,"content":"Glaurung said:\n\nTell me how many games you lose against HFG????? Almost impossible to lose.  And we never ever lose any 2 player game until Yesterday.\n\n\n\nI'm 0-1 vs HFG. Leadership/Tactics (Aragorn, Theodred, Legolas) and Spirit/Lore (Eleanor, Dunhere, Beravor) decks. Barely made it to stage 2, then had about 6+ locations in the staging area, including Old Ford at nifty 8 threat. Northern Trackers, despite Beravor, were nowhere to be seen. End came when we drew 3 Clues and Hunters from Mordor as guards for the first two, threat in staging area passed 25. Threat reduction doesn't really help when you're not getting any progress tokens and keep losing your Clues.\n\nI have four decks, those two above, then Tactics/Spirit (Gimli, Thalin, Eowyn) and Lore/Leadership (Denethor, Glorfindel, Gloin). From two Core Sets, this puts into use all 12 Heroes and most of the useful cards. 2x Gandalf each deck, Spirit decks have the rest of the threat reduction and Northern Trackers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527422","commentId":527422,"userName":"richsabre","timestamp":1315891421,"content":"yes i cant understand how it is way too easy- ive been playing since the games release, very regularly, i know the rules pretty much inside out,  i spend time building a deck, and i still cant beat HFG, CAC, dol guldor, and even anduin!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527425","commentId":527425,"userName":"Glaurung","timestamp":1315892436,"content":"richsabre said:\n\nyes i cant understand how it is way too easy- ive been playing since the games release, very regularly, i know the rules pretty much inside out,  i spend time building a deck, and i still cant beat HFG, CAC, dol guldor, and even anduin!\n\n\n\nYou can beat Dol-Guldor solo??? Cool!!! I cannot do that with my deck. I think you need to build up kind of specific deck against this quest ???\n\ni dont really after that. I like to build up the deck against all scenarios but Dol guldor for me impossible solo. But 2 player Dol-Guldor game we never lose!!!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527427","commentId":527427,"userName":"Glaurung","timestamp":1315892841,"content":"richsabre said:\n\nyes i cant understand how it is way too easy- ive been playing since the games release, very regularly, i know the rules pretty much inside out,  i spend time building a deck, and i still cant beat HFG, CAC, dol guldor, and even anduin!\n\n\n\nUps sorry  you set cant beat.\n\nTry this deck. This deck can beat all quest mostly of the time but not Dol guldor.\n\nI make this deck in june. Since this time is most strongers deck in my collection. Some lore deck more stable but is boring for me to play them.\n\nTotal Cards (50)\n\nHero (3)\nEowyn (Core) x1\nGimli (Core) x1\nTheodred (Core) x1\n\nAlly (11)\nFaramir (Core) x2\nGandalf (Core) x3\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\n\nAttachment (14)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDwarven Axe (Core) x3\nSteward of Gondor (Core) x3\nUnexpected Courage (Core) x3\n\nEvent (25)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nValiant Sacrifice (Core) x2\nHasty Stroke (Core) x3\n\nAfter Stand and Fight Errata maybe you need to change them for Born aloft or something....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527430","commentId":527430,"userName":"ClydeCloggie","timestamp":1315893975,"content":"richsabre said:\n\nyes i cant understand how it is way too easy- ive been playing since the games release, very regularly, i know the rules pretty much inside out,  i spend time building a deck, and i still cant beat HFG, CAC, dol guldor, and even anduin!\n\n\n\nDol Guldur is close to impossible solo. Some have done it being very lucky & choosing their own prisoner & playing a ridiculous amount of games. The best way to tackle it is probably with a mono-sphere deck and we'll have to wait until the end of the Mirkwood cycle or beyond before those become really viable.\n\n \n\nAnduin is hit and miss solo for me, the Troll being the obvious obstacle. I probably have about a 30% win ratio on that one. It's actually a pretty hard quest, given that it needs combat strength early on, then lots of willpower, then combat strength again. Covering all those bases in a solo deck isn't easy, but can be done. Spirit/Tactics being a good combination for a deck. I even won a game where stage 2 of the quest took me absolute ages (13 turns!), but it was worth it as it did allow me to take out enemies one by one with Legolas while Frodo, Eowyn and Northern Trackers hung in there exploring location after location. Great epic game to win in the end.\n\n \n\nI have few problems with Gollum and Carrock, after the initial games getting to know the Quests I can consistently beat those two scenarios. In a way they're similar as you have to be patient (much unlike Anduin and Dol Guldur, where there's a huge moutnain to climb on stage 1).\n\n \n\nIn Gollum, try to get rid of the Hunters before collecting Clues. I find that having 2 Clues in play is optimal: you have a buffer in case the Clue discard Shadow effects come up, but you're not boosting the Hunters to impossible heights. I also find that it works well to race through stage 1 and then take it slow on stage 2, as revealing encounter cards first up rather than after questing makes planning the round easier. \n\n \n\nWith Carrock it's even more obvious that you don't run into the Trolls with just a few heroes. Get allies first, and carefully manage your questing so you don't progress too quickly but also don't gain too much threat. Denethor and Henamarth work well in this one.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527438","commentId":527438,"userName":"richsabre","timestamp":1315895662,"content":"ok thanks for the advice, ive just played gollum and flew through 1b, and most of 2b, then got hit by 2 eastern crows- so crows, surge, crows, surge, clue card, guarded surge, then hunters from mordor! ouch!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527442","commentId":527442,"userName":"ClydeCloggie","timestamp":1315897227,"content":"richsabre said:\n\nok thanks for the advice, ive just played gollum and flew through 1b, and most of 2b, then got hit by 2 eastern crows- so crows, surge, crows, surge, clue card, guarded surge, then hunters from mordor! ouch!\n\n\n\nLet me clarify that 'winning consistently' doesn't mean 'winning all the time'. Sometimes the encounter deck's play is just too good gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527446","commentId":527446,"userName":"Glaurung","timestamp":1315897686,"content":"richsabre said:\n\nok thanks for the advice, ive just played gollum and flew through 1b, and most of 2b, then got hit by 2 eastern crows- so crows, surge, crows, surge, clue card, guarded surge, then hunters from mordor! ouch!\n\n\n\nrichsabre said:\n\nok thanks for the advice, ive just played gollum and flew through 1b, and most of 2b, then got hit by 2 eastern crows- so crows, surge, crows, surge, clue card, guarded surge, then hunters from mordor! ouch!\n\n\n\nSounds very brutal. you was really Unlucky!!!\n\nBut most of the time i can discards Hanters or clue card if i dont need more of them by quests cards ability. Really you need only 1 clue card to win i solo game. And tracker even one is already enough to deal with all locations. I thihk was cool if last stage have text like: only Hero with clue cards attached can commit to the quest. Than is cool. And Hunters start to be really threat!!!!! \n\nOtheyrwise Gimly with axe and armor, Northern Tracker, 1 clue card on Eowyn and  you win 100%.  My deck have Faramir also very good help for quest.\n\n In case of Lore decks: can put Snare on Hunters and dont even kill them. For what??? Maybe they will reshuffle again??? So let them be in snare and just forget about.\n\nLore dont have a trackers but Protector of Lorien +  Long beard map maker give you also good Questing power. Add Song of the kings, Steward of Gondor and Faramir and you can finish game in 3 rounds.My lore deck with Bilbo, Denethor and Beravur can make it easy.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527450","commentId":527450,"userName":"Eryx_UK","timestamp":1315898687,"content":"I'm in the camp that says we need some more easier scenarios for the game. For that game that has been promoted as being playable solo, I don't think this is truely the case. I say that most scenarios should be comparable to the second in the cores et (Passage Down the Anduin) so that they can be played by 1-4 players. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527459","commentId":527459,"userName":"ClydeCloggie","timestamp":1315899455,"content":"The_Big_Show said:\n\nI'm in the camp that says we need some more easier scenarios for the game. For that game that has been promoted as being playable solo, I don't think this is truely the case. I say that most scenarios should be comparable to the second in the cores et (Passage Down the Anduin) so that they can be played by 1-4 players. \n\n\n\nBut I think that for solo play Anduin is more difficult than either Gollum or the Carrock..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527464","commentId":527464,"userName":"Eryx_UK","timestamp":1315899932,"content":"ClydeCloggie said:\n\nThe_Big_Show said:\n\n \n\nI'm in the camp that says we need some more easier scenarios for the game. For that game that has been promoted as being playable solo, I don't think this is truely the case. I say that most scenarios should be comparable to the second in the cores et (Passage Down the Anduin) so that they can be played by 1-4 players. \n\n \n\n \n\nBut I think that for solo play Anduin is more difficult than either Gollum or the Carrock...\n\n\n\nGollum I find relatively easy, but I would say about the same difficulty as Anduin. Carrock is far far harder to play solo IMO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527475","commentId":527475,"userName":"ClydeCloggie","timestamp":1315902240,"content":"The_Big_Show said:\n\n \n\nGollum I find relatively easy, but I would say about the same difficulty as Anduin. Carrock is far far harder to play solo IMO.\n\n\n\nInteresting how these things differ between players.\n\n \n\nI find it much easier to deal with 4 (or 5) Trolls at the end of a game than with 1 at the beginning. I must admit being traumatised by the first turn East Bight / Brown Lands combo which I have run into a bit too regularly. That's why even my low-threat plans on the Anduin go astray all too quickly, all too often.\n\n \n\nFor what it's worth, I'm using my own difficulty grading for the quests I own:\n\n \n\nMirkwood 1, Gollum 3, Carrock 4, Anduin 5, Dol Guldur 8.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527480","commentId":527480,"userName":"Dam the Man","timestamp":1315904179,"content":"Still not sure where to put Anduin myself, at first I was taking it apart easy, last three games have had horrid draws (not even making it to the last stage). Hill Troll attacking Gimli and getting \"defending character does not count defense\" Shadow Effect on the first turn kinda cramps your style llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif] . Same deal if you're defending with Gandalf and he's your only exhausted ally when a Shadow Effect calls for an exhausted ally to return to hand, undefended Hill Trolls aren't nice. So far, I'd put Carrock way on the easier end of the scale than Gollum, latter probably requires NTs given its heavy locations (Old Ford is just eww late game), while killing the unique Trolls is way easier than taking out Hill Trolls as you can chuck the lamest fodder allies to them, any excess damage doesn't go anywhere, unlike with the HTs. Haven't gotten around to playing Rhosgobel yet (just picked it up yesterday, but Gears of War was in the same order and it takes precedence), but Lore portions might be very necessary in that one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527485","commentId":527485,"userName":"Titan","timestamp":1315905027,"content":"Personally, I have not found that the difficulty level of the adventure packs is on a par with those from the core set. Hunt for Gollum is supposed to be as difficult as Anduin at level 4. It's not even close. Gollum is far, far easier. Carrock, at level 7, comparable to Dol Guldur? Not close, either. I've only come close to passing Dol Guldur once, but I've already beaten Carrock 2 out of 3. I'm sure it will be putting some dents on my record as I play it a few more times, but the point is that the game does not seem to be getting more difficult from the Core Set. Let's see what Rhosgobel has to offer, as I will probably play it in the next couple of days.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527581","commentId":527581,"userName":"Dwnhmcntryboy","timestamp":1315919938,"content":"  Rhosgobel looks to be fun, the game being on a timer and all. I have more than a few people who play with me so I don't really have the resources to make a solo deck. Will be playing  Rhosgobel here in a few.\n\n Glaurung do you use your solo deck in multiplayer? Have you only played the Core quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527603","commentId":527603,"userName":"Valyrian Steel","timestamp":1315922901,"content":"Glaurung said:\n\nrichsabre said:\n\n \n\nyes i cant understand how it is way too easy- ive been playing since the games release, very regularly, i know the rules pretty much inside out,  i spend time building a deck, and i still cant beat HFG, CAC, dol guldor, and even anduin!\n\n \n\n \n\nUps sorry  you set cant beat.\n\nTry this deck. This deck can beat all quest mostly of the time but not Dol guldor.\n\nI make this deck in june. Since this time is most strongers deck in my collection. Some lore deck more stable but is boring for me to play them.\n\nTotal Cards (50)\n\nHero (3)\nEowyn (Core) x1\nGimli (Core) x1\nTheodred (Core) x1\n\nAlly (11)\nFaramir (Core) x2\nGandalf (Core) x3\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\n\nAttachment (14)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDwarven Axe (Core) x3\nSteward of Gondor (Core) x3\nUnexpected Courage (Core) x3\n\nEvent (25)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nValiant Sacrifice (Core) x2\nHasty Stroke (Core) x3\n\nAfter Stand and Fight Errata maybe you need to change them for Born aloft or something.....\n\n\n\nI finally understand the method and i think you probably make the game much more appealing for your style if you do one simple thing (something I think should actually be a card errata). Make unexpected courage unique and presto...not going to win nearly as much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527618","commentId":527618,"userName":"Bohemond2","timestamp":1315925916,"content":"I would just make a restricted list with Gandalf, Steward, and Unexpected courage on it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527620","commentId":527620,"userName":"Glaurung","timestamp":1315926155,"content":"Dwnhmcntryboy said:\n\n  Rhosgobel looks to be fun, the game being on a timer and all. I have more than a few people who play with me so I don't really have the resources to make a solo deck. Will be playing  Rhosgobel here in a few.\n\n Glaurung do you use your solo deck in multiplayer? Have you only played the Core quests?\n\n\n\nDwnhmcntryboy said:\n\n  Rhosgobel looks to be fun, the game being on a timer and all. I have more than a few people who play with me so I don't really have the resources to make a solo deck. Will be playing  Rhosgobel here in a few.\n\n Glaurung do you use your solo deck in multiplayer? Have you only played the Core quests?\n\n\n\nYes sure i use my deck in multuplayers and solo games s well. And i play all quests. Even Massing in Osgiliath which one i think is the best quest for now.\n\nI dont have the cards(Massing in Osgiliath) but i make the proxy good quality ones and play. I still want to buy it when is coming out.\n\nI use to pay decipher Lotr Tcg as well for the years. Im big Tolkien fan from my childhood.( first time i read the book i was 7 years old).\n\nAnd when the FFG game  come i jump it on that like crazy. For me is more than just a game..... For me is part of my soul....\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527738","commentId":527738,"userName":"Runner5","timestamp":1315943878,"content":" I would think an expert player would be someone who can get far into the quests with the lesser used cards or the ones that are not as good.  Not someone who has shelled out cash to buy a few core sets or a few of each adventure pack to get more of the \"better\" cards.  I always feel like I am a better player at this game when I beat a quest using cards that others don't use.  That's just my opinion though and i'm by no means an expert player just someone who finds this game fun.  I find the difficulties of the different quests so far is really well done.  There are quests to test decks on, quests that are just plain fun to play, and quests that will challenge all your deck building abilities.  So far I think FFG has done an excellent job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527805","commentId":527805,"userName":"Will Fuqua","timestamp":1315958892,"content":"I'd actually prefer an array of difficulty, even ones at 1 like Passage Through Mirkwood.  Sometimes a laid back adventure is perfectly enjoyable and then can be followed by something more challenging.  Variety to me is a nice thing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527815","commentId":527815,"userName":"Glaurung","timestamp":1315959966,"content":"Avalanche said:\n\n I would think an expert player would be someone who can get far into the quests with the lesser used cards or the ones that are not as good.  Not someone who has shelled out cash to buy a few core sets or a few of each adventure pack to get more of the \"better\" cards.  I always feel like I am a better player at this game when I beat a quest using cards that others don't use.  That's just my opinion though and i'm by no means an expert player just someone who finds this game fun.  I find the difficulties of the different quests so far is really well done.  There are quests to test decks on, quests that are just plain fun to play, and quests that will challenge all your deck building abilities.  So far I think FFG has done an excellent job.\n\n\n\nthat what you say is right but....... Depend what is your goal ..... I prepare my self for tournaments. And want to win. All my life i play a lot of tournaments. Start form MTG then switch to LOTR TCG Decipher and now new Lotr Lcg from FFG.\n\nYes you can Build up fun deck with weak cards to try to make its true.And if is your goal ok do it. But for my purpose is not necessary.\n\nBut for tournaments you should take the best cards for win cose your opponents will do mostly same. You must to have a good deck but is not enough since your opponents also will have a good decks.So you must have a certain luck+good game skill.All other kind of experience can even harm you.\n\nOn the tournament 1 mistake is enough sometimes to lose. When you play take the dice and every time when  you think you make a mistake add 1. You get 6 you lose.\n\nAnd you game skill should be build up according to tournament system. That why i try build up deck to beat all scenarios.And my deck Gimly/Eowyn/Theodred can beat all scenarios quite well. You must be ready for many things on the tournaments."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527853","commentId":527853,"userName":"Ichirou989","timestamp":1315968651,"content":"In looking over the deck you listed Glaurung, I see in that deck you are using a strategy I played with a bit, essentially an endless Gandalf deck.  A deck like that, especially when coupled with The Galadrim's Greeting, makes threat a trivial thing unless you are incredibly unlucky in your draws.  Since threat is pretty much the key driving mechanic in the game, keeping it as low as possible is important, particularly below 35 and a deck such as the one you posted would indeed do that handily.  I do trust you only have the multiple Steward of Gondor and Celebrian's Stone cards in the deck to give you a greater chance of drawing them and not having more than one of each of those out in play at a time?  I only say that because I know of at least one other person who has made that mistake with unique cards.\n\nOne thing that I might suggest to you if you are finding the game too easy with that sort of deck would be to start cutting back on the Gandalf recycling, or don't use The Galadrim's Greeting cards, and try to come up with some other methods of trying to beat the scenarios.  I've done that and found that I'm starting to discover some other interesting combo's in the cards.  Plus, it can make the games far closer and tense...as well as give you more losses to consider.  And there is another value in doing that as well; I have a suspicion that we may find FFG making restricted and limited card lists in the future, particularly for cards like Gandalf.  Best to have other options and strategies available should that happen. \n\nAs for the discussion at hand, I will say that I too find that the Escape from Dol Guldur scenario to be a real beast solo, and consider it more difficult indeed than the Carrock one.  I would easily call it an 8 difficulty when played solo.  As for the add-on packs having scenarios of increasing difficulty, I would expect them to run no less than a 3 difficulty, with most hitting the 5-7 difficulty range.  Considering that we are steadily getting more cards with each pack, and thus more abilities and combo possibilities, it does stand to reason that the packs will have harder scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527864","commentId":527864,"userName":"Glaurung","timestamp":1315972090,"content":"Valyrian Steel said:\n\nGlaurung said:\n\n \n\nrichsabre said:\n\n \n\nyes i cant understand how it is way too easy- ive been playing since the games release, very regularly, i know the rules pretty much inside out,  i spend time building a deck, and i still cant beat HFG, CAC, dol guldor, and even anduin!\n\n \n\n \n\nUps sorry  you set cant beat.\n\nTry this deck. This deck can beat all quest mostly of the time but not Dol guldor.\n\nI make this deck in june. Since this time is most strongers deck in my collection. Some lore deck more stable but is boring for me to play them.\n\nTotal Cards (50)\n\nHero (3)\nEowyn (Core) x1\nGimli (Core) x1\nTheodred (Core) x1\n\nAlly (11)\nFaramir (Core) x2\nGandalf (Core) x3\nNorthern Tracker (Core) x3\nLorien Guide (Core) x3\n\nAttachment (14)\nCelebrian's Stone (Core) x2\nCitadel Plate (Core) x3\nDwarven Axe (Core) x3\nSteward of Gondor (Core) x3\nUnexpected Courage (Core) x3\n\nEvent (25)\nA Test of Will (Core) x3\nDwarven Tomb (Core) x2\nFeint (Core) x3\nQuick Strike (Core) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nValiant Sacrifice (Core) x2\nHasty Stroke (Core) x3\n\nAfter Stand and Fight Errata maybe you need to change them for Born aloft or something.....\n\n \n\n \n\nI finally understand the method and i think you probably make the game much more appealing for your style if you do one simple thing (something I think should actually be a card errata). Make unexpected courage unique and presto...not going to win nearly as much.\n\n\n\nWhat can i say??? For my deck U. Courage is not really important. I need only one on Gimly mostly of the time.\n\nAnd dont want to create my rules. I play as official rules are cose i oriented on tournaments.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527884","commentId":527884,"userName":"mr.thomasschmidt","timestamp":1315980518,"content":"Glaurung said:\n\nWhat happen with you guys???? Game is hard for solo???? Step by step with rule changed, with card erratas , with new quests coming they start to make game not so easy as before.All the adventures under difficult 5 is piece of cake!!!! We cannot back to 1 or 3 level quest. Game is still to easy!!!!\n\nJust play more, sharp your game skill and you will see the game is still so easy if you are expert player.\n\n\n\nGood for you that you have a super deck and all the time in the world to just focus on playing. I don't have that kind of time to invest and would appreciate BOTH harder AND easyer quests. Just because YOU can beat everything and think it's a piece of cake doesn't mean that's the same for everyone else. Don't be so arrogant. Just say that you don't think it's difficult and would like more challenge without calling everyone else amatures. We need BOTH difficult AND easy levels as it's just as much about the story of the game/quests not just \"I can beat all quest, I'm the great, yay me!!\"\n\n \n\nThink and feel whatever you want but show some respect thank you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527920","commentId":527920,"userName":"richsabre","timestamp":1315991022,"content":"well im pleased to see im not the only one finding it hard. i appreciate the need for harder quest due to an ever growing card pool, but i would still like to see a few easier levels all the same"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527928","commentId":527928,"userName":"DurinIII","timestamp":1315992298,"content":" Yeah richsabre, I have to agree completely with you. Playing solo is tough to beat some of these quests (especially if you don't play with Eowyn, which I try not to do). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=527937","commentId":527937,"userName":"Glaurung","timestamp":1315993419,"content":"I dont want to argue cose i dont think some of players really understand what i talking about. I think my english is not good enough for that.\n\nAnyway i will make my video better and put the link here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528056","commentId":528056,"userName":"Glaurung","timestamp":1316011241,"content":"DurinIII said:\n\n Yeah richsabre, I have to agree completely with you. Playing solo is tough to beat some of these quests (especially if you don't play with Eowyn, which I try not to do). \n\n\n\nBefore i also think very difficult play with out her in solo game. But I try make some lore deck and........ playing very good solo. Look this deck and try it f you want. You will see this deck play quite well but it take long time. There is no trackers no Eowyn but still win mostly of the time!!! I still need Haldir for this deck but i didn get Rosghobel yet.\n\nYou play Steward and Celebrian stone on Bilbo he is for quest mostly. Denethor B brand and all Warnings on him for defend and Beravur have all marks attack 5 and she for kill or for quest or draw cards as well. there is a combo forest snare and son of Arnor.  In the middle of the game you have half of deck in your hand so sneak attack and Gandalf always helps and discard many cards by Protector of Lorien for quest fast when you ready.\n\nHero (3)\nBeravor (Core) x1\nBilbo Baggins (THFG) x1\nDenethor (Core) x1\n\nAlly\nErebor Hammersmith (Core) x3\nFaramir (Core) x3\nGandalf (Core) x3\nGleowine (Core) x2\nHenamarth Riversong (Core) x2\nMiner of the Iron Hills (Core) x3\nRivendell Minstrel (THFG) x3\nSon of Arnor (Core) x3\n\nAttachment\nCelebrian's Stone (Core) x2\nForest Snare (Core) x3\nProtector of Lorien (Core) x3\nSelf Preservation (Core) x3\nSong of Kings (THFG) x3\nSteward of Gondor (Core) x3\n\nDunedian Warning (Carrock)x3\n\nBurning Brand (Carrock)x2\n\nDunedian mark (THFG)x3\n\n \n\nEvent (3)\nSneak Attack (Core) x3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528074","commentId":528074,"userName":"guciomir","timestamp":1316013219,"content":"Glaurung is partially right and I do see that english is not his native language (mine neither) so I assume the words may seem more offensive than intended.\n\nGimli - Theodred - Eowyn is capable of winning all existing scenarios without Rhosgobel. It is easy to say that those quests do not pose major challenge (including Osgilath) because right now the deck can beat them , maybe not 100% of the time, but you see the point. When the card pool becomes bigger , the deck will become more powerful, but existing quests (3x core, gollum, carrock, osgilath) will not.\n\nEnter the Eagle quest - Suddenly the deck fails. This is how the designers are making the game challenging. Suddenly threat reduction and location killing abilities are worth nothing. I made a change to Gimli - Theodred - Eowyn , I included Radagast and this new eagle ally who can resurrect heros. This gives me a chance against Eagle quest, but makes the deck weaker against existing scenarios.\n\nWhat I want to say, is that some quests are easy if you design a deck specially to beat them. But such deck will get smashed against other quests which will expose its weakness. So Glaurung, the game is not too easy, you just play the deck which right now is powerful versus current field, but you'll get slapped by new challenges. A lot.\n\nBtw you have some weird cards in Gimli-Theodred-Eowin. Like the axe, why use it instead of tactic dwarf who costs 2 but have no abilities? Also, apparently Gandalf + Stand/Fight is now illegal. Strange ruling but makes this deck weaker.\n\nAnd the second deck, lore + splash of leadership. I do not buy it. I was playing similar deck one time and in some games, you just don;'t draw  minstrel or song and you lose the game because you can't do anything. Additionally, with no forest snare in the opening hand and with poor willpower in the first turn, you will have big trouble against Anduin quest since the troll will probably engage you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528102","commentId":528102,"userName":"marlow4","timestamp":1316016308,"content":"So what is the alternative to the current quest difficulties? Are we really asking for quests that you lose most of the time? That doesn't sound fun to me. If the game played that way there would be complaints about game balance being skewed in favor of the encounter deck. A friend was just telling me yesteday about another game he's been trying to play with some others recently and they have found that they get to the same point and hit a wall every time. It is no longer fun for them. They are going to move on to something else.\n\nMaking a game too difficult is a good way to kill the interest in the game. People don't like to lose repeatedly.\n\nSure you can build an expert level deck with multiple core sets and design it to destroy specific scenarios, but does that mean you should start claiming the game is too easy and the difficulty should be increased for everyone? Sounds selfish and unrealistic.\n\nFFG has to balance the game for a large player base, not for a specific few.\n\nThese quest scenarios play out like small scale role-playing adventures. Have you ever played a role-playing game where the game master just repeatedly kills your party? People stop playing with game masters like that. It isn't fun.\n\nLOTR should play out the way it has been, where you have a pretty good chance of successfully completing the quest scenarios with some friends. That'll make the game popular. If you show up with a game where they are probably going to lose, you end up sitting there by yourself while the other folks play something else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528222","commentId":528222,"userName":"peterstepon","timestamp":1316036958,"content":"I just had an experience where I tried to play anduin with 2 mixed decks and I got slaughtered in the 2nd and 3rd turns.  Basically I kept getting treachery cards which hurt the characters who were exhausted.  Then that **** troll and the other monsters in the staging area beat the hell out of me.\n\nI feel like just playing 3 mono decks solo.  Who cares about being able to brag about winning with some supersonic solo deck, I just want to WIN!  I imagine playing Tactics, Spirit, and Lore at the same time would be perfect.  I have had enough frustrations with this game that I just want to maul it and beat it to the ground. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528227","commentId":528227,"userName":"marlow4","timestamp":1316038217,"content":"peterstepon said:\n\nI just had an experience where I tried to play anduin with 2 mixed decks and I got slaughtered in the 2nd and 3rd turns.  Basically I kept getting treachery cards which hurt the characters who were exhausted.  Then that **** troll and the other monsters in the staging area beat the hell out of me.\n\nI feel like just playing 3 mono decks solo.  Who cares about being able to brag about winning with some supersonic solo deck, I just want to WIN!  I imagine playing Tactics, Spirit, and Lore at the same time would be perfect.  I have had enough frustrations with this game that I just want to maul it and beat it to the ground. \n\n\n\nAnduin is nasty. Group I play with took it on in 3-player last night and we were bruised by the end. At one point we used Eleanor to cancel that treachery card that wounds all exhausted characters, only to replace that with Crows who surged another copy of that treachery card. So we still got hit with it + got some Crows on the table (thanks a lot, Eleanor!). Then hitting phase 3 and drawing 2 cards per player just swamped us. We pulled it out thanks to some luck and some brain twisting strategerizification. We went Leadership, Spirit, and Lore. Leadership and Lore players soaked up most of the enemies while we slowly turned Dunhere into a machine gun for sniping. Tactics would probably do just as well, if not better, than Leadership.\n\nI was going to drop Dol Guldur on them next week but I'm getting soft in my old age and I think we'll go Hunt for Gollum for a change of pace.\n\nWe use 30-card mono decks. I'll worry about 50-card decks once I feel there is a good enough card pool. 30-card decks among friends or solo isn't going to get anyone thrown in jail."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528231","commentId":528231,"userName":"Dwnhmcntryboy","timestamp":1316039237,"content":" Gimli - Theodred - Eowyn was built yesterday and I played it  the last 2 days. against lvl 1 scenario it rocks. Took it to lvl 4 and it falls apart. 20 games and i did not win a single game because of the slow pace of the deck. I have made it my mission to build myself a solo deck now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528262","commentId":528262,"userName":"Glaurung","timestamp":1316047233,"content":"guciomir said:\n\nGlaurung is partially right and I do see that english is not his native language (mine neither) so I assume the words may seem more offensive than intended.\n\nGimli - Theodred - Eowyn is capable of winning all existing scenarios without Rhosgobel. It is easy to say that those quests do not pose major challenge (including Osgilath) because right now the deck can beat them , maybe not 100% of the time, but you see the point. When the card pool becomes bigger , the deck will become more powerful, but existing quests (3x core, gollum, carrock, osgilath) will not.\n\nEnter the Eagle quest - Suddenly the deck fails. This is how the designers are making the game challenging. Suddenly threat reduction and location killing abilities are worth nothing. I made a change to Gimli - Theodred - Eowyn , I included Radagast and this new eagle ally who can resurrect heros. This gives me a chance against Eagle quest, but makes the deck weaker against existing scenarios.\n\nWhat I want to say, is that some quests are easy if you design a deck specially to beat them. But such deck will get smashed against other quests which will expose its weakness. So Glaurung, the game is not too easy, you just play the deck which right now is powerful versus current field, but you'll get slapped by new challenges. A lot.\n\nBtw you have some weird cards in Gimli-Theodred-Eowin. Like the axe, why use it instead of tactic dwarf who costs 2 but have no abilities? Also, apparently Gandalf + Stand/Fight is now illegal. Strange ruling but makes this deck weaker.\n\nAnd the second deck, lore + splash of leadership. I do not buy it. I was playing similar deck one time and in some games, you just don;'t draw  minstrel or song and you lose the game because you can't do anything. Additionally, with no forest snare in the opening hand and with poor willpower in the first turn, you will have big trouble against Anduin quest since the troll will probably engage you.\n\n\n\nYes i also sow some of your comments and undesrstand we play some same decks. Im happy if Roshgobel change and beat my deck. I only happy with that.\n\nI happy for Stand and fight erratas and will be happy when the do something with Northern Tracker as well. He is to powerful too!!!\n\nThere is was a lot mistake in the game balance from begining so i glad they start slowly slowly to fix it. I hope in Khasad-dum everythig will be more balanced and stable. But my biggest joy is massing in Osgiliath. This quest done properly. And the level of the game i mean quality is much better then other quests. So this give me hope the game will be ok.I thing quests can be much more interesting than what we have now.\n\nAbout Dwarfen axe.... Simply i dont like this dwarf just personally. Stand and fight is still a good card to get back some allies like Tracker or Faramir.Now we Cannot put Gandalf back by this card but again im  happy about this.\n\nAbout my lore deck. Yes troll is a problem. But there is many ways how to deal with him. But still the most difficult for this deck is Anduin scenario. All other quests this deck make even better then Gimly/Theodred/Eowyn deck. Yesterday i play 3 games. 2 Carrock and 1 Anduin. Win them all wit my lore deck.\n\nAbout difficult of the game. Since i buy this game we play lot of 2 players game with my firend. My experience in the card game is quite big i even have my own board shop before and Lotr Tcg decipher i was number 1 in my country and play world cups against the best players in the world. My friend is proff. Matematic, programmer guy. We never lose any session until we get the Carrock. We already even decide dont play anymore cose is not fun. If you always win what is interesting to play???? And we lose Carrock!!!! First time for 4 months. So now we really wait for Rosgobel!!!\n\nWe still dont try Massing in 2 players game but sure it will be no easy!!!\n\nAnyway i dont want to harm anyone and look arrogant sorry my english is not so good.\n\nBut here is very good chance for me to practice.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=528472","commentId":528472,"userName":"mr.thomasschmidt","timestamp":1316086165,"content":"Marlow said:\n\nSo what is the alternative to the current quest difficulties? Are we really asking for quests that you lose most of the time? That doesn't sound fun to me. If the game played that way there would be complaints about game balance being skewed in favor of the encounter deck. A friend was just telling me yesteday about another game he's been trying to play with some others recently and they have found that they get to the same point and hit a wall every time. It is no longer fun for them. They are going to move on to something else.\n\nMaking a game too difficult is a good way to kill the interest in the game. People don't like to lose repeatedly.\n\nSure you can build an expert level deck with multiple core sets and design it to destroy specific scenarios, but does that mean you should start claiming the game is too easy and the difficulty should be increased for everyone? Sounds selfish and unrealistic.\n\nFFG has to balance the game for a large player base, not for a specific few.\n\nThese quest scenarios play out like small scale role-playing adventures. Have you ever played a role-playing game where the game master just repeatedly kills your party? People stop playing with game masters like that. It isn't fun.\n\nLOTR should play out the way it has been, where you have a pretty good chance of successfully completing the quest scenarios with some friends. That'll make the game popular. If you show up with a game where they are probably going to lose, you end up sitting there by yourself while the other folks play something else.\n\n\n\nTotally agree :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529280","commentId":529280,"userName":"player582283","timestamp":1316213386,"content":"The problem with quests that are less difficult is that all the quests are going to get easier over time.  With new player cards introduced, our decks get more powerful.  I'll take a game that is a challenge with consistent losses over a win every time game.  My only complaint with the game is that multi player is way too easy.  2 player we almost never lose and more than 2 we don't ever. \n\nAfter getting a hang of the game do you even play the first scenario?  I never even play it anymore.  It's so easy that it is boring.   I'm not trying to be condescending, but it is likely that as you play more, your win % will go up. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529294","commentId":529294,"userName":"Glaurung","timestamp":1316221098,"content":"Woz said:\n\nThe problem with quests that are less difficult is that all the quests are going to get easier over time.  With new player cards introduced, our decks get more powerful.  I'll take a game that is a challenge with consistent losses over a win every time game.  My only complaint with the game is that multi player is way too easy.  2 player we almost never lose and more than 2 we don't ever. \n\nAfter getting a hang of the game do you even play the first scenario?  I never even play it anymore.  It's so easy that it is boring.   I'm not trying to be condescending, but it is likely that as you play more, your win % will go up. \n\n\n\nYou absolutly right my Friend. You get my point. And new players cards aslo very powerful. Lool on the Matnon card from JTR. Draw 3 cards for 1 spirit recourse!!!!!! Is very powerful!!!! So i hope new quests will keep good challenge.\n\nAbout 2 players game. For all 4 months we play this game we lose only 1 session of  2 players game it was Carrock. You think is normal???? I dont think so...\n\nWe try Massing and was defeated after 3 or 4 rounds. Cool!!!! I cannot wait gather with my friend again. This make game interesting now.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529352","commentId":529352,"userName":"Eryx_UK","timestamp":1316245664,"content":"Woz said:\n\nAfter getting a hang of the game do you even play the first scenario?  I never even play it anymore.  It's so easy that it is boring.   I'm not trying to be condescending, but it is likely that as you play more, your win % will go up.\n\nI still do, though more because sometimes I just want to sit down and play, but don't want to deck build for the harder ones. I don't find it boring because each try, though almost guaranteed, is still a different experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529358","commentId":529358,"userName":"Mighty Jim 83","timestamp":1316246923,"content":"I'm amazed that Glaurung's deck has only lost once in several months.\n\nIf I were playing that deck, I know what would happen:\n\nFirst turn: can't play any cards, only have 1 resource of each type.\n\nSecond turn: can't play any cards, only have 1 resource of each type - oh dear, one of my heroes is dead.\n\nThird: I can play a card! but I only have 2 heroes... oh, make that 1.\n\nFourth - dead.\n\nWith only 1 hero per sphere, and high cost cards like the Northern Tracker, Faramir etc, I just don't see how this deck works (I'm currently in a different country from my cards right now, so I couldn't build it to try, even with enough core sets) even using Galadrihim's greeting is going to get you little benefit - 3 turns to pay for it = net gain of only -3 threat, down to 2 if you have to use a dwarven tomb to return it. That's assuming you do nothing else with you spirit resources (like cancelling encounter/shadow card effects.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529362","commentId":529362,"userName":"Gaffa","timestamp":1316247767,"content":"Mighty Jim said:\n\ni'm amazed that Glaurung's deck has only lost once in several months.\n\n \n\n \n\nI'm amazed that it even has won once in several months. I share the same concerns you do -- lots of high-cost cards spread across three spheres and no ability to deal with early game problems besides three heroes. Adding Songs to it now would greatly help it out, but this deck stalls horribly.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529388","commentId":529388,"userName":"Glaurung","timestamp":1316253832,"content":"Mighty Jim said:\n\nI'm amazed that Glaurung's deck has only lost once in several months.\n\nIf I were playing that deck, I know what would happen:\n\nFirst turn: can't play any cards, only have 1 resource of each type.\n\nSecond turn: can't play any cards, only have 1 resource of each type - oh dear, one of my heroes is dead.\n\nThird: I can play a card! but I only have 2 heroes... oh, make that 1.\n\nFourth - dead.\n\nWith only 1 hero per sphere, and high cost cards like the Northern Tracker, Faramir etc, I just don't see how this deck works (I'm currently in a different country from my cards right now, so I couldn't build it to try, even with enough core sets) even using Galadrihim's greeting is going to get you little benefit - 3 turns to pay for it = net gain of only -3 threat, down to 2 if you have to use a dwarven tomb to return it. That's assuming you do nothing else with you spirit resources (like cancelling encounter/shadow card effects.)\n\n\n\nHey i didn meant that never lose for 4 months.\n\nI lose a lot.  2players game we lose only twice is true. But i didn play multyplayer much.\n\nYou should to try my deck. There is a lot of tricks and lot of combos. For example: You can put Northern tracker on second round if you have Steward in your starting hand. Every card in this deck have some strategy and combo with others cards.\n\nTheodred is key. He can add resources to any hero in the begining and that  help a lot. In the begining he is really important. After when you play Faramir, Stewar and Stone on Eowyn you still need him fo sneak attack with Gandalf.\n\nBut i have a big question about Quest phase. If we can play action between 2 different heroes commit to the quest in 1 story. Of we cannot another story.\n\nRules doesn clear that much. Example : I commit eowyn to the quest (have 3 resources in her pool)  Than i discard Northern tracker from hand to make her will +1 , Than i commit theodred to the quest add 1 resources to eowyn pool (Total is 4 now) and play northern tracker from discard pile by Stand and fight and commit him to the quest too.I still nor sure can i do that or not.\n\nOther wise i still can play Tracker by Stand and Fight but cannot commit hi to the quest.  But still can use him later for defend or attack.\n\nThis deck play good. And this deck is very fast as well.  But as i heard AJTR kill this deck. So need to make some changes.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529392","commentId":529392,"userName":"Puzzle2","timestamp":1316254686,"content":"Glaurung said:\n\n\n\n\nOther wise i still can play Tracker by Stand and Fight but cannot commit hi to the quest.  But still can use him later for defend or attack.\n\n \n\n \n\n \n\n \n\n\n\nThis second line is the correct way to play this combo. You have to announce all questing characters and exhaust them at the beginning of the phase. You can play an event card like Stand and Fight to bring in the Tracker, but you cannot commit him to the quest because the 'commit characters' step of the phase is already done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529405","commentId":529405,"userName":"player582283","timestamp":1316257997,"content":"Edited as I re-read what Glaurong was doing and I agree with Puzzle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529412","commentId":529412,"userName":"Svenn","timestamp":1316259495,"content":"Since I already looked it up for Woz before he figured it out, I'll post here so anyone else who is confused understands why it is this way.\n\nFrom the FAQ:\n\nQ: Does a player commit his characters to a quest at once, or one character at a time? When can a player trigger responses to committing his characters to a quest?\nA: A player commits all characters he wishes to commit to a quest at once. Responses to the characters committing (such as those on Aragorn and Theodred) can then be triggered in the order of that player’s choice. After a player has committed his characters (and triggered any responses to those characters\ncommitting), the next player has the opportunity to commit his characters to the quest.\n\nSince all characters have to be committed at once he could commit Eowyn and Theodred, discard Northern Tracker for Eowyn, get the extra resource from Theodred and then play Stand and Fight with that extra resource. However, after Northern Tracker comes into play it could not join the quest because all questing characters commit at once, and this was already done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529446","commentId":529446,"userName":"Glaurung","timestamp":1316266137,"content":"Svenn said:\n\nSince I already looked it up for Woz before he figured it out, I'll post here so anyone else who is confused understands why it is this way.\n\nFrom the FAQ:\n\nQ: Does a player commit his characters to a quest at once, or one character at a time? When can a player trigger responses to committing his characters to a quest?\nA: A player commits all characters he wishes to commit to a quest at once. Responses to the characters committing (such as those on Aragorn and Theodred) can then be triggered in the order of that player’s choice. After a player has committed his characters (and triggered any responses to those characters\ncommitting), the next player has the opportunity to commit his characters to the quest.\n\nSince all characters have to be committed at once he could commit Eowyn and Theodred, discard Northern Tracker for Eowyn, get the extra resource from Theodred and then play Stand and Fight with that extra resource. However, after Northern Tracker comes into play it could not join the quest because all questing characters commit at once, and this was already done.\n\n\n\nYes  i agree with that. But in begining of the quest phase before you commit characters to the quest you also can play action right???\n\nYou can use stand and fight to put norther tracker before you commit characters to the quest and he can join them right???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529453","commentId":529453,"userName":"Svenn","timestamp":1316267095,"content":"Glaurung said:\n\nSvenn said:\n\n \n\nSince I already looked it up for Woz before he figured it out, I'll post here so anyone else who is confused understands why it is this way.\n\nFrom the FAQ:\n\nQ: Does a player commit his characters to a quest at once, or one character at a time? When can a player trigger responses to committing his characters to a quest?\nA: A player commits all characters he wishes to commit to a quest at once. Responses to the characters committing (such as those on Aragorn and Theodred) can then be triggered in the order of that player’s choice. After a player has committed his characters (and triggered any responses to those characters\ncommitting), the next player has the opportunity to commit his characters to the quest.\n\nSince all characters have to be committed at once he could commit Eowyn and Theodred, discard Northern Tracker for Eowyn, get the extra resource from Theodred and then play Stand and Fight with that extra resource. However, after Northern Tracker comes into play it could not join the quest because all questing characters commit at once, and this was already done.\n\n \n\n \n\nYes  i agree with that. But in begining of the quest phase before you commit characters to the quest you also can play action right???\n\nYou can use stand and fight to put norther tracker before you commit characters to the quest and he can join them right???\n\n\n\nYes, that should be fine since you haven't committed characters to the quest yet. The only reason you couldn't do it the other way is because you are using the resource gained from committing Theodred to the quest so you've already passed the commit part."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=529459","commentId":529459,"userName":"player582283","timestamp":1316268047,"content":"Big Show,\n\nTo each his own, and as long as you are having fun you're getting value from the game!  I get that every play through has differences and that keeps the quests fresh.  This is especially true if you run a couple different decks as the playstyle is completely different.  My primary deck, a leadership - spirit (with a splash of lore), plays the same quest very differently than the Tactics Lore deck I also have.  I also play around with experimental ones to have different experiences.\n\nFor me...I just would rather have more of a challenge for replays.  As an example - I've not beaten Dol Gulder solo yet.  I've given up winning with my standard decks for the time being and am trying to build one to beat it.  \n\nSo I understand why you would like to see level 1-3s in expansions.  Hopefully you see my points about wanting them to be at least 4s."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53054-question-about-ad-packs-difficulty/?do=findComment&comment=532820","commentId":532820,"userName":"Glaurung","timestamp":1316953813,"content":"Just got the Rhosgobel. Play 3 session 2 players. Lose 2 win 1. Win only cose put in my friend lore deck 3 copies of Lore of Ilmadris.\n\nVery cool quest!!!\n\nPlay Carrock as well. Lose 2 win 1. So now in 2 player game balance is much better. The game scaling more perfect now.\n\nI gonna try Rhosgobel solo will see what happens.......\n\nReally disappointed about Emyn Muil difficult level 4........... Hope this one will be interesting at least."}]}