{"url":"https://community.fantasyflightgames.com/topic/53075-maybe-i-missed-something/","title":"Maybe I missed something...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53075-maybe-i-missed-something/?do=findComment&comment=527452","commentId":527452,"userName":"guest475141","timestamp":1315898874,"content":" I am sorry if this has been asked before, but I've read the rules three or four times and I can't find where it states how to set up a solo game.  Do you play with two hands or one?  Do you change the way you setup the encounter?  Do you change how many heroes you play with?  Any help would be appreciated.\n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53075-maybe-i-missed-something/?do=findComment&comment=527454","commentId":527454,"userName":"Eryx_UK","timestamp":1315899160,"content":"Solo play is same as standard but you only play with one player's worth of cards. 3 heroes, one deck of cards and one threat tracker. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53075-maybe-i-missed-something/?do=findComment&comment=527455","commentId":527455,"userName":"richsabre","timestamp":1315899178,"content":"hi\n\n \n\nyou set up with 3 heros, 1 player deck and exactly the same amount of encounter cards as 2 player, then you draw 1 player card per turn, and 1 encounter card in the quest phase unless otherwise stated\n\n \n\nrich\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53075-maybe-i-missed-something/?do=findComment&comment=527456","commentId":527456,"userName":"pumpkin","timestamp":1315899198,"content":"You play it pretty much like you wouldi f you had multiple players.\n\nYou have 3 heroes and a single player deck (50 cards if you are being official), other than that you play as you would a game with multiple players.\n\nAs there is only 1 player, you add 1 card to the staging area during the quest phase, but all other cards and rules you play as written.\n\nFor the intro scenario in the core set , you can just about play that using any of the single sphere intro decks (Tactics is the most tricky IMO), but going beyond that you will want to deck build, which probably means combining spheres and therefore heroes, before trying Journey Down the Aduin or beyond.\n\n \n\nThe adventure packs seem to scale much better in terms of players than the core set adventures - you might want to avoid Escape from DG solo until you have a well built deck, and even then its very tricky ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nGood luck!\n\n \n\n \n\n \n\n "}]}