{"url":"https://community.fantasyflightgames.com/topic/53091-old-quest-cards-after-deluxe-expansion/","title":"Old quest cards after deluxe expansion...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53091-old-quest-cards-after-deluxe-expansion/?do=findComment&comment=527543","commentId":527543,"userName":"rapatpamp","timestamp":1315914890,"content":"So I am sure this has been discussed already but being a new deluxe expansion has bee announced and the next cycle also I may as well bring it up.\n\nWhen the next cycle of APs begin will all my \"old\" quest sets be useless other than revisiting that cycle?\n\nNow I understand that I can revisit those quests whenever but if I do not it seems like this is kind of how Magic does it and cycles out cards in type 2.\n\nI would like to see the new AP packs use some of the old quests sets just so they do not set in my folder unused.\n\nMaybe quests that use 4 or 5 sets for bigger encounters ect.\n\nAnyway loving the game and keep it coming FFG.\n\ncorazon.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/corazon.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53091-old-quest-cards-after-deluxe-expansion/?do=findComment&comment=527544","commentId":527544,"userName":"Svenn","timestamp":1315915112,"content":"Since the core set will be required anyway it would make sense that they would continue to use core set encounters with newer scenarios. I would be disappointed if they didn't mix and match encounters from various sets. They would be missing out on a lot of possibilities that way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53091-old-quest-cards-after-deluxe-expansion/?do=findComment&comment=527567","commentId":527567,"userName":"Rashley","timestamp":1315918868,"content":"I wouldn't worry about those 'old sets' becoming obsolete.  There are plenty of people out there coming up with their own scenarios.  I myself am just in the process of getting my group to playtest 2 of my new scenarios just using core sets in different combinations.  There is as much fun in designing new scenarios as playing them.  In my opinion, more will be 'wasted' with buying more than 1 copy of each set just to make the game easier.  Sorry FFG, but you make enough money out of me as it is.  Good game though.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53091-old-quest-cards-after-deluxe-expansion/?do=findComment&comment=527578","commentId":527578,"userName":"HilariousPete","timestamp":1315919663,"content":"Svenn said:\n\n \n\nSince the core set will be required anyway it would make sense that they would continue to use core set encounters with newer scenarios. I would be disappointed if they didn't mix and match encounters from various sets. They would be missing out on a lot of possibilities that way.\n\n \n\nYes, I'd agree with that. Though I think FFG will sparsely use the core encounter sets. The Dol Guldur Orcs are used in 4 of 6 available (up to now) scenarios, I think they want to give them a break. And for other sets, like Spiders of Mirkwood, it'll be hard to explain what a forest spider is doing in Moria. But Sauron's Reach e.g is pretty versatile and has only been used in 1 scenario (Journey Down the Anduin). I'm pretty sure we'll see this encounter set again.\n\nEdit: Ah, no, I'm wrong, it's also used in Hunt for Gollum ;-) But I still think we will see it again\n\n "}]}