{"url":"https://community.fantasyflightgames.com/topic/53134-unique-cards/","title":"unique cards??","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53134-unique-cards/?do=findComment&comment=527925","commentId":527925,"userName":"richsabre","timestamp":1315991841,"content":"ive heard people talk about them however i cannot find any reference to these in the rules or on the cards- what are they? someone said celebrians stone was one and only 1 unique card can be in play at a time, but i only see that its restricted and that means a hero can only have 2 of them..right?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53134-unique-cards/?do=findComment&comment=527930","commentId":527930,"userName":"Dam the Man","timestamp":1315992388,"content":"\"These cards are referred\nto in the game as “unique.” They are marked with\na ‰ symbol before their card title to indicate their\nuniqueness.\nIf any player has a unique card in play, no player can\nplay or put into play another card with the same title.\nAny attempt to do so will fail to the extent that the card\nattempting to enter play remains in its current location\n(hand, deck, discard pile) and does not enter play. This\nrule applies to all unique hero, ally, attachment, and\nevent cards that might enter play.\" (p. 8)\n\n Unique symbol didn't want to copy-paste, but you can see it on the page mentioned."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53134-unique-cards/?do=findComment&comment=527931","commentId":527931,"userName":"DurinIII","timestamp":1315992615,"content":"Couple things friend; Celebain's stone is a Unique card in that it has a black symbol next to it's card name, this symbol means it is unique and only one card of that name can be in play at a time. Same with Steward, Farimir, etc... Also, in the core set you may have noticed that you only received one of some cards. This by default makes those cards harder to obtain a set of three of (and I believe it is simply a marketing gimick). So yes, there are \"unique\" cards, look for the black round symbol next to the card name. You can play up to three copies of that card in you deck, but only one can be in play at a time. Happy Gaming!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53134-unique-cards/?do=findComment&comment=527973","commentId":527973,"userName":"richsabre","timestamp":1315999686,"content":"Ha! thanks for that, been playing for months and never noticed that rule, still i only have 1 core set so doesnt impact me alot solo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53134-unique-cards/?do=findComment&comment=528117","commentId":528117,"userName":"Ichirou989","timestamp":1316018123,"content":"Seems that a lot of people I've encountered at least miss this rule.  Either that or they forget the bit about one card only no matter how many players are in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53134-unique-cards/?do=findComment&comment=528340","commentId":528340,"userName":"Rashley","timestamp":1316063863,"content":"I wonder if this is the reason why so many people are saying the game is too easy?  With multiple 'Stewards', 'Faramir' and heaven forbid 'Gandalf'' allowed at the same time, poor old Sauron would stand no chance!  Let's start up a petition.  GIVE THE BADDIES AN EVEN BREAK!  Without them, the Goodies would be a waste of time.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53134-unique-cards/?do=findComment&comment=528586","commentId":528586,"userName":"Vyron2","timestamp":1316098643,"content":" Hahaha! Imagine Gandalf cloning himself like Mr. Smith in Matrix :DDD LOL, pooooooooooooor Balrog and poooooooooor Sauron :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nGive EVIL A CHANCE! DON'T USE GANDALF TOO OFTEN! POOR CREATURES! ORCS ALSO HAVE FEELINGS!\n\n \n\nbut yeah, it IS possible to miss the icon in front of the names... then again, it would be cool to use 12 aragorns as heroes... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png])))"}]}