{"url":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/","title":"Are mixed decks really better?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528194","commentId":528194,"userName":"peterstepon","timestamp":1316033429,"content":"What I am now saying might be heresy, but... are mixed decks really better?\n\nI have been trying mixed decks with no luck.  I find the following problems.\n\n1/  Too many cards dilutes everything.  Mono decks have 30 cards which are a better bet than 50 cards\n\n2/  The lack of resource tokens dilutes the ability to play cards.  I would rather have a steady stream of resources which allow me to play a good hand of cards all the time.\n\nI just had an unfortunate situation with 2 mixed decks where I tried a scenario and basically gave up after the third turn because the situation seemed hopeless (the second scenario from the core deck).  I find playing 2 mono decks works best for me.  If anyone can correct my gameplay I would much appreciate it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528214","commentId":528214,"userName":"lleimmoen","timestamp":1316035114,"content":"Yes. More spheres make decks better. First, I had only tried 2 sphere decks, now I mostly just play 3 sphere - and they do work much better for me. This is more true the less players play, I think, but I would stand for it as a general rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528216","commentId":528216,"userName":"peterstepon","timestamp":1316035372,"content":"I have heard about 3 sphere decks, but never tried.  Can you give be a list of the deck that you use.\n\nIn addition, is it true that a 3 sphere deck works better solo than having, say, 2 three sphere decks or 2 two sphere decks (or even 2 mono decks)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528237","commentId":528237,"userName":"lleimmoen","timestamp":1316041106,"content":"I will gladly post my 3 sphere decks here tomorrow. Going to bed now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528251","commentId":528251,"userName":"gamestar10","timestamp":1316044602,"content":"I made the mistake of building a mixed deck with no \"theme\" at first. My friend and I failed twice on a quest so we stripped the decks back down to mono and replayed the quest.  Fail. We then looked through the decks and removed cards that weren't working and added cards from the same sphere or one other.  We ended it up two winning decks for that quest.\n\nOur standard play now starts with a mono deck and then tweeking between plays to make a deck that fits the quest.  Dual spere works, you just need to build them with a specific theme in mind.\n\nGood Luck :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528254","commentId":528254,"userName":"Glaurung","timestamp":1316045252,"content":"Actually from my point of view the 3 sphere decks is the best for now. You lot of opportunity with this kind of deck cose you can include most best cards from different spheres. Now with neutral songs 3spheres decks even more better. But biggest problem of this deck : mostly of the time those decks cannot lose even 1 hero cose i this case some part of you deck start to be really useless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528336","commentId":528336,"userName":"Rashley","timestamp":1316063241,"content":"In any game with 'factions'/'colour'/'spheres' etc., mixing these will always bring the problem of matching.  The advantage gained in covering a weakness in a certain mono deck, could be offset by not getting the right amount of the right resource at the right time.  This is where the 'Songs' come into their own.  At the moment we only have 'Leadership' and 'Lore', but I am certain the other 2 will be available soon.  If a mixed deck looks a bit 'light' in either of these Spheres, just add the appropriate 'Song' and 'mixing and matching' becomes much easier.  The same could also be said of 'Radagast'.  His extra Resource in 'Creature' strong decks is a must.  We only have 'Eagles' at the moment, but, again I am sure, more creatures will appear.  In 4 player games, mono are by far the best, as you already have everything covered.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528432","commentId":528432,"userName":"gatharion","timestamp":1316082630,"content":" It depends a lot on how many players you have. In a solo game, your chances are generally going to be much better with a multi-sphere deck as they give you a lot more options. However, in a three or four player game you'll generally be much better served by everyone having a mono -sphere deck as you can fully utilize those spheres and will have all of their goodies at your finger tips to share with each other.\n\nTwo player games are somewhere in the middle and the quest you're on can make a difference in terms of which is better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528582","commentId":528582,"userName":"Vyron2","timestamp":1316098462,"content":" agree with the above posters... but this problem pertains to any \"color-based\" ccg - e.g. magic, you could argue, that mono decks are better, because you \"never\" have mana problems, at the beginning (alpha, beta) that may have been true  - but with the upcoming of more and more cards history has proven the exact opposite...\n\nwhile it is true for the core set (still some people out there with only that), that mono decks, esp 30 are more powerful as e.g. 50 card mono core set decks, and in general playing with more players, it is useful to have every one concentrate on one theme (remember - jack of all trades, master of none :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]), this is SLOWLY changing with the APs and the neutral cards...\n\n \n\nI think in future, we will definitely see more neutral cards (imagine a NEUTRAL deck :DDD), as well as \"MULTICOLOURED\" cards! e.g. tactics card, but can also be payed with leadership resources, if ... blablabla\n\nAs we are still in the very beginning of the game - heck, it's not even a YEAR old :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png], we have limited resources, but the first BIG leap will be the deluxe pack which I cannot wait to get into my hands... Alas, my sweet Dwarfs :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] (never though I'd utter such a sentence :DD)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528717","commentId":528717,"userName":"Eryx_UK","timestamp":1316111689,"content":"The problem with LotR in this case is that when you start to add more spheres you weaken the deck. This isn't Magic, and my experience with the game suggests that sticking with one sphere is the way to go. I think to make it work with two (three is right out IMO) you need to be very very good a deckbuilding. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528735","commentId":528735,"userName":"lleimmoen","timestamp":1316114627,"content":"At the moment I have utilized three decks, I will start with one of those. It is perhaps the most boring of the three as well as least thematic but it is probably most versatile to scenarios and can do well solo although it is still better coop deck as it lacks some serious attacking power.\n\nAnd I appologize in advance to those who own one core set. They may not be able to replicate it, unless they use proxies (which I think is alright). Each player card beside heroes is used thrice.\n\nBeravor, Théodred, Éowyn\n\nHenamarth Riversong, Longbeard Map-maker, Daughter of the Nimrodel, Son of Arnor, Faramir, Northern Tracker, Gandalf\n\nProtector of Lórien, Steward of Gondor, The Favour of the Lady, Unexpected Courage, Forest Snare\n\nStrider's Path, Sneak Attack, Ever Vigilant, A Test of Will, The Galadhrim's Greeting"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53168-are-mixed-decks-really-better/?do=findComment&comment=528910","commentId":528910,"userName":"Titan","timestamp":1316159321,"content":"In my opinion, 3 and even sometimes, a splash of a 4th sphere is the best way to go. There are some scenarios, (Gollum) which can be easily beaten by a 2 sphere(Leadership,Spirit) deck. But most everything else, works best with multiple spheres. It can be tricky, you need good timing and careful planning to manage your resources(this is really the most challenging part of it) but the benefits are tremendous. Think of the advantages of Beravor with Unexpected Courage, a Northern Tracker simultaneously getting rid of locations while Faramir pumps up the willpower, returning Beorn with Stand and Fight, Gloin with Self Preservation, etc. You won't get these combos with mono decks. \n\nDon't get me wrong, though. I think that eventually mono decks will be very playable as the card pool expands. It's just that we are not there yet.\n\n  "}]}