{"url":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/","title":"Any way to pump up Dunheres strength using core set only?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529303","commentId":529303,"userName":"mr.thomasschmidt","timestamp":1316224931,"content":" Hi. I was wondering is there's any may to make Dunhere stronger using only the core set? I ask because I have read some posts from various threads that some uses Blade of Gondolin to make him stronger but think this might not be allowed? Dunhere being spirit and BoG being a tactic attachment card.\n\nAny suggestions?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529305","commentId":529305,"userName":"Dam the Man","timestamp":1316225368,"content":"Blade's only restriction is \"attach to a hero\", compared with Burning Brand that can only be put on a Lore character. But unless you're rolling in Orcs, 2x Dwarven Axe is better for him. Non-permanent options are For Gondor! and Blade Mastery. Also, how would you attach anything (like the Mathom on a location), when locations don't have any sphere?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529307","commentId":529307,"userName":"Mighty Jim 83","timestamp":1316225972,"content":"When you play a card from your hand, there are two things you have to bear in mind - first is its cost and sphere, which means you need the right number of resources of the right type. The next is restrictions on the card (attach to a hero, restricted etc.) Once you've paid for the card in the first bit, you can attach the attachment to anyone you like, provided they meet any restrictions in the second part, it doesn't have to be the same sphere, or even one of your own characters, it can be another players.\n\nAs the previous post said, Blade of Gondolin and dwarven axe are the two main ones in the core set, blade of gondolin only works against Orcs, dwarven axe is permanent, but only +1 as Dunhere isn't a Dwarf (maybe in Kazad-Dum, we'll get an attachment to give him the 'dwarf' trait?)\n\nThe early APs have much simpler options for boosting strength - Dunedain mark, Dunedain warning, Dunedain Quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529324","commentId":529324,"userName":"mr.thomasschmidt","timestamp":1316229177,"content":" Okay sweet :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] I thought the specific spheres attachments had to be applied to the specific spheres characters. Might be cause to my experience with CCG's :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] This will make it a little easyer for my :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Thanks\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529335","commentId":529335,"userName":"Will Fuqua","timestamp":1316236647,"content":"Maybe it's just me, but I like the Blade of Gondolin.  Sure it only gets a +1 against Orcs, but while using it you get a progress token on the quest for attacking and killing a enemy.  If you're trying to make short work of quest, it can help.  However if you're using Dunhere as a sniper, sure the constant +1 is great.  I tend to use Dunhere and Northern Tracker when running 'Journey Along the Anduin' so that I can take care of most enemies without them attacking me and getting rid of locations without the penalties you get for going there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529368","commentId":529368,"userName":"Puzzle2","timestamp":1316249076,"content":" Out of the core set Blade of Gondolin and Dwarven Axe are your only choices to boost attack permanently. As pointed out, Blade is a little more situational, but it also costs only 1 resource and has the added bonus of advancing the quest when Dunhere defeats an enemy. These two options might be something you switch in and out depending on the encounter you are running. If it is high in orcs, go with the Blade, if not go with the Axe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529371","commentId":529371,"userName":"scottindeed","timestamp":1316250034,"content":" I love using Dunhere (hence my Avatar).  I had him with all three Dunedain Marks against Conflict at the Carrock for taking out the Trolls from the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529375","commentId":529375,"userName":"Puzzle2","timestamp":1316251006,"content":"scottindeed said:\n\n I love using Dunhere (hence my Avatar).  I had him with all three Dunedain Marks against Conflict at the Carrock for taking out the Trolls from the staging area.\n\n\n\n \n\nExcellent point. Once you buy the first AP (The Hunt for Gollum) Dunedain Mark will become your go-to attack boost. With a cost of only 1 leadership resource and a permanent +1 to attack it is a must have if you run with any leadership heroes in the mix. This is also the first attachment that you can transfer from one hero to another, which means if something happens to Dunhere you don't have to lose this attachment.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529545","commentId":529545,"userName":"player582283","timestamp":1316289795,"content":"Mr.Thomas..\n\nOne point that is a little ancilliary to your post... you mentioned constraining the choices to the core set.  I would highly recommend the adventure packs.  The player cards and heroes are excellent additions (someone already mentioned Dunedain Mark - really nice AT boost card) and the quests are very intriguing.  They play very different from each other and the core quests.  It's a fun challenge to have one deck that can handle all of them or even to build different decks for their challenges."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529716","commentId":529716,"userName":"mr.thomasschmidt","timestamp":1316340520,"content":"Woz said:\n\nMr.Thomas..\n\nOne point that is a little ancilliary to your post... you mentioned constraining the choices to the core set.  I would highly recommend the adventure packs.  The player cards and heroes are excellent additions (someone already mentioned Dunedain Mark - really nice AT boost card) and the quests are very intriguing.  They play very different from each other and the core quests.  It's a fun challenge to have one deck that can handle all of them or even to build different decks for their challenges.\n\n\n\nThanks for your info. However, I already have the 3 released adv. packs. But I haven't finished the core set quests yet and wanna do this before going on to the adv packs. Then when everything is beaten I'll try all the quests with a mix of all cards :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] This is a nice way not to make the quests too easy and just run through the game as I can see is the problem in some cases. I wanna try with 1x core set and 1 of each adv pack. Then investing in an extra core set for multiplayer later on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53278-any-way-to-pump-up-dunheres-strength-using-core-set-only/?do=findComment&comment=529850","commentId":529850,"userName":"player582283","timestamp":1316366053,"content":"Gotcha...sounds like something I would do..."}]}