{"url":"https://community.fantasyflightgames.com/topic/53296-glorfindel/","title":"Glorfindel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529475","commentId":529475,"userName":"lleimmoen","timestamp":1316272357,"content":"As he is one of my most favourite character (inlcuding his pre-death fares) of the universe discovered and written about by mr Tolkien, I shall credit him a thread.\n\nAs I am a fan all the way of the character in the stories, I am totally torn as being a fan of his card representation in this game. I have previously argued he is good, and that he is not nearly as good as he should have been. To take the perspective in account, he was probably one of the most powerful characters living in Middle-earth at the time period. He could stand against the Black Riders, even drive three of them off just by himself. How was that supposed to be transformed into the game? Perhaps a Willpower being 4, Attack 4, Defense 2, Hit points could have been 4, that being 14 cost would have probably been too much for many to consider, especially in contrast to Éowyn who would still quest the same and cost 5 less. So, coming back to the stats which are alright - although you can hardly use both the Willpower and Attack at the same round, there probably should have been a much more powerful ability.\n\nAnd that would not have taken much. If he were to be a healer, his ability just could have been a response instead of action, making it much more potent to save characters from sudden death. And the restriction needed not be to once per round since you have to pay for it anyway. It is in high contrast to Beravor who can use hers many times over as long as you get her ready for it.\n\nWhat do others think?\n\nThat all being written, I still find Glorfindel probably the most potent hero for Rhosgobel - even though he can only heal Wilyador once. He can help heal others and his Willpower (in combo with his good health) is also of great help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529494","commentId":529494,"userName":"Trantor3","timestamp":1316278343,"content":"Actually, I don't think about these things too much. I think several ideas are really well-put into the cards, like the two ways in the Mirkwood scenario and how stage 2B in the Anduin scenario is handled (more encounters, but no engagement checks), but I don't think this expands to the heroes, their stats and their abilities.\n\nAbout Glorfindel as a hero in general, I'm sorry, but I think he is actually the weakest  hero in the game so far. His extremely high threat is too off-putting for me. Mostly, you just send him questing anyway, and Eowyn is just so much better than him at that. His ability isn't very useful, and the one point you can heal Wilyador will rarely make a difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529600","commentId":529600,"userName":"Mighty Jim 83","timestamp":1316305397,"content":"I'm hoping for something in Kazad-Dum to make Glorfindel finally rise to the level he should be - maybe an attachment that reads \"attached hero gets +1 attack, +1 defence when fighting a Nazgul or a Balrog (+3 attack and +3 defence if attached character is Glorfindel)\n\nanyone who can kill a Balrog deserves better stats than 331, and yes the special ability is a bit wishy-washy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529618","commentId":529618,"userName":"Glaurung","timestamp":1316310152,"content":"Actually is a big shame for FFG!!! They make one of the coolest hero of Middle earth so useless!!! I like him in the book a lot and in Decipher Lotr tcg he was really cool!!! When i see the game first time i sow him and say my self :wow this guy will be in my deck. But practically now he is useless. Sham for FFG again!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529620","commentId":529620,"userName":"Dam the Man","timestamp":1316310966,"content":"He was an expensive, 8 prowess, 9 body Warrior/Sage in Meccg, with barely enough influence to control Haldir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529783","commentId":529783,"userName":"lleimmoen","timestamp":1316354115,"content":"It is a shame. Even though this is coming from a person who likes the game as much as any. And I really like the idea that there can be some heroes clearly more powerful than others and the threat will balance this out (even to the point that the weaker could become more powerful). However, Glorfindel stats and ability fall flat..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529795","commentId":529795,"userName":"Dam the Man","timestamp":1316355980,"content":"Ironically, I'd say Denethor/Glorfindel/Gloin is probably the best of the four decks I have currently. Him and Gloin do questing when needed to, but they can also attack if allies are there to take care of questing (with Denethor defending of course). If the encounter deck is pinging your characters here and there, his heal can be the difference between live hero and a dead one, especially before other healing shows up. Since three of the four decks have a starting threat level of 29, his 12 doesn't really matter that much in the grand scheme of things. Art is horrid though, but still better than Celeborn from Meccg partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529929","commentId":529929,"userName":"Glaurung","timestamp":1316383849,"content":"Dam said:\n\nIronically, I'd say Denethor/Glorfindel/Gloin is probably the best of the four decks I have currently. Him and Gloin do questing when needed to, but they can also attack if allies are there to take care of questing (with Denethor defending of course). If the encounter deck is pinging your characters here and there, his heal can be the difference between live hero and a dead one, especially before other healing shows up. Since three of the four decks have a starting threat level of 29, his 12 doesn't really matter that much in the grand scheme of things. Art is horrid though, but still better than Celeborn from Meccg partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif] .\n\n\n\nHmmmm Starting threat 29. How you will deal with troll in Anduin scenario????"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=529984","commentId":529984,"userName":"Dam the Man","timestamp":1316394985,"content":"Glaurung said:\n\n \n\nHmmmm Starting threat 29. How you will deal with troll in Anduin scenario????\n\n\n\nKill it lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] ? Denethor blocks, he should have Protector on him, then Forest Snare. Though should mention that I don't really play solo-solo games, I prefer to pair up two decks and play. Since max players for us (when my friend and I play) is 2-player, helps get perspective on what works and what doesn't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=530013","commentId":530013,"userName":"Glaurung","timestamp":1316404094,"content":"Dam said:\n\nGlaurung said:\n\n \n\n \n\nHmmmm Starting threat 29. How you will deal with troll in Anduin scenario????\n\n \n\n \n\nKill it lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] ? Denethor blocks, he should have Protector on him, then Forest Snare. Though should mention that I don't really play solo-solo games, I prefer to pair up two decks and play. Since max players for us (when my friend and I play) is 2-player, helps get perspective on what works and what doesn't.\n\n\n\naaaa ok. With 2 players yes is different picture. In solo game will be more difficult cose you have only 1 turn to prepare and if you starting hand no good you can lose pretty quick."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=530207","commentId":530207,"userName":"lleimmoen","timestamp":1316437842,"content":"I have Glorfindel with Eleanor and Legolas for the starting threat of 28, so not that big of a deal. And the deck is good but still, the initial concern stays. I used to play Glorfindel with Gloin and Denethor, it is a pretty obvious trio that works well.\n\nI have a deck that starts with the threat of 30. I like that much very much but doing Anduin solo may be a problem, really. I have not played the quest since the expansions began coming."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=530434","commentId":530434,"userName":"Glaurung","timestamp":1316478501,"content":"lleimmoen said:\n\nI have Glorfindel with Eleanor and Legolas for the starting threat of 28, so not that big of a deal. And the deck is good but still, the initial concern stays. I used to play Glorfindel with Gloin and Denethor, it is a pretty obvious trio that works well.\n\nI have a deck that starts with the threat of 30. I like that much very much but doing Anduin solo may be a problem, really. I have not played the quest since the expansions began coming.\n\n\n\nI still play this quest cose fo solo game is still 1 most difficult quest for now. If your deck can beat it solo you will beat all other scenario fo sure. You can make nixe deck working fine against HFG and Carrock but real challenge is Anduin. Try it again and you will see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=530443","commentId":530443,"userName":"player582283","timestamp":1316481354,"content":"Yep.  The deck I have been soloing with primarily wins HfG every time, beats CatC most of the time and wins JtR some of the time.  But with Aragorn, Imahil and Eowyn's starting threat of 32, I just can't take JdtA.  I kill the troll fairly often, but it always seems that I have to use so many power cards, resources and allies fed to the troll and his buddies that I limp along and bad things happen.  Oh well - the plan is to be able to run the table on the Shadows of Mirkwood quests with one deck....still hope for that with 3 left"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=530480","commentId":530480,"userName":"Vyron2","timestamp":1316492315,"content":" Glorfindel was one of the most powerful hero characters in MECCG... I killed many a dragon/nazgul with him back in the days :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nand in Decipher's CCG he was nice, too!\n\n \n\nwell, I mean, it is always the question of story vs cardgame - you can tell a wonderful story, but how can you measure \"strength\" - now one could say, well, benchlifting - but I'd say THAT is not true, functional strength. some people are good with machines, other are not but strong nevertheless....\n\n \n\nwhat I wanted to say - even the Nazgul of DOL GULDUR!!!!!!!!! is to weak in terms of stats... he should have like attack 10 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I think MECCG did a better job representing the Nazgul... Liz Danforth, we love you :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nbut it comes down to scaling - right now, the hill troll with attack 6 and the nazgul are like the uber-creatures... looking forward to the balrog, if at all.... but it would be out of  \"proportion\" to inflate 1-2 characters and leave the rest to be \"normal\"... heck, even gandalf should deal 10 damage - I bet he could kill a hill troll with one strike - ok, max 2...\n\nyou could argue, that if glorfindel and elrond and galadriel and cirdan accompanied the fellowship, it would have been much easier, etc etc but that's not the point - if you include Glorfindel into a \"fellowship\" you have to turn him down gamewise, otherwise it's just Black Lotus all over again, or whatever...\n\nI think he's just fine... so far there is no hero who is toooo good or toooo weak - they simply complement each other..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53296-glorfindel/?do=findComment&comment=530481","commentId":530481,"userName":"Vyron2","timestamp":1316492315,"content":"sorry, double post..."}]}