{"url":"https://community.fantasyflightgames.com/topic/53314-ranged-rule/","title":"Ranged Rule","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53314-ranged-rule/?do=findComment&comment=529578","commentId":529578,"userName":"dhrocks","timestamp":1316299668,"content":"Hi everyone,\n\nI purchased this wonderful game only two days ago and I am having a blast playing it.\n\nOne rule that has me confused is the ranged rule.  Can someone please confirm that this rule is only usable in two player mode? Or is this an optional?\n\nI have done some searches and some sites are saying (Board Game Geek) that this rule only applies in 2 player mode.  Other sites contradict this answer.\n\nCould someone please shed some light on this matter for me? I realize that this rule has probably already been discussed many times, but I can't seem to find a credible answer.\n\nThank you in advance!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53314-ranged-rule/?do=findComment&comment=529584","commentId":529584,"userName":"player582283","timestamp":1316301495,"content":"The primary benefit of ranged, attacking creatures engaged with another player, is only going to come into play with multiple players (or multiple decks if you try soloing with 2 decks)\n\nHowever, we've seen it come into play in at least two other ways so far...there is a tactics card that can only be used by exhausting a ranged character and ranged characters have a unique use in A Journey to Rhosgobel - the most recent adventure pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53314-ranged-rule/?do=findComment&comment=529602","commentId":529602,"userName":"dhrocks","timestamp":1316306263,"content":"Thank you for this,\n\nSorry you said 'benefit' - I'm still unclear how to interpret this rule.  If I'm playing solo, does the ranged rule mean that characters (e.g. Legolas) with this ability cannot fight in combat?\n\nCheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53314-ranged-rule/?do=findComment&comment=529616","commentId":529616,"userName":"player582283","timestamp":1316310029,"content":"Sorry for not being clear DHRocks.  Ranged characters can still attack creatures that you are engaged with in the same manner as other characters.  Ranged gives them the option to attack creatures engaged with another player - the benefit I alluded to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53314-ranged-rule/?do=findComment&comment=529630","commentId":529630,"userName":"dhrocks","timestamp":1316314900,"content":"Thanks mate.  Really cleared it up now!"}]}