{"url":"https://community.fantasyflightgames.com/topic/53408-im-on-a-roll-catc-beaten-solo/","title":"im on a roll, CatC beaten solo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53408-im-on-a-roll-catc-beaten-solo/?do=findComment&comment=530350","commentId":530350,"userName":"richsabre","timestamp":1316457570,"content":"well after months of only having won mirkwood, ive recently beaten HFG twice solo and Conflict at the Carrock solo just now, with an end score of 29. used theodred, aragorn and eowyn, i really kept my threat low allowing me to pick off the trolls one by one before they could engage, with grimborns 4 attack and aragorns 5 attack (with 2 dunedain marks) i breezed through."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53408-im-on-a-roll-catc-beaten-solo/?do=findComment&comment=530372","commentId":530372,"userName":"Puzzle2","timestamp":1316461710,"content":" Congrats on the victory. I have only played solo myself and I can say winning a scenario is so gratifying after losing several times in a row. I actually beat CatC this afternoon myself, and although it was the third time (out of 8) it was by far my best score. I think I might try a new deck now to see what happens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53408-im-on-a-roll-catc-beaten-solo/?do=findComment&comment=530415","commentId":530415,"userName":"Glaurung","timestamp":1316475930,"content":"Carrock, Carrock....... I win solo many times. 2 times i play 2 players game against Carrock and both time we lose!!!! Very cool!!!!\n\nI cannot wait to play again!!! \n\nStill have some question about sucked cards::::\n\nWhen i get sucked card on my hero and he is exhausts at the moment he will be ready in the refresh phase or not???\n\nThe resources still left in his pool, can i use it????\n\nCan i take some damage on him from Treachery cards or undefended attack????\n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53408-im-on-a-roll-catc-beaten-solo/?do=findComment&comment=530431","commentId":530431,"userName":"radiskull","timestamp":1316478281,"content":" Sacked! states that a hero cannot \"Attached hero cannot attack, defend, commit to a quest, trigger its effect, or collect resources.\"\n\n \n\nThis is a complete list of all the things Sacked! prevents a hero from doing.  It does not prevent it from readying.  It does not prevent a player from using its resources.  It does not prevent a player from playing attachments on it.  It does not prevent a hero from taking damage, either from Treachery or from undefended attacks.  It does not prevent a hero from dying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53408-im-on-a-roll-catc-beaten-solo/?do=findComment&comment=530437","commentId":530437,"userName":"Glaurung","timestamp":1316478952,"content":"radiskull said:\n\n Sacked! states that a hero cannot \"Attached hero cannot attack, defend, commit to a quest, trigger its effect, or collect resources.\"\n\n \n\nThis is a complete list of all the things Sacked! prevents a hero from doing.  It does not prevent it from readying.  It does not prevent a player from using its resources.  It does not prevent a player from playing attachments on it.  It does not prevent a hero from taking damage, either from Treachery or from undefended attacks.  It does not prevent a hero from dying.\n\n\n\nYes you right and your logic is gamer logic as i have too.\n\nBut FFG already show us some unlogical things good example is Stand and Fight so i just want to be sure about.\n\nI start to play this game from begining and there already change a lot of things from first FAQ to second so you never know. But still i think sacked should to play like as say on the cards. This is iron logic and is work in all kind of card games but not this one sometimes."}]}