{"url":"https://community.fantasyflightgames.com/topic/53426-nightmare-mode-everything/","title":"Nightmare mode everything","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53426-nightmare-mode-everything/?do=findComment&comment=530490","commentId":530490,"userName":"Khaden","timestamp":1316494944,"content":"Just finished a grueling night of doing every scenario available in nightmare mode, two player.  One party made up of Glorfindel, Thalin, and Legolas.  The other was Imrahil, Eleanor, and Eowyn.  The first party was mostly an eagle themed deck with a couple of Radagasts.  Good fun!  Just wondering if anyone else has tried this out?  I think it took us about 3 and a half hours but it was a lot of fun.  Just BARELY made it too, one of us was at 49 threat when we beat the last scenario haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53426-nightmare-mode-everything/?do=findComment&comment=530724","commentId":530724,"userName":"Kiwina","timestamp":1316527519,"content":" That is pretty awesome.  I haven't passed the Journey to Rosgobel successfully yet, so I haven't even considered doing that yet.  I do want to Nightmare the Shadows of Mirkwood cycle once it is completed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53426-nightmare-mode-everything/?do=findComment&comment=531481","commentId":531481,"userName":"Khaden","timestamp":1316673256,"content":"Well after reading the FAQ I realize now that my buddy and I were doing Nightmare all wrong... It feels like a hollow victory now.  We must go back and conquer it the real way now!  (We were leaving our allies and attachments in play after each scenario... heh)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53426-nightmare-mode-everything/?do=findComment&comment=532185","commentId":532185,"userName":"scottindeed","timestamp":1316789164,"content":" I just beat the three core scenarios using two decks (but not in Nightmare mode).  Just separate games, but using the same two decks each time.  \n\nThe first deck was Prince Imrahil, Aragorn and Legolas.  A variety of Leadership cards, Radagast and all the Tactics Eagle cards I could get my hands on.  Some nice combinations came out like using Borne Aloft on a Snowborn Scout, which readies Prince Imrahil and allows the Scout to be played again next turn, to re-use his Progress token ability.  Also using Parting Gifts on a Steward of Gondor enhanced Aragorn, to move Resource tokens to Legolas was very useful.\n\nThe second deck was Denethor, Berevor and Dunhere.  This had the usual suspects like Protector of Lorien, Northern Trackers, Galadrim's Greeting, Daughter of the Nimrodel etc.  A new favourite card of mine has to be Burning Brand which makes Denethor and even better defender.  Especially useful when defending against Beast masters and the Nazgul of Dol Goldur.\n\nTime to take them on to the Shadows of Mirkwood quests..."}]}