{"url":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/","title":"Just Getting into the game: Should I get two Core Sets?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=530931","commentId":530931,"userName":"Rhizzy","timestamp":1316561567,"content":"I've just ordered the core set and Adventure packs. Likely to be playing mainly solo with a few 2 player sessions. Should I immediately place an order for a second core set? Assuming of course I actually enjoy playing this as it is my first experience playing an LCG.\n\nIs it just too difficult deck building for solo with just the one core set?\n\n \n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=530950","commentId":530950,"userName":"Narsil0420","timestamp":1316566227,"content":"I say no, it's a great experience with just 1 core set. You waste so much money and so many cards if you buy multiple packs. Basically you're only using 50 of the 250 cards with the second core set. What a waste, totally unnecessary! I've been obsessed with this game for a year now (ever since it was announced) and I've never felt the need to buy an extra core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=530953","commentId":530953,"userName":"KlAve","timestamp":1316566610,"content":"Narsil0420 said:\n\nI say no, it's a great experience with just 1 core set. You waste so much money and so many cards if you buy multiple packs. Basically you're only using 50 of the 250 cards with the second core set. What a waste, totally unnecessary! I've been obsessed with this game for a year now (ever since it was announced) and I've never felt the need to buy an extra core set.\n\n\n\nSeconded. After many many plays, I am at a point, where I am considering getting a second core set, but I have been very satisfied with the playing experience provided by the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=530961","commentId":530961,"userName":"player582283","timestamp":1316568544,"content":"I'd go with one core set to try it out and get a feel for the game.  For the money for the 2nd core set, you can almost pay for the 3 expansions that are out - which I would recommend doing as they introduce new quests that play very differently than the core set quests and helpful player cards/heroes.\n\nYou can be competitive playing solo with one core set.  I have only one core set  and the expansions and do fine solo (except for Escape from Dol Goldur of course!) \n\nIf you want to introduce buddies to the game, a second core set may be worth the investment.  You can ( I have many times) split up one core set among two easily enough, but you'll have a lot more flexibility in decks going with 2 sets if you are going to try to play 2 or 3 players down the road."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=530979","commentId":530979,"userName":"pumpkin","timestamp":1316574185,"content":"I agree with Woz, there is no need for a 2nd core set immediately and there is a good card selection out there with the adventure packs now.\n\nBut if you intend to play regularly with two or more players, then a 2nd set may be worthwhile, a 2nd set is the only way for everyone to pack 3 Gandalfs (unless you use proxys), and with a 2nd core set although there is wastage, it allows you in single player to comfortably pack 3 of the more powerful and therefore rare cards in a single core set.\n\nI'll admit, I got two, and then use proxys for the remaining missing cards to allow me to pack 3 of each card so far released.\n\nWith two core sets, it does mean you can have the two solo playable adventures from the core set ready to go at any time without the need to re-sort your cards, so there is some value in the excess encounter cards from the 2nd core set - but that more of bonus for having the excess cards, its not a reason for buying them in the first place.\n\n \n\nAs others have said, stick with one initially, and then see if you are desperate to have more copies of some of the single cards from the core set - and then get a 2nd one.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531015","commentId":531015,"userName":"Rhizzy","timestamp":1316584708,"content":" Thanks for the advice. Vey much looking forward to getting into this. Should arrive in the post tomorrow! Have been reading some of the posts on here for deck ideas and clarifying various rules etc. \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531046","commentId":531046,"userName":"Oshio","timestamp":1316591992,"content":"Though I agree that one core set is good for testing the game to see if it's something that you enjoy, I will be the devil's advocate and say that once you decide that the game is for you, a second core set is very necessary.\n\nThe problem with the game at this point is a problem inherant in the LCG structure: there just aren't enough cards. I love deckbuilding and the more options the better, and right now there aren't a lot of tough choices in deckbuilding - most good cards are clearly superior to others. With a single core set you are very limited, as there aren't a lot of cards that exist in 3x quantity. While I'm on the fence about getting a third core set to really lock down the 3x rares (I'm currently only playing with one of the 1x core set cards, Dwarven Tomb, and I've got a high quality printed sub that is pretty much indistinguishable from the real cards so I'm not really bothered by it,) getting playsets of all of the 2x cards will greatly enhance your experience.\n\nThis is just my opinion, of course, but having 2 sets really made a difference in filling out decks for me, especially if you plan on ever going solo sphere. So I'd say test out the game, play around with deckbuilding a bit and if it's something you think you'll be supporting in the future, invest in a second set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531055","commentId":531055,"userName":"Bohemond2","timestamp":1316594359,"content":"I will take the opposite position.  I have two core sets and have never regretted the purchase of the second set for a moment.  All of the discussions about how many cards you will use presuppose that you maintain a single deck.  I love having the ability to field multiple decks simultaneously.  With four core sets, I can field four (soon to be five) quality decks and switch between them with ease.  This allows me to introduce the game to new players, sit down with a group of friends who don't have the game and play 4 players, and switch between decks without the constant hassle and booking required if I had a single core set.  I can't wait for the time when I have 9 or 10 decks I can field on any occasion, and the additional core set is what will eventually help to make that a reality.\n\nIn addition, the extra encounter cards allow me to keep each scenario ready to go without constant counting and reshuffling.  Frankly, I may actually buy additional sets of encounter cards (since they sell for under 10 cents a card), just to be able to have all six encounter decks from Mirkwood ready to go without sorting and shuffling.\n\nIf I only played solo, I might be happy with a single core set, but even them I would feel it inhibited deck building.  If you want to play this game with friends who might not own the game, I consider it a must"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531069","commentId":531069,"userName":"DurinIII","timestamp":1316596897,"content":" No, it's a big rip off."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531108","commentId":531108,"userName":"Svenn","timestamp":1316604561,"content":"pumpkin said:\n\nWith two core sets, it does mean you can have the two solo playable adventures from the core set ready to go at any time without the need to re-sort your cards, so there is some value in the excess encounter cards from the 2nd core set - but that more of bonus for having the excess cards, its not a reason for buying them in the first place.\n\n \n\nI believe you also end up with enough leftover for Hunt for Gollum and/or Conflict at the Carrock as well.\n\nI've purchased two sets and I don't regret it at all. As has been said above if you are playing solo you probably can stick with one. I tend to play with 2-4 players and in some cases I'm the only one with the cards so having the extra cards is fairly necessary."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531113","commentId":531113,"userName":"marlow4","timestamp":1316605443,"content":"I'm in the One Core Set camp.\n\nI've had no problems playing 4-player games with one core set. Can't do 50 card decks yet, but I don't consider that a game breaker. I'm not at GenCon, FFG isn't counting the number of cards in my decks at a tourney. Game is just as challenging and fun with 30 or 40 card decks, especially when there are still folks learning the ropes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531133","commentId":531133,"userName":"Trantor3","timestamp":1316608103,"content":"I mostly play 2 player with my girlfriend, and so far, we have been happy with just one Core Set. Starting with the third adventure pack, we really noticed that you now have enough cards to do some serious deckbuilding (for 2 players, that is). With just the one Core Set, deck building for 2 players is simply \"remove the 10 worst cards of one sphere and throw the rest together\". We still had a lot of fun with that, but it's a different thing now.\n\nCheck out the game first, who knows if you even like it? And as long as you plan on purchasing several adventure packs as well, I'd say one Core Set is fine even if you do enjoy the game. If you still like the game after several games and are craving for more of the rarer cards, there is still plenty of time and opportunity to purchase a second Core Set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531221","commentId":531221,"userName":"SlayerOfAllEnemies","timestamp":1316618767,"content":" I second the last comment. One core set is enough, especially if you start buying the adventure packs and soon to be coming out...Khazad-dum Deluxe Expansion Set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531371","commentId":531371,"userName":"ricedwlit","timestamp":1316647479,"content":"Svenn said:\n\nI believe you also end up with enough leftover for Hunt for Gollum and/or Conflict at the Carrock as well.\n\n\n\nActually, with a second core set you'll have enough leftover for Hunt for Gollum, Conflict at the Carrock, Journey to Rhosgobel AND Escape from Dol Goldur as well.  Allows one to set up deck(s) and then say: hmm, let's see what random quest we need to do today!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531478","commentId":531478,"userName":"GhostWolf69","timestamp":1316671732,"content":"As I've explained somewhere else on this forum:\n\nOur group has bought 3 Core Sets per 2 Players.\n\nIn effect each player then gets 1,5 Core set.\n\nThis means you get 3 of all the cards that you only have 2 of, and have to divide the \"singles\" with your friend who shares that third Set with you.\n\nThat is the way we did it and it has worked fine for us.\n\n(Total 4 Players = 6 Core Sets)\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=531581","commentId":531581,"userName":"Eldil","timestamp":1316688006,"content":"I bought two core sets. I think there are a couple good reasons to do this:\n\n1.) You have enough threat trackers for 4 players.\n\n2.) You have enough encounter cards to build all three scenarios without having to switch them around.\n\n3.) You get x3 copies of all but 13 cards.\n\nAfter I got the second set, I made proxies of the remaining 13 cards I didn't have x3 of using the 12 heroes, +1 copy of a card I had x6 which I probably wouldn't use.\n\nViola. x3 copies of everything with very minimal fuss. I'm aware those cards won't be legal on the tournament scene, but... there isn't a tournament scene."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=532318","commentId":532318,"userName":"dbeman","timestamp":1316807821,"content":"Is it absolutely necessary to own two (or more) core sets to enjoy this game? No, it isn't. However after playing this game for a while if you decide that you truly enjoy it you will want to buy a second core set; or at the very least acquire extra copies of particular cards. While there have indeed been a few gems released in the Adventure Paths, thus far I haven't seen anything that is better than running as many copies as you can of cards like Sneak Attack, Galadhrim's Greeting, Unexpected Courage, Dwarven Tomb and a few others. As more deluxe expansions are released the need/desire for a second core set should diminish somewhat.\n\nAs for multiple copies of the threat trackers...I've found that I actually prefer using two ten sided dice to keep track of my threat. Truth be told I use different colored ten siders to keep track of everything.\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=532399","commentId":532399,"userName":"Rhizzy","timestamp":1316827818,"content":" Thanks for the advice. Is interesting to hear the different views on this. My Core set plus the hunt for gollum has turned up in the post. Looking forward to some fun gaming over next few days. Will give it a good play over new few weeks then make a decision on a second core set.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=532416","commentId":532416,"userName":"guciomir","timestamp":1316833122,"content":"I did not have a chance to read all responses here, but I'll add my opinion: I do have only 1 copy of core set and all expansion. I do not feel I am missing anything relevant, I can enjoy the game and I can win against every quest. To be honest, the only advantage of having 2nd core is extra tracker, sneak attack, feint and steward. There are also some other cards, but are not essential.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=532975","commentId":532975,"userName":"A Paperback Hero","timestamp":1316981793,"content":"I find that a 2nd set would be very unnecessary. I just proxied in what I didn't have extras of since I use deck protectors anyway. I just scanned the cards and printed them out black and white and sleeved the cutout card in a sleeve with an used card. As for the 3rd and 4th threat trackers I would just use pen and paper. However I often only play board/card games with one other friend or my wife so I don't expect to need extra cards anytime soon.\n\nIf you really feel the need to get extra cards for a specific or tourney deck, I have seen many places to get individual cards resale. Celebrian's Stone is one of the major cards that comes to mind that would be nice have three. Especially if your playing a leadership/spirit deck with Aragorn in order to increase the odds of get an additional hero with the spirit attribute for resource consumption."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=536191","commentId":536191,"userName":"longagoigo","timestamp":1317623805,"content":"This whole idea of having an extra copy in order to redefine the basic elements of the game as presented sounds a little like having some extra aces up your sleeve when playing poker.  I don't quite understand why you want to take that aspect of the challenge out of the game.  I can understand the idea of trying to put together the best team and equip them appropriately for each mission, but why not keep it within the limits of what's given.  This also applies to what I've read about the lack of value people see in some of the heroes.  This strikes me as overemphasizing winning over the exploration of the variety/replayability that the different characters bring to the story. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=536208","commentId":536208,"userName":"Untergeher","timestamp":1317626584,"content":"At first I didn't consider buying a second core set. I was quite happy with the four starter decks that came with it and we played all the different scenarios to find out more about the individual spheres. Later, however, while waiting for the evasive Hunt for Gollum adventure pack, we wanted to start building two-sphere decks using 50 cards. That's when I dedided to get a second copy of the Core Set and I must say it was worth it, because it gave me the much desired extra options!\n\nDo you need a second core set to enjoy the game? I don't think so. I very much depends on your personal attitude. How important is deck building for you? Are you a completionist? A collector? I also used the extra encounter cards to have more than one quest ready to play against, so there's an extra use for them...\n\nRegarding challenge: I don't think that you make the game too easy when using two or three core sets. But you take out some of its randomness. If I have one Celebrian's Stone in my deck I have to be really lucky to play it. So if you want more consistency you include three copies of each card. But this again depends on whether you're playing with a 30 or 50 card deck! (Since I started using 50 card decks, the feel of the game has changed significantly... But maybe that's just because I love deck building and tweaking... Not for the sole purpose of winning all the time, but to have a deck that's fun to play!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53469-just-getting-into-the-game-should-i-get-two-core-sets/?do=findComment&comment=536346","commentId":536346,"userName":"sputang","timestamp":1317646176,"content":"GhostWolf69 said:\n\nAs I've explained somewhere else on this forum:\n\nOur group has bought 3 Core Sets per 2 Players.\n\nIn effect each player then gets 1,5 Core set.\n\nThis means you get 3 of all the cards that you only have 2 of, and have to divide the \"singles\" with your friend who shares that third Set with you.\n\n\n\nI second that this is the best way to do it.  I was lucky enough to get a friend hooked the first time we played it, so he bought his own set and we split a third.  Now we have enough between the two of us to build 2 good decks with 3 Gandalfs in each and with any other \"uncommons\" that were only 2 to a set.  It really tones down the \"card waste\" this way."}]}