{"url":"https://community.fantasyflightgames.com/topic/53464-tactics-card-question/","title":"Tactics card question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53464-tactics-card-question/?do=findComment&comment=530887","commentId":530887,"userName":"player675019","timestamp":1316547854,"content":"Can cards like Born Aloft and Stand together be put into and used in any deck based on the fact that there is no resource cost associated with player the card, and there are no other requirements?  Meaning can they be put into a single sphere lore, leadership, and spirit?  My assumption is yes. .  Just wanted clarification if anyone knows the answer.\n\n \n\nNew Life"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53464-tactics-card-question/?do=findComment&comment=530890","commentId":530890,"userName":"Bray","timestamp":1316547985,"content":"Rulebook page 12:\n\n\"Cards with a cost of zero do not require a resource to be\nspent in order to pay their cost, but they do require\nat least one hero under that player’s control to have a\nresource icon that matches the card’s sphere.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/53464-tactics-card-question/?do=findComment&comment=530891","commentId":530891,"userName":"Svenn","timestamp":1316548029,"content":"No, this is covered in the official rulebook. You need at least 1 hero with the correct sphere even for a 0 cost card.\n\n> Cards with a cost of zero do not require a resource to be spent in order to pay their cost, but they do require at least one hero under that player’s control to have a resource icon that matches the card’s sphere.\n\nPage 12 in the Official Rulebook."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53464-tactics-card-question/?do=findComment&comment=530892","commentId":530892,"userName":"player675019","timestamp":1316548138,"content":"Thanks Bray, I must have missed that one.  I was searching the rulebook and read over it.  lol. \n\n \n\nNew Life"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53464-tactics-card-question/?do=findComment&comment=530922","commentId":530922,"userName":"TheLightdarker","timestamp":1316560033,"content":"Keep in mind that if you have a song card attached to one of your heroes that grants a resource icon, you will count as having a resource match for that sphere.\n\nFor example, it has been spoiled that the fifth Adventure Pack, The Dead Marshes, will contain a card called \"Song of Battle.\"  This attachment will grant the attached hero a Tactics resource icon, just like Song of Kings and Song of Wisdom does for Leadership and Lore, respectively.  If you have this card attached to one of your heroes, so long as that card is attached you will count as having a hero that matches the Tactics sphere and will be therefore be able to play cards such as Born Aloft (and indeed, any other Tactics cards, as that hero's resources also count as having a \"match\" to the Tactics sphere)."}]}