{"url":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/","title":"House ruling cards to make them playable.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531379","commentId":531379,"userName":"tony35","timestamp":1316651076,"content":"Was playing JtRhosgobel last night and was trying to put in lesser used cards in my deck, just to get them out of the box.\n\nLooking at Gandalf's Search, I thought it might make for a pretty useful card if you could use the effect on the encounter deck, the effect putting 1 of the X cards into play. This way it becomes useful for digging for Athelas or putting an enemy into play that you could blade of gondolin. Plus it would provide knowledge of the encounter deck in a similar way to Denethor / Dark Knowledge does.\n\nI'm going to play a game tonight with this house rule change and see if it makes the card more useful / exciting to play.\n\nAny one got any ideas to make dust-gathering cards more fun?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531404","commentId":531404,"userName":"Mighty Jim 83","timestamp":1316657863,"content":"just discard them to boost Eowyn's willpower, or trigger one the other cards that requires you to discard cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531451","commentId":531451,"userName":"tony35","timestamp":1316667862,"content":"Well even with the current card pool there isn't any point in putting in cards solely as discard fodder. All I was looking for was some improvements to get a bit more variety and fun out of the cards..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531530","commentId":531530,"userName":"Titan","timestamp":1316681776,"content":"I personally find this akin to cheating. A card does what it does and nothing else. Using them in ways they were not intended to be used becomes too much like taking a shortcut and also can upset the balance of the game. I can't find any reason to justify doing this. If a card is bad, then it is bad, all games have them. I would just concentrate on legal combos and who knows, less useful cards can eventually become more useful when the card pool expands and new combos come into being."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531642","commentId":531642,"userName":"lleimmoen","timestamp":1316697516,"content":"Three Lore cards I would change if I could.\n\nGandalf's Search. Draw X cards.\n\nLorien's Wealth. Cost of 2.\n\nBeorn's Hospitality. Heal all heroes in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531802","commentId":531802,"userName":"tony35","timestamp":1316715741,"content":"Regarding cheating: Making cards purposely broken isn't quite what I meant. My thought was based around subtle changes to make an unplayable card more interesting. Custom cards are popping up and retaining balance is very important. I mean if you make stupid good cards then you are just hurting yourself. I play this as a solo game and have no interest in making cards that upset the difficulty level of the game.\n\nFor example thicket of spears, making it so only one of the heroes need be tactics? It is not massively changing the functionality of the card, nor making it do something it wasn't intended to do. Just something small akin to power level errata.\n\nObviously this is a more relevant process during times when the card pool isn't increasing at a constant rate (like the drought between core and HFG)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531803","commentId":531803,"userName":"DrNate","timestamp":1316715857,"content":"The only rulining I would make is to ignore the FAQ. The clarifications are okay but some of the changes are just head scratchers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531824","commentId":531824,"userName":"Titan","timestamp":1316718786,"content":"Tony9 said:\n\nRegarding cheating: Making cards purposely broken isn't quite what I meant. My thought was based around subtle changes to make an unplayable card more interesting. Custom cards are popping up and retaining balance is very important. I mean if you make stupid good cards then you are just hurting yourself. I play this as a solo game and have no interest in making cards that upset the difficulty level of the game.\n\nFor example thicket of spears, making it so only one of the heroes need be tactics? It is not massively changing the functionality of the card, nor making it do something it wasn't intended to do. Just something small akin to power level errata.\n\nObviously this is a more relevant process during times when the card pool isn't increasing at a constant rate (like the drought between core and HFG).\n\n\n\n\n \n\nOh, I get that the card isn't going to be broken. That's not what I meant, either. But think on what you want Gandalf\"s Search to do: search the encounter deck and either pull a needed objective or an enemy you can kill. There isn't a player card that allows you to do this right now, but you are \"creating\" one. And, in essence, making the quest play differently than intended, because now you have a card that would have been revealed under different(less under your control) circumstances or not revealed at all. To me, that's enough of a difference there. I would much rather find a use for a card under the framework it was created, that was my original point. Sometimes, this isn't possible with the current card pool. I guess to each it's own.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53527-house-ruling-cards-to-make-them-playable/?do=findComment&comment=531910","commentId":531910,"userName":"guciomir","timestamp":1316736556,"content":"Gandalf search will become better when Khazad is released as it will be a part of potential combo. I don't say it will be great, but some people will give it a try."}]}