{"url":"https://community.fantasyflightgames.com/topic/53546-question-about-quest-phase/","title":"Question about quest phase","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53546-question-about-quest-phase/?do=findComment&comment=531617","commentId":531617,"userName":"Jaedrian","timestamp":1316694410,"content":"What happens if I don't assign heroes to the quest phase.  Do I still draw to the staging area and calculate threat?\n\n \n\nIs it worth taking some threat to leave cards behind to deal with cards in the engagement area?\n\n \n\nI was playing my first game and getting my butt kicked on the easy quest because my questers are being assigned to quest and they aren't available to defend, and then defenders are tapped and can't be used to attack to kill off things in the engagement area.  Seems very hard to balance right now. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53546-question-about-quest-phase/?do=findComment&comment=531623","commentId":531623,"userName":"richsabre","timestamp":1316694895,"content":"yes you draw regardless, hence the game's a balance between using heros to quest and making sure some are left to fight. Use your ally cards and ready cards to help you manage both at the same time\n\n \n\naragorn for example can spend 1 resource to ready after questing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53546-question-about-quest-phase/?do=findComment&comment=531626","commentId":531626,"userName":"HilariousPete","timestamp":1316695306,"content":"Yes, you still have to draw encounter card(s) and you still need to calculates summed willpower minus summed threat (except the threat of enemies engaged with you, and the threat of the active location).\n\nIf there is no enemy in the staging area, I usually leave 1 hero (or better, an ally) behind for defense, in case an enemy is drawn in the staging step in the quest phase, and the rest is for questing. If there are enemies in the staging are, I leave enough characters behind to defend+attack (and hopefully kill the enemy in 1 round). But this depends on your playing style, and on your threat level (sometimes it can be better to send a character for questing instead of joining the other of your attacking characters, because there's another enemy in the staging area whose engagement cost is just a bit below your threat level and you don't want him to engage you...)\n\nIf you're overwhelmed at first, don't be worried, this usually takes a few games until you know whether it is better to preserve a character for battling or use him for questing... But keep on to the game, it gets really fun :-)\n\nSome hints if you're in lack of non-exhausted characters: Use Aragorn in combination with Steward of Gondor, so he can quest and defend/attack in 1 round. Or prince Imrahil. Snowborn Scouts are also very good (cheap, 1 progress token onto a location, and they can be used as a one-time defender)\n\n \n\n \n\nAh, I've just seen that richsabre already answered your question, but perhaps the other hints are useful"}]}