{"url":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/","title":"Eagle quest - do you win against it?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=532414","commentId":532414,"userName":"guciomir","timestamp":1316832811,"content":"Eagle quest is fun, it needs completely different tactic. My Theodred - Gimli - Eowyn deck switched Gimli to Legolas and I put 3x radagast inside. Playing radagast in 2nd turn is like finding 1 extra athelas, but still I feel I am on mercy of encounter deck. I really need to find 2 regular athelas in the first turns and the victory rate is below 50% for me.\n\nDo you have any deck that is effective against Eagle quest AND can still play against other quests rather succesfully ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=532548","commentId":532548,"userName":"player582283","timestamp":1316869588,"content":"Assuming you mean solo...My primary deck of Aragorn, Imrahil and Eowyn beats Hunt for Gollum every time, Conflict at the Carrock most of the time (~75%) and Journey to Rhosgobel just some of the time (~25%).  It used to be just leadership - spirit but I had to add Lore as a third sphere to get healing for JtR.  The healing does help with CatC also.  I hope that I can evolve the deck with the adventure packs and have one static deck that can beat the full Shadows of Mirkwood cycle.\n\nAgainst the core quests, it's not very good.  Of course it beats Mirkwood, but with these heroes I've never beat JDtA or Dol Goldur.  With the starting 32 threat, I can kill the troll a fair amount of time, but other things build and I expend so many assets (cards and resources) dealing with the troll that I can't close the deal.  A similar deck with Theodred rather than Imrahil used to win JDtA about half the time.  I've given up on Dol Guldur solo with a generic deck for the time being - maybe with more player cards available. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=532549","commentId":532549,"userName":"player582283","timestamp":1316869748,"content":"I should say that I think I can get the win % up for JtR since I've learned the pacing and use of some cards (Gandalf is now a card drawer) better.  With some improvement to my deck from adventure packs I think I can get it to about 50%."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=532553","commentId":532553,"userName":"guciomir","timestamp":1316871480,"content":"I don't know what the win rate my deck has, I did not note the results, but after a disastrous series of defeats, I am not sure if I hit 25%..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533076","commentId":533076,"userName":"Mighty Jim 83","timestamp":1317010246,"content":"0 for 3 on Journey to Rhosgobel so far. 2-player, with decks built specifically for the scenario. This one feels a LOT harder than the last couple- and seems to need a lot more luck: you've basically got to have Radagast early / Northern Tracker (no surprise there) orhave the encounter deck cut you a little slack. so far, we have had none of these - twice we finished the questing without doing enough healing (first time we didn't know, second time by accident) and once Wilyador just got killed because we couldn't find any ways to heal him.\n\nWhat tactics have people had success with on this one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533080","commentId":533080,"userName":"Glaurung","timestamp":1317012773,"content":"I got it yesterday. Play  with my friend 3 games only 1 win. Solo didnt try yet. But sure will be very difficult. \n\nStill in process.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533092","commentId":533092,"userName":"Dam the Man","timestamp":1317014375,"content":"Glaurung said:\n\nI got it yesterday. Play  with my friend 3 games only 1 win. Solo didnt try yet. But sure will be very difficult. \n\nStill in process.\n\n \n\n\n\nDid you change your deck at all Glaurung? IIRC, you didn't have that much Ranged people in your deck (as they are kinda useless in normal solo if you can get better attackers), birdies giving a lot of trouble? You also didn't have Lore represented, so Athelas only way for you to heal?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533152","commentId":533152,"userName":"Mighty Jim 83","timestamp":1317024736,"content":"Managed it this morning, on the 4th attempt, but still needed quite a bit of luck.\n\nI was running a Lore/Tactics minor, second player was Spirit/Leadership minor. Fortunately, we got Steward of Gondor, and even a Northern Tracker before the end (penultimate turn, so didn't do much) - couldn't draw Radagast or Lore of Imladris tho - ended up having to discard Glorfindel to heal one point, bringing Wilyador to 15 damage, with 3 Athelas in play, then throw everything at questing to ensure finishing that turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533186","commentId":533186,"userName":"Puzzle2","timestamp":1317029321,"content":" So far I am 0 for 4, all solo games. I played the first three with some unaltered decks that I have used in the past and I lost convincingly. I tailored a deck with Leadership/Tactics heroes and then a splash of Lore with the songs. This was by far my best outing, but some very unlucky draws both from the encounter deck and from my cards had me lose in the end. \n\nLike Mighty Jim said, I think a little bit of a lucky streak in the draw will be required, but I think I now have the right combination of cards to take it on. We will see if I can get a couple of games this week before the new AP drops and Osgiliath comes to my door. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533456","commentId":533456,"userName":"Puzzle2","timestamp":1317077935,"content":" So I just won for the first time solo on JtR. Final threat of 32 (not that this means too much). Leadership/Tactics deck with Song of Wisdom for some Lore card play (healing cards and card draw). Theodred, Prince Imrahil, and Legolas. I was a bit lucky on my initial draw. Out of the first seven cards I got Steward of Gondor, Dunedain Quest, Song of Wisdom, and a Gandalf.\n\nI used Gandalf for card draw every time except for once on this game. I almost lost it - Wilydor did have 19 wounds but I was able to draw a Lore of Imladris to keep going. Difficult AP, but this makes success that much sweeter!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533461","commentId":533461,"userName":"Frayed","timestamp":1317079064,"content":" My deck of Eowyn, Dunhere and Theodred has beat every quest so far except Efdg, and this one.  I've tried it twice.  My only means of healing Wily in this deck is Radagast and I can advance to the next stage of quest at will with eowyn and escorts, so the only problem is drawing out the athelas.  Without at least two, I have no chance of healing enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533474","commentId":533474,"userName":"player582283","timestamp":1317087112,"content":"With my Leadership- Spirit w/ splash of lore deck, my best chances for sucess in solo has come by pushing hard to get through stage 1 ASAP.  If I'm lucky I clear it on turn 1.  Then I can start scouting for Athelas early with the draw 3; play 1 ability.  Hopefully you can also get rid of some of the nasty encounter cards.  I use Gandalfs for card drawing to get to my Lore of Im.  heals (and in my case the song of wisdom to let me use them) or to kill the *&^% birds that do 2 damage and can't be stopped or killed unless you have Ranged (2 out of 50 cards for me) or Eagles(none).  Mathoms are nice for this too.  I try to get phase II up to around 8 or 9 so that if I get a run on Athelas or healing cards I can push it over the top in one rush - but then you have to manage your will to make sure you don't over do it and progress to phase III.  I then hold off on scouting when I think I have the right cards in play to avoid the extra one damage. Of course, I pray for the Test of Will in my opening hand (or two) and keep 1 spirit resource to counter the nasty treachery cards.  If no athelas, Mountains of Mirkwood are a good pull when scouting as they will let you get the card (healing!) you need from the top 5 of your player deck when you explore them.\n\nI won once with just Radagast healing (out of five tries) before adding in Lore.  I was lucky with the athelas draw. It's hard!  I think I could go a long time without winning with that deck again.  I had to add Lore for healing and swap in the leadership archers to have a way of dealing with the birds and bats - they are a pain!  I think you could build a deck that will win against this one fairly regularly with decent luck, but it's hard to do it with a One Deck to Rule them all play style!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533492","commentId":533492,"userName":"Glaurung","timestamp":1317092353,"content":"Dam said:\n\nGlaurung said:\n\n \n\nI got it yesterday. Play  with my friend 3 games only 1 win. Solo didnt try yet. But sure will be very difficult. \n\nStill in process.\n\n \n\n \n\n \n\nDid you change your deck at all Glaurung? IIRC, you didn't have that much Ranged people in your deck (as they are kinda useless in normal solo if you can get better attackers), birdies giving a lot of trouble? You also didn't have Lore represented, so Athelas only way for you to heal?\n\n\n\nI play with my lore/Leadership deck. Gimly/Eowyn/Theodred i didn try yet against Rhosgobel. But there is no doubt with this deck no chance.\n\nActually this quest request very specific deck. I still in process."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533511","commentId":533511,"userName":"Dam the Man","timestamp":1317097402,"content":"Glaurung said:\n\n \n\nI play with my lore/Leadership deck. Gimly/Eowyn/Theodred i didn try yet against Rhosgobel. But there is no doubt with this deck no chance.\n\nActually this quest request very specific deck. I still in process.\n\n\n\nSong of Wisdom to provide Lore or you did you typo Spirit as Lore? Since you have every sphere of hero except Lore listed there gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533696","commentId":533696,"userName":"Eryx_UK","timestamp":1317134796,"content":"I just completed it first time on solo with one deck. Didn't get a great score (52) but I think the cards came out in my favour to be honest. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533700","commentId":533700,"userName":"Valyrian Steel","timestamp":1317135388,"content":"So far me and my various partner are unbelieveably 6/7 on this quest. I guess we've just been lucky with drawing healing cards/athelas and what-not or else my deckbuilding skills are just that awesome :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] We have ceratinly had our share of terrible teachery cards and hero deaths but seem to make it through in the end. It's been all about timing on rushing stage two to me at this point. My two decks being Spirit/Tactics and Lore/Leadership have beaten every scenario (including osgiliath) and I\"m just building with one core set so I'm very pleased."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=533950","commentId":533950,"userName":"Doom1502","timestamp":1317180437,"content":"I won the first two times solo with great scores. Then played it again after a week and lost very many times before winning one single time with a bad score. So I assume I was really lucky the first times^^ I think when digging for Athelas you really need 3x Lore of Imladris for this quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=534015","commentId":534015,"userName":"GhostWolf69","timestamp":1317193144,"content":"I have never tried Solo\n\nWe have played it Three times. 2 times with Three players and 1 time with only two players.\n\nWe have walked all over that scenario every time...\n\nLast time we completed the first part and Travelled to Rohgsobel during the first questing phase.\nWe always have more Athellas than we need to.\nAnd we are starting to question whether this scenario is a lot easier than its rating or if we are doing something wrong. :-)\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=534328","commentId":534328,"userName":"Frayed","timestamp":1317231039,"content":" Just beat it.  Took several tries.  Used a deck where I had no duplicates of any card.  Glorfindel/Eleanor/Legolas.  Had 5 allies by the time i was at second quest stage.  I got three locations of Forest Grove which allowed me easy access to athelas after.  Eleanor canceled many when revealed effects and ended up claiming all 4 athelas plants due to being equipped with unexpected courage.  Glorfindel died late game, after healing wily of 5 damage, but that allowed me to win the following round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=534341","commentId":534341,"userName":"Bohemond2","timestamp":1317236212,"content":"How does Glorfindel heal the eagle for 5 damage?  Once he uses one heal you should remove him from the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=534369","commentId":534369,"userName":"Frayed","timestamp":1317241233,"content":" Yes he did, was a typo.  He bought me one round by healing in the second to last round. Just needed wily to last one more round due to having 4 athelas.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=538903","commentId":538903,"userName":"rfh0","timestamp":1318070048,"content":"I only play solo and this quest was nearly impossible until I set my deck up to remove and heal as needed. No I beat it every time. The key is to Heal the wounded eagle as soon as you can and as often as you can. Also, the more the the special plant ( objects you find in the encounter deck the better!! ) gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=538911","commentId":538911,"userName":"guciomir","timestamp":1318070661,"content":"It is easy to beat this quest with the deck designed to beat it. But can the deck still score a victory against other scenarios?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53651-eagle-quest-do-you-win-against-it/?do=findComment&comment=538927","commentId":538927,"userName":"Doom1502","timestamp":1318071907,"content":"I set up a deck to beat the 3 AP scenarios and it worked. But Rhosgobel was by far the hardest (and the win obviously the luckiest). I think the key is Lore of Imladris. Without it you have to find many athelas really fast which is basically luck."}]}