{"url":"https://community.fantasyflightgames.com/topic/53668-new-player-travel/","title":"New Player - Travel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53668-new-player-travel/?do=findComment&comment=532625","commentId":532625,"userName":"RotSt","timestamp":1316897449,"content":"When travelling to a newly activated location can you transfere existing progress tonen's from your quest card to the new location. I assume these tokens are then removed with the Explored travel card. This would efectively reduce the number of tokens on your quest card.\n\nIs this the correct way to play the travel cards?\n\nCheers RS"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53668-new-player-travel/?do=findComment&comment=532626","commentId":532626,"userName":"Svenn","timestamp":1316897669,"content":"No, you should not be transferring progress tokens between locations and/or the quest. When you travel to a location it goes next to the quest (out of the staging area) and you keep all the tokens on your active quest. When you go questing you place tokens on the active location first until it is removed and then you go back to placing tokens on the quest until you travel to another location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53668-new-player-travel/?do=findComment&comment=532630","commentId":532630,"userName":"RotSt","timestamp":1316897903,"content":"Thanks for your response.\n\nRS"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53668-new-player-travel/?do=findComment&comment=532890","commentId":532890,"userName":"Ulquiorra","timestamp":1316967114,"content":"What happens if you have multiple LOCATIONS in the STAGING area? During the TRAVEL phase, the first player gets to choose whether or not to travel to one of the locations, so if they choose not to travel does any further progress made go straight towards the QUEST card itself? Or do you have to explore every location that is revealed in the staging area? Hope this makes sense. Thanks for your reply!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53668-new-player-travel/?do=findComment&comment=532913","commentId":532913,"userName":"Svenn","timestamp":1316972579,"content":"This is correct. The first player choose whether or not to travel to a location and which location to travel to (unless a specific card forces you to travel to it, such as the East Blight). If players choose not to travel then they can continue progressing on the current quest. However, this means more buildup of cards in the staging area making questing get harder."}]}