{"url":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/","title":"Troubles with Solo Play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=532832","commentId":532832,"userName":"Svenn","timestamp":1316955240,"content":"I have been trying to play solo some lately and I am having a lot of trouble. When playing with 2+ players I have not lost yet (to be fair I've only played about 4 games with multiple players and mostly Mirkwood) but solo I can't seem to win. I failed Anduin about 4 or 5 times yesterday with at least 2 different decks (dual sphere and triple sphere).\n\nWhat I've noticed solo is that it is difficult to be able to do everything yourself. The best I've come up with so far is that I need to have each of my heroes fill a specific role... 1 for offense, 1 for defense, and 1 for questing. Even with Denethor defending with Protector of Lorien on him I was having trouble due to multiple enemies at one time.\n\nWhen building dual sphere decks I have trouble fulfilling all roles with only 2 spheres. I was originally playing a Tactics/Lore deck, then switched to Tactics/Spirit, and then I tried a Leadership/Spirit/Lore deck. I have built a Spirit/Lore deck with very low starting threat and Dunhere for hopefully making combat a bit easier, but I haven't had a chance to try it yet.\n\nI've also noticed that some things don't scale quite as well... such as in Anduin when I am having to flip an extra card each turn. I can get to this phase pretty quickly using Gimli and Legolas, but my heroes are beat up and end up dying to a treachery or shadow card while I struggle to keep up with questing as I'm flipping 2 cards per turn.\n\nSo, how do you deal with being able to fulfill all the roles with a single deck? Should I forget about a defense hero and potentially have lots of throwaway allies I can use for defending and then counter with some more powerful heroes? Should I try and use low threat heroes so I can have enough time to build up some allies and attachments?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=532834","commentId":532834,"userName":"richsabre","timestamp":1316955680,"content":"ive only ever played solo and have played since its release, ive won everything but anduin and dol guldor, i find that i need to have very good draws from both decks to have an easy time.\n\n \n\ni  usually take a lot of risks to get through the quest cards quickly, such as questing with every hero i have hoping that a treachery or location card will come up and not an enemy, that way i can fly through, but it only takes one bad draw to fall to pieces.\n\n \n\nmy deck has alot of allys to basically sacrifice, thats the other way i get through. also my deck usally has eowyn in there, and aragorn seeing as he can refresh, then an all round character like beravor, or theodred"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=532842","commentId":532842,"userName":"Svenn","timestamp":1316958062,"content":"I was using Eowyn, Legolas, and Gimli and I could consistently get to stage 2, but I always fell apart there. This partially due to being unlucky I guess since I just kept getting enemies and no locations in stage 2 and Hill Troll came up again in almost every game. There was also a game where I had all but 1 damage on each hero... and the treachery came where any player with more than 35 threat deals 1 damage to each of his characters and it took out all 3 heroes at once.\n\nI feel like if I build a deck with enough offense it lacks in either questing power or any sort of healing ability. If I build something that's good at questing and keeping my guys alive I just can't damage the enemies (especially the Hill Troll). I tried a triple sphere deck hoping I could have enough offense from one sphere, defense/healing from another, and questing from the third... but it didn't seem to work too well. It just felt like I wasn't very good at anything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=532843","commentId":532843,"userName":"guciomir","timestamp":1316958422,"content":"Easy solution for Anduin: play low threat heros like Eowyn, Legolas and Theodred. Put some threat reducing cards like Galadrim + multiple ways to play Gandalf. You can play stage 1 very long and build your forces, just don't engage troll."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=532852","commentId":532852,"userName":"DurinIII","timestamp":1316960039,"content":" I am totally in agreement. I play solo 95% of the time, and I get extremely frustrated with the difficulty.  I think this will get easier when the card pool grows. It seems like you pretty much have to play with Eowyn to do well in Solo (assuming you only own 1 starter box...hahaha, I know what our friend Glaurung would say), but I hate the idea of almost having to play with her because her willpower is to freaking high. You really are hurting yourself if you don't play her.  I can't wait for more heroes with better willpower. I mean, why can't we get a hero with a 3 willpower in another faction? I am sure they will come eventually though.  Just some of my thoughts.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=532853","commentId":532853,"userName":"Svenn","timestamp":1316960820,"content":"I was playing with 29 threat so I had to deal with the Troll on turn 2. I just put together a new deck that is 25 threat and includes Dunhere so I can chip away at stuff in the staging area and build up forces for several turns.\n\nThat reminds me... what happens if you end up with more than 8 tokens on stage 1? At one point I had 14 tokens on stage 1 but the troll was still there... do I put all 14 tokens on or do I stop at 8? I put 14 on because there were some goblin enemies that were actually removing tokens from the quest when they attacked.\n\nI actually do have 2 core sets and all of the current adventure packs, so I have a large pool of cards.\n\nI agree about Eowyn though, I can't seem to find another hero that I can really use to quest with any real success (at least when playing solo). It's hard to dedicate more than 1 hero to questing and Eowyn just barely gets the job done in many cases. If you were lucky enough to get enough attachments on someone to add willpower I suppose it wouldn't be as bad. I think a lot of those cards are in Spirit anyway though.\n\nI can't wait until we have a large pool of heroes. I can't find uses for a lot of the current ones in solo play. I really want to use Bilbo for a quick draw deck, but I can't get much use out of him otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=532857","commentId":532857,"userName":"mr.thomasschmidt","timestamp":1316961353,"content":" \n\nHehe...oh how I know how you feel...it sounds just like my situation so you are not alone :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI have tried it at about 10 times = 10 times lost!\n\nI had best success with a tactic/spirit deck mainly using Eowyn and then any combo together withGimli, Legolas or Dunhere (the guy that can attack enemies in the staging area) I even tried a tactic/spirit/leadership with Eowyn, Aragon and Gimli, same result.\n\n Now one of the things I have learned afterward is that you can use some of the tactic attachment cards on non tactic heroes which I haven't tried yet. This will make Dunhere's ability to attack enemies in the staging area much better. So I'm going to try again a tactic/spirit Eowyn, Dunhere, Gimli deck. Maybe I'll succeed this time :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nElse when I asked the exact same thing as you in my thread Down the Anduin solo, somebody said it would be very easy if you go with a single sphere deck spirit. Keep the threat down and use Gandalf to deal with the Hill Troll. If ever your deck is about to run out there's a card that let's you shuffle the discard pile back into the deck :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] AND don't rush to stage two. That was the advises I got. I haven't tried them yet but as soon I get some alone time I'll give it a try :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Hope you succeed and please let us know if, when and how you did :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533033","commentId":533033,"userName":"Svenn","timestamp":1316995714,"content":"I finally won solo against Anduin! It was a 56 point win that should have been WAY lower. I built a Spirit/Lore deck that works really well so far. I actually lost the first game with this deck due to an unfortunate treachery taking out Eowyn in phase 1. Despite that I did really well all the way up through a good bit of phase 2 that game, but ended up just getting overwhelmed with threat in the quest area and I couldn't deal with it fast enough.\n\nDuring the victory game I was doing great throughout most of it once I got a few allies out. While the first game I dealt with the Hill Troll via 2 Gandalfs this game I simply had a forest snare ready and waiting. While working on phase 2 I had a lot of allies and was using several for attacking instead of questing. I got the treachery that made me raise my threat by the number of non-questing characters on two different occasions which jumped my threat up into the 40s. I was sitting at 48 threat when I pulled a Gandalf out, saving me. With Gandalf I was able to clear all enemies from the staging area and then toss everyone at the quest to jump to stage 3.\n\nI had to deal with about 4 enemies in Stage 3, but I had to deal with wolf riders. Since I had to skip the staging part of the quest phase while in the third part of the quest I just kept getting that wolf rider as a shadow card, who would then attack and return to the top of the deck for next turn. I lost both Eowyn and Denethor during this Stage. Eowyn died because I had everyone questing when I made it to Stage 3 and I had to let an attack go undefended. Denethor died thanks to a shadow effect that negated his defense, which made Protector of Lorien worthless. Luckily with all my allies (and the Gandalf I drew) I was able to have enough to defend each turn without losing allies and be able to kill them slowly (which would have been much easier if it wasn't for those wolf riders). I ended with 46 threat, 2 dead heroes, and 3 damage (out of 4 health) on Dunhere. It was very close.\n\nHaving low starting threat so I could build up some before dealing with the hill troll really helped. Having Denethor being able to look at the top card of the encounter deck and move it to the bottom probably saved me a few times. Dunhere being able to take out enemies in the staging area worked really well for this quest too since it is very enemy heavy.\n\nAnyway, here's the deck I ended up winning with:\n\n \n\nSpirit/Lore\n\n \n\nHero (3)\nDenethor (Core) x1\nDunhere (Core) x1\nEowyn (Core) x1\n\n\nAlly (23)\nDaughter of the Nimrodel (Core) x1\nGandalf (Core) x3\nHaldir of Lorien (AJtR) x3\nLorien Guide (Core) x3\nGleowine (Core) x2\nNorthern Tracker (Core) x3\nRivendell Minstrel (THFG) x2\nErebor Hammersmith (Core) x2\nLongbeard Map-Maker (CatC) x2\nWandering Took (Core) x2\n\n\nAttachment (18)\nA Burning Brand (CatC) x2\nForest Snare (Core) x3\nProtector of Lorien (Core) x3\nSelf Preservation (Core) x3\nSong of Wisdom (CatC) x2\nThe Favor of the Lady (Core) x3\nUnexpected Courage (Core) x2\n\n\nEvent (13)\nA Test of Will (Core) x2\nHasty Stroke (Core) x2\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nWill of the West (Core) x3\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533036","commentId":533036,"userName":"mr.thomasschmidt","timestamp":1316998946,"content":"Sweet!!! Congrats!!! I'll try it if my 2 other ideas/suggestions for decks doesn't work :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533187","commentId":533187,"userName":"Titan","timestamp":1317029325,"content":"I've only ever played solo and one thing I can tell you is that your heroes need to be versatile or very, very good in one of the three major areas: attack, defense or questing. I've yet to find a real answer to not putting Eowyn in a deck. She can pretty much quest by herself early on, which frees up your other heroes to do other things. The first 3-4 turns in a solo game are very delicate affairs. You may have very few allies and your heroes have to carry the brunt of the encounter deck. This is the case even more when you play tri-sphere decks, which is almost a necessity solo, as you have to cover all the bases with one deck. If you aren't careful, you will fall behind quickly and never recover. It's a challenge, but the sense of satisfaction when you beat those quests is well worth it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533229","commentId":533229,"userName":"DurinIII","timestamp":1317035294,"content":" I agree...Eowyn is just too good not to take (I am upset about this...I don't like how you \"have\" to play her not to cheat yourself from maximizing success...seems like a designing flaw). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533441","commentId":533441,"userName":"Frayed","timestamp":1317074817,"content":" Eowyn, Theodred, Dunhere.  Starting threat of 25.  Galadhrims greeting and gandalf cards to reduce threat and keep it as low as possible so enemies won't engage you until you are set up.  Dunedain attachments to boost eowyn's willpower and dunhere's attack.  Northern Tracker to help questing and defense/attacking for later game.  During catc, i took out almost all the trolls while they were in staging and eowyn's willpower was at 9 and dunhere's attack at 5 base, 6 with his ability.  With theodred's ability, I had more resources than I could spend by the middle of the game and my hand dwindled quickly to 1 or 2 cards.  The mathoms helped with that a lot.  For solo play, keep the threat low and make sure you can quest while still having one character to defend if the encounter deck surprises you, and leave a hero able to attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533468","commentId":533468,"userName":"Glaurung","timestamp":1317082607,"content":"Frayed said:\n\n Eowyn, Theodred, Dunhere.  Starting threat of 25.  Galadhrims greeting and gandalf cards to reduce threat and keep it as low as possible so enemies won't engage you until you are set up.  Dunedain attachments to boost eowyn's willpower and dunhere's attack.  Northern Tracker to help questing and defense/attacking for later game.  During catc, i took out almost all the trolls while they were in staging and eowyn's willpower was at 9 and dunhere's attack at 5 base, 6 with his ability.  With theodred's ability, I had more resources than I could spend by the middle of the game and my hand dwindled quickly to 1 or 2 cards.  The mathoms helped with that a lot.  For solo play, keep the threat low and make sure you can quest while still having one character to defend if the encounter deck surprises you, and leave a hero able to attack.\n\n\n\nI use to build up this Rohan deck. And this deck work very well against HFG and Carrock. But Anduin scenario kill this deck!!!!\n\nI try it 3 times 3 loses. To much depend on luck of starting hand. For me is not good. Can you show me your deck list???\n\nMaybe i miss something......"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533711","commentId":533711,"userName":"xBeakeRx","timestamp":1317137921,"content":"I used the same Rohan deck as Frayed to beat Anduin and HFG, but haven't tried CatC or Rhosgobel yet.  Threat reduction is the key to solo play IMO, as it allows you to choose when to engage most of the larger creatures while only having to deal with the occasional goblin.  Dunhere with Dunedain Marks allows you to eliminate the staging area without being engaged and Eowyn is the quest-master.  For this deck, I normally use my mulligan if I don't get a Steward of Gondor/Galadrim's Greeting/Gandalf/Dwarven Tomb, etc.  When I beat Anduin I was able to drop Faramir down on turn 2 with a Song of Kings on Eowyn, which gave me attack/defense/quest flexibility. \n\nI've tried Anduin with a few other decks without any success, so I would probably just stick with the Rohan deck and play it a few times to get a feel for it.  Just remember, threat reduction and attack boosts on Dunhere = win (Faramir also helps)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533789","commentId":533789,"userName":"Frayed","timestamp":1317147327,"content":" Yeah Beaker has the right of it.  If you can't control the threat in solo play, you can't win.  I haven't used Faramir yet in my deck but like I said, resources with song of kings and theodreds ability aren't short, so I can't imagine it would be too hard to fund him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53695-troubles-with-solo-play/?do=findComment&comment=533808","commentId":533808,"userName":"DurinIII","timestamp":1317149048,"content":" Can't wait until other races that aren't Rohan actually get good."}]}