{"url":"https://community.fantasyflightgames.com/topic/53697-questions-about-faq-11/","title":"Questions about FAQ 1.1","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53697-questions-about-faq-11/?do=findComment&comment=532837","commentId":532837,"userName":"Angus Lee","timestamp":1316956986,"content":"Item (1.10) of the FAQ reads, \"Actions are only limited by whether or not a player can pay the cost of the action, or ...\" I don't think this applies to Event Cards, e.g. \"Sneak Attack\", if I have multiple ally cards in my hand when I play it, I wouldn't be able to \"put them into play\" by taking multiple time of the event's action. Correct?\n\n \n\nItem (1.15) reads, \"If a card effect uses the word \"then\", then the preceding effect must resolve successfully for the subsequent dependent effect to resolve.\" .\nThe encounter card \"Treacherous Fog\" reads, \"When Revealed: Each location in the staging area gets +1 {threat} until the end of the phase. Then, each player with a threat of 35 or higher chooses and discards 1 card from his hand.\"\nIf there is currently no location in the staging area, the first part is not successfully resolved, so players do not need to discard. Is this correct?\nSimilarly, encounter card \"Roasted Slowly\" reads, \"When Revealed: Destory all heroes with the card \"Sacked!\" attached. Then, shuffle Roasted Slowly back into the encounter deck. If there is no hero with \"Sacked!\" attached, Roasted Slowly should be discarded instead, correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53697-questions-about-faq-11/?do=findComment&comment=532878","commentId":532878,"userName":"Bohemond2","timestamp":1316964877,"content":"Both Sacked and Treacherous Fog successfully resolve, they just don’t have any effect. Their “then” clauses still trigger."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53697-questions-about-faq-11/?do=findComment&comment=532987","commentId":532987,"userName":"radiskull","timestamp":1316984817,"content":" Bohemond is correct.  It says \"do X to all things\".  If there are no things to do X to, you still did it to all of them.  If, on the other hand, it said \"choose one location and add +1 to its Threat.  Then, do Y\", and there were no locations, the Then part would not trigger because you did not successfully choose a location.\n\n \n\nAs for the first question, part of the cost of playing an event is to actually play the card from your hand.  So unless you can do that multiple times (hint: you can't), you won't be able to get multiple triggers from a single event card."}]}