{"url":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/","title":"Brand Hero question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533368","commentId":533368,"userName":"Grimbob","timestamp":1317058248,"content":"I had a question about his ability. The phrasing of his Response: \"After Brand son of Bain attacks and defeats an enemy engaged with another player...\" differs from Legolas's Response: \"After Legolas participates in an attack that destroys an enemy...\"\n\nDoes Brand's Response only trigger if he single-handedly destroys the enemy or does it not matter if other characters participate?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533375","commentId":533375,"userName":"Titan","timestamp":1317059569,"content":"I think that his ability will trigger even if he isn't attacking alone. For one, there's nothing that specifies he has to, and two, there is a hero who has such a specification, and that is Dunhere. I think it makes sense to assume that if Brand does not specify attacking alone like Dunhere does, that his ability will trigger just like Legolas'. At any rate, as a single player, it doesn't seem like it will come into play much for me. He seems to be a rather mixed bag. Good stats for the most part, which adds versatilty for the solo game, but the ability is useless and the starting threat is rather high for a hero with a useless ability in solo. Just the same, I might give him a try."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533384","commentId":533384,"userName":"Svenn","timestamp":1317060700,"content":"I haven't ever really used Ranged before. Doesn't the player whose turn it is have to initiate the attack. Can someone with Ranged declare an attack against an enemy engaged with another player during their turn, or only help out when another player declares an attack?\n\nEither way, I would say that it should be any time he participates in an attack, as it does not specify that he must kill it by himself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533408","commentId":533408,"userName":"Grimbob","timestamp":1317064851,"content":"I'm inclined to believe that it triggers like Legolas' ability, but my understanding is that a Ranged character can be used to either declare an independent attack or participate in an attack against an enemy engaged with another player. After what I'd argue is a strict interpretation regarding Stand and Fight, I don't take interpretations for granted. I predominately play multi-player, and our tactics/leadership player would likely benefit from this hero. However if his ability only triggers when Brand attacks and kills independently, then he's much more limited unless his base attack is increased further with attachments.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533410","commentId":533410,"userName":"Svenn","timestamp":1317065399,"content":"Well, it says after he attacks and defeats an enemy. If there are other people in the same combat, he is still attacking and defeating an enemy. It does not say anywhere that he has to defeat it solo or that other characters cannot help defeat it, only that he must be attacking and the enemy must be defeated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533448","commentId":533448,"userName":"Titan","timestamp":1317075942,"content":"Grimbob said:\n\n\n After what I'd argue is a strict interpretation regarding Stand and Fight, I don't take interpretations for granted.\n\n \n\n\n\n\n \n\nThis is the one thing that would give me pause. This game's developers have a bad habit of making cards with wordings that are vague and inconsistent. Brand is a prime example of this: if he functions like Legolas, why not use the same terminology? If he functions like Dunhere, why not specify so?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533465","commentId":533465,"userName":"EchPiEl","timestamp":1317081902,"content":"In fact, Ranged keyword allows two different effects, to declare attacks on enemies engaged with other players OR to participate in attacks declared against Enemies engaged with other player by that player. Maybe the subtle difference means that Brand's controller has to be the one declaring the attack (so he both attacks and defeats) even if more characters join this attack, but the ability does not work if he's just participating using the second Ranged effect.\n\nBut I'm being too convoluted, maybe it's just a template changing and it works both ways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53764-brand-hero-question/?do=findComment&comment=533473","commentId":533473,"userName":"marlow4","timestamp":1317084011,"content":"I think the wording is different simply because it involves attacking an enemy engaged with another player. Legolas' effect goes off regardless of who the enemy was engaged with."}]}