{"url":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/","title":"I get it, Rohan is good; now, make other races better!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533834","commentId":533834,"userName":"DurinIII","timestamp":1317154538,"content":" Am I the only one seeing how exponentially better the \"Rohan theme\" is to other the other free peoples factions in this game? Open for discussion, but, I am having so much trouble with being as consistently successful with anything besides these horse people! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533835","commentId":533835,"userName":"Svenn","timestamp":1317154609,"content":"I managed to win a solo game on Anduin without a single Rohan character in my deck. In fact, I have yet to really use Rohan characters all that much. What is so great about them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533838","commentId":533838,"userName":"Bohemond2","timestamp":1317155539,"content":"Keep in mind we have a big box expansion on its way that focuses on the dwarfs, and the next cycle of cards looks to be rather dwarf centric.  And, I would much rather see them focus on improving or or two factions at a time (in this case, eagles and Rohan), than pay equal attention to all factions.  The amount of player cards we get is so limited, equal distribution would mean that none of the factions we playable.  The focus on a few factions allows cards like The Eagles are coming to actually become useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533841","commentId":533841,"userName":"DurinIII","timestamp":1317156386,"content":" Thanks Bohemod...useful points there. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533842","commentId":533842,"userName":"DurinIII","timestamp":1317156434,"content":" Svenn...they excel the crap out of questing and they hold their own in combat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533846","commentId":533846,"userName":"Bohemond2","timestamp":1317157018,"content":"They also have a self sacrifice theme going, with three allies that have abilities related to leaving play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533853","commentId":533853,"userName":"DurinIII","timestamp":1317159062,"content":" Very true...I think what frustrates me the most is that so far, Rohan has seen a good selection of allies in the adventure packs where others have not...I know more are to come, and what I care most about (dwarves) should roll out in sweetness soon enough! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533855","commentId":533855,"userName":"Bohemond2","timestamp":1317159766,"content":"We have 5 dwarven allies, a dwarf attachment, and three dwarven heroes, so we have a decent start to a dwarf deck.  But I am also itching to get my hands on the dwarf box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533856","commentId":533856,"userName":"player582283","timestamp":1317160460,"content":"Dwarf player cards and heroes are welcome (and I have a soft spot for Dain).  But I can't wait to do some questing in Moria.  How cool will that be!!\n\nDon't forget there are some Gondor themes going on also in the core set although they've not been developed as much.  Good heroes, at least one good ally with Faramir and good support cards....just need some more.  I'm sure the Elves, hobbits and Dunedain will get some love down the road too.  And we've not really seen anything keying off warrior, noble, ranger, etc.  There is a lot of room for evolution - witness what they are doing with the ranged skill being keyed off in encounter and player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533862","commentId":533862,"userName":"Bohemond2","timestamp":1317161146,"content":"Don't forget the gondorian spearmen! they are a great card, and shine in multi-player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533870","commentId":533870,"userName":"player582283","timestamp":1317163867,"content":"Yep, spearmen are great for their cost.  Guards of the Citadel not so much"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=533882","commentId":533882,"userName":"xBeakeRx","timestamp":1317165017,"content":"This game is very new and there have only been three AP's released to date, so we all just need to be patient.  Dwarves will be getting a huge boost soon, but they already have a decent base with Gloin, Gimli, Thalin, Brok, Hammersmiths, Axemen, Miners, etc.  To say Dwarves are bad is simply not true, all they need are some better questing options and they'll be pretty solid. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=534063","commentId":534063,"userName":"DurinIII","timestamp":1317200507,"content":" I agree with you XbeakeRx, though, I never said Dwarves were bad...you assumed that is what I was saying. What I actually said was that Rohan was best. There is a difference. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=534066","commentId":534066,"userName":"Grimbob","timestamp":1317200609,"content":"Though there are several cards with the Rohan keyword, the only cards that have an effect on that keyword (to my knowledge) are Mustering the Rohirrim and Eomund. Musterings are useful, but they only allow you to draw one card (unlike the Eagle search) and Eomund is decent but is unfortunately unique and I dont think his cost:benefit ratio justifies having a full three copies. I think the advantages to the Dwarf, Gondor, and Eagle keywords are generally better and I think the Dwarrowdelf cycle will likely make all-Dwarf themes more playable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=534081","commentId":534081,"userName":"DurinIII","timestamp":1317201622,"content":" Agreed Grimbob...Eowyn and Dunhere just seem to get WAY too much attention right now. They are so freaking good!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=534140","commentId":534140,"userName":"gatharion","timestamp":1317207806,"content":" I've been bugged a bit by the Rohan cards, but that's mostly because they're a lot weaker at fighting then I think they should be (while being super great at questing). My inability to play my Horseback Archers in a Rohan theme deck has been an annoyance for me. A \"Song of Battle\" card would help, but a Tactics hero (like Eomer) would be even better.\n\n \n\nThe Dwarves are already pretty cool (although they could really use a Lore hero) and will be even better with the big expansion.\n\n \n\nOnce we get Boromir, I'm going to make a Gondorian deck that will seriously rock some socks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=534569","commentId":534569,"userName":"Feqz","timestamp":1317291220,"content":"The game is still developing. Surely the dwarves will be next. And I wonder which theme will join.\n\n \n\nWhat troubles me is that at the moment with the 4th AP coming out Rohan seem to conquer the complete spirit sphere. Rohan everywhere! The (nearly) the same tends to be with the eagles theme in tactics. In order to get these themes working now this method seems ok to me. For the further developmet I would wish a better distribution of all themes between the different spheres. So I'll keep my fingers crossed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=535232","commentId":535232,"userName":"Kiwina","timestamp":1317394580,"content":" There may be a lot of Rohan allies that do well with questing, but there are also a lot of Rohan allies that come into play for the purpose of being sacrificed for one reason or another.  Prince Imrahil works well in a Rohan themed deck because the allies leave play so much.  That is their big weakness I think.  I've made a Rohirim deck, but it doesn't work well solo because the allies just don't stay in play long enough to help out with combat.  The only real combatants the deck has are the heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53820-i-get-it-rohan-is-good-now-make-other-races-better/?do=findComment&comment=535246","commentId":535246,"userName":"Bohemond2","timestamp":1317396490,"content":"I designed a Red Arrow (rohan & gondor) deck based on Rohan abilities to sacrifice and untap combined with Prince Imrhail.  i tested it against hills of Emyn Muil (and posted a session summary) and it works quite well.  it needs another solid tactics ally to really hum, but it is well on its way to being a solid deck.  I generally use it in tow player, but it holds its own solo."}]}