{"url":"https://community.fantasyflightgames.com/topic/53886-rules-questions/","title":"Rules questions.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534443","commentId":534443,"userName":"Durgum","timestamp":1317265109,"content":"Forced: After Hummerhorns engages you, deal 5 damage to a single hero you control.\n\nSo my question is this, If I engage Hummerhorns, does the forced effect happen? I would think no because I engaged him not the other way around.  But I was not sure.\n\nAlso, this style of effect would only happen on an engagement check correct? Because once you are engaged you state in that state, so \"after\" would not trigger again?\n\nThe forest spiders have a similar effect where they get +1 to the end of the turn after they engage a player, but if I engage them, that would not happen correct?\n\nAre locations only cleared at the end of that phase?  For example, I need 1 more counter to clear a location, I commit a character that puts a progress token on the location when committed.  So now there are 3 and it is complete.  Does it clear instantly, or do you still deal a card and wait until the end of the phase to remove it?\n\nThank you.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534453","commentId":534453,"userName":"Rashley","timestamp":1317267786,"content":"This seems to be the one rule that most people miss.  The rules do state that it makes no difference wether you engage an enemy or the enemy engages you.  Therefore those nasty Hummerhorns do 5 points of damage on a Hero as soon as it engages or gets engaged.  No shield defence either as it isn't combat.  The best way to deal with them is either keep them in the Stageing Area - keep your threat level low - and use Dunhere or events to kill them there, or get Citadel Plate on a Hero - preferably Gimli.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534455","commentId":534455,"userName":"Rashley","timestamp":1317267968,"content":"Sorry, missed your other question.  Locations clear as soon as the correct number of progress tokens are applied.  Excess tokens go on the quest, but not from one stage of the quest to the next.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534456","commentId":534456,"userName":"Kiwina","timestamp":1317268189,"content":" The rule book actually states that if you engage an enemy that enemy engages you, and visa versa.  Any effects that would happen when any enemy engages a player, like with Hummerhorns or Forest Spider, will be triggered when that enemy becomes engaged with a player.  Once engaged the enemy does stay engaged, so the effect won't trigger every turn, but cards like Son of Arnor could cause the enemy to engage another player and trigger the effect again.\n\nLocations are explored as soon as the required number of progress is placed on them.  You dodn't have to wait until the end of a phase to remove an active location.\n\nI see Rashley aced me out on this one, and I agree with both answers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534458","commentId":534458,"userName":"KlAve","timestamp":1317268520,"content":"Rashley's right on both accounts:\n\nFrom the rules, page 16:\n\nWhether an enemy is engaged through an engagement\ncheck, through a card effect, or through a player’s\nchoice, the end result is the same, with the enemy\nand the player engaging one another. In all cases, the\nplayer is considered to have engaged the enemy and the\nenemy is considered to have engaged the player.\n\nAnd from the rules, page 15:\n\nIf a location ever has as many\nprogress tokens as it has quest points, that location is\nconsidered explored and is discarded from play.\n\nHope that helps :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534591","commentId":534591,"userName":"Valyrian Steel","timestamp":1317293539,"content":"My usual strategy against hummerhorns is to leave him in the staging area and if i can get a gandalf out to kill him great...otherwise I use Frodo to take the 5 damage as increased threat if absolutely necessary. The Dunhere strategy is great as well but I don't use him in my decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534824","commentId":534824,"userName":"Durgum","timestamp":1317320254,"content":" Thank you all for the info!  i obviously need to dig through the rule book again and get the finer points. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534904","commentId":534904,"userName":"lkb57","timestamp":1317340209,"content":" I'll tag a quick question onto this topic:\n\nThe rulebook specifically states that when you travel to a location, that location stops adding its threat strength to the total threat strength of the locations and enemies in the staging area (p. 15). What about engaged enemies? If an enemy survives through a combat phase, does its threat strength contribute during the quest phase of the next round?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534907","commentId":534907,"userName":"Svenn","timestamp":1317340631,"content":"lkb57 said:\n\n I'll tag a quick question onto this topic:\n\nThe rulebook specifically states that when you travel to a location, that location stops adding its threat strength to the total threat strength of the locations and enemies in the staging area (p. 15). What about engaged enemies? If an enemy survives through a combat phase, does its threat strength contribute during the quest phase of the next round?\n\n\n\nNo, engaged enemies do not count their threat towards questing. Only enemies and locations still in the staging area count. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534912","commentId":534912,"userName":"lkb57","timestamp":1317341596,"content":" thanks svenn. I'll throw out one more while I've got an audience:\n\nI've been trying to figure out which hero's I can give particular attachment cards to. Example: An attachment card belonging to the leadership sphere of influence can only be paid for by a hero belonging to that same sphere; but, can that attachment only be given to a leadership hero, or can it be attached to any hero of any sphere of influence?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534917","commentId":534917,"userName":"Dam the Man","timestamp":1317342329,"content":"You can attach Steward of Gondor to any hero, while Burning Brand can only go on a Lore character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53886-rules-questions/?do=findComment&comment=534927","commentId":534927,"userName":"Svenn","timestamp":1317343791,"content":"lkb57 said:\n\n thanks svenn. I'll throw out one more while I've got an audience:\n\nI've been trying to figure out which hero's I can give particular attachment cards to. Example: An attachment card belonging to the leadership sphere of influence can only be paid for by a hero belonging to that same sphere; but, can that attachment only be given to a leadership hero, or can it be attached to any hero of any sphere of influence?\n\n\n\nAttachments can be played on a character of any sphere, unless otherwise specified. The sphere is only used to determine what type of resources are needed."}]}