{"url":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/","title":"Thoughts on the one player difficulty ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=534921","commentId":534921,"userName":"A Paperback Hero","timestamp":1317342954,"content":"Lately I haven't had a chance to play LotR:LCG with another player and I have found the difficulty of the one player game to often be formidable to the point of almost impossible for some of the quests. Namely Escape from Dul Guldur and Conflict at the Carrock. I only have one copy of the core set, and since I don't have a lot of money to burn up on extra cores for complete sets of 3 for every card, my deck strategies seem to be very varied. (rather be buying expacs)\n\nI was wondering how out of the spirit of the game it would be to play with one extra hero in play and taking the top three threat of the four heroes to generate starting threat. I figure the influx of an extra hero would relieve some the pressure on the player in some of these more difficult quests. I know I could play with 2 decks like a two player game, but I really don't want to have to manage 2 decks at once when I play solo.\n\nAny thoughts on how over powered this might make the player against the game mechanics?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=534929","commentId":534929,"userName":"Svenn","timestamp":1317343938,"content":"Well, for one thing you would have a TON of resources... which would greatly tip the game balance in your favor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=534931","commentId":534931,"userName":"radiskull","timestamp":1317344143,"content":" I think it would trivialize a lot of the content.  Without allies, you have enough heroes to send one each for Questing, Defense, and Attack.  Part of the management of the game is determining when you can, for example, forego an attack in exchange for doubling up on questing.  With a 4th hero, you can double up on whatever you want, in addition to receiving one third more resources.\n\nDropping the threat of the lowest hero is just icing on the cake.\n\n \n\nThat having been said, it's your game, you should play it in the way that gives you the most enjoyment (unless it's a tournament)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=534940","commentId":534940,"userName":"mr.thomasschmidt","timestamp":1317345154,"content":"Radiskull beat me on this answer :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] As I don't have so much experience with the game yet to determine whether or not it trivialize the game I totally agree that trying to modify the game is fun. Not cheating just fun, \"if it's not a turnament\" as radiskull said.\n\nSounds interesting with the way you wanna do it. tell us how it turns out.\n\nOr have a look at this link\n\nhttp://boardgamegeek.com/filepage/69038/expanded-solo-variant-v0-8 [http://boardgamegeek.com/filepage/69038/expanded-solo-variant-v0-8]\n\nCitation: \"The objective of this expanded solo variant is to provide a solo play experience that allows the exploration of true multi-sphere combinations and synergies with a single deck.\n\n \n\nA short summary: You will create a single deck with 5 heroes (no more than 3 of a single sphere). For most game purposes this single deck will count as two players.\"\n\n\nIt might make it too easy, don't know, haven't tried it myself yet. Good luck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=534991","commentId":534991,"userName":"ClydeCloggie","timestamp":1317355862,"content":"I always play solo, have one core set and the 1st 3 APs.\n\nDol Guldur is close to impossible solo, it's just a fact of life. Elite players with a bit of luck can manage occasional wins, but for us mere mortals just forget it.\n\nCarrock, however, is far from impossible. With my available card pool, I have beaten it regularly with 3 different decks. Two of those relied on threat reduction to pick off the Trolls one by one, the other a Tactis-heavy deck which can handle all Trolls in 2-3 turns with a bit of luck. It does need a Gandalf or two to make sure threat doesn't kill you while all four Trolls are engaged. The key to Carrock is to build up really slowly, don't go to stage 2 until you have an army of allies out and a storng hand of cards to play with. For me, Anduin is more difficult than Carrock.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535007","commentId":535007,"userName":"Eryx_UK","timestamp":1317360590,"content":"A Paperback Hero said:\n\nI was wondering how out of the spirit of the game it would be to play with one extra hero in play and taking the top three threat of the four heroes to generate starting threat. I figure the influx of an extra hero would relieve some the pressure on the player in some of these more difficult quests. I know I could play with 2 decks like a two player game, but I really don't want to have to manage 2 decks at once when I play solo.\n\n\n\nI have tried the same thing, but on the harder quests I found it didn't make that much of a difference. Escape from Dol Guldor and CotC need multiple players to really make them work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535036","commentId":535036,"userName":"A Paperback Hero","timestamp":1317365098,"content":"Well based on the feedback, I think I will continue to strive to build a properly strong enough deck to defeat the quests and put aside quests like Dol Guldur until I can play with friends. It would probably bother me like a thorn in a my side if I decided to house rule my way to victory anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535066","commentId":535066,"userName":"DurinIII","timestamp":1317370198,"content":" A Paperback Hero: I also play mostly solo, though I do have 3 expansions as well (getting Emyn Muil today actually, my game store called!)  As far as game difficulty, I have certainly had my share of problems...but ironically as my card pool has grown, so has the difficulty with Anduin. I played a deck originally with Beravor, Gloin, and Eowyn and all core set cards and consistently spanked Anduin in the past.  Now that I have begun adding in cards from the first three expansions, I haven't beaten Anduin yet.  I think the reason for this is because, when the core set was developed, the designers specifically made the card pool capable of beating the first two quests with some customization...of course Dul Goldor is another story (mainly a two player and up quest).\n\nI have beaten Hunt for Gollum with a 50 card solo deck (legal in all respects), I haven't yet beat Conflict at the Carrock, sole reason is that every time I engage the trolls my threat is too high and Louis always causes me to die by threat before the trolls even swing at me (you can't win this scenario in solo if your threat is too high).  As far as Journey to R, I haven't even attempted it yet, though I own it.  \n\nSo, what I am trying to say is this: have fun. Don't worry too much about being \"behind\" on the expansions. Customize the core set until you get bored with it and buy some more expansions.  I do believe the game is definitely harder solo.  Good idea to put aside Dul Goldor. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] Happy Gaming! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535079","commentId":535079,"userName":"Eryx_UK","timestamp":1317372150,"content":"A Paperback Hero said:\n\nWell based on the feedback, I think I will continue to strive to build a properly strong enough deck to defeat the quests and put aside quests like Dol Guldur until I can play with friends. It would probably bother me like a thorn in a my side if I decided to house rule my way to victory anyway.\n\n\n\nI know that feeling. For a while I've been toying with the idea of playing solo play without separate spheres. Instead any resource can buy for any card. I'd like to try it but part of me doesn't like the idea of going against the set rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535085","commentId":535085,"userName":"Puzzle2","timestamp":1317372751,"content":"DurinIII said:\n\nSo, what I am trying to say is this: have fun. Don't worry too much about being \"behind\" on the expansions. Customize the core set until you get bored with it and buy some more expansions. \n\n\n\nI think this is the ultimate goal of any game. Two quick comments though. First, solo play is all about deck building; don't get too caught up on your favorite heroes or combos. They may work for one scenario and then be horrible at another. Second, I always describe this game as designed for co-op play with the option for solo play. The game mechanics encourage more than one player and the scenarios are easier when you add a second person. This does not mean you shouldn't play solo (I only play solo), but then you have to accept a higher losing percentage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535102","commentId":535102,"userName":"DurinIII","timestamp":1317374874,"content":" You're right Puzzle, though I wish it were more designed to solo play because of my own personal play options :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I understand the way the game is optimally set up though. I have played a few multiplayer games and it is a blast! I have a hard time not getting caught up on my favorite characters, and there are some heroes and allies I just \"refuse\" to play because a) I don't like the art, or b) I don't like the character. I know this is ultimately making my solo games harder, so I can't fault the company for that. I am a big \"theme\" guy when it comes to playing too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535106","commentId":535106,"userName":"A Paperback Hero","timestamp":1317375662,"content":"So far I have found the art to this game to be very good and the artists who created the card art seem to blend very well together. (I almost thought it was the same artist at first) Though of course its sometimes hard to get past the fact that I have read these books so many times that I have a specific image in my head for all the characters and sometimes the art goes against that. Though the image for Frodo is perfect to me.\n\nThe difficulty for me is more or less a lack of experience with complex card games like this. I have a hard time completely understanding the utility of some cards and probably leave out very useful ones because of that. Time and learning will change that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535208","commentId":535208,"userName":"xBeakeRx","timestamp":1317392372,"content":"Well, being that I have solo'd all of the scenarios except for Dol Guldor and Osgiliath, I can say that it is definitely possible to complete them all solo, however some of them are very difficult (mainly CatC and Rhosgobel).  To me, Rhosgobel relies too much on luck since the only way to really win is find 2 or 3 Athelas in the encounter deck and get a couple Lore of Imladris.  Without the Athelas you really can't win, and if you dont find them soon enough you wont be able to keep up with Wilyador's damage counters.\n\nI would say definitely continue trying to defeat the scenarios using the written rules, as you will find more satisfaction once you finally complete them.  If you develop your own house rules to make the game easier, you are just cheating yourself out of that enjoyment of finally completing the scenario.  At least, that's my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535378","commentId":535378,"userName":"Kiwina","timestamp":1317423331,"content":"xBeakeRx said:\n\n \n\nWell, being that I have solo'd all of the scenarios except for Dol Guldor and Osgiliath, I can say that it is definitely possible to complete them all solo, however some of them are very difficult (mainly CatC and Rhosgobel).  To me, Rhosgobel relies too much on luck since the only way to really win is find 2 or 3 Athelas in the encounter deck and get a couple Lore of Imladris.  Without the Athelas you really can't win, and if you dont find them soon enough you wont be able to keep up with Wilyador's damage counters.\n\nI would say definitely continue trying to defeat the scenarios using the written rules, as you will find more satisfaction once you finally complete them.  If you develop your own house rules to make the game easier, you are just cheating yourself out of that enjoyment of finally completing the scenario.  At least, that's my opinion.\n\n \n\n \n\nI was able to beat Rosgobel solo.  I had to use Denethor to search the encounter deck for Athelas, and that turned out to work well.  I still barely beat it, but I was pretty happy I completed it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535399","commentId":535399,"userName":"player582283","timestamp":1317433060,"content":"Stick with it playing by the rules is my suggestion.  You'll do better over time. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535962","commentId":535962,"userName":"scottindeed","timestamp":1317568847,"content":" I prefer to play solo with two decks - I always enjoy it a whole lot more, as the quests are still very difficult, but at least non of them are impossible. And you can take advantage of Ranged / Sentinel as well as other player interactions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=535978","commentId":535978,"userName":"A Paperback Hero","timestamp":1317571293,"content":"Very true. Ranged really doesn't have much use if your don't have 2 parties of heroes juggling the engagements."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=536664","commentId":536664,"userName":"jhaelen","timestamp":1317698230,"content":"scottindeed said:\n\n I prefer to play solo with two decks - I always enjoy it a whole lot more, as the quests are still very difficult, but at least non of them are impossible. And you can take advantage of Ranged / Sentinel as well as other player interactions.\n\n\n\nDitto. It's much closer to how the game is supposed to play, i.e. I agree with Puzzle: It's designed as a coop-game with the option for solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=538892","commentId":538892,"userName":"rfh0","timestamp":1318068759,"content":"I am able to defeat all of the difficulty levels 4 and below playing solo, but I still having beaten Dol Guldor or CATC. I am hoping that they will come out with some cards that will help me defeat both with the deck that I like to play. I plan on trying different deck options until I defeat both!!sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553759","commentId":553759,"userName":"juicebox","timestamp":1320794285,"content":"Is it still pretty much the general consensus that Escape from Dol Guldur is next to impossible in SOLO play?\n\nI just picked up the game (Core Set) this weekend, and I've been absolutely loving it. Played the first quest through multiple times with each 30 card mono sphere deck until I beat it at least once with each. That was a lot of fun and a nice way to just get a feel for each sphere and how the game phases flow.\n\nThen I tried the second quest with one or two of the mono sphere decks and decided that wasn't going to work... time to start deck building. I tried a couple of two sphere 50 card decks with no great success. Then I built my first 3 sphere 50 card deck (Aragorn, Éowyn, Denethor). So much fun!  I lost the first game in tragic fashion and then wound up with an epic victory the second time through. Tonight I went back to the first quest with the same deck I used in quest 2, and I found it was such a different playing experience (using multiple spheres). Good times. Anyway... I thought then I'd give the third quest a shot.\n\nUm. Yeah. Not working. I'm thinking I'll need to wait and try this one again sometime with multiple players. Granted I'm still very new to the game, but it just doesn't seem possible in solo mode using one 50 card deck built from one Core Set. So, back to my original question - is that still the general consensus?\n\nI'm going to teach a couple buddies the game this weekend, but seeing as it will be their first run through, I doubt we'll get to the third quest our first time playing together. Maybe something to look forward to some day much later... like somewhere around my 111th birthday?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553791","commentId":553791,"userName":"marlow4","timestamp":1320803168,"content":"juicebox said:\n\nIs it still pretty much the general consensus that Escape from Dol Guldur is next to impossible in SOLO play?\n\n\n\n \n\nPretty much. Some say they've beaten it solo but they admit to getting some really lucky draws from both the player deck and the encounter deck. Losing 1 of 3 Heroes as a prisoner is just too much of a handicap to recover from in solo. Even if you bend the rules and pick the Hero that is taken prisoner, instead of randomly selecting one, it is still the anti-solo scenario so far.\n\nEven the \"Game Too Easy\" crowd don't recommend Dol Guldur solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553799","commentId":553799,"userName":"LEGA","timestamp":1320805074,"content":"I'm new to the game too. And I tried Dol Guldur for 3 times: 2 with 2 players and 1 as solo. And I haven't defeated it yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553800","commentId":553800,"userName":"jhaelen","timestamp":1320805149,"content":"Marlow said:\n\nEven the \"Game Too Easy\" crowd don't recommend Dol Guldur solo.\n\n\n\nIs Glaurung a crowd? I guess it would explain why he seems to keep repeating himself all the time gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553803","commentId":553803,"userName":"Glaurung","timestamp":1320805622,"content":"jhaelen said:\n\nMarlow said:\n\n \n\nEven the \"Game Too Easy\" crowd don't recommend Dol Guldur solo.\n\n \n\nIs Glaurung a crowd? I guess it would explain why he seems to keep repeating himself all the time gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n\n\nAbout crowd: Yes you can says like this if Glaurung have 3 heads. But in Tolkien words all dragons have only 1 head.\n\nIn russian folk tales there is some 3 head dragons.......  But im not this one(Joking).\n\nWhy i repead my self???? Cose i see is working. The designers watch the forums and see our discussions and make some changed after. FAQ 2 is good example of that. \n\nAbout Do-Guldor: This not possible to win solo by the tounament rules.Yes you can make a special 30 cards deck against this quest(someone do that already) and win but for me is not interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553814","commentId":553814,"userName":"mr.thomasschmidt","timestamp":1320808513,"content":"jhaelen said:\n\nMarlow said:\n\n \n\nEven the \"Game Too Easy\" crowd don't recommend Dol Guldur solo.\n\n \n\nIs Glaurung a crowd? I guess it would explain why he seems to keep repeating himself all the time gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n\n\nI see the same tendensy with small children in Toys R Us where I work. They often want something HERE and NOW but don't have any good arguments why. The moment they run out of arguments they just get repetitive until they get what they wants. This doesn't mean they where right, just that the parrents got tired of hearing the same over and over again. So in the end when \"the crowd\" gets what \"they\" want it'll be more of a \"Well, you get it like you want cry baby and we (FFG) get peace\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nBased on true storys"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553838","commentId":553838,"userName":"Glaurung","timestamp":1320813406,"content":"mr.thomasschmidt said:\n\njhaelen said:\n\n \n\nMarlow said:\n\n \n\nEven the \"Game Too Easy\" crowd don't recommend Dol Guldur solo.\n\n \n\nIs Glaurung a crowd? I guess it would explain why he seems to keep repeating himself all the time gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n \n\n \n\nI see the same tendensy with small children in Toys R Us where I work. They often want something HERE and NOW but don't have any good arguments why. The moment they run out of arguments they just get repetitive until they get what they wants. This doesn't mean they where right, just that the parrents got tired of hearing the same over and over again. So in the end when \"the crowd\" gets what \"they\" want it'll be more of a \"Well, you get it like you want cry baby and we (FFG) get peace\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nBased on true storys\n\n\n\n \n\nHA HA HA HA. Is quite funny what you say. But there only one problem. Is nothing to do with real. My arguments is quite strong!!!!\n\nBut i ready to give all of them back to comeback to be small little baby. But i dont think is possible............"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553928","commentId":553928,"userName":"Ulairi","timestamp":1320831194,"content":"Glaurung said:\n\nmr.thomasschmidt said:\n\n \n\njhaelen said:\n\n \n\nMarlow said:\n\n \n\nEven the \"Game Too Easy\" crowd don't recommend Dol Guldur solo.\n\n \n\nIs Glaurung a crowd? I guess it would explain why he seems to keep repeating himself all the time gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n \n\n \n\nI see the same tendensy with small children in Toys R Us where I work. They often want something HERE and NOW but don't have any good arguments why. The moment they run out of arguments they just get repetitive until they get what they wants. This doesn't mean they where right, just that the parrents got tired of hearing the same over and over again. So in the end when \"the crowd\" gets what \"they\" want it'll be more of a \"Well, you get it like you want cry baby and we (FFG) get peace\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nBased on true storys\n\n \n\n \n\n \n\nHA HA HA HA. Is quite funny what you say. But there only one problem. Is nothing to do with real. My arguments is quite strong!!!!\n\nBut i ready to give all of them back to comeback to be small little baby. But i dont think is possible............\n\n\n\n \n\nDo you mind if I ask where you live? Some of your posts are quite hard to read and I'm wondering if you're a native english speaker. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=553937","commentId":553937,"userName":"LEGA","timestamp":1320831846,"content":"@Ulairi:\n\nAs he told about russian tales I think he is from russia. Also looking for time of his posts it is possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554033","commentId":554033,"userName":"Glaurung","timestamp":1320841934,"content":"LEGA said:\n\n@Ulairi:\n\nAs he told about russian tales I think he is from russia. Also looking for time of his posts it is possible.\n\n\n\nYes im Russian. But i live for now in Thailand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554054","commentId":554054,"userName":"booored","timestamp":1320844522,"content":"It isn't that the game is \"to easy\" , it is that if you are into deck building, once you design a deck that can beat a quest, you always beat it as the quest deck has no ability to surprise you or get tricky like when playing a human in a duel game. No matter how \"hard\" the quest, you can design a deck that will crush. There is no doubt that Escape is one of the hardest solo quests, there are even some decks floating about now that use a single copy of core that are able to beat that pretty regularly.\n\nWhat this means is that dedicated players, especially those with high level dueling game background soon find deck builds and plays that make the quests pretty trivial. A perfect example of this is Conflict at the Carrock. This quest seamed pretty hard, but is now considered one of the easiest in the game, why? Because people now know it and can play to it, they know what is coming, what the threats are and how to play and use their deck to crush it. ALL the quest are like this. The only one I have problems with solo still on a regular basis is Osgilith and Escape.\n\nIt isn't that the game is easy, it is that it is static, it dose not adapt to you, or to your game situation. So once you have a working strategy and deck, you ALWAYS have a working strat and deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554061","commentId":554061,"userName":"Dam the Man","timestamp":1320845802,"content":"booored said:\n\nWhat this means is that dedicated players, especially those with high level dueling game background soon find deck builds and plays that make the quests pretty trivial. A perfect example of this is Conflict at the Carrock. This quest seamed pretty hard, but is now considered one of the easiest in the game, why? Because people now know it and can play to it, they know what is coming, what the threats are and how to play and use their deck to crush it. ALL the quest are like this. The only one I have problems with solo still on a regular basis is Osgilith and Escape.\n\n\n\nI think there is more to the weakness of Carrock than just knowing the decks. Same decks (with minor improvements) that crushed Carrock 7-0, broke even against Rhosgobel 3-3, same result for Anduin and HFG went 4-2 with a pair of very close call wins. If Carrock is missing direct damage Treacheries, Rhosgobel has more than its fair share of them IMO (on the back of the last game seeing three first turn hero deaths: Exhaustion + Festering Wounds)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554071","commentId":554071,"userName":"marlow4","timestamp":1320847532,"content":"Glaurung said:\n\nYes im Russian. But i live for now in Thailand.\n\n\n\n \n\nYour English is better than my Russian. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nMenya zavoot Marlow. Kak vy pajivayete?\n\n(I don't even know if this forum would allow cyrillic?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554080","commentId":554080,"userName":"TheRomance","timestamp":1320848531,"content":"booored said:\n\n \n\nIt isn't that the game is \"to easy\" , it is that if you are into deck building, once you design a deck that can beat a quest, you always beat it as the quest deck has no ability to surprise you or get tricky like when playing a human in a duel game. No matter how \"hard\" the quest, you can design a deck that will crush. There is no doubt that Escape is one of the hardest solo quests, there are even some decks floating about now that use a single copy of core that are able to beat that pretty regularly.\n\nWhat this means is that dedicated players, especially those with high level dueling game background soon find deck builds and plays that make the quests pretty trivial. A perfect example of this is Conflict at the Carrock. This quest seamed pretty hard, but is now considered one of the easiest in the game, why? Because people now know it and can play to it, they know what is coming, what the threats are and how to play and use their deck to crush it. ALL the quest are like this. The only one I have problems with solo still on a regular basis is Osgilith and Escape.\n\nIt isn't that the game is easy, it is that it is static, it dose not adapt to you, or to your game situation. So once you have a working strategy and deck, you ALWAYS have a working strat and deck.\n\n \n\n \n\nI understand your point, but I can't say I agree with the claim that what you call the \"static\" nature of the encounter deck is the only reason that some feel the game is too easy.  Suppose you played a scenario and just increased the threat strength of each location by 1 and the attack and defense value of each enemy by 1.  Would you not say that the game is still static in nature, and yet more difficult?  In other words, the game could be more challenging if the actual encounter deck created such a challenge, even if you know all the possibilities of cards to come.  I believe that the reason players with well-constructed decks are finding the game too easy is a result of not only the weakness of the encounter deck itself, but also because of the versatility of the expanding player cards (some of which are designed to counter-act some of the nasty mechanics of the encounter deck) and the synergy of new cards with old ones that offsets the original game balance. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554181","commentId":554181,"userName":"booored","timestamp":1320861381,"content":"absolutely. Your right the game has the mechanics to try and address this. There are ways that you could make the deck more reactive based on your board position though quest cards and effects that run in the staging area or w/e. But at this point the game don't have this.\n\nEven if you increased the threat of all the cards by +2 or w/e, it is still static, and once you built a deck that can beat it, you will always have a better than average chance of beating it.. unless you upped the power again and as you said as more cards come out the easy of beating a given quest will get greater and greater.\n\nSome really simple effects like say, if you have threat under 22 all cards gain surge2, or if you have more than 5 allys out all treachery cards get Doom3 or Enemy cards that are engaged at the start of the round when you have 5 allies get to attack twice, or a dmg buff, or an extra shadow card .... w/e I am not a designer. The point is that you make effects that use the board and threat position of the players to determine there affects. While this wouldn't be perfect, it would mean that the decks would in some way be reactive. There is so much they could trigger off, if you have X or more attachments on a single hero. How many restricted attachments, for ever unique character / item the encounter deck gets this buff... if you draw more than x cards in a single round, how many cards are in your hand at a given time. If you discard x ammount of cards, encoungter deck surges etc etc\n\nThe crux of the point is that when you buff your deck and your player board you need to take into account that at teh same time it will buff and change teh encounter deck. Adding a entire different and extra level of strategy.\n\nI think this would be a good solution, though it doesn't \"really\" matter, well like I think a reactive encounter deck would be awesome, but players will work out stratergies and deck combos that will beat a given scenario, and that is it, they have it beaten, all they need is the draw. So even a encounter deck like what I am talking about here will at some point become trivial."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554287","commentId":554287,"userName":"Glaurung","timestamp":1320883031,"content":"booored said:\n\nabsolutely. Your right the game has the mechanics to try and address this. There are ways that you could make the deck more reactive based on your board position though quest cards and effects that run in the staging area or w/e. But at this point the game don't have this.\n\nEven if you increased the threat of all the cards by +2 or w/e, it is still static, and once you built a deck that can beat it, you will always have a better than average chance of beating it.. unless you upped the power again and as you said as more cards come out the easy of beating a given quest will get greater and greater.\n\nSome really simple effects like say, if you have threat under 22 all cards gain surge2, or if you have more than 5 allys out all treachery cards get Doom3 or Enemy cards that are engaged at the start of the round when you have 5 allies get to attack twice, or a dmg buff, or an extra shadow card .... w/e I am not a designer. The point is that you make effects that use the board and threat position of the players to determine there affects. While this wouldn't be perfect, it would mean that the decks would in some way be reactive. There is so much they could trigger off, if you have X or more attachments on a single hero. How many restricted attachments, for ever unique character / item the encounter deck gets this buff... if you draw more than x cards in a single round, how many cards are in your hand at a given time. If you discard x ammount of cards, encoungter deck surges etc etc\n\nThe crux of the point is that when you buff your deck and your player board you need to take into account that at teh same time it will buff and change teh encounter deck. Adding a entire different and extra level of strategy.\n\nI think this would be a good solution, though it doesn't \"really\" matter, well like I think a reactive encounter deck would be awesome, but players will work out stratergies and deck combos that will beat a given scenario, and that is it, they have it beaten, all they need is the draw. So even a encounter deck like what I am talking about here will at some point become trivial.\n\n\n\nSome really simple effects like say, if you have threat under 22 all cards gain surge2, or if you have more than 5 allys out all treachery cards get Doom3 or Enemy cards that are engaged at the start of the round when you have 5 allies get to attack twice, or a dmg buff, or an extra shadow card ....\n\n \n\nYes you hit the point. This is a biggest porblem of the game mechanic. I already talking about  it all 6 months. Encounter deck should react on player growing power!!!! \n\nWhen we start the game player side is weak but Encounter deck play with all his full power. In the middle of the game we more stronger by attachments and allies card draw but Encounter deck still play with the same power. And from certain moment players start to be more powerful then encounter deck and game is done. You know encounter deck cannot do nothing to you.\n\nBut is possible to change. Make when revealed and Shadow effect not only track a threat level but also track the ally number and attachments number.\n\nLike : discard 1 ally from play or if you can spot 4 ally discard 2 ally. Or for every ally make enemies strange +1 or for any cards in hand or for any attachments +1 threat level. Than some threachery cards working as a condition stay all the time on staging area and give some permanents effect to all encounter cards or somethings. Yes we have some cards like this. Example: Old ford in HFG but so few of them for now to be a serious power.\n\nFor example Drums in the deep: Treachery-condition  stay on the staging area.  all orks get +1 attacks and +1 threat. forced: every first orc revealed from encounter deck gains surge.\n\nAlso there is lot of opportunity do something with a quest cards. Cose most of the quests for now have only 2 cards and game text mostly is only on 1 side.\n\nSo there lot of opportunity again make some effects between moving from 1 quest cards to another. Cose in my opinion further you go danger must grow.\n\nAnd im sure only that can already make game much more exiting. I also believe the quest and encounter cards didn make for now in full power and with good approach. Sounds like (50% power of great is used). Only Osgiliaht is done well in my opinion. All Shadow of Mirkwood cycle is little bit boring. But ok i understand is the first one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554289","commentId":554289,"userName":"Glaurung","timestamp":1320883192,"content":"Marlow said:\n\nGlaurung said:\n\n \n\nYes im Russian. But i live for now in Thailand.\n\n \n\n \n\n \n\nYour English is better than my Russian. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nMenya zavoot Marlow. Kak vy pajivayete?\n\n(I don't even know if this forum would allow cyrillic?)\n\n\n\nIm ok Marlow. Thanks for ask.\n\nThis forum is also good opportunity for me to practice my English typing.\n\nNow is much better then before.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554332","commentId":554332,"userName":"jhaelen","timestamp":1320892256,"content":"booored said:\n\nEven if you increased the threat of all the cards by +2 or w/e, it is still static, and once you built a deck that can beat it, you will always have a better than average chance of beating it..\nHow is that different from playing a competitive LCG against a player who is always using the same deck?\n\nIn LotR instead of your opponent changing the deck, a new quest deck is published.\n\nTo simulate the effect of not knowing what kind of deck your opponent brings to the table just determine randomly which scenario you're playing against."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554336","commentId":554336,"userName":"LEGA","timestamp":1320893412,"content":"About \"difficult - easy\": IMO the game is difficult for solo. It is hard for me to defeat as solo 3 of 4 scenarios that I have (easy only Passage through Mirkwood). But it really challenge. Its easier and more interesting when I play 2 players games.\n\nBut think about that: most of gamers don't think that that it is easy. So FFG doesn't need to make it more harder that it is, because the most part of players will have no possibility to win and they will be disappointed, that may case decrease of selling the product. We all people, and we always want to win. And this game gives us opportunity to do it and it is interesting, so we all (most of all) are happy. So FFG made very good decision: difficulty level. If some scenario easy for you, you can don't use it, play only the hardest: Osgiliath, Dol Guldur..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554358","commentId":554358,"userName":"Glaurung","timestamp":1320898637,"content":"LEGA said:\n\nAbout \"difficult - easy\": IMO the game is difficult for solo. It is hard for me to defeat as solo 3 of 4 scenarios that I have (easy only Passage through Mirkwood). But it really challenge. Its easier and more interesting when I play 2 players games.\n\nBut think about that: most of gamers don't think that that it is easy. So FFG doesn't need to make it more harder that it is, because the most part of players will have no possibility to win and they will be disappointed, that may case decrease of selling the product. We all people, and we always want to win. And this game gives us opportunity to do it and it is interesting, so we all (most of all) are happy. So FFG made very good decision: difficulty level. If some scenario easy for you, you can don't use it, play only the hardest: Osgiliath, Dol Guldur...\n\n\n\nIS very true what you say.  I think the best solution is make scenario with ability to increase and discrease difficult level. You always can choose by adding the certain cards or special rules (not home made by official rules) difficult level as you like. Same like video game. Actually we already discuss this before somewhere on this forum. So lets see what designers will do with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554362","commentId":554362,"userName":"LEGA","timestamp":1320900392,"content":"@Glaurung and @Marlow:\n\nAnd really good place for improving your my English.\n\nP.S. I'm from Ukraine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554692","commentId":554692,"userName":"booored","timestamp":1320953318,"content":"jhaelen said:\n\nHow is that different from playing a competitive LCG against a player who is always using the same deck.\n\nthe kind of decisions a human can make about the cards he/she decides to play is completely different form the way the encounter deck would work. I am not sure exactly where to start as your question seams a bit wired to me. Sill even in a duel game were people use the same decks you will see massive variety due to how they play, holding cards, sacrifice, faints. A static game rule of turn a card play it, is nothing like how a human plays a game. Just look at this game and how you hold or play cards from your hand. Surly you can see how more complex your own thinking is on card decisions?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554726","commentId":554726,"userName":"ricedwlit","timestamp":1320961731,"content":"jhaelen said:\n\nTo simulate the effect of not knowing what kind of deck your opponent brings to the table just determine randomly which scenario you're playing against.\n\n\n\nOr reverse things: First pick a scenario. Then (assuming this is a solo deck) pick 5 heroes at random and select three to build a deck around for that scenario.   Imagine: You know you are going to go up against the trolls, but you only get to pick your heros from Frodo, Bilbo, Thalin, Eleanor, and Legolas.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=554788","commentId":554788,"userName":"jhaelen","timestamp":1320984919,"content":"booored said:\n\nSill even in a duel game were people use the same decks you will see massive variety due to how they play, holding cards, sacrifice, faints. A static game rule of turn a card play it, is nothing like how a human plays a game. Just look at this game and how you hold or play cards from your hand. Surly you can see how more complex your own thinking is on card decisions?\nOf course, but my answer was a direct reply to the aspect of the static encounter deck that you criticized. Now you're criticizing something else. You mentioned that it is impossible for the encounter deck to surprise you, since you know all the cards. If that is true then an opponent with a known deck will not be able to surprise you either.\n\nIf you don't see any variety in the LotR games you play you probably forgot to shuffle the cards gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nSince there's no 'intelligence' behind the revealing of cards, randomness combined with nasty effects will have to substitute for it. It's exactly this randomness that has at times been criticized by other posters, because it is difficult to create a player deck that will beat a scenario reliably. Even after you've played a dozen games you've won easily you can still have a 13th game that you don't win because the sequence of revealed cards is extremely 'unlucky' for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=555094","commentId":555094,"userName":"booored","timestamp":1321052448,"content":"jhaelen said:\n\n \n\nbooored said:\n\nSill even in a duel game were people use the same decks you will see massive variety due to how they play, holding cards, sacrifice, faints. A static game rule of turn a card play it, is nothing like how a human plays a game. Just look at this game and how you hold or play cards from your hand. Surly you can see how more complex your own thinking is on card decisions?\n\nOf course, but my answer was a direct reply to the aspect of the static encounter deck that you criticized. Now you're criticizing something else. You mentioned that it is impossible for the encounter deck to surprise you, since you know all the cards. If that is true then an opponent with a known deck will not be able to surprise you either.\n\n \n\nIf you don't see any variety in the LotR games you play you probably forgot to shuffle the cards gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nSince there's no 'intelligence' behind the revealing of cards, randomness combined with nasty effects will have to substitute for it. It's exactly this randomness that has at times been criticized by other posters, because it is difficult to create a player deck that will beat a scenario reliably. Even after you've played a dozen games you've won easily you can still have a 13th game that you don't win because the sequence of revealed cards is extremely 'unlucky' for you.\n\n \n\n \n\nyea, but you shouldn't ever be surprised. You only need to play the encounter deck one or two times before you know exactly what is in it. You know what cards are threats and what are not. You know that if you pull your cancel shadow card or w/e to never use it ever unless this one threat your expecting pops up. So unlike a human duel game (even using the same decks) you can tailor your decks to counter specific game changing circumstances. What you end up with is a deck that can counter anything the encounter deck throws at you, as long as you play correctly in holding your counters for when they are needed.\n\nWhat this means is that after you play the game a few times and design a deck to beat it, you basically have a answer to any situation the game can throw at you. I mean your not going to be killed by rock slide EVER after the first time it gets you.\n\nOnce you build your deck, all you need to do is inelegantly use it to beat most quests, sure there is a random element that can trip you up now and then, but in general, once you build a good deck you have a better than average chance to beat the quest every time.\n\nI am sure if you look at your decks you can say that you have a good chance of winning say Hunt for Golem. As in you basically nvr loose to it, I mean you might but not often.\n\nAnyway, this \"chance\" of winning also just gets better and better as we get more and more powerful card and combos."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=555134","commentId":555134,"userName":"jhaelen","timestamp":1321076903,"content":"booored said:\n\nyea, but you shouldn't ever be surprised. You only need to play the encounter deck one or two times before you know exactly what is in it. You know what cards are threats and what are not. You know that if you pull your cancel shadow card or w/e to never use it ever unless this one threat your expecting pops up. So unlike a human duel game (even using the same decks) you can tailor your decks to counter specific game changing circumstances. What you end up with is a deck that can counter anything the encounter deck throws at you, as long as you play correctly in holding your counters for when they are needed.\n\nyea, but you shouldn't ever be surprised. You only need to play against a human opponent's deck one or two times before you know exactly what is in it. You know what cards are threats and what are not. You know that if you pull your cancel shadow card or w/e to never use it ever unless this one threat your expecting pops up. So just like using a fixed encounter deck you can tailor your decks to counter specific game changing circumstances. What you end up with is a deck that can counter anything your opponent's deck throws at you, as long as you play correctly in holding your counters for when they are needed.\n\ndemonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\nDon't believe it? Think it through: There is no way for an opponent player to reveal the cards in any way that a random reveal couldn't!\n\nThe new point of criticism you added in your last sentence is actually valid, however. Since there's no way for encounter decks to become more dangerous while player decks get (potentially) stronger with every new AP, it's inevitable that their difficulty will eventually drop.\n\nThe only way to prevent that is to release an expansion that will add new, tougher cards to older encounter decks (or replace older cards). What I could imagine is that at some point they create a deck of high-difficulty cards from which you draw a number of cards to be added to any encounter deck to provide a bigger challenge.\n\nFFG has done something similar for the Arkham Horror board game: They released an 'Expansion' expansion called Miskatonic Horror that adds card to be used with each of the previously released expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=555138","commentId":555138,"userName":"booored","timestamp":1321078531,"content":"lol, um ok.. well I guess if you really believe that there isn't much hope for you. rofl... oh well... I am not 100% sure you understand what I am trying to say.. maybe I am not being clear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/53937-thoughts-on-the-one-player-difficulty/?do=findComment&comment=555581","commentId":555581,"userName":"jhaelen","timestamp":1321235932,"content":"booored said:\n\n \n\nI am not 100% sure you understand what I am trying to say.. maybe I am not being clear.\n\n \n\nWell, I am not 100% sure you understand what I am trying to say.. maybe I am the one not being clear gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\nCheers!"}]}