{"url":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/","title":"New to the game, and finding it very difficult.  Am I doing something wrong?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535694","commentId":535694,"userName":"Daybreak","timestamp":1317505794,"content":" I'm playing the LCG Solo (1 player, 3 heroes) and I'm having a hard time beating even the simplest quest (Passage Through Mirkwood).  I *thought* I made a decent deck, but maybe not - or maybe I am doing something wrong?\n\nHere's how my last game goes.  My heroes are Aragorn, Eowyn and Dunhere.  Eowyn and Aragorn quest, usually failing.  I reveal a card off the top and put it in the staging area.  Aragorn pays 1 to ready himself.  If there's a location, we go there.  In the Attack Phase, I almost always have to defend from enemies with 3+ attack (more depending on Shadow).  So Aragorn and Dunhere defend (or else take a huge hit).  No one's left to attack, so we move on.\n\nQuesting doesn't work in future turns (too many threats), but I still place a card in the staging area each turn, right?  What I find happening is that there are too many monsters to handle.  I end up having to defend all the attacks, so as to not lose heroes or allies (and I even included cheap allies to sacrifice).  This means I can't attack back, so no monsters get killed.  But new monsters get revealed each turn, so I keep falling behind.  And forget about questing - I'll get stuck at a location with a bunch of cards in the staging area, meaning I can't make progress on that location, let alone the quest.  And each character questing is one less who gets to attack.  I let an attack get through undefended, and the shadow card was Hummerhorns, which deals 2 to each character.  That wiped me out in one swing.\n\nFirst, does it sound like I'm playing right?  Second, clearly my strategy was wrong (Eowyn for dedicated questing, Aragorn for questing and attack, Dunhere to deal with high threat enemies before they appear), but where exactly was I breaking down?  What are some good guidelines for playing well, and not getting overwhelmed like I seem to do?\n\nThanks for the help, I desperately need it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535706","commentId":535706,"userName":"ppsantos","timestamp":1317510187,"content":"Based on what you said, you are often running out of attackers because your heroes are exhausted from questing and defending.  I think putting cheap allies into play to help either to quest (with 1+ willpower) or to attack/defend very early in the game may help you.  If you have an ally to defend (who will probably get  killed) then 2 of your heroes (Aragorn & Dunhere) will be ready to  attack and hopefully kill the enemy.  Or if the enemy's attack strength is not high, you might want to defend with someone with high defense rating so no damage is received.  Don't forget the discard action of Eowyn for additional willpower just to get you a progress token or prevent threat from increasing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535717","commentId":535717,"userName":"Angus Lee","timestamp":1317513465,"content":"In quest phase, only count the threats in the staging area, but not those from enemies already engaged with you or the active location.  So if you are attacked by so many enemies, the staging area should have only one enemy that is just revealed in the staging step of current quest phase.  With Eowyn's 4 Willpower, it should be enough to counteract the average 2 threats of the encounter just revealed in the staging area.  On the other hand, if the enemy are not engaging you (due to your threat level is low) and thus staying in the staging area, you would not have so many enemies attacking you and instead, you could have more characters committing to quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535731","commentId":535731,"userName":"Svenn","timestamp":1317515932,"content":"If you are having trouble with not having enough attackers you can do a few things.\n\n1) Put more allies into play. Playing Solo it is pretty important to have a lot of allies.\n\n2) Don't engage enemies unless you have to. Keep your threat low and they won't engage you, so you can choose 1 a turn to pick them off.\n\nYour strategy seems fine. The game is difficult solo. You'll get the hang of it eventually. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535734","commentId":535734,"userName":"Kiwina","timestamp":1317517169,"content":"I want to echo the advice about only counting the threat of enemies in the staging area.  Many people get confused about that and count the threat of enemies engaged with them as well.  That is wrong, however, and it makes the game nearly impossible to win.  Also remember that the Forest Spider's attack goes back down to 2 after the round you engaged them on.\n\nIt sounds like your strategy is fine, and in fact I'm not sure how you fail your first quest phase every time.  It sounds like you're doing everything right.  The staging area starts with 3 threat, and can't gain more than 3 threat in Passage through Mirkwood except for with a couple cards.  With both Eowyn and Aragorn committed to the quest, you should have six willpower against the typical five threat, maybe six, in the first round.  Just keep trying.  You'll get the hang of the way the game plays.  Also, losing Passage Through Mirkwood happens, even when you know what you're doing.  That's just the way the game is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535779","commentId":535779,"userName":"Eryx_UK","timestamp":1317533830,"content":"Play lots of allies. Allies can be sacrificed to defend while your heroes quest. Also if you are playing the right sphere take Lorien Guide and Northern Tracker, both of which are a huge bonus."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535784","commentId":535784,"userName":"Cletus","timestamp":1317535591,"content":"As well as remembering not to count the threat of any enemies that are engaged with you, also it should be pointed out that you don't count the threat of the active location either. Each turn, on average, you should only be adding 2 or 3 threat to the staging area. Eowyn really is great (the best, in fact) at questing and should be able to keep you at least on par for the first few turns of the game and way ahead with support from Aragorn, during which time as others have said you should mainly be looking to bring out allies to aid in combat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535787","commentId":535787,"userName":"Mighty Jim 83","timestamp":1317536760,"content":"Forest Spider and old Forest Road have a threat of 3 - Aragorn and Eowyn have a combiend Willpower of 6. So first turn, unless you draw a card with a threat of 4, you should at least tie the questing, if not win. Travelling to the old forest road allos you to re-ready a hero,meaning you can either add Dunhere to your first quest, or not have to pay to ready Aragorn. You defend with one, attack with the other, and damage the spider. That means that for the start of the next round, you should only have 1 card in the staging area, and 6 resources worth of additional cards (allies etc.)\n\ndoes this differ significantly from what you're doing?\n\nthe combination of heroes sounds reasonable, obviously with any mixed-sphere deck it'll take a bit of practice to build a blaanced deck, and you'll need some luck with drawing cards, but you sound like you're starting in the right place/"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535857","commentId":535857,"userName":"Daybreak","timestamp":1317553144,"content":" Thanks for the advice, everyone.  There are some great ideas here for both deckbuilding (more allies!) and playstyle.  I'm going to try out this same team again tonight, with a slightly different deck.  I just picked up Rhosgobol, so I may try out the new Gondor hero (sorry, forgot his name and I don't have the card with me) and the Rohan ally that aids questing.  If I can't make this work, I've also thought of swapping Aragorn for Gimli, and using the eagles to tank.  \n\nSo it sounds like I'm playing right, I just have to play better :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  That's okay, I'm up for the challenge - who wants an easy game anyways?\n\nThanks all!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535894","commentId":535894,"userName":"marlow4","timestamp":1317558531,"content":" This game requires some serious attention to detail. There is a lot going on and it's easy to forget to do this or do that when you start going too fast through the rounds.\n\nThe better you get at LOTR, the better you'll get at just about any other card game because it trains the brain to keep track of so much and the strategy is pretty tight.\n\nIt's like the LCG version of golf, you aren't just trying to beat the game, you are trying to improve yourself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535912","commentId":535912,"userName":"DurinIII","timestamp":1317561178,"content":" Hear Hear Marlow! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] Yeah man...just have fun. I play mainly solo and it was so hard at first. After about a week of playing, it finally \"clicked\" and I started winning more. It is hard though, solo play...it's a challenge but it's so fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=535958","commentId":535958,"userName":"Metropolis Games","timestamp":1317568144,"content":"Marlow said:\n\nThe better you get at LOTR, the better you'll get at just about any other card game because it trains the brain to keep track of so much and the strategy is pretty tight.\n\n\n\n \n\nI'd agree with this. I play solo exclusively and play on the train. After trying to play with the tokens I now just play with the cards in 9 hole pages and use the threat tracker. I need to remember who's tapped, which resources everyone has and how many wounds as well as the progress. It is a fantastic mental work out!\n\nI played solidly for a weekend before I managed to win a game - the sense of achievement when you finally win is amazing! So far I have beaten Mirkwood, Anduin, Gollum - came really close to beating Carrock last week. I haven't tried Rhosgobel yet. Been defeated by Dol Guldur a dozen times... one day I will defeat it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=539979","commentId":539979,"userName":"gull2112","timestamp":1318268189,"content":"Great thread! I am also having a heckuva time defeating even the first scenario. By reading this I realize that I was counting threat from  enemies that were no longer in the staging area. As I was unable to beat the game, or even come close actually, I assumed I was missing something. This forum has really helped. I wonder how many others are giving up on this game because they are assuming it is impossible because they don't realize that engaged monsters don't count against threat levels? Maybe that needs to be stated a little clearer. I think you should have a page for people to go to if they think the game is impossible, so that a few obvious issues like this one can be addressed, as not everyone, especially if frustrated, is going to take the time to comb the forums for an answer as I have.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=540040","commentId":540040,"userName":"Runner5","timestamp":1318277752,"content":" Nope your not doing anything wrong now if your post said \"New to the game, and finding it very easy.  Am I doing something wrong?\" I would say yes you are doing something wrong, but anyways most people find it difficult at first, but once you learn the rules and such it gets a little bit easier and extremely fun to play so keep at it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=540041","commentId":540041,"userName":"Runner5","timestamp":1318277914,"content":"Avalanche said:\n\n Nope your not doing anything wrong now if your post said \"New to the game, and finding it very easy.  Am I doing something wrong?\" I would say yes you are doing something wrong, but anyways most people find it difficult at first, but once you learn the rules and such it gets a little bit easier and extremely fun to play so keep at it!\n\n\n\nSorry that was just from reading  the title of the thread I haven't actually read everything inside the thread but i'm sure Svenn, Kiwina, and everyone else probably answered your questions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54042-new-to-the-game-and-finding-it-very-difficult-am-i-doing-something-wrong/?do=findComment&comment=540057","commentId":540057,"userName":"DrNate","timestamp":1318281229,"content":" Three steps to winning more: practice, practice, practice. \n\nI have two decks myself, one for winning and one for fun. The fun deck never quite seems to win, I wish I could somehow get it under control (it uses only Beorning/Rohan/Dwarf/Istari/Eagle allies) but I know that the answer is that I need to practice. My winning deck does okay, I usually manage to get to the third quest card but die there. I may be having an ally shortage problem in that deck, but the only way I'll know for sure is to practice some more.  \n\nThe other thing to do, while you are practicing, is to think of any questions you may have from your games, and post them here. The people on this board have a wealth of information based on their own experience and questions they have considered in the past. And the majority of people here are nice and polite. I myself have only just  gotten comfortable enough to make a \"fun\" type deck, thanks to hanging out here. \n\nOne last thing, make sure you are playing correctly. Usually when people think the game is too easy, they are missing something. The opposite could be true as well. "}]}