{"url":"https://community.fantasyflightgames.com/topic/54048-a-couple-of-questions-after-my-first-game/","title":"A couple of questions after my first game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54048-a-couple-of-questions-after-my-first-game/?do=findComment&comment=535788","commentId":535788,"userName":"Gollum9","timestamp":1317536829,"content":"Just played my first game this morning (solo) and absolutely loved it!\n\nA couple of things that I came accross that I wanted to ask, I am sure there will be more as I play more!\n\n1) If you don't commit anyone to questing and the card revealed has a threat rating do I gain that many threat points? Basically, towars the end of Mirkwood I was fighting off a million and one spiders and there was no point gaining progress counters at the 3rd stage. If I then turn up a spider to add to the staging area do I then gain that much to the threat level? If so, I guess I will still need to quest late on in the game just to prevent this.\n\n2) If I forest snare one of the monsters attacking me (Ungoliant Spawn in this game!), does it still get dealt a shadow card? I appreciate the attack bonus' would have no effect but some add threat etc which I guess would still have an effect.\n\nIf you could help me out with these it would be much appreciated :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nMany thanks,\n\nAdam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54048-a-couple-of-questions-after-my-first-game/?do=findComment&comment=535796","commentId":535796,"userName":"HilariousPete","timestamp":1317539039,"content":"Hi Adam!\n\nGreat that you like this game, it's the same with me. For your questions:\n\n1.) Yes, if you draw an encounter card during the staging step of quest phase, you have to add its threat points to the total threat. Even if you commited no one to the quest. So it's important that you always have someone who can go questing (Eowyn's e.g.). [but don't forget that enemies engaged with someone and the active location don't count towards the total threat. This mistake happens sometimes when learning the game.]\n\n2.) When you play Forest Snare on an enemy, the enemy is prevented from attacking, but still remains engaged. Rulebook p. 18: \"At the beginning of the combat phase, the players deal 1 shadow card to each engaged enemy.\" So the enemy still gets a shadow card. Because the enemy doesn't attack, his shadow card is not going to be flipped and the shadow effect is not resolved. After all enemy attacks are resolved, and your attacks are resolved, the combat phase ends, and at that moment, all shadow cards are discarded, including the non-resolved.\n\nBest regards,\n\nPete"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54048-a-couple-of-questions-after-my-first-game/?do=findComment&comment=535807","commentId":535807,"userName":"Gollum9","timestamp":1317540755,"content":"That's great Pete, thanks for coming back so quickly and clearly!\n\nThe answer to 1) is going to make things tricky at times but all adds to the fun! At least the shadow card doesn't get used when the enemy is trapped which is something! I wasn't adding engaged enemy to the threat level so that's good :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nRight, i'm off for game 2 - thanks again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54048-a-couple-of-questions-after-my-first-game/?do=findComment&comment=535821","commentId":535821,"userName":"KlAve","timestamp":1317544728,"content":"Good luck! One thing, remember that Forest Snare only can be played in the planning phase, which basically means that any enemy you want to snare gets to attack you at least once (barring other cards played). I'm not saying you have played it otherwise, but it is a wrinkle at lot of players have gotten wrong the first few games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54048-a-couple-of-questions-after-my-first-game/?do=findComment&comment=535841","commentId":535841,"userName":"Gollum9","timestamp":1317549583,"content":"I did play that right but well worth a check!\n\nI believe the 5 attack was taken on a half dead ally - he died for the cause :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}