{"url":"https://community.fantasyflightgames.com/topic/54071-radagast-and-neutral-resources/","title":"Radagast and neutral resources","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54071-radagast-and-neutral-resources/?do=findComment&comment=535969","commentId":535969,"userName":"Metropolis Games","timestamp":1317569936,"content":"I haven't played with Radagast yet, but reading the card it occurred to me: can Radagast's resources be used to pay for neutral cards and also Creature cards or just Creature cards?\n\nMy initial thought was that Radagast is limited to paying for Creature cards (and, through his Action, healing them) but on closer examination I'm not sure if I am unduly limiting him: is the Creature benefit in addition to the normal use of resources i.e. to pay for cards that belong to his (i.e. no) sphere?\n\nThe card doesn't say: \"These resources can only be used to pay for Creature cards played from your hand\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/54071-radagast-and-neutral-resources/?do=findComment&comment=535972","commentId":535972,"userName":"Bohemond2","timestamp":1317570681,"content":"Normally, allies can not gain resources, nor can allies spend resources for any purpose.  So, for Radgast, there is no \"normal use of resource.\" They don't need to include the word only because their is no other possible use of the resource."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54071-radagast-and-neutral-resources/?do=findComment&comment=535974","commentId":535974,"userName":"HilariousPete","timestamp":1317570819,"content":"I don't think you can pay neutral cards with Radagast, because he's an ally and in the rules only a hero's resources can be used to pay anything (p. 12 \"In order for a player to play a card from his hand (or to activate certain card effects), he must pay for it by spending resource tokens from the resource pool of a hero who has a resource icon that matches the card’s sphere of influence\" and so on). It's only Radagast's special effect which allows him to use his resource tokens for anything, and this effect can be used only for cards having the creature trait.\nIf you would allow Radagast to pay for neutral cards without the Creature trait, then you also would be allowed to use the 8 resources on Grimbeorn to pay something neutral, and clearly this is not what FFG intended with Grimbeorn gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54071-radagast-and-neutral-resources/?do=findComment&comment=535975","commentId":535975,"userName":"Svenn","timestamp":1317570883,"content":"Metropolis Games said:\n\n \n\nI haven't played with Radagast yet, but reading the card it occurred to me: can Radagast's resources be used to pay for neutral cards and also Creature cards or just Creature cards?\n\nMy initial thought was that Radagast is limited to paying for Creature cards (and, through his Action, healing them) but on closer examination I'm not sure if I am unduly limiting him: is the Creature benefit in addition to the normal use of resources i.e. to pay for cards that belong to his (i.e. no) sphere?\n\nThe card doesn't say: \"These resources can only be used to pay for Creature cards played from your hand\"\n\n \n\n \n\n \n\nThese resources can only be used to pay for creatures. The rules don't specify that allies can pay for any cards at all. Radagast's rules override this, allowing him as an ally to pay for cards and specifying that his resources can be used to pay for creatures. His rules do not specify that they can be used for anything else."}]}