{"url":"https://community.fantasyflightgames.com/topic/54092-osgiliath-solo/","title":"Osgiliath Solo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54092-osgiliath-solo/?do=findComment&comment=536103","commentId":536103,"userName":"Puzzle2","timestamp":1317596257,"content":" So I am really just interested to see if anyone else has been playing this and what the experience has been. \n\nI have failed each time, but I constructed my first four-sphere deck and after this last play I see at least a glimmer of hope. Sure I was a little lucky on the draw (Steward and three 2 cost allies), but you need a little luck in this game. I was able to get to stage 4 and put 5 wounds on the Witch King. Unfortunately the threat was too much to handle with low questing power on my end. I drew a lot of locations and most of them increase in threat when you cross the Anduin. I was facing a threat of 12 in the staging area. I lasted exactly one turn at this stage.\n\nThoughts out there?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54092-osgiliath-solo/?do=findComment&comment=536126","commentId":536126,"userName":"Narsil0420","timestamp":1317605615,"content":"I've played a couple games with both three and two players in addition to three times solo now. It's a beast but I've actually gotten closest solo. It almost seemed to be harder with 3 than solo. Strategy is hard to figure out because it's not an encounter that focuses on one main aspect of the spheres but really requires you to be pumping on all cylinders (although it is slightly more heavy on combat than questing). One of the keys is CHEAP ALLIES!!! You go through so many people in this game.\n\nThose are my thoughts so far..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54092-osgiliath-solo/?do=findComment&comment=536184","commentId":536184,"userName":"Glaurung","timestamp":1317621950,"content":"I sue to play against this one many times solo and few times 2 players sessions. Solo i lose 7 games from 10.\n\n2 Players game is more easy cose you will get rangers for sure by shadow effect or by revealed effect. In solo game no ranger sometimes mean you lose already (i mean Ranger of Osgiliant objective card).\n\n3 Players i never play but i think can be really nasty cose there is really powerful effect on the cards and when you start get 3 cards per turn you really get big problems, special last stage of the quest.\n\nIf you dont kill Wich-King quickly you also in big trouble. Since a always use Gimly i can manage Wich-King but without Gimly is really difficult.\n\nI love this quest!!!! This is good example of good quest!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54092-osgiliath-solo/?do=findComment&comment=536328","commentId":536328,"userName":"Bullroarer Took","timestamp":1317644202,"content":"Glaurung said:\n\n2 Players game is more easy cose you will get rangers for sure by shadow effect ...\n\n\n\nI thought that if Ranger was revealed as a Shadow Effect you had to discard him?  I think that's true of all objective cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54092-osgiliath-solo/?do=findComment&comment=536336","commentId":536336,"userName":"Bohemond2","timestamp":1317645132,"content":"The Ranger of Ithilien has shadow text\n\n \n\nShadow : Deal 2 damage to attacking enemy. The defending player may exhaust a character he controls to take control of Ranger of Ithilien."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54092-osgiliath-solo/?do=findComment&comment=536341","commentId":536341,"userName":"Glaurung","timestamp":1317645769,"content":"Bullroarer Took said:\n\nGlaurung said:\n\n \n\n2 Players game is more easy cose you will get rangers for sure by shadow effect ...\n\n \n\n \n\nI thought that if Ranger was revealed as a Shadow Effect you had to discard him?  I think that's true of all objective cards?\n\n\n\nYes you discard him if you dont want to exhaust character to get him on your side as ally. And sometimes when all of your characters already exhaust you really regret for that when he deal to damage to enemies and goes to discard pile.1 time in my game ranger kill Wich-King wit his shadow ability!!!\n\nAlso Burning brand ability play bad role with ranger shadow effect since you cannot do nothing with that."}]}