{"url":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/","title":"Adding more players?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/?do=findComment&comment=536935","commentId":536935,"userName":"Ryan the Lion","timestamp":1317739412,"content":" I see that the core set comes with enough cards for up to 2 players.  I have heard that buying more core sets is the solution to getting up to 4 players, but I was wondering if the Adventure Packs add enough new cards to create decks for new players.  Also, if you buy 3 core sets (to get 3 of each card) can you then play with up to 6 players?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/?do=findComment&comment=536942","commentId":536942,"userName":"Dam the Man","timestamp":1317740105,"content":"Regardless of the number of Core Sets you buy, there are only 12 different Heroes, each Unique, so unless you plan on having some/all players use less than 3 Heroes, 4 is the max number of players. Adding three APs could add a fifth player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/?do=findComment&comment=536954","commentId":536954,"userName":"Svenn","timestamp":1317741449,"content":"You can theoretically play with any number of players. As Dam said, you will need more heroes than come in the core set to play with more than 4 players.\n\nIf you are on a limited budget I would recommend picking up the APs over a second (or third) core set as you'll get not only new player cards and heroes, but you'll also have new adventures to play. If you can afford it, I personally think having 2 core sets is a good idea, especially if you are going to be supplying cards for more than 2 people."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/?do=findComment&comment=536956","commentId":536956,"userName":"Ryan the Lion","timestamp":1317741547,"content":" Awesome, thank you guys for the info.  Just trying to make an informed decision before I invest.  The game looks fantastic and I want to be able to present it to my friends rather than ask them to invest along with me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/?do=findComment&comment=536980","commentId":536980,"userName":"Bohemond2","timestamp":1317743948,"content":"Don't play with more than four players; the game won't scale properly.  At the very least, certain scenarios don't contain enough physical cards to run without buying additional packs.  You are better off running 2 three-player games than one 6-player game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/?do=findComment&comment=537259","commentId":537259,"userName":"Vyron2","timestamp":1317792589,"content":" yeah.... I also think that more than 4 players will heavily impact the coop-aspect - you already have to coordinate 4 players... any more just becomes ridiculous... ;-)\n\n2-4 is fair enough....or better 2x3...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54184-adding-more-players/?do=findComment&comment=538098","commentId":538098,"userName":"Ryan the Lion","timestamp":1317913597,"content":"What I was most interested in was the best way to accommodate 4 players as cheaply as possible.  The 6 player comment was just sort of curiosity since it was suggested to me on BGG that I get 3 copies of the core set to triple up on various cards."}]}