{"url":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/","title":"How about an Adventure Pack with a reprint of some Core Set player cards?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537218","commentId":537218,"userName":"ppsantos","timestamp":1317781052,"content":" I hope FFG releases an AP with quest, encounter cards, and the usual 3-of-a-kind player cards and add  reprint of 1 or 2 copies of a Core Set card, (eg Celebrian Stone or Unexpected Courage).  That way, those who want the regular AP get the normal stuff and those looking for extra Core Set cards can get them, without buying 2 or 3 Core Sets.  The AP would have 1 Core Set card reprint (1 or 2 copies depending on how many is needed to get 3x).   Then the next AP would have another CS card reprint added. \n\nDeck builders would have more incentive to  buy the AP (to get 3 copies of a card, instead of buying extra Core Sets).  Casual players will get the  AP plus the reprint.  There won't be any need to buy multiple copies of AP and CS.   Players get more excited in buying the AP because there's something new and there's something old in it.  How about that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537238","commentId":537238,"userName":"Eryx_UK","timestamp":1317786309,"content":"I would certainly buy a copy if FFG proposed this. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537243","commentId":537243,"userName":"Vyron2","timestamp":1317786699,"content":" well sure... but come on... if you want these cards - you'll eventually buy 3 core sets (like me)... but it won't be necessary... I think after the Khazad-Dum expansion, you'll have lots of better options... none of the \"rare\" cards are THAT powerful that you'd have to add them 3x to your deck... all the important cards are in the core set 2x or 3x... I'd buy 2 core sets, as you have an ample amount of tokens and 4 threat counters...\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537265","commentId":537265,"userName":"Cletus","timestamp":1317793216,"content":"I would buy this.\n\nI would also support the inclusion of the cards in Khazad Dum or another Deluxe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537271","commentId":537271,"userName":"mr.thomasschmidt","timestamp":1317793980,"content":" I would also buy it. Heh, this was actually what I hinted in my last post here at the forum but due to the way I formulated the question all I got was \"unthinkable, never gonna happen\" and so on LOL :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537288","commentId":537288,"userName":"Bohemond2","timestamp":1317797160,"content":"The negative response you received stemmed from the fact that this topic has already been discussed extensively.  Christian Peterson, the CEO of fantasy flight weighed in and explained why the core set used a different distribution model than subsequent sets and stated that they would not be issuing the sort of product that you are asking for. \n\nCould the company reverse its publicly stated position? Sure, its possible. But be aware that what you perceive as negative is simply the company line of FFG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537312","commentId":537312,"userName":"DurinIII","timestamp":1317801958,"content":" Hey Bohemond. I missed that conversation...so, exactly what did they say the reason was for choosing the current format?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537326","commentId":537326,"userName":"mr.thomasschmidt","timestamp":1317805009,"content":"Yeah. Please enlighten us :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Since they changed the Battle packs in Warhammer LCG from 40 cards non 3x to 60 cards with 3x next cycle, what did they say to totally rule out one single adventure pack with the cards that add up all the player cards from the core set to 3x? (I think it's 60 or 64) cards. No offense intended just really wanna now :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537370","commentId":537370,"userName":"radiskull","timestamp":1317810195,"content":" In the interview with Nate French and Lukas Litzinger last night, they said that the preference was to include a wider variety of cards in the core set, rather than a \"samey\" kind of feel.  They wanted the \"out of the box\" experience to be more self-contained and complete.  This is not to say they won't top up the core set later, but I doubt it.  They've never done so with AGoT."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537385","commentId":537385,"userName":"Bohemond2","timestamp":1317811190,"content":"\nHere are two posts from Christian Peterson (posted at board game geek), explaining their reasoning.  I could have sworn there was another post from Peterson (or maybe nate french) explaining that they had no plans to issue a pack that would get the core up to x3, but I can't recall what forum/interview it was from.\n\n\"FFG has switched to the \"complete pack\" model with our monthly chapter/battle/asylum/adventure packs. This means that one pack will get you a complete play set i.e. 3 of each of the 20 new cards (whether you're a casual player or a competitive player).\n\nThe Core Set is different. Why?\n\nBecause as a publisher we have one of two choices for the Core Set: Either include all cards in triplicate, OR provide a much greater variety of cards.\n\nBecause we want to make the core sets a great stand-alone experience with tons of options and repeated play value, we have decided to on a greater *variety* of cards.\n\nThis means that casual players will be able to get great value and repeat play from the Core Set w/o needing any additional core sets or adventure packs.\n\nFor the non-casual crowd, this means a few LCG releases (such as the core set) will be required to purchase in triplicate to have a complete play-set of every single card.\n\nThis is the direction FFG has chosen to go, it may not be to your preference, but I hope the above makes sense. In either case, if you do feel your play preference requires you to purchase 3 core sets, I will have you remember than a purchase of 3 core sets (being $119.85 at retail) is still less expensive than buying even *a single* booster display of Magic (of which 3-4 would be required to get a complete play-set, and not even guaranteed at that.)\"\n\n-----------------------------------------------------------------------------------------------------------------------\n\n\"In our opinion, the core set provides a *great* experience (YMMV) for under $39.95, allowing players like the one above to enjoy the experience without further cost, and allows dedicated players to expand should they choose to do so.\n\nI realize there are some differing opinions on this. Know this: FFG had a choice of providing a more narrow replay experience (with fewer card types but more of each card) or a broader experience (with more card diversity and re-playability). For our LCG core sets, we choose the latter. There is no conspiracy, it is a choice between a retail price point, diversity, and card counts. Players who want to maximize every option can, at a very competitive cost, by getting additional core sets to increase the player count and number of cards. Casual players, or people who just want to sample the experience, can do so at a very reasonable cost. Since dedicated players are the ones likely to purchase expansions, we make 3 of every player card available in these monthly release.\"\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537393","commentId":537393,"userName":"mr.thomasschmidt","timestamp":1317812178,"content":"Well, they don't really rule out at future AP with the remaining cards. All they say is that if you want the cards to begin with you need to purchase 3 core sets. Well, this answered my question to the full. I'll give it a 50/50 chance for a future small pack with the remaining cards. Even if it might never happen it's not ruled out by what I have read here.\n\nThanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537459","commentId":537459,"userName":"Voldigar","timestamp":1317820436,"content":"It's true! More people want this product. I posted the same suggestion back here ppsantos:\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=530006 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=530006]\n\nThe problem here is assuming that gamers are all divided into \"casual\" and \"dedicated/hardcore\". It's simply not true. A lot of us are somewhere in the middle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537463","commentId":537463,"userName":"KlAve","timestamp":1317820942,"content":"Truth be told, I don't really care one way or the other. If the reprints would take away a spot from a new card, I would be against such a solution, but otherwise I'm indifferent. The \"missing\" cards don't impede my enjoyment of the game, and I am at a point where I could see myself buying a second core set - not just for the player cards, but for the tokens, trackers and encounter cards as well (building several ready to go quests is a boon in my optic)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537658","commentId":537658,"userName":"silverhand77","timestamp":1317847972,"content":"Do you happen to recall Christian's reasoning? I'm curious to know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54222-how-about-an-adventure-pack-with-a-reprint-of-some-core-set-player-cards/?do=findComment&comment=537659","commentId":537659,"userName":"silverhand77","timestamp":1317848176,"content":"oops my bad, should have just kept reading :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] rofl!"}]}