{"url":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/","title":"Darrowdelf!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537572","commentId":537572,"userName":"Svenn","timestamp":1317835587,"content":"www.fantasyflightgames.com/edge_news.asp [http://www.fantasyflightgames.com/edge_news.asp?eidn=2715]\n\nThoughts? I'm excited to see the Misty Mountains!\n\nDoors of Durin looks... interesting. It looks like they are branching out into trying some new mechanics, which is exciting!\n\nI am a little disappointed that it seems the Darrowdelf cycle will not be using encounter sets from the core set, or at least that's how it sounds. I would like to see a mix of encounter sets from the various packs and not just combinations from the same set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537578","commentId":537578,"userName":"Svenn","timestamp":1317835933,"content":"I just noticed the symbol on the Doors of Durin card... Watcher in the Water encounter set?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537584","commentId":537584,"userName":"Narsil0420","timestamp":1317836352,"content":"I found a little secret on the page... On the bottom picture of the announcement, the picture of the beautiful elf woman, when I saved it to my computer, the title of the picture was revealed!   Arwen\nby the queen of the elves Magali Villeneuve, of course!\n\n \n\nFirst hero of the expansion cycle? I think so!\n\nI'm very excited about the idea of travelling over the Misty Mountains. I was worried we'd be stuck in those dank mines for the whole cycle!\n\nNew Elf cards, Booyah!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537586","commentId":537586,"userName":"Svenn","timestamp":1317836611,"content":"Nice find! Hmm, Arwen hero... nice!\n\nMan, I can't wait until that full cycle is done and we've got a pile of quests and heroes and a ton of deck building possibilities. It's exciting to think about!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537587","commentId":537587,"userName":"HilariousPete","timestamp":1317836625,"content":"Watcher in the Water and Arwen... You both have a good eye! :-)\n\n@Svenn: Yes, they're experimenting more and more on what is possible with game texts (Doors of Durin) or objective cards (Athelas + Wilyador). I like those ideas, they made every adventure pack a unique experience. And it seems FFG is in no way stopping on making adventures interesting.\n\nAnd I'm also glad that not all quests of KD + Dwarrowdelf cycle will be in the mines, but also in the Misty Mountains and surroundings! I like the \"outdoor\"/wilderness locations and hazards more than the those themed around dungeons/mines... I'm really excited for this new cycle!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537594","commentId":537594,"userName":"Vyron2","timestamp":1317837889,"content":" This is just plainly awesome! I think that the initial \"critics\" of the game can be satisfied, as it seems that it's progressing in the right direction :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nthe most awesome thing about the game is: the APs and DPs are coming out peu à peu, so that means, that you can really play an AP to death and try ALL the cards - normally in a CCG, you throw half the cards away immediately and never play them... not the case in LCG!!! BEST SYSTEM EVER!!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537661","commentId":537661,"userName":"marlow4","timestamp":1317848387,"content":" We're going to be some crazy deck building fools next year.\n\nLooks like I picked the wrong week to cut back on caffeine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537770","commentId":537770,"userName":"Untergeher","timestamp":1317872332,"content":"I was very glad when they announced that the new AP cycle would only use encounter cards from the deluxe expansion. And don't forget: This time there are six different encounter sets, so I assume there will be loads of options for the designers. As much as I like the original encounter sets I imagine it would get boring over time to see the same old treacheries over and over again...\n\n(Remember the time when we only got to play the core set? For months, because Gollum was nowhere to be found? But now everything is going smoothly and I appreciate their release schedule.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537773","commentId":537773,"userName":"Maniacske","timestamp":1317873265,"content":"Untergeher said:\n\n(Remember the time when we only got to play the core set? For months, because Gollum was nowhere to be found? But now everything is going smoothly and I appreciate their release schedule.)\n\n\n\n \n\nI'm with you on that release schedule remark. FFG has picked up the pace quite nicely, and it feels like there is some LotR news or article being thrown at us every week now. Really helps keeping the fans excited.\n\nAlso excited about the new encounter decks. I am wondering though if they will make new versions of existing heroes/allies, like they do with Game of Thrones. The article seems to hint at it, stating that there will be new (familiar) faces. Or am I reading to much in it?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537789","commentId":537789,"userName":"Feqz","timestamp":1317874860,"content":"Maniacske said:\n\nUntergeher said:\n\nAlso excited about the new encounter decks. I am wondering though if they will make new versions of existing heroes/allies, like they do with Game of Thrones. The article seems to hint at it, stating that there will be new (familiar) faces. Or am I reading to much in it?\n\n \n\n\n\n \n\nI hope your not reading to much in it. It would really be nice to see characters like Faramir and Haldir as Heros but I doubt it. This would make their first cards useless or at least bring conflict into the game if someone would like to play the hero and the other one the ally.\n\n \n\nI'd personally like the option tough. Some of the released heros i'd have liked to see as allies or even events and some allies would have made great heros."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537830","commentId":537830,"userName":"DurinIII","timestamp":1317882412,"content":" So that ring mail...is it a 2 costing card to bestow a mere +1 defense on a Dwarf or a Hobbit? Or do you think there is more to the card that we just can't see yet?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537839","commentId":537839,"userName":"HilariousPete","timestamp":1317883743,"content":"I hope there is more to it. Compared to Dunedain Warning or Citadel Plate it would be too expensive, even with the text allowing to attach to a character instead of only a hero. So I hope its +1 def and +1 hitpoints or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537842","commentId":537842,"userName":"silverhand77","timestamp":1317884884,"content":"I am amazed at how quickly Darrowdelf has been advertised considering KD hasn't even hit the shelves yet,  also I think it's awesome that the game is growing quickly, it means that there pretty much no way to get bored :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537848","commentId":537848,"userName":"Untergeher","timestamp":1317886195,"content":"Regarding allies turning into heroes: I think I read it on the BGG forums that Nate French hinted at that possibilty in an interview with theonering.net... Don't have the link right here, sorry.\n\nI think they were also talking about the possibilty of Glorfindel (for example) showing up as a hero in another sphere.\n\nSo I think we can expect some interesting developments in the future. And it would also lead to some difficult decisions. Do I want Faramir as a hero or do I want to use him as an ally?\n\nMy hopes are pretty high regarding the future of this game (mabe because it's the first LCG that I follow from the very first day on), but the recent announcements and previews have given me no reason to be more pessimistic..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537930","commentId":537930,"userName":"Mighty Jim 83","timestamp":1317896838,"content":"HilariousPete said:\n\nI hope there is more to it. Compared to Dunedain Warning or Citadel Plate it would be too expensive, even with the text allowing to attach to a character instead of only a hero. So I hope its +1 def and +1 hitpoints or something.\n\n\n\nFrom the angle in the preview, I'm not even convinced it's 'character' - there's definitely room for the word \"hero\" in the gap we can't really see yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54259-darrowdelf/?do=findComment&comment=537979","commentId":537979,"userName":"Hastur360","timestamp":1317903135,"content":"DurinIII said:\n\n So that ring mail...is it a 2 costing card to bestow a mere +1 defense on a Dwarf or a Hobbit? Or do you think there is more to the card that we just can't see yet?\n\n\n\n \n\nJust curious why you think it would be +1 Def? If keeping in line with Citadel Plate that would be +1 Hit Point. This would make the weak hobbits hardier and the already hardy dwarves that much more durable.\n\n \n\nAs far as the cycle goes it looks like amazing things are store for us as players. I love the idea behind Doors of Durin. The write up about the quests coming up and the stuff we shall see in the cycle really has me very happy that I picked this LCG to play."}]}