{"url":"https://community.fantasyflightgames.com/topic/54282-the-hobbit-apstand-alone-set/","title":"The Hobbit AP/stand-alone set","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54282-the-hobbit-apstand-alone-set/?do=findComment&comment=537776","commentId":537776,"userName":"Maniacske","timestamp":1317873740,"content":"This is really a long-shot, but with the The Hobbit movies coming out late 2012/2013 I was just wondering about the chances of FFG making a sort of standalone expansion with special AP's telling the story of the Hobbit? Maybe after the main story arc of the LotR lcg will have come to an end (which probably will take a few years), or even sooner?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54282-the-hobbit-apstand-alone-set/?do=findComment&comment=537806","commentId":537806,"userName":"HilariousPete","timestamp":1317878572,"content":"To put the exact story of the Hobbit in consecutive quests in a cycle (or in 2 cycles, or a deluxe expansion) - no, I don't think they'll do that. If so, fans of the game will be absolutely thrilled, and I figure they will be disappointed by all quests / APs which would follow this Hobbit-cycle, because they don't seem to be so epic like the quests in the Hobbit (it's the same with the LotR storyline of the books).\n\nBut I think they'll release the different \"stations\" of the Hobbit, distributed over many different APs. We already have the Passage through Mirkwood (ok, in the card game, we're moving from east to west, and in the Hobbit, they moved from west to east; and we didn't get distracted by elvish lights, so there are some differences). But I think another passage through it will copy some of the already published ideas for the encounter set and it could seem to be a rip-of and/or uncreative.\n\nI guess (but this is total speculation) FFG will move on with this strategy - use places, people and items known from Tolkien's books (e.g. Rhosogobel and Radagast) and put it into a quest which has only partly to do with the main story. Perhaps we'll see the Great Goblin in the Dwarrowdelf cycle (but in a different context as in the Hobbit)?\n\nThis will get problematic with the finding and destruction of the One Ring - there they will have to stick to the story closer. And perhaps they eventually will release a ring-finding-quest, but like you also pointed out, I think it will be only in a far future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54282-the-hobbit-apstand-alone-set/?do=findComment&comment=537988","commentId":537988,"userName":"Eyedunno53","timestamp":1317903629,"content":"I remember reading about the licencing that FFG has for the game that only allows them a certain time frame to place their game in.  This excludes them from being able to include things from the Hobbit, or the LotR books.  Sadly, I cant find the link to that post anymore..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54282-the-hobbit-apstand-alone-set/?do=findComment&comment=538330","commentId":538330,"userName":"Vyron2","timestamp":1317963601,"content":" yes, that is correct, I read that, too... which means, that technically, they couldn't use a Balrog, as they don't have the rights on Silmarillion/Hobbit/LotR???\n\ncomplicated law stuff :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] intellectual property is one of the finest perversions western society has come up with..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54282-the-hobbit-apstand-alone-set/?do=findComment&comment=538369","commentId":538369,"userName":"faith_star83","timestamp":1317970878,"content":"If I remember correctly somewhere it said that the license ffg has covers lotr and hobbit. However, ffg set a time-frame between the ending of the events of the hobbit and before the events of the beginning of lotr for themselves, since they wanted to create something of their own rather than just copy Tolkien's masterwork. Thus, I cannot imagine any hobbit adaptions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54282-the-hobbit-apstand-alone-set/?do=findComment&comment=538401","commentId":538401,"userName":"HilariousPete","timestamp":1317975099,"content":"I did some digging. Sadly I could'nt find anything on the license and its restrictions, but something about the timeframe faith_star already mentioned:\n\n\"In The Lord of the Rings: The Card Game, players take on the roles of heroes attempting to complete dangerous quests. These quests take place during a broad span, beginning near the end of The Hobbit, and culminating near the beginning of The Fellowship of the Ring. Instead of directly retelling the classic stories that have previously been narrated, this game provides players with a variety of elements—characters, settings, enemies, events, items, artifacts, scenarios—that allow them to embark upon new adventures and share new experiences with these beloved characters during this ominous period of Middle-earth history.\"\n\nSource: http://www.fantasyflightgames.com/edge_news.asp?eidn=1528 [http://www.fantasyflightgames.com/edge_news.asp?eidn=1528].\n\nSo perhaps we'll see a quest about the battle of the 5 armies, and perhaps we sometimes have to deal with Smaug in some way, but as long as FFG doesn't change the strategy, I think they won't tell the exact story of the Hobbit.\n\nAnd I've got to say I like this strategy. We (will) have many different and hopefully exciting adventures in ME, and play the \"what did hero X do before the Fellowship?\" scenario or the \"What did Thranduil do in the Ring War?\" scenario etc. This opens a lot of possibilities for the game creators."}]}