{"url":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/","title":"Bilbo&#039;s threat?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538018","commentId":538018,"userName":"Darthvegeta800","timestamp":1317906313,"content":"Bilbo's threat seems quite of. Regardless of the ability usually you just add attack, defence, will and health to get to it.\nBut Bilbo's isn't correct. And his ability isn't even that great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538021","commentId":538021,"userName":"Svenn","timestamp":1317906438,"content":"This has come up many times before.\n\nI don't think it's that big of a deal. His ability is actually very nice. He isn't so great for a solo deck, but with a team he can still be good.\n\nBut, if you don't like him, don't use him... there are plenty of other heroes. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538027","commentId":538027,"userName":"Hastur360","timestamp":1317906938,"content":"Card draw is generally the most powerful thing in any card game. The ability to get more cards in hand than the usual amount to give you greater variation in what you can do in a turn is powerful. Don't forget that this game is designed as a COOPERATIVE game. This means two or more players. Yes you can play solo but as we see with Brand, Wandering Took, Bilbo and several other cards that they are not effective in the solo game.\n\nSo as Svenn said if you are playing solo don't use him there are much better choices. But in a multi-player game he shines quite bright. The card advantage he dishes out with not having to exhaust to do such a thing is simply unmatched in the game so far. And this is why he deserves an unbalanced threat compared to the other Heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538029","commentId":538029,"userName":"Darthvegeta800","timestamp":1317907139,"content":"Meh I've used him 2x so far and he turned out awful. Problem is he sucks at everything. Most heroes can at least do something else 'somewhat' if needed. He just sucks all round and the card draw of 1 card has never been that useful. Though granted this is in part due to the fact that one of us usually has at least 1 card draw deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538032","commentId":538032,"userName":"Voldigar","timestamp":1317907270,"content":"I'm at a loss as to why Bilbo gets a bad rap in solo play. He's the key cog in my most powerful solo deck. As the perpetual \"First Player\", I get the extra card every round - I find that rather righteous. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538035","commentId":538035,"userName":"Svenn","timestamp":1317907381,"content":"He is doubling your usual card draw per turn, without anything extra. His stats aren't great for sure, but you can still toss him in to help out with anything, even if it's not for a ton. If you add attachments to him he can work out quite well.'\n\nAgain, if you don't like him then don't use him. There are more than enough heroes even if you are playing with 4 players that you can just ignore him. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538039","commentId":538039,"userName":"Svenn","timestamp":1317907556,"content":"Voldigar said:\n\nI'm at a loss as to why Bilbo gets a bad rap in solo play. He's the key cog in my most powerful solo deck. As the perpetual \"First Player\", I get the extra card every round - I find that rather righteous. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\nI tried a deck with him but his low stats are very difficult in solo play where every hero needs to fulfill a specific role. In a multiplayer game you don't have to deal with questing and combat on your own all the time. With a solo deck I've found that I really need a hero each for attacking, defending, and questing just to keep up.\n\nBut hey, if you've found a way to work him into a solo deck, awesome! I'd be curious to see this deck. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538045","commentId":538045,"userName":"plueschi2","timestamp":1317908029,"content":"Voldigar said:\n\nI'm at a loss as to why Bilbo gets a bad rap in solo play. He's the key cog in my most powerful solo deck. As the perpetual \"First Player\", I get the extra card every round - I find that rather righteous. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\nexactly this.\n\nBilbo is awesome. I take him over Beravor in Solo play most of the time. Give him Protector of Lorien and he is a kick ass defender, who backs up as a quest nuke and still fuels your hand plus the Protector ability..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538050","commentId":538050,"userName":"Bohemond2","timestamp":1317908262,"content":"Of course he is better with an attachment.  That's a foolish comparison.  Beravor with Unexpected courage far surpasses the utility of Biblio with Protector of Lorien."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538051","commentId":538051,"userName":"Voldigar","timestamp":1317908394,"content":"I'm with you on the Offense/Defense/Questing philosophy. Bilbo is my \"Defender\" in that three ring circus, and admittedly, if I don't get something to help him out early I'm in bad trouble. After testing the deck several times to verify it wasn't a fluke, I posted it on Cardgamedb.com. It was made with only the first adventure pack out, so it's in serious need of some upgrades (some way better options are available now). It's also a four-sphere deck. PH34R!\n\nwww.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/hairmaster-four-sphere-solo-deck-r77 [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/hairmaster-four-sphere-solo-deck-r77]\n\nEnjoy! Thanks for reminding me I need to update this one.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538055","commentId":538055,"userName":"Svenn","timestamp":1317909039,"content":"Bohemond said:\n\nOf course he is better with an attachment.  That's a foolish comparison.  Beravor with Unexpected courage far surpasses the utility of Biblio with Protector of Lorien.\n\n\n\nWell, you could have both in a game (probably a multiplayer game, not sure that would work well solo). ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nHis stats aren't THAT much worse than Beravor's, and he has 1 less threat. I'd say Bilbo is a good early game character because you are constantly getting the card draw and can still use him, plus you start with less threat. Late in the game (or if you get lucky enough to get Unexpected Courage early) Beravor might start to shine because you can use her card draw and still use her for something else. Of course, Bilbo with Unexpected Courage would give you card draw constantly, then could participate in questing AND attacking/defending...\n\nBoth have their uses, and it's impossible to compare them in all situations. I think it's great to have the choice. Could Bilbo have had better stats or lower threat? Sure, I suppose so. Does that mean he is worthless now? Not quite."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538066","commentId":538066,"userName":"Bullroarer Took","timestamp":1317910253,"content":" Bilbo is a 6."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538107","commentId":538107,"userName":"Dam the Man","timestamp":1317914491,"content":"Svenn said:\n\nHis stats aren't THAT much worse than Beravor's, and he has 1 less threat.\n\nBeravor can take undefended damage up to 3 (2-3 seems the average), Bilbo only from att 1. Rhosgobel's Treacheries will mince up Bilbo, quite possibly turn 1, Beravor might survive long enough to heal her. Beravor is also a better quester and attacker, plus, best of all, she's not a hobbit gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] . If nothing else, 2 hitpoints is what kills Bilbo for me (most of the time probably literally, if I ever used him, which I won't). While card draws are nice (I got UC on Beravor turn 1 today in Carrock), having 20+ cards in hand didn't really do anything for me, since I was almost always short on resources. Now, if there ever comes a card that allows a player to discard cards from hand and gain 1 resource per card discarded (or even 1 per 2 cards)..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538111","commentId":538111,"userName":"Svenn","timestamp":1317914856,"content":"The low hitpoints is my biggest problem with Bilbo as well, but his defense is the same as Beravor's. 1 less Attack and Willpower isn't a HUGE deal, especially since he's got lower threat.\n\nAgain, not requiring him to exhaust for his ability means he can do more while still giving you extra cards. If you want to toss Unexpected Courage on Beravor, sure it's great. Of course if you had Bilbo you could instead place it on a different hero and continue to get the card draw and some use out of Bilbo.\n\nAgain, it's all about options. Neither one is better in all situations, both have their uses. Bilbo is weak in terms of HP, but don't underestimate the effectiveness of passive abilities. Some people have been able to use him to great success, and some people prefer to just use Beravor. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538116","commentId":538116,"userName":"Dam the Man","timestamp":1317915479,"content":"When it comes to 1WP heroes questing, only one I really send out are Thalin and Theodred and both of them have questing related abilities. Send out Bilbo and there are a ton of cards that get him to within an inch of his life (Necromancer's Reach) or dead (quite a few in fact, maybe even Dol Guldur Orcs if he goes questing alone). If you have all the cards you need/can pay for in hand already, Beravor at least puts out 2WP. Even without UC, if not needed to quest, I can sit back and wait to see if she's needed to defend (in Beravor, Dunhere, Eleanor options for defenders are rather limited) and if not and no attack, still can use her ability. In that sense, for me she is like Denethor, even if he is a superior wall, but almost never goes out questing (esp. not if/when he gets Dark Knowledge gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif] ).\n\nLow HPs are also my main concern about Brand (Tactics with 3HP, really?). Well, HPs and art, man he has a thorny stick sideways in his butt and someone is trying to yank it out in that picture lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538119","commentId":538119,"userName":"Svenn","timestamp":1317916046,"content":"And in those close games where you need every point you can get for questing or attack/defense you end up never really getting to use Beravor's card draw. Then you're just left with a useless ability. Bilbo might not add as many points, but you're still getting extra cards which can make a difference. Who knows whether that extra card draw will save you. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI agree about Brand though... man that picture is awful. I almost want to use him when playing with friends, but I don't think I can stand to look at the card for that long, lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538137","commentId":538137,"userName":"Bohemond2","timestamp":1317918427,"content":"The question isn't, \"can you devise some situation in which Bilbo is more useful than Beravor\"?  The question is, which character is, in most situations, more useful. And the answer to that question is Beravor.\n\nBilbo's best use* (without attachments) come in taking actions no other hero would want to take.  need someone to get stuck in web?  Bilbo is your hobbit.  Don't want to waste time picking Athelas? Send Bilbo.  He isn't good at questing attacking or blocking.  Yes, his power doesn't require you to tap, but, under most circumstances, you can't do much with bilbo when you do tap him.  Is he functional? Sure.  but he isn't a strong character, and stacks up poorly against another character who fills a very similar roll.\n\n* the other great time to use him is when your friendshave already taken Beravor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538153","commentId":538153,"userName":"DurinIII","timestamp":1317921641,"content":" I am also of the opinion (as I was when I first opened the Hunt for Gollum Adventure Pack) that Bilbo is definitely a game design flaw. He is not good enough for the amount of threat he costs.  I mean, they could have at least given him an extra willpower...come on, he's the first real adventurer in the hobbit history, and he gets a mere 1 willpower...Eowyn on the other hand sits around at Edoras tending to Theoden most of her life, and in this game she is the best quester by far...really? I think it's lame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538154","commentId":538154,"userName":"DurinIII","timestamp":1317921718,"content":" And why does Eowyn have more Hp than Bilbo? I mean he lived far past the age of an average man of Rohan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54301-bilbos-threat/?do=findComment&comment=538428","commentId":538428,"userName":"Titan","timestamp":1317978980,"content":"I've found out that with a good deck in place, you can still find plenty of opportunities to use Beravor's ability. She is better at everything than Bilbo and does it for a measly one additional threat point. She is simply far more cost effective, even without any attachments. At any rate, that little extra expense can be worth it because sometimes you do get what you paid for. "}]}