{"url":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/","title":"Discarding attachments","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/?do=findComment&comment=538159","commentId":538159,"userName":"lkb57","timestamp":1317922273,"content":" The core card forest spider has a Shadow effect that reads: \"Defending player must choose and discard 1 attachment he controls.\"\n\nThe rule book defines \"control\" as: \"A player controls all cards that he owns\"\n\nSo, based on this, does this mean that if I'm hit with the Shadow effect from a forest spider, I can search through my deck and discard any attachment I want? Cause technically I control my entire deck . . . Or do I need to discard from my hand/cards in play?\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/?do=findComment&comment=538163","commentId":538163,"userName":"Vyron2","timestamp":1317922723,"content":" no, you don't \"control\" your deck... in ANY CCG/LCG you only \"CONTROL\" cards, which are in play... so you discard attachments that are in play... mind you, only HERO attachments, not \"encounter\" attachments, such as caught in a web..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/?do=findComment&comment=538184","commentId":538184,"userName":"lkb57","timestamp":1317927026,"content":"Vyron said:\n\n no, you don't \"control\" your deck... in ANY CCG/LCG you only \"CONTROL\" cards, which are in play... so you discard attachments that are in play... mind you, only HERO attachments, not \"encounter\" attachments, such as caught in a web...\n\n\n\n \n\nI agree that that interpretation makes the most sense, but I got confused because this is exactly what the rulebook says:\n\nA player “owns” his heroes and the cards that he has chosen for the player deck he is playing. A player “controls” all cards that he owns, unless another player or the encounter deck takes control of the card through a game effect. Any time a card leaves play, it reverts to its owner’s hand, deck, or discard pile (as directed by the effect forcing the card out of play).\n\nSo, according to the rule book, you own all the cards you've chosen for your deck (i.e. all the cards you're using for a particular game) and you control all of those cards unless another player or the encounter deck has taken control of them. Therefore, by a strict interpretation o' the rule book you do control your entire deck, regardless of whether or not a card is in play at the moment.\n\nOr is that not how you read it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/?do=findComment&comment=538212","commentId":538212,"userName":"Eryx_UK","timestamp":1317933321,"content":"It's a standard in all CCGs and LCGs that the control aspect applies to cards in play not in hand, discard or deck. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/?do=findComment&comment=538242","commentId":538242,"userName":"radiskull","timestamp":1317939523,"content":" It's also part of the rules as written that nothing interacts with any card that is out of play unless the card specifically says it does.  Thus, if the card says \"Choose and discard one attachment you control\", it really means \"choose and discard one attachment in play you control.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/?do=findComment&comment=538246","commentId":538246,"userName":"lkb57","timestamp":1317940520,"content":" Thanks everybody, this is making a lot more sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54314-discarding-attachments/?do=findComment&comment=538486","commentId":538486,"userName":"Kiwina","timestamp":1317985434,"content":" I also want to point out that if you put an attachment onto another player's character you have given control of that card to that player."}]}