{"url":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/","title":"Powerful cards destroying long-term game balance?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=538552","commentId":538552,"userName":"ppsantos","timestamp":1317994585,"content":"I'm wary of powerful cards getting designed. It might not be good for the long term health and playability of the game. Imagine after two years, given all the player cards available, the choices, synergies, etc available to players. Even with just mediocre conditional cards being released, it opens up more choices for players. More player choice is better/stronger than a limited cardpool. The end result is player decks will gradually increase in power, thereby throwing game balance out. Does FFG counteract that with increasing the game difficulty, with absurd threat levels, etc? That would just be power inflation then.\n\n \n\nI don't want to see the state of the game, which after two years of expansions, the player cards available have become so powerful that Passage through Mirkwood, let alone Escape from Dol Goldur, becomes a walk in the park. I want them to be a little easier and have a chance of victory, but I don't want the game ruined because powerful cards gradually came out and ruined game balance.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=538558","commentId":538558,"userName":"Dam the Man","timestamp":1317995268,"content":"Ehh, Passage Through Mirkwood is already a walk in the park, err, woods. I haven't lost to it in any 2-player/deck games. Solo yes, some decks just can't take location-locking, but 2-player? No way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=538565","commentId":538565,"userName":"TheLightdarker","timestamp":1317996949,"content":"I came here expecting to read a post about Northern Tracker in The Hills of Emyn Muil :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nIn any case, as players eventually have more and more cards and powerful combinations thereof available to them for deckbuilding, unless scenarios are indeed to become a complete walk in the park, like you put it, FFG naturally has to make quests more difficult to compensate somehow, whether that is purely by inflating numbers on encounter cards, designing more brutal encounter cards, and/or implementing novel, clever encounter card synergies.\n\nDo a bit of Googling on \"power creep\" for card games like Magic the Gathering and you will come across quite a few interesting reads on this topic. It seems like it is pretty much unavoidable that if FFG wants to continue producing new, exciting content for this game indefinitely that eventually, the old will essentially be replaced with the new (with some likely exceptions, of course), and I cannot foresee the original scenarios presenting the same level of difficulty they did with only the original Core set cards.  In a lot of ways, we can already see this happening; for example, the combination of the new cards Dunedain Warning, Gildor Inglorion, and A Burning Brand, when combined with the classic card Self Preservation, gives players a brand new option for dealing with the Journey Down the Anduin Hill Troll (or really, any powerful attacker) that was never available to them before, should they be unsuccessful in trying to draw a timely Forest Snare.\n\nIt may be a long time before we see individual cards being replaced (i.e., Guard of the Citadel being replaced by a 1 Will, 1 Attack, 1 Defense, 2 Hit Point Leadership ally that also only costs 2), but we'll have to see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=538591","commentId":538591,"userName":"mr.thomasschmidt","timestamp":1317999667,"content":"I think this is a good point but not neccesary something to fear. I admit it is a challange to make new more powerful cards without raising the quest difficulty which again will make it more difficult again in solo play. BUT I think it mostly depends on what your take is on the game; what's your expectations.\n\nAn example that just hit me is  this. Take any adventure/RPG cumputer game where you advance in level as you go on in the game. This also leads to stronger and more difficult enemies to beat and then when you finnally beat the final boss/creature/thing you have beaten the game/history/quest. Then 1 year later, or 2 or 10 depending how fond you are for the story in that game you wanna play it through again. Since many modern games let you play it through and then save and start the game over again but with all your curent earned streangt, weapons, powers and so on, you might have 2 choices. 1. Do that and walk through the game without any challenge or 2. start a new game all fresh and get a good experience once more even though you might know how it ends.\n\nWhat is my point with this? Well, 2 years from now when we all have superoverpowertopdelux cards in our decks it won't be any challenge to beat maybe even Osgiliath or Anduin BUT then you have a choice. 1. Go through the old quests with this power deck OR 2. go back, pick up the cards from the core set and maybe some from the AP that belongs to this quest set, and play it through again without these new almighty cards. This will keep the ballance.\n\nI can understand that some might not agree to this because they want a deck they can beat everything with and make it their master deck. Well, these people might find it boring in the long run or fear the future of the game even though this doesn't rule out having some \"weaker\" decks to play and have fun with. Many players uses one kind of cards in their turnaments decks but some other cards when playing casual just because they like whatever game they play. So you could just make a tournament-mean-buisness-I'm-going-to win-every-quest-you-throw-at-me-FFG deck AND a casual-take-it-a-little-more-easy-and-have-fun deck to just enjoy the game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWhat I wanna say with this \"novel\" of an answer is just that there's no need to fear the future of the game balance, 'cause it's not neccesary going to be a problem :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=538866","commentId":538866,"userName":"rfh0","timestamp":1318064193,"content":"I would personally like to see more weapon options. Currently the dwarves and the gondor characters have weapons. They need to add Rohan spears, elvish bows and hobbit daggers. I have trouble beating both of the level 7 quest without stronger characters. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=538907","commentId":538907,"userName":"guciomir","timestamp":1318070479,"content":"There is a chance (small but it exists) , that they will try to create different quests and every one of them will \"check\" your deck against other areas. So in the end, some quests will expose weakness in your deck and will make you change some cards. When you change, the previous quests will become a litttle bit harder.\n\nA good example is Rhosgobel. My deck did not contain healing and did not contain ranged characters. I now play with Legolas and not with Gimli , so the damage dealing potential is now smaller. And also, I am more exposed to early game enemy attacks (you can let first attack go undefended, Gimli will get angry and defeat the opponent, with Legolas this is much limited). Additionally, I am using Radagast now as the only way to heal the eagle. Radagast is not great in other quests, so adding him made my deck slightly weaker in other adventures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=539014","commentId":539014,"userName":"Vyron2","timestamp":1318085181,"content":" yes, that is, what I think, too! I think the power creep in THIS particular game will be very slow for several reasons:\n\n1. we only get TWO cards for a given sphere per pack!!! (not unlike MtG, where an expansion comes out every three months with 200 new cards... btw I'm doing a 9-men draft with Innistrad tomorrow, yeeehah! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png])\n\n \n\n2. different quests can expose different weaknesses - and given that we can only use 50 cards in a deck means that you possibly can't prepare for all strategies... sure, SOMETIME in the future, maybe... \n\n \n\n3. the first quests will become maybe a bit easier, but not a lot! passage mirkw has already been easy, it has become a bit easier with cards as dunedain mark, warning, quest, but you still CAN fail esp in solo mode... \n\n \n\n4. ffg will look carefully not to boost the heroes too soon! while we are getting dunedain XY now, I think in future we will have more \"race\"/culture specific boni... e.g. only dwarf +1 (as in axe/mail) so we will have plenty of time, until all races get their buffers\n\n \n\n5. there is only so much buffers you can get - as long as there is the 50 threat cap, 3 heroes cap, 1 resource per turn/per hero and 1 card (normally) - there is only so much a deck can do - compared to an encounter deck, which can get strong quicker than the good guys...\n\n \n\nbut eventually - with all the synergies and combos that will develop - there will be a power creep... as in any game! when you run out of variables that you can influence, than you have to increase stats! maybe there will be new rules and thus new \"problems\" we have to address... we'll see... I think the breaking point will be Khazad-Dûm - using all these cards and then questing the old core sets, we'll get a better feeling, how much easier a quest got...\n\nI still think that dol guldur and catc/journey to rhosgobel (will be hard in solo-mode anyway...)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=539112","commentId":539112,"userName":"gone questing","timestamp":1318110002,"content":"\nI like that we haven't had any new cards that reduce threat.\n\nOf all the new cards that ready characters, I feel they are far too weak because Unexpected Courage is far too strong!\nIt seems ludicrous to play Using Nor am I a Stranger and/or Eomund without already using three Unexpected Courage. With three Unexpected Courage, you can get 1-2 out some what frequently as it is.\n\nWe've seen it with Decipher's Star Trek and Lord of the Rings... when one card in an early set does something SO good, design has their hands tied behind their back for each new card they want to make that readies characters :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n(ie. either they're too weak compared to, and don't get played, or they have to be too strong compared to other cards in the game, to see play ahead/with Unexpected Courage.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=539134","commentId":539134,"userName":"Dwnhmcntryboy","timestamp":1318114953,"content":" Power creep is something we all \"fear\". If you want, you can play those deck. but there is another aspect to this game I love. Themes... They always pose a challenge as there are certain restrictions you are placing upon yourself above and beyond what the game already does. so Keep faith in the fact that you can always find a way to handicap yourself and have fun doing it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543827","commentId":543827,"userName":"Hannibal_pjv","timestamp":1318953137,"content":"The one thing that protects this game from power greep is that you don't sell new expansions via mega cards. New encounter decks are IMHO the main reason for getting new expansion! But with every new card, the posibility of making \"better\" player deck increases, so eventuall we will be there, but there is no so big rush to do it like in normal ccg format where new power cards are \"the only way of selling more cards...\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543838","commentId":543838,"userName":"Untergeher","timestamp":1318954595,"content":"There are some interesting articles on this topic around. Somewhere I read that \"power creep\" (if done properly) is necessary, because it's the nature of us players to want more powerful cards to improve their decks... If done properly (and by properly I mean slowly and without breaking the game) it can be a good thing. And I'm not afraid of it, because it's a coop game after all. Which means: I can choose what cards to use and don't have to worry too much about any competition.\n\nOf course it's tempting to include only the most powerful cards, but sometimes it's more rewarding to play with the cards you LIKE. I recently dumped my three Gandalfs and of course my deck would be \"better\" with them, but I enjoyed trying something different! Someone mentioned this kind of restriction before and I think it's one way to get the most out of this game.\n\nI personally like to go back to play some of the older quests with the new heroes and player cards and of course it's sometimes easier, because there are more options to deal with certain situations. But does it stand in the way of having fun? Not at all.\n\nAlso: When building a deck for multiplayer I'm not only concerned about my deck and my combos and my best cards, I'm also trying to complement the other player's deck in the best way possible.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543856","commentId":543856,"userName":"Vyron2","timestamp":1318957171,"content":"Untergeher said:\n\nAlso: When building a deck for multiplayer I'm not only concerned about my deck and my combos and my best cards, I'm also trying to complement the other player's deck in the best way possible.\n\n \n\n\n\n \n\nyou sir understand the very nature of this game... compimenting each other... not only building uber-solo decks... the sum is greater than its parts! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543866","commentId":543866,"userName":"booored","timestamp":1318958032,"content":"I think that you need to consider that this game is slightly different to what you expect in a card game. I mean no one complains that in a computer RPG when your level 100 you do not have a hard time beating the hell out of level 1 rats. I think asking them to make each new player card not increase teh power of the decks so that Journey Down the Audin is always going to be a challenge is unrealistic. I see no problem in the power level rising and more and more interesting quests as the game grows. You can always not use the cards form new expansions to play older scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543880","commentId":543880,"userName":"Style75","timestamp":1318959788,"content":"booored said:\n\nI think that you need to consider that this game is slightly different to what you expect in a card game. I mean no one complains that in a computer RPG when your level 100 you do not have a hard time beating the hell out of level 1 rats. I think asking them to make each new player card not increase teh power of the decks so that Journey Down the Audin is always going to be a challenge is unrealistic. I see no problem in the power level rising and more and more interesting quests as the game grows. You can always not use the cards form new expansions to play older scenarios.\n\n\n\n \n\nI agree 100%. As long as the power creep is incremental it will be acceptable to me. I can always play a sub-optimal deck if I want more challenge. Or just deal out more shadow cards or encounter cards. This game has inherent ways to scale difficulty that make it solid gold for replay value."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543915","commentId":543915,"userName":"DurinIII","timestamp":1318963762,"content":" Exactly guys! You aren't forced to play any particular cards. Play what you want...theme decks and have fun. The game is only going to get cooler and more fun in my opinion. Plus, I am a collector of LOTR stuff (especially original artwork of any kind) and this game provides that aplenty! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543921","commentId":543921,"userName":"Bohemond2","timestamp":1318963937,"content":"We certainly have more variety in cards as we get more decks.  And, that variety makes our decks better.  But do we actually have power creep?  The strongest cards in the game are all things that are in the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=543960","commentId":543960,"userName":"Glaurung","timestamp":1318975518,"content":"Bohemond said:\n\nWe certainly have more variety in cards as we get more decks.  And, that variety makes our decks better.  But do we actually have power creep?  The strongest cards in the game are all things that are in the core set.\n\n\n\nYes Bohemond you right. Most powerful cards in the core set. Heroes from AP is not as good as heroes from core set as well. First Hero in my opinion who is fit core set level is Boromir. But AP give us also some cards which is make players decks much more stronger then before. Its ok if the encounter deck also go stronger. But the quests level is still on pretty low difficult  level. From the beginning i scare about this. In June i has talking about this on this forum bu most of the players was not agree with me. But now i see more and more people start to realize.\n\nWhat is the main part of the game??? In my opinion is quest and encounter deck. FFG should to make them more interesting and more challenge.\n\nBut i heard some rumors about Khazad-Dum difficult 3,5,7. Hey command it should be 5,7,9. We already now how to play now how to build up the deck, learn some strategy so give us some cool quest not difficult 3?????  Really this FFG have some many problems. But what i like now people start to talk about it more and more. So this give me hope everything will be ok. I love this game anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544030","commentId":544030,"userName":"booored","timestamp":1318991668,"content":"Bohemond said:\n\nWe certainly have more variety in cards as we get more decks.  And, that variety makes our decks better.  But do we actually have power creep?  The strongest cards in the game are all things that are in the core set.\n\n\n\n \n\nI know that in CoC the core set still has some cards in it that are in most of the top tier decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544071","commentId":544071,"userName":"mr.thomasschmidt","timestamp":1318998106,"content":"I heard the rumors as well that there will be a level 3, 5 and 7 quest. But dissagreeing with glaurung I can only say \"YAY\" Nice to get a level 3 quest. I will not go as far as to \"command\" and bitching about the level 5 and 7 quest even if I could say:\n\n\"WHAT!!!! Level 5 and 7?!?!?? COME ON GUYS. GIVE US A BREAK. Some of us is still having trouble with the Anduin and then you make a new level 7 quest again????  WHATS THE MATTER WITH YOU????Please just stay with the level 3,4 and 5. PLEASE!!!!!! You are making this game WAY TOO difficult!!!!!!!\" and so on. But I don't. Because then somebody having it easy with the game would maybe get irritated and fear that I'd ruin the future of the game for him.  \n\nYousee, I respect everyones opinion here and the truth is that some need the level 3 quests, some level 5 and a few more experienced and super players (and player that have missunderstood the rules and therefor the game is too easy) need the level 7,8,9 quest.\n\nSo when it's a level 3 quest, GREAT! When it's a 5 also GREAT and even if it'll be a level 12 someday which I won't be able to beat in the near future ALSO GREAT! Some cards are only great for multiplayer games, GREAT, some best in solo eaqually GREAT.\n\nAnd about the \"what's the game about\" thing, it varies from person to person; for some it's beating the qusts no matter what, some like the deck building the most, some wants a huge challenge, others like to just play casually. MY opinon is that it's all about the story of the game. The reason I like it is because it's Lord of the Rings. I love the books and the movies. This is a great way to get more story in my favorite universe. So I couldnt care less if ALL quests from now on will only be level 1 OR 12. As long as the story is there and all the quests differ in what to do (just like they have up till now) I will be a happy guy. Sorry if people are dissapointed or unhappy with the game; you could make it great if you just wanted to and give the tournament-stress some rest.\n\nHave fun everyone :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544073","commentId":544073,"userName":"Untergeher","timestamp":1318998145,"content":"@Glaurung: I think we all heard your desire for more difficult, more challenging quests, but think of all the other players who enjoy this game maybe not for its difficulty but for its other parts, like flavo(u)r or theme or the cooperative nature of it. I like a challenge as much as anybody else, but sometimes I want to relax and enjoy the experience without constantly worrying about dying heroes or near impossible threat management.\n\nSo I want both: I want more quests like Escape form Dol Guldur whenever I'm ready for a tough one and I want easier quests where the encounter decks are more forgiving and therefore making it possible to try something new, something different. I don't want to build an uber-deck to rule them all and I don't want to tinker with it every time I want to play another quest just to have a chance at it... I want to have fun experimenting with new player cards, with new heroes etc.\n\nWe also can't assume that the numbers FFG puts on the quests are anywhere close to the perceived difficulty of each and every player or playgroup. Maybe that difficulty 3 quest has some new mechanics that are going to counter the strategy of your best deck? We just don't know yet.\n\nAnd there are a lot of opitons if you want to have a more difficult and challenging experience with the game: Toss out all your best cards and heroes. Make up restrictions like using only one copy of each card. Or play nightmare mode. Or something like this: Play one quest after the other, but you're not allowed to use cards in your deck that you used or played during the last one. I'm sure you can find a way. And you wouldn't have to worry too much about the difficulty of upcoming releases ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544074","commentId":544074,"userName":"Glaurung","timestamp":1318999117,"content":"mr.thomasschmidt said:\n\nI heard the rumors as well that there will be a level 3, 5 and 7 quest. But dissagreeing with glaurung I can only say \"YAY\" Nice to get a level 3 quest. I will not go as far as to \"command\" and bitching about the level 5 and 7 quest even if I could say:\n\n\"WHAT!!!! Level 5 and 7?!?!?? COME ON GUYS. GIVE US A BREAK. Some of us is still having trouble with the Anduin and then you make a new level 7 quest again????  WHATS THE MATTER WITH YOU????Please just stay with the level 3,4 and 5. PLEASE!!!!!! You are making this game WAY TOO difficult!!!!!!!\" and so on. But I don't. Because then somebody having it easy with the game would maybe get irritated and fear that I'd ruin the future of the game for him.  \n\nYousee, I respect everyones opinion here and the truth is that some need the level 3 quests, some level 5 and a few more experienced and super players (and player that have missunderstood the rules and therefor the game is too easy) need the level 7,8,9 quest.\n\nSo when it's a level 3 quest, GREAT! When it's a 5 also GREAT and even if it'll be a level 12 someday which I won't be able to beat in the near future ALSO GREAT! Some cards are only great for multiplayer games, GREAT, some best in solo eaqually GREAT.\n\nAnd about the \"what's the game about\" thing, it varies from person to person; for some it's beating the qusts no matter what, some like the deck building the most, some wants a huge challenge, others like to just play casually. MY opinon is that it's all about the story of the game. The reason I like it is because it's Lord of the Rings. I love the books and the movies. This is a great way to get more story in my favorite universe. So I couldnt care less if ALL quests from now on will only be level 1 OR 12. As long as the story is there and all the quests differ in what to do (just like they have up till now) I will be a happy guy. Sorry if people are dissapointed or unhappy with the game; you could make it great if you just wanted to and give the tournament-stress some rest.\n\nHave fun everyone :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nI understand you point. Yes right players have different level of experience and different requests. Some players want more hard and some players want to have some easy quests. Me and you very good example in this case.\n\nMy pray is : please more hard i need  it, and your pray is : please more easy i need it.\n\nSo the best way is make the quest with opportunity to make themself more hard or more easy by some special rules or some special game mechanic.\n\nthe same quest can be very hard and very easy, like in video game where you can add or remove difficult level in game options.\n\nThe best what FFG can do is develop some kinds of rules for this case. Cose one day when you start to play better and your skill go up, you start ask the same thing from the game.And your pray will change.\n\nWith all my respect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544075","commentId":544075,"userName":"Glaurung","timestamp":1318999279,"content":"Untergeher said:\n\n@Glaurung: I think we all heard your desire for more difficult, more challenging quests, but think of all the other players who enjoy this game maybe not for its difficulty but for its other parts, like flavo(u)r or theme or the cooperative nature of it. I like a challenge as much as anybody else, but sometimes I want to relax and enjoy the experience without constantly worrying about dying heroes or near impossible threat management.\n\nSo I want both: I want more quests like Escape form Dol Guldur whenever I'm ready for a tough one and I want easier quests where the encounter decks are more forgiving and therefore making it possible to try something new, something different. I don't want to build an uber-deck to rule them all and I don't want to tinker with it every time I want to play another quest just to have a chance at it... I want to have fun experimenting with new player cards, with new heroes etc.\n\nWe also can't assume that the numbers FFG puts on the quests are anywhere close to the perceived difficulty of each and every player or playgroup. Maybe that difficulty 3 quest has some new mechanics that are going to counter the strategy of your best deck? We just don't know yet.\n\nAnd there are a lot of opitons if you want to have a more difficult and challenging experience with the game: Toss out all your best cards and heroes. Make up restrictions like using only one copy of each card. Or play nightmare mode. Or something like this: Play one quest after the other, but you're not allowed to use cards in your deck that you used or played during the last one. I'm sure you can find a way. And you wouldn't have to worry too much about the difficulty of upcoming releases ;-)\n\n\n\nAbout nighmare is very good idea. We start this mode  from this week and i will put my report about it. Maybe that what i need."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544087","commentId":544087,"userName":"DurinIII","timestamp":1319004464,"content":"Hey, not a bad idea Glaurung. That would be cool if they could somehow make a quest function as both easy or hard.  I am not putting forth how they would do that. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544117","commentId":544117,"userName":"letsdance","timestamp":1319010814,"content":"DurinIII said:\n\nHey, not a bad idea Glaurung. That would be cool if they could somehow make a quest function as both easy or hard.  I am not putting forth how they would do that. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\nfor example, when playing down the anduin, put 2 trolls in the staging area instead of 1 :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\ni wish they would release MORE quests. as people have shown, the cards available would allow for many quests to be designed, but they stick to one quest per AP. this would also satisfy people better who want easier/harder quests. they could easily make 3 quests per AP with different difficulty levels. as it is, the game has much potential, but only a fraction of it is used."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544120","commentId":544120,"userName":"Svenn","timestamp":1319011294,"content":"letsdance said:\n\nDurinIII said:\n\nHey, not a bad idea Glaurung. That would be cool if they could somehow make a quest function as both easy or hard.  I am not putting forth how they would do that. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\n \n\nfor example, when playing down the anduin, put 2 trolls in the staging area instead of 1 :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\ni wish they would release MORE quests. as people have shown, the cards available would allow for many quests to be designed, but they stick to one quest per AP. this would also satisfy people better who want easier/harder quests. they could easily make 3 quests per AP with different difficulty levels. as it is, the game has much potential, but only a fraction of it is used.\n\n\n\nThe more quest cards they add, the less player cards we get. Personally, I want to see more player cards as the deckbuilding is one of the most fun parts for me, and currently the pools for each sphere is still fairly small.\n\nWhat I would love to see is 2 full expansions, one consisting of 200ish player cards and one consisting of 200 encounter/quest cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544122","commentId":544122,"userName":"booored","timestamp":1319011975,"content":"just give it time.. the cards will come but they will space them out along adventure packs.. I doubt we will see a new major expantion for a while.... still a few years form now the pool will be huge.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544123","commentId":544123,"userName":"letsdance","timestamp":1319012134,"content":"a quest has 1-4 cards. 2 additional quests would mean like 5 cards less in the encounter deck. no one would miss that. it does not reduce the player cards at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544240","commentId":544240,"userName":"ppsantos","timestamp":1319023890,"content":"mr.thomasschmidt said:\n\nI heard the rumors as well that there will be a level 3, 5 and 7 quest. But dissagreeing with glaurung I can only say \"YAY\" Nice to get a level 3 quest. I will not go as far as to \"command\" and bitching about the level 5 and 7 quest even if I could say:\n\n\"WHAT!!!! Level 5 and 7?!?!?? COME ON GUYS. GIVE US A BREAK. Some of us is still having trouble with the Anduin and then you make a new level 7 quest again????  WHATS THE MATTER WITH YOU????Please just stay with the level 3,4 and 5. PLEASE!!!!!! You are making this game WAY TOO difficult!!!!!!!\" and so on. But I don't. Because then somebody having it easy with the game would maybe get irritated and fear that I'd ruin the future of the game for him.  \n\nSo when it's a level 3 quest, GREAT! When it's a 5 also GREAT and even if it'll be a level 12 someday which I won't be able to beat in the near future ALSO GREAT! Some cards are only great for multiplayer games, GREAT, some best in solo eaqually GREAT.\n\n\n\nI was hoping the 3 quests would have DLs easy (2), medium (4 or 5) and hard (7).  For a major expansion like Khazad, I think it would be nice to have a quest that's slightly harder than Core Set's introductory scenario Passage Through Mirkwood.  We have the APs with DLs 4-7, but only 1quest (PTM) on the easy level.  Not all players want killer scenarios all the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544249","commentId":544249,"userName":"Skeith27","timestamp":1319024373,"content":"I agree with the idea that as long as they provide us with a variety of challenges in both difficulty and by introducing new tricks/mechanics,  we will always have a way to enjoy the game. After all, figuring out what cards to use in a quest is half the fun for me. And actually, having more cards in my library can eventually become an obstacle, hiding the one or two best cards for the job from my memory.\n\nWhile I believe it is inevitable that the power creep will likely come over time, I think we have a lot of options for dealing with it. For starters, I like the idea some people have of playing with singleton decks - ones containing only 1 copy of each card. This is exactly the kind of thinking fans of MTG used to create a really popular variation of the game.\n\nBut perhaps a more exciting prospect, I think, is to follow through with the \"Nightmare\" mode and take on a series of quests in succession without changing up your deck (or healing damage, I believe). Like people stated earlier, many missions are good at exploiting the weaknesses of even your best deck. Force your party to take on 3 missions of the Mirkwood cycle in a row will definitely force you to face your weakness and pray that your friends can compensate. It also provides a great overall thematic experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544253","commentId":544253,"userName":"Vyron2","timestamp":1319024931,"content":" well... still... even with the power creep - I find it hard to imagine that we are ever going to have an easy time with Dol Guldur, or Journey to Rhosghobel or Massing at Osgiliath... speaking solo strictly...\n\nthe older quests will automatically get easier!!! as we have more possibilities, but the quests stay the same, it will get easier... that's the problem with co-op, or ffg introduces a system where we can effectively try to build or own encounter deck... and challenge ourselves... of course, you can do that already... put in 4 trolls, 2 nazguls, 2 hill trolls, hummerhorns, necromancers reach, exhaustion, rockslide and all other nice cards we love so much... and you have a challenge :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] ok, storywise strange, but...\n\nyou'll just never have as great a challenge as playing against a human being - ffg may prove me wrong though... waiting for the Deluxe AP... so far, I am very content with the content of this game... lots of combos to try... I just wish there was a way to magnify the intelligence of the evil side... this randomness of the encounter deck is VERY exciting when dealing shadow cards... but else... esp in Rhosghobel, it's just annoying :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544258","commentId":544258,"userName":"Glaurung","timestamp":1319025532,"content":"ppsantos said:\n\nmr.thomasschmidt said:\n\n \n\nI heard the rumors as well that there will be a level 3, 5 and 7 quest. But dissagreeing with glaurung I can only say \"YAY\" Nice to get a level 3 quest. I will not go as far as to \"command\" and bitching about the level 5 and 7 quest even if I could say:\n\n\"WHAT!!!! Level 5 and 7?!?!?? COME ON GUYS. GIVE US A BREAK. Some of us is still having trouble with the Anduin and then you make a new level 7 quest again????  WHATS THE MATTER WITH YOU????Please just stay with the level 3,4 and 5. PLEASE!!!!!! You are making this game WAY TOO difficult!!!!!!!\" and so on. But I don't. Because then somebody having it easy with the game would maybe get irritated and fear that I'd ruin the future of the game for him.  \n\nSo when it's a level 3 quest, GREAT! When it's a 5 also GREAT and even if it'll be a level 12 someday which I won't be able to beat in the near future ALSO GREAT! Some cards are only great for multiplayer games, GREAT, some best in solo eaqually GREAT.\n\n \n\n \n\nI was hoping the 3 quests would have DLs easy (2), medium (4 or 5) and hard (7).  For a major expansion like Khazad, I think it would be nice to have a quest that's slightly harder than Core Set's introductory scenario Passage Through Mirkwood.  We have the APs with DLs 4-7, but only 1quest (PTM) on the easy level.  Not all players want killer scenarios all the time.\n\n\n\nthat the different between players how they understand the diffiucult of the quest. For me for example 6 and 7 For what we have for now (Carrock, Rhosgobel, Dol-Guldor) is ok. It is not Difficult al all in my opinion. Is Normal. Osgiliath is hard. So difficult 3 and 4 in opinion is just waste of time and money. Is same like With proff tournaments Magic deck play against stater preck. decks.We know already who will win (even if the proff deck will make a lot of mistake).\n\nStill im sure the best solution is opportunity to change the difficult of any quest by special rules or mechanic.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544259","commentId":544259,"userName":"Skeith27","timestamp":1319025654,"content":"Aye, that's pretty much what I was getting at."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544306","commentId":544306,"userName":"mr.thomasschmidt","timestamp":1319030568,"content":" I second The 2 x 200ish Card expansions. Plus 1 with 200ish Quist cards :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nSeriously though, FFG could just make a \"cycle\" of AP containing only quests and mayby releasing one every 2nd/3rd month. They could call them Quest Packs :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] just 40 cards would be enough. That could be at least 10 quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544309","commentId":544309,"userName":"Untergeher","timestamp":1319030836,"content":"To all who think modifying the encounter decks is the way to go to provide a satisfying challenge: Nobody forbids you to start doing this right now. Why not put the Nazgul of Dol Guldur in one of the other quests, just for the extra difficulty? Or some of the trolls? I really start to get tired of people begging for higher difficulty. Because all in all the game has turned out mighty fine the way it is. But maybe I'm just too \"casual\" to understand this problem. Or maybe we have a very different approach towards this kind of cooperative game.\n\nAs someone said before: Give the game some time to grow, to develop. We're just at the very beginning. And anything's possible in the future and we'll probably see some power creep, no matter how carefully they try to balance the new cards. But my only concern is: Will it still be fun to play?\n\nJust one more thing regarding difficulty: It's just numbers. I look at them and they mean nothing, because it depends on so many other things... I thought Conflict at the Carrock (7) was easier than Dol Guldur (also a difficulty 7) and also easier than A Journey to Rhosgobel (which is a 6 I think). So what does that say? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544324","commentId":544324,"userName":"Glaurung","timestamp":1319032112,"content":"Untergeher said:\n\nTo all who think modifying the encounter decks is the way to go to provide a satisfying challenge: Nobody forbids you to start doing this right now. Why not put the Nazgul of Dol Guldur in one of the other quests, just for the extra difficulty? Or some of the trolls? I really start to get tired of people begging for higher difficulty. Because all in all the game has turned out mighty fine the way it is. But maybe I'm just too \"casual\" to understand this problem. Or maybe we have a very different approach towards this kind of cooperative game.\n\nAs someone said before: Give the game some time to grow, to develop. We're just at the very beginning. And anything's possible in the future and we'll probably see some power creep, no matter how carefully they try to balance the new cards. But my only concern is: Will it still be fun to play?\n\nJust one more thing regarding difficulty: It's just numbers. I look at them and they mean nothing, because it depends on so many other things... I thought Conflict at the Carrock (7) was easier than Dol Guldur (also a difficulty 7) and also easier than A Journey to Rhosgobel (which is a 6 I think). So what does that say? \n\n\n\nYou know i didn really understand thi system too. 7 or 6 or 4 sometimes there is no any sense.\n\nAnd one more thing. Unbalanced really unbalanced player cards and heroes. for example. Take away Beravur and Gimly. The game will be much more hard.\n\nTake away northern tracker and brand. Ups and game is not easy at all. So sometimes you need to just dont make some to powerful card too.FFG do many mistace from beginning. So will see what happen next.\n\nYes you right we can make some house rules but i want balanced game from beginning and for that i pay my money!!!! this is not my job!!! this is job of FFG.\n\nStill i just want things better. And i really like this game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544336","commentId":544336,"userName":"guciomir","timestamp":1319033246,"content":"Numbers do not mean anything. Anduin (4) is harder solo compared to Carrock (7). So don't say that 3,5,7 are easy quests. This 3 can be more harder than 7 if it nails a weakness in your deck.\n\nIt's good you beat most of the decks, I also do. (with the exception of dol guldur and rhosobel). But I don't write so much about \"need more difficult quests\". What I want are more diverse quests, so every adventure feels unique. Rhosgobel is perfect example , difficulty just 6 but hard as hell for a deck with no healing apart from radagast.\n\nBtw, I feel that tournaments are coming soon and they may change your strategy a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544340","commentId":544340,"userName":"Dam the Man","timestamp":1319033770,"content":"Untergeher said:\n\nJust one more thing regarding difficulty: It's just numbers. I look at them and they mean nothing, because it depends on so many other things... I thought Conflict at the Carrock (7) was easier than Dol Guldur (also a difficulty 7) and also easier than A Journey to Rhosgobel (which is a 6 I think). So what does that say? \n\nHell, I would almost put Carrock on level with Passage Through Mirkwood myself, 2-3 tops. Anduin and HFG both felt and were a lot, lot harder, constant struggles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544344","commentId":544344,"userName":"Untergeher","timestamp":1319034233,"content":"Dam said:\n\nUntergeher said:\n\n \n\nJust one more thing regarding difficulty: It's just numbers. I look at them and they mean nothing, because it depends on so many other things... I thought Conflict at the Carrock (7) was easier than Dol Guldur (also a difficulty 7) and also easier than A Journey to Rhosgobel (which is a 6 I think). So what does that say? \n\n \n\nHell, I would almost put Carrock on level with Passage Through Mirkwood myself, 2-3 tops. Anduin and HFG both felt and were a lot, lot harder, constant struggles.\n\n\n\nAnduin was a big challenge for me and my partner before we started serious deckbuilding. This quest can go wrong pretty fast and can be very unforgiving! And HfG is can be a nightmare! So unpredictable. And I hate the Hunters and the Old Wives' Tales! The cards coming from the encounter deck can have disastrous effects...\n\nSo I totally understand where you're coming from!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544392","commentId":544392,"userName":"Mattr0polis","timestamp":1319039600,"content":"Power creep isn't something we need to worry about for a long time imo as this game is pretty awesome right now. But there are plenty of ways I think they'll be able to reign the game back in if they ever need to.\n\n1. I think I read somewhere that they are prepared to ban a card if errata or clarification can't stop something from being completely abusive.\n\n2. They could always implement set rotation once the card pool is large enough. Something like rotate out the core set in favor of a new one a few years down the line. Or, only cards from the last four adventure pack cycles can be used for 'tournament legal' decks, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544427","commentId":544427,"userName":"radiskull","timestamp":1319043238,"content":" I think they are pretty much anti-set rotation in the LCG format.  It's possible, certainly, but I doubt we'll ever see that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544539","commentId":544539,"userName":"Glaurung","timestamp":1319063929,"content":"Mattr0polis said:\n\nPower creep isn't something we need to worry about for a long time imo as this game is pretty awesome right now. But there are plenty of ways I think they'll be able to reign the game back in if they ever need to.\n\n1. I think I read somewhere that they are prepared to ban a card if errata or clarification can't stop something from being completely abusive.\n\n2. They could always implement set rotation once the card pool is large enough. Something like rotate out the core set in favor of a new one a few years down the line. Or, only cards from the last four adventure pack cycles can be used for 'tournament legal' decks, etc.\n\n\n\n1 In my opinion we need Errata for Beravur action : draw 2 cards limit 1 per turn. Tracker choose 1 location and 1 token on location NOT EVERY LOCATION is to powerful.\n\nBan B Brand this card really broken!!!!\n\n2 About card rotation. I also think in LCG format you dont need that. I have enough of this in Magic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544541","commentId":544541,"userName":"Glaurung","timestamp":1319064335,"content":"guciomir said:\n\nNumbers do not mean anything. Anduin (4) is harder solo compared to Carrock (7). So don't say that 3,5,7 are easy quests. This 3 can be more harder than 7 if it nails a weakness in your deck.\n\nIt's good you beat most of the decks, I also do. (with the exception of dol guldur and rhosobel). But I don't write so much about \"need more difficult quests\". What I want are more diverse quests, so every adventure feels unique. Rhosgobel is perfect example , difficulty just 6 but hard as hell for a deck with no healing apart from radagast.\n\nBtw, I feel that tournaments are coming soon and they may change your strategy a lot.\n\n\n\nYes i like it too. I mean idea to make quests really different from each other. Rhosgobel is good example. + FFG really dont use the quest cards themself.\n\nCarrock have only 2 and Rhosgobel also last quest card is nothing. +they use only 1 side of the quest card (use both side only on the first card for setup).\n\nTournaments system i wait like a bird wait for spring.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544554","commentId":544554,"userName":"radiskull","timestamp":1319066726,"content":"Glaurung said:\n\nMattr0polis said:\n\n \n\nPower creep isn't something we need to worry about for a long time imo as this game is pretty awesome right now. But there are plenty of ways I think they'll be able to reign the game back in if they ever need to.\n\n1. I think I read somewhere that they are prepared to ban a card if errata or clarification can't stop something from being completely abusive.\n\n2. They could always implement set rotation once the card pool is large enough. Something like rotate out the core set in favor of a new one a few years down the line. Or, only cards from the last four adventure pack cycles can be used for 'tournament legal' decks, etc.\n\n \n\n \n\n1 In my opinion we need Errata for Beravur action : draw 2 cards limit 1 per turn. Tracker choose 1 location and 1 token on location NOT EVERY LOCATION is to powerful.\n\nBan B Brand this card really broken!!!!\n\n2 About card rotation. I also think in LCG format you dont need that. I have enough of this in Magic.\n\n\n\n \n\nI disagree strongly with your suggestions regarding errata/bannings.  I believe Beravor and Burning Brand are powerful, but not broken.  Let's at least see how some organized play shakes out before we ban all the power cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544567","commentId":544567,"userName":"Glaurung","timestamp":1319068571,"content":"radiskull said:\n\nGlaurung said:\n\n \n\nMattr0polis said:\n\n \n\nPower creep isn't something we need to worry about for a long time imo as this game is pretty awesome right now. But there are plenty of ways I think they'll be able to reign the game back in if they ever need to.\n\n1. I think I read somewhere that they are prepared to ban a card if errata or clarification can't stop something from being completely abusive.\n\n2. They could always implement set rotation once the card pool is large enough. Something like rotate out the core set in favor of a new one a few years down the line. Or, only cards from the last four adventure pack cycles can be used for 'tournament legal' decks, etc.\n\n \n\n \n\n1 In my opinion we need Errata for Beravur action : draw 2 cards limit 1 per turn. Tracker choose 1 location and 1 token on location NOT EVERY LOCATION is to powerful.\n\nBan B Brand this card really broken!!!!\n\n2 About card rotation. I also think in LCG format you dont need that. I have enough of this in Magic.\n\n \n\n \n\n \n\nI disagree strongly with your suggestions regarding errata/bannings.  I believe Beravor and Burning Brand are powerful, but not broken.  Let's at least see how some organized play shakes out before we ban all the power cards.\n\n\n\nYes you can be disagree or agree up to you. But when in the middle of the game i have lot of resources and half of the deck im my hand i wonna see what encounter deck can do against me............I have a lot of cards to cancel when revealed effect + b brand on my heroes. Now i need only attacment card :in quest phase dont reveal any card from encounter deck and game start to be so interesting and fun. Beravur is to powerful. And b brand is like permanent couner spell in magic. Every spell your opponent play counter it. If this cards is not broken what is is broken for you?????\n\nCose of Beravur and B brand this even Osgiliath is a problem only for 3 first round. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544588","commentId":544588,"userName":"Vyron2","timestamp":1319072366,"content":" I don't know about you guys: certainly, FFG could make the quests extremely harder - not only by raising the stats - there are enough nasty mechanics to kill a group of travellers... but do you think the big masses would buy this game? I know, some of us want a challenge, some of us don't even abide by the rules and make themselves an easy life... \n\n \n\nthe problem is: in mtg, lotr decipher, etc you had an opponent - and you had the same cards (provided the money...) - so it was deckbuilding against deckbuilding and reacting to specific situations.... with an encounter deck, which DOES NOT change, you only have a limited range of options which you eventually find out and then you can win - but what would you rather have - scenarios, which can be done in a certain amount of time and tries, or totally unbeatable scenarios - you only have these two choices... there is no scenario which will ALWAYS be challenging...\n\nat least, let us wait until the Deluxe AP, to see in which direction this game is headed... so far, I LOVE the player cards... and some scenarios are really fun! But of course somehow I can foresee that the very nature of this game could mean its own doom, if not properly handed..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544608","commentId":544608,"userName":"Glaurung","timestamp":1319075512,"content":"Vyron said:\n\n I don't know about you guys: certainly, FFG could make the quests extremely harder - not only by raising the stats - there are enough nasty mechanics to kill a group of travellers... but do you think the big masses would buy this game? I know, some of us want a challenge, some of us don't even abide by the rules and make themselves an easy life... \n\n \n\nthe problem is: in mtg, lotr decipher, etc you had an opponent - and you had the same cards (provided the money...) - so it was deckbuilding against deckbuilding and reacting to specific situations.... with an encounter deck, which DOES NOT change, you only have a limited range of options which you eventually find out and then you can win - but what would you rather have - scenarios, which can be done in a certain amount of time and tries, or totally unbeatable scenarios - you only have these two choices... there is no scenario which will ALWAYS be challenging...\n\nat least, let us wait until the Deluxe AP, to see in which direction this game is headed... so far, I LOVE the player cards... and some scenarios are really fun! But of course somehow I can foresee that the very nature of this game could mean its own doom, if not properly handed...\n\n\n\nYes i agree when you play against quests is not same when you play against real opponent. But still quest is quite ok and interesting. Shadow card mechanic is good same like your opponents can play some spell fomr his hand and you never know he will play or not.\n\nBut most of the problem is: encounter deck is not react on your power status. He play form beginning to the end with the same power, when players power is grow with every round. And is quite easy to change.\n\nFor example : make enemies strange +1 for each attachments or ally. Or discard ally from play and you have have more then 4 allies discard 2 allies from play and so on. Encounter card can get more effect with staging. Power of effect grow with progress and so on. There is so many ideas how to do that.And i my opinion they lazy to make quest much more interesting and attractive.\n\n FFG even with the card game text make so many mistake. So i will complain until they start to be make it more proff and better.\n\nYou right when Khazad-Dum go out then we can really understand where we going. And nightmare mode. We start this weekend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544615","commentId":544615,"userName":"Dam the Man","timestamp":1319077207,"content":"Glaurung said:\n\nCose of Beravur and B brand this even Osgiliath is a problem only for 3 first round. \n\n\n\nEven with Beravor, you still need UC on her and then constant use of her ability to fish out 2x Song of Wisdom + 3x Burning Brand and need 9 resources to pay for them. Combined with UC, that's 11 resources gone (4th turn), you've played 0 allies, 0 events, Beravor probably hasn't been questing or attacking/defending, so you have enemies engaged that even with BB attack for 3-4 vs for example 2 def on Beravor. Nor does BB help against undefended attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544641","commentId":544641,"userName":"Untergeher","timestamp":1319082571,"content":"Sorry, but did I miss something? It hasn't been a year since the game came out and we haven't seen all of the adventure packs of the first cycle, but we're already talking about banning cards? Is this really happening? Seriously... come on!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544647","commentId":544647,"userName":"jhaelen","timestamp":1319083052,"content":"Untergeher said:\n\nSorry, but did I miss something? It hasn't been a year since the game came out and we haven't seen all of the adventure packs of the first cycle, but we're already talking about banning cards? Is this really happening? Seriously... come on!\n\n\n\nYep, I think you missed something: Look at who stated that opinion gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nYou can safely assume no one else shares that opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544655","commentId":544655,"userName":"Glaurung","timestamp":1319084061,"content":"Dam said:\n\nGlaurung said:\n\n \n\nCose of Beravur and B brand this even Osgiliath is a problem only for 3 first round. \n\n \n\n \n\nEven with Beravor, you still need UC on her and then constant use of her ability to fish out 2x Song of Wisdom + 3x Burning Brand and need 9 resources to pay for them. Combined with UC, that's 11 resources gone (4th turn), you've played 0 allies, 0 events, Beravor probably hasn't been questing or attacking/defending, so you have enemies engaged that even with BB attack for 3-4 vs for example 2 def on Beravor. Nor does BB help against undefended attacks.\n\n\n\nHey you dont need do only this from beginning. do it slowly step by step. But when you done in the middle of the game  you can go smoke and drink tea.\n\nI hate this feeling when game is still far from the end but you already understand you win cose you know encounter deck cannot do nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544666","commentId":544666,"userName":"Darthvegeta800","timestamp":1319085107,"content":"Glaurung said:\n\nBohemond said:\n\n \n\nWe certainly have more variety in cards as we get more decks.  And, that variety makes our decks better.  But do we actually have power creep?  The strongest cards in the game are all things that are in the core set.\n\n \n\n \n\nYes Bohemond you right. Most powerful cards in the core set. Heroes from AP is not as good as heroes from core set as well. First Hero in my opinion who is fit core set level is Boromir. But AP give us also some cards which is make players decks much more stronger then before. Its ok if the encounter deck also go stronger. But the quests level is still on pretty low difficult  level. From the beginning i scare about this. In June i has talking about this on this forum bu most of the players was not agree with me. But now i see more and more people start to realize.\n\nWhat is the main part of the game??? In my opinion is quest and encounter deck. FFG should to make them more interesting and more challenge.\n\nBut i heard some rumors about Khazad-Dum difficult 3,5,7. Hey command it should be 5,7,9. We already now how to play now how to build up the deck, learn some strategy so give us some cool quest not difficult 3?????  Really this FFG have some many problems. But what i like now people start to talk about it more and more. So this give me hope everything will be ok. I love this game anyway.\n\n\n\n \n\nI hope to see level 3's pop up frequently still. I'm a casual player anyway and I want to have the occassional easy one too. Not to mention they're quite suitable for solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544667","commentId":544667,"userName":"Darthvegeta800","timestamp":1319085180,"content":"Untergeher said:\n\nSorry, but did I miss something? It hasn't been a year since the game came out and we haven't seen all of the adventure packs of the first cycle, but we're already talking about banning cards? Is this really happening? Seriously... come on!\n\n\n\nBan cards... in a cooperative non tournament-based LCG. I'm not sure whether to laugh or cry. >_>;"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544670","commentId":544670,"userName":"Darthvegeta800","timestamp":1319085426,"content":"Vyron said:\n\n I don't know about you guys: certainly, FFG could make the quests extremely harder - not only by raising the stats - there are enough nasty mechanics to kill a group of travellers... but do you think the big masses would buy this game? I know, some of us want a challenge, some of us don't even abide by the rules and make themselves an easy life... \n\n \n\nthe problem is: in mtg, lotr decipher, etc you had an opponent - and you had the same cards (provided the money...) - so it was deckbuilding against deckbuilding and reacting to specific situations.... with an encounter deck, which DOES NOT change, you only have a limited range of options which you eventually find out and then you can win - but what would you rather have - scenarios, which can be done in a certain amount of time and tries, or totally unbeatable scenarios - you only have these two choices... there is no scenario which will ALWAYS be challenging...\n\nat least, let us wait until the Deluxe AP, to see in which direction this game is headed... so far, I LOVE the player cards... and some scenarios are really fun! But of course somehow I can foresee that the very nature of this game could mean its own doom, if not properly handed...\n\n\n\n \n\nIndeed. Seriously do you think most people at the store play the game beyond casually? We bring it out once in a while, give it a few goes. There has to be balance. Very easy, easy, normal, hard and very hard ones in equal measure. But a lot of people on this forum are diehard players and hence only look through the glasses of hardcore competitive play. That is a stark contrast with a lot of people who like me picked it up for it's flavor, it's story-driven edge and the fact it avoided the supercompetitive cutthroat edge a lot of cardgames have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544676","commentId":544676,"userName":"Glaurung","timestamp":1319086480,"content":"Darthvegeta800 said:\n\nUntergeher said:\n\n \n\nSorry, but did I miss something? It hasn't been a year since the game came out and we haven't seen all of the adventure packs of the first cycle, but we're already talking about banning cards? Is this really happening? Seriously... come on!\n\n \n\n \n\nBan cards... in a cooperative non tournament-based LCG. I'm not sure whether to laugh or cry. >_>;\n\n\n\nActually you right. Is quite funny!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544713","commentId":544713,"userName":"mr.thomasschmidt","timestamp":1319093121,"content":"Darthvegeta800 said:\n\nIndeed. Seriously do you think most people at the store play the game beyond casually? We bring it out once in a while, give it a few goes. There has to be balance. Very easy, easy, normal, hard and very hard ones in equal measure. But a lot of people on this forum are diehard players and hence only look through the glasses of hardcore competitive play. That is a stark contrast with a lot of people who like me picked it up for it's flavor, it's story-driven edge and the fact it avoided the supercompetitive cutthroat edge a lot of cardgames have.\n\nHere! Here! \"Good speach. Nice and short\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544745","commentId":544745,"userName":"mkultra","timestamp":1319096813,"content":"FFG already has a rule/mechanic in place for making quests more difficult. Play with one fewer Hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544748","commentId":544748,"userName":"Eryx_UK","timestamp":1319096978,"content":"Glaurung said:\n\nMattr0polis said:\n\n \n\nPower creep isn't something we need to worry about for a long time imo as this game is pretty awesome right now. But there are plenty of ways I think they'll be able to reign the game back in if they ever need to.\n\n1. I think I read somewhere that they are prepared to ban a card if errata or clarification can't stop something from being completely abusive.\n\n2. They could always implement set rotation once the card pool is large enough. Something like rotate out the core set in favor of a new one a few years down the line. Or, only cards from the last four adventure pack cycles can be used for 'tournament legal' decks, etc.\n\n \n\n \n\n1 In my opinion we need Errata for Beravur action : draw 2 cards limit 1 per turn. Tracker choose 1 location and 1 token on location NOT EVERY LOCATION is to powerful.\n\nBan B Brand this card really broken!!!!\n\n2 About card rotation. I also think in LCG format you dont need that. I have enough of this in Magic.\n\n\n\nI disagree. These cards are strong but they aren't broken in any way shape or form.\n\nI appreciate that you want a harder game but don't try and spoil it for the rest of us please. If you don't like them, don't play them yourself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544754","commentId":544754,"userName":"Glaurung","timestamp":1319097426,"content":"The_Big_Show said:\n\nGlaurung said:\n\n \n\nMattr0polis said:\n\n \n\nPower creep isn't something we need to worry about for a long time imo as this game is pretty awesome right now. But there are plenty of ways I think they'll be able to reign the game back in if they ever need to.\n\n1. I think I read somewhere that they are prepared to ban a card if errata or clarification can't stop something from being completely abusive.\n\n2. They could always implement set rotation once the card pool is large enough. Something like rotate out the core set in favor of a new one a few years down the line. Or, only cards from the last four adventure pack cycles can be used for 'tournament legal' decks, etc.\n\n \n\n \n\n1 In my opinion we need Errata for Beravur action : draw 2 cards limit 1 per turn. Tracker choose 1 location and 1 token on location NOT EVERY LOCATION is to powerful.\n\nBan B Brand this card really broken!!!!\n\n2 About card rotation. I also think in LCG format you dont need that. I have enough of this in Magic.\n\n \n\n \n\nI disagree. These cards are strong but they aren't broken in any way shape or form.\n\nI appreciate that you want a harder game but don't try and spoil it for the rest of us please. If you don't like them, don't play them yourself.\n\n\n\nFirst i always say for my self and noy for any one in this forum\n\n. Second why you think i dont like those cards???? I like them. But when we will have a first tournament almost 90% of the deck list will be same.\n\nQuite boring a????"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544759","commentId":544759,"userName":"letsdance","timestamp":1319097917,"content":"jhaelen said:\n\nUntergeher said:\n\n \n\nSorry, but did I miss something? It hasn't been a year since the game came out and we haven't seen all of the adventure packs of the first cycle, but we're already talking about banning cards? Is this really happening? Seriously... come on!\n\nYep, I think you missed something: Look at who stated that opinion gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nYou can safely assume no one else shares that opinion.\n\n \n\ni share his basic oppinion. i just have a different approach to solving it: i started modding the cards. many of them.\n\nfor example, all titles, signals, skills are conditions, unexpected courage is unique, costs 3 and no character can have more than 1 condition attached (suddenly the choice to play one of these condition cards involves some planning and decisions). gimli gets +1 attack for every 2 damage. gandalf is an event. many more... not all cards need to be totally balanced, but with some streamlining of their power, the game became more interesting to us. the choice, which cards to use or remove became much harder. i also boosted some of the too weak cards, but mostly i reduced the power of the overpowered player cards to increase the challenge.\n\ni also modded the encounter deck. i detest the banks of anduin effect for example, so i replaced it with a serious location. i always hated that East Bight patrol is a tree card, when the East Bight is Wilderlands, so i shuffled some cards around (more spiders in spider deck, more orcs in orc deck etc). i also modded some stats. again, in general i increased the challenge and we like it better that way.\n\nthis game has such a great potential. it is good the way it is published, but it could be so much more. i'm trying to get my version there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544763","commentId":544763,"userName":"Glaurung","timestamp":1319098528,"content":"letsdance said:\n\njhaelen said:\n\nUntergeher said:\n\n \n\nSorry, but did I miss something? It hasn't been a year since the game came out and we haven't seen all of the adventure packs of the first cycle, but we're already talking about banning cards? Is this really happening? Seriously... come on!\n\nYep, I think you missed something: Look at who stated that opinion gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nYou can safely assume no one else shares that opinion.\n\n \n\ni share his basic oppinion. i just have a different approach to solving it: i started modding the cards. many of them.\n\nfor example, all titles, signals, skills are conditions, unexpected courage is unique, costs 3 and no character can have more than 1 condition attached (suddenly the choice to play one of these condition cards involves some planning and decisions). gimli gets +1 attack for every 2 damage. gandalf is an event. many more... not all cards need to be totally balanced, but with some streamlining of their power, the game became more interesting to us. the choice, which cards to use or remove became much harder. i also boosted some of the too weak cards, but mostly i reduced the power of the overpowered player cards to increase the challenge.\n\ni also modded the encounter deck. i detest the banks of anduin effect for example, so i replaced it with a serious location. i always hated that East Bight patrol is a tree card, when the East Bight is Wilderlands, so i shuffled some cards around (more spiders in spider deck, more orcs in orc deck etc). i also modded some stats. again, in general i increased the challenge and we like it better that way.\n\nthis game has such a great potential. it is good the way it is published, but it could be so much more. i'm trying to get my version there.\n\n\n\nI done it also before.\n\nAnd i glad someone do it  and start to see how much better and interesting game when the cards is more balanced. Yes and some people right you can do some house rules ans so on. But actually is not My JOB!!!! That job OF FFG!!!! Game is brilliant, just need to make some erratas, stop release some broken (B brnd for example)  make quest more interesting, make effect on the encounter cards react on players  growing power with every round and that ALL!!! So FFG please do your JOB!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544778","commentId":544778,"userName":"KlAve","timestamp":1319100088,"content":"Glaurung said:\n\nBut when we will have a first tournament almost 90% of the deck list will be same.\n\nAnd 72,3% of all statistics are made up on the spot. You've stated your position time and again. I've got a suggestion (something I think you've already been told): Don't make your expert decks - make theme decks or decks that are weaker on purpose. If the game can't challenge you (a statement I find very hard to believe), then challenge yourself.\n\nAs for tournement play: Let's burn that bridge, when we reach it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544802","commentId":544802,"userName":"Skeith27","timestamp":1319103120,"content":"KlÃ¸ve said:\n\nGlaurung said:\n\nBut when we will have a first tournament almost 90% of the deck list will be same.\n\n \n\nAnd 72,3% of all statistics are made up on the spot. You've stated your position time and again. I've got a suggestion (something I think you've already been told): Don't make your expert decks - make theme decks or decks that are weaker on purpose. If the game can't challenge you (a statement I find very hard to believe), then challenge yourself.\n\nAs for tournement play: Let's burn that bridge, when we reach it.\n\n\n\n \n\nI think that's pretty much the point on my side of this debate - if the game isn't providing you enough challenge, challenge yourself. Force yourself not to just beat a quest, but beat it with the best possible score you can since that's what a tournament will likely focus on anyway. Or do any of the many variations I or others have listed here.\n\nThere is a big difference in the way casual and hardcore players enjoy this game. My rule of thumb to differentiate the two is whether you have 3 core sets or not. I play with only one core set and I find the game challenge to be just what I am looking for. While it's true that sometimes I get to a state of relative security, I more often than not find myself one encounter card away from ruin. I also believe that I don't find Berevor overpowered because I don't have 3 copies of UC to stack in my deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544821","commentId":544821,"userName":"mr.thomasschmidt","timestamp":1319105805,"content":"Amen to that. And let me just make another eaqually valid statistic. It's only 3% that has problems with the game. The remaining 97% are overly satisfied! So I have a good suggestion to the 3% that is almost ruining it for the majority. Make your own rules or find another game. Very simple solution. And YES. It is YOUR job NOT FFGs to make rules for the few. FFG should only make rules for the majority. If I don't like the way a game is supposed to play I don't rant on and on and on and on about what I think it should/could be or shouldn't. I accept the conditions or find another game.\n\nAnd by the way, I have beaten all the quests now, solo, 2 player, 3 and 4. Some are easy some are difficult. Still couldn't care less what difficulty or challenges there are. Still wanna have level 1, 2 and 3 quests. As long as the story is good no such things as errata, banned cards or change of rules should be made. Unless the majority think so instead of the few. Seriously! Stop trying to ruin the game!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544828","commentId":544828,"userName":"Glaurung","timestamp":1319106895,"content":"mr.thomasschmidt said:\n\n \n\nAmen to that. And let me just make another eaqually valid statistic. It's only 3% that has problems with the game. The remaining 97% are overly satisfied! So I have a good suggestion to the 3% that is almost ruining it for the majority. Make your own rules or find another game. Very simple solution. And YES. It is YOUR job NOT FFGs to make rules for the few. FFG should only make rules for the majority. If I don't like the way a game is supposed to play I don't rant on and on and on and on about what I think it should/could be or shouldn't. I accept the conditions or find another game.\n\nAnd by the way, I have beaten all the quests now, solo, 2 player, 3 and 4. Some are easy some are difficult. Still couldn't care less what difficulty or challenges there are. Still wanna have level 1, 2 and 3 quests. As long as the story is good no such things as errata, banned cards or change of rules should be made. Unless the majority think so instead of the few. Seriously! Stop trying to ruin the game!!!\n\n \n\n\n\nI dont want to ruin something. This is only my point of view on the game.And i like this game. Otherwise i already long time leave this forum and play another game.Im buy 4 core set already and 2 copies of each ad pack. + great some kind of community in my city and as a a active player and one who is pushing other want to know where game is going. Yes maybe im must to be more casual in this game and everything will be ok. But is my nature if i do something i put 100%\n\nAnyway my point of view will not change and with time i will have more and more people who will agree with me more. I done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544841","commentId":544841,"userName":"mr.thomasschmidt","timestamp":1319108801,"content":"And it's good to do something 100% as long as it doesn't hurt anyone else. And it will if FFG listens to you too much. Then there will only be you and you little group left to play the game because everybody else don't like how the game will have evolved and find another one. 4 core sets and 2 of each AP. That's part of your problem right there. If the games too easy for you it's your own fault. Not the rules or FFG. And the only one that can and should change that is you. The majority shouldn't suffer just because a few players hasn't caught the true spirit of the game. I'm done too for now. But every time you come with those spirited outbursts I'll be there to make the opposite statements to keep the balance. It's not a personal attack cause I respect that you have your opinion, just not the way you always make it seem like you speak for the majority. Like you would comment on me if I alway stated \" Hey they should really ban Boromir because he's to powerful!!!! He totally ruins the game for everyone!!!!! Come on FFG don't make cards like that!!!!! People don't want heroes like that cause they make the quests too easy!!!! End would it be too much to ask for some 1 level quests???? Cause people are tired of the difficult level 5!!!!!!\" and so on. That would be MY opinion if that was how I felt, which it isn't, and I shouldn't make it sound like I speak for everyone. But hey, how about making a thread about how to improve game experience for hardcore players?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544844","commentId":544844,"userName":"Untergeher","timestamp":1319109091,"content":"mr.thomasschmidt said:\n\n \n\nAmen to that. And let me just make another eaqually valid statistic. It's only 3% that has problems with the game. The remaining 97% are overly satisfied! So I have a good suggestion to the 3% that is almost ruining it for the majority. Make your own rules or find another game. Very simple solution. And YES. It is YOUR job NOT FFGs to make rules for the few. FFG should only make rules for the majority. If I don't like the way a game is supposed to play I don't rant on and on and on and on about what I think it should/could be or shouldn't. I accept the conditions or find another game.\n\nAnd by the way, I have beaten all the quests now, solo, 2 player, 3 and 4. Some are easy some are difficult. Still couldn't care less what difficulty or challenges there are. Still wanna have level 1, 2 and 3 quests. As long as the story is good no such things as errata, banned cards or change of rules should be made. Unless the majority think so instead of the few. Seriously! Stop trying to ruin the game!!!\n\n \n\n\n\nmr.thomasschmidt said:\n\n \n\nAnd let me just make another eaqually valid statistic. It's only 3% that has problems with the game. The remaining 97% are overly satisfied! So I have a good suggestion to the 3% that is almost ruining it for the majority. Make your own rules or find another game. Very simple solution. And YES. It is YOUR job NOT FFGs to make rules for the few. FFG should only make rules for the majority. If I don't like the way a game is supposed to play I don't rant on and on and on and on about what I think it should/could be or shouldn't. I accept the conditions or find another game.\n\n \n\n\n\nquoted for truth\n\nAll the little things being criticized right now really seems like nitpicking to me. I totally understand that people want this game to go a certain direction, but this direction might not be the most desirable for the rest of the community. So far everything's very much to my liking. And honestly: All this talk about future tournaments... First: Why not wait until we have something official? And second: I really can't relate to all the complaining and worrying. Nothing's broken in my opinion..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544862","commentId":544862,"userName":"Bohemond2","timestamp":1319110973,"content":"The game would be better and more fun, for both the tournament player and the casual gamer, if Northern Tracker did not exist.  We can get into specifics if you wish (they have been covered elsewhere), but the general stance that many people in the thread are tacking seems to be that erratas, restrictions or bans always bad.  That simply isn't true.  Those changes can improve games under the right circumstances.\n\nedit: just to be clear, I wouldn't errata a card or ban it in this case.  I think the best solution would be to issue a restricted list for tournament play (even if their aren't tournaments).  That way, casual players could ignore the list, just like they can ignore the 50 card minimum, if they wish.  I would place Northern Tracker, Gandalf, Steward of Gondor and Unexpected Courage on the list.  Given the way that restricted lists have been used in other FFG LCGs, I woul be suprised if we didn't eventually see one for this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544871","commentId":544871,"userName":"mr.thomasschmidt","timestamp":1319112122,"content":"That is absolutely true. BUT I don't think a few people thinking the game is too easy and therefor wanna change/ban/edit a few cards is the right circumstances. that would ruin it for more than it would suit, if you follow what I mean.\n\nI don't really have any issues with the game or people wanting it more challenging. BUT it should be on the right premises. Like if my opinion got heard a lot finding the game WAAAAAY too easy end then FFG listens to that. Then the game would suddenly be only quest level 1, 2 and 3. This would maybe make me happy but it would ruin it for far more people. Follow? The right time for making mostly harder quests and ban cards is when the majority is longing for it. Like in when the forum swams with discussions about why the game is too easy and only a few want it to stay that way. THEN you can go on and do something about it. The FFG should always follow the majority not the few who thinks they are the majority. Am I making sense?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544878","commentId":544878,"userName":"Bohemond2","timestamp":1319113070,"content":"I would encourage you to spend some time talking to professional game designers.  Making design decisions based on popular consensus is a recipe for disaster."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544882","commentId":544882,"userName":"mr.thomasschmidt","timestamp":1319113403,"content":" I just meant that it's smart to give people what they want. People being the majority. It will be a poor strategy not listening to ones customers not meaning giving them EVERYTHING they want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=544994","commentId":544994,"userName":"letsdance","timestamp":1319124241,"content":"the game wouldn't be any worse for \"casual gamers\" if they had provided a better balancing. i don't understand this panic at all.\n\nanyways, i started modding cards because i'm sure it's not possible that future APs will fix the balancing issues. northern trackers, burning brand... too many things already out there, that absolutely kill many possible great ideas. they already started using \"cannot be affected by player cards\" and \"cannot be prevented\" as work-arounds. so don't be afraid, there won't be anything else.\n\nas a side note... usually the majority doesn't really know what it wants. they think they know something, of course. but when they get it, they aren't content anyways. just look at politics :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545030","commentId":545030,"userName":"TheRomance","timestamp":1319128164,"content":"Bohemond said:\n\n \n\nThe game would be better and more fun, for both the tournament player and the casual gamer, if Northern Tracker did not exist.  We can get into specifics if you wish (they have been covered elsewhere), but the general stance that many people in the thread are tacking seems to be that erratas, restrictions or bans always bad.  That simply isn't true.  Those changes can improve games under the right circumstances.\n\nedit: just to be clear, I wouldn't errata a card or ban it in this case.  I think the best solution would be to issue a restricted list for tournament play (even if their aren't tournaments).  That way, casual players could ignore the list, just like they can ignore the 50 card minimum, if they wish.  I would place Northern Tracker, Gandalf, Steward of Gondor and Unexpected Courage on the list.  Given the way that restricted lists have been used in other FFG LCGs, I woul be suprised if we didn't eventually see one for this one.\n\n \n\n \n\nI have to agree with this guy... a list of restricted cards for tournament play would be a great idea, and it sounds like an ideal solution that should satisfy the hungriest of both worlds.  Out of the four cards he mentions, three of those immediately pop into my head when I think of \"overpowered\" cards cool.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/cool.gif], so I think there is some value in evaluating the strength of a card relative to the rest of the player cards available.\n\n \n\nThat being said, when game difficulty is being discussed, from personal experience I feel like the difficulty of each play session varies greatly based on a number of different factors outside of the scenario itself.  As people have pointed out already, the game experience is going to be different for someone playing a monosphere Lore deck from the core set on Escape from DG, for example, than it is for someone playing with two other friends in carefully constructed decks with a lot of synergy tailored specific to the quest.  I do sympathize with the sentiment that in general the game becomes too easy in many of these situations, and I do feel like there should be more scenarios that are challenging for the hardcore players who have multiple core sets and all the APs.  While people can challenge themselves by modding cards or making their own encounter decks or playing thematic decks as others have suggested, I still think it is the responsibility of FFG to find a ways to standardize an increase in the difficulty of completing these scenarios (like they've done with their nightmare mode), particularly in games with 2 or more players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545069","commentId":545069,"userName":"Big Borg","timestamp":1319135104,"content":"This game is not MtG.  It is a cooperative game or solo game.  As a result, you can choose to limit the number of cards that you feel are a problem.  With a 50 card deck each, the cards that you are worried about may not even appear once!!  Please stop complaining.  If you disagree with a card, don't play it or limit it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545105","commentId":545105,"userName":"Bohemond2","timestamp":1319140430,"content":"Big Borg said:\n\nThis game is not MtG.  It is a cooperative game or solo game.  As a result, you can choose to limit the number of cards that you feel are a problem.  With a 50 card deck each, the cards that you are worried about may not even appear once!!  Please stop complaining.  If you disagree with a card, don't play it or limit it.\n\n\n\nHow would issuing a restricted list for tournament play have any impact on how you interact with the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545111","commentId":545111,"userName":"Big Borg","timestamp":1319141828,"content":"Bohemond said:\n\nBig Borg said:\n\n \n\nThis game is not MtG.  It is a cooperative game or solo game.  As a result, you can choose to limit the number of cards that you feel are a problem.  With a 50 card deck each, the cards that you are worried about may not even appear once!!  Please stop complaining.  If you disagree with a card, don't play it or limit it.\n\n \n\n \n\nHow would issuing a restricted list for tournament play have any impact on how you interact with the game?\n\n\n\n \n\nAnd how would tournament play work exactly?  There have been threads that have talked about how the scoring matrix doesn't seem to make much practical sense.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545113","commentId":545113,"userName":"Runner5","timestamp":1319142254,"content":" Wow this is quite the heated subject some people are of the opinion that the game is to hard that's good for them and others say its to easy so good for them too.  Honestly who cares?  Everyone has their own opinion let them have it.  I think math is hard, but my wife finds it easy differing opinions but it's not a big deal   If you don't like what someone says don't read their comment it's not like they are forcing you to read it especially if you know that persons stance already.  Sometimes people have differing opinions than you that's life.  I'm not meaning this in a negative way but I think everyone just needs to chill out a bit. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545125","commentId":545125,"userName":"Bohemond2","timestamp":1319146885,"content":"Big Borg said:\n\n \n\nBohemond said:\n\n \n\nBig Borg said:\n\n \n\nThis game is not MtG.  It is a cooperative game or solo game.  As a result, you can choose to limit the number of cards that you feel are a problem.  With a 50 card deck each, the cards that you are worried about may not even appear once!!  Please stop complaining.  If you disagree with a card, don't play it or limit it.\n\n \n\n \n\nHow would issuing a restricted list for tournament play have any impact on how you interact with the game?\n\n \n\n \n\n \n\nAnd how would tournament play work exactly?  There have been threads that have talked about how the scoring matrix doesn't seem to make much practical sense.\n\n \n\n \n\n \n\nFirst of all, you haven't answered my question. How would issuing a restricted list for tournament play have any impact on how you interact with the game?\n\nIn answer to your question, I have argued against the viability of the current scoring format longer than anyone else on these boards.  It doesn't work well now and I am skeptical that it will ever work.  That being said, I like the format of tournament style rules because they make for the best game play.  I like playing with decks that have a minimum of 50 cards even though you are only required to play with that limit for tournaments.\n\nMore importantly, I like the fact that designers build the game with that format in mind.  For instances, I believe the game is designed and tested with 50 card decks, even though you aren't required to play with them.  I think that if the game is designed with a restricted list in mind it would make for a better experience both for the 'hardcore' player, and for the 'casual' player who can just ignore the restrictions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545175","commentId":545175,"userName":"Big Borg","timestamp":1319160397,"content":"Bohemond said:\n\n \n\nHow would issuing a restricted list for tournament play have any impact on how you interact with the game?\n\n\n\n \n\nIt would turn a fun, challenging game into a frustrating experience.  Our meta has fun, laughs and feels challenged by the current set of Quests.  None of our games have been decked out, so we don't always have cards that some feel are \"powerful\" coming into play.\n\n \n\nBut, let's stop talking generalities.  Please list the cards that you would like restricted and the manner of restriction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545182","commentId":545182,"userName":"KlAve","timestamp":1319162367,"content":"Bohemond said:\n\nThe game would be better and more fun, for both the tournament player and the casual gamer, if Northern Tracker did not exist.  We can get into specifics if you wish (they have been covered elsewhere), but the general stance that many people in the thread are tacking seems to be that erratas, restrictions or bans always bad.  That simply isn't true.  Those changes can improve games under the right circumstances.\n\nedit: just to be clear, I wouldn't errata a card or ban it in this case.  I think the best solution would be to issue a restricted list for tournament play (even if their aren't tournaments).  That way, casual players could ignore the list, just like they can ignore the 50 card minimum, if they wish.  I would place Northern Tracker, Gandalf, Steward of Gondor and Unexpected Courage on the list.  Given the way that restricted lists have been used in other FFG LCGs, I woul be suprised if we didn't eventually see one for this one.\n\n\n\nThen don't play with those cards - easy as that. Nobody is forcing you to, and if you enjoy the game more without those cards, by all means leave them out. I just culled my Northern Trackers from my \"Prince Imrahil doing double duty\"-deck, simply to see how the deck would work without them. I also don't have three Gandalfses for every deck, and often I don't play him, even if I draw him. Different meta-games create different problems caused by different cards - it's unreasonable to lay all the blame on those cards and it's equally unreasonable to think these problems are omnipresent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545188","commentId":545188,"userName":"KlAve","timestamp":1319163323,"content":"Bohemond said:\n\nFirst of all, you haven't answered my question. How would issuing a restricted list for tournament play have any impact on how you interact with the game?\n\nIn answer to your question, I have argued against the viability of the current scoring format longer than anyone else on these boards.  It doesn't work well now and I am skeptical that it will ever work.  That being said, I like the format of tournament style rules because they make for the best game play.  I like playing with decks that have a minimum of 50 cards even though you are only required to play with that limit for tournaments.\n\nMore importantly, I like the fact that designers build the game with that format in mind.  For instances, I believe the game is designed and tested with 50 card decks, even though you aren't required to play with them.  I think that if the game is designed with a restricted list in mind it would make for a better experience both for the 'hardcore' player, and for the 'casual' player who can just ignore the restrictions.\n\n\n\nSome players (myself included) like to adhere to the tournament rules (building 50 card decks) even though there aren't yet any tournament scene. For me, it's safe to say, that any restriction on, how I can play in a tournament would also limit how I would play casually.\n\nI believe that the adventure packs have shown, that FFG have a clear vision on how to challenge us players in ways, that preclude us from using the established power-cards to reduce the quests to neglible difficulty.\n\nI have noted, that players value cards and judge quests differentl. This suggests, that the issue isn't all that clear. In my view, a restriction list will only muddy the waters further."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545269","commentId":545269,"userName":"Bohemond2","timestamp":1319180104,"content":"Big Borg said:\n\nBohemond said:\n\n \n\n \n\nHow would issuing a restricted list for tournament play have any impact on how you interact with the game?\n\n \n\n \n\n \n\nIt would turn a fun, challenging game into a frustrating experience.  Our meta has fun, laughs and feels challenged by the current set of Quests.  None of our games have been decked out, so we don't always have cards that some feel are \"powerful\" coming into play.\n\n \n\nBut, let's stop talking generalities.  Please list the cards that you would like restricted and the manner of restriction.\n\n\n\nread the thread, I already posted specific cards. Unexpected Courage, Steward of Gondor, Northern Tracker and Gandalf.  As for the manner of restriction I would use the same rules that all of the other LCGs use.  Here is an example from the game of thrones rules.\n\n:\"The following cards are restricted for LCG tournament melee and joust play. A player may select 1 card from the restricted list for any given deck, and cannot then play with any other restricted cards in the same deck. A player may run as many copies of his chosen restricted card in a deck as the regular game rules (or card text) allow.'\n\nAs a casual player, who enjoys the game as it stands, why would you need to pay any attention to the restricted list? If I am correct, you play the A Game of Thrones LCG.  Has the existence of a restricted list for AGoT damaged your enjoyment of the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545271","commentId":545271,"userName":"mr.thomasschmidt","timestamp":1319180651,"content":"I relly like the idea of a restriction list. Since it only \"counts\" in tournaments the casual or non-tounament minded players can just ignore it and feel good using all the cards, and the hard core players can play by that list and make it more challenging for them.\n\nMe like that idea gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545274","commentId":545274,"userName":"Bohemond2","timestamp":1319180801,"content":" \n\n \n\n \n\n \n\nKlÃ¸ve said:\n\n \n\nBohemond said:\n\nThe game would be better and more fun, for both the tournament player and the casual gamer, if Northern Tracker did not exist.  We can get into specifics if you wish (they have been covered elsewhere), but the general stance that many people in the thread are tacking seems to be that erratas, restrictions or bans always bad.  That simply isn't true.  Those changes can improve games under the right circumstances.\n\nedit: just to be clear, I wouldn't errata a card or ban it in this case.  I think the best solution would be to issue a restricted list for tournament play (even if their aren't tournaments).  That way, casual players could ignore the list, just like they can ignore the 50 card minimum, if they wish.  I would place Northern Tracker, Gandalf, Steward of Gondor and Unexpected Courage on the list.  Given the way that restricted lists have been used in other FFG LCGs, I woul be suprised if we didn't eventually see one for this one.\n\n \n\nThen don't play with those cards - easy as that. Nobody is forcing you to, and if you enjoy the game more without those cards, by all means leave them out. I just culled my Northern Trackers from my \"Prince Imrahil doing double duty\"-deck, simply to see how the deck would work without them. I also don't have three Gandalfses for every deck, and often I don't play him, even if I draw him. Different meta-games create different problems caused by different cards - it's unreasonable to lay all the blame on those cards and it's equally unreasonable to think these problems are omnipresent.\n\n \n\n \n\nFirst of all, your argument would preclude restricted lists not just in this game, but in all LCGs.  You claim to want to follow tournament rules for your home play, but then effectively argue that such rules should not exist.  As the game continues to grow, their will be a growing list of errata.  In all likelihood, we will see some cards either restricted or banned at some point.  Such rules are part and parcel of tournament rules in all CCG and LCG.\n\nThe problem with those cards isn't in how they are played, its in how they shape the game as a whole.  If you are a designer for the game and making up a scenario, you need to think long and hard about whether or not locations in a scenario provide a viable challenge in the face of the existence  northern tracker.  You are faced, especially in crafting scenarios that work for multiple players, with creating a set of locations that Northern Tracker trivializes, or a set of locations which will be exceedingly challenging without a tracker in play.  Again, the game would play better and we would see better scenarios if northern tracker had never been printed.\n\nBanning is an extreme reaction and one that designers tend to avoid.  but the restricted list is a viable alternative.  If you don't like the concept of a restricted list you shouldn't be following tournament style rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545298","commentId":545298,"userName":"Glaurung","timestamp":1319185041,"content":"Bohemond said:\n\n \n\n \n\n \n\n \n\nKlÃ¸ve said:\n\n \n\nBohemond said:\n\nThe game would be better and more fun, for both the tournament player and the casual gamer, if Northern Tracker did not exist.  We can get into specifics if you wish (they have been covered elsewhere), but the general stance that many people in the thread are tacking seems to be that erratas, restrictions or bans always bad.  That simply isn't true.  Those changes can improve games under the right circumstances.\n\nedit: just to be clear, I wouldn't errata a card or ban it in this case.  I think the best solution would be to issue a restricted list for tournament play (even if their aren't tournaments).  That way, casual players could ignore the list, just like they can ignore the 50 card minimum, if they wish.  I would place Northern Tracker, Gandalf, Steward of Gondor and Unexpected Courage on the list.  Given the way that restricted lists have been used in other FFG LCGs, I woul be suprised if we didn't eventually see one for this one.\n\n \n\nThen don't play with those cards - easy as that. Nobody is forcing you to, and if you enjoy the game more without those cards, by all means leave them out. I just culled my Northern Trackers from my \"Prince Imrahil doing double duty\"-deck, simply to see how the deck would work without them. I also don't have three Gandalfses for every deck, and often I don't play him, even if I draw him. Different meta-games create different problems caused by different cards - it's unreasonable to lay all the blame on those cards and it's equally unreasonable to think these problems are omnipresent.\n\n \n\n \n\nFirst of all, your argument would preclude restricted lists not just in this game, but in all LCGs.  You claim to want to follow tournament rules for your home play, but then effectively argue that such rules should not exist.  As the game continues to grow, their will be a growing list of errata.  In all likelihood, we will see some cards either restricted or banned at some point.  Such rules are part and parcel of tournament rules in all CCG and LCG.\n\nThe problem with those cards isn't in how they are played, its in how they shape the game as a whole.  If you are a designer for the game and making up a scenario, you need to think long and hard about whether or not locations in a scenario provide a viable challenge in the face of the existence  northern tracker.  You are faced, especially in crafting scenarios that work for multiple players, with creating a set of locations that Northern Tracker trivializes, or a set of locations which will be exceedingly challenging without a tracker in play.  Again, the game would play better and we would see better scenarios if northern tracker had never been printed.\n\nBanning is an extreme reaction and one that designers tend to avoid.  but the restricted list is a viable alternative.  If you don't like the concept of a restricted list you shouldn't be following tournament style rules.\n\n\n\nI like the idea of restricted list. AGOT have it yes???? I never play other lcg so i didn know about that. I use to play magic and Lotr Tcg so there is no restricted lists only erratas and ban.So restricted list idea is quite cool cose pleased  all kind of players.  Why not??? why not???\n\nActually Bohemond i remebre you first lore/Leadership/Spirit deck in the time of the core set. Quite cool deck with Beravur, Gloin and Eowyn. Crazy boring for me to play but very effective!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545329","commentId":545329,"userName":"KlAve","timestamp":1319188003,"content":"Bohemond said:\n\nFirst of all, your argument would preclude restricted lists not just in this game, but in all LCGs.  You claim to want to follow tournament rules for your home play, but then effectively argue that such rules should not exist.  As the game continues to grow, their will be a growing list of errata.  In all likelihood, we will see some cards either restricted or banned at some point.  Such rules are part and parcel of tournament rules in all CCG and LCG.\n\nThe problem with those cards isn't in how they are played, its in how they shape the game as a whole.  If you are a designer for the game and making up a scenario, you need to think long and hard about whether or not locations in a scenario provide a viable challenge in the face of the existence  northern tracker.  You are faced, especially in crafting scenarios that work for multiple players, with creating a set of locations that Northern Tracker trivializes, or a set of locations which will be exceedingly challenging without a tracker in play.  Again, the game would play better and we would see better scenarios if northern tracker had never been printed.\n\nBanning is an extreme reaction and one that designers tend to avoid.  but the restricted list is a viable alternative.  If you don't like the concept of a restricted list you shouldn't be following tournament style rules.\n\n\n\nI see your point, but I still would consider a restricted list premature at this point. Again, we haven't seen a tournament yet - I have faith that FFG will rise above and challenge the power cards in ways we don't anticipate. Also Lord of the Rings LCG is a different beast from the other released LCGs in that we don't have any competetive play (until we see tournament play at least) - any \"broken\" card will mostly be ruining the game for the one playing it, not for the opponent.\n\nYes, the Northern Tracker is powerful, but I have had many games, where I have drawn him or Gandalf or another powerful card and not played them, simply because it wasn't the best play at the time. I don't consider any of them game-breaking. Note that I play almost all of my games either solo or two-player, which is where Northern Tracker is least powerful - I can certainly see him trivializing content in a four-player game.\n\nIn the end I will adhere to whatever guidelines FFG releases. I just hope they won't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545472","commentId":545472,"userName":"Big Borg","timestamp":1319210194,"content":"To be honest, I can't see playing LOTR in a tournament format.  There aren't that many players to have a number of \"teams\" battling Quests in a tournament setting.  At least, not in Delaware or New Jersey.  We are still trying to get new players involved.\n\nAnd if there are tournaments, I would hope that the Quests are not announced ahead of time, but have several placed in front of the teams and  randomly selected.  This would avoid creating decks for a specified Quest.  Maybe that is the solution, instead of \"restricting' or \"banning\" cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545579","commentId":545579,"userName":"silverhand77","timestamp":1319223257,"content":"Big Borg said:\n\nTo be honest, I can't see playing LOTR in a tournament format.  There aren't that many players to have a number of \"teams\" battling Quests in a tournament setting.  At least, not in Delaware or New Jersey.  We are still trying to get new players involved.\n\nAnd if there are tournaments, I would hope that the Quests are not announced ahead of time, but have several placed in front of the teams and  randomly selected.  This would avoid creating decks for a specified Quest.  Maybe that is the solution, instead of \"restricting' or \"banning\" cards.\n\n\n\nI don't know, I think it would be fun to play in a tournament. I've been thinking about how a tournament might be structured for a while now. You could even have different sorts of tournaments, for example, you could have one where the quests being used were made public beforehand so people could design decks for them and you could have ones where the quests are not made public and the participants just have to build the best all round deck they can. Also you could have a tournament where lets say 3 quests are chosen to be played and players may only use one deck each for all 3. You could have divisions in terms of solo, 2 player, 3 player and four player. you could do all sorts of things with a tournament. All you need is enough people who want to play etc. I know I'd love to play in an event like this :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545717","commentId":545717,"userName":"Titan","timestamp":1319270017,"content":"Bohemond said:\n\n \n\n \n\nHow would issuing a restricted list for tournament play have any impact on how you interact with the game?\n\n \n\n \n\n\n\nI can't believe we are actually discussing this. A banned/restricted list for a solo/coop game, that currently has no tournaments. Could anything be more absurdly irrelevant? To answer that question, it wouldn't really impact anyone in a meaningful way. Players who chose to follow it, would be doing it out of their own free will, not because it truly imposed any restriction on them. We are currently playing for nothing and against nobody. \n\nIf you feel there are cards that should be banned/restricted, treat them in that manner. Play them as though they were. And I, along with everyone else, will treat them as we see fit, banned/restricted or not. A list, at this point, will hardly change anything. Those who think the cards should be restricted will play them as such, those who don't, won't. Not to mention, if they did put up a list, you have no assurance that FFG will agree with you on what cards should be on it. And then what? \n\nDecisions as to what, if anything, should be banned/restricted need to be made after tournaments, because that is how you can tell that these cards are truly causing a widespread issue. A few people, seeing an issue, within the limitations of themselves or their playgroup, hardly merit any kind of punitive action. Heck, you can find just as many people, if not more, that disagree with having a list.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545726","commentId":545726,"userName":"Bohemond2","timestamp":1319272574,"content":"I will repeat, yet again, that the cards effect the design of subsequent encounter decks. Whether or not I choose to play with specific cards has no effect on how scenarios are designed and tested. I have no problem with people disagreeing with me, but I would appreciate it if you took the time to understand what I have said.\n\nYou don't need a tournament structure to see that certain cards may not function as intended.  In fact, if you look at board games that FFG makes, the frequently use expansion products to effectively errata cards that have unintended negative consequences on the game.  And they make those decisions without the resource of tournament play.  A restricted list is less intrusive than major errata to text of cards, which we already have in this game.\n\nAnd yes, if FFG made a restricted list it would likely differ from mine in some fashion.  I would be fine by that. A properly made restricted list would help the development of the game, just like it does with every other LCG.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545734","commentId":545734,"userName":"Bohemond2","timestamp":1319274744,"content":"In addition, we already have tournament only rules which you are free to use and ignore (the 50 card deck minimum), despite the fact that we have no tournaments.  The arguments I have heard about a tournament restricted list would be equally applicable to the card card limit.\n\nWhy do we need a tournament rule about deck size in a co-op game with no tournaments?  If you want a 50 card minimum, just play with one, FFG shouldn't have to make it a rule.\n\nHowever, the existence of the 50 card minimum improves the game, and rule doesn't have to change your game if you don't want it to.  I am willing to bet that FFG assumes a 50 card deck minimum when it designs player and encounter cards, and that assumption leads to a better product.\n\n \n\n@Glaurung - thanks!  And yes, that deck is hideously boring to play.  Despite its effectiveness I deconstructed it to make way for more entertaining concepts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545755","commentId":545755,"userName":"Titan","timestamp":1319278084,"content":"Bohemond said:\n\nI will repeat, yet again, that the cards effect the design of subsequent encounter decks. Whether or not I choose to play with specific cards has no effect on how scenarios are designed and tested. I have no problem with people disagreeing with me, but I would appreciate it if you took the time to understand what I have said.\n\nYou don't need a tournament structure to see that certain cards may not function as intended.  In fact, if you look at board games that FFG makes, the frequently use expansion products to effectively errata cards that have unintended negative consequences on the game.  And they make those decisions without the resource of tournament play.  A restricted list is less intrusive than major errata to text of cards, which we already have in this game.\n\nAnd yes, if FFG made a restricted list it would likely differ from mine in some fashion.  I would be fine by that. A properly made restricted list would help the development of the game, just like it does with every other LCG.   \n\n\n\n\n \n\nIf that first paragraph was directed at me, I can assure you that I understand what you are saying, thank you for assuming that I didn't. Balancing how a card plays out between solo and coop will be a challenge, much more so when it is a powerful card. But that comes with this kind of game in which you must design to cover multiple modes of play. The issue of cards affecting encounter deck design will always exist. By this kind of rationale, FFG should never make powerful cards lest they become overly powerful at some point. Personally, I think that if the Tracker is found to be that much of an issue, FFG can be creative enough to design counters against him. I'm guessing this is what bothers you, that they should not have to tailor their designs so specifically against any one single card. I can see how this would qualify a card as overpowered, but In my opinion, it is still too premature.\n\nI truly believe that in a card game, tournaments are needed to ascertain what cards are tipping the balance of the game. Either that, or a long standing, proven ability of the card to wreck the environment. I just don't feel we are there yet. If FFG cannot find ways to make it less of a factor, then they should make whatever decisions they think will benefit the game. Note that I'm not against a list ever, just not at this point. \n\nI'm wondering, how would you deal with Steward of Gondor? Not looking to argue this one, just curious. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545845","commentId":545845,"userName":"Bohemond2","timestamp":1319300932,"content":"Titan said:\n\nI'm wondering, how would you deal with Steward of Gondor? Not looking to argue this one, just curious.\n\n\n\nBohemond said:\n\nI already posted specific cards. Unexpected Courage, Steward of Gondor, Northern Tracker and Gandalf. As for the manner of restriction I would use the same rules that all of the other LCGs use. Here is an example from the game of thrones rules.\n\"The following cards are restricted for LCG tournament melee and joust play. A player may select 1 card from the restricted list for any given deck, and cannot then play with any other restricted cards in the same deck. A player may run as many copies of his chosen restricted card in a deck as the regular game rules (or card text) allow.'\n\n\n \n\nThe issue with northern tracker isn't just power level. Northern tracker threats to remove an entire component of the game (travel) and neutralizes the majority of one of the three types of encounter cards. the designers are clearly already trying to devise anti-northern tracker cards, and, if Emin Muil is any indication, that process seems to actually make the game worse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545938","commentId":545938,"userName":"Glaurung","timestamp":1319329316,"content":"So yesterday we have a long evening to play nightmare session with my friend Koby. We have 2 very good working together decks. Quest/draw/cancel effect deck Beravur/Eowyn/Eleanor and fighting deck Gimly/Theodred/Thalin.\n\nIn this thread before i use to explain how those 2 decks very good work together against any quest even against Osgiliath so here is my report about how is work in Nightmare.\n\nFirst, big surprise for us nightmare with even new FAQ 1.1 rules is more easy and annoy then just solo game. Why???? Cose in this game you can control what kind of cards you have in your deck on the beginnig of every quest session. For example: In the first game by Beravur we both take all our deck in hands. Than When you come to the last stage of the quest you heal all your wounds, reduce your threat and discard to discard pile all the cards(by Protector of Lorien) which you dont need in the next Quest (in our case next one is Carrock). So then when you finish the first quest you start second one with the best cards in you draw deck. you can even discard all the cards keep only 7 and exactly manage your best starting hands!!! And Beravur deck get in starting hand dwarven tomb and Will of the west so you always can get your deck back from discard pike later for both players when you need it. So you can Choose your staring hand from quest to quest easy!!!!! This is amazing!!!! This advantage you can never get in normal game. So i dont tnink need to explain the encounter deck cannot do nothing against you. So you can manage your staring hand, You always have resources to pay for your cards(steward) you always have enough cards in both players hands so you can answer on any card in encounter deck and you always have advantage cose encouner deck still reveal only 2 cards per turn.\n\nPoor baby encounter deck!!!! I feel pity for him!!!! Ohh my god!!!! This is what Nate French develop for this game?????Sorry but something wrong here.\n\nOf course all of this is possible only cose Beravur and U. Courage on him 3 times. So if Beravur will have text limit once per round many things change. And Courage should be unique. When we get Boromir We change Thalin and then those decks will be much more powerful and there is some eagles from Emyn Muil we need too. Actually is not really necessary  even without those new eagles is working quite good.\n\nI hope my english is good enough and every one undestand what i mean and you can always try this by yourself!!!! Cheers for every one.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545961","commentId":545961,"userName":"mr.thomasschmidt","timestamp":1319338755,"content":" Then maybe you should just play with one U. Courage if you think it makes it too easy. I only have one core set and I begin to think that although it's perfectly \"legal\" to have 3xevery card in your deck, this is probably why they didn't include it in the core set. Or one of the reasons anyway. Knowing it would be too easy to beat the game with certain cards x 3. I agree that if that's the case they should also have made it restricted. I'll agree with you on that Glaurung, strange as it might be lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] But then see it from the perspective of all the one core set owners too. It's \"only\" you guys with multiple core sets that is in that situation and then it would be more fair if you just made those restrictions yourself instead of wanting more challenging quests all the time ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] AND to come with suggestions to erratta such as I think you have done earlier? And after the first tournament if it'll ever be, the discussion of banning cards could come up :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545963","commentId":545963,"userName":"Darthvegeta800","timestamp":1319338858,"content":"Then don't use those cards.\nSeriously what's wrong people?! This is a non competitive, non tournament game. There is no 'abuse' unless you chose to do so.\nIf it's too easy, make it harder for yourself. If it's too hard, go for the more cost efficient combo's.\nThis is a story orientated game that has a sandbox edge in playstyle. You can easily put down your own restrictions in the game.\n\nNot to mention the quests are going to get harder and far more complex. If like me you build 'general' decks not orientated towards one single quest you'll see performance flutter rapidly.\n\nI'm terribly sorry but I just don't see a problem. You seem to look at the Lotr LCG the way I look at the Warhammer Invasion LCG balance. And these are both very different beasts..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545970","commentId":545970,"userName":"silverhand77","timestamp":1319340760,"content":"Glaurung said:\n\nCose in this game you can control what kind of cards you have in your deck on the beginnig of every quest session. For example: In the first game by Beravur we both take all our deck in hands. Than When you come to the last stage of the quest you heal all your wounds, reduce your threat and discard to discard pile all the cards(by Protector of Lorien) which you dont need in the next Quest (in our case next one is Carrock). So then when you finish the first quest you start second one with the best cards in you draw deck. you can even discard all the cards keep only 7 and exactly manage your best starting hands!!! And Beravur deck get in starting hand dwarven tomb and Will of the west so you always can get your deck back from discard pike later for both players when you need it. So you can Choose your staring hand from quest to quest easy!!!!! This is amazing!!!! This advantage you can never get in normal game. So i dont tnink need to explain the encounter deck cannot do nothing against you. So you can manage your staring hand, You always have resources to pay for your cards(steward) you always have enough cards in both players hands so you can answer on any card in encounter deck and you always have advantage cose encouner deck still reveal only 2 cards per turn.\n\nPoor baby encounter deck!!!! I feel pity for him!!!! Ohh my god!!!! This is what Nate French develop for this game?????Sorry but something wrong here.\n\nOf course all of this is possible only cose Beravur and U. Courage on him 3 times. So if Beravur will have text limit once per round many things change. And Courage should be unique. When we get Boromir We change Thalin and then those decks will be much more powerful and there is some eagles from Emyn Muil we need too. Actually is not really necessary  even without those new eagles is working quite good.\n\nI hope my english is good enough and every one undestand what i mean and you can always try this by yourself!!!! Cheers for every one.\n \n\n\n\nI'm a bit confused Glarung, First how can both of you get all of your deck in hand using one Beravor? it would take at least 12 turns. Also after you finish a quest in nightmare mode (according to the official FAQ, page 5), you are supposed to shuffle all non hero cards in play and in hand into their owner's decks and discard all unspent resources and reset threat to the value of the threat cost of their heroes. Also Steward of Gondor is unique and therefore there can only be one in play, and as such you only get 2 extra resources a turn. I'm having difficulty believing that a quest like massing at Osgiliath where you start the quest with 3 scouts per player in the staging area would not pose a problem even with your strategy. Do you mulligan more than once? I don't think you're followng the rules correctly. If you are finding it that easy, you must be missing something. Perhaps you could record a quest and post on youtube so we can see exactly how you play. Maybe we can see some mistakes you are making that you aren't aware of. If this is the case hopefully we can help improve your playing experience. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545984","commentId":545984,"userName":"Glaurung","timestamp":1319344570,"content":"silverhand77 said:\n\nGlaurung said:\n\n \n\nCose in this game you can control what kind of cards you have in your deck on the beginnig of every quest session. For example: In the first game by Beravur we both take all our deck in hands. Than When you come to the last stage of the quest you heal all your wounds, reduce your threat and discard to discard pile all the cards(by Protector of Lorien) which you dont need in the next Quest (in our case next one is Carrock). So then when you finish the first quest you start second one with the best cards in you draw deck. you can even discard all the cards keep only 7 and exactly manage your best starting hands!!! And Beravur deck get in starting hand dwarven tomb and Will of the west so you always can get your deck back from discard pike later for both players when you need it. So you can Choose your staring hand from quest to quest easy!!!!! This is amazing!!!! This advantage you can never get in normal game. So i dont tnink need to explain the encounter deck cannot do nothing against you. So you can manage your staring hand, You always have resources to pay for your cards(steward) you always have enough cards in both players hands so you can answer on any card in encounter deck and you always have advantage cose encouner deck still reveal only 2 cards per turn.\n\nPoor baby encounter deck!!!! I feel pity for him!!!! Ohh my god!!!! This is what Nate French develop for this game?????Sorry but something wrong here.\n\nOf course all of this is possible only cose Beravur and U. Courage on him 3 times. So if Beravur will have text limit once per round many things change. And Courage should be unique. When we get Boromir We change Thalin and then those decks will be much more powerful and there is some eagles from Emyn Muil we need too. Actually is not really necessary  even without those new eagles is working quite good.\n\nI hope my english is good enough and every one undestand what i mean and you can always try this by yourself!!!! Cheers for every one.\n \n\n \n\n \n\nI'm a bit confused Glarung, First how can both of you get all of your deck in hand using one Beravor? it would take at least 12 turns. Also after you finish a quest in nightmare mode (according to the official FAQ, page 5), you are supposed to shuffle all non hero cards in play and in hand into their owner's decks and discard all unspent resources and reset threat to the value of the threat cost of their heroes. Also Steward of Gondor is unique and therefore there can only be one in play, and as such you only get 2 extra resources a turn. I'm having difficulty believing that a quest like massing at Osgiliath where you start the quest with 3 scouts per player in the staging area would not pose a problem even with your strategy. Do you mulligan more than once? I don't think you're followng the rules correctly. If you are finding it that easy, you must be missing something. Perhaps you could record a quest and post on youtube so we can see exactly how you play. Maybe we can see some mistakes you are making that you aren't aware of. If this is the case hopefully we can help improve your playing experience. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n \n\n\n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545987","commentId":545987,"userName":"silverhand77","timestamp":1319346214,"content":"Glaurung said:\n\n\n \n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n \n\n\n\nEven with 3x Unexpected courage on Beravor. the most cards you can draw in a single turn is 8. for both of you (presumably with a minimum of 50 cards in your deck) it would take at least 12 turns to draw your entire decks. Lets say your opening hand has one copy of U Courage in it, on average it would probably take at least 2-3 turns to draw into a second one and then probably the same to draw into the third. I'm just thinking that in this time, you would also have to deal with enemies and questing and attcking and defending etc, plus you would have to control your threat all of which costs resources and requires exhausting characters. And then in Nightmare mode you'd have to shuffle all of them back into your deck and start again.  You would need a lot of luck to get through all of the available quests one after the other as easily as you claim. I'm not buying it. The game just isn't that easy especially in nightmare mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545992","commentId":545992,"userName":"Dam the Man","timestamp":1319348024,"content":"7 to start off with (leaving only 43 to draw through), 9 per turn eventually (8 from Beravor + 1 each turn), that's 50+ cards in 5 turns by my math (9x5 = 45 + 7 = 52). Of course resources are an issue as is drawing all 3 UC, but then again, there is Ancient Mathom for 1 resource -> 3 cards. I've seen 35+ cards with Beravor + 2x UC in my games (vs Carrock of course, there is all the time in the world for hoarding cards during stage 1) in somewhere around 10 turns without fully optimising the draw as well (throwing a few cards for the other deck as well)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545994","commentId":545994,"userName":"silverhand77","timestamp":1319348785,"content":"Dam said:\n\n7 to start off with (leaving only 43 to draw through), 9 per turn eventually (8 from Beravor + 1 each turn), that's 50+ cards in 5 turns by my math (9x5 = 45 + 7 = 52). Of course resources are an issue as is drawing all 3 UC, but then again, there is Ancient Mathom for 1 resource -> 3 cards. I've seen 35+ cards with Beravor + 2x UC in my games (vs Carrock of course, there is all the time in the world for hoarding cards during stage 1) in somewhere around 10 turns without fully optimising the draw as well (throwing a few cards for the other deck as well)\n\n\n\nYep I can see that your maths is correct. However I still don't think you could pull it off 8 consecutive times in a row especially with massing in the mix. You wouldn't have much time to hoard cards in massing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=545995","commentId":545995,"userName":"Glaurung","timestamp":1319349020,"content":"silverhand77 said:\n\nGlaurung said:\n\n \n\n\n \n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n \n\n \n\n \n\nEven with 3x Unexpected courage on Beravor. the most cards you can draw in a single turn is 8. for both of you (presumably with a minimum of 50 cards in your deck) it would take at least 12 turns to draw your entire decks. Lets say your opening hand has one copy of U Courage in it, on average it would probably take at least 2-3 turns to draw into a second one and then probably the same to draw into the third. I'm just thinking that in this time, you would also have to deal with enemies and questing and attcking and defending etc, plus you would have to control your threat all of which costs resources and requires exhausting characters. And then in Nightmare mode you'd have to shuffle all of them back into your deck and start again.  You would need a lot of luck to get through all of the available quests one after the other as easily as you claim. I'm not buying it. The game just isn't that easy especially in nightmare mode.\n\n\n\nsilverhand77 said:\n\nGlaurung said:\n\n \n\n\n \n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n \n\n \n\n \n\nEven with 3x Unexpected courage on Beravor. the most cards you can draw in a single turn is 8. for both of you (presumably with a minimum of 50 cards in your deck) it would take at least 12 turns to draw your entire decks. Lets say your opening hand has one copy of U Courage in it, on average it would probably take at least 2-3 turns to draw into a second one and then probably the same to draw into the third. I'm just thinking that in this time, you would also have to deal with enemies and questing and attcking and defending etc, plus you would have to control your threat all of which costs resources and requires exhausting characters. And then in Nightmare mode you'd have to shuffle all of them back into your deck and start again.  You would need a lot of luck to get through all of the available quests one after the other as easily as you claim. I'm not buying it. The game just isn't that easy especially in nightmare mode.\n\n\n\n Listen i dont care you buy it or not. This is your bussines!You want to know how????   Try your self. And if you cannot this is your problem. \n\n  Beravur and Dan try this one please. I wonna listen your  ideas about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546005","commentId":546005,"userName":"silverhand77","timestamp":1319351378,"content":"Glaurung said:\n\nsilverhand77 said:\n\n \n\nGlaurung said:\n\n \n\n\n \n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n \n\n \n\n \n\nEven with 3x Unexpected courage on Beravor. the most cards you can draw in a single turn is 8. for both of you (presumably with a minimum of 50 cards in your deck) it would take at least 12 turns to draw your entire decks. Lets say your opening hand has one copy of U Courage in it, on average it would probably take at least 2-3 turns to draw into a second one and then probably the same to draw into the third. I'm just thinking that in this time, you would also have to deal with enemies and questing and attcking and defending etc, plus you would have to control your threat all of which costs resources and requires exhausting characters. And then in Nightmare mode you'd have to shuffle all of them back into your deck and start again.  You would need a lot of luck to get through all of the available quests one after the other as easily as you claim. I'm not buying it. The game just isn't that easy especially in nightmare mode.\n\n \n\n \n\nsilverhand77 said:\n\n \n\nGlaurung said:\n\n \n\n\n \n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n \n\n \n\n \n\nEven with 3x Unexpected courage on Beravor. the most cards you can draw in a single turn is 8. for both of you (presumably with a minimum of 50 cards in your deck) it would take at least 12 turns to draw your entire decks. Lets say your opening hand has one copy of U Courage in it, on average it would probably take at least 2-3 turns to draw into a second one and then probably the same to draw into the third. I'm just thinking that in this time, you would also have to deal with enemies and questing and attcking and defending etc, plus you would have to control your threat all of which costs resources and requires exhausting characters. And then in Nightmare mode you'd have to shuffle all of them back into your deck and start again.  You would need a lot of luck to get through all of the available quests one after the other as easily as you claim. I'm not buying it. The game just isn't that easy especially in nightmare mode.\n\n \n\n \n\n Listen i dont care you buy it or not. This is your bussines!You want to know how????   Try your self. And if you cannot this is your problem. \n\n  Beravur and Dan try this one please. I wonna listen your  ideas about.\n\n\n\nI'd be happy to try if you'll post your deck lists so I can build them :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546013","commentId":546013,"userName":"Glaurung","timestamp":1319352099,"content":"silverhand77 said:\n\nGlaurung said:\n\n \n\nsilverhand77 said:\n\n \n\nGlaurung said:\n\n \n\n\n \n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n \n\n \n\n \n\nEven with 3x Unexpected courage on Beravor. the most cards you can draw in a single turn is 8. for both of you (presumably with a minimum of 50 cards in your deck) it would take at least 12 turns to draw your entire decks. Lets say your opening hand has one copy of U Courage in it, on average it would probably take at least 2-3 turns to draw into a second one and then probably the same to draw into the third. I'm just thinking that in this time, you would also have to deal with enemies and questing and attcking and defending etc, plus you would have to control your threat all of which costs resources and requires exhausting characters. And then in Nightmare mode you'd have to shuffle all of them back into your deck and start again.  You would need a lot of luck to get through all of the available quests one after the other as easily as you claim. I'm not buying it. The game just isn't that easy especially in nightmare mode.\n\n \n\n \n\nsilverhand77 said:\n\n \n\nGlaurung said:\n\n \n\n\n \n\nI already have my video but quality is not really good.  I cannot fix position of my camera and i hold camera in my hand so is not really nice.I try make better one.\n\nAbout Beravur you put 3 U courage on him. And Steward is unique. I was a Decipher tournaments director 10 years before and was the best player in my country in Lotr TCG and 1 of the best MTG player as well. I know the rules dont worry. And my friend Koby as well very proff player so we both dont understand the rules????We oriented on the tournaments so we do EVERYTHING according to the rules and only rules. This is not a question.\n\nAbout house rules and tournaments. I buy this game cose of Tournaments. And FFG in Some thread say there is a tournament system only come later.And in the rule book there is a tournament deck 50 card minimum + no more then 3 copies each. So we use this rules nothing more.\n\n I buy 4 core set and my goal to win World cup(i always sad this from begin). We play only the OFFICIAL rules in this case. Cose all other experience you dont need it can even harm you. And we play on the same condition as  every other players. We have all the same rules the same cards but different strategy and different ideas how to use the cards. Actually this is a whole point!!!\n\nSo we find the combo which is broke the game. And this is nothing new actually about this. Before in the Lotr TCG from Decipher was a same story.\n\n1 player, after second set was release(MInes of moria) he make combo which is kill most of the decks. And was the same problem.Unlimited DRAW!!!He draw a lot in the first turn and get kiling Shadow hand combo and on the next turn he kill he is opponent.\n\nThen Decipehr change the draw rules. Who use to play this game they know rules of 4 is: You cannot draw more then 4 cards in single turn.\n\nBut is true communty here is really different to community of the MTG and LOTR TCG in my old times(7-10years before).\n\n \n\n \n\n \n\n \n\nEven with 3x Unexpected courage on Beravor. the most cards you can draw in a single turn is 8. for both of you (presumably with a minimum of 50 cards in your deck) it would take at least 12 turns to draw your entire decks. Lets say your opening hand has one copy of U Courage in it, on average it would probably take at least 2-3 turns to draw into a second one and then probably the same to draw into the third. I'm just thinking that in this time, you would also have to deal with enemies and questing and attcking and defending etc, plus you would have to control your threat all of which costs resources and requires exhausting characters. And then in Nightmare mode you'd have to shuffle all of them back into your deck and start again.  You would need a lot of luck to get through all of the available quests one after the other as easily as you claim. I'm not buying it. The game just isn't that easy especially in nightmare mode.\n\n \n\n \n\n Listen i dont care you buy it or not. This is your bussines!You want to know how????   Try your self. And if you cannot this is your problem. \n\n  Beravur and Dan try this one please. I wonna listen your  ideas about.\n\n \n\n \n\nI'd be happy to try if you'll post your deck lists so I can build them :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nYes sure i can put deck lists but it take some time. But i already explain the idea so you can build the same deck by yourself. the most cards you know already. Other cards is not so important if there will be some another cards.\n\nfirst Deck Beravur/Eowyn/Eleanor/ Will of the west, trackers, test of will, protector of lorien, Lore songs, BBrand, U Courage,Dwarfen tomb and all the best lore and spirit allies.\n\nSecond Gimly/Thalin/Teodred. Faramir, Steward, Lot of tactic allies, Eagles as well (Landroval), Feint quick strike,Horn of Gonfor , Armors, Mark, Warning and so on.\n\nWhile first deck grow his power second one protect and fight. And after you draw like hell, quest like hell and do everything what you want.\n\nBut sure you must try and understand how to play. When you get the point is very easy. You will see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546019","commentId":546019,"userName":"silverhand77","timestamp":1319353732,"content":"Ok, Thanks Glaurung, I'll build them and have a go :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546038","commentId":546038,"userName":"lleimmoen","timestamp":1319358396,"content":"And the quest report, please. Osgiliath, preferably. Maybe then, someone will believe you. You say you don't care whether people believe you or not, but then why posting here in the first place? Prove us wrong if you can. And good luck while you're at it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546053","commentId":546053,"userName":"Bohemond2","timestamp":1319361115,"content":"I get that Glaurung rubs some people the wrong way. But his basic deck concept is sound and has been since the release of the core set. I only have 2 core sets and always have 4-5 decks at any given time, so my decks aren’t quite as streamlined as Galrung’s. However, I run a spirit lore deck with Beravor, Eowyn and either Dunhere or Elanor that works on a similar concept. It works exceptionally well against most scenarios. When it works, you always draw through the whole of the deck.\n\nIf people really want, I can type up a session report, but the deck tends to have (in terms of turns) long games and with all of the card drawing it will take quite some time to type up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546063","commentId":546063,"userName":"guciomir","timestamp":1319362214,"content":"I think most people found decks that are capable of beating most scenarios (including Osgiliath). But I'd really like to see how this deck plays against Rhosgobel, Dol Guldur and Osgiliath. Additionally, assume that changing heroes is forbidden , so you can't add cards / heroes that help you against specific scenarios. And lastly , 1 or 2 wins against 1 or 2 games does not mean anything (make it 10 or 20 games against each quest and post results + some session reports)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546064","commentId":546064,"userName":"Glaurung","timestamp":1319362372,"content":"silverhand77 said:\n\nOk, Thanks Glaurung, I'll build them and have a go :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nI just get the Dain from Emyn Muil. Change him For Thailn. He is much better work with those decks. And when you try tell me how it is ok???\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546073","commentId":546073,"userName":"lleimmoen","timestamp":1319363754,"content":"Bohemond said:\n\nI get that Glaurung rubs some people the wrong way. But his basic deck concept is sound and has been since the release of the core set. I only have 2 core sets and always have 4-5 decks at any given time, so my decks aren’t quite as streamlined as Galrung’s. However, I run a spirit lore deck with Beravor, Eowyn and either Dunhere or Elanor that works on a similar concept. It works exceptionally well against most scenarios. When it works, you always draw through the whole of the deck.\n\nIf people really want, I can type up a session report, but the deck tends to have (in terms of turns) long games and with all of the card drawing it will take quite some time to type up.\n\n\n\nI personally have nothing against mr Glaurung, I find him a decent fellow, I try to be tolerant and I think he's too. On the other hand, I understand the concerns,  there may be a cultural difference (I have lived in both East and West) but some of his comments sound strange or even arrogant to the \"western ears\", if I may call it so. I also think his strategies are fine, I just doubt the victory rates but I honestly do not mind being proven wrong by genuine session reports. And I like to see session reports in general, to react to the above. So good luck to all who may be in need!\n\nAnd as always, enjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546085","commentId":546085,"userName":"Darthvegeta800","timestamp":1319365137,"content":"guciomir said:\n\nI think most people found decks that are capable of beating most scenarios (including Osgiliath). But I'd really like to see how this deck plays against Rhosgobel, Dol Guldur and Osgiliath. Additionally, assume that changing heroes is forbidden , so you can't add cards / heroes that help you against specific scenarios. And lastly , 1 or 2 wins against 1 or 2 games does not mean anything (make it 10 or 20 games against each quest and post results + some session reports)\n\n\n\n \n\nOver here 'most' people didn't find decks to beat all the scenarios. And I think that is the norm. I get the impression the forum is filled with extremely experienced players and people highly focussed on finetuned decks.\nHowever great experience, vast amounts of 'play' and great deckbuilds are NOT the norm. Every cardgame has it's broken combo's. I have never encountered one without it. But in this game it's not really a problem whatsoever.\nIt's like the 'Gandalf' thing people have complained about. He's so good you'll always take him. So? Nobody is forcing you to take him. You can go for thematic decks or try other things. And it'll be far more in tune with the flavor of the game on top!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546087","commentId":546087,"userName":"Titan","timestamp":1319365202,"content":"It's the classic disconnect between the casual gamer and the \"metagamer\". Clearly, Glaurung is one of the latter and all he really cares about is getting this game tournament ready. He just said as much himself when he mentioned that  the only reason he joined are tournaments. His delivery could use some \"softening up\", but outside of that, to each his own. \n\nI'm starting to wonder if in a game like this, there will be a need (eventually, mind you, not now) for a different banned/restricted list for solo and multiplayer. We have cards that are good for multi and nearly useless in solo. Likewise, there are cards (Northern Tracker, Unexpected Courage) that a solo player may not draw as many copies of during his games, but \"metagamer\" multiplayers will. I can see some real unbalancing issues in multi that I just don't see in solo. Or perhaps maybe such a banned/restricted list applicable for multi only, since this is the supposed format for tournaments. If solo is exclusively a casual format, then there will be no need for a list to apply to it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546144","commentId":546144,"userName":"Glaurung","timestamp":1319376746,"content":"Titan said:\n\nIt's the classic disconnect between the casual gamer and the \"metagamer\". Clearly, Glaurung is one of the latter and all he really cares about is getting this game tournament ready. He just said as much himself when he mentioned that  the only reason he joined are tournaments. His delivery could use some \"softening up\", but outside of that, to each his own. \n\nI'm starting to wonder if in a game like this, there will be a need (eventually, mind you, not now) for a different banned/restricted list for solo and multiplayer. We have cards that are good for multi and nearly useless in solo. Likewise, there are cards (Northern Tracker, Unexpected Courage) that a solo player may not draw as many copies of during his games, but \"metagamer\" multiplayers will. I can see some real unbalancing issues in multi that I just don't see in solo. Or perhaps maybe such a banned/restricted list applicable for multi only, since this is the supposed format for tournaments. If solo is exclusively a casual format, then there will be no need for a list to apply to it. \n\n\n\nYes Titan you get my point. For casual players is not really matter problem of metagamer as you call it.\n\nWhen i start to play this game 6 months before i already see some unbalanced thing with some cards like Beravur and tracker. Now as i say before also more and more players will notice that.\n\nActually we play just finish play another 3 session against Osgiliath but this time we use Beravur ability : once per turn. Everything change!!! We still win all 3 times but we was always on the edge and really need to think hard to manage it. That was really good games.\n\nWe Change Thalin for new Dain hero and put new Eagles. They work very good too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546179","commentId":546179,"userName":"Untergeher","timestamp":1319383296,"content":"Even though I'd consider myself a casual gamer (mostly because I'm not planning on attending any sorts of tournaments) I love my metagame as well! And I spend quit some time building decks, trying new combos etc. And I'm sure that if FFG will ever release a list of restricted cards that I will follow their suggestions (like I did with the 50 card decks). Why? Because I also play the game according to the rules and the FAQ. Unless their changes get ridiculous and in the way of me and my partner having fun with the game. Then I'd gladly use my own house rules...\n\nLOTR is the first living card game that I've followed from its very first release and I have every expansion so far. It's nice to see the game grow and develop and I think that's the reason why I react a bit allergic to people who talk about serious balancing issues and stuff. It's still really early in the game's life... and we've only seen very little.\n\nAs a former Magic player I'll do what I did with MtG: I play with the cards that are the most fun, experiment with some interesting combos and try to have a good time! As soon as I have a deck that's too good or a combo or card that makes my gaming experience less fun (either because it makes the game to easy or for some other reason), I'm going to stop using it! As simple as that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546211","commentId":546211,"userName":"silverhand77","timestamp":1319391037,"content":"Bohemond said:\n\nI get that Glaurung rubs some people the wrong way. But his basic deck concept is sound and has been since the release of the core set. I only have 2 core sets and always have 4-5 decks at any given time, so my decks aren’t quite as streamlined as Galrung’s. However, I run a spirit lore deck with Beravor, Eowyn and either Dunhere or Elanor that works on a similar concept. It works exceptionally well against most scenarios. When it works, you always draw through the whole of the deck.\n\nIf people really want, I can type up a session report, but the deck tends to have (in terms of turns) long games and with all of the card drawing it will take quite some time to type up.\n\n\n\nThe issue is not that you can't draw the whole deck, it is that it apparently makes every scenario too easy. OK so over the course of the game you might eventually draw the whole deck, but in that time you are being attacked, having to quest having to deal with all sorts of cards coming off the encounter deck. Surely that presents some kind of challenge? and surely you would always be able to use Beravor to draw especially early on. And can you have the same draw mechanic successfully working in a solo game? I'm thinking maybe, but it wouldn't be as efficient so there would be more of a challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546237","commentId":546237,"userName":"Bohemond2","timestamp":1319395134,"content":"The basic strategy works incredibly well in the solo game.  I will try to post a session report on my first attempt at Osgilith to illustrate how the deck works either tonight or tomorrow.  In this particular case, I didn't draw Unexpected courage until around 40 cards in, but it should still let you see how the concept operates in action.  Against easier scenarios (Anduin, Mirkwood, Gullum and Carrock) it almost always secures victory.\n\nedit: deck does alright against rhosgobel, but not as well as it does against the other four."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546259","commentId":546259,"userName":"Big Borg","timestamp":1319398953,"content":"Bohemond said:\n\n I didn't draw Unexpected courage until around 40 cards in, but it should still let you see how the concept operates in action.  Against easier scenarios (Anduin, Mirkwood, Gullum and Carrock) it almost always secures victory.\n\nedit: deck does alright against rhosgobel, but not as well as it does against the other four.\n\n\n\n \n\nPlease stop.  There is no one card that \"almost always secures victory.\" "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546267","commentId":546267,"userName":"silverhand77","timestamp":1319400748,"content":"Big Borg said:\n\nBohemond said:\n\n \n\n I didn't draw Unexpected courage until around 40 cards in, but it should still let you see how the concept operates in action.  Against easier scenarios (Anduin, Mirkwood, Gullum and Carrock) it almost always secures victory.\n\nedit: deck does alright against rhosgobel, but not as well as it does against the other four.\n\n \n\n \n\n \n\nPlease stop.  There is no one card that \"almost always secures victory.\" \n\n\n\nI don't belieeve that Bohemond is saying that just one card almost always secures victory, I believe he is saying that Unexpected courage attached to Beravor as well as cards like Ancient Mathom and Gleowine etc (all cards that allow card draw) do. He is talking about a deck mechanic. One which no-one is by any means forced to use. I say that if it makes the game too easy then don't use Beravor or limt Unexpected courage to 2 copies in your deck at most, or make a choice not to attach them all to Beravor or any other card which exhausts for card draw. Simply put, choose another strategy to play by. The only thing that limits the enjoyment of the game is how we as players choose to play it, The available card pool is big enough that you don't have to build a deck which completely breaks the game. All this whining about how the game is too easy is just annoying and pointless. I would go so far as to say that the game is only too easy if you choose to build decks with an unlimited draw mechanic, my suggested cure for this is limit the draw mechanic and you will find the game much more challenging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546291","commentId":546291,"userName":"Bohemond2","timestamp":1319405850,"content":"Big Borg said:\n\nBohemond said:\n\n \n\n I didn't draw Unexpected courage until around 40 cards in, but it should still let you see how the concept operates in action.  Against easier scenarios (Anduin, Mirkwood, Gullum and Carrock) it almost always secures victory.\n\nedit: deck does alright against rhosgobel, but not as well as it does against the other four.\n\n \n\n \n\n \n\nPlease stop.  There is no one card that \"almost always secures victory.\" \n\n\n\nI was talking about a deck, not a card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546297","commentId":546297,"userName":"Bohemond2","timestamp":1319406531,"content":"silverhand77 said:\n\n \n\n\n\n\n I don't belieeve that Bohemond is saying that just one card almost always secures victory, I believe he is saying that Unexpected courage attached to Beravor as well as cards like Ancient Mathom and Gleowine etc (all cards that allow card draw) do. He is talking about a deck mechanic. One which no-one is by any means forced to use. I say that if it makes the game too easy then don't use Beravor or limt Unexpected courage to 2 copies in your deck at most, or make a choice not to attach them all to Beravor or any other card which exhausts for card draw. Simply put, choose another strategy to play by. The only thing that limits the enjoyment of the game is how we as players choose to play it, The available card pool is big enough that you don't have to build a deck which completely breaks the game. All this whining about how the game is too easy is just annoying and pointless. I would go so far as to say that the game is only too easy if you choose to build decks with an unlimited draw mechanic, my suggested cure for this is limit the draw mechanic and you will find the game much more challenging.\n\n \n\n \n\nFirst of all, I am not whining.  People expressed high degrees of skepticism about the efficacy of a specific deck archetype.  I'm attempting to show them that the deck does, in fact work well.  Nothing about that can evenly vaguely be construed as whining\n\nSecond, I don't think I have ever said that the game is to easy.  I have advocated for a restricted list that would include a very small number of cards (I proposed four).  It would only be for tournament play and anyone could easily ignore it.  And it would improve the overall quality of the game.\n\nFinally, I will say, for the umpteenth time, that choosing not to play with specific cards doesn't solve the problem because of the way the game is developed and tested.  Were not talking about a game that exist in a single moment, but how it evolves going forward.\n\nEDIT:  I would remind people that Nate French has already discussed that a restricted list is a possibility for the game should the need arise, so it should certainly be a topic one can discuss on the boards with generating hostility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546306","commentId":546306,"userName":"Glaurung","timestamp":1319409576,"content":"Bohemond said:\n\nsilverhand77 said:\n\n \n\n\n\n\n I don't belieeve that Bohemond is saying that just one card almost always secures victory, I believe he is saying that Unexpected courage attached to Beravor as well as cards like Ancient Mathom and Gleowine etc (all cards that allow card draw) do. He is talking about a deck mechanic. One which no-one is by any means forced to use. I say that if it makes the game too easy then don't use Beravor or limt Unexpected courage to 2 copies in your deck at most, or make a choice not to attach them all to Beravor or any other card which exhausts for card draw. Simply put, choose another strategy to play by. The only thing that limits the enjoyment of the game is how we as players choose to play it, The available card pool is big enough that you don't have to build a deck which completely breaks the game. All this whining about how the game is too easy is just annoying and pointless. I would go so far as to say that the game is only too easy if you choose to build decks with an unlimited draw mechanic, my suggested cure for this is limit the draw mechanic and you will find the game much more challenging.\n\n \n\n \n\nFirst of all, I am not whining.  People expressed high degrees of skepticism about the efficacy of a specific deck archetype.  I'm attempting to show them that the deck does, in fact work well.  Nothing about that can evenly vaguely be construed as whining\n\nSecond, I don't think I have ever said that the game is to easy.  I have advocated for a restricted list that would include a very small number of cards (I proposed four).  It would only be for tournament play and anyone could easily ignore it.  And it would improve the overall quality of the game.\n\nFinally, I will say, for the umpteenth time, that choosing not to play with specific cards doesn't solve the problem because of the way the game is developed and tested.  Were not talking about a game that exist in a single moment, but how it evolves going forward.\n\nEDIT:  I would remind people that Nate French has already discussed that a restricted list is a possibility for the game should the need arise, so it should certainly be a topic one can discuss on the boards with generating hostility.\n\n\n\n  What is your Restricted list????\n\nThere is some thread where Nate talking about Restricted?????If yes please give me the link.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546332","commentId":546332,"userName":"Kobby","timestamp":1319415600,"content":"silverhand77 said:\n\n \n\nDam said:\n\n \n\n7 to start off with (leaving only 43 to draw through), 9 per turn eventually (8 from Beravor + 1 each turn), that's 50+ cards in 5 turns by my math (9x5 = 45 + 7 = 52). Of course resources are an issue as is drawing all 3 UC, but then again, there is Ancient Mathom for 1 resource -> 3 cards. I've seen 35+ cards with Beravor + 2x UC in my games (vs Carrock of course, there is all the time in the world for hoarding cards during stage 1) in somewhere around 10 turns without fully optimising the draw as well (throwing a few cards for the other deck as well)\n\n \n\n \n\nYep I can see that your maths is correct. However I still don't think you could pull it off 8 consecutive times in a row especially with massing in the mix. You wouldn't have much time to hoard cards in massing.\n\n \n\n \n\nHi Silverhand77, I am the guy who plays with Glaurung and i can assure you we are not cheating.\n\nthe mechanics of the decks was already explained (i deck is protector and other one is control/quest), Massing is tricky in the first few turns (my estimation is 3-4) and after that you can prety much know if you are going to win or not, the trick is letting the Tactics/leadership deck be the 1st player. questing is done depending on draw (but usual quest value is 7-8) depending on how much we lose by we raise out threat (starting threat is 26 for the s/l and 29 for t/leadrship) you never reach 35 so you are safe for a round or 2 before next wave of enemies (Wainriders). starting of combat both snaga come to the spirit/lore deck and tactics/leadership get both wolves (he draws one and one goes automatically as he is the 1st player). Again you play now according to what you drew, for example if s/l deck can deal with the shadow effect Gimly can take an undefended attack (and then he can kill a wolf by himself) if t/l have sneak attack with Gandalf u can play it kill one and def against the other if you have feint or quick strike can use as well. on the spirit/lore front usually you take one or two undefended attacks (if you managed an unexpected courage or an ally and you Eleanor didnt cancel a shadow effect you have a potential of defending both) and then beravor kills one snaga. usually if you survive (8to 9 times out of 10 you will ) the rest is pretty much the same but easier as the staging area threat is lower, as you play your list of ally's is getting bigger and bigger as well as your hand (with the help if Beravor). must of the time after the initial 2-3 turns you wont have to deal with more than one enemy at a time and even if you do the t/l deck have enough sentinels that by then one is out and can help or the s/l dealing with it by itself.\n\n resources issue is addressed by Theodred horn of Gondor and Steward of Gondor.\n\n  once you have Faramir is out its an easy cruise to the end. you don't even need to kill Witch King as both players will have enough questing value to do it in one go (Faramir and/or P.O Lorien makes sure of that).\n\nCheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546358","commentId":546358,"userName":"silverhand77","timestamp":1319423790,"content":"Kobby said:\n\nsilverhand77 said:\n\n \n\nDam said:\n\n \n\n7 to start off with (leaving only 43 to draw through), 9 per turn eventually (8 from Beravor + 1 each turn), that's 50+ cards in 5 turns by my math (9x5 = 45 + 7 = 52). Of course resources are an issue as is drawing all 3 UC, but then again, there is Ancient Mathom for 1 resource -> 3 cards. I've seen 35+ cards with Beravor + 2x UC in my games (vs Carrock of course, there is all the time in the world for hoarding cards during stage 1) in somewhere around 10 turns without fully optimising the draw as well (throwing a few cards for the other deck as well)\n\n \n\n \n\nYep I can see that your maths is correct. However I still don't think you could pull it off 8 consecutive times in a row especially with massing in the mix. You wouldn't have much time to hoard cards in massing.\n\n \n\n \n\nHi Silverhand77, I am the guy who plays with Glaurung and i can assure you we are not cheating.\n\nthe mechanics of the decks was already explained (i deck is protector and other one is control/quest), Massing is tricky in the first few turns (my estimation is 3-4) and after that you can prety much know if you are going to win or not, the trick is letting the Tactics/leadership deck be the 1st player. questing is done depending on draw (but usual quest value is 7-8) depending on how much we lose by we raise out threat (starting threat is 26 for the s/l and 29 for t/leadrship) you never reach 35 so you are safe for a round or 2 before next wave of enemies (Wainriders). starting of combat both snaga come to the spirit/lore deck and tactics/leadership get both wolves (he draws one and one goes automatically as he is the 1st player). Again you play now according to what you drew, for example if s/l deck can deal with the shadow effect Gimly can take an undefended attack (and then he can kill a wolf by himself) if t/l have sneak attack with Gandalf u can play it kill one and def against the other if you have feint or quick strike can use as well. on the spirit/lore front usually you take one or two undefended attacks (if you managed an unexpected courage or an ally and you Eleanor didnt cancel a shadow effect you have a potential of defending both) and then beravor kills one snaga. usually if you survive (8to 9 times out of 10 you will ) the rest is pretty much the same but easier as the staging area threat is lower, as you play your list of ally's is getting bigger and bigger as well as your hand (with the help if Beravor). must of the time after the initial 2-3 turns you wont have to deal with more than one enemy at a time and even if you do the t/l deck have enough sentinels that by then one is out and can help or the s/l dealing with it by itself.\n\n resources issue is addressed by Theodred horn of Gondor and Steward of Gondor.\n\n  once you have Faramir is out its an easy cruise to the end. you don't even need to kill Witch King as both players will have enough questing value to do it in one go (Faramir and/or P.O Lorien makes sure of that).\n\nCheers\n\n\n\nI can see what you mean about how your decks work. But please let me assure you I'm not accusing you of cheating, I just thought you might not be following the rules correctly or perhaps playing by a house rule, But I can see that you're not. Apologies for any misunderstanding around that.\n\nHaving said that, I do feel strongly that enjoyment of the game comes down to how we choose to play it. You guys are absolutely free to include or exclude and cards you want from your decks to make it  harder and more challenging and therefore more enjoyable for yourselves. If your deck doesn't have an ulimited draw mechanic I believe you will find the challenge you are looking for. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546363","commentId":546363,"userName":"jhaelen","timestamp":1319424918,"content":"(Official) restricted or banned lists are only relevant for tournament play. You won't see a restricted or banned list until in an official tournament it becomes obvious to everyone present that a card is broken or so powerful that it unbalances the meta.\n\nFor casual play, players should feel free to create their own list of restricted and banned cards that they stick to when playing (or invent any number of houserules to make the game the most fun for their tastes)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546368","commentId":546368,"userName":"silverhand77","timestamp":1319426143,"content":"Bohemond said:\n\nsilverhand77 said:\n\n \n\n\n\n\n I don't belieeve that Bohemond is saying that just one card almost always secures victory, I believe he is saying that Unexpected courage attached to Beravor as well as cards like Ancient Mathom and Gleowine etc (all cards that allow card draw) do. He is talking about a deck mechanic. One which no-one is by any means forced to use. I say that if it makes the game too easy then don't use Beravor or limt Unexpected courage to 2 copies in your deck at most, or make a choice not to attach them all to Beravor or any other card which exhausts for card draw. Simply put, choose another strategy to play by. The only thing that limits the enjoyment of the game is how we as players choose to play it, The available card pool is big enough that you don't have to build a deck which completely breaks the game. All this whining about how the game is too easy is just annoying and pointless. I would go so far as to say that the game is only too easy if you choose to build decks with an unlimited draw mechanic, my suggested cure for this is limit the draw mechanic and you will find the game much more challenging.\n\n \n\n \n\nFirst of all, I am not whining.  People expressed high degrees of skepticism about the efficacy of a specific deck archetype.  I'm attempting to show them that the deck does, in fact work well.  Nothing about that can evenly vaguely be construed as whining\n\nSecond, I don't think I have ever said that the game is to easy.  I have advocated for a restricted list that would include a very small number of cards (I proposed four).  It would only be for tournament play and anyone could easily ignore it.  And it would improve the overall quality of the game.\n\nFinally, I will say, for the umpteenth time, that choosing not to play with specific cards doesn't solve the problem because of the way the game is developed and tested.  Were not talking about a game that exist in a single moment, but how it evolves going forward.\n\nEDIT:  I would remind people that Nate French has already discussed that a restricted list is a possibility for the game should the need arise, so it should certainly be a topic one can discuss on the boards with generating hostility.\n\n\n\nBohemond, the comment about whining wasn't directed specifically at you. On the contrary ever since I have been reading and contributing to this forum I have always found your posts to be interesting and thought provoking and I appreciate them.\n\nHowever I still don't really understand what you mean about the way the game is developed. As far as I can see, we as players get to choose what we include in or exclude from our decks. So it doesn't matter what cards are produced for player decks because we don't have to use them if we don't want to and if a quest is too easy we can change them.\n\nAlso at least for myself, this is just debate. I have nothing personally against anyone here. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546371","commentId":546371,"userName":"Glaurung","timestamp":1319427317,"content":"silverhand77 said:\n\nKobby said:\n\n \n\nsilverhand77 said:\n\n \n\nDam said:\n\n \n\n7 to start off with (leaving only 43 to draw through), 9 per turn eventually (8 from Beravor + 1 each turn), that's 50+ cards in 5 turns by my math (9x5 = 45 + 7 = 52). Of course resources are an issue as is drawing all 3 UC, but then again, there is Ancient Mathom for 1 resource -> 3 cards. I've seen 35+ cards with Beravor + 2x UC in my games (vs Carrock of course, there is all the time in the world for hoarding cards during stage 1) in somewhere around 10 turns without fully optimising the draw as well (throwing a few cards for the other deck as well)\n\n \n\n \n\nYep I can see that your maths is correct. However I still don't think you could pull it off 8 consecutive times in a row especially with massing in the mix. You wouldn't have much time to hoard cards in massing.\n\n \n\n \n\nHi Silverhand77, I am the guy who plays with Glaurung and i can assure you we are not cheating.\n\nthe mechanics of the decks was already explained (i deck is protector and other one is control/quest), Massing is tricky in the first few turns (my estimation is 3-4) and after that you can prety much know if you are going to win or not, the trick is letting the Tactics/leadership deck be the 1st player. questing is done depending on draw (but usual quest value is 7-8) depending on how much we lose by we raise out threat (starting threat is 26 for the s/l and 29 for t/leadrship) you never reach 35 so you are safe for a round or 2 before next wave of enemies (Wainriders). starting of combat both snaga come to the spirit/lore deck and tactics/leadership get both wolves (he draws one and one goes automatically as he is the 1st player). Again you play now according to what you drew, for example if s/l deck can deal with the shadow effect Gimly can take an undefended attack (and then he can kill a wolf by himself) if t/l have sneak attack with Gandalf u can play it kill one and def against the other if you have feint or quick strike can use as well. on the spirit/lore front usually you take one or two undefended attacks (if you managed an unexpected courage or an ally and you Eleanor didnt cancel a shadow effect you have a potential of defending both) and then beravor kills one snaga. usually if you survive (8to 9 times out of 10 you will ) the rest is pretty much the same but easier as the staging area threat is lower, as you play your list of ally's is getting bigger and bigger as well as your hand (with the help if Beravor). must of the time after the initial 2-3 turns you wont have to deal with more than one enemy at a time and even if you do the t/l deck have enough sentinels that by then one is out and can help or the s/l dealing with it by itself.\n\n resources issue is addressed by Theodred horn of Gondor and Steward of Gondor.\n\n  once you have Faramir is out its an easy cruise to the end. you don't even need to kill Witch King as both players will have enough questing value to do it in one go (Faramir and/or P.O Lorien makes sure of that).\n\nCheers\n\n \n\n \n\nI can see what you mean about how your decks work. But please let me assure you I'm not accusing you of cheating, I just thought you might not be following the rules correctly or perhaps playing by a house rule, But I can see that you're not. Apologies for any misunderstanding around that.\n\nHaving said that, I do feel strongly that enjoyment of the game comes down to how we choose to play it. You guys are absolutely free to include or exclude and cards you want from your decks to make it  harder and more challenging and therefore more enjoyable for yourselves. If your deck doesn't have an ulimited draw mechanic I believe you will find the challenge you are looking for. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nI agree with you. We play now  with Beravur ability as: limit once per turn. Mush more harder and interesting.\n\nBut from my point of view on the game and designers job: The game is good where is all cards good balanced and situations like this is just never happen. So my vote was from beginning on than forum: Hey FFG make your job better be cose you have very good Lotr game with very good idea so please keep ot on good level!!! make more interesting quest , make it more careful and more balanced cose this is they job. From beginning (6 months already) i talk about this crazy unlimited draw!!! OK now every one understand this is not fair and wrong.\n\nNow next case is Northern tracker. In my opinion this card is destroy all fun and purpose of location mechanic in game.Who need to travel if you any way can destroy all location in staging area with 2-3 turns most of the time??? If you have tracker you dont need even look on location game text about  active or travel effect.  I think this also big broken. And game is more interesting and fun when you need to travel and face the location effect. This also make game more hard and im sure we definitely need that cose when you come to certain level of game experience you start to feel boring( game is quite limited for now).And this is wrong!!! When you switch to more proff level game should to give you next level of challenge but here after cool and amazing Osgiliant we start to get quest much more exiting( good Example is Emyn Muil) and Dead marches with DIfficult 5 doesn make me feel exiting as well.\n\nIm sure FFG can to it much better!!!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546413","commentId":546413,"userName":"Bohemond2","timestamp":1319439583,"content":"jhaelen said:\n\n(Official) restricted or banned lists are only relevant for tournament play. You won't see a restricted or banned list until in an official tournament it becomes obvious to everyone present that a card is broken or so powerful that it unbalances the meta.\n\nFor casual play, players should feel free to create their own list of restricted and banned cards that they stick to when playing (or invent any number of houserules to make the game the most fun for their tastes).\n\n\n\nWe already have tournament-only rules in the game, despite the lack of any tournaments.  The 50 card deck minimum is a tournament only rule.  If the designers think that something is unbalanced they can issue a restricted list, even in the absence of a tournament scene.\n\n@Glaurung - You can see a discussion of Nate's interview here http://boardgamegeek.com/thread/707056/nate-french-on-theonering-net [http://boardgamegeek.com/thread/707056/nate-french-on-theonering-net]. He says that the game doesn't need one yet, but a restricted list is an option if he feels the need arise.\n\n@silverhand77 - Sorry if i was over seneative and took comments personally when you did not intend them.  My bad.  I need to develop Glaurung's thick skin.  When thinking about card design, I was talking more about how it affect subsequent encoutner decks, rather than player cards (though that could be an issue as well)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546418","commentId":546418,"userName":"silverhand77","timestamp":1319440405,"content":"Bohemond said:\n\njhaelen said:\n\n \n\n(Official) restricted or banned lists are only relevant for tournament play. You won't see a restricted or banned list until in an official tournament it becomes obvious to everyone present that a card is broken or so powerful that it unbalances the meta.\n\nFor casual play, players should feel free to create their own list of restricted and banned cards that they stick to when playing (or invent any number of houserules to make the game the most fun for their tastes).\n\n \n\n \n\nWe already have tournament-only rules in the game, despite the lack of any tournaments.  The 50 card deck minimum is a tournament only rule.  If the designers think that something is unbalanced they can issue a restricted list, even in the absence of a tournament scene.\n\n@Glaurung - You can see a discussion of Nate's interview here http://boardgamegeek.com/thread/707056/nate-french-on-theonering-net [http://boardgamegeek.com/thread/707056/nate-french-on-theonering-net]. He says that the game doesn't need one yet, but a restricted list is an option if he feels the need arise.\n\n@silverhand77 - Sorry if i was over seneative and took comments personally when you did not intend them.  My bad.  I need to develop Glaurung's thick skin.  When thinking about card design, I was talking more about how it affect subsequent encoutner decks, rather than player cards (though that could be an issue as well)\n\n\n\n@ Bohemond- Its all good mate :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I'm just glad you know I wasn't having a crack at you :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546420","commentId":546420,"userName":"Kobby","timestamp":1319440753,"content":"silverhand77 said:\n\nKobby said:\n\n \n\nsilverhand77 said:\n\n \n\nDam said:\n\n \n\n7 to start off with (leaving only 43 to draw through), 9 per turn eventually (8 from Beravor + 1 each turn), that's 50+ cards in 5 turns by my math (9x5 = 45 + 7 = 52). Of course resources are an issue as is drawing all 3 UC, but then again, there is Ancient Mathom for 1 resource -> 3 cards. I've seen 35+ cards with Beravor + 2x UC in my games (vs Carrock of course, there is all the time in the world for hoarding cards during stage 1) in somewhere around 10 turns without fully optimising the draw as well (throwing a few cards for the other deck as well)\n\n \n\n \n\nYep I can see that your maths is correct. However I still don't think you could pull it off 8 consecutive times in a row especially with massing in the mix. You wouldn't have much time to hoard cards in massing.\n\n \n\n \n\nHi Silverhand77, I am the guy who plays with Glaurung and i can assure you we are not cheating.\n\nthe mechanics of the decks was already explained (i deck is protector and other one is control/quest), Massing is tricky in the first few turns (my estimation is 3-4) and after that you can prety much know if you are going to win or not, the trick is letting the Tactics/leadership deck be the 1st player. questing is done depending on draw (but usual quest value is 7-8) depending on how much we lose by we raise out threat (starting threat is 26 for the s/l and 29 for t/leadrship) you never reach 35 so you are safe for a round or 2 before next wave of enemies (Wainriders). starting of combat both snaga come to the spirit/lore deck and tactics/leadership get both wolves (he draws one and one goes automatically as he is the 1st player). Again you play now according to what you drew, for example if s/l deck can deal with the shadow effect Gimly can take an undefended attack (and then he can kill a wolf by himself) if t/l have sneak attack with Gandalf u can play it kill one and def against the other if you have feint or quick strike can use as well. on the spirit/lore front usually you take one or two undefended attacks (if you managed an unexpected courage or an ally and you Eleanor didnt cancel a shadow effect you have a potential of defending both) and then beravor kills one snaga. usually if you survive (8to 9 times out of 10 you will ) the rest is pretty much the same but easier as the staging area threat is lower, as you play your list of ally's is getting bigger and bigger as well as your hand (with the help if Beravor). must of the time after the initial 2-3 turns you wont have to deal with more than one enemy at a time and even if you do the t/l deck have enough sentinels that by then one is out and can help or the s/l dealing with it by itself.\n\n resources issue is addressed by Theodred horn of Gondor and Steward of Gondor.\n\n  once you have Faramir is out its an easy cruise to the end. you don't even need to kill Witch King as both players will have enough questing value to do it in one go (Faramir and/or P.O Lorien makes sure of that).\n\nCheers\n\n \n\n \n\nI can see what you mean about how your decks work. But please let me assure you I'm not accusing you of cheating, I just thought you might not be following the rules correctly or perhaps playing by a house rule, But I can see that you're not. Apologies for any misunderstanding around that.\n\nHaving said that, I do feel strongly that enjoyment of the game comes down to how we choose to play it. You guys are absolutely free to include or exclude and cards you want from your decks to make it  harder and more challenging and therefore more enjoyable for yourselves. If your deck doesn't have an ulimited draw mechanic I believe you will find the challenge you are looking for. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nsilverhand77 said:\n\nI can see what you mean about how your decks work. But please let me assure you I'm not accusing you of cheating, I just thought you might not be following the rules correctly or perhaps playing by a house rule, But I can see that you're not. Apologies for any misunderstanding around that.\n\nHaving said that, I do feel strongly that enjoyment of the game comes down to how we choose to play it. You guys are absolutely free to include or exclude and cards you want from your decks to make it  harder and more challenging and therefore more enjoyable for yourselves. If your deck doesn't have an ulimited draw mechanic I believe you will find the challenge you are looking for. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nWell, for me the challenge is in the deck building. As I am the one who built both Original Decks ( we evolve them as we play, new scenarios come and new cards are available) and basic strategy of how they should work I take great pleasure in seeing how well they work against any quest even against new quests. Both decks are generic and can work against any quest without the need to change cards (you can min max them even further for each specific quest so they will work even better, but there is no real need for that). for me that was the real challenge, after that its just enjoying the game ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png].\n\n   Glaurung is arguing (and is right ) that we need some more quests like MaO, I believe we all agree that Emyn Muil was a big disappointment.  I dont say that every quest should be lvl 7 or higher but there should be some balance.\n\nCheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546603","commentId":546603,"userName":"Titan","timestamp":1319462360,"content":"I'm not sure why the lack of a restricted list should affect how scenarios are developed. If we take the premise that FFG will come up with original scenarios for tournaments, then what does that have to do with the scenarios that we see in the deluxe boxes and adventure packs? Since these are not tournament level scenarios, they may still to have to be developed as though the list didn't exist. \n\nAs we can all agree, players may or may not follow the list, but if you are designing with it's restrictions in mind, then players who don't abide by it (and who knows how many there will be) may not necessarily enjoy these scenarios. Can FFG take this chance? I think whether they determine Northern Tracker (or any other card) to be a game breaker, they may be stuck with it. Otherwise, they may alienate a substantial portion of their fan base. More so than in other games, FFG may just have to live with anything that is considered overpowered. The fact that you don't have an opponent that checks you or can adapt on the fly might force this. \n\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546661","commentId":546661,"userName":"Bohemond2","timestamp":1319469483,"content":"Do you believe FFG designs and tests scenarios with decks that use a 50 card minimum? I strongly suspect that they do, and I think the game is better for it.  At the same time, I don't think that it makes the game worse for casual players who decide they want to work with 30 card decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546741","commentId":546741,"userName":"Big Borg","timestamp":1319478586,"content":"Bohemond,\n\n \n\nI believe that this thread is pretty much played out.  Great debate.\n\n \n\nSince you come up with great topics where a lot of players participate, please start another discussion.\n\n \n\nGreat stuff!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546755","commentId":546755,"userName":"Titan","timestamp":1319479956,"content":"I think it is a safe assumption that they design with 50 card decks in mind. I disagree that people playing with 30 card decks have a similar experience. 30 card decks just don't have the same depth and versatility as 50 card decks. Even if you do make it work and get to the stronger cards faster, this is the same as playing with restricted cards in a scenario that was not designed for them. The challenge and the fun may be significantly   lessened. Furthermore, I would say that people playing with 30 card decks are a minority. Although, it may be officially a tournament rule only, I think 50 cards is quite widely accepted as the standard. \n\nRestricted cards are quite a different animal. If you are designing regular packs around them, you are essentially forcing casual players to observe more advanced tournament rules or risk having a lesser experience. This simply isn't right. Some may observe them, but some won't. Players will end up with cards that they paid money for and want to use, but have become a hindrance to their enjoyment. As I have said before, I don't have an issue with a restricted list eventually, it may become a necessary evil when the time is right, but that is not now. And certainly not if it is going to be forced on the casual player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=546799","commentId":546799,"userName":"Bohemond2","timestamp":1319485605,"content":"Big Borg said:\n\nBohemond,\n\n \n\nI believe that this thread is pretty much played out.  Great debate.\n\n \n\nSince you come up with great topics where a lot of players participate, please start another discussion.\n\n \n\nGreat stuff!!\n\n\n\nwell said, you are probably right"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54354-powerful-cards-destroying-long-term-game-balance/?do=findComment&comment=548433","commentId":548433,"userName":"Mattr0polis","timestamp":1319799494,"content":"I agree that we are nowhere close to needing a restricted list or banned list yet.\n\nThere are some powerful cards, yes. But there is nothing wrong with that.\n\nThere will always be a top tier of the cards. If you ban/restrict some cards, there will just be the next group of cards that people consistently find to be the most efficient.\n\n \n\nSo, what I'm saying is, save ban/restricting for only when it's absolutely needed, for cards that definitely break the game apart, which we haven't seen yet. Some examples would be like, something that lets us draw 30 cards in a few turns, or some combo that instantly makes questing so high it auto passes each Quest stage the first time, or a way to stop every enemy from entering play or attacking for the whole game. You know what I mean? Stuff that pulls the game off it's tracks.\n\nBeravor, Steward of Gondor, Gandalf, Northern Tracker, these are not those type of cards. Powerful, but not broken."}]}