{"url":"https://community.fantasyflightgames.com/topic/54358-branching-quests/","title":"Branching Quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=538593","commentId":538593,"userName":"Svenn","timestamp":1317999729,"content":"Anyone else think we need these? Passage Through Mirkwood experimented with this idea a little with the two stage 3 cards. I think it would be pretty cool, and really increase playability of a given quest, if they released quests with branching stories.\n\nI'd love to see a quest (maybe PoD) that is an epic several hour quest with a few branching storyline paths. What do you guys think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=538601","commentId":538601,"userName":"Svenn","timestamp":1318000705,"content":"Thinking about this a little more... there are quite a few ways they could even set this up. The obvious are to have the players either randomly choose a card of the next stage, or let the players choose which they want.\n\nBut how about some other ways of going about it as well? Perhaps the previous quest card has multiple objectives, and the next stage depends on which objective was met. For example, the players must complete the normal travel token requirements, but must also either kill a certain enemy/type of enemy or clear a specific location. If the location is cleared the players travel to one card and if the enemy is killed the players travel to a different card (maybe the players have a choice if they've done both).\n\nMan, the more I think about the possibilities for expanding the game the more excited I get. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=538627","commentId":538627,"userName":"mr.thomasschmidt","timestamp":1318003710,"content":" I totally agree with you. There's a thread in this forum about home made cards, page 3 og 4 I think now...some spanish guys have made almost a whole core set/delux expansion volume set of cards. Unfortunally they are in spanish but being translater when they find the time. Anyway, take a look at their cards, they have come up with exactly this :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I think there's about 50 quest cards for the whole campagn with many paths and twists. I so hope they get them translated soon even if they aren't official :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] If you can't find the thread let me know and I'll try and find a link\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=538631","commentId":538631,"userName":"Svenn","timestamp":1318004384,"content":"I know the thread you are talking about. I only briefly glanced at it since they were all in Spanish though, so I didn't realize this was what they did. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Can't wait until they get them translated!\n\nI hope we get some official quests like this. This seems perfect for PoD material."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=538646","commentId":538646,"userName":"marlow4","timestamp":1318005902,"content":"I like the concept.\n\nThey could definitely do something like that with Khazad Dum and that area where there are multiple passages to choose from.\n\nImagine a massive quest designed around choices within the Quest Deck that involves multiple Encounter Decks. Go this way, you'll have to deal with this stuff, but go this other way and you'll be facing this other stuff.\n\nMaybe even an entire Adventure Pack cycle designed around this where each of the first five quests ends in a cliff hanger/choice phase leading into the next quest that's forthcoming. Mirkwood is already close to that since all six packs revolve around a sequence of adventures, they just aren't mechanically linked together in the Quest Deck.\n\nI want to have this game's babies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=538737","commentId":538737,"userName":"xBeakeRx","timestamp":1318030617,"content":"Yeah, this would be a great addition to the game.  The simple answer would be to do it as a simple tree where the player(s) choose different paths.  Players start off with quest card 1.  After meeting token/objective requirements they choose either of 2 paths and either go to quest card 2 or quest card 3.  Depending on the path they choose, different encounter decks and objectives will present themselves to the player.  After completing the token/objective requirements of quest card 2 or 3 the player(s) progress to a final quest card or possibly even a choice of cards.  You could expand this out to a 4-tier scenario where you have another choice of paths from quest cards 2 or 3 that branch out again to a total of 4 different quests, then they all lead to the single, final quest card to finish the scenario.  It would look something like this:\n\n \n\n                              1\n\n                    2                 3\n\n                 4    5           6    7\n\n                              8 \n\n \n\nSo 8 total quest cards with a ton of replay value.  This would obviously require a lot of different encounter decks as well, but a deluxe AP like Khazad Dum could definitely manage it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=539017","commentId":539017,"userName":"ppsantos","timestamp":1318085341,"content":"Choice is good.  A quest where you can choose what \"road\" to take, like in the Fellowship of the Ring, the Fellowship had to decide on how to go to Mordor whether to take the south which would lead them close to Saruman's Isengard or take the mountainous pass of Carahdras.  For the game, another possible example is, say, the party has to cross a dangerous river/body of water.  They could build/buy/search for a boat/raft (quicker, but  corresponding resource token requirements) or take the bridge which is somewhere far (and possibly meet enemies, etc)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54358-branching-quests/?do=findComment&comment=539022","commentId":539022,"userName":"Vyron2","timestamp":1318085881,"content":" imagine the possibilites!!! MEGA campaign, branching quest, where, if you get lost, you just go in circles (but a bit more complicated then HfG) and where your choice even has an impact on the encounter set!!! \n\n \n\nif you travel \"south\" you get more easterlings, if  \"east\" more orcs, etc. etc. ... :F\n\ngive it a good story and I wanna have this game's babies :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}