{"url":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/","title":"Confilct At the Carrock!!!!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538801","commentId":538801,"userName":"silverhand77","timestamp":1318048923,"content":"This is such a hard quest, but my friend and I finally succeeded. I used a Leadership/Lore deck with my heroes being Aragorn, Denethor & Glorfindel, whiel my friend played Spirit/Tactics with Eleanor, Thalin & Legolas. Firstly, there is pretty much no way to win with two players if you are only using one core set. Secondly, Gandalf and the various ways of playing and bouncing him and replaying him again are critical. as is the use of foerst snare on the Trolls. You must also carefully manage your threat and not over quest early on. Our final group score was 63. I'd love to hear other people's experiences of this quest and also any comments you might have on ours :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538831","commentId":538831,"userName":"Dam the Man","timestamp":1318054480,"content":"I do own two Core Sets (split into 4 decks, using all 12 heroes), but CatC has been way easier than HFG for example (which somehow proved easier than Journey Down the Anduin). Haven't yet lost at CatC in three plays and the first time we reached stage two with all four Trolls immediately engaging, two apiece. Killing/engaging Enemies is a lot easier than getting out from under location-clog if you don't have/draw Northern Trackers. And unlike Hill Trolls, you can throw you weak, your poor, your Snowborn Scouts/Westfold Horsebreakers at the Unique Trolls because vs HT your threat would increases even more but a single 0 def, 1hp meatshield is enough to block off an entire 6 attack troll. Key is taking out Louis ASAP, ideally only engaging him and picking him off before any other Trolls engage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538857","commentId":538857,"userName":"Vyron2","timestamp":1318062964,"content":" and how about any solo tips? anyone beating this scenario consistently alone? by playing CORRECTLY :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] (still people out there who think you don't have to quest... only optionally... and with yeah, song of wisdom, now I produce 4 resources with my hero...)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538867","commentId":538867,"userName":"rfh0","timestamp":1318064658,"content":"This quest is extremly hard!! I haven't beat it yet solo but I am still trying! I keep trying different combinations of heros and cards, but I still haven't found the right deck setup. I am hoping they will release new cards that will help out. I think they should release more weapon options or another way to make your characters deal more damage! I know I will eventually beat it!! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538900","commentId":538900,"userName":"guciomir","timestamp":1318069946,"content":"Beating Carrock solo is rather easy if you have good quest/threat management. Just do not go to 2B if you have more than 34 threat and you should be fine (unless you get sacked early)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538915","commentId":538915,"userName":"Vyron2","timestamp":1318070982,"content":" fair enough - that's what I've been doing! but THEN, when the FOUR trolls ALL TOGETHER come to the staging area, you have 8 threat more you have to deal with, not to mention the additional encounter card each quest phase - picking them off 1by1 doesn't work well (ok, dunhere) because by the time you're done with one, your threat is 34 and then all of them attack you... even if you don't get sacked - marsh adder, hill troll or sth else will kill you...\n\n \n\nplease, would you care to elaborate how EXACTLY you manage to kill of the 4 trolls \"singlehandedly\"?? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538916","commentId":538916,"userName":"Vyron2","timestamp":1318071008,"content":"double post, sorry... stupid lag..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538924","commentId":538924,"userName":"Doom1502","timestamp":1318071535,"content":"Just build a deck around threat reduction, put 3 dunedain marks on dunhere and unexpected courage and a gandalf once in a while and youre fine ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI scored -6 with Eowyn/Dunhere/Frodo.\n\n3x Galadrihm's Greeting and 3x Dwarven Tomb and 2x Will of the West to recycel yourd discard pile. Then put Ancient mathoms on the locations while you're in stage one and explore them fast with Northern Trackers. A few more allies and continoued threat reduction (I didn't even had grimbeorn^^)  - proceed to stage 2 when you have enough questing power to compensate the additional 8 threat (faramir!). Explore the carrock as fast as possible and start damaging the trolls with dunhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538928","commentId":538928,"userName":"Vyron2","timestamp":1318071919,"content":" thank you doom :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nthat's what I thought... Dunhere sniping... it's clear, but very boring :S ;-) and also, this is the ONLY combo, I think... any other sphere combo is impossible, I'd reckon... basically it's stalling and then sniping... but then again, I'm telling you, if you get another hill troll, etc, it is near impossible... ;-) esp if you try spirit tactics or leadership lore? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538932","commentId":538932,"userName":"Doom1502","timestamp":1318072203,"content":"Yep, I agree that it's the most boring way ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nA nice thing is having Lore of Imladris and healing Grimbeorn when he has 9 wounds^^ That really helps a LOT.\n\nI beat it with an Leadership/Tactics deck with a score of about 26 or something but I used Gandalf to reduce the threat more than once (Born[e] aloft!)\n\nThrough Imrahil and Legolas (and of course grimbeorn!) I had enough fightingpower to destroy the trolls fast enough and the threat never hit 34."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538936","commentId":538936,"userName":"radiskull","timestamp":1318072441,"content":" I was able to do Carrock solo with a Spirit/Leadership deck.  I used Eowyn, Dunhere, and Theodred.  The key for me was to keep threat low with Galadhrim's Greeting and Gandalf.  Resource acceleration with Dunhere and Steward of Gondor meant I could play whatever I needed.  Song of Leadership on Eowyn makes her resources more valuable (that's who got the Steward), and makes Grimbeorn easy to get.\n\n \n\nThe deck operates by a) buffing Dunhere's attack, b) using Gandalf and Galadhrim's greeting to keep threat low.  I use Will of the West to reshuffle my discard pile once I use a few of those power cards.\n\n \n\nOnce the trolls appear, I will leave them in the staging area and ping them with Dunhere (he needs buffed attack for this).  If I'm able to get Gandalf into play, I will pull a single troll, defend with Grimbeorn, then kill it with Gandalf's come into play ability, Gandalf's attack, and Dunhere.  The strategy requires that you manage your threat and allies, and not move on to the next stage until all pieces are in play.\n\n \n\nIt's tricky, and requires patience, but Carrock is possible solo.  It's also worth noting that I have one Core set, but I do have all the APs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538938","commentId":538938,"userName":"Titan","timestamp":1318072486,"content":"I find the repeated use of Gandalf on this quest is a big key to stave off the elevated threat when the trolls roll into the staging area. I use either Sneak Attack or Born Aloft to keep returning him to my hand. When I play him, I always use his ability to damage Louis first, since you definitely don't want to engage him. Then, I use Gandalf to help with questing. His 4 willpower offsets half of the trolls by himself. I usually engage Morris first, as well, I use Feint, Forest Snare or a cheap ally to block him. That means that after 2-3 turns at most, two of the trolls will be gone. Since you have repeated uses of Gandalf and should have amassed a good number of allies by then, any extra enemies should not be too much of a problem. \n\nThen, I proceed to engage Stuart while dealing with Rupert in the staging area. At this point, things should be far simpler and victory should be in sight. Just keep going until all trolls are gone. A couple of other useful tips are to make sure that your threat is in the mid to low 20\"s when the trolls come into play and if you can get Grimbeorn to add to your arsenal, he is a huge plus. He is a good quester( and you may need him in this capacity at first) as well as a great attacker/defender against trolls. \n\nI have beaten this quest with and without Dunhere. I've also used Eowyn/Gimli/Beravor in a very offensive deck. There's more than one way to skin a cat.........er, troll."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538947","commentId":538947,"userName":"guciomir","timestamp":1318073861,"content":"I just had a game when Eowyn was sacked during the first turn and roasted few turns later leaving me with a ton of unused spirit cards in hand. On the other hand I got steward of gondor on Theodred, plus Theodred's resource ability was building Legolas pool. After a couple of turns I had 3x thorondor eagle in play, radagast, faramir, some dwarves and grimbeorn the old in play. I reduced threat to 31 from 36 with gandalf and I proceeded to 2B. I engaged Louise first and killed it the same turn, but my threat was 35 when next turn started. I replayed gandalf, damaging one of the trolls, quested with gandalf, radagast + pump from faramir, threat went up to around 40. Grimbeorn suffered some damage but second troll was dead. A few turns later the board was clear (however the threat was quite high and I was a little bit afraid), but still the game was won :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=538953","commentId":538953,"userName":"Valyrian Steel","timestamp":1318075724,"content":" I only own one core set and one of each adventure pack and i beat CatC the majority of the time with two players. It's certainly not impossible by any means. Like most of the previous posters have said all ready it's all about threat management and timing on when to advance to stage 2. I will sometimes go quickly if we have a decent hand and try to ambush the trolls and other times you have to wait for Grimbeorn. It's definitely a very fun quest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539005","commentId":539005,"userName":"Vyron2","timestamp":1318083801,"content":" YEEEEEEEEEEEEEEEEEES!!! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] SOLO-MODE:\n\nJUST LOGGING MY VICTORY IN CATC IN!!! MINUS 24!!!!!!!!!!\n\nhow?\n\n1. I only used cards UP TO catc (to get the experience as it would have been, though I already have other APs...)\n\n2. spirit/tactics deck - legolas, dunhere, eowyn - starting threat: 26\n\n3. lowered my threat, kept staging threat in check as to not progress... lowered with gandalf, galadhrim's greeting...\n\n4. then something wonderful happened: near at the end of my deck cycle - I kept all the cards in hand, only used them when needed and beat all other monsters (VP!!!) - the encounter deck blesses me (after it cursed me several times - I just couldn't get bee pastures and oak-wood-grove... so no grimbeorn, but I eventually got him) WITH FOLLOWING COMBO: TWO anduin riverbanks - I used my lorien guides to infinitely explore 1 bank and put it on top of the encounter deck... (really only a math thing)\n\n5. in the end, I only had in my \"deck\" 3x gandalfs, 2x dwarven tomb and 3x galadhrim's greeting and 1x will of the west... so threat reduction EN MASSE!!!\n\n6. then I progressed and killed the trolls in 3 turns, incl Grimbeorn's help\n\n \n\n2,5 h.... so far this deck of mine has beaten all quests (several times) except Dol Guldur... gonna try rhosgobel soon, though I think this will be impossible without healing... :S\n\nJIPEEE!cool.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/cool.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539052","commentId":539052,"userName":"silverhand77","timestamp":1318092113,"content":"So are you playing with two people both playing to decks each?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539060","commentId":539060,"userName":"Vyron2","timestamp":1318093793,"content":" no, SOLO - mode... ONE deck, spirit/tactics..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539113","commentId":539113,"userName":"silverhand77","timestamp":1318110095,"content":"When we played, we used Gandalf for threat reduction only once, the rest of the 5-6 times we played him was for damage, in one turn he did about 20 points of damage to the Trolls. Without that we would have been toast! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] But there is some confusion about whether we played Gandalf correctly, we used Stand & Fight to bring him out of the discard pile but apparently that is against the rules. I can find no proof of this in either the official rules or FAQ. The only reference I have found is in the unofficial FAQ. Can anyone enlighten me?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539149","commentId":539149,"userName":"radiskull","timestamp":1318117878,"content":" How on earth do you get Gandalf to deal 20 damage a turn?\n\n \n\nAlso, the Stand and Fight / Gandalf issue is being discussed in the thread titled \"Stand and Fight rule clarification.\"  Short answer: Nate responded to a rules question privately saying that S&F requires an ally to belong to a sphere.  That hasn't shown up in the official FAQ yet, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539171","commentId":539171,"userName":"silverhand77","timestamp":1318127040,"content":"Gandalf did 20 damage by being played, bounced,played again, bounced again, played again and then played from the discard pile. my freind has corrected me to say that we dealt the remaining 8 damage by playing him once eacnh in the two subsequent turns. Sorry, my  bad. It still  shows he's critical to completing this quest though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539185","commentId":539185,"userName":"radiskull","timestamp":1318132937,"content":" That...is amazing.  I tip my hat to you :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539283","commentId":539283,"userName":"player582283","timestamp":1318159090,"content":"Some thoughts on the topic - As noted, a lot of success in CatC depends on controlling the pace of advancement of the 1st stage. Balance keeping your threat down while not progressing too fast. Think of it as scouting out the area. The lore cards that can negate threat in the staging area after the fact are good for this, the Lore encounter scouts (Denethor and Something Riversong) are great, the Lore mapmaker who can add will with resources, Eowyn with her ability to add 1, Faramir with his addition effect are all helpful. I'm sure I'm missing some, but you get the idea - options to increase your will to bump it to match the threat without going over once you see the threat or the ability to find out what you are up against.  I use Spirit - Leadership heroes (with a splash of Lore) as my primary so I rely heavily on Eowyn and allies like Faramir for pacing.\n\n \n\nMeanwhile, build up assets - allies & attachments in play and events in hand. If you can, build up resources for Grimbeorn - even if they are not leadership, you may get the loc that allows you to use any resource as leadership. Grimbeorn joining the team is very helpful!  Playing leadership with a Steward of Gondor is obviously a help here.\n\nKeep your threat to under 34 (Gandalf and Galadrim's Greeting), and when you have a decent build up, push to stage 2.  Bring down the trolls one at a time and they are not too bad.  Take out Louis first so that you don't get a cascade of threat from his ability if you subsequently do have to take on multiple trolls .  Once he is gone I often have the allies and events to deal with the remaining three and do fine if I'm getting into 34+ threat. For Gondor turns a pack of heroes and allies into troll slayers. (Grimbeorn, Aragorn, Imrahil with a Dunedain mark and On Gondor in play kill a \"fully buffed\"  troll by themselves) The leadership card that readies everyone is a great combo with this. Kill a troll or two for Gondor, ready everyone and kill another since On Gondor is still there!   Remember you can heal Grimbeorn with Lore of Imrahilis if you play it. His ability to defend against multiple trolls and then participate in the attack is great.  Again, Steward of Gondor is a help to get you the resources needed. (and I used to play Theodred, but subbed in Imrahil to pair with Aragorn as I love Imrahil's s versatiltiy)\n\nGetting a hero sacked early can be debilitating.  If you are playing Lore, get and hold onto the Miner who gets rid of a condition.  Don't bring him in until you have a sacked hero or you are killing trolls.\n\nAlso keep questing power handy to try to get rid of the Carrock as soon as possible after it goes active as getting rid of the +1 AT/+1 Def to the trolls is helpful.   Again for me, Eowyn, Faramir and some of the Rohan questor allies are important here. \n\nObviously it does not work every time!  Cards don't come up, an early Sacked or early Heavies like Hill trolls or other nasty creatures can derail it but the tactics above may help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539398","commentId":539398,"userName":"silverhand77","timestamp":1318175201,"content":"Why thank you kind sir :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Though I must admit, it was my friend who did it, as he was playing Spirit/Tactics and therefore had the necessary cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54379-confilct-at-the-carrock/?do=findComment&comment=539480","commentId":539480,"userName":"player582283","timestamp":1318194705,"content":"Silverhand,\n\nYou can win CatC without Gandalf though.  I just did!  Obviously he is a big help in any quest (except for JtR, but even in that one I like his card drawing to try to get to healing).  I just played with my primary-- Aragorn, Imrahil and Eowyn with some Lore mixed in using the tactics I describe above.  The heroes, Grimbeorn and Faramir were key to the win.  In particular having the the lore song and Lore of Imrahilis to heal Grimbeorn helped.\n\nI used Greeting of Galadrim twice (one and recycled with the Dwarven Tomb) to get my threat to 33 with a decent group of allies, including Grimbeorn.  I had already taken out one Hill Troll and seen the second one as a shadow effect.  I pushed to get through stage 1, bringing in the trolls.  I optionally engaged Louis and took him out so that I did not have to deal with all of them getting threat causing attacks.  Next turn after healing Grimbeorn, I killed one additional troll and managed 7 more on another (On Gonder and Ever Vigilant on Grimbeorn).  The turn after the remaining trolls came down Eowyn, Edoras Guide and Imrahil explored the Carrock to get rid of the +1/+1 AT and D.  I killed the remaining two in two more turns.\n\nNot debating the usefulness of Gandalf, just making the point that CaTC can be won solo without him. "}]}