{"url":"https://community.fantasyflightgames.com/topic/54395-archtypes/","title":"Archtypes.  ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=538952","commentId":538952,"userName":"xGaffgarion","timestamp":1318075721,"content":"(first time poster)\n\n \n\nOne post that seems to be missing from the forums (and maybe this is not the place for it) is one regarding solid, tested and theorized archtypes. \n\n \n\nObviously we can just rattle them off without any real testing, but I believe it would be more helpful to newer players, and those looking to play seriously (tournaments etc) to consider what archtypes are currently available and where to look for the best cards to make these archtypes work. \n\n \n\nThe best place to start in our considerations is to think about what the \"winning\" goals of the game are (aside from having fun). Just off the top of my head, consider these,\n\n-Tanking\n\n-Damage\n\n-Support\n\n-Quest\n\n \n\nWhat heroes fill these roles best (currently) what sphere and what cards within that sphere help these heroes complete the goals. \n\n \n\nAs you can see, just with these 4 roles placed up there are lines blurring.  It is almost  certain that some decks can take on multiple roles.  But for the sake of learning why not consider the cards BEST suited to accommodate these roles? \n\nBut before we get too far into this discussion, how about we outline what these roles are; what their goals should be.  Also consider how the roles and the card selection may change based on the number of players.  For the sake of theorizing how about we keep our minds in solo, 2, and 3 player games.  I think we will find as we move into 3 player considerations, that the roles may get more finite.  I think we will also find a better appreciation for the different spheres and how each card may help with completing each task within that \"role\"  \n\n \n\nThis seems like a good jumping off point for now.   I hope to keep this threat updated (with the communities help)  with an ongoing dialog of findings.  Maybe the discourse here will spawn another thread that can include community \"hard facts\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=538981","commentId":538981,"userName":"lleimmoen","timestamp":1318079303,"content":"As far as heroes (only) go, the one sphere that is almost absent is the stand-out questing. Eowyn just stand way high above the rest. Glorfindel is second (more costly, less fragile, less effective) perhaps followed by Aragorn and Imrahil who can quest more freely as they are able to ready for fight too.\n\nAs for the obvious combatants, Dunhere is special but not always reliable, some quests he is almost useless. Legolas and previewed Boromir seem to be the most effective fighters with Gimli there too (but for me he is little tricky). Aragorn and Imrahil can fight well.\n\nAnd then there are those who generate resources (cards included). Beravor is there the biggest thing as she can turn a game upside down and inside out. Theodred is very effective with money, more situational is Gloin perhaps.\n\nThose are just my few bits..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=539000","commentId":539000,"userName":"Eyedunno53","timestamp":1318082652,"content":"Frodo is amazingly defensive.  Despite his low numbers, his ability makes him hard to kill.  Drop a few Dundain Warnings on him and he excells even more (asuming you have a source of Leadership, of course).  Denathor also makes a good defender, and if you dont defend with him, you can always use his ability at the end of the round to help prepare for the next round.\n\nEowyn is a questing beast.  And there are a few cards that increase her willpower, making her even more so.\n\nGood attacking heros is tricky.  Gimili is good, but you have to be very careful.  Sure he can hit hard with one life left, but if you flip the wrong treachery card... Personally I like Legolas.  He is a decent attacker, he has ranged so you can help your partner(s) if you have them, and he ability helps to make him a help with questing.  That said, I tend to use Aragorn more, just because I use the Leadership cards more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=539010","commentId":539010,"userName":"xGaffgarion","timestamp":1318084441,"content":"Nice evaluation of the heroes so far. \n\n \n\nPerhaps to add a bit more focus to the discussion consider this:\n\n \n\nIf you agree with the 4 listed archtypes (tank/support/quest/damage) what combination of heroes (and sphere additionally) will allow you to play that role most effectively.  In this discussion we are playing with 2-3 players. \n\n \n\nI know that the quest selected plays greatly on which heroes you use,  but lets agree for this discussion that playing against the build of the quest is not our primary deck building concern.  For now it is just straight hero selection and card selection with our archtype in mind.\n\n \n\n \n\nYour contributions are appreciated guys, thanks for the great community!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=539030","commentId":539030,"userName":"plueschi2","timestamp":1318087118,"content":" One thing I often consider is this (sort of a subcategory of hero types):\n\n \n\nIs the hero focused in his role or variable? Eowyn is a focused quester, Legolas a focused attacker and Denethor a focused Defender, while heroes like Aragorn, Prince Imrahil and Boromir are much more variable. So far I tend to choose more focused heroes when playing with multiple players, but go more into variable when playing solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=539076","commentId":539076,"userName":"Eyedunno53","timestamp":1318098241,"content":"I agree completely.  I play mostly solo.  Thus why I use Aragorn over someone like Gimli.  I like my cards to be able to do double duty whenever possible.  The exception to this, in my play anyway, is questing.   I use Eowyn.  Questing is very central to the game.  You HAVE to quest well, or your threat will climb and you'll lose.  On top of that, if you dont quest at all you'll never progress towards finishing the scenarios.  All of them require that you quest to some extent.  So, I kinda value questing over other things at times.  I'm sure, if I played with a partner or two, I'd feel differently.\n\nAs for your archtypes, yeah, I can get behind those. How much you value each depends on many factors.  For my money, I would put questing and attacking before defense and support.  You can win the game without support.  And defense is nice, but it doesn't clear the monsters.  If monsters build up, you're still gonna lose (unless they come out with a card that lets you block ALL attackers).  So, questing is needed to clear locations and finish the scenario, and attacking is needed to keep the monsters to a reasonable level. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=539318","commentId":539318,"userName":"Kiwina","timestamp":1318164378,"content":"So the four archtypes you propose are Tanking, Damage, Support, and Questing.  They sound like good archtypes to me.  Here are a few thoughts on one.  I hope to get more put up later.\n\nTanking\n\nThis archtype deals with defending enemy attacks, and reducing damage taken by those attacks.  No one sphere has a great emphasis in Tanking, but spirit has a serious lack of tanking cards.  Tactics has the most tanking cards, while leadership and lore have some good cards for tanking as well.\n\nHeroes:\n\nThe heroes that I use for defending the most are Gloin, Aragorn, and Gimli.  Denethor may also be added to this Archetype because of his superior defense score.  In my opinion, none of these heroes really belongs to only the Tanking archtype, but they all have abilities or stats to qualify them as \"good\" defenders.\n\nGloin - He works well as a defender only because of his ability. He gains 1 resource for each damage token placed on him.  Without some kind of healing support this is a very limited, and risky, ability to consistently use.  With healing support, Gloin becomes, arguably, the best tanking hero in the game.\n\nGimli - Gimli, like his father, gains benefits from taking damage; he gains 1 attack for every damage counter on him.  He also sports a defense of 2 and 5 HP making him one of two heroes that can survive an attack from a Hill Troll.  At the beginning of a game Gimli will function very well as a tank, but as the damage on him increases, his use will be shifted into the Damage archtype where I think he truly belongs.\n\nAragorn - Aragorn works well as a defender because he has the Sentinel keyword.  He also has 2 defense and 5 HP, allowing him to survive as a defender longer.  However, his strength is in being able to quest and do something else.  This fits him more into the Questing archtype than anything else.\n\nDenethor - He, like Aragorn and Gimli, doesn't fully belong as a Tanking hero.  His one redeeming quality as a tank is his 3 defense, which no other hero has, however, Denethor only has 3 HP which means he can't take damage often.  His ability is also extremely useful, but it requires him to exhaust, so he can't be used as a defender.  I would say Denethor has one foot in the Tanking archtype and one in the Support archtype.\n\nSpheres:\n\nTactics - Of all the spheres tactics currently boasts the most player cards used for defending.  In the allies they have Gondorian Spearman, Winged Guardian, and Landroval with the keyword Sentinel.  Winged Guardian has the highest defense stat in the game, and Gondorian Spearman will deal damage when declared as a defender.  Beorn also has 3 defense and 6 HP, making him a difficult defender to defeat.  The event cards include Feint, Thicket of Spears, Swift Strike, and Stand Together.  Blade Mastery is also used an optional defending or attacking card.  Tactics also sprots the mighty Citidel Plate which increases a hero's HP by 4.  This is an excellent tanking attachment.\n\nLore - Lore is usually a Support sphere, but they also have some good tanking cards.  A Burning Brand cancels all shadow effects, which is invaluable for a defender.  Gildor Inglorion is an ally that has 3 defense and 3 HP.  This makes him an amazing defender, however he fits into many roles because of his 3 willpower and his ability.\n\nLeadership - Leadership doesn't have many cards for defending either.  The main card is Dunedain Warning that will increase any hero's defense by 1.  Snowborn scout can also be considered a partial tanking card, because it is frequently used as a defender when you don't want to defend with any of your main defenders.\n\nSpirit - I can't think of any real tanking cards in spirit.  The closest thing is Northern Tracker, with 2 defense, but he is definitely a quester before all else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=539432","commentId":539432,"userName":"Untergeher","timestamp":1318181696,"content":"I found a combination of Eowyn (quest), Legolas (attack) and Frodo (tank) to be very effective. The second player uses Thedred (quest), Aragorn (allrounder) and Denethor (tank). So far this mixture has worked must of the time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54395-archtypes/?do=findComment&comment=539484","commentId":539484,"userName":"player582283","timestamp":1318195406,"content":"I believe an additonal archetype is needed - Jack of All Trades or Versatile.  They can fill multiple roles well (and possibly in the same turn) - maybe not as well as specialist in those roles,  but they do a pretty good job.\n\nAragorn and Imrahil are prime examples.  Both can quest pretty well (especially throwing in Aragorn's access to +2 WP attachment).  However, they are easily readied to do a solid job as tanks or damagers.  Again, not the best for either of those, but solid.  They excel as they can fill multiple roles in the same turn.  Boromir will fit this slot also although his low WP will limit his questing usefulness.\n\nBeravor is another versatile hero.  She is well rounded enough to quest, defend or help with damage.  Her ability also falls in the specialist role.   Glorfindel is similar with his 3 WP, 3 AT and 5 HP and ability, though his 1 D hurts him as a tank. "}]}