{"url":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/","title":"Stand and Fight rule clarification.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539061","commentId":539061,"userName":"silverhand77","timestamp":1318094068,"content":"Stand and Fight reads:\n\nAction: Choose an ally with printed cost of X in any player's discard pile. Put that ally into play  under your control. (The chosen ally can belong to any sphere of influence),\n\nMy question is,  can this card be used to bring Gandalf back? I know he doesn't belong to a sphere, but Stand And Fight says \"can\" belong, not \"must\" belong to any sphere of influence???\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539062","commentId":539062,"userName":"Vyron2","timestamp":1318094143,"content":" no - see FAQ... Gandalf does not belong to a sphere, unfortunately, stand and fight is useless for him... same with radagast..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539074","commentId":539074,"userName":"Titan","timestamp":1318097738,"content":"Yeah, many of us misunderstood this card for months. The wording in it is as poor and vague as there is in the game. Even when it was cleared up, that clarification was made elsewhere, it is yet to be made officially on this site. Definitely a drop of the ball by FFG here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539095","commentId":539095,"userName":"Eryx_UK","timestamp":1318103819,"content":"That's just silly. Why shouldn't you be able to bring Gandalf back with that card? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539104","commentId":539104,"userName":"silverhand77","timestamp":1318108621,"content":"I can find anything in the FAQ. which part are you referring to?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539107","commentId":539107,"userName":"silverhand77","timestamp":1318109349,"content":"I can only find reference to it in the unofficial FAQ. There is no mention of it in the official one that I can see. I won't play the game by unofficial rules  that haven't been endorsed by FFG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539114","commentId":539114,"userName":"ppsantos","timestamp":1318110185,"content":"There is no official ruling here about here.  All those who say you can't use it on Gandalf are basing it on unofficial \"opinion\", I might add.  Until it appears in the official errata, I also will use Stand and Fight on Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539119","commentId":539119,"userName":"Bohemond2","timestamp":1318110703,"content":"As for why it doesn't, the wording on Stand and Fight restricts the cards to non-neutral targets. You need to have a sphere, and Gandalf doesn't.\n\nYou can say it's just an opinion, but it came from Nate French.  Since he designed the game, his opinion carries a fair bit of weight.. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539127","commentId":539127,"userName":"silverhand77","timestamp":1318112605,"content":"It doesn't say that on the card and it doesn't state it in the official rules or FAQ. In my humble opinion it is unacceptable for Nate to post rules and errata on these forums without amending the FAQ prior to posting. It causes confusion and disagreement. I understand he is the creator of the game and therefore his decision goes, but he needs to make it official. Therefore until it is official, I will be using Stand and Fight on Gandalf and other Neutral allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539136","commentId":539136,"userName":"silverhand77","timestamp":1318115133,"content":"Bohemond said:\n\nAs for why it doesn't, the wording on Stand and Fight restricts the cards to non-neutral targets. You need to have a sphere, and Gandalf doesn't.\n\nYou can say it's just an opinion, but it came from Nate French.  Since he designed the game, his opinion carries a fair bit of weight.. \n\n\n\nThe wording states (again) as follows:\n\nAction: Choose and ally with a printed cost of X in any player's discard pile. Put that ally into play under your control. (The chosen ally can belong to any sphere of influence.)\n\nIn what way does the above wording signify a restriction to non-neutral targets? the operative word is CAN not MUST. My argument is that a chosen ally can belong to any sphere, but doesn't necessarily have to because the operative word is not MUST or similar, therefore a neutral target is also applicable. If Neutral cards are not valid targets then the card should state as much. Its not like there's not enough room on it.\n\nNate's opinion does carry a fair bit of weight there is no dispute there, but he can't just post rules and errata on a forum - as I've already said it needs to be official.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539140","commentId":539140,"userName":"Dwnhmcntryboy","timestamp":1318115927,"content":" I am picking up some vehemence against Nate and I think we should avoid that. There have been mistakes made. Things have been mishandled. Lets leave it at that and play by what ever rules you feel like until an official FAQ is issued. The Unofficial FAQ is a strong guideline filled with educated guesses that for the most part we can all agree on.\n\nThis is one issue I disagree on but as there are no real tournaments my way I don't have to worry about it so we play how our group feels it should be played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539147","commentId":539147,"userName":"radiskull","timestamp":1318117710,"content":" The ruling from Nate came in response to a rules question submitted through the form on this site.  Whoever received Nate's response chose to share that response on the BGG forums.  It's my strong belief that the updated FAQ will come out at the end of the Mirkwood cycle, before Khazad-Dum is released.\n\n \n\nPart of the delay in releasing the FAQ, in my opinion, is that the design team needs to see which questions are, in fact, frequently asked.  It's also possible that Nate made a mistake in his response to this person, and hasn't put it in the FAQ in order to make the game as a whole as consistent as possible.  Regardless, I would prefer a FAQ that isn't updated weekly; that the document is somewhat stable.  I don't think it's a good thing to be updating a document as important as that one a couple of times a week, especially if the ramifications of rulings haven't been thought out (and might be reverted).\n\n \n\nNate's issued an opinion about the matter, but it was issued privately, so give that whatever weight you think it deserves.  If it is an honest erratum/clarification that needs to be given to the player base, it'll show up in the next FAQ revision.  If it was an off-the-cuff ruling that isn't going to stick, ultimately, well, I think you'll see that in the next FAQ, too.  For the time being, play the card however you want.\n\n \n\nIn my personal opinion, a plain reading of the card supports its use on Gandalf.  I see the arguments on the other side, but I don't find them compelling.  I, too, am eagerly awaiting the next rules revision. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539152","commentId":539152,"userName":"Titan","timestamp":1318118179,"content":"In my opinion, if this card cannot be used on neutral allies, then this makes it the leading contender for errata in this game. Errata which should make it clear that it cannot be used on neutral allies. The current wording is misleading and in no way conveys what the designer's intents is supposedly for it. \n\nAs for any vehemence against Nate French, I don't think the problem is with him, but with FFG's system. It is a bit frustrating that a combo that was well known in these forums, was never publicly addressed here, despite the fact that it was mentioned and discussed many times. We found out about it third hand. The person who received the clarification posted it elsewhere and then someone brought it here. There is something simply wrong with that. FFG should strive to have a more open line of communication with the players on their own official website. Why FFG employees are not allowed to readily post in these forums is a mystery to me. I think this could go a long way towards alleviating issues like this one, where someone receives a clarification but posts it elsewhere.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539165","commentId":539165,"userName":"silverhand77","timestamp":1318125608,"content":"I'd like to state for the record that I have no personal beef  with Nate. I'm simply saying that eventhough he's the lead designer, he can't just make up rules on the fly. It needs to be done in an official way. I agree with the sentiment that the FAQ document shoud be stable and not ammended every week. However, it should be done when such an opinion is given."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539168","commentId":539168,"userName":"silverhand77","timestamp":1318126463,"content":"I'd like to state for the record that I have no personal beef  with Nate. I'm simply saying that eventhough he's the lead designer, he can't just make up rules on the fly. It needs to be done in an official way. I agree with the sentiment that the FAQ document shoud be stable and not ammended every week. However, it should be done when such an opinion is given."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539175","commentId":539175,"userName":"pumpkin","timestamp":1318128846,"content":" \n\nHi Silverhand77,\n\nif you only play by rules endorsed by FFG, which is a fair enough stance to have, and FFG don't post direct answers to this forum, why did you bother to post your question here?\n\nFFG's only \"endorsed\" answers are in their official FAQ and the rulebook, unfortunately.\n\nYou'll get nothing other than opinion and educated guesses, or posts where forumites have asked specific rule questions and had a direct response from FFG on these boards. As you don't play by these rules made up on the fly anyway, I'm not sure you'll get what you are looking for from a rules question posted to the forum, although to be honest I'm a little confused about what you were hoping for?\n\nNearly everything in the unofficial FAQ has been put there after either a lot of debate by some of the well known and respected members of this board (several of whom have already posted to this thread) or by clarification of specific rule questions to FFG, which the poster who asked the question then sent the response to the board rather than keeping it to themselves.\n\nThere is a lot of good stuff in there, but as you say it is all unofficial and not endorsed by FFG, so ignore it all if you prefer.\n\nI for one though, am glad that FFG take the time to respond to rule questions directly and that Nate chips in with responses on other boards, which eventually make their way here.\n\nIt can be frustrating when something like the clarification on Stand and Deliver comes along after months of release, but each little unofficial clarification helps most of us take than new information and apply it to new cards going forward (for instance also applying the ruling to Radagast, even though the specific question relating to Gandalf).\n\nThe situation isn't perfect by any means, but FFG obviously have strict policies on staff regularly posting directly to these boards (although I have seen it happen on occasion, to clarify one thing or another, but not normally rules questions) and FAQs are only going to be updated periodically, which we have said we all agree with anyway.\n\nThis is the situation we are in.\n\nI hope you continue to have fun with the game anyway!\n\nCheers\n\nPumpkin\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539198","commentId":539198,"userName":"lleimmoen","timestamp":1318137430,"content":"Titan said:\n\nYeah, many of us misunderstood this card for months. The wording in it is as poor and vague as there is in the game. Even when it was cleared up, that clarification was made elsewhere, it is yet to be made officially on this site. Definitely a drop of the ball by FFG here.\n\n\n\nWhilst I agree the words on the card do not correspond with what is meant, I actually like the real meaning, it makes the game more interesting you cannot play Gandalf via this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539205","commentId":539205,"userName":"HilariousPete","timestamp":1318139030,"content":"Yes, I also wouldn't have thought that S&F excludes neutral allies. And I think this deserves an errata, not just a clarification (due to \"can\" <-> \"must belong to a sphere\"). But the points made by pumpkin and radiskull and others are valid, currently there's no tournament, and the official FAQ shouldn't get updated every three days (although I'm desperately waiting for the new version, too ;-), so if you don't like the \"errata by unofficial channels\", just play like S&F wasn't corrected, it's ok. And to defend FFG a bit: Nate is really fast and kind in answering rules questions, while we're in lack of an updated FAQ.\n\nPerhaps one reason for the S&F errata/clarification issue is, that Gandalf is stronger than FFG wanted him to be. Did you notice the 2nd picture on http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=1 [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=1] ? There, Gandalf has a cost of 6. I guess originally there were debates on wether Gandalf should be a 5 or 6 cost card, and finally the decision was made for 5, and now Gandalf is too strong, and the S&F change is one way of limiting Gandalfs power. (Of course that's now total speculation by me, but it could be the case)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539230","commentId":539230,"userName":"silverhand77","timestamp":1318145937,"content":"Hi Pumpkin,\n\n \n\nI just want to make it very clear that I'm not angry or attacking anyone at all. I fully respect everyone's opinions and fervently agree that there is heaps of awesome and valuable stuff on this forum and others like it. The reason that I made the original post was because I couldn't find anything in the rules or FAQ that either supported or forbade the way I play Stand and Fight. I was curious to see if others had the same experience and what their thoughts were. However I did find it a bit frustrating  when I read Bohemond's post in terms of the way he said that the wording restricts the cards from non-neutral targets. To me it read like he was making a blanket statement and that, that was the official ruling simply because someone posted a response from Nate on a forum. The truth is it's not an official rule and it's not in the FAQ. It is however, in the unofficial FAQ.  I'm confident that it will eventually end up in the FAQ. It is my experience that most people I have played any sort of game with, especially role playing, TCG (like Magic The Gathering) LCG and other games of similar genre prefer to play by the official rules, sometimes there are house rules which are generally discussed and agreed upon before the game starts, but mostly the games are played by the official rules. I would also like to state that if and when this particular rule is addressed, I will happily abide by whatever decision FFG makes.\n\nI still love this game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539562","commentId":539562,"userName":"pumpkin","timestamp":1318215641,"content":"silverhand77 said:\n\n \n\nHi Pumpkin,\n\n \n\nI just want to make it very clear that I'm not angry or attacking anyone at all. I fully respect everyone's opinions and fervently agree that there is heaps of awesome and valuable stuff on this forum and others like it. The reason that I made the original post was because I couldn't find anything in the rules or FAQ that either supported or forbade the way I play Stand and Fight. I was curious to see if others had the same experience and what their thoughts were. However I did find it a bit frustrating  when I read Bohemond's post in terms of the way he said that the wording restricts the cards from non-neutral targets. To me it read like he was making a blanket statement and that, that was the official ruling simply because someone posted a response from Nate on a forum. The truth is it's not an official rule and it's not in the FAQ. It is however, in the unofficial FAQ.  I'm confident that it will eventually end up in the FAQ. It is my experience that most people I have played any sort of game with, especially role playing, TCG (like Magic The Gathering) LCG and other games of similar genre prefer to play by the official rules, sometimes there are house rules which are generally discussed and agreed upon before the game starts, but mostly the games are played by the official rules. I would also like to state that if and when this particular rule is addressed, I will happily abide by whatever decision FFG makes.\n\nI still love this game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\nHi,\n\nGetting frustrated is fine, but I think it is a bit unfair to say that Nate's actions cause disagreements and confusion. Disagreements have been pretty much avoided, and I'm not sure there is any confusion.\n\nSome people will choose to play by Nate's suggestion and others will play by their own ruling until the FAQ or errata is made offical, both of which is ok for those involved.\n\nLet's say Nate saw your post and decied to react to it and decided he would stop answering questions other than through the offical FAQ; I for one think the community would be worse off in that situation, just compare how many questions and answers are in the unofficial FAQ (either the thread or the excellent PDF that is floating around the WWW) compared to the official FAQ, and besides, we got Chieftain Ufthak right before they did!\n\nI understand that you felt frustrated because you thought posters were telling you something official when actually it wasn't, but to some posters it pretty much is official, it's just waiting to be added to the next official FAQ update\n\nGlad you are enjoying the game anyway!\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539628","commentId":539628,"userName":"Titan","timestamp":1318232151,"content":"lleimmoen said:\n\nTitan said:\n\n \n\nYeah, many of us misunderstood this card for months. The wording in it is as poor and vague as there is in the game. Even when it was cleared up, that clarification was made elsewhere, it is yet to be made officially on this site. Definitely a drop of the ball by FFG here.\n\n \n\n \n\nWhilst I agree the words on the card do not correspond with what is meant, I actually like the real meaning, it makes the game more interesting you cannot play Gandalf via this.\n\n\n\n\n \n\nYeah, I personally have no problem with the card being played in this way, either. Just the wording, that's all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539632","commentId":539632,"userName":"pumpkin","timestamp":1318233125,"content":"Titan said:\n\nlleimmoen said:\n\n \n\nTitan said:\n\n \n\nYeah, many of us misunderstood this card for months. The wording in it is as poor and vague as there is in the game. Even when it was cleared up, that clarification was made elsewhere, it is yet to be made officially on this site. Definitely a drop of the ball by FFG here.\n\n \n\n \n\nWhilst I agree the words on the card do not correspond with what is meant, I actually like the real meaning, it makes the game more interesting you cannot play Gandalf via this.\n\n \n\n\n \n\n \n\nYeah, I personally have no problem with the card being played in this way, either. Just the wording, that's all.\n\n\n\nNot now we have borne Aloft, eh!?!?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=539641","commentId":539641,"userName":"Titan","timestamp":1318234257,"content":"pumpkin said:\n\nTitan said:\n\n \n\nlleimmoen said:\n\n \n\n \n\n \n\nNot now we have borne Aloft, eh!?!?\n\n \n\n\n\n\n \n\nBorn Aloft certainly helps in that regard, although I would like to think that I would still have the same opinion, even if it wasn't around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=566128","commentId":566128,"userName":"snaggrriss","timestamp":1323520451,"content":"where are you k- tom?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54404-stand-and-fight-rule-clarification/?do=findComment&comment=566129","commentId":566129,"userName":"snaggrriss","timestamp":1323520537,"content":"where are you K-Tom?"}]}