{"url":"https://community.fantasyflightgames.com/topic/54418-gotta-love-journey-down-the-anduin/","title":"Gotta Love Journey Down the Anduin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54418-gotta-love-journey-down-the-anduin/?do=findComment&comment=539182","commentId":539182,"userName":"xBeakeRx","timestamp":1318131968,"content":"Ran through a 2-player JDtA scenario today...man that quest can be a beast sometimes!  Here's what happened during setup/first turn:\n\nSetup with 1 card per player:\n\nFlock of Crows (surged into a Pursued by Shadow)\n\nDul Guldur Orcs\n\nThen we added the Hill Troll to staging area...\n\n \n\nQuesting Phase:\n\nMisty Mountain Goblins\n\nSecond Hill Troll...\n\n \n\nSo basically, we were fighting 2 orcs, a flock of crows, and 2 Hill Trolls on our second turn.  While we were trying to fight off all these enemies, locations started piling up in the staging area.  Luckily we were able to kill the first Hill Troll and Forest Snare the other troll so that we could quest.  Took us a while to move on to Quest 2A since we had to dedicate all our resources to questing and couldn't kill the snared Troll.  Once we finally got to 2A, we started really getting swamped with locations, first turn there we got a Gladden Fields, The Brown Lands, and The East Bight.  Man, having The East Bight and The Brown Lands on the board together is such a pain to get rid of because you have to quest The East Bight which takes 6 progress to explore and The Brown Lands just sits there contributing 5 threat to the staging area.  By the time we finally started making headway we had to reshuffle the encounter deck and got hit with all those nasty Necromancer's Reach, Evil Storm, and Pursued by Shadows again.\n\nOur score didn't turn out too well (74), but at least we managed to limp our way through, battered and beaten.  Just goes to show you that even though you can feel comfortable with a given quest, the encounter deck can still throw some nasty things your way every once in a while.\n\n \n\n "}]}