{"url":"https://community.fantasyflightgames.com/topic/54413-help/","title":"HELP","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54413-help/?do=findComment&comment=539146","commentId":539146,"userName":"Dwnhmcntryboy","timestamp":1318117086,"content":" Kay guys I am stuck in this mindset that I must use spirit in every deck in order for it to be a good solo deck. I need to break this habit but the more i look and try to build a deck the more I cannot see a way around it. Help me out gimme decklists or a site to go to or something. I have a killer Rohan Deck built and I love it but need something else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54413-help/?do=findComment&comment=539148","commentId":539148,"userName":"xBeakeRx","timestamp":1318117722,"content":"Gimli/Gloin/Thalin...\n\nBilbo/Aragorn/Legolas...\n\nBeravor/Theodred/Imrahil...\n\nI dunno, I'm just throwing out random stuff"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54413-help/?do=findComment&comment=539489","commentId":539489,"userName":"Puzzle2","timestamp":1318197549,"content":"xBeakeRx said:\n\nBeravor/Theodred/Imrahil...\n\n\n\nThis is actually the deck I have had the most success with. The resource generation of Leadership matched with the draw power of Lore means after a few turns you should have a hand full of cards and the ability to play anything you want.\n\nWhile Spirit is great for threat management, you really only need to keep it to a level where you can handle the encounter deck. Multiple Gandalfs and Sneak Attacks will allow you to reduce your threat by a total of 30 throughout the play of this deck, which is more than enough. Buff up Theodred for questing and use Snowbourn Scout to help eliminate pesky locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54413-help/?do=findComment&comment=539657","commentId":539657,"userName":"Untergeher","timestamp":1318237004,"content":"We have a deck that uses Theodred / Aragorn / Denethor as starting heroes and a corresponding mix of leadership and lore cards. Theodred and Aragorn do the questing, while a readied Aragorn attacks (or defends) and Denethor is either used for defending or for manipulating the encounter deck.\n\nThe steward helps generating resources for Leadership and you can put down a lot of allies real quickly. Sneak attack a Gandalf or two inbetween and get Faramir on the table and you should be fine, threat- and quest-wise. Also: the Dunedain marks have proven to be really useful!\n\nThe lore part of the deck can be customized for the individual decks. Throw in some miners of the iron hills if you wanna get rid of sacked! cards (or caught in a web), throw in some healing effects for Rhosgobel or you can include secret paths for location heavy quests. And don't forget Gleowine for some extra card drawing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54413-help/?do=findComment&comment=539675","commentId":539675,"userName":"Maniacske","timestamp":1318238969,"content":"Build an eagle deck and go against the Return to Rhosgobel scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54413-help/?do=findComment&comment=539875","commentId":539875,"userName":"Dwnhmcntryboy","timestamp":1318259300,"content":" Thanks for the input. I think I am going to build Tactics/Leadership. Dunno If I wanna run Dwarves though. Will try it and see."}]}