{"url":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/","title":"Quest Difficulty and Final Scores... any relation?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539330","commentId":539330,"userName":"GhostWolf69","timestamp":1318165916,"content":"Just played a game of Emyn Muil... and I have to ask...\n\nI know the Scoring system has taken a lot of flak from the community and I agree that it is rather weak... but now with Emyn Muil it seems we are adding yet another dimension to this.\n\nOne would think that the Difficulty of any given scenario would have some kind of bearing on how high you could score... (or how \"low\" you could score, as it were) at least was my thinking before Emyn Muil... now... I'm not so sure.\n\nMaking Victory Points (a very high such) part of the Requirement to finish the game and stacking the Encounter Deck so full of them that you can barely stand up... sort of tilts the relation ship between Difficulty and Scoring... at least I had a hunch there was such a relation ship.\n\nWe ended up with 32 victory points after our first game. Even with one dead Hero we scored an average of 28 points per player thanks to that... and it's impossible to make it without at least 20 vp's.... even that a sum I've never seen before.\n\nWhat do you guys think about this? Have you reflected upon it?\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539359","commentId":539359,"userName":"guciomir","timestamp":1318169311,"content":"Forget about the points, they are completely worthless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539377","commentId":539377,"userName":"radiskull","timestamp":1318172018,"content":" The only use points have, as far as I can tell, is to tell how you're doing as compared to other attempts with the same quest, with the same decks, and with the same number of players.  That's about as far as it goes.  Even comparing scores with other players isn't meaningful unless both are running Spirit, or both are not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539503","commentId":539503,"userName":"Puzzle2","timestamp":1318200347,"content":"guciomir said:\n\nForget about the points, they are completely worthless.\n\n\n\nI agree. When you look at all the quests they are simply pass/fail. You don't actually win any of the current quests by reducing your threat to a certain level. The reason to reduce your threat is to manage the encounter deck better, which makes threat reduction more of a game mechanic rather than a scoring mechanism.\n\nTo be honest I think they made a mistake by creating this \"score\" system. I realize they probably added it because there is a certain demographic of players who like to measure levels of success and a score of some kind is required to do this. Personally I am not this type of player. Going back to the player archetypes FFG posted in May I am much more of a Pippin or Bilbo, interested in thematic decks and weird mechanics not simply victory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539530","commentId":539530,"userName":"guciomir","timestamp":1318206634,"content":"As you pointed out, there are players who like to count points and having lower score gives them satisfaction. But this is only for them and for noone else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539535","commentId":539535,"userName":"Glaurung","timestamp":1318207418,"content":"Actually ss we can see not much players like the current score system. Im personally also dont like it. So maybe with time they will replace it or develop some another system. Still on the tournaments is only 1 thing how you can determine the winner. But maybe can be better......."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539564","commentId":539564,"userName":"xBeakeRx","timestamp":1318216648,"content":"I actually dont mind the scoring system for myself, personally.  I like being able to track how well I did on a particular quest and the scoring system does that to a certain degree.  I believe with some tweaks scores will reflect how well a team did more accurately.  They need to find a way to minimize the effect threat has on final score to alleviate the Galladriam's Greeting/Dwarven Tomb/Will of the West cycle that denegrates the scoring system.  I just got done with a 2-player game where I could have drawn it out for another 10 turns and lowered mine and my partner's threat all the way down, but we didn't want to draw the game out and waste time just for an epic score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539583","commentId":539583,"userName":"Rashley","timestamp":1318219308,"content":"Like most people, I stopped using the scoring system quite early on.  Hanging around just to reduce your threat level seemed artificial.  When I started making my own scenarios, a couple used a simple Minor/Moderate/Major victory system nicked from other games.  For example:- In my 'Saurons Campsites' scenarios, the aim was to find and search as many 'Gladden Field' locations as you could.  In the 'March of the Trolls' the 4 'Carrock' trolls were added to the encounter deck with the 2 'Hill Trolls'.  You had to destroy as many trolls as you could.\n\nThis type of graded victory system could be used in future scenarios.  You then decide if it is safe to try a little longer to do an extra difficult task.  No scoring system will ever be perfect as there are just too many variables, but some sort of player decision to risk a bit more for a better result would be nice.  Time should be a problem.  The longer you stay out in dangerous territory must be a risk, not a chance to arbitarily reduce threat.  Threat reduction is a necessity during the quest, but not a way to show you have 'done better'.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539608","commentId":539608,"userName":"Eryx_UK","timestamp":1318226188,"content":"I use it but mainly because I'm a solo player for the most part, and it's nice to try and beat that score where I can. I don't see it as anything important to the enjoyment of the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539640","commentId":539640,"userName":"Titan","timestamp":1318233978,"content":"Puzzle said:\n\n \n\n \n\n \n\nI agree. When you look at all the quests they are simply pass/fail. You don't actually win any of the current quests by reducing your threat to a certain level. The reason to reduce your threat is to manage the encounter deck better, which makes threat reduction more of a game mechanic rather than a scoring mechanism.\n\nTo be honest I think they made a mistake by creating this \"score\" system. I realize they probably added it because there is a certain demographic of players who like to measure levels of success and a score of some kind is required to do this. Personally I am not this type of player. Going back to the player archetypes FFG posted in May I am much more of a Pippin or Bilbo, interested in thematic decks and weird mechanics not simply victory.\n\n\n\n\n \n\nI'm personally much more interested in winning against a quest, though I certainly enjoy combos and mechanics. But even then, I find no use for the point system. It is simply so irrelevant to how well you may have done that I don't see how even competitive players derive anything from it. Stalling turn after turn to lower your score is simply ridiculous. My own preference would be to see a scoring system based on the number of turns. That way, the person who was the most efficient and aggressive and finished the game in the least amount of turns wins. \n\nAt any rate, I'm not even sure that a scoring system is necessary. This game seems to be far more geared towards casual playing than competitive. If we ever have tournaments, they may still be of secondary importance. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539654","commentId":539654,"userName":"GhostWolf69","timestamp":1318236562,"content":"I guess I'm the only one here who use the point system then.\n\nI agree with you all that it certainly has its flaws. And I do NOT encourage stalling just to lower the score.\n\nWe DO however sometimes lower our threat's with Gandalf and such just to get a better End Score.\n\nAnd we DO keep track to see how well we can do on certain quests.\n\nI Also compare to Community Average on the Quest-Logger.\n\nDoing this we know what to expect in terms of final score, was it good, was it bad? etc.\n\nAnd we also got a feeling for how much is \"good or bad\" depending on Difficulty.\n\n(Number of players goes without saying)\n\nBut Emyn Muil.... sort of breaks that. I get the feeling that this can only be compared to itself and not to other Quests of the Same Difficulty. Since you will certainly have a whole bucket full of VPs.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539669","commentId":539669,"userName":"Dam the Man","timestamp":1318238334,"content":"I play to win, score be dam(ned). I do tally up my scores for games I win, but have never and will never hold off from ending the game to use a threat reducer next turn. Most of the time don't even bother healing up heroes even if I can for an extra 2 or 3 better score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539684","commentId":539684,"userName":"Puzzle2","timestamp":1318240020,"content":"Dam said:\n\nI play to win, score be dam(ned). I do tally up my scores for games I win, but have never and will never hold off from ending the game to use a threat reducer next turn. Most of the time don't even bother healing up heroes even if I can for an extra 2 or 3 better score.\n\n\n\nThis is the approach I take. I don't disregard the scoring system, in fact like GhostWolf I am an avid Quest Log user. I just don't look for ways to maximize the final \"score\" and instead focus on different card combos to reach a victory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539724","commentId":539724,"userName":"Kiwina","timestamp":1318245113,"content":"I use the Quest Log like Wolf and Puzzle.  I would like to see a community average for each individual quest, because that's the most accurate measurement.  I agree that the scoring system isn't perfect, and I would like to see it be refined a little, but how would they do it without adding in an extra counter?  That's one of the things threat does.  It increases every turn, thus raising your score every turn.  The scoring system also seems more geared towards multi-player games, and not solo.  Perhaps it's just because I only use one core set, but it's no small task to pull both GG, a Dwarven Tomb, and a Gandalf when you have 50 cards to go through.  And when your score is increasing by 2-4 each turn, stalling to draw another threat reducing card can be counter productive.  I think it does what it's supposed to.  If I beat a quest easily, my score is lower than the time the quest nearly killed me.  Now if I was able to get a lower score when I almost die compared to the time I breezed through the same quest, I would definitely say the scoring system was crap.  As it stands now, I think it functions, not perfectly, but it functions well enough.\n\nIn regards to how they determine a difficulty level; I thought it was a combination of what starts in the staging area, and how nasty the cards in the encounter deck are."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539732","commentId":539732,"userName":"ppsantos","timestamp":1318245425,"content":"radiskull said:\n\n The only use points have, as far as I can tell, is to tell how you're doing as compared to other attempts with the same quest, with the same decks, and with the same number of players.  That's about as far as it goes.  Even comparing scores with other players isn't meaningful unless both are running Spirit, or both are not.\n\n\n\nIf that's the case then there would be a problem in tournament scoring as they will be comparing scored points to determine who's the winner among players playing same quest but with different players, decks, and player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539746","commentId":539746,"userName":"Svenn","timestamp":1318246370,"content":"On the subject of scoring... I've been trying to come up with a good alternate scoring system, but it's tough.\n\nWhat about something where higher is better though? What are the important elements that should contribute to the score? I've got:\n\n * Remaining heroes/life on heroes\n * Number of turns\n * Quest difficulty\n * Victory Points\n * Threat, to an extent\n * Number of players\n\nThe current scoring system takes all of these except for number of turns and quest difficulty into account in some way. Is there any other variable that we could use? If we're just using the same things to calculate score it's not going to be much different than the current system.\n\nIf we want to get complicated we could do something like:\n\n(Quest Difficulty x 10) + (VP) - (# Turns) - (threat cost of dead heroes) - (# damage tokens on living heroes) - (threat) - (10 x # players)\n\nOf course, this is still somewhat similar to the current scoring system. It does incorporate quest difficulty and number of players/turns (although number of players may be unfairly weighted). It still suffers from the fact that delaying the game to score VP and reduce threat can be beneficial... although not AS beneficial. You could add in unspent resources maybe, but that also lends itself to delaying the game for more points.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539769","commentId":539769,"userName":"Kiwina","timestamp":1318248505,"content":"Svenn said:\n\n \n\nOn the subject of scoring... I've been trying to come up with a good alternate scoring system, but it's tough.\n\nWhat about something where higher is better though? What are the important elements that should contribute to the score? I've got:\n\n * Remaining heroes/life on heroes\n * Number of turns\n * Quest difficulty\n * Victory Points\n * Threat, to an extent\n * Number of players\n\nThe current scoring system takes all of these except for number of turns and quest difficulty into account in some way. Is there any other variable that we could use? If we're just using the same things to calculate score it's not going to be much different than the current system.\n\nIf we want to get complicated we could do something like:\n\n(Quest Difficulty x 10) + (VP) - (# Turns) - (threat cost of dead heroes) - (# damage tokens on living heroes) - (threat) - (10 x # players)\n\nOf course, this is still somewhat similar to the current scoring system. It does incorporate quest difficulty and number of players/turns (although number of players may be unfairly weighted). It still suffers from the fact that delaying the game to score VP and reduce threat can be beneficial... although not AS beneficial. You could add in unspent resources maybe, but that also lends itself to delaying the game for more points.\n\n \n\n \n\n \n\nI really like the idea of quest difficulty playing a part in the scoring system.  I'm not sure I really like making extra players affect your score since the score gets harder to improve when you have more players anyway.  \n\nThe way that algorithm is set up, the scores are all going to be really low or in the negatives, unless it's a really good score.  What if you left it as lower is better?  Maybe something like:\n\n(total threat of all players) + (# of damage tokens on living heroes) + (threat cost of dead heroes) + (# turns) - (VP) - (quest difficulty x 2)\n\nAdding # turns to the equation won't fix the stalling issue, but it will discourage it more.  I still feel like raising your threat is supposed to function as the turn counter, but that is also where the main issue is.  Multiplying the quest difficulty by two gives it more weight than a victory point card. (unless it's Passage through Mirkwood)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539793","commentId":539793,"userName":"Bohemond2","timestamp":1318251034,"content":"While it mitigates problems with the current scoring system, the basic flaws of the system have not been addressed. The scoring system still privileges a certain deck archetype, (recursive threat reduction) at the expense of everything else. As it stands, you can win various scenarios with multiple deck archetypes. Until we find a way to create a scoring system that allows for multiple archetypes to compete with each other, the entire scoring project is a bust.\n\nIs it a better system? yes. But you are just plugging holes in a boat that still can’t float.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539801","commentId":539801,"userName":"Kiwina","timestamp":1318251601,"content":"I started looking at threat reduction, and how it ultimately accommodates stalling to affect the score depending on how many players are in the game.  Once you get to 3 and 4 players, stalling is generally more detrimental to your overall score than just finishing the game.  The only way to beneficially stall in a 3 or 4 player game is to spam Gandalf using Sneak attack at least twice each turn, and that is a hard strategy to maintain.  If FFG makes their tournaments 3 or 4 player teams there should be no issue with the scoring system as is, outside of the luck of the draw, but that exists in every card game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539807","commentId":539807,"userName":"Bohemond2","timestamp":1318252102,"content":"I haven't crunched the numbers, but let's assume your supposition is correct, that the prosposed scouring system might function in the current environment for three and four player games.\n\nHowever, the system itself is still broken.  It works in the current environment because we have two threat reducing cards, and the one that is easiest to play recursively (Gandalf), is unique.  But, as the card pool grows, additional threat reducing cards will allow the problem to return to the fore. Again, its a patch on a system that is fundamentally flawed.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539811","commentId":539811,"userName":"Svenn","timestamp":1318252852,"content":"Yeah, I just tossed that together without actually calculating a score. I did it after and realized the negatives problem.\n\nSo let's remove number of players because that's kind of built in already.\n\nIf threat is a problem we could remove that completely. Another option would be to set it up such that you can't do better than your starting threat score wise. If your threat was 0, and your starting threat was 29... you count 29 instead. Not a great solution, but it negates quite a bit of the effect of threat reduction.\n\nAgain, I think the first thing to do is decide all the important variables that relate to your performance.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539827","commentId":539827,"userName":"Bohemond2","timestamp":1318254034,"content":"In an effort to not be complete negative-nelly, I will say that capping threat scoring at starting threat is one of the best ideas I have seen.  It would create a very interesting bidding mechanic in selecting your characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539833","commentId":539833,"userName":"Kiwina","timestamp":1318254825,"content":"Since threat reducing cards have such a powerful effect on the scoring system FFG will probably have a very limited number of threat reducing cards.  I doubt that we'll see another threat reducing card until after the dwarrowdelf cycle, unless they start releasing a lot of player cards that require you to raise your threat.  So far FFG is one for one on their threat reducing vs. threat raising cards (Gandalf and GG/Frodo and Boromir), and the threat raising cards aren't limited in their use.  Not to mention Boromir's discarding ability.  That may do a lot of damage, but your overall score will take a hit of 11 and you only get 2 resources a turn from that point on.\n\nYes, scoring threat using a minimum of your heroes threat cost isn't a bad idea.  That way threat can still affect the score, but using threat reduction just to lower your score will have a limit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539849","commentId":539849,"userName":"Svenn","timestamp":1318256193,"content":"I'd still like to fit difficulty in... so maybe we could use the default formula, put a minimum value on the threat of your starting value, and subtract 2xdifficulty level.\n\nI'd still like a way to normalize scores across number of players. As it sits the more players, the higher your score. We could also track individual player scores within a game (using the same formula). Maybe make the score in team games the average score of all players in the game, thus putting the score on equal level with a solo game while keeping the integrity of the formula.\n\nHrm, if we can come up with a formula that everyone agrees upon I could potentially toss together an unofficial Quest Log for anyone who wants to use these. My website [http://tabletopgeeks.com] is set up so I can create an infinite number of sub sites... so I could look into putting up sub section specifically for all this. I'd want it to have more details as well... like tracking not only your heroes but the heroes of other players in the game, or the decks used.\n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539859","commentId":539859,"userName":"Bohemond2","timestamp":1318257444,"content":"Svenn said:\n\n...if we can come up with a formula that everyone agrees upon...\n\nhave you been to the internet before gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539866","commentId":539866,"userName":"Svenn","timestamp":1318258273,"content":"Bohemond said:\n\nSvenn said:\n\n...if we can come up with a formula that everyone agrees upon...\n\n \n\nhave you been to the internet before gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n\n\nHaha, good point. Well, how about if we can come up with a formula that enough people agree upon... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539923","commentId":539923,"userName":"Kiwina","timestamp":1318261900,"content":" \n\nTaking the average of all the players and calling that the score could allow for a fairly balanced comparison of each quest.  I looked at the community averages on the Quest Log, and the average score per player was 30-35.  So overall it could be consistent.\n\nI think quest difficulty should be included as well.\n\nIf we went with the default formula, used a minimum value for threat, and subtracted double the difficulty level as you proposed the formula would look like this:\n\n(Threat [with a minimum of heroes' threat cost] + Threat cost of dead heroes + Damage on heroes + # of turns - VP - (Quest difficulty level x 2)) /# of players = The game score\n\nI think turns should also be counted and added to the score, so I put that in the equation too. It would discourage stalling to lower your score because it would only be effective for a few turns, and it would be completely useless if you've got 4 players.  \n\nCurrently tracking individual scores before the average will be difficult because VP go to the team, not an individual player.  The difficulty level would also function as guaranteed VP basically.\n\nHere are a few things I notice about this.\n\n1) If you are comparing your score with teams of the same size then dividing the score by the number of players won't change anything.  It's an extra step that isn't needed.\n\n2) If you are comparing scores from the same quest then subtracting the difficulty level also doesn't change anything.\n\nI bring up 1 and 2 because in tournament play the teams were supposed to be the same size and the quest should be the same for everyone.  However, one of the nice things about averaging out the score is that you could have different sized teams at tournaments.  The other nice thing is that you can compare scores of different quests.  Your best score could come from a three or four player game as easily as it could a solo game.  I guess I was pointing 1 and 2 out because they are redundancies that don't need to be included, but I like them.  By adding a couple \"redundancies\" you add a lot more flexibility.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539943","commentId":539943,"userName":"Svenn","timestamp":1318264084,"content":"I'm not 100% sure we need turns included because of threat, but it might not be a bad idea to have it. I guess it's more consistent than threat.\n\nI was thinking that for team games each player scores himself as if it were a solo game, with every player counting the VPs and such for themselves. Then the team score is the average of those scores. I was thinking this over doing a full team score and dividing by number of players because if you add the VPs to the team score, for example, and then divide by the number of players, you are changing the actual value of the VPs. The same thing happens with the number of turns when you divide...\n\nLet me do some quick calculations using a fictional situation (I'm just making up numbers for quick testing):\n\nPlayer 1 - 1 dead hero (threat 9). 5 damage tokens on heroes. 29 starting threat, 38 ending threat.\n\nPlayer 2 - No dead heroes. 7 damage tokens on heroes. 25 starting threat, 20 ending threat.\n\n16 turn game. Quest difficulty 7. 8 VP.\n\nMethod 1:\nTeam Score (Total Score Divided by Num Players) = (63 + 9 + 12 + 16 - 8 - 14)/2 = 39\n\nMethod 2:\nPlayer 1's score = 38 + 9 + 5 + 16 - 8 - 14 = 46\nPlayer 2's score = 25 + 0 + 7 + 16 - 8 - 14 = 26\nTeam Score (Average Player Scores) = (46+26)/2 = 36\n\nI think I like method 2 better. In method 1 you get a good average of the threat, dead heroes threat, and damage... but the effect of turns, VPs, and difficulty is cut in half. Plus you can get an idea of how each player did on their own.\n\nI like it so far. You can compare quests with any number of players and still have meaningful numbers. Delaying the game makes your score worse except in some cases where you might wait 1 turn to play a gandalf to hit your minimum threat or something, but that's negligible.\n\nIt's still difficult to compare quests directly this way, but I think it's better than the current setup. Again, if I set up an unofficial quest log that people used with these scores you could still compare your scores on individual quests or with specific heroes or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539950","commentId":539950,"userName":"Kiwina","timestamp":1318265195,"content":" I like method 2 better as well.  I looks cleaner.  If the difficulty level is subtracted from each player, I don't think we need to double it.  You also may be right about the turns.  Having a minimum cap on threat may be enough, and it saves players from having to keep track of one more thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539957","commentId":539957,"userName":"Svenn","timestamp":1318265866,"content":"Yeah, I suppose doubling the difficulty is unnecessary. It will be a very minor score adjustment though, which I guess isn't too bad. However, a difficulty 3 and difficulty 7 quest will only vary by 4 points, which is about 1 VP card. :-/ Is that really enough for difficulty you think?\n\nI'm torn on the turns thing. I don't like the idea of trying to track turns... but it still lends itself to the idea of stalling to get your threat to the minimum level before finishing. I suppose with the minimum level it's not as big a deal though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539967","commentId":539967,"userName":"Kiwina","timestamp":1318266716,"content":"That's a good point about the difficulty.  Only 4 points doesn't seem like enough.  In which case doubling is better.\n\nIt may just come down to seeing the system in action to see if doubling is too much or if we do/don't need to count the turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539983","commentId":539983,"userName":"Svenn","timestamp":1318268535,"content":"Kiwina said:\n\nThat's a good point about the difficulty.  Only 4 points doesn't seem like enough.  In which case doubling is better.\n\nIt may just come down to seeing the system in action to see if doubling is too much or if we do/don't need to count the turns.\n\n\n\nI'm torn on this as well. Doubling it gives it a fair amount of weight, but at the same time that means scores for harder quests can be quite a bit better. With the scores averaging somewhere in the 30s or so I'd guess (probably lower without the number of turns), that means 4 points is somewhere in the range of 13% increase in score... That seems about right I'd say. Doubling it would mean more than a 25% change in score just for playing a harder difficulty quest.\n\nSo yeah, don't double it. It gives some weight to the difficulty without making it TOO much of the score. This way you can compare scores between quests more reliably I think.\n\nSo, new scoring system:\nThreat [with a minimum of heroes' threat cost] + Threat cost of dead heroes + Damage on heroes - VP - Quest difficulty level = new score\nFor multiple players, calculate each player's score individually then average.\n\nThis is a minimal amount of changes from the base formula (just the minimum threat value for scoring and adding in difficulty) but it looks like it should work well. The minimum threat serves a dual purpose of stopping players from simply delaying the game for more points by cycling threat reduction cards, plus it makes picking the weaker heroes give the possibility of a lower score. Adding quest difficulty makes comparing quests a little bit more fair (but still far from perfect considering differences in encounter decks, number of VP cards, etc).\n\nThe multiplayer scoring setup gives individuals a good idea of how they did in a particular game compared to the team, as well as allowing you to compare the scores of various size teams more accurately.\n\nAnything we are missing? The one thing that's left is the possibility of delaying the game to cycle through the deck in order to get all the VP cards out of it. Not as big of a deal as the threat thing I'd say, but still a bit annoying. Unless we went back to adding in number of turns, which requires the players to do some additional tracking during the game, I'm not sure how to change that. Number of turns also adds more of a spread between quests of different lengths, which is a negative effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539996","commentId":539996,"userName":"Svenn","timestamp":1318270012,"content":"I posted this over on BGG to see if we can get some more feedback on it: www.boardgamegeek.com/article/7624261#7624261 [http://www.boardgamegeek.com/article/7624261#7624261]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=539998","commentId":539998,"userName":"Kiwina","timestamp":1318270234,"content":"Svenn said:\n\nAnything we are missing? The one thing that's left is the possibility of delaying the game to cycle through the deck in order to get all the VP cards out of it. Not as big of a deal as the threat thing I'd say, but still a bit annoying. Unless we went back to adding in number of turns, which requires the players to do some additional tracking during the game, I'm not sure how to change that. Number of turns also adds more of a spread between quests of different lengths, which is a negative effect.\n\n\nI wouldn't worry about cycling through the deck as much.  The risk/benefit ratio is too high on most quests, so I'd imagine that sort of thing will exist more as an anomaly than anything else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540012","commentId":540012,"userName":"Svenn","timestamp":1318272085,"content":"Here is another thought... how about tracking number of turns but NOT putting it in the basic formula. Keep that as a separate number for comparison as well.\n\nSo, you have 2 games with the same score, but one game took 10 turns and the other took 15. Clearly the 10 turn game is the better one, and this doesn't hurt the formula or skew scores too much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540047","commentId":540047,"userName":"Lenbo","timestamp":1318279472,"content":"Just a thought about the scoring system:\n\nDoesn't taking into account damage on heroes encourage a healing playstyle? Not all decks have access to the ability to heal heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540055","commentId":540055,"userName":"Cletus","timestamp":1318281125,"content":"Lenbo said:\n\nJust a thought about the scoring system:\n\nDoesn't taking into account damage on heroes encourage a healing playstyle? Not all decks have access to the ability to heal heroes.\n\n\n\nMy thoughts exactly. I could definitely see the same problem cropping up as players delay to heal characters up before scoring. It could never be as bad as it is now, but I can definitely see it.\n\nPersonally I just feel that Hero health should be removed from score - consider double citadel plate-wielding Gimli as an example, I'd either have to cycle my deck for a heal (forcing me to include heals in the  first place) or lose a dozen points.\n\nI'd also like to see Threat removed from scoring altogether  - some of the low threat Heroes are very, very good at what they do (Eowyn) and you're already penalized by getting high threat by the game itself, through loss of control of Staging as well as losing the game. I agree that this will make it less of a  chore to reduce threat and cycle to 0, but people will still cycle to their minimum under this system.\n\nIn fact the only aspect of the scoring system I like is the VPs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540063","commentId":540063,"userName":"Svenn","timestamp":1318281509,"content":"Well, you could also just not take damage. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThere are a few reasons threat was such a big problem. First of all, it is by far the most significant portion of the score. It ranges from 1-50. Most things only affect score by a few points. The other thing is that there are only 2 cards to deal with threat. Oh, and one more thing... threat increases naturally every turn. Damage is something that is more controlled by the player in who gets it.\n\nAnyway, damage is a minor portion of the formula, and there are enough ways to control it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540073","commentId":540073,"userName":"Cletus","timestamp":1318283190,"content":"Honestly, I don't even know if it's possible or worth it. With threat and damage - and even VPs as noted - as a factor people will cycle their decks and scores will still be meaningless.  Same with hero death - people will delay the game for a rez when possible. So under this system we'd have what we have now - less, sure, for not quite as wildly different results, but it would still be the same. As far as I can see the only way to score the game without penalizing people for their preferred playstyle or deck construction would be to include an individual scoring system for each scenario that did away with the numbers and scored people on objectives achieved or \"hard modes\". Carrock without Grimbeorn, Osgiliath with a Witch King kill under your belt, etc.\n\nI'm not trying to be negative and I (obviously) agree that scoring needs changing but all I'm seeing from this solution is a kind of band aid, I don't think it would actually solve the problem. Just an opinion though, I'm glad somebody's taking a good long serious look at it and I'd be happy to try it out and see if I'm wrong!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540086","commentId":540086,"userName":"Svenn","timestamp":1318286373,"content":"Sure, you can delay the game to heal up a hero, but you're gaining what, 3 points? Whereas with the old system you could drop 30+ points by taking your threat to 0. Also I don't think we have to worry as much about someone cheesing a healing deck for the lowest score possible.\n\nYeah, this is definitely not perfect, but it really negates a massive score difference simply because you cycled your deck for threat for 3 hours. Also, this is why I proposed a score + turn number setup where you can see just how long it took to complete without letting that influence the primary score. If you see someone with a score of 28 and 35 turns played versus someone with a score of 33 and 12 turns played... I'd say the latter was a far better score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540087","commentId":540087,"userName":"Lenbo","timestamp":1318286705,"content":"Cletus said:\n\n \n\nHonestly, I don't even know if it's possible or worth it. With threat and damage - and even VPs as noted - as a factor people will cycle their decks and scores will still be meaningless.  Same with hero death - people will delay the game for a rez when possible. So under this system we'd have what we have now - less, sure, for not quite as wildly different results, but it would still be the same. As far as I can see the only way to score the game without penalizing people for their preferred playstyle or deck construction would be to include an individual scoring system for each scenario that did away with the numbers and scored people on objectives achieved or \"hard modes\". Carrock without Grimbeorn, Osgiliath with a Witch King kill under your belt, etc.\n\nAgreed. \n\nThe simplest measure I can think of for gauging how well you did is amount of turns. Generally speaking, if you were able to beat a scenario, regardless of threat, or damage on heroes, and beat it quickly, you probably did very well.\n\nWe could also take into account how much resources spent (the less, the better) enemies defeated (the more, the better), and victory points. \n\nSome kind of formula like this:\n\nTurns + Engagement cost of enemies defeated + VPs - Resources spent\n\nSomething like that. I didn't give it too much thought, but what do you guys think?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540095","commentId":540095,"userName":"Svenn","timestamp":1318289394,"content":"Well, I see a few problems with this. For one thing, is a higher score better or a lower score better? If it's a higher score, then why does number of turns add to the score instead of subtracting? If it's lower, why does VP and engagement cost of enemies increase the number instead of lower it?\n\nThat aside, you still have the problem of someone delaying the game to repeatedly kill enemies increasing their score. By engagement cost of enemies do you mean the threat level at which they attack? I don't think that's a great gauge, and it also inflates the numbers a ton. If you mean the threat value, that makes more sense, but again you can theoretically cycle the deck forever gaining points. As long as you get more than 1 point a turn you're outdoing the turn cost to your score. Also, what about locations? If you leave them out you're missing half of the game in the score. If you add them, that's just another thing to inflate scores as you delay.\n\nThese scores aren't normalized by number of players either. A game with more players has to deal with more threats per turn, thus increasing their score far more than a game with less players.\n\nThe other big problem I have with something like this is you are asking the player to track 3 more things WHILE they are playing the game. Turns is not too bad to track, resources is going to require either lots of tokens or some pen and paper, and cost of enemies is going to require a lot of tracking (especially when re-shuffling). Personally, I'd like to keep the amount of extra stuff that players need to track to a minimum.\n\nNumber of turns in itself is not a bad method of measurement, but as I noted above it is going to vary wildly between quests making the score only applicable to that specific quest really. It is also one more thing to track. It is also somewhat accounted for in terms of threat levels, but it can be negated that way.\n\nAdding up every single enemy cost is easily exploitable and is way too much to be tracking. On top of that, what about treacheries? They can be just as, if not more, devastating than an enemy. How would you track that?\n\nWhile these ideas are great in theory, I think in practice they would be just as exploitable and still have a score that doesn't mean much, especially in comparison to anything but the same quest with the same number of players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540100","commentId":540100,"userName":"Lenbo","timestamp":1318290280,"content":"Svenn said:\n\nWell, I see a few problems with this. For one thing, is a higher score better or a lower score better? If it's a higher score, then why does number of turns add to the score instead of subtracting? If it's lower, why does VP and engagement cost of enemies increase the number instead of lower it?\n\n\n\nYeah, after I posted I saw the flaws in the equation and lack of explanation.\n\nHere's a slightly more thought out equation (higher the score, the better the score):\n\nEngagement cost (threat level at which they attack) of enemies defeated + VPs + Number of Locations successfully explored through questing + Treachery cards revealed through questing - Resources spent - Number of turns taken\n\nThis should now make a little more sense, and encompass all of the oppositions players face. It rewards players for taking down enemies, exploring locations, and dealing with treachery cards. It also takes into account how much you had to spend in order to win, and how many turns you took.\n\nWhat do you think? I know it's a lot to keep track of, but then, as we all know the game needs a better way for us to gauge how well we did, while not discouraging certain strategies or encouraging degenerate/exploitable behavior.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540151","commentId":540151,"userName":"Kiwina","timestamp":1318302641,"content":"This actually encourages stalling more than FFG's system does.  People will just get to a point where they can maintain the staging area, and they will proceed to kick the snot out of every enemy that comes out of the encounter.  Thalin would become everyone's favorite hero when Eastern Crows are in the encounter deck.  Not only will he counter their surge he also gives you an instant 30 points to your score, and that 30 points gets shuffled back into the encounter deck to appear again later and give you even more points.\n\nThe scoring is also imbalanced.  Treachery cards are often the most evil cards in the encounter deck, but they give you one point while enemies like the Black Forest Bats will give you 15.  Would victory point enemies give you the victory points and the points for their engagement cost or just one of the two?\n\nScoring this way may not reward threat reduction, but it still encourages players to prolong their quest for a better score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540165","commentId":540165,"userName":"jhaelen","timestamp":1318305299,"content":"Scenario difficulty (and #players) has absolutely no place in the scoring system because the sole reason for the scoring system is to determine a winner in a tournament situation. And in a tournament the number of players and the scenario are set.\n\nIncorporating the number of rounds in some way might be a good idea, however, in a tournament scenario time is limited, so cycling your deck again and again is only possible to a limited degree. Decreasing the effect of total threat on the score might still be a good idea, maybe a cap wouldbe a way to go.\n\nI've already argued that decks without spirit cannot compete in a torunament which is bad. Adding lots of cards that are worth (high amounts of) victory points might alleviate that, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540191","commentId":540191,"userName":"Lenbo","timestamp":1318309800,"content":"Okay, this is the simplest scoring system I could think of, with minimal changes to how the game's current formula works.\n\nBy using the same scoring formula the game has, only now every time a card is used that lowers threat, simply add that amount to the total score at the end of the game.\n\nIn other words - Increase end score by X amount, where X is the amount of total threat lowered by card effects.\n\nSo, if you used Gandalf once to lower your initial threat of 40 by 5 to 35, you would add 5 to your end score.\n\nUnder this system, if this was your last turn, your end threat would be 35, you would then add 5, to make the end score 40. In this way, players could not abuse card effects which lower threat to affect score, elminating the need to cycle your deck.\n\nThis method works with the current game design formula, such as hero stats=hero threat. Lowering threat through card effects would only affect gameplay,  not end score, and only requires players to keep track of one extra variable (using progress tokens).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540242","commentId":540242,"userName":"Svenn","timestamp":1318318376,"content":"jhaelen said:\n\nScenario difficulty (and #players) has absolutely no place in the scoring system because the sole reason for the scoring system is to determine a winner in a tournament situation. And in a tournament the number of players and the scenario are set.\n\nActually, I have no intention of ever playing in any kind of tournament. I like the scoring system for comparing myself to my previous scores and the scores of others to see how well I'm doing in a particular quest. Normalizing this score between scenarios and number of players gives a much better comparison. Again, this is an unofficial scoring system for people that want to track and compare their scores.\n\nLenbo, that is an interesting idea, but again that is something more for players to track and remember to keep updated. I find generally that the more difficult you make it for players, the less that are willing to use it. The less using it... well, the less meaningful that scoring system becomes I think since you won't have many people to compare to.\n\nAlso, lowering your threat is a valid tactic and I'm not sure it should be discounted completely; I just don't think it should be the only way to achieve a decent score. The minimum cap allows you to have a minor effect on your score in much the same way as healing a hero. In this way you can keep your score low by not taking damage, healing your heroes, beating the quest quicker, lowering your threat... many different ways, none of which is weighted too heavily against the others to the point of game breaking though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=540246","commentId":540246,"userName":"Cletus","timestamp":1318318923,"content":"Lenbo said:\n\nOkay, this is the simplest scoring system I could think of, with minimal changes to how the game's current formula works.\n\nBy using the same scoring formula the game has, only now every time a card is used that lowers threat, simply add that amount to the total score at the end of the game.\n\nThat could maybe work, but I feel that if you did that with threat you would also need to have every point of damage taken count towards you regardless of healing (or completely remove damage taken from the equation as previously argued - some deck builds are all about taking damage and this would screw them over) and count every hero death regardless of resurrection cards (or, again, remove it). This would still leave VPs but it wouldn't be worth cycling the encounter deck for them all if threat reduction didn't count for score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=543806","commentId":543806,"userName":"Hannibal_pjv","timestamp":1318950649,"content":"It seems to me that the amount of rounds seems to be the best way of reducing stalling. Allso the idea of having minimum valua of you starting characters as a base is good.\n\nThere are some problems... you have to count the number of rounds... Some counter for that would be sufficien though. Other thing is how much weight you put to the rounds? Multibly the rounds or divide, so makin it more important. I would prefer, that the speed is important, so the amount of rounds should have big impact to the score. One way of making different scenarios more \"balanced\" would be a par system (like in golf) The scenario X has round suggestion of 10 rounds. Anythin better give positive score effet, anything longer would give negative effect. But that would make t even more complex... And only thing that it would make would be makin different scenasios more comparable to each other. It would allso reguire some game playin to deternimate suitable \"par\" value to each scanarios.\n\nMy suggestion would be:\n\nFinal treath level (min starting treat valua) + threath cost of each dead heroes + Damage tokens on heroes - victory points earned + (rounds - par)*10\n\nso allmost the same as normal scoring. The problem is that Treath management is still overkill, but this does discourage stalling!\n\n(ten is allso easy number to make multiplies :-)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=543815","commentId":543815,"userName":"Svenn","timestamp":1318951862,"content":"I still think the best solution is to use two numbers: Score and Number of Rounds. I think trying to tie in Number of Rounds is very difficult, especially with normalizing scores between scenarios at all. Also, this way you get more of a feel for the full game. If rounds is incorporated in the score then someone with a score of 30 who took 4 rounds versus someone with a score of 30 who took 15 rounds of reducing threat and such to minimize score are indistinguishable.\n\nWith both numbers you can get a general idea of how well the game went, AND you get to see exactly how quick they completed the match. Two people with a score of 30 did just as well in terms of completing the quest, but showing the number of turns gives you a much better overall picture. You can also then keep track not only of best score, but fewest turns as well. Put that number into a quest log and you can sort directly by number of turns to see who has completed a quest the quickest, and who has managed the lowest score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=544190","commentId":544190,"userName":"Anduril82","timestamp":1319018174,"content":"Svenn said:\n\nOn the subject of scoring... I've been trying to come up with a good alternate scoring system, but it's tough.\n\nWhat about something where higher is better though? What are the important elements that should contribute to the score? I've got:\n\n * Remaining heroes/life on heroes\n * Number of turns\n * Quest difficulty\n * Victory Points\n * Threat, to an extent\n * Number of players\n\nThe current scoring system takes all of these except for number of turns and quest difficulty into account in some way. Is there any other variable that we could use? If we're just using the same things to calculate score it's not going to be much different than the current system.\n\nIf we want to get complicated we could do something like:\n\n(Quest Difficulty x 10) + (VP) - (# Turns) - (threat cost of dead heroes) - (# damage tokens on living heroes) - (threat) - (10 x # players)\n\nOf course, this is still somewhat similar to the current scoring system. It does incorporate quest difficulty and number of players/turns (although number of players may be unfairly weighted). It still suffers from the fact that delaying the game to score VP and reduce threat can be beneficial... although not AS beneficial. You could add in unspent resources maybe, but that also lends itself to delaying the game for more points.\n\n \n\n\n\nI like where you are going with this, but I do have one question for everyone.  Doesn't the difficulty change as new cards are released?  I have all the adventure packs so far, and I find it is much easier to do some of the earlier quests with newer cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=544212","commentId":544212,"userName":"Glaurung","timestamp":1319019732,"content":"Anduril82 said:\n\nSvenn said:\n\n \n\nOn the subject of scoring... I've been trying to come up with a good alternate scoring system, but it's tough.\n\nWhat about something where higher is better though? What are the important elements that should contribute to the score? I've got:\n\n * Remaining heroes/life on heroes\n * Number of turns\n * Quest difficulty\n * Victory Points\n * Threat, to an extent\n * Number of players\n\nThe current scoring system takes all of these except for number of turns and quest difficulty into account in some way. Is there any other variable that we could use? If we're just using the same things to calculate score it's not going to be much different than the current system.\n\nIf we want to get complicated we could do something like:\n\n(Quest Difficulty x 10) + (VP) - (# Turns) - (threat cost of dead heroes) - (# damage tokens on living heroes) - (threat) - (10 x # players)\n\nOf course, this is still somewhat similar to the current scoring system. It does incorporate quest difficulty and number of players/turns (although number of players may be unfairly weighted). It still suffers from the fact that delaying the game to score VP and reduce threat can be beneficial... although not AS beneficial. You could add in unspent resources maybe, but that also lends itself to delaying the game for more points.\n\n \n\n \n\n \n\nI like where you are going with this, but I do have one question for everyone.  Doesn't the difficulty change as new cards are released?  I have all the adventure packs so far, and I find it is much easier to do some of the earlier quests with newer cards.\n\n\n\nOf course with new cards is much more easy. Look on Bbrand for example. This is not powerful card????? Cancel all shadow effect!!???\n\nThe next attachment will be cancel all revealed effect +surge and doom. And after cancel all damage in combat. I dont understand sometimes FFG!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=544218","commentId":544218,"userName":"Lenbo","timestamp":1319020760,"content":"So the absolute simplest measure I can think of that doesn't discourage any strategies in particular, uses an even simpler formula than the current one, and doesn't encourage cycling of deck is this:\n\nFinal Threat Level + Number of Threat Lowered Using Card Effects - Victory Points Earned\n\nExample: Tom, playing a solo game, has defeated the “Passage Through Mirkwood” quest, with a threat level of 40, having used Gandalf to lower his threat by 5, and 5 victory points. His final score is calculated in the following manner:\n\nFinal Threat Level (40)\n+ Number of Threat Lowered Using Card Effects (5)\n– Number of Victory Points Earned (5)\nTom’s Final Score (40)\n\n \n\nEdit: Fixed my problem with simple addition. \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=544220","commentId":544220,"userName":"Svenn","timestamp":1319021006,"content":"Lenbo said:\n\nSo the absolute simplest measure I can think of that doesn't discourage any strategies in particular, uses an even simpler formula than the current one, and doesn't encourage cycling of deck is this:\n\nFinal Threat Level + Number of Threat Lowered Using Card Effects - Victory Points Earned\n\nExample: Tom, playing a solo game, has defeated the “Passage Through Mirkwood” quest, with a threat level of 40, having used Gandalf to lower his threat by 5, and 5 victory points. His final score is calculated in the following manner:\n\nFinal Threat Level (40)\n+ Number of Threat Lowered Using Card Effects (5)\n– Number of Victory Points Earned (5)\nTom’s Final Score (30)\n\n\n\nSurely Tom's final score is 40? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThis is somewhat simple, but leaves out a lot of information. Not to mention you still have to track something extra. I might just be crazy about stats, but you're leaving out a large amount of information there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=544221","commentId":544221,"userName":"Kiwina","timestamp":1319021280,"content":"Lenbo said:\n\n \n\nSo the absolute simplest measure I can think of that doesn't discourage any strategies in particular, uses an even simpler formula than the current one, and doesn't encourage cycling of deck is this:\n\nFinal Threat Level + Number of Threat Lowered Using Card Effects - Victory Points Earned\n\nExample: Tom, playing a solo game, has defeated the “Passage Through Mirkwood” quest, with a threat level of 40, having used Gandalf to lower his threat by 5, and 5 victory points. His final score is calculated in the following manner:\n\nFinal Threat Level (40)\n+ Number of Threat Lowered Using Card Effects (5)\n– Number of Victory Points Earned (5)\nTom’s Final Score (30)\n\n \n\n \n\nEdit: I just noticed Svenn's reply.\n\nI'm pretty sure the final score would still be 40.  That's an interesting idea though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54443-quest-difficulty-and-final-scores-any-relation/?do=findComment&comment=544225","commentId":544225,"userName":"Lenbo","timestamp":1319021677,"content":"Svenn said:\n\nThis is somewhat simple, but leaves out a lot of information. Not to mention you still have to track something extra. I might just be crazy about stats, but you're leaving out a large amount of information there.\n\n\n\nAlright, if you want another stat/variable, how about this:\n\nFinal Threat Level + Number of Threat Lowered Using Card Effects + Number of Hero Deaths - Victory Points Earned\n\nMakes things slightly more complicated, but keeps in theme with the original game's formula of punishing players' scores for losing heroes."}]}