{"url":"https://community.fantasyflightgames.com/topic/54547-rule-clarification-help-shadow-effect-card/","title":"Rule clarification help - shadow effect card","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54547-rule-clarification-help-shadow-effect-card/?do=findComment&comment=540194","commentId":540194,"userName":"kacek","timestamp":1318310332,"content":"Sorry if this question is stupid or has already been answered, but I'm not sure about the shadow effect.\n\nDo I place the shadow card only the first time the enemy engages me by going down from the threat zone (I don't know if it called this in English as I play Polish version) or do I have to resolve a shadow effect every time I fight with the enemy?\n\nSo far I have played as if one enemy was given a shadow effect only once, which was not bad. But today I've decided to play it the other way and the game was much more difficult, mainly due to the fact of the fast attrition of the encounter deck and having to shuffle all the beaten enemies to the deck again.\n\nI'd be grateful if someone helped me with this dilemma, because I don't like the feeling that I win because, in a way, I have cheated the game. And besides, it's one of the few games which I ilke the more the more difficult it is to conquer it.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54547-rule-clarification-help-shadow-effect-card/?do=findComment&comment=540196","commentId":540196,"userName":"Dam the Man","timestamp":1318310693,"content":"Once an Enemy is engaged with you (left the staging area), you deal it a Shadow card each combat phase, even if it can't attack (Forest Snare)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54547-rule-clarification-help-shadow-effect-card/?do=findComment&comment=540224","commentId":540224,"userName":"kacek","timestamp":1318315507,"content":"Thanks a lot for the clarification. Now I know it was too easy. I have to rethink my abilities then, since now even the Passage will become difficult to me.\n\n "}]}