{"url":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/","title":"Rule Clarification: - Protector of Lorien?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540445","commentId":540445,"userName":"booored","timestamp":1318346181,"content":"Protector of Lorien\n\nWith Protector of Lorien what exactly is going on here.... it has the action keyword, but the action is \"discard a card from your hand\"... you do not tap the artifact or anything...\n\nSo the question is if you have 2 or more of these in play on different characters, dose the one discard buff all copies of Protector of Lorien?\n\nI think that it dose, as the artifact is saying (as I read it) \"If a card is discarded at action speed, then buff attached character\" It doesn't say anything about the artifact triggering in a way like exhausting or w/e and that trigger is what discards the card and buffs the character. It is like the artifact is just placing a response text on the character that triggers as cards are discarded.\n\nSo yea.. what do you think?\n\nQ:- Dose discarding a single card from your hand trigger multiple copies of Protector of Lorien, or do you need to declare with PoL you are targeting when you discard a card form your hand?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540450","commentId":540450,"userName":"Svenn","timestamp":1318346608,"content":"Discarding a card is part of the effect. Since you cannot discard the same card twice it only counts for 1 copy of Protector of Lorien. This also cannot trigger if you are discarding a card for something other than Protector of Lorien.\n\nIf this were a response, then yes you could trigger it any time you discarded a card for any reason. It is an action however, that specifies that you must discard a card for the effect.\n\nBecause Protector of Lorien does not exhaust, you may discard any number of cards in this way for this effect. However, for each instance you must discard another card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540455","commentId":540455,"userName":"HilariousPete","timestamp":1318346887,"content":"The \"Discard a card\" is part of the cost of the action. When you trigger the action and pay the cost, you trigger it on just this Protector of Lorien.  The action counts only for this card. On another copy of PoL, you would have to trigger the action again, and again pay the cost (another discard now, not the same).\n\nIf the card text would have been: \"Response: When you discard a card from hand, attached character get's +1 WP or +1 defense\". Then you could use a discard for several Protector of Loriens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540483","commentId":540483,"userName":"booored","timestamp":1318349456,"content":"HilariousPete said:\n\nThe \"Discard a card\" is part of the cost of the action. When you trigger the action and pay the cost, you trigger it on just this Protector of Lorien.  The action counts only for this card. On another copy of PoL, you would have to trigger the action again, and again pay the cost (another discard now, not the same).\n\n \n\nIf the card text would have been: \"Response: When you discard a card from hand, attached character get's +1 WP or +1 defense\". Then you could use a discard for several Protector of Loriens.\n\n \n\nExactly, as you say, the discard is part of the cost of the action... but as far as it reads to me there is no specification that the action cost is targeted.....  it is simply saying that the action has a trigger cost of discarding a card form your hand.... So this still reads to me as if you have say 2 copies of this in play, discarding a single card will trigger both the copes actions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540496","commentId":540496,"userName":"HilariousPete","timestamp":1318350744,"content":"booored said:\n\n \n\nExactly, as you say, the discard is part of the cost of the action... but as far as it reads to me there is no specification that the action cost is targeted.....  it is simply saying that the action has a trigger cost of discarding a card form your hand.... So this still reads to me as if you have say 2 copies of this in play, discarding a single card will trigger both the copes actions.\n\n\n\nPerhaps the word \"trigger\" is confusing here, because it sounds like there is something happening in the game (like a player discarding a card) and then the card text of PoL would \"react\" to it and the hero gets +1 WP. This is not the case. This would be the case if PoL would be a response, there you can react to something in the game. But you, as a player, have to initiate actions. It's like you say \"I want the effect of PoL getting executed\". You have to pay the cost (here discarding a card), then you get the effect. You can't use the cost of the action to pay for another action, even when it's the action on another copy of the same card. If you could do this, you could also pay 2 spirit resource tokens to play the Wandering Took, and while you do that, you say \"oh, I've just paid 2 spirit resources, now I play another Wandering Took with them, using exactly the same 2 tokens...\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540503","commentId":540503,"userName":"Svenn","timestamp":1318351148,"content":"When you activate the action, you must discard a card. That's part of the action. If you attempt to perform the same action on the same card the action fails because by the time it gets to resolve the card is already in the discard pile thus making the \"discard\" invalid.\n\nI'm not sure how to make this any clearer. You have to pay the discard cost to play the action. If you attempt to play multiple actions they resolve one at a time. By the time you get to the second action the discard has already happened.\n\nBy your logic I could pay 3 resources and play 4 cards that cost 3 points each, because I'm paying the 3 resources and using them for all 4 cards. That is not allowed of course, because you have to pay the cost for each card. It's the same with discarding, it's a part of the action and you can't use the same \"resource\" (discard) to pay for multiple effects.\n\nEDIT: Looks like Pete responded with almost the same response before me. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540516","commentId":540516,"userName":"booored","timestamp":1318352839,"content":"The quote system on this forum is so terrible I am going to use <---> to signal a quote.. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n<---------->\n\"It's like you say \"I want the effect of PoL getting executed\". You have to pay the cost (here discarding a card), then you get the effect.\"\n<---------->\n\nWell this is my point, the \"cost\" is discarding a card. Witch you are in fact doing.\n\n<---------->\n\"When you activate the action, you must discard a card. That's part of the action.\"\n<---------->\n\nYea but the rule text doesn't \"say\" that dose it. It says \"ACTION: Discard a card from your hand to give attached hero.... etc etc\". I understand what people are saying about response and stuff... but the card itself dose not make speak to this distinction between the action triggering from the discard or the action triggering the discard. That is the crux of the problem here. You can not argue \"intent\" you have to go by the raw meaning of the rules as printed. There is nothing written anywhere that speaks to how action triggers stack, or don't stack.. witch is what you guys are saying.\n\n<---------->\n\"By your logic I could pay 3 resources and play 4 cards that cost 3 points each, because I'm paying the 3 resources and using them for all 4 cards\"\n\n\"If you could do this, you could also pay 2 spirit resource tokens to play the Wandering Took, and while you do that, you say \"oh, I've just paid 2 spirit resources, now I play another Wandering Took with them, using exactly the same 2 tokens\"\n<---------->\n\nWell.. no. .I am not saying that at all, and the logic I'm using doesn't lead to that, it is just a bad example. As there is written rules that govern the payments of cards during that step."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540530","commentId":540530,"userName":"Sportacus","timestamp":1318353899,"content":"booored said:\n\nYea but the rule text doesn't \"say\" that dose it. It says \"ACTION: Discard a card from your hand to give attached hero.... etc etc\". I understand what people are saying about response and stuff... but the card itself dose not make speak to this distinction between the action triggering from the discard or the action triggering the discard. That is the crux of the problem here. You can not argue \"intent\" you have to go by the raw meaning of the rules as printed. There is nothing written anywhere that speaks to how action triggers stack, or don't stack.. witch is what you guys are saying.\n\n\n\n \n\nFollowing your logic if I discard a card now I'll be able to activate Protector of Lorien two tuns (or three or four etc. etc.) ahead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540532","commentId":540532,"userName":"Svenn","timestamp":1318354479,"content":"From the rulebook:\n\n\"Paying Costs\nMany cards are written in a “pay or exhaust X to do Y” manner. When confronted with such a construct, everything before the word “to” is considered the cost,\nand everything after the word “to” is considered an effect. Costs can only be payed with cards or resources that a player controls.\"\n\nThe text of Protector of Lorien:\n\"Action: Discard a card from your hand to give attached hero +1[defense] or +1[willpower] until the end of the phase.\"\n\nThe rules specifically state that everything before the \"to\" is considered the cost... so \"Discard a card from your hand\" is the cost. When you activate the first Protector of Lorien, you choose a card to discard and it is sent to the discard pile. When you activate the second Protector of Lorien that card is already discarded so you can't re-discard it to pay the cost. Again, this is exactly the same as trying to pay for the cost of 2 cards played from your hand with the same resources. It's a cost.\n\nIn addition, here's a passage from the FAQ:\n\"(1.10) Limitations on Actions\nActions are only limited by whether or not a player can pay the cost of the action, or by built in limitations on the card itself, such as \"limit once per round.\"\nExample: Protector of Lorien (CORE 70) reads, \"Action: Discard a card from your hand to....\" This action may be triggered repeatedly, as long as the card's controller has cards in hand to discard.\"\n\nYou CAN trigger the effect multiple times, but it requires 1 discard each time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540563","commentId":540563,"userName":"HilariousPete","timestamp":1318357510,"content":"@Svenn: Yes, seems like we're switching who answers first ;-)\n\nNow, back to the issue.\n\nIf you have restrictions to the resource costs example because paying and playing cards is specified in the planning phase further, there are others. Would you look at the top encounter card of the encounter deck, if you just exhausted Henamarth Riversong because committing to the quest? Would you allow to heal up to 4 points of damage if you have 2 Daughters of Nimrodel in play and only exhaust 1? If you have 3 Longbeard Map-Makers and spend 1 lore resource, would all 3 get +1 WP? And so on... Ok, you can argue that this is reasoning with other examples by guessing their intention, right...\n\nbooored said:\n\n... but the card itself dose not make speak to this distinction between the action triggering from the discard or the action triggering the discard. That is the crux of the problem here. [...] There is nothing written anywhere that speaks to how action triggers stack, or don't stack.. witch is what you guys are saying.\n\nYou're right, there is no rule in LotR that says that actions are taken one at a time and not simultaneously (what is necessary if you want to use the discard of 1 single card from hand being the payment for the cost for 2 actions on seperate cards, since the text doesn't read \"action: if you have discarded a card before, ...\"). But there isn't anything that suggests you can play actions simultaneously, either. In addition, Call of Cthulhu, which is similar to LotR, specifies on timing rules: \"Actions are taken one at a time. After a player has taken and resolved an action, he must allow his opponent the opportunity to take and resolve an action before he can take another, etc.\" Because of the similarities of the games, I would rather apply this to LotR too, instead of applying the opposite (simultaneous actions).\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540617","commentId":540617,"userName":"radiskull","timestamp":1318365357,"content":" It's not exactly on point, but the FAQ states:\n\n\"Q. If Legolas has a Blade of Gondolin (CORE 39) and\ndestroys an enemy, can he trigger his response, finish\noff a quest card, and still place progress tokens on the\nnext quest with the Blade of Gondolin's response?\n\nA: Yes. Quest cards are immediately replaced as\nsoon as players place enough progress on them,\nand this replacement does not interrupt the current\nround sequence. If the current quest card only needs\n1 progress on it, then a player could also trigger\nthe Blade's effect first, and then Legolas' in order to\nmaximize the number of progress tokens placed. (There\nis no carry-over progress from an effect).\"\n\nThis suggests to me that the player controlling Legolas can NOT trigger both responses simultaneously, and instead must sequentially trigger them.\n\n \n\nIn the same vein, if someone has two copies of Caught in a Web on them, they need to pay 4 resources to ready, not two.  Each cost must be paid individually.\n\n \n\nAlso, triggering the Action is what forces a player to pay costs, not vice versa.  It's not like Magic, where you tap your lands in advance of your action.  Furthermore, it's silly to think that you could pay a cost for one effect and then get multiple effects out of it.  It'd be like me tapping one forest and then playing three Elves (because, hey, I paid the cost of one green mana).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540788","commentId":540788,"userName":"booored","timestamp":1318397120,"content":"HilariousPete said:\n\nYou're right, there is no rule in LotR that says that actions are taken one at a time and not simultaneously (what is necessary if you want to use the discard of 1 single card from hand being the payment for the cost for 2 actions on seperate cards, since the text doesn't read \"action: if you have discarded a card before, ...\"). But there isn't anything that suggests you can play actions simultaneously, either. In addition, Call of Cthulhu, which is similar to LotR, specifies on timing rules: \"Actions are taken one at a time. After a player has taken and resolved an action, he must allow his opponent the opportunity to take and resolve an action before he can take another, etc.\" Because of the similarities of the games, I would rather apply this to LotR too, instead of applying the opposite (simultaneous actions).\n\nExactly. This is my entire point. As far as I know this just isn't addressed in the rules. Also before I get started you can not use rules form a different game, BUT CoC is a perfect example of a game that has rules that dictate how the stack works, the rule is stated, and this rule is written down.. it exists, it isn't an inferred \"opinion\" from the player, making it real. You can not argue against it.\n\nThis is what this game needs. As... \"yes\"... your comments are most likely the way the card is designed, but because of a failing in the rules themselves you could never tell someone that they are playing in the wrong way, as the rules do not forbid it.\n\nHow can you run a completions like at GenCon, and have rules that can be considered either way.\n\n-----------------------------------------------------------------\nPaying Costs\n\nMany cards are written in a “pay or exhaust X to do Y” manner. When confronted with such a construct, everything before the word “to” is considered the cost,\nand everything after the word “to” is considered an effect. Costs can only be payed with cards or resources that a player controls.\"\n\nThe text of Protector of Lorien:\n\"Action: Discard a card from your hand to give attached hero +1[defense] or +1[willpower] until the end of the phase.\"\n\nThe rules specifically state that everything before the \"to\" is considered the cost... so \"Discard a card from your hand\" is the cost. When you activate the first Protector of Lorien, you choose a card to discard and it is sent to the discard pile. When you activate the second Protector of Lorien that card is already discarded so you can't re-discard it to pay the cost. Again, this is exactly the same as trying to pay for the cost of 2 cards played from your hand with the same resources. It's a cost.\n\nIn addition, here's a passage from the FAQ:\n\"(1.10) Limitations on Actions\nActions are only limited by whether or not a player can pay the cost of the action, or by built in limitations on the card itself, such as \"limit once per round.\"\nExample: Protector of Lorien (CORE 70) reads, \"Action: Discard a card from your hand to....\" This action may be triggered repeatedly, as long as the card's controller has cards in hand to discard.\"\n\nYou CAN trigger the effect multiple times, but it requires 1 discard each time.\n-----------------------------------------------------------------\n\nNone of this in in debate, and multiple triggers of the same card hasn't even been mentioned, it simply is not on topic. What we are discussing here is that the rules have no distinction for action speed events. The rules state... (and these are not even official, as these are the unofficial made up version of the rules) and not applicable at comps.\n\n\"Can be used by controlling player (unless otherwise specified) any time before, during, or after any green-colored section of the Turn Order chart (but not during Setup). The exception is during Combat: actions can't interrupt any step but can only be played at the end of each step. Maybe restricted to a specific phase (e.g. Quest Action). Actions in-play can be triggered as many times as you can afford, while Actions or Event cards in your hand can only be triggered once (after paying the cost).\"\n\nSo we are in no way talking about the cost of the card, we are talking about how according to the rules as they stand now the actions that can trigger at \"any time before, during, or after any green-colored section of the Turn Order chart\" So there is no rules governing (as far as I know) the way these \"instant\" speed action events stack as they enter the game world.\n\nI'll try and break it down so it is more clear....\n\n1) If you trigger an action, then completely allowed by the rules as they stand now, you \"can\" trigger ANOTHER action BEFORE you pay the cost for the original action.\n2) Now two actions are triggered and they are BOTH waiting on the stack outside the game world for cost to be paid before they can resolve.\n3) You discard a card, witch covers both the actions conditions on the stack, allowing them both to resolve as both these actions are in fact getting paid by the same discard event.\n\nThis is why most games have a defined rule system to govern the stack. I mean no one that is saying that the card is \"truly\" designed to work this way. The point of this thread is to highlight yet another example for this game were that a literal interpretation of the rules as it stands, dose not reflect the game designer goals (supposedly, and that is the point, you just do not know what they meant). This is common in a number of the more complicated card events in this game, mainly due to not having rules governing how card leave and enter play correctly, as well, imo, some of the keywords that are to broad, and really should be split into more.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540805","commentId":540805,"userName":"pumpkin","timestamp":1318398932,"content":"If the card was truly designed to work that way then the same ruling could be applied to other actions of that nature, so in essence I could discard one card which would activate all PoLs on the table, as well as Eowyn's abilty, as that has a discard card cost.\n\nLikewise by paying 1 resource to pay for Aragorn's response I could also activate Long Beard Map makers ability etc, etc\n\nI think (hope) that everyone can see, that playing the game in that way, madness lies.\n\nThere will always be a degree of intepretation, and no rule sheet will ever be 100% perfect, but most of us get by with something called common sense.\n\nI'm not disagreeing with your anaysis of the rules wording, which seems very thorough, but given the application of it as I've described above,do you really believe that PoL works the way you initially described?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540808","commentId":540808,"userName":"HilariousPete","timestamp":1318399333,"content":"booored said:\n\n[...] As far as I know this just isn't addressed in the rules. Also before I get started you can not use rules form a different game, BUT CoC is a perfect example of a game that has rules that dictate how the stack works, the rule is stated, and this rule is written down.. it exists, it isn't an inferred \"opinion\" from the player, making it real. You can not argue against it.\n\nThis is what this game needs [...]\n\n\n\nIf your intention was to show FFG that timing issues (or stacking issues) is missing in the rules, then I fully support that. Such things should really be covered in rules or in an official FAQ for a game that aims at being playable in tournaments. (This is meant as a suggestion towards FFG and not as a complaint, because I realize that CoC is older than LotR, it even has been published as CCG and not as LCG, and we haven't even finished the first cycle of Adventure Packs, so a lot more time to specify on rules...) The FAQ radiskull cited suggests that actions+responses can't resolve simultaneously, but an explicit statement would be good, that's true.\n\nI think the discussion has come to sort of a dead point now: Your argument is, that the rules don't explicitly say that actions are resolved one at a time, our arguments are, that the rules don't say they're resolved simultaneously, the FAQ suggests that it cannot be done, and that it is not what (we think) the intention of the rules and of the cards is (see pumpkin's or my examples). I think we won't find a solution to which both sides agree without doubt, as long as there's no new official FAQ....\n\nBut in you first post, you asked how Protector of Lorien should be played (and not \"please FFG clarify on timing issues\"), so we answered to that question to best of our knowledge ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540869","commentId":540869,"userName":"Bohemond2","timestamp":1318406306,"content":"booored said:\n\n \n\nThis is why most games have a defined rule system to govern the stack. I mean no one that is saying that the card is \"truly\" designed to work this way. The point of this thread is to highlight yet another example for this game were that a literal interpretation of the rules as it stands, dose not reflect the game designer goals (supposedly, and that is the point, you just do not know what they meant). This is common in a number of the more complicated card events in this game, mainly due to not having rules governing how card leave and enter play correctly, as well, imo, some of the keywords that are to broad, and really should be split into more.\n\n \n\n \n\nWhat page of the rules or the FAQ contains a discussion of a \"stack\", \"chain\" or any other term for that game concept? \n\nMost games don't have a stack at all. If a game doesn't explictly have a stack, it is the assumption of a stack that creates rules problems.  That's a problem with the players, not the game designers.  You assume that you can place an effect on the stack without paying the cost, and then trigger another effect before the first effect resolves.  All of your argument is predicated on a stack, which doesn't exist in LotR (I think you are wrong even if there is a stack, but that''s another story)\n\nIf you want to trigger two actions at once, you use the simultaneous effect timing rules. \n\n\"If two or more conflicting effects would occur\nsimultaneously, the first player decides the order in\nwhich the effects resolve.\"\n\nStacks work well for competitive card games with intricate rules and lots of card interactions.  However, they require an incredibly complex rules system to manage.  Cooperative games don't gain anything by adding a stack, other than overly bloated and arcane rule sets.\n\nYou can't make up rules for a game, and then complain that the rules you have made up aren't defined in sufficient detail. The game has a simple rule for resolving timing conflicts.  The rule is explicitly defined and you are choosing to ignore it.\n\nedit for clarity"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=540968","commentId":540968,"userName":"Kiwina","timestamp":1318419430,"content":"There are several places that express the idea that only one action, response, or forced effect can be happening at any given time.\n\nHere is an example from the FAQ:\n\n\"Q: Does a player commit his characters to a quest at once, or one character at a time? When can a player trigger responses to committing his characters to a quest?\nA: A player commits all characters he wishes to commit to a quest at once. Responses to the characters committing (such as those on Aragorn and Theodred) can then be triggered in the order of that player’s choice. After a player has committed his characters (and triggered any responses to those characters committing), the next player has the opportunity to commit his characters to the quest.\"\n\nA player's characters commit to a quest simultaneously.  Their trigger happens simultaneously, but each their effects must happen one at a time.  Even if you decide to trigger PoL two times simultaneously, you must resolve one first (discard a card to gain whatever) then you can resolve the other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=541316","commentId":541316,"userName":"jhaelen","timestamp":1318476135,"content":"None of the LCG games uses a stack (unlike Magic), LotR is not an exception."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=541339","commentId":541339,"userName":"Dam the Man","timestamp":1318480778,"content":"jhaelen said:\n\nNone of the LCG games uses a stack (unlike Magic), LotR is not an exception.\n\n\n\nW:I has action chain which is I believe the same as stack, just a different word (can use actions in response, go into chain, resolved in LIFO)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54566-rule-clarification-protector-of-lorien/?do=findComment&comment=541462","commentId":541462,"userName":"jhaelen","timestamp":1318501126,"content":"Dam said:\n\njhaelen said:\n\n \n\nNone of the LCG games uses a stack (unlike Magic), LotR is not an exception.\n\n \n\n \n\nW:I has action chain which is I believe the same as stack, just a different word (can use actions in response, go into chain, resolved in LIFO).\n\n\n\nWell, I'll be ... really?!\n\nI've not actually played WH:I, I only read the rules. I didn't get the impression that there was a stack. If that's really true, it is very Interesting that this one's the odd one out."}]}