{"url":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/","title":"&quot;Rockslide&quot; is absurd.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540565","commentId":540565,"userName":"DurinIII","timestamp":1318357655,"content":" This card is really the \"make or break\" of this entire Emyn Muil scenario.  Draw a rockslide when everyone is exhausted to quest and a bunch of people die, don't draw one and you do fine. I hate this scenario so much for it's lame mechanics and ridiculous solution to hurting players...\"Let's just deal two damage to everything with this card, that'll stop em.\" Well it certainly does do that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540571","commentId":540571,"userName":"DurinIII","timestamp":1318357799,"content":" sorry for posting this twice guys. accidental."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540583","commentId":540583,"userName":"Puzzle2","timestamp":1318358988,"content":" While I agree that Rockslide is absurd, it is actually better than its counterpart from JtA: Exhaustion. This card does two damage to each exhausted character, not just those dedicated to the quest. Exhaust Gleowine at the beginning of your turn for an extra card draw? Boom - dead from exhaustion!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540584","commentId":540584,"userName":"Eryx_UK","timestamp":1318359049,"content":"I don't get my copy until tomorrow. What's the wording on the card? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540588","commentId":540588,"userName":"Puzzle2","timestamp":1318359382,"content":" Treachery\n\nWhen revealed deal 2 damage to each character committed to this quest.\n\nAlso has a shadow effect: remove defending character from combat. This attack is considered undefended.\n\nI almost think the shadow effect is worse because you now have to deliver all damage to a hero when you were not planning for this. Makes Burning Brand look even better on your defenders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540591","commentId":540591,"userName":"player582283","timestamp":1318359863,"content":"Why is it absurd?  The game should have some cards that are \"gotchas\" if you don't have the right answer.  Not too mention it's not game over to take 2 damage to all your questors."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540624","commentId":540624,"userName":"gatharion","timestamp":1318366203,"content":" Exactly one of the reasons why Elenor is underrated. \n\nI played Hills of Emyn Muil today and I had an \"A Test of Wills\" card in my hand a spare resource at all times in case I pulled a Rockslide.\n\n \n\nMy point being, there are options besides just lucky draws and getting smacked.\n\n(I also agree that Exhaustion is nastier. I had that one kill three Heroes at once.)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540775","commentId":540775,"userName":"jhaelen","timestamp":1318393917,"content":"gatharion said:\n\n Exactly one of the reasons why Elenor is underrated. \n\n\n\nQuoted for truth! Replacing one of my heroes for Eleanor was decisive to deal with scenarios that are heavy on that kind of effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540819","commentId":540819,"userName":"Untergeher","timestamp":1318400615,"content":"I never quite understood all the Eleanor bashing ;-)\n\nShe gets a lot of play in my Spirit/Tactics deck (together with Legolas and Eowyn). She absolutely shines in treachery-heavy scenarios and also works as a solid defender. In combat-heavy decks I use Dunhere instead. Or Frodo if I want to go questing for some extra willpower.\n\nWhat could be argued is that treacheries like \"rock slide\" suggest that you have to include spirit heroes and spirit cards to be able to deal with them effectively..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540851","commentId":540851,"userName":"Glaurung","timestamp":1318404486,"content":"Eleanor is really good. In my deck she have Burning brand (song of wisdom), Dunedan warning. She have 3 defense and cancel shadow effect so she is perfect defender and if something happen she can always cancel some treachery in the quest phase. And starting threat is 7 not bad not bad"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54575-rockslide-is-absurd/?do=findComment&comment=540905","commentId":540905,"userName":"DurinIII","timestamp":1318411297,"content":" I agree Glaurung."}]}