{"url":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/","title":"Timing of finishing a quest/Emin Muil","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/?do=findComment&comment=541425","commentId":541425,"userName":"Shelfwear","timestamp":1318496785,"content":"We had this situation while playing Hills of Emin Muil\n\nOn the quest card there were a couple of progress markers (=more than the required 1), we had roughly 25 victory points accumulated (=more than the required 20), no active location and in the staging area there were 2 Emin Muil Locations with progress tokens already placed on them.\n\nWe started the quest phase and we had one Northern Tracker commited to the quest who immedeately removed the remaining Emin Muil locations from the staging area (his effect kicks in at the monent when he commits to the quest).\n\nAt this point we were not sure: Is the game stopped and we won or did we had to resolve the quest phase first before cheking if we have fullfilled all winning conditions? (meaning to draw the required encounter cards plus the surge effect bc there were no more locations in the staging area)\n\nWe have decided that we stop at that point and win the game but I'm not sure about this. What do you think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/?do=findComment&comment=541428","commentId":541428,"userName":"Mighty Jim 83","timestamp":1318497061,"content":"We had the same situation (more or less)\n\nI can't see any reason why it wouldn't be the case that the quest is completed - you have the victory points, you have the progress token on the quest, you have the empty staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/?do=findComment&comment=541432","commentId":541432,"userName":"Svenn","timestamp":1318497583,"content":"The game ends immediately. You resolve a quest card immediately when it has enough progress tokens to continue to complete the card. Since you were prevented from resolving that due to other circumstances, as soon as that was cleared up the progress tokens take care of the quest and it ends."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/?do=findComment&comment=541664","commentId":541664,"userName":"Vyron2","timestamp":1318527974,"content":" yes, it ends immediately... btw so far, I think that the emyn muil ap has the most powerful cards for the heroes... brand is awesome in multiplayer, ride to ruin, riddermark's finest, gildor!!!!, song of travel, descendant of thorondor!!!!, AWESOME CARDS! now I'm finally getting to the stage, where I can have 3 2-sphere decks - which I like more... one sphere is just too easy for me :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] and to the point where I have to think which cards will I keep, which will I try again, etc etc... keep'em coming, FFG!!! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/?do=findComment&comment=541840","commentId":541840,"userName":"Rashley","timestamp":1318571726,"content":"I agree the game can end at this point, but I am also assuming you can continue on if you like.  On my first success at this quest, I could have won at some point, but decided to carry on just until before the next Quest Phase, in order to reduce score points.  I don't normally bother with scoring but I knew it was safe, so just did it for interests sake.  I could utilise some healing and get Gandalf out to reduce threat.  It made about a 7 point total reduction.  Totally arbitary, but it made me think about being allowed to continue after the quest condition has been met.  I am sure it is legal, and of course, in this instance, I made sure I stopped before any new Emyn Muil locations could appear.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/?do=findComment&comment=541852","commentId":541852,"userName":"Svenn","timestamp":1318576920,"content":"Technically, you cannot continue on.\n\nRulebook page 22.\n\n\"Players immediately advance to the next stage of a quest as soon as they place a number of progress tokens equal to or greater than the number of quest points the current quest card has.\"\n\nIf you have enough progress tokens to advance, then as soon as all additional requirements are met you immediately advance to the next phase. This is not optional. In the case of the last card, you win. You don't get extra time to play more cards.\n\nOf course you can house rule this however you want, but by the letter of the law here that's how it works."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54649-timing-of-finishing-a-questemin-muil/?do=findComment&comment=541992","commentId":541992,"userName":"Rashley","timestamp":1318595520,"content":"Svenn.  You are correct in your assumption, but it could be argued that there is no next stage if the final stage is finished.  Is the game end the next stage?  Personally, I don't really care as I normally don't bother with points and am glad just to have finished.  It was just something I thought about because I knew I could finish later at no risk.  Thanks for the input.  Cheers!"}]}