{"url":"https://community.fantasyflightgames.com/topic/54646-a-fast-tacticsleadership-deck/","title":"A fast Tactics/Leadership Deck!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54646-a-fast-tacticsleadership-deck/?do=findComment&comment=541400","commentId":541400,"userName":"Shelfwear","timestamp":1318491118,"content":"Hi guys, I tinkered with Tactics for some time now and wanted to share my Tactics/Leadership deck with you that has turned out to be working quite well.\n\nThis deck is supposed to be played in a 2-player game (it wont work solo due to a lack of questing power). The other deck should have some healing ability in order to fully exploit this Tactics/Leadership deck. This deck is supposed to cycle fast by having lots of cheap cards and card drawing effects. Blocking is done by cheap meat shield allies and Eagles, the killing is done by the Heroes equipped with Axes and Dunedain Marks.\n\nThe Gondorian Spearman is a placeholder and is will be repleaced by any future card that fits better in this deck (like a cheap eagle or a leadership utility card for drawing/resources/leaving play effect). You can replace now it with Quick Strike or Born Aloft if you like.\n\nHeroes:\n\nGloin, Gimli, Legoas\n\nAllies (25):\n\nGandalf x3, Radagast x2\n\nVeteran Axhand x3, Gondorian Spearman x3, Horseback Archer x3, Winged Guardian x3, Descendant of Thorondor x3, Landroval x2\n\nSnowborn Scout x3\n\nAttachments (10):\n\nDwarven Axe x3, Horn of Gondor x2,\n\nStuart of Gondor x2, Dunedain's Mark x3\n\nEvents (15):\n\nFeint x3, The Eagles are Coming x3\n\nValiant Sacrifice x3, Campfire Tales x3, Sneak Attack x3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54646-a-fast-tacticsleadership-deck/?do=findComment&comment=541719","commentId":541719,"userName":"player582283","timestamp":1318538945,"content":"Solid deck.  Do you find Campfire Songs and Valiant sacrifice worth playing?  I quit playing Valiant Sacrifice as I found myself waiting too often to play it for replacing itself +1 card.  Along the same lines I don't like Campfire Songs in 1 or 2 player games.  I do like it for 3-4 players.\n\nI know it is pricey, but Grim Resolve can be a game changer..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54646-a-fast-tacticsleadership-deck/?do=findComment&comment=541737","commentId":541737,"userName":"Shelfwear","timestamp":1318541790,"content":"Valiant Sacrifice and Campfire tales are used to decrease the size of the deck and for cycling faster through it (plus Eagles are coming of course). Try it, you'll like them :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] This deck has many cheap throw away blockers and allies that have leave play mechanics that you rarely get stuck with a valiant sacrifice in your hand.\n\nI wouldn't play Grim Resolve in this deck as all Leadership cards in it except Steward cost one resource. This deck doesnt use songs and it never needs them. If Gloin collects more resources than I need, I use him to pay for Gandalf/Radagast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54646-a-fast-tacticsleadership-deck/?do=findComment&comment=541751","commentId":541751,"userName":"Puzzle2","timestamp":1318545674,"content":"Shelfwear said:\n\nStuart of Gondor x2\n\n\n\nMade me laugh so I had to point it out :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nOn a more constructive note, I like what you are trying to do with this deck and card draw is extremely important. Have you given any thought to using Meneldor's Flight to increase resource generation With Horn of Gondor (and even get a double dip of Descendant of Thorondor)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54646-a-fast-tacticsleadership-deck/?do=findComment&comment=541778","commentId":541778,"userName":"player582283","timestamp":1318552727,"content":"That makes sense Shelf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54646-a-fast-tacticsleadership-deck/?do=findComment&comment=541870","commentId":541870,"userName":"Shelfwear","timestamp":1318580445,"content":"Puzzle said:\n\nShelfwear said:\n\n \n\nStuart of Gondor x2\n\n \n\n \n\nMade me laugh so I had to point it out :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nOn a more constructive note, I like what you are trying to do with this deck and card draw is extremely important. Have you given any thought to using Meneldor's Flight to increase resource generation With Horn of Gondor (and even get a double dip of Descendant of Thorondor)?\n\n\n\nhe, he, funny catch. Obviously my subconsciousness sends signals here... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI wouldnt use Meneldors Flight but Born Aloft here. Born Aloft is more versatile here bc you can use it also for Gandalf and Snowborn Scout (yuck!). In an early stage I included born Aloft but I experienced a couple things:\n\nAfter mid-game (when you have the resources to play him the proper way) the usefulness of Decendant's ability decreases bc due to my threat rarely any enemy remains in the staging area. I ended up using Descendant much more via Sneak Attack early in the game. Attaching Born Aloft to Gandalf was fine but it was a bit moot bc playing him twice the normal way was just too cost intensive.\n\nAnd last: A good indicator to keep a particular card in the deck is to ask myself \"whenever you draw this card, are you happy about it or do you wish you had drawn something else instead?\" And many times during gameplay I wished for another card, so I ditched it. But you can substitute Gondorian Spearman with Born Aloft if you like it that way beter.\n\n \n\n "}]}