{"url":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/","title":"Quick question about &quot;Don&#039;t leave the path&quot; quest.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541559","commentId":541559,"userName":"Lightster","timestamp":1318512707,"content":"It says to find and defeat Ungoliant's Spawn. The thing is that it has been dealt as a shadow card, an remains there when I triggered the new stage. So... what can I do? when is the spider consider defeated?\n\n \n\nThank you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541574","commentId":541574,"userName":"radiskull","timestamp":1318513719,"content":" That sounds like singular bad luck!  One thing - if you knew that you had Ungoliant's Spawn as a shadow card, and you knew Legolas' ability would advance the quest, you could have chosen not to trigger Legolas' response.\n\n \n\nIf you didn't know that Ungoliant's Spawn was a shadow card at the time, then you will have to go through the entire encounter deck again until you meet him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541595","commentId":541595,"userName":"Lightster","timestamp":1318516402,"content":"O:   really bad luck... and I wasn't playing with Legolas. I was in a 1 player game with the Spirit deck. Thank you for the answer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541600","commentId":541600,"userName":"Neffer","timestamp":1318517274,"content":"The text on the quest card to search both the encounter deck and discard pile is ment so you can bring the spawn straight into the staging area. I think you hit a rare loop hole/glitch in the rules where a simple house rule could be brought in. I'd have personaly just brought the ungoliant spawn straight into play. Its your choice ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541607","commentId":541607,"userName":"Svenn","timestamp":1318518253,"content":"How exactly did you get into this situation with a Spirit deck? How did you progress to the next quest phase while you had shadow cards out with Spirit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541623","commentId":541623,"userName":"Lightster","timestamp":1318521392,"content":"well, the thing is that I just bought the game and wanted to feel the epic experience without spoilers, so I didn't read any quest card. So...If I should have known better I wouldn't have advance to last stage. Or did you mean that with a spirit deck that's something weird?\n\n \n\n(sorry for my english =( btw)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541649","commentId":541649,"userName":"Svenn","timestamp":1318524751,"content":"Well, in order for there to be shadow cards still out when advancing to that stage you would have had to have advanced during combat. I don't know of a way for Spirit to advance the quest during combat.\n\nWhat I'm starting to wonder is if you were not discarding the shadow cards at the end of combat like you should have been. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541657","commentId":541657,"userName":"Neffer","timestamp":1318525794,"content":"Well guessing that your playing with the standard 30 card spirit deck supplied with the core set. You quest then progressed to the next stage (3B) you search the encounter deck or encounter discard pile for ungoliant spawn and place it in the staging area. the you make engagemnet checks place shadow cards etc.\n\nI think people have assumed you were playing with a tactics deck were Legolas or a character with blade of gondolin, where after you kill an enemy you place X amount of progress on the quest card there for possibly progressing to the next quest phase. Even so, shadow cards would be put into the discard pile before the progress tokens are placed onto the quest card.\n\nI think that's right =D"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541662","commentId":541662,"userName":"marlow4","timestamp":1318527440,"content":"Even if he made a mistake with the shadow cards while playing Spirit, I think the scenario he is describing is possible with Tactics since Shadow cards remain until the end of the combat phase which a lot of us don't do, we usually reveal them and then discard after applying their effect. But they do stay until the end of the phase according to the rules.\n\nSo picture the scenario where two or more enemies are attacking a Tactics player and after the enemies have attacked and their shadow cards were revealed (one of them being Ungoliant's Spawn) the player attacks and kills one of the other enemies with Legolas and places enough progress tokens to advance the quest. The enemy with the Ungoliant's Spawn shadow card would still be sitting out there with a shadow card since that enemy wasn't killed and the combat phase hasn't ended.\n\np. 20 - \"Shadow cards remain on the enemy to which they were dealt throughout the combat phase. If the enemy leaves play, discard its shadow card from play. At the end of the combat phase, discard all shadow cards that were dealt this round.\"\n\nSo it would be terribly unlucky and not only would the player not be able to search for and put Ungoliant's Spawn into the Staging Area, they would have to search for a different spider and then wait for Ungoliant's Spawn to come back around through a reset encounter discard pile (after the combat phase ended and it was finally discarded) and encounter deck card draw where it could end up being distributed as a shadow card yet again.\n\n*Edited since I can't form coherent sentences without caffeine in my system apparently."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541674","commentId":541674,"userName":"Lightster","timestamp":1318529698,"content":"Thank you guys. Last post help me a lot. I wasn't discarding the shadow cards dealt, I thought they were discarded just when the enemy dies.\n\n \n\nty ty ty ty\n\n \n\n=D"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541701","commentId":541701,"userName":"Svenn","timestamp":1318534713,"content":"Lightster said:\n\nThank you guys. Last post help me a lot. I wasn't discarding the shadow cards dealt, I thought they were discarded just when the enemy dies.\n\n \n\nty ty ty ty\n\n \n\n=D\n\n\n\nOh, I definitely realize that it's possible for that situation to come up, I was just worried that this was happening. I wanted to help him correct the mistake if that was the case. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I can imagine the game getting unnecessarily hard when you're keeping shadow cards on enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541772","commentId":541772,"userName":"radiskull","timestamp":1318549900,"content":"Marlow said:\n\nSo picture the scenario where two or more enemies are attacking a Tactics player and after the enemies have attacked and their shadow cards were revealed (one of them being Ungoliant's Spawn) the player attacks and kills one of the other enemies with Legolas and places enough progress tokens to advance the quest. The enemy with the Ungoliant's Spawn shadow card would still be sitting out there with a shadow card since that enemy wasn't killed and the combat phase hasn't ended.\n\n\n\nIn this situation it would be extremely foolish (IMO) to activate Legolas' response.  Remember that they are optional."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=541969","commentId":541969,"userName":"marlow4","timestamp":1318592567,"content":"radiskull said:\n\nIn this situation it would be extremely foolish (IMO) to activate Legolas' response.  Remember that they are optional.\n\n\n\nYes, for the experienced player. But consider a new player to the game playing the introductory quest scenario that Mirkwood is who wanted to go through the quest without reading ahead. Very rare chance of this specific Ungoliant Shadow Card Nightmare happening to a new player on their first quest but the pure evil of it humors me.\n\nWe should file this away for debates later when people question reading the quest cards and browsing the encounter decks before playing them.\n\n\"Hope for the best, prepare for the worst.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/54666-quick-question-about-dont-leave-the-path-quest/?do=findComment&comment=542036","commentId":542036,"userName":"ppsantos","timestamp":1318600897,"content":"After many games (even for my very first game), I still have not read ahead the quest cards, encounter cards, or the player cards in their entirety.  I enjoy the suprise and not knowing what might come. That's why I have not gone over the deck to find out how many of each card is in the deck, calculate the probabilities, etc.  Even when playing, I do not examine the discard encounter pile to calculate the chance that a particular card might show up in the staging area or as a shadow card.  I guess it's just my preference for the surpise factor.  But I do manage to win reasonably.\n\nGoing back to the original question, this could happen even to an experienced player.  Imagine a situation with Passage Through Mirkwood scenario at A Fork in the Road quest, Tactics deck with Legolas, combat phase, shadow cards have been dealt (but still unrevealed) to engaged enemies, then the player either uses Feint or Thicket of Spears (so no shadow card is revealed).  Then Legolas kills one enemy, but the enemy(ies)  with the unrevealed Ungoliant Spawn shadow card doesn't get killed.  Not knowing that the US is one of the unrevealed shadow cards and not knowing that the third stage of the quest will be Don't leave the Path, the player will naturally trigger Legolas' response. If Dont' Leave the Path is chosen, game proceeds to the third stage of the scenario with no possibility of finding the Ungoliant Spawn in the encounter deck or discard pile. Well, you could go through the Encounter deck until the US gets shuffled in and drawn, but you'd probably hit 50 threat before that happens.\n\nI suggest, to handle this weird situation, once the player discards the US shadow card, then he immediately puts that in play and continues the game. Another option is the player just selects the other path - Beorn's Path instead, and proceed with that, as if it was chosen in the first place, and carries on with the  game."}]}