{"url":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/","title":"Eleanor vs. Surge and Doomed","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541788","commentId":541788,"userName":"GhostWolf69","timestamp":1318558898,"content":"So... since I apparently missed the part in the FAQ where Surge and Doomed no longer is triggerd explicitly by being \"revealed\". All of a sudden I find my self confused on how to use Eleanor.\n\nNow I think we probably did it wrong to begin with... You see I use to think it was easy, Reveal a Treachery Card you don't want? Exhaust Eleanor to discard it and replace it with another Encounter Card revealed from the Encounter deck. Simple, really.\n\nNow... I'm looking too close again. I know I shouldn't.\n\n\"Response: Exhaust Eleanor to cancel the \"when revealed\" effects of a treachery card just revealed by the encounter deck. Then discard that card and replace it with the next card from the encounter deck.\"\n\nSo... before the FAQ I could have argued that since both Surge and Doomed are triggered by \"when revealed\" they are also cancelled, but now with the FAQ reverting this I'm not so sure.\n\nWhat happens if you use Eleanor to \"cancel\" Flooding for example? Before I started to think too much I would have simply replaced the card with the next one.\n\nNow it feels like I should first Execute \"Doomed 1\", then pull a Surge card, then instead of executing the \"when revealed effect\" I should draw another Encounter card again to replace that????\n\nThis cannot be what was intended, can it? That would make Eleanor completely useless against all Surge Cards for one thing, since it would just mean you get TWO new Encounter cards revealed instead of just the ONE.\n\nI will probably just ignore this and continue to play the way I think it should be but; What's your take on this?\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541804","commentId":541804,"userName":"Doom1502","timestamp":1318562607,"content":"I think I played it like your second example. Simply because I tend to resolve the cards from top to the bottom. Surge, Doom and then, hey \"when revealed\" - I can cancel that! There aren't that many when revealed cards with surge. So I guess it isn't so bad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541808","commentId":541808,"userName":"Feqz","timestamp":1318563938,"content":"Your assumptions are right. Eleanor does only cancel the \"when revealed\" part ot the card text. Doomed and surge are not canceld by her ability.\n\nStill I think she is a very strong hero. She can deal with the most nasty effects esp. damage dealing cards which could easily kill numerous allies and/or heros. In the end it's what your favor in gameplay.\n\nShe certainly can't cancel whole cards. Sure that would be nice but it also would make her too strong. Although she is limited she's my favorite hero at the moment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541814","commentId":541814,"userName":"GhostWolf69","timestamp":1318565987,"content":"I hear you.\n\nBut it gets messy just the same I think.\n\n\"Flooded\" (again) how should we handle the Surge???\n\nIs the Encounter Card Triggered by the Surge revealed and executed BEFORE we move on the the \"When Revealed\" Effect of the \"Flooded\" Card?\n\nAnd what if I want to cancel / replace the Surging card? that would then trigger a replacement.... also executed immediately and THEN we go back to the original Flooded Card and execute it's last event?\n\nMy brain hurts.... this is silly.\n\nOur group has used the \"cancel/replace\" the whole Treachery Card approach thinking it was the right way to go. And I must say Eleanor is good but not overpowered. Like Doom1502 said above... it's really not that many cards that this will matter on. and it sure save my head from sponatenous self-combustion due to stupid Rules.\n\nThis can't be it....\n\nMy House Rule is clear.\n\n \n\nWait.... hold on.... I just double checked the \"Surge\" rulebook p24.\n\n\"Resolve the surge keyword immediately after resolving any when revealed effects on the card.\"\n\nHAHA!!! By then the card is discarded and replaced if you ask me! YES! Finally some sense in the world.\n\nThank you for prodding me to look again guys.\n\nOne could probably also argue that FAQ:\n\n\"(1.02) Simultaneous Effect Timing\nIf two or more conflicting effects would occur simultaneously, the first player decides the order in which the effects resolve.\"\n\nUnless there is something explicit that says Doom always happen Before \"When Revealed\" effects, I'd argue that First Player can decide to execute the \"When Revealed\" effect First... and then replace the card before moving on to Doomed.\n\n/wolf\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541829","commentId":541829,"userName":"pumpkin","timestamp":1318568159,"content":" \n\nWhat we could do with is an improved Turn Sequencing diagram that makes it explicit in what order to deal with items on a encounter card.\n\nArkham Horror has a very specific sequence that is clearly defined in the rule book - LoTR sequence although defined (with notable exceptions, such as doomed vs. revealed) isn't made clear in the rulebook.\n\nDon't suppose anyone has made one or seen one on the interwebs on their travels?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541834","commentId":541834,"userName":"GhostWolf69","timestamp":1318569464,"content":"I have this one (slightly modified version of) a fan made Sequence.\n\nIt's not official in anyway but it has helped me through some spots.\n\nLooking at it now (with this topic in mind) I notice that this has \"When Revealed\" effects FIRST, then Doomed, then Surge.\n\nLike I said... it's not official, but I use it.\n\nLOTR:LCG TurnSequence [https://docs.google.com/leaf?id=0B3SkUl0_28P5NjlhOGExYWItNzQwMC00OTBmLTg5MGItMWZiNjI2OWUxMDQy&hl=en_GB]\n\nAnd to the original Creator of this document: Sorry I can't remember your name and give you credit.... and I hope you like my pimping! Take a Print Preview and see some FX gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541836","commentId":541836,"userName":"Rashley","timestamp":1318570299,"content":"A similar thread was started some time ago about the issue of Thalin questing and the Eastern Crows being encountered and having 'Surge'.  This got cleared up as no 'Surge' happening as the rules do state 'Surge' happens after 'revealing' and the Crows are destroyed on revealing.  I have to admit that I was allowing Eleanor to 'cancel' the whole Treachery card, but I do see that her card does state she only cancels the 'When revealed' part.  Therefore, as above, 'Surge' would be cancelled, but 'Doomed' does not have the same 'after dealing with the When Revealed' part that 'Surge' has in the rules.  As it stands, 'Doomed' would have to be applied.  I don't like it, but until it is FAQed, it will have to stand.  We must know what the designers intended.  Were 'Surge' and 'Doomed' intended to be treated in a similar way, or in different ways?  In the meantime, play your own way as it's your game, but I agree it needs clarification.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541844","commentId":541844,"userName":"GhostWolf69","timestamp":1318573919,"content":"Totally agree. This needs an FAQ for clarification.\n\nI did some more checking though, \"When Revealed\" is a Forced Effect and reading this through I get the feeling that it should trigger \"Immediately\". They use that word a lot.\n\n\"Forced and When Revealed Effects\n\nForced effects are initiated by specific occurrences throughout a game, and they occur automatically, whether the card’s controller wants them to or not. They are denoted by a bold “Forced:” trigger on a card. These effects initiate and resolve immediately, whenever their specified prerequisite occurs. The enemy card Marsh Adder provides an example of a forced effect that must be triggered whenever its specified trigger (“each time Marsh Adder attacks”) is met.\n\nWhen revealed effects are a special case of forced effects, that occur automatically as soon as the encounter card is revealed. They are denoted by a bold “When Revealed:” trigger on a card. When revealed effects do not resolve when the card is revealed as a shadow effect.\"\n\nNow... If Doomed should also be triggered Immediately, I'd say First Player decides according to FAQ quoted in post above.\n\nAnd he would be well within his right to Execute the \"When Revealed\" first, Respond with Eleanor, replace it with another card.\n\nThat is my personal take on this, and there fore I will continue to play like I did before this mess started in my head.\n\nThank you all for chiming in with your ideas.\n\n/wolf\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541853","commentId":541853,"userName":"pumpkin","timestamp":1318577257,"content":"GhostWolf69 said:\n\nTotally agree. This needs an FAQ for clarification.\n\nI did some more checking though, \"When Revealed\" is a Forced Effect and reading this through I get the feeling that it should trigger \"Immediately\". They use that word a lot.\n\n\"Forced and When Revealed Effects\n\nForced effects are initiated by specific occurrences throughout a game, and they occur automatically, whether the card’s controller wants them to or not. They are denoted by a bold “Forced:” trigger on a card. These effects initiate and resolve immediately, whenever their specified prerequisite occurs. The enemy card Marsh Adder provides an example of a forced effect that must be triggered whenever its specified trigger (“each time Marsh Adder attacks”) is met.\n\nWhen revealed effects are a special case of forced effects, that occur automatically as soon as the encounter card is revealed. They are denoted by a bold “When Revealed:” trigger on a card. When revealed effects do not resolve when the card is revealed as a shadow effect.\"\n\nNow... If Doomed should also be triggered Immediately, I'd say First Player decides according to FAQ quoted in post above.\n\nAnd he would be well within his right to Execute the \"When Revealed\" first, Respond with Eleanor, replace it with another card.\n\nThat is my personal take on this, and there fore I will continue to play like I did before this mess started in my head.\n\nThank you all for chiming in with your ideas.\n\n/wolf\n\n \n\n\n\nI agree with this interpretation and will also play this way until FAQ'd otherwise; I have also stolen your pimped up turn sequence! Cheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=541854","commentId":541854,"userName":"Svenn","timestamp":1318577454,"content":"That turn sequence thing is awesome! I linked to it over on my LCG resources page [http://tabletopgeeks.com/living-card-game-resources/].\n\nThis thread was really helpful. I didn't even think about the fact that her ability only says to cancel the When Revealed effects. I would say that unless there is a FAQ saying otherwise you execute the When Revealed first and then the Doomed/Surged keywords pretty much always."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542357","commentId":542357,"userName":"Feqz","timestamp":1318670959,"content":"Now you got me too GhostWolf69. That all puzzels me. Thank you for your persistent argumentation. This needs some clarification or more well thought rules in the first place gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542360","commentId":542360,"userName":"Troymk1","timestamp":1318672139,"content":" I concur,\n\n \n\nYou have proven to me that Surge & Doomed occur after the immediate effects (The forced when revealed)\n\n \n\nWell done sir!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542464","commentId":542464,"userName":"marlow4","timestamp":1318687878,"content":"I don't think the Thalin vs. Crows example is the same as Eleanor being exhuasted to cancel a Treachery's \"When Revealed\" effect.\n\nThalin's effect is constant while he is committed to the quest. He doesn't have to be exhausted in response, he's already exhausted. The player is not taking an action in response to something being revealed from the encounter deck, Thalin's ability is basically automated and action-free (and half the calories!).\n\nEleanor's ability is a Response and has to wait for a player to decide whether or not to exhaust and fire off her ability when a Treachery card is revealed.\n\n \n\nI think Doomed and Surge WOULD happen on a Treachery card that Eleanor is canceling. As you read the card text from left to right, top to bottom, you would get to the Doomed and Surge keywords before reading the text \"When Revealed:\" so you can't make the decision to cancel something before you get to it. Doomed and Surge would have already happened as you got to them going through the text block.\n\n \n\nI also feel some serious dejavu on this topic. Did we discuss this before?\n\n \n\nEdit to add: Concerning Treachery cards that add Surge from within the \"When Revealed:\" text, Eleanor would cancel the entire \"When Revealed:\" block and therefore Surge would not be applied. The text that would apply it got canceled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542570","commentId":542570,"userName":"silverhand77","timestamp":1318729575,"content":"The \"Doomed\" and When Revealed\" effects occur simultaneously but do not conflict. My take on this is that the \"When revealed\" efftect can be cancelled and therefore the \"Surge\" effect along with it since it resolves after the \"When Revealed\" effect resolves. However the \"Doomed\" effect would still trigger and resolve because it occurs immediately the card is revealed. The way I read it, it is an independant action to the \"When revealed\" efftect whereas \"Surge\" requires the \"When revealed\" effect to resolve before it can."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542634","commentId":542634,"userName":"silverhand77","timestamp":1318750345,"content":"silverhand77 said:\n\nThe \"Doomed\" and When Revealed\" effects occur simultaneously but do not conflict. My take on this is that the \"When revealed\" efftect can be cancelled and therefore the \"Surge\" effect along with it since it resolves after the \"When Revealed\" effect resolves. However the \"Doomed\" effect would still trigger and resolve because it occurs immediately the card is revealed. The way I read it, it is an independant action to the \"When revealed\" efftect whereas \"Surge\" requires the \"When revealed\" effect to resolve before it can.\n\n\n\nActually I think I'm wrong. On page 24 the rule book says \"Resolve the surge keyword immediately after resolving any when revealed effects on the card\". What then happens if there are no \"when revealed\" effects on a card that has 'Surge\" on it? is it just discarded? I think not. I'm now thinking that keywords such as \"doomed\" and \"surge\" resolve no matter what. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542780","commentId":542780,"userName":"pumpkin","timestamp":1318774812,"content":"Marlow said:\n\n \n\n I think Doomed and Surge WOULD happen on a Treachery card that Eleanor is canceling. As you read the card text from left to right, top to bottom, you would get to the Doomed and Surge keywords before reading the text \"When Revealed:\" so you can't make the decision to cancel something before you get to it. Doomed and Surge would have already happened as you got to them going through the text block.\n\n \n\n\n\n \n\nRule p.24 states that you resolve surge after any When revealed effects, the order they are shown on the card is not the order in which you resolve them, unfortunately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542789","commentId":542789,"userName":"marlow4","timestamp":1318775563,"content":"pumpkin said:\n\n \n\nRule p.24 states that you resolve surge after any When revealed effects, the order they are shown on the card is not the order in which you resolve them, unfortunately.\n\n \n\n \n\nThen I guess that solves it. Something that actually went in favor of the players for once. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nWhen Eleanor's ability is used, the Surge keyword (whether printed or added by the When Revealed text) doesn't get a chance to fire off and is nullified since the card is replaced.\n\nDoomed still applies though right? It doesn't say on p 24 that Doomed happens after any When Revealed effects are resolved like Surge does. Or should we say they both happen after \"When Revealed\" effects just to make it smooth?\n\nI can hear myself explaining this during a game. \"No, doomed DOES happen, surge doesn't. Because surge has to wait until the When Revealed section of the card is finished before it fires off but doomed doesn't have to wait, it's immediate when the card is revealed. Yep, When Revealed happens when a card is revealed and doomed happens when a card is revealed and surge happens when a card is revealed but AFTER the other stuff. Who's on first?\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542818","commentId":542818,"userName":"silverhand77","timestamp":1318779793,"content":"Marlow said:\n\npumpkin said:\n\n \n\nRule p.24 states that you resolve surge after any When revealed effects, the order they are shown on the card is not the order in which you resolve them, unfortunately.\n\n \n\n \n\nThen I guess that solves it. Something that actually went in favor of the players for once. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nWhen Eleanor's ability is used, the Surge keyword (whether printed or added by the When Revealed text) doesn't get a chance to fire off and is nullified since the card is replaced.\n\nDoomed still applies though right? It doesn't say on p 24 that Doomed happens after any When Revealed effects are resolved like Surge does. Or should we say they both happen after \"When Revealed\" effects just to make it smooth?\n\nI can hear myself explaining this during a game. \"No, doomed DOES happen, surge doesn't. Because surge has to wait until the When Revealed section of the card is finished before it fires off but doomed doesn't have to wait, it's immediate when the card is revealed. Yep, When Revealed happens when a card is revealed and doomed happens when a card is revealed and surge happens when a card is revealed but AFTER the other stuff. Who's on first?\"\n\n\n\nMarlow,\n\nI think that Surge and Doom both  happen anyway because by your logic with a card like Eastern Crows (that has Surge on it, but not when revealed)  it seems that you are saying that because there is no when revealed effect, there can be no surge. Does this mean that you would simply ignore that part of the text? No, I think that both keywords trigger immediately the card is revealed and if there is a when revealed effect, surge resolves after it, You can cancel the when revealed effect if you want, but surge still resolves after that. I believe that it is an independant action from the when revealed effect. I admit it does make it tougher, but to me it make more sense. I'm also thinking that in time we might see cards which cancel keywords though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=542829","commentId":542829,"userName":"silverhand77","timestamp":1318780825,"content":"I think the key to understanding how surge actually works lies in knowing when it actually triggers. Does it trigger (but not resolve) immediately a card bearing it is revealed from the encounter deck or does it trigger only after a when revealed effect?  I know that the rules say it resolves after a when revealed effect but I've been trying to find where in the rules &  official FAQ it says when it triggers but without success. The best I can glean is that the rules seem to imply that it triggers immediately and then if there is a when revealed effect it resolves after that and if not it just resolves immediately.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=543062","commentId":543062,"userName":"pumpkin","timestamp":1318833958,"content":" \n\nHaving Surge Trigger at the same time but resolve after a when revealed effect, just seems very convoluted, especially as Eleanor's ability reads \"Exhaust Eleanor to cancel the the \"when revealed\" effects of a treachery card just revealed by the encounter deck. Then, discard that card, and replace it with the next card from the encounter deck.\"\n\nThe cancelling and then discarding are all done within the ability, but now even though the card is discarded I then need to apply the surge and doomed keywords that are on a card that is discarded? I don't think so.\n\nThe cleanest method is as Ghostwolf said, if Eleanor cancels the When revealed effect, the card is discarded before any other keywords are resolved and another card replaces it.\n\nIt's not clear from the rules/FAQ if that is 100% the designer's intention, but it is the simplest, cleanest and easiest to remember solution and there is nothing in the rules/FAQ to support a complete argument against it.\n\nMarlow, if you want some ruling that helps to suggest Doom doesn't trigger, then you can use the fact that when there is a timing conflict (as there is with Doomed and When revealed, as in the rules it isn't clear which should resolve first) the first player gets to decide the order, so any first player in his right mind would resolve when revealed first, then cancel with Eleanor and so Doomed (and Surge) never resolves.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=543079","commentId":543079,"userName":"silverhand77","timestamp":1318837585,"content":"pumpkin said:\n\n \n\nHaving Surge Trigger at the same time but resolve after a when revealed effect, just seems very convoluted, especially as Eleanor's ability reads \"Exhaust Eleanor to cancel the the \"when revealed\" effects of a treachery card just revealed by the encounter deck. Then, discard that card, and replace it with the next card from the encounter deck.\"\n\nThe cancelling and then discarding are all done within the ability, but now even though the card is discarded I then need to apply the surge and doomed keywords that are on a card that is discarded? I don't think so.\n\nThe cleanest method is as Ghostwolf said, if Eleanor cancels the When revealed effect, the card is discarded before any other keywords are resolved and another card replaces it.\n\nIt's not clear from the rules/FAQ if that is 100% the designer's intention, but it is the simplest, cleanest and easiest to remember solution and there is nothing in the rules/FAQ to support a complete argument against it.\n\nMarlow, if you want some ruling that helps to suggest Doom doesn't trigger, then you can use the fact that when there is a timing conflict (as there is with Doomed and When revealed, as in the rules it isn't clear which should resolve first) the first player gets to decide the order, so any first player in his right mind would resolve when revealed first, then cancel with Eleanor and so Doomed (and Surge) never resolves.\n\n\n \n\n\n\nI would agree with you about your method with Eleanor if there weren't cards like Eastern Crows for example which have the surge keyword but no when revealed effect. Are you suggesting that surge when it appears on Eastern Crows should just be ignored? I'm confused because it seems to me that you are playing the same keyword a different way for each card it is on. Wouldn't it be easier if it was one way for all? I can see that the mechanic would work both ways though. Also I'm not sure that I'd say the way you suggest is the cleanest way, because with my interpretation the keyword would be played the same way in all instances. I'm don't think that there is a timing conflict either, if all three effects on flooding happen simultaneously. the only timing consideration is when the surge keyword resolves and we know that the rules say on p24 that it resolves after any when revealed effects. So what I'm saying is this:\n\n1. Flooding is revealed from the encounter deck.\n\n2. Doomed. Surge and When revealed all trigger simultaneously, Doomed resolves because there's no way to cancel it.\n\n3. Player actions happen such as Eleanor's ability which cancels the when revealed effect. and reveals a new card from the encounter deck\n\n4.  Surge resolves\n\nso as you can see, there is no timing conflict. However this all hinges on whether keywords trigger immediately the card is revealed, which as I said I can find nothing to confirm or deny this in the official rules and FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=543084","commentId":543084,"userName":"Svenn","timestamp":1318838679,"content":"silverhand77 said:\n\npumpkin said:\n\n \n\n \n\nHaving Surge Trigger at the same time but resolve after a when revealed effect, just seems very convoluted, especially as Eleanor's ability reads \"Exhaust Eleanor to cancel the the \"when revealed\" effects of a treachery card just revealed by the encounter deck. Then, discard that card, and replace it with the next card from the encounter deck.\"\n\nThe cancelling and then discarding are all done within the ability, but now even though the card is discarded I then need to apply the surge and doomed keywords that are on a card that is discarded? I don't think so.\n\nThe cleanest method is as Ghostwolf said, if Eleanor cancels the When revealed effect, the card is discarded before any other keywords are resolved and another card replaces it.\n\nIt's not clear from the rules/FAQ if that is 100% the designer's intention, but it is the simplest, cleanest and easiest to remember solution and there is nothing in the rules/FAQ to support a complete argument against it.\n\nMarlow, if you want some ruling that helps to suggest Doom doesn't trigger, then you can use the fact that when there is a timing conflict (as there is with Doomed and When revealed, as in the rules it isn't clear which should resolve first) the first player gets to decide the order, so any first player in his right mind would resolve when revealed first, then cancel with Eleanor and so Doomed (and Surge) never resolves.\n\n\n \n\n \n\n \n\nI would agree with you about your method with Eleanor if there weren't cards like Eastern Crows for example which have the surge keyword but no when revealed effect. Are you suggesting that surge when it appears on Eastern Crows should just be ignored? I'm confused because it seems to me that you are playing the same keyword a different way for each card it is on. Wouldn't it be easier if it was one way for all? I can see that the mechanic would work both ways though. Also I'm not sure that I'd say the way you suggest is the cleanest way, because with my interpretation the keyword would be played the same way in all instances. I'm don't think that there is a timing conflict either, if all three effects on flooding happen simultaneously. the only timing consideration is when the surge keyword resolves and we know that the rules say on p24 that it resolves after any when revealed effects. So what I'm saying is this:\n\n1. Flooding is revealed from the encounter deck.\n\n2. Doomed. Surge and When revealed all trigger simultaneously, Doomed resolves because there's no way to cancel it.\n\n3. Player actions happen such as Eleanor's ability which cancels the when revealed effect. and reveals a new card from the encounter deck\n\n4.  Surge resolves\n\nso as you can see, there is no timing conflict. However this all hinges on whether keywords trigger immediately the card is revealed, which as I said I can find nothing to confirm or deny this in the official rules and FAQ.\n\n\n\nThe problem is that in step 4 the card is already discarded. You can't resolve an effect on a card no longer in play. If the When Resolved was canceled but the same card stayed in play, then yes you would resolve anything following it. However, when a card is discarded you no longer trigger anything from that card.\n\nI would also have to agree with pumpkin here. Surge, Doomed, and When Revealed trigger immediately. We know that Surge triggers after the When Revealed. Doomed and the When Revealed trigger simultaneously, so as stated in the rules the first player chooses which to resolve first. If the When Revealed is canceled and the card is discarded then Surge and Doomed would simply not trigger as the card is already out of play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=543109","commentId":543109,"userName":"silverhand77","timestamp":1318842083,"content":"Svenn said:\n\nsilverhand77 said:\n\n \n\npumpkin said:\n\n \n\n \n\nHaving Surge Trigger at the same time but resolve after a when revealed effect, just seems very convoluted, especially as Eleanor's ability reads \"Exhaust Eleanor to cancel the the \"when revealed\" effects of a treachery card just revealed by the encounter deck. Then, discard that card, and replace it with the next card from the encounter deck.\"\n\nThe cancelling and then discarding are all done within the ability, but now even though the card is discarded I then need to apply the surge and doomed keywords that are on a card that is discarded? I don't think so.\n\nThe cleanest method is as Ghostwolf said, if Eleanor cancels the When revealed effect, the card is discarded before any other keywords are resolved and another card replaces it.\n\nIt's not clear from the rules/FAQ if that is 100% the designer's intention, but it is the simplest, cleanest and easiest to remember solution and there is nothing in the rules/FAQ to support a complete argument against it.\n\nMarlow, if you want some ruling that helps to suggest Doom doesn't trigger, then you can use the fact that when there is a timing conflict (as there is with Doomed and When revealed, as in the rules it isn't clear which should resolve first) the first player gets to decide the order, so any first player in his right mind would resolve when revealed first, then cancel with Eleanor and so Doomed (and Surge) never resolves.\n\n\n \n\n \n\n \n\nI would agree with you about your method with Eleanor if there weren't cards like Eastern Crows for example which have the surge keyword but no when revealed effect. Are you suggesting that surge when it appears on Eastern Crows should just be ignored? I'm confused because it seems to me that you are playing the same keyword a different way for each card it is on. Wouldn't it be easier if it was one way for all? I can see that the mechanic would work both ways though. Also I'm not sure that I'd say the way you suggest is the cleanest way, because with my interpretation the keyword would be played the same way in all instances. I'm don't think that there is a timing conflict either, if all three effects on flooding happen simultaneously. the only timing consideration is when the surge keyword resolves and we know that the rules say on p24 that it resolves after any when revealed effects. So what I'm saying is this:\n\n1. Flooding is revealed from the encounter deck.\n\n2. Doomed. Surge and When revealed all trigger simultaneously, Doomed resolves because there's no way to cancel it.\n\n3. Player actions happen such as Eleanor's ability which cancels the when revealed effect. and reveals a new card from the encounter deck\n\n4.  Surge resolves\n\nso as you can see, there is no timing conflict. However this all hinges on whether keywords trigger immediately the card is revealed, which as I said I can find nothing to confirm or deny this in the official rules and FAQ.\n\n \n\n \n\nThe problem is that in step 4 the card is already discarded. You can't resolve an effect on a card no longer in play. If the When Resolved was canceled but the same card stayed in play, then yes you would resolve anything following it. However, when a card is discarded you no longer trigger anything from that card.\n\nI would also have to agree with pumpkin here. Surge, Doomed, and When Revealed trigger immediately. We know that Surge triggers after the When Revealed. Doomed and the When Revealed trigger simultaneously, so as stated in the rules the first player chooses which to resolve first. If the When Revealed is canceled and the card is discarded then Surge and Doomed would simply not trigger as the card is already out of play.\n\n\n\nCan you please tell me where in the rules or official FAQ it says that you can't resolve an effect on a card no longer in play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=543121","commentId":543121,"userName":"GhostWolf69","timestamp":1318843162,"content":"To me a lot of this boils down to \"First Player Decides\".\n\nWhen you have multiple effects happening at the same time like: Immediately, or When Revealed. the FAQ explicitly tells us that the first player can decide.\n\nNormally that would mean interpreting events in favour of the players, i.e. Thalin will kill the crows before the Surge happens, Eleanor will cancel/replace the card before the Doom occurs etc.\n\n\"(1.02) Simultaneous Effect Timing\nIf two or more conflicting effects would occur simultaneously, the first player decides the order in which the effects resolve.\"\n\nIRT Silverhand77: Remind me never to play a game where you are allowed to take the First Player Decision gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54700-eleanor-vs-surge-and-doomed/?do=findComment&comment=543124","commentId":543124,"userName":"Svenn","timestamp":1318843408,"content":"silverhand77 said:\n\n \n\nCan you please tell me where in the rules or official FAQ it says that you can't resolve an effect on a card no longer in play?\n\n\n\nHow about this from the FAQ?\n\n\"(1.02) Simultaneous Effect Timing\nIf two or more conflicting effects would occur simultaneously, the first player decides the order in which the effects resolve.\n\nExample: Tom plays Sneak Attack (CORE 23) to put Beorn (CORE 31) into play during the combat phase. Sneak Effect has the condition, “At the end of the phase, if that ally is still in play, return it to your hand.” During combat, Tom uses Beorn’s triggered effect, which has the condition, “At the end of the phase in which you trigger this effect, shuffle Beorn back into your deck.” At the end of the phase, a situation arises in which two conflicting effects are attempting to resolve simultaneously on Beorn. The first player determines which of the two effects resolves first. (The second effect no longer applies when Beorn leaves play.)\"\n\nThis is the same situation... two simultaneous effects. The first player chooses which resolves first and then the second no longer applies because the card has left play."}]}