{"url":"https://community.fantasyflightgames.com/topic/54736-error-on-official-faq-example-111-using-quick-strike/","title":"Error on Official FAQ example 1.11 using Quick Strike?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54736-error-on-official-faq-example-111-using-quick-strike/?do=findComment&comment=542092","commentId":542092,"userName":"ppsantos","timestamp":1318605880,"content":"In the Official FAQ 1.11 Limitation on Attacks, the example of a player using Quick Strike to declare another attack on the Hill Troll looks erroneous.   Quick Strike reads \"Action: Exhaust a character you control to immediately declare it as an attacker (and resolve its attack) against any eligible enemy target.\"  I think the operative word here is \"eligible\" which the FAQ example left out.  The Hill Troll is no longer eligible since the player already declared attack against it the first time.  The rules (and the FAQ) make it clear that a player can only declare 1 attack against an enemy.  Quick Strike allows the player to declare a character as an attacker against an enemy, but it has to be an eligible target, which the Hill Troll isn't.   I don't think there is a Golden Rule situation here either.  You can satisfy both the rule (1 player attack declaration only per enemy) and Quick Strike (immediately declare attack against eligible enemy)  by selecting an enemy that the player has not declared attack against yet.  In the FAQ example, if the Hill Troll is the only enemy available then Quick Strike's requirements (eligible enemy) cannot be satisfied. Hence you cannot play it.\n\nWhat do you think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54736-error-on-official-faq-example-111-using-quick-strike/?do=findComment&comment=542094","commentId":542094,"userName":"Dam the Man","timestamp":1318606359,"content":"I think the point is that a player can only declare 1 attack against an Enemy per turn during that particular phase of the turn; Combat Phase, Attacking Enemies. So you can't attack the Hill Troll, then Grim Resolve everyone back to ready and declare another attack on the Hill Troll, but through an Event like Quick Strike, you get to do another attack with a character (who can attack the same Enemy more than once per turn). Even the FAQ mentions combat phase specifically:\n\n\"When a player is the active attacker during the combat\nphase, the game rules grant him the option to declare\n1 attack against each enemy with which he is engaged.\" (p. 3)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54736-error-on-official-faq-example-111-using-quick-strike/?do=findComment&comment=542149","commentId":542149,"userName":"Vyron2","timestamp":1318613568,"content":" yes, DAM, that's the way I see it, too! so if you declare an attack in the e.g. RESOURCE phase via quick strike, and THEN another one in the combat phase, this is perfectly ok within the rules! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] no golden rule situation there...."}]}