{"url":"https://community.fantasyflightgames.com/topic/54743-rhosgobel-rules-questions-glorfindelwilyadorathelasetc/","title":"Rhosgobel Rules Questions - Glorfindel/Wilyador/Athelas/etc","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54743-rhosgobel-rules-questions-glorfindelwilyadorathelasetc/?do=findComment&comment=542143","commentId":542143,"userName":"Vyron2","timestamp":1318613227,"content":" Hey guys, couple of quick questions about which I'm not 100% sure:\n\n \n\n1. Does Athelas count as an attachment (\"attach\" in text, but OBJECTIVE as type) - deal 1 damage to each character without attachment? (swarming insects) - no, if athelas attached???\n\n \n\n2. if TWO athelas come up from the encounter deck in a row - do I place two additional cards as \"guarded\", or only on the 2nd athelas? according to p.24 rulebook, yes, on both!\n\n3. if athelas comes into play via forest grove from the DISCARD pile - is the guarded keyword (rulebook: enters play from ENCOUNTER DECK, p. 24) triggered - according to rulebook, no!?\n\n4. does wilyador count as an ally? yes? and he changes players each round (constant effect?) so festering wounds - 1 damage to each character - also applies to wilyador? (Grimbeorn has the same \"effect\" - so he changes players, too???)\n\n5. if glorfindel ever heals wilyador after stage 1 - is he REMOVED FROM THE GAME??? a bit harsh... is glorfindel's ability a card effect???\n\n6. can I play self preservation on wilyador?\n\n \n\nplease answer by referencing the number... thanks in advance to all of you guys... rhosghobel is so hard in solo mode... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nps: FAQ, maybe???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54743-rhosgobel-rules-questions-glorfindelwilyadorathelasetc/?do=findComment&comment=542155","commentId":542155,"userName":"marlow4","timestamp":1318614148,"content":"1. Yes, Athelas would be an attachment when claimed and attached to a hero and Swarming Insects treachery card would not damage that hero.\n\n2. Yes, each Athelas would get a guard card as far as I know.\n\n3. I asked something similar recently. I was told that the guarded keyword applies at any time the card with that keyword comes into play. So yes, after searching for the Athelas and putting it into play, it would get a guard card.\n\n4. Grimbeorn does not change owners each round, he becomes an ally under the control of whoever is the first player when he gets enough resources on him to pay his cost per the card text. Wilyador does change owners each round when the first player token moves to another player and he counts as an ally. A lot of the treachery and shadow card effects in Journey to Rhosgobel are designed to wound Wilyador further so that he takes more damage than just the two at the end of each round.\n\n5. Yes, Glorfindel would be removed from the game. So his healing effect would be used as a last resort in that situation, better to use other methods first.\n\n6. No attachments can be placed on Wilyador."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54743-rhosgobel-rules-questions-glorfindelwilyadorathelasetc/?do=findComment&comment=542258","commentId":542258,"userName":"Vyron2","timestamp":1318642274,"content":" haha, thanks - of course, I forgot the \"no attachments\" part - didn't have the cards in front of me :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nthank you very much - just one more:\n\n7. when driven by shadow comes into play - +1 threat for each location and enemy in staging area - via wilyador-wounding as per stage 2 quest card, does it give +1 only to the cards already in the staging area, or also to the subsequent cards revealed during the quest phase? (stage 2: at the beginning of the quest phase, you may look at the top 3 cards, blah blah)\n\n \n\nthanks again!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54743-rhosgobel-rules-questions-glorfindelwilyadorathelasetc/?do=findComment&comment=542264","commentId":542264,"userName":"Dam the Man","timestamp":1318644431,"content":"Driven by Shadow only boosts those cards that are in the staging when it is revealed (if none, DbS gains Surge). So the best time would be when there is just 1 card out there, +1 threat shouldn't be too much to handle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54743-rhosgobel-rules-questions-glorfindelwilyadorathelasetc/?do=findComment&comment=3095706","commentId":3095706,"userName":"Hitbaz","timestamp":1511616266,"content":"About 3) - \n\nOfficial FAQ 1.8:\n\nQ: Does the Guarded keyword trigger when the encounter card it’s on is “added” to the staging area (and not “revealed”)? \n\nA: No. In order for the Guarded keyword to trigger, the encounter card it appears on must be “revealed” from the encounter deck.\n\n(Forest Grove Response: After the players explore Forest Grove, search the encounter deck and discard pile for 1 Athelas objective, and add it to the staging area. Then, shuffle the encounter deck)\n\nEdited November 25, 2017 by Hitbaz"}]}