{"url":"https://community.fantasyflightgames.com/topic/54740-escape-from-dol-guldor-thinking-about-keeping-game-notes/","title":"Escape from Dol Guldor ... thinking about keeping game notes.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54740-escape-from-dol-guldor-thinking-about-keeping-game-notes/?do=findComment&comment=542119","commentId":542119,"userName":"OjoDelPensador","timestamp":1318610411,"content":"So my friend and I tackled this again as a 2-player game, and at first we were just cruising.  Seems like the start of the game has much to do with whatever is drawn as the guards for the Objectives.\n\nBut after finishing part 1, we got the smack down from the game.  We took out the Nazgul easily enough, but the limitation on playing only one ally per round for the whole group was brutal.  And we had a sudden deluge of locations that pumped up our staging area threat.  And we got smacked by Treachery cards, three of the \"each exhausted character takes one damage\" in a row (the first voided by Eleanor who then died after the 3rd one :-( ).\n\nSo we've had mixed \"luck\", but we are also wondering if we are still missing some tactical advantages.  I have this idea of creating a spreadsheet to track and annotate game activity, and then using it to document the course of a game.  However, this would be primarily useful if there are others willing to review such game notes and make comments.\n\nAre there folks on this Forum that would be willing to comment on such game notes?\n\n~Bene"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54740-escape-from-dol-guldor-thinking-about-keeping-game-notes/?do=findComment&comment=542147","commentId":542147,"userName":"Vyron2","timestamp":1318613453,"content":" sure, if they're VERY concise, succint and only basic problems - not EVERY detail... but we would be glad to help - my recommendation so far: try again, about 10 games with different decks and strategies and heroes - if you can't win a SINGLE game... THEN post the next games here... it's mostly about getting to know the encounter deck and all its dangers - then you lose the \"fear\" and eventually beat the scenario... :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54740-escape-from-dol-guldor-thinking-about-keeping-game-notes/?do=findComment&comment=544706","commentId":544706,"userName":"jaycadiramen","timestamp":1319092577,"content":"Do you mean something similar to the Quest Tracker that FFG provides, or something entirely different that you've created yourself?\n\nI like the FFG quest log and use it to make pretty extensive notes."}]}