{"url":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/","title":"A little bit of advice for a new player please...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542213","commentId":542213,"userName":"Skowza","timestamp":1318628660,"content":"Hello All! \nI was introduced to this game a few days back and I was impressed. I’m hoping to get some pretty basic deckbuilding advice so I can join the other two guys that play. I figure I’ll need a Core and one or two APs and hopefully I can use some of their extra cards and their extra heroes if I don’t have the ones I need.\nI played with a pure tactics deck because that’s all they had left to build out of, but I liked all of the other spheres of influence better than tactics. Their two decks consist of:\n\n \n\n1. Dunhere, Prince Imrahil, Theodred – a lot of allys and attachments.\n2. Glorfindel, Eowyn, Beravor – mostly draw mechanics, healing, and cancel events.\n\nSo I’m wondering what I can build that would support these two decks well; I was thinking of running a low-threat deck with Frodo, Eleanor, and unknown (Gloin or maybe Brand?) and playing mostly support mechanics like Ancient Mathom. Is this a good idea? Would you recommend a different build to compliment theirs? I’m pretty familiar with CCGs/LCGs, I just don’t know the LotR cards well enough, though I’ll be perusing cardgamedb later tonight.\nThanks for any feedback!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542225","commentId":542225,"userName":"gamestar10","timestamp":1318631257,"content":"It's hard not knowing playstyles of the players. You know them better than I do :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I think once you get the core set, run the scenerios with each solo deck to get to know the cards. When you find the one you like most, play again and decide what works and what doesn't. Ask yourself what cards from the other spheres will help you achieve what you're wanting to do. \n\nIt's hard enough to build with a theme with just the core set. Research which APs have cards that will add to your pool and help you in a support role with your friends and grab those.  Hopefully, you'll end up with enough cards to build on a theme. My favorite is Rohan.\n\nEither way, the more you play, the better you'll get. Enjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542227","commentId":542227,"userName":"marlow4","timestamp":1318631677,"content":"Are these going to be two player games of three player? The main thing to avoid is using the same heroes. Other than that it's all about personal preference.\n\nTactics is pretty much the brute squad of the game. They take on enemies, chew 'em up, and spit out the bones.\n\nSpirit is very good at taking care of locations, and some quest scenarios are location heavy.\n\nIf you guys start playing 3-player you might want to go with mono-faction decks for all three of you. That's the easiest way to avoid using the same heroes or same unique cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542232","commentId":542232,"userName":"Skowza","timestamp":1318634309,"content":"Marlow said:\n\nAre these going to be two player games of three player? The main thing to avoid is using the same heroes.\n\n\n\nThree player, otherwise I would want some of the heroes they are already using.  I was also considering Legolas for my third character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542253","commentId":542253,"userName":"Periculum","timestamp":1318641992,"content":"I've taken the helm of frequent Spirit/Lore decks around here while other players play mono Tactics and/or leadership. The Song cards help a lot in dual decks. I think all of them but tactics have a song at the moment. Along with Celebrians Stone, Aaragorn can be mixed into spirit decks as well. I've found a good rule is to pick your heroes based on the \"power\" cards you want to use. If the only cards that I want to use from one sphere are two points or less, I'll use one hero from that sphere and two from the sphere with the power cards. Lore also has an ally that can grab songs, which makes them even better suited for that line of work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542284","commentId":542284,"userName":"Dwnhmcntryboy","timestamp":1318648659,"content":" Sound like you have a player that can quest and support the other guy so he can attack. Try building an all questing deck and it should leave room for the support guy to do even more.\n\nThe biggest thing is whats already been said, \"build your deck play a few solo games.\"\n\nFor me, I like to build a solo deck and then play it in multiplayer games. I figure if my deck can handle itself in solo mode, 7 outta 10 times it will fare well in multiplayer.\n\nI have a knee jerk way of building my decks for this game. If you are interested PM me, if not, just go for it and have fun.\n\nIf you want to build a solid support deck for 3 player only games I would recommend Brand Son of Bain/Bilbo/Denethor.\n\nAragorn, Theodred, Elenor and Legolas are other great supporting characters"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542456","commentId":542456,"userName":"lleimmoen","timestamp":1318687221,"content":"Skowza said:\n\nHello All! \nI was introduced to this game a few days back and I was impressed. I’m hoping to get some pretty basic deckbuilding advice so I can join the other two guys that play. I figure I’ll need a Core and one or two APs and hopefully I can use some of their extra cards and their extra heroes if I don’t have the ones I need.\nI played with a pure tactics deck because that’s all they had left to build out of, but I liked all of the other spheres of influence better than tactics. Their two decks consist of:\n\n \n\n1. Dunhere, Prince Imrahil, Theodred – a lot of allys and attachments.\n2. Glorfindel, Eowyn, Beravor – mostly draw mechanics, healing, and cancel events.\n\nSo I’m wondering what I can build that would support these two decks well; I was thinking of running a low-threat deck with Frodo, Eleanor, and unknown (Gloin or maybe Brand?) and playing mostly support mechanics like Ancient Mathom. Is this a good idea? Would you recommend a different build to compliment theirs? I’m pretty familiar with CCGs/LCGs, I just don’t know the LotR cards well enough, though I’ll be perusing cardgamedb later tonight.\nThanks for any feedback!\n\n \n\n\n\nI like Dunhere. I mean the art is really good, the character has little weight on the story but I like it. As for the game, it can be very good but it is surely situational character, and probably much better in a solo deck that starts with a low threat and has Eowyn to do the questing. So, as you wanted tips, I give you this, switch Dunhere (as much as I feel bad saying it) for someone else. You can wait for Boromir as he will fit the Imrahil deck perfectly with Horn of Gondor, you will then need one Spirit character in there instead of Theodred (who is excellent, I know). Do not worry about tri-sphere deck, it'll do just fine. And the spirit character should be Eowyn, so you have a well questing deck with all the spirit allies like the horses, horse-breaker and escort. And the scout from Leadership.\n\nFor the other deck, try Theodred with Aragorn and Beravor. Wait for a better version of Glorfindel. Those are my advise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542732","commentId":542732,"userName":"Skowza","timestamp":1318767274,"content":"Thanks for all the feedback guys!  I love the FFG forums, community support is always great here, and I'll probably have more questions once I am more familiar with the cards.\n\nlleimmoen said:\n\nSo, as you wanted tips, I give you this, switch Dunhere (as much as I feel bad saying it) for someone else. You can wait for Boromir as he will fit the Imrahil deck perfectly with Horn of Gondor, you will then need one Spirit character in there instead of Theodred (who is excellent, I know).\n\n\n\nAs much as I would love to have access to some of the heroes the others are using, I don't want to ask the people who introduced me to the game to change their decks to accommodate mine.  I'll consider this for any solo deck I build though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54751-a-little-bit-of-advice-for-a-new-player-please/?do=findComment&comment=542925","commentId":542925,"userName":"Keggy","timestamp":1318797189,"content":"Your friends have two heroes from each sphere but tactics, so I would reccomend coming in with two tactics heroes to avoid stepping on any toes; Legolas and Brand would be my first pick, but Gimli would be a solid substitute for Brand.  With your third hero, I'd recommend  Elanor, Frodo, or Denethor.  Spirit has several cheap events that are quite helpful, so I would suggest Spirit over Lore until you get a bit more comfortable with the game.  Or, if you and the Lore player are up to it, you could run Gloin and make money rain from the sky.\n\nNo matter what you decide to go with, you should ask them about the unique cards they are using so you can try to avoid unnecessary overlap."}]}