{"url":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/","title":"Sorry to say but Hills of Emin Muil is... boring","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542332","commentId":542332,"userName":"Shelfwear","timestamp":1318666319,"content":"Sorry guys, I love this game but this I had to say. I would buy the AP again (for the completist's sake alone) but I dont think I will play this scenario ever again. The last two days a friend and I played a LotR LCG marathon including all quests except Mirkwood and Osgiliath and Emin Muil felt really like a big letdown compared to all other scenarios. (Its not about the difficulty, its about the lack of thrill and enjoyment of this quest)\n\nDont get me wrong, I enjoy playing Hunt for Gollum (a scenario some of you dislike and see similarities to Emin Muil). Gollum involves questing, dangerous surprise attacks and some clever thinking concerning the clue cards. But Emin Muil was questing, questing, questing, countering Rockslides and a totally anticlimatic end that comes out of the blue by placing progress tokens on some odd location or other. At some point while playing Emin Muil one of my heroes died but I really didnt care bc it made no real difference on how I perceived the whole scenario. An unthinkable emotional blankness that never happens in any other LotR scenario so far.\n\nI hope Emin Muil was only a one-time experiment for this excellent game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542335","commentId":542335,"userName":"Dam the Man","timestamp":1318666566,"content":"Still no EM for me, but just one quest card and a ton of locations doesn't promise much. Still picking it up though, at least those Riddermarkers allow me to finally get rid of Wandering Took (die hobbits!!!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542348","commentId":542348,"userName":"Eryx_UK","timestamp":1318668703,"content":"It's not the most interesting scenario it has to be said. It needed more enemies to balance out the constant questing. I think the challenge of it is supposed to be the constant churn out of locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542371","commentId":542371,"userName":"Glaurung","timestamp":1318675055,"content":"Dam said:\n\nStill no EM for me, but just one quest card and a ton of locations doesn't promise much. Still picking it up though, at least those Riddermarkers allow me to finally get rid of Wandering Took (die hobbits!!!).\n\n\n\nI also didn get it yet but my fears comeback cose of this pack. I really scare we will have second cycle boring and easy. Hope not hope not hope not!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542399","commentId":542399,"userName":"marlow4","timestamp":1318679776,"content":"I like it because it's soloable. I can play EM in between multi-player sessions week to week. Can relax a bit and enjoy the artwork.\n\nI'd also rule that only the victory points beyond the 20 needed for success count in terms of score reduction. That seems to be one of the complaints about this particular scenario, that since one of the mechanics of winning is collecting victory points it skews the score for this one scenario compared to others. So we should only reduce our scores from VP when we gather more than 20. You get 22 total victory points, you win, reduce your score by 2 for the 2 excess VP instead of 22."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542403","commentId":542403,"userName":"conykchameleon","timestamp":1318680023,"content":"I absolutely agree with the OP. BUT, Brand has opened up new possibilities for finally beating Massing at Osgiliath with two players. This alone makes me really glad I bought the AP, even though the quest is laughably easy/boring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542404","commentId":542404,"userName":"Glaurung","timestamp":1318680142,"content":"conykchameleon said:\n\nI absolutely agree with the OP. BUT, Brand has opened up new possibilities for finally beating Massing at Osgiliath with two players. This alone makes me really glad I bought the AP, even though the quest is laughably easy/boring.\n\n\n\nYes players cards in this pack is awesome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542411","commentId":542411,"userName":"gamestar10","timestamp":1318681805,"content":"I agree with you that it's boring. My friend and I realized that with this AP, we had to make theme decks (mine was Rohan since Emyn Muil borders Rohan) to put any enjoyment into this AP. First play of it was cool with the win standards (20+ VP and no Emyn Muil lands in play) but even that was a little boring considering.\n\nMy fear is that Dead Marshes will be similar because as the story goes, Aragorn only happens upon Gollum in the Dead Marshes after Gollum is released from Mordor.  Then he escorts him to Mirkwood to be held and guarded by the Elves.  FFG is going to really have to put some story into this next AP to make it a fun experience, not just add a few gimmicky mechanics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542425","commentId":542425,"userName":"Glaurung","timestamp":1318683800,"content":"gamestar10 said:\n\nI agree with you that it's boring. My friend and I realized that with this AP, we had to make theme decks (mine was Rohan since Emyn Muil borders Rohan) to put any enjoyment into this AP. First play of it was cool with the win standards (20+ VP and no Emyn Muil lands in play) but even that was a little boring considering.\n\nMy fear is that Dead Marshes will be similar because as the story goes, Aragorn only happens upon Gollum in the Dead Marshes after Gollum is released from Mordor.  Then he escorts him to Mirkwood to be held and guarded by the Elves.  FFG is going to really have to put some story into this next AP to make it a fun experience, not just add a few gimmicky mechanics.\n\n\n\nI start to scare about this couples of months before........And i talking about this many times on this forum.\n\nI really hope the DM and RTM will be  fine. The last 2 quest in the cycle should really interesting and hard.And i really start to scare for Khazad- dum too. Some fans now make some really good scenario and this scenario much more fit Tolkien world and looks better then FFG produce.\n\nhttp://boardgamegeek.com/article/7636369#7636369 [http://boardgamegeek.com/article/7636369#7636369]\n\nUnderstand me right. I love the game but sure we need more interesting quests!!!!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542459","commentId":542459,"userName":"Narsil0420","timestamp":1318687331,"content":"For those of you out there that complain about how easy certain quests are: There's no rule that you have to use your best deck against every quest. Try playing with heroes you'd normally not play with, you can make the quest more difficult for yourself by doing that. You can take responsibility for your own enjoyment instead of blaming the game all the time! Also you can try playing with a deck that is counter to what the scenario seems to call for (for instance try using an all Tactics deck against emyn muil). I love locations so i've enjoyed this scenario even though it's easier. I've also enjoyed having a scenario against which I can really build up my heroes and allies to the fullest, Most of the time I never feel like i can develop my strategies/play area to the fullest, so that's kind of fun once in a while.\n\nChin up lads."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542494","commentId":542494,"userName":"gamestar10","timestamp":1318698098,"content":"You're absolutely right, Narsil. I did enjoy the location references in this AP as being along the route that the fellowship took in the book. I praised the Northern Tracker and Ride to Ruin in my deck as the clear winners to this scenerio. As I said before, this AP requires the player to put the story into it and although Rohan has a special place in my heart, I'd be willing to run a Lead/Tac deck (which still allows me Rohan characters) to put story into it.\n\nHowever, the mechanic remains the same. It would just take longer to do the same job as any other deck but I will try it to see if it adds anything.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542513","commentId":542513,"userName":"Style75","timestamp":1318704243,"content":" \n\nI'm totally okay with a few easy scenarios every now and then. It's a fun change from the usual ultra hard which require masterpiece decks. The easier scenarios allow you to try some different deck designs, things that wouldn't work on those harder scenarios.\n\nWith regards to this particular scenario, I really liked the idea behind it... In the books the Hills of Emyn Muil were dangerous not because they were full of monsters but because the terrain was a hellish labyrinth. I think FFG tried to capture that feeling in this scenario by making the terrain the real enemy, not the monsters. I applaud the fact that they were trying to do something different with this quest. One of the greatest traits of this game is its flexibility when it comes to scenario design. It doesn't have to be about killing the big bad monster every time.\n\nThe problem I had with this scenario is its execution. It comes across very flat and mechanical. I think they could have done a location based scenario that had more stages with more interesting events thrown in. There are ways to make non-combat quite adventures quite thrilling but this one missed the mark. There's been a number of negative reviews and I hope FFG doesn't throw the baby out with the bath water. There is definitely a place in this game for low combat scenarios, they just need to be more fun and creative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542524","commentId":542524,"userName":"Bohemond2","timestamp":1318708684,"content":"The problem with Hill of Emin Muil isn't that the scenario is easy.  The problem is that the scenario is long and boring.  Quest difficulty is front loaded, and once you clear the initial locations questing becomes incredibly easy.  At the point you have to grind your way through the encounter deck and the direct damage it spits out until the requisite number of locations comes out.  You can make a scenario that is both easy and fun, but Emin Muil fails in that regard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542536","commentId":542536,"userName":"Dwnhmcntryboy","timestamp":1318712367,"content":" @Narsil0420.. Ditto!!! \n\nThere is another aspect to this scenario that people are ignoring. It is a GREAT Demo device for new players. All you do is give them a tactics deck and let them run the game and you help them out with the spirit deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542606","commentId":542606,"userName":"Shelfwear","timestamp":1318740726,"content":"Dwnhmcntryboy said:\n\nhere is another aspect to this scenario that people are ignoring. It is a GREAT Demo device for new players. All you do is give them a tactics deck and let them run the game and you help them out with the spirit deck.\n\nYou really think so? I'm not sure if LotR LCG had me hooked up if this would be my first experience with the game. I believe that Mirkwood (1st quest Core Set) is very good for demo reasons: its short, it has alternate quest cards and one big enemy that might or not might show up.\n\nAnd to the argument that Emin Muil was a treacherous labyrinthlike place: ok that describes that place how it was portrayed in the books, but this not neccesarily means that you have to publish a quest that is not really entertaining only because the literature source shows it as an uninteresting place. In this spirit I hope FFG never publishes a Bree AP (no enemies, no treacheries, objective card: \"stolen apple pie\" = its Bree after all, a boring place)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542631","commentId":542631,"userName":"Bohemond2","timestamp":1318748981,"content":"Dwnhmcntryboy said:\n\n\n@Narsil0420.. Ditto!!!\nThere is another aspect to this scenario that people are ignoring. It is a GREAT Demo device for new players. All you do is give them a tactics deck and let them run the game and you help them out with the spirit deck.\n\n\n\nAre you kidding? You would give them a tactics deck in a scenario where there is almost nothing to fight? After a couple of turns the game will literally turn into a situation where the tactics deck sits and does nothing (emyn Muil encourages you to quest with just enough willpower to get the job done) but twiddle its thumb until an enemy comes out. \"You sit there and watch me play the game\" is a horrible way to introduce a new player to what is otherwise an interesting game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542660","commentId":542660,"userName":"Titan","timestamp":1318756538,"content":"Two issues as I see it with this quest: aside from the difficulty which isn't high(and that's ok, not every quest has to be Dol Guldur) it is very unbalanced. It's all about questing, that's what makes it mechanical and repetitive. Way too much of one thing, almost nothing of the others. The second issue is that FFG has given us a ton of tools when it comes to questing. For it's cost, a card like Ride to Ruin is way good, almost overpowered really, and there's simply a ton of synergy now with a leadership/spirit/rohan deck. Location heavy quests aren't going to be a challenge unless the mechanics and difficulty of them change greatly. You almost wonder if there will have to be a little bit of power creep to the encounter deck in order to keep this type of quest viable.\n\nAs for using this as a demo, that's a pretty bad idea. You can't use an unbalanced scenario to introduce the game, because new players just won't get the proper feel for it. They'll learn to quest by rote, but won't have to make decisions about who quests and who defends/fights, etc. It's not about how easy it is, but how much of the game they'll get to experience.  \n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542685","commentId":542685,"userName":"Style75","timestamp":1318759751,"content":"Shelfwear said:\n\nAnd to the argument that Emin Muil was a treacherous labyrinthlike place: ok that describes that place how it was portrayed in the books, but this not neccesarily means that you have to publish a quest that is not really entertaining only because the literature source shows it as an uninteresting place. In this spirit I hope FFG never publishes a Bree AP (no enemies, no treacheries, objective card: \"stolen apple pie\" = its Bree after all, a boring place).\n\n\n\nI think you should read (or re-read) the section of the book that relates to the Emyn Muil. Nowhere did Tolkien say it was uninteresting. It was an extreme environment quite unlike the rest of the world he described. That fact alone makes it interesting and a worthy spot for a location based scenario.\n\nWhat makes it uninteresting is the scenario design in this GAME, not the subject matter in the book. What should have been an interesting location based scenario was unfortunately turned into a grind. I too hope that FFG never publishes a Bree AP. Suggesting that Bree is like Emyn Muil is a ridiculous comparison."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542710","commentId":542710,"userName":"Dwnhmcntryboy","timestamp":1318763183,"content":"Different Demo styles I guess. Questing is the hardest part of this game as it is always a gamble on what comes up. Whereas Combat is pretty straight forward, just send in mook to block then kill with the beatstick. Trying to figure out how much WILL to send questing and when is the tough trick. By them playing a Tactics deck and you playing the Spirit/Rohan deck you can illustrate the challenge and control the game by only playing what you need to play when you need to play it to help them along and providing them a challenging yet rewarding experience.\n\nIf all you do is whip out you Deck and own the scenario for them, then what is the point of the Demo? I prefer to let new players take the reins and create their own experience.\n\nBack to subject though, I do agree the scenario is too easy but hey maybe the next AP will be the opposite of this one and Tactics will shine...Until people complain about it too. (I want to see something more than Eagles) I think for the very first block that FFG has to cover all of the bases to show people a full scope of the game. The next arcs will be less formulated and more of a challenge I predict. I think we will see a lot more lvl 5-6 quests since we can all agree lvl 4 is a bit wimpy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542713","commentId":542713,"userName":"Style75","timestamp":1318763955,"content":"Think we'll ever see a difficulty level 1, 2, or 3 scenario?  I think not. Which makes me think the difficulty ratings are wierd. Why not just go from 1 to 5?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542720","commentId":542720,"userName":"Eryx_UK","timestamp":1318765332,"content":"Playing Emyn Muil again last night I found it really easy as solo, but in the couple two player games it has been an average challenge because to start with we had do deal with 8 threat from the two starting locations, plus whatever came out during the questing. While there may not be many enemies to fight, I see this scenario as being a threat based challenge for 3-4 player games. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542722","commentId":542722,"userName":"conykchameleon","timestamp":1318765666,"content":"Dwnhmcntryboy said:\n\nDifferent Demo styles I guess. Questing is the hardest part of this game as it is always a gamble on what comes up. Whereas Combat is pretty straight forward, just send in mook to block then kill with the beatstick.\n\n\n\nHuh? Are you playing the same game that I am?  You do realize that you deal Shadow Cards to attacking enemies, right? Which ends up making it just as unpredictable as questing, if not MORE so..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542727","commentId":542727,"userName":"Style75","timestamp":1318766953,"content":"The_Big_Show said:\n\nPlaying Emyn Muil again last night I found it really easy as solo, but in the couple two player games it has been an average challenge because to start with we had do deal with 8 threat from the two starting locations, plus whatever came out during the questing. While there may not be many enemies to fight, I see this scenario as being a threat based challenge for 3-4 player games. \n\n\n\nI agree that this scenario is more difficult with 2 players than solo, assuming of course you're playing with a single core set and single copies of each AP. I havn't played it yet with 4 players, but I suspect it would be significantly tougher than solo. The same can also be said of The Hunt for Gollum.  Assume for a moment that all 4 players are not playing dedicated questing decks (ie-using just 2 core sets and 2 copies of each AP) then you'll probably have 2 decks at the table that are not ideal for dealing with the threat from the locations. In that situation, the threat would pile up very quickly.\n\nHas anyone played this with 4 players? Can you say if this is the case?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542743","commentId":542743,"userName":"Glaurung","timestamp":1318769522,"content":"Hmmmm i try to explain my point of view on this aspect of the game. First i really love this game. I love Tolkien from my childhood and love card games as well.\n\nAnd i love coop game ideas and love quests and encounter deck ideas too. But what i dont like in this game. Is going to be too easy when you start to create 50 cards expert deck.And maybe is to early to do it cose we still dont have any tournaments system.........\n\nIn solo game is still chalenge but in 2 players game if each player have 2 or 3 core set and some experience to play card game you can build up the decks with ability  to win 90% of the session in 2 players game( as i did with my friend). So now if we play 2 payers we  only Osgiliath. But even Osgiliath now we can win easy only matter of 3 first rounds. If you survive ok you win 90%.  I think with all my respect FFG can do everything better.For example make the different encounter decks for each quests to make it more harder.\n\n \n\nOther Quests is not point to play cose is easy like hell. Anyway there is still many ways to play with another cards and so on but still in my opinion game is more target casual players then proff players. And i already not so exiting about Khazad-Dum 3 set when i heard difficult 3,5,7. Ok maybe you should play all of them in nightmare mode than will be interesting. Actually we must to start play nightmare mode from now with my friend.\n\nI hope the game and quest themself will be more interesting and more hard and more exiting.  Waiting with baited breath for DM."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542794","commentId":542794,"userName":"Dam the Man","timestamp":1318775925,"content":"Having played Osgiliath for the first time today, EM probably doesn't kill you on the first turn. Cut Off to discard all allies, then Enemies get Cut Off too for +3 attack (since can't discard an ally) for a first turn hero death (by a Snaga no less). Combo that with 8 threat in the staging area, forcing us to quest with almost all the heroes or bump up threat and forced to take on even more Enemies, there was basically nobody left to kill Enemies. End game still in stage 1, 3x of that location that gets +3 threat if the players haven't crossed the Anduin for a nifty 12 threat just by themselves saw us hitting 50 threat. And this from a pair of decks that just breezed through Carrock, a supposed 7. No allies and having to take on 4-6 Enemies right away while somehow putting up at least 7-8 Willpower, not sure how that's done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542866","commentId":542866,"userName":"gamestar10","timestamp":1318787090,"content":"LOL Yep! Osgiliath is a killer! I can get a couple plays of that before I put it away for the night.  I'm convinced that I'll need 3 copies of the core set cards to succeed on that quest....or Boromir from Dead Marshes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542908","commentId":542908,"userName":"Runner5","timestamp":1318792900,"content":"Style75 said:\n\nThe_Big_Show said:\n\n \n\nPlaying Emyn Muil again last night I found it really easy as solo, but in the couple two player games it has been an average challenge because to start with we had do deal with 8 threat from the two starting locations, plus whatever came out during the questing. While there may not be many enemies to fight, I see this scenario as being a threat based challenge for 3-4 player games. \n\n \n\n \n\nI agree that this scenario is more difficult with 2 players than solo, assuming of course you're playing with a single core set and single copies of each AP. I havn't played it yet with 4 players, but I suspect it would be significantly tougher than solo. The same can also be said of The Hunt for Gollum.  Assume for a moment that all 4 players are not playing dedicated questing decks (ie-using just 2 core sets and 2 copies of each AP) then you'll probably have 2 decks at the table that are not ideal for dealing with the threat from the locations. In that situation, the threat would pile up very quickly.\n\nHas anyone played this with 4 players? Can you say if this is the case?\n\n\n\nMy first time playing Emyn Muil was 4 players.  The initial starting threat of 16 in the staging area is pretty killer and gets even higher with 4 more cards coming in during the quest phase.  After a bit we were able to get rid of some of the locations but there are so many in this quest and dealing out 4 cards every questing phase most of which are 4 more locations is a little brutal.  We eventually beat the quest but it did take a very long time to do just because when we thought we were about to get all the Emyn Muil locations out of the staging area, 3 more would be thrown back in.  It is more difficult with 4 than solo that is for sure.  I played it solo last night and finished it very quickly.  So ya we actually enjoyed it 4 player because it was so annoying trying to get rid of all the locations and quest with enough will power to match the high willpower in the staging area.  What you said is true its more difficult with 4 than 1 and I enjoyed the 4 player game alot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542929","commentId":542929,"userName":"Glaurung","timestamp":1318797535,"content":"Dam said:\n\nHaving played Osgiliath for the first time today, EM probably doesn't kill you on the first turn. Cut Off to discard all allies, then Enemies get Cut Off too for +3 attack (since can't discard an ally) for a first turn hero death (by a Snaga no less). Combo that with 8 threat in the staging area, forcing us to quest with almost all the heroes or bump up threat and forced to take on even more Enemies, there was basically nobody left to kill Enemies. End game still in stage 1, 3x of that location that gets +3 threat if the players haven't crossed the Anduin for a nifty 12 threat just by themselves saw us hitting 50 threat. And this from a pair of decks that just breezed through Carrock, a supposed 7. No allies and having to take on 4-6 Enemies right away while somehow putting up at least 7-8 Willpower, not sure how that's done.\n\n\n\nDon worry after some time you will understand how to play against a start to win. But when you come to this point other quests start to be boring for you you will see......."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54763-sorry-to-say-but-hills-of-emin-muil-is-boring/?do=findComment&comment=542985","commentId":542985,"userName":"Dam the Man","timestamp":1318815753,"content":"One thing I noticed about Wolves from Mordor in MaO was to in the future throw some meat for them, to shulffle them back into the Encounter deck. Of course, no such option here with all allies going poof on the first turn (didn't want to put out Snowbourn Scout with no locations out, will know better next time). But even then, I think we would have just 1 ally total out between the two of us, nowhere near enough to survive. With a single Spirit hero in the mix, lasting three turns for Greetings probably means Greetings perhaps just about nullifies all the threat one deck has taken those three turns and all those turns no Spirit allies into play, leaving the other deck with still a high threat. Also, Shadow Effects seem to make using allies for defense risky, with deal 2 damage and another that removes defending character from combat, you can lose/negate the ally and suddenly have an undefended attack coming through (remover Shadow Effect was the final nail in the coffin, meant another autokill on a hero after Scout wasn't the defender anymore)."}]}