{"url":"https://community.fantasyflightgames.com/topic/54903-more-than-2-players/","title":"More than 2 players...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54903-more-than-2-players/?do=findComment&comment=543390","commentId":543390,"userName":"NolaJeff","timestamp":1318872078,"content":"Sorry if this is an old subject but I couldn't find any info with a search.\n\nI am new to the LOTR LCG and have just started reading the rule book. I have noticed only one mentioning in the rulebook for 3-4 players and it says you need a second core set to do this. However, I see no special rules for 3-4 players and after skimming through the rules and reading the game mechanics, it seems that you could have more than 2 players with one core set. Am I missing something?\n\nThanks for responding,\n\nPak"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54903-more-than-2-players/?do=findComment&comment=543393","commentId":543393,"userName":"marlow4","timestamp":1318872523,"content":"No, you are correct. You can play 4-player games with one Core Set. The reason they suggest getting another Core Set is for two more threat trackers, additional tokens, more Gandalfs, etc.\n\nI play 3 and 4 player games every week with just one core set. Works fine. I jot down threat on a piece of paper which actually helps keep track of the number of rounds we've played during the game if I get curious."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54903-more-than-2-players/?do=findComment&comment=543773","commentId":543773,"userName":"Hannibal_pjv","timestamp":1318945589,"content":"The Only rule there is says that you play: one card per player from encounter deck.\n\nSo one card in one player game and 3 cards in three player game in every quest phase (and so on depending on how many players...)\n\nOne core set is enough, and with some expansions it may be wisest thing to have... I have 3 core sets becaus in the beginning there was no too many cards to make your decks, but now it get all the time harder and harder to deside what cards to take of from the deck... Now many cards from core set are laying in unused cards pool...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54903-more-than-2-players/?do=findComment&comment=543908","commentId":543908,"userName":"Morbid666","timestamp":1318962985,"content":"I concur. We always play with 4 of us and 1 core set. Only ran out of tokens on story 3 of the core, but no biggie!"}]}