{"url":"https://community.fantasyflightgames.com/topic/54921-anyone-tried-5-player/","title":"Anyone tried 5 player?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54921-anyone-tried-5-player/?do=findComment&comment=543562","commentId":543562,"userName":"Mighty Jim 83","timestamp":1318910764,"content":"We now have about 4 extra heroes from the core set (depending on how many chapter packs you've managed to get hold of) - I wondered if anyone had tried this yet with 5 players?\n\nI can't decide how well this would work - I imagine it would add a lot to the unpredictability - 5 encounter cards per round, but other than that, do people think it would scale plausbily?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54921-anyone-tried-5-player/?do=findComment&comment=543766","commentId":543766,"userName":"Hannibal_pjv","timestamp":1318944564,"content":"It would be maybe too easy... The game tends to be easier with more players, so one more could make it even more easier.\n\nBut it could be fun to try out! One variant that I have been thinking is \"Will of Sauron\" variant where one evil player draw the encounter cards an desides in what order to play them... It does no change the game much, but will make it a little bit harder. Other variant is to allow the evil player to have a card buffer of one, two or three card. So he can manipulate the game by holding some cards in hand and so trying to get killer combo that would make havok within heroes player :-)\n(So in the start of the game the evil player, \"Mouth of Sauron\"?, will draw 1, 2, or 3 cards (this need some serious play testing), and when the quest phase starts, he draws card depending on number of players (and scenario rules) and play nesessary number of card (that he has in his hand + those drawn by quest rules), (This play manipulation should not be allowed with shadow cards? It would make Wargs allmost impossible to kill...)\n\nFor example \"Mouth of Souron\" have hand limit of two. He draws two cards in the beginning of the game: one \"Muck Adder\" and one \"Roasted slowly\". In quest phase he draws 5 cards (5 free people players) He draw one \"Hill troll\", one \"Sacked\", \"the brown land\", one \"Mars Adder\", one \"A frightened Beast\".\n\nHe could play \"Hill troll\", \"Brown lands\", \"Muck adder\", \"Mars Adder\" and \"A frighteded beast\" to maximise the treath pool... and save Sacked and Roasted slowly to lated use combined with more sacked cards... or play first Sacked and then Roasted slowly... One character dies... And after that deside what to play next... next 3 cards depending on who was the sacekd and then roasted hero... (This is actually 6 player variant... sorry :-)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54921-anyone-tried-5-player/?do=findComment&comment=543897","commentId":543897,"userName":"Mighty Jim 83","timestamp":1318961825,"content":"like the idea for the way to play it as a human encounter deck.\n\nFeels like it would be very nasty for Carrock - with the Sacked/Roasted slowly combo. Although I'm not sure how often that would come out. For 5+ human players, it might be necessary though, to balance out the fact that there wouldn't be extra copies of Sacked! to add into the deck (unless you bought two copies of the adventure pack)"}]}