{"url":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/","title":"Our Nightmare Campaign","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=543586","commentId":543586,"userName":"GhostWolf69","timestamp":1318916651,"content":"So we finally got to it... Playing these scenarios over and over trying to beat our own score is exciting as hell.\n\nBut we wanted more.\n\nSo now we started our Nightmare Campaign.\n\nWe started off with HfG and the idea is to play as long as we can until we don't have any heroes left, decks are exhausted or we just think it is not worth it anymore.\n\nYesterday we finished CatC and here are some reflections on the game so far.\n\nThreat... well, truth be told, playing by the book we never actually made it through Carrock, We were One Attack Strength short of killing the last troll before my co-player reached 50 Threat. Had we countered some effect that raised our Threat when we chose not to, or maybe distributed attackes more efficiently during combat. Alas.... we lost, one point too short last round of the game...\n\nBut then I started thinking... why bother? This is Nightmare Mode, and if the purpous is just to go on as far as we can, using the resources we have... who cares about Threat Elimination? The only thing that will happen in the end is that we get a really Lousy Score... that AND the fact that lots of nasty will hit us fast in the next Quest. So I think we might play on regardless. If nothing else it will give us a score to beat on our next try.\n\nHas anyone else tried Nightmare and have some ideas / thoughts about Threat in that mode?\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=543601","commentId":543601,"userName":"Glaurung","timestamp":1318918209,"content":"GhostWolf69 said:\n\nSo we finally got to it... Playing these scenarios over and over trying to beat our own score is exciting as hell.\n\nBut we wanted more.\n\nSo now we started our Nightmare Campaign.\n\nWe started off with HfG and the idea is to play as long as we can until we don't have any heroes left, decks are exhausted or we just think it is not worth it anymore.\n\nYesterday we finished CatC and here are some reflections on the game so far.\n\nThreat... well, truth be told, playing by the book we never actually made it through Carrock, We were One Attack Strength short of killing the last troll before my co-player reached 50 Threat. Had we countered some effect that raised our Threat when we chose not to, or maybe distributed attackes more efficiently during combat. Alas.... we lost, one point too short last round of the game...\n\nBut then I started thinking... why bother? This is Nightmare Mode, and if the purpous is just to go on as far as we can, using the resources we have... who cares about Threat Elimination? The only thing that will happen in the end is that we get a really Lousy Score... that AND the fact that lots of nasty will hit us fast in the next Quest. So I think we might play on regardless. If nothing else it will give us a score to beat on our next try.\n\nHas anyone else tried Nightmare and have some ideas / thoughts about Threat in that mode?\n\n/wolf\n\n\n\nI also start to play nightmare mode now. We alrady can beat all quest in 2 player game quite easy so we need more challenge.\n\nWe decide to start from HFG to Carrock to Rhosgobel. This weekend we will do. I hope this make game fresh again for us. Cose Emyn muil is really big disappointed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=543758","commentId":543758,"userName":"Lenbo","timestamp":1318943214,"content":"GhostWolf69 said:\n\nThreat... well, truth be told, playing by the book we never actually made it through Carrock, We were One Attack Strength short of killing the last troll before my co-player reached 50 Threat. Had we countered some effect that raised our Threat when we chose not to, or maybe distributed attackes more efficiently during combat. Alas.... we lost, one point too short last round of the game...\n\nBut then I started thinking... why bother? This is Nightmare Mode, and if the purpous is just to go on as far as we can, using the resources we have... who cares about Threat Elimination? The only thing that will happen in the end is that we get a really Lousy Score... that AND the fact that lots of nasty will hit us fast in the next Quest. So I think we might play on regardless. If nothing else it will give us a score to beat on our next try.\n\nHas anyone else tried Nightmare and have some ideas / thoughts about Threat in that mode?\n\n\n\nYou're probably aware of this and it would've had no bearing on your overall success, but I just thought it worth mentioning - you don't actually lose if only one player is eliminated. You keep playing until all players have lost, but reveal one less card during the quest phase.\n\nI haven't tried playing Nightmare Mode yet, simply because of the time required to actually play through it in one sitting would probably take too long. Eventually we probably will try, and just split it up over the course of a few days.\n\nAs for Threat, I feel like Nightmare Mode will probably prove difficult enough as it is, but are you suggesting just ignoring the \"reach 50 and you lose\" rule right? In which case, the game will be probably close to impossible if every enemy is engaging you if your Threat is higher than 48. Although I'd like to hear someone actually beat it playing this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=543863","commentId":543863,"userName":"booored","timestamp":1318957860,"content":"I think there needs to be some work done on a variant for quest chains. Say core 1-3 and then the Entire Hunt for Gollum mirkwood set , done as a single quest in a single game....\n\nFor this to work there needs to be a sideborad rule of some kind, that allows you to slightly modify your deck bettween games, though this can not be a drastic modification, also some kind of rul needs to be in place for swapping out heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=543995","commentId":543995,"userName":"Kobby","timestamp":1318982798,"content":"A well build deck should be able to answer the threat issue without any problem.\n\nGlaurung and I were playing a Tactics/Leadership and  Spirit/Lore decks that complement each other. The Galadhrim's Greeting plus Gandalf (or sneak attack with Gandalf) will keep your threat low. One copy of will of the west will make sure you can get both discard piles back (dwarven tomb will get in back to your hand, I keep at least 2 in my deck). On my Spirit / lore deck I have Beravor if you put 1 or 2 unexpected courage on her it will enable an insane drawing ability, So basically you should have most of your deck in your hand before you move to the next encounter (you should have a low threat as well).\n\n \n\n These two decks manage to beat every encounter so far (including Massing at Osgiliath) easily so me and Glaurung decided to try nightmare mode next, we will probably have a go at it this weekend ill update you after how did it go.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=544001","commentId":544001,"userName":"Lenbo","timestamp":1318984703,"content":"Kobby said:\n\nSo basically you should have most of your deck in your hand before you move to the next encounter (you should have a low threat as well).\n\n\n\nEr, if you mean you get to keep your hand when you move on to the next scenario, you don't get to do that in Nightmare Mode. You shuffle everything except your discard pile back into your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=544008","commentId":544008,"userName":"Kobby","timestamp":1318985653,"content":"Lenbo said:\n\nKobby said:\n\n \n\n\n\nSo basically you should have most of your deck in your hand before you move to the next encounter (you should have a low threat as well).\n\n \n\n \n\nEr, if you mean you get to keep your hand when you move on to the next scenario, you don't get to do that in Nightmare Mode. You shuffle everything except your discard pile back into your deck.\n\n\n\nMy bad, meaning was that you shuffle all as you have all your deck in your hand (you lose nothing as u don't have discard pile except maybe dwarven tomb) hence no card is lost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=544043","commentId":544043,"userName":"GhostWolf69","timestamp":1318993874,"content":"Here is another reflection about our Nightmare Campaign.\n\nMy discard is mainly Events... and the occasional Ally...\n\nThis means that as the Campaign moves forward my Deck will become more and more Attachment and Ally focused for each Adventure I play.\n\nChanses are pretty good that I will put my Attachments to use in every single Adventure, but those Events.... *poff* gone.\n\nAny thoughts?\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=544078","commentId":544078,"userName":"Lenbo","timestamp":1319000484,"content":"GhostWolf69 said:\n\nThis means that as the Campaign moves forward my Deck will become more and more Attachment and Ally focused for each Adventure I play.\n\nChanses are pretty good that I will put my Attachments to use in every single Adventure, but those Events.... *poff* gone.\n\nAny thoughts?\n\n/wolf\n\n\n\n3x Will of the West\n\n3x Dwarven Tomb\n\nFor all players' decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=544101","commentId":544101,"userName":"Glaurung","timestamp":1319008036,"content":"Lenbo said:\n\nGhostWolf69 said:\n\n \n\nThis means that as the Campaign moves forward my Deck will become more and more Attachment and Ally focused for each Adventure I play.\n\nChanses are pretty good that I will put my Attachments to use in every single Adventure, but those Events.... *poff* gone.\n\nAny thoughts?\n\n/wolf\n\n \n\n \n\n3x Will of the West\n\n3x Dwarven Tomb\n\nFor all players' decks.\n\n\n\nActually i little bit will of the west Power. Maybe this card make nightmare mode easy too. Cose with Beravur you will get it anyway. Will try will see.\n\nBut also maybe with nightmare mode we will see the horizons of the game............"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=546304","commentId":546304,"userName":"Kobby","timestamp":1319408774,"content":"We tried the Nightmare mood few days ago, tbh, it too easy, i have 2 copies of Protector of Lorien in my Spirit / Lore deck (on to put on one of my heroes and one to put on the Tactics/Leadership Deck), towards the end we discarded all non essential starting starting cards (basically you can even control your starting hand but that is an overkill). will of the west and Dwarven tomb made sure we get the discard pile back. Nightmare mode became Real easy mode we we stopped playing it.\n\n \n\n   @Lenbo: 3 will of the west is an overkill, and a wasted 2 card space. on any game you don't really need it (face it how many games you draw every thing and sill need to get your discard more than once or even at all?) and in nightmare mode you only need it towards the end of the end and by controlling your next encounter starting deck (not hand) you can make sure you get it fast (leave it in discard and any Dwarven Tomb will get it back for you). Beravor with the help of one unexpected courage (or two) will make sure you get all you deck in your hand fast.\n\n \n\n   @Ghostwolf69: Like mentioned on earlier post, G.Greeting made sure our threat is lower than our starting threat at the end of each encounter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=549500","commentId":549500,"userName":"GhostWolf69","timestamp":1320032548,"content":"Latest Update here.\n\nWe have introduced a House Rule to allow Threat to be lowered between Adventures by the number of Victory Points collected. (evenly split between players). This manoeuvre allows our final Score for each Adventure to remain the same, but gives us a slight Threat-boost so we don't run up to 50 after two sessions.\n\nAnd to those of you who promote \"Galadrim's Greeting\" I have three in  my deck. That's it. I'm the only one playing the Spirit sphere. I'm lucky if it shows up once every Adventure, lowering our Threat by 2 points... So I honestly don't know what you guys are doing, seemingly using it once every Encounter to constantly have a lower threat than when you started with... That just seems either a) wrong or b) cheating.\n\nI got 50 cards in my deck, 3 G.Greeting. During any given adventure I go through maybe ten draws, plus some aditional from cards... let's count a little high and say 15 draws. Plus the initial 6 cards that's 21 cards.... not even half the deck. So one G.Greeting could probably be assumed to appear, two if I'm lucky.\n\nDwarven Tomb helps... but I have only two of those. So I rarely get the Combo to work there.\n\nGandalf is good of course but Quite Frequently I find that I have to use him to damage opponents or draw cards instead. Sneak-Attacking him in here and there to reduce Threat is good though.\n\nBut all in all, we have NEVER finished a game with Lower Threat than we started with. Ever. I mean if I just lowered my own I could probably do it, but I find that helping the party as a whole is more rewarding.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54925-our-nightmare-campaign/?do=findComment&comment=549531","commentId":549531,"userName":"Kobby","timestamp":1320037157,"content":"I have Just published our combo Decks in here (Rep # 9) :\n\nwww.fantasyflightgames.com/edge_foros_discusion.asp [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=571429&efpag=0#571753]\n\ntry and use them. once you put 2 Unexpected courage on Beravor, you have an insane draw capability. don't count the number of turns you have to play as these kind of decks build slow. threat is always manageable and resources are handled by attaching steward of Gondor on Eowyn. (before getting steward Theodred helps as needed).\n\nBefore you get UC on Beravor you can abuse Brand ability by drawing enemies to the Spirit/Lore deck and let Brand kill them to stand Beravor up.\n\nwith 3UC, Gleowine out and the regular card you draw at the beginning of each round you can draw 10 cards with Brand it can be up to 12 cards!!!! (please note that we never put 3UC on Beravor as we always put on on Gimly or Brand, was just trying to make a point). once you have all your deck in your hand getting TGG again and again is easy (use them get discard back, use them get it back........) . Also please note that by using TGG in a  2 players game to reduce 2 from each you are losing 2 threat each use. better use to reduce 6 and then reduce 6 again, i can recall maybe once or twice in emergency that i used it to reduce 2 for each.\n\nRegarding the number of card, if one of you have more than once core together you have at least 3 cores and that is enough. also I know that is probably the worst place to say it but if you don't have 3 core sets between you and you friend, I am sure FFG wount mind you proxing a card or 2 (its not a tournament after all) just for the sake of testing(especially not if that would convince you to buy that extra core set gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] ).\n\nRegarding the use of Gandalf, we also, in many cases, found ourselves use him to damage enemies (especially on MaO) but that is ok as the spirit lore deck can manage the threat for both (at least most of the times).\n\nIf you need any more tips feel free to ask or PM me.\n\n \n\nCheers"}]}