{"url":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/","title":"Appeal to FFG: Pls make the game rules simpler and easier to understand","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543778","commentId":543778,"userName":"ppsantos","timestamp":1318946383,"content":"Proliferation of rules questions and debate, the length of unofficial FAQ,  etc indicate that players are having some difficulties interpreting the rules, even in cases where rules seem plain enough.  The game designer helps out a bit by giving his interpretation.  But sometimes, that even opens up more questions. The interpretation of the rules is still a concern.  I suggest that when it comes to interpreting, changing, making the rules, FFG lean towards making the rules simpler to understand and more intuitive.  This is not a call to make the game easier to win, but to make the game easier to understand, do away with the confusing interactions of odd rules, weird timing/sequences, order of triggers and their resolution order, etc.  When it comes to changing/interpreting rules, I would rather have the rules be simplified (even at the expense of some strategic gameplay) than the game bog down to a case where you need to be a walking encyclopedia just to follow the rules.  I like a game where my playing skill, rather than my mental ability to remember and interpret all the esoteric rules interaction,  determine if I will win.\n\nMagic the Gathering, recently simplified its rules to make it easier for new players to understand (at the expense of removing some strategic gameplay).  I think the long term view there was if more new players understand the game then they are more likely to continue playing it, which will be good for the game's longevity and viability.  I think LotR LCG is still a relatively new game, and we are all relatively new players here.  I think this wonderful game would benefit in the long run too by considering a similar approach to rules simplification."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543781","commentId":543781,"userName":"Bohemond2","timestamp":1318947456,"content":"You do realize that the \"simplified\" magic rules come in at 192 pages (and that's single spaced with a 10 pt font).  Heaven help us if the LotR rules become that \"simple\".\n\nedit: that's not counting the additional 50 pages of tournament rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543784","commentId":543784,"userName":"richsabre","timestamp":1318948370,"content":"sorry im not with you on this one, i find the game very easy to understand and play, and with more effects and keywords its just going to get more complex, which is a  good direction to go i think"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543788","commentId":543788,"userName":"Svenn","timestamp":1318948957,"content":"I have never found the rules that complicated. I honestly cannot figure out how people come up with these ridiculous questions and situations. I've seen people take the most simple rule and try and complicate it far beyond what makes sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543789","commentId":543789,"userName":"ppsantos","timestamp":1318949025,"content":"That's not what I meant with my post.\n\nI thought I was making a \"simple\" suggestion here. But the first reply I got here kind of illustrates the issue with the game that I was trying to  make FFG address -- interpretation. Make the rules simpler, more intuitive, to lessen varying rules interpretation, yes, even at the expense of some strategic gameplay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543791","commentId":543791,"userName":"richsabre","timestamp":1318949179,"content":"ppsantos said:\n\n \n\nThat's not what I meant with my post.\n\nI thought I was making a \"simple\" suggestion here. But the first reply I got here kind of illustrates the issue with the game that I was trying to  make FFG address -- interpretation. Make the rules simpler, more intuitive, to lessen varying rules interpretation, yes, even at the expense of some strategic gameplay.\n\n \n\n \n\n \n\nthats a little clearer, are you suggesting a re-write of the entire rules, just a selection like you said above, or perhaps just the rulebook? i still think that theres a slim chance of it changing to simpler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543797","commentId":543797,"userName":"DurinIII","timestamp":1318949945,"content":"Yeah man, I can understand you concern about some of the rules and how to interpret them. I don't see them ever \"re-writing\" the entire rule set, though it would be nice to get a single FAQ (FF endorsed) that would tidy up so many of our questions. I still don't find the game that complicated myself (unless I am playing things horribly wrong, and that is a possibility)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543801","commentId":543801,"userName":"richsabre","timestamp":1318950049,"content":"DurinIII said:\n\nYeah man, I can understand you concern about some of the rules and how to interpret them. I don't see them ever \"re-writing\" the entire rule set, though it would be nice to get a single FAQ (FF endorsed) that would tidy up so many of our questions. I still don't find the game that complicated myself (unless I am playing things horribly wrong, and that is a possibility).\n\n\n\n \n\na more effective FAQ would benefit everyone i think!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543825","commentId":543825,"userName":"radiskull","timestamp":1318953050,"content":"richsabre said:\n\na more effective FAQ would benefit everyone i think!\n\n\n\n \n\nIt's coming.  FFG is clearly of the opinion that updating FAQs less frequently but with larger updates is to be preferred.  I predict we'll have a fairly massive update after Return to Mirkwood comes out, and before Khazad-Dum comes out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543829","commentId":543829,"userName":"ppsantos","timestamp":1318953343,"content":"Game play will definitely get more complicated as more cards come out, as we'll have more choices, and that's good.  Don't get me wrong, I'm not against that.   I just don't want a situation where understanding the rules start to seem like an obstacle already, due to conflicting, situational rulings, etc.\n\nSome of you think that the rules are actually easy to understand and obvious.  Unfortunately, not all players are on the same level.   The fact that rules questions and debates abound not just here but also at bbg, indicate that the rules are not as straightforward as some of us may think.\n\nLet's take the ongoing question about the Eleanor's ability vs cards with surge/doomed/When Revealed effect as an example. Sure, official FAQ already mentioned that keywords should be resolved any time the card on which they occur enters play.  But what if that same card leaves play (via Eleanor's ability), should they still resolve? Remember, on p 25 of Core Set rulebook, under \"In Play and Out of Play\" section it says,  \"Card effects do not interact with cards in an out of play state unless the effect specifically refers to that state.\"   Doesn't this seem to be a conflicting rule interaction?  Even Nate French's clarification that these keywords resolve even if Eleanor's ability is used is not as easy to grasp.  On the Flooding card, the Surge and Doomed keywords still resolve, even if the card containing them gets discarded and replaced (by Eleanor's ability replacing the When Revealed effect).  It's counterintuitive.  We have a situation where some parts of the card still resolve but some parts don't, even if the card on which they occur got discarded, because of the rules or at lest their interpretation.  Couldn't FFG lean towards making the rules more intuitive? How about a simpler ruling that if the card is discarded, nothing on that card triggers and resolves, unless specifically stated?  After all, there is already that rule on p25 about card effects not interacting with cards in out of play state.   All I'm suggesting  is that the spirit of the rules should lean more towards intuitive, simpler, easier interpretation rather than more complex rule interaction. This is just one example, and I hope this illustrates the point I'm trying to bring up.\n\nAs to how to accomplish this change? I'd leave that to the game's developer/designer/rules committee, what have you.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543844","commentId":543844,"userName":"Vyron2","timestamp":1318955807,"content":" I think that the game is still pretty straightforward... as to \"interpretations\" - language is not an exact tool... the designers have their mindset, but they cannot possibly foresee all the problems: they're human...\n\ndifferent people, different opinions - cf. the law! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] FAQ are an essential part of the game and you have to stay on top and be up to date if you want to play a lcg/ccg - I think we are lucky that we can start and play the game from the beginning, thus having a pretty simple job of being up to date... imagine in 2-3 years!\n\nwhat would be useful though - dear FFG and Nate French: ANSWER the FAQ questions in the forum, or get a rules expert or designer to monitor our NEEDS and answer our questions - then update the rules with the FAQ (or just update the FAQ)... that would be a big step!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543854","commentId":543854,"userName":"conykchameleon","timestamp":1318956994,"content":"ppsantos said:\n\nThe game designer helps out a bit by giving his interpretation.\n\n\n\nJust couldn't bear this sentence. His \"interpretation\"!? He designed the game!\n\nThis is a silly thread. It's a cooperative game. The basics and most of the details are clearly outlined in the rulebook. There are certain contestable situations, but why does it matter if you're playing them the same way as other people on the internet? Pick a way of playing that situation and stick with it. Or you can get them to make the rules easier for you to understand....then maybe they can hold your hand while you play too..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543859","commentId":543859,"userName":"booored","timestamp":1318957603,"content":"I do not think the game needs to be more simple... in fact I would like more complex interactions.. my problem is that the design of the keywords and stuff are to simplistic, meaning that it breeds confusion. If the game had better defined keywords and stuff the rules would be more plain, and allow more complex interactions. There are many rules that are easy to \"assume\" and understand.. but in fact if you read the cards these effects can be interpreted 100% correctly in a number of ways due to the cards simply not have the devices needed to be more accurate at a low word count.\n\nI think this could be the OPs original point.. not simple as in simplistic rules, but if the rules were better written and the card keywords were more refined then the entire game as a whole would be much easier to understand and not require 21 page unofficial FAQ, that doesn't even address many issues."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543872","commentId":543872,"userName":"conykchameleon","timestamp":1318958634,"content":"booored said:\n\nThere are many rules that are easy to \"assume\" and understand.. but in fact if you read the cards these effects can be interpreted 100% correctly in a number of ways due to the cards simply not have the devices needed to be more accurate at a low word count.\n\nCan you give an example that doesn't involve Eleanor?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543909","commentId":543909,"userName":"Eryx_UK","timestamp":1318963006,"content":"I don't have a problem with the games complexity but I do wish that whenever a question is raised FFG didn't try to take something away from the players just to make the game harder.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543928","commentId":543928,"userName":"Vintagesport","timestamp":1318965073,"content":"I agree, there is nothing less fun than looking up rulings in a game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=543939","commentId":543939,"userName":"silverhand77","timestamp":1318971097,"content":"conykchameleon said:\n\nbooored said:\n\n \n\nThere are many rules that are easy to \"assume\" and understand.. but in fact if you read the cards these effects can be interpreted 100% correctly in a number of ways due to the cards simply not have the devices needed to be more accurate at a low word count.\n\n \n\nCan you give an example that doesn't involve Eleanor?\n\n\n\nHow about the similar discussion around Thalin?\n\nI agree with the OP. some of the wording on cards, in the rules and in the officail FAQ is ambiguous and can be interpreted different ways so there needs to be clarification. It might  be ok for casual play, but some of us would like to be involved in tournaments and so forth and in such a setting there need to be a set agreement on the interpretation. Also it is diccicult to accurately compare results with other players/groups if everyone is playing by different rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544004","commentId":544004,"userName":"Lenbo","timestamp":1318984959,"content":"You know what the real challenge of this game is? Playing it without making any mistakes in the rules/processes.\n\nI don't think I've played a single game without at some point going \"hang on a second, we forgot to do something.\"\n\nUsually it's nothing major, but sometimes there are so many Forced triggers going on at once in a single round it's hard to keep track of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544040","commentId":544040,"userName":"GhostWolf69","timestamp":1318993482,"content":"Svenn said:\n\nI've seen people take the most simple rule and try and complicate it far beyond what makes sense.\n\n\n\nYou mean like Nate does when he answers your questions?\n\nAnd I'm not saying this to be snarky, I simply want to illustrate the problem the OP is talking about.\n\nI for one agree with the OP in that some FAQ answers we get raises more questions than they answer in the first place.\n\nI personally hate that.\n\nThe biggest issue I have is one of consistency. Introducing new concepts to the game, making the core game mechanics more complex and multilayered than it was originally, is NOT the way forward. I would rather they stick to a few simple core concepts and use them when applicable.\n\nWithout going into specific examples (because we have them in separate threads and I don't want to pollute this one) I will give you a generic one instead:\n\nTiming of Effects\n\nVersion 1: Any questions regarding timing could be solved by allowing First Player to chose.\n\nThat rule is simple, it's clean it allows player to fall back on it and rely on it when they are in doubt. It pretty much covers all kinds of questions that could potentially come up down the road. I loved that FAQ entry. It was \"sound\".\n\nVersion 2: Case by case rulings, creating Timing structure that might have been what the designes intended but was never really in covered in the rules.\n\nThis sort of thing creates uncertainity among players. It gives us very little except an answer to how to handle a specific situation. It will be prone to inconsistencies and difficult for anyone to keep intact as the game evolves. It also makes the game hard to play because you have to remember these things on the same basis they were invented, i.e. case by case. This has already starting to happen, and I for one hate it. And it makes my beloved FAQ entry above seem very \"Weak\" sinc ethat too, now only applies in certain situations... apparently.\n\nKeep it simple. Broad generic Core Rules is the way to go. Card text should supply clear exceptions and deviations from those Rules, the FAQ should NOT, because when I play I want to look at the cards, not the FAQ.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544064","commentId":544064,"userName":"Glaurung","timestamp":1318997041,"content":"Lenbo said:\n\nYou know what the real challenge of this game is? Playing it without making any mistakes in the rules/processes.\n\nI don't think I've played a single game without at some point going \"hang on a second, we forgot to do something.\"\n\nfor toruUsually it's nothing major, but sometimes there are so many Forced triggers going on at once in a single round it's hard to keep track of them.\n\n\n\nVery right. Many time when i play i use 1 6 dice roll for track my mistakes. Every time when you do mistake add 1 on the dice. When you have 6 you lose the game. Very good training  to prepare for tournaments where is 1 mistake is enough sometime to lose a game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544076","commentId":544076,"userName":"Lenbo","timestamp":1318999743,"content":"Glaurung said:\n\nVery right. Many time when i play i use 1 6 dice roll for track my mistakes. Every time when you do mistake add 1 on the dice. When you have 6 you lose the game. Very good training  to prepare for tournaments where is 1 mistake is enough sometime to lose a game.\n\n \n\n \n\nHaha, I like this.\n\nI wonder how they would actually enforce this in a tournament environment. There is so much margin for error in this game, and like you said, it can cost you everything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544106","commentId":544106,"userName":"Glaurung","timestamp":1319008710,"content":"Lenbo said:\n\nGlaurung said:\n\nVery right. Many time when i play i use 1 6 dice roll for track my mistakes. Every time when you do mistake add 1 on the dice. When you have 6 you lose the game. Very good training  to prepare for tournaments where is 1 mistake is enough sometime to lose a game.\n\n \n\n \n\nHaha, I like this.\n\nI wonder how they would actually enforce this in a tournament environment. There is so much margin for error in this game, and like you said, it can cost you everything.\n\n\n\nI really wait for tournament system. That what i like most. I use to play many tournaments, national, world cups by Magic anf Decipher Lotr TCG.\n\n Relly cool to play tournaments where you need really thing hard and feel like every your decision can cost you lose or win.\n\n1 funny story what happen with me in 2002 or something in Germany on the first Lotr TCG worldcup.\n\nI have play against very good players and i lose it. Actually this guy was the best ranking player in the world on the moment. Ony 1 game i lose on this tournament against him. But my other team play really bad so we lose this one quite bad.\n\nAnyway he win against me cose of one card. It was Aragorn Heir Of the white city i suppose...... He remove 2 twilight all the time so i cannot play nothing in shadow phase and screw my self with hand full of uruks cose i dont have a twilight to play. But after 1 week or 2 after worldcup Aragorn card WAS BANNED in standart format. I was mad!!!!! Funny A????"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544128","commentId":544128,"userName":"Anduril82","timestamp":1319012959,"content":"This game isn't as complicated as everyone is making it out to be.  Part of the problem I think is that many people skimmed the rules in their excitement to play the game, and they missed some of the intricacies of the timing.  I know I did.  Eleanor is not that complicated.  Her card specifies that she \"cancels\" the \"when revealed\" effects of a treachery card.  As far as timing is concerned, her effect occurs after the \"when revealed\" effect occurs.  The reason you wouldn't apply \"surge\" is because \"surge\" resolves after the \"when revealed\" effect resolves (page 24), and due to Eleanor's ability, the card is discarded before \"surge\" can take place.  Thalin's ability on the other hand prevents the \"surge\" effect of \"Eastern Crows\" because the timing on his card specifies \"as it is revealed\" which indicates that his action precedes the \"when revealed\" effect and Thalin is able to kill the \"Eastern Crows\" as they are revealed so that the \"surge\" effect is not able to iniatiate.  The only real issue is whether or not \"doomed\" is resolved since the timing of \"doomed\" is not as clearly specified.  I believe the assumption is that \"doomed\" is resolved before any \"when revealed\" effects.  The rulebook simply states that \"if\" a card with the keyword \"doomed\" is revealed, each player must raise his threat.  Since it involves a simple \"if-then\" statement, the implication is that the \"doomed\" keyword resolves no matter what making it the first thing you would resolve.  Some people don't get why you resolve any effects when you end up discarding the card.  Well, treachery cards end up being discarded after the effects resolve anyway (page 7).  It's important that you resolve the effects in their proper order before you discard the card.  Eleanor doesn't cancel the appearance of the card.  She only cancels one of the card's effects.  I believe the same interpretation applies to the \"A Test of Will\" event card.  I hope this clears things up for everyone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544130","commentId":544130,"userName":"Anduril82","timestamp":1319013138,"content":"Of course, I just realized that \"A Test of Will\" only says to cancel the \"when revealed\" effects of a card.  It doesn't say that you discard, which I assume means that any surge effects on a treachery card would still be resolved.  Thoughts anyone?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544131","commentId":544131,"userName":"Svenn","timestamp":1319013244,"content":"Anduril82 said:\n\nOf course, I just realized that \"A Test of Will\" only says to cancel the \"when revealed\" effects of a card.  It doesn't say that you discard, which I assume means that any surge effects on a treachery card would still be resolved.  Thoughts anyone?\n\n\n\nSurge is still resolved even if Eleanor cancels and then discards a card, so Surge definitely resolves when using A Test of Will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544136","commentId":544136,"userName":"GhostWolf69","timestamp":1319013694,"content":"Anduril82 said:\n\nThoughts anyone?\n\n\n\nI don't know. You're the one who said this isn't complicated. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544140","commentId":544140,"userName":"Anduril82","timestamp":1319013994,"content":"Svenn said:\n\nAnduril82 said:\n\n \n\nOf course, I just realized that \"A Test of Will\" only says to cancel the \"when revealed\" effects of a card.  It doesn't say that you discard, which I assume means that any surge effects on a treachery card would still be resolved.  Thoughts anyone?\n\n \n\n \n\nSurge is still resolved even if Eleanor cancels and then discards a card, so Surge definitely resolves when using A Test of Will.\n\n\n\nSvenn said:\n\n \n\n \n\nSurge is still resolved even if Eleanor cancels and then discards a card..\n\n\n\nYeah, I guess you would be right about that.  The rules just state \"when\" a card with \"surge\" is revealed that you resolve it's effects after the when revealed effects, which is really just a clarification of the timing.  Sheesh.  Oh well.  Actually, this makes the clarification in the FAQ regarding Thalin make even more sense.  When they updated the FAQ, they included the phrase \"keyword\" in addition to \"when revealed\" effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544141","commentId":544141,"userName":"Anduril82","timestamp":1319014074,"content":"It's still not that complicated.  *lol*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544143","commentId":544143,"userName":"Anduril82","timestamp":1319014304,"content":"Final verdict:  if you draw the \"flooding\" treachery card, you're screwed.  *lol*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544148","commentId":544148,"userName":"Titan","timestamp":1319015190,"content":"Vyron said:\n\n I think that the game is still pretty straightforward... as to \"interpretations\" - language is not an exact tool... the designers have their mindset, but they cannot possibly foresee all the problems: they're human...\n\ndifferent people, different opinions - cf. the law! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] FAQ are an essential part of the game and you have to stay on top and be up to date if you want to play a lcg/ccg - I think we are lucky that we can start and play the game from the beginning, thus having a pretty simple job of being up to date... imagine in 2-3 years!\n\nwhat would be useful though - dear FFG and Nate French: ANSWER the FAQ questions in the forum, or get a rules expert or designer to monitor our NEEDS and answer our questions - then update the rules with the FAQ (or just update the FAQ)... that would be a big step!\n\n[/quote\n \n\nCompletely true. You are always going to have different interpretations to the same wordings. Happens in every game. I don't think that the issue is really the rules being complicated, but the possibility that some card interactions will be so. Again, that's going to happen in every game too. What the designers need to do is make clearly worded cards, which in my opinion, they haven't always done with this game. Clear wordings make for easier to understand card effects, which in turn, make for an easier time working out those effects.\n\nAnd absolutely the questions should be answered here. Doing it at BGG and who knows where else is just pure nonsense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544149","commentId":544149,"userName":"silverhand77","timestamp":1319015227,"content":"Anduril82 said:\n\nIt's still not that complicated.  *lol*\n\n\n\nAnduril82 said:\n\nIt's still not that complicated.  *lol*\n\n\n\nIts not that it is complicated, its that it is not clear and that's why there's a whole 4 page thread on the very topic of Eleanor. Because there are different interpretations and the rules and offiicial FAQ don't really clarify it. Let me give you an example:\n\nOn page 2 of the official FAQ it says \"When an enemy card is revealed from the encounter deck, Thalin's ability resolves before any keyword or when revealed card effects on the encounter card\".\n\nTo me if you read this sentence from a grammar perspective it looks as though the word resolve or the word resolve or the word trigger should have been on the end. I mean does it mean that Thalin's ability resolves before the effect or keyword resolves or does it resolve before they trigger? The sentence is ambiguous.\n\nThis is the sort of thing I'd like to see more clarification on, Also the card Flooding reads: Doomed x1. Surge. and then there is a when revealed effect. Wouldn't it make more sense if it read Doomed, When revealed and then surge?\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544174","commentId":544174,"userName":"Anduril82","timestamp":1319017300,"content":"silverhand77 said:\n\nAnduril82 said:\n\n \n\nIt's still not that complicated.  *lol*\n\n \n\n \n\nAnduril82 said:\n\n \n\nIt's still not that complicated.  *lol*\n\n \n\n \n\nIts not that it is complicated, its that it is not clear and that's why there's a whole 4 page thread on the very topic of Eleanor. Because there are different interpretations and the rules and offiicial FAQ don't really clarify it. Let me give you an example:\n\nOn page 2 of the official FAQ it says \"When an enemy card is revealed from the encounter deck, Thalin's ability resolves before any keyword or when revealed card effects on the encounter card\".\n\nTo me if you read this sentence from a grammar perspective it looks as though the word resolve or the word resolve or the word trigger should have been on the end. I mean does it mean that Thalin's ability resolves before the effect or keyword resolves or does it resolve before they trigger? The sentence is ambiguous.\n\nThis is the sort of thing I'd like to see more clarification on, Also the card Flooding reads: Doomed x1. Surge. and then there is a when revealed effect. Wouldn't it make more sense if it read Doomed, When revealed and then surge?\n\n \n\n \n\n \n\n \n\n\n\nI see what you mean, and I agree.  The end of that statement in the FAQ regarding Thalin should definitely specify whether his ability resolves before effects \"trigger\" or \"resolve.\"  I believe the assumption is \"trigger,\" but if it is \"resolve,\" then the effects would still occur.  As for word placement on the card, I wonder if they just wanted to keep keywords together and then have effects that involve specific statements posted at the bottom of the card.  I'd have to look back over the cards to verify if this is always the case.  If so, more than likely, it was a stylistic choice that requires players to know beforehand the order in which effects resolve.  I don't have as much of a problem with word placement on the card as long as it is consistent.  I like keywords being kept together at the top of the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544207","commentId":544207,"userName":"silverhand77","timestamp":1319019070,"content":"Anduril82 said:\n\nsilverhand77 said:\n\n \n\nAnduril82 said:\n\n \n\nIt's still not that complicated.  *lol*\n\n \n\n \n\nAnduril82 said:\n\n \n\nIt's still not that complicated.  *lol*\n\n \n\n \n\nIts not that it is complicated, its that it is not clear and that's why there's a whole 4 page thread on the very topic of Eleanor. Because there are different interpretations and the rules and offiicial FAQ don't really clarify it. Let me give you an example:\n\nOn page 2 of the official FAQ it says \"When an enemy card is revealed from the encounter deck, Thalin's ability resolves before any keyword or when revealed card effects on the encounter card\".\n\nTo me if you read this sentence from a grammar perspective it looks as though the word resolve or the word resolve or the word trigger should have been on the end. I mean does it mean that Thalin's ability resolves before the effect or keyword resolves or does it resolve before they trigger? The sentence is ambiguous.\n\nThis is the sort of thing I'd like to see more clarification on, Also the card Flooding reads: Doomed x1. Surge. and then there is a when revealed effect. Wouldn't it make more sense if it read Doomed, When revealed and then surge?\n\n \n\n \n\n \n\n \n\n \n\n \n\nI see what you mean, and I agree.  The end of that statement in the FAQ regarding Thalin should definitely specify whether his ability resolves before effects \"trigger\" or \"resolve.\"  I believe the assumption is \"trigger,\" but if it is \"resolve,\" then the effects would still occur.  As for word placement on the card, I wonder if they just wanted to keep keywords together and then have effects that involve specific statements posted at the bottom of the card.  I'd have to look back over the cards to verify if this is always the case.  If so, more than likely, it was a stylistic choice that requires players to know beforehand the order in which effects resolve.  I don't have as much of a problem with word placement on the card as long as it is consistent.  I like keywords being kept together at the top of the card.\n\n\n\n \n\nYes I agree, I like the style too, so I'm thinking that perhaps they should have included a section about the correct way to read a card in relation to the timing of its effects and abilites."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544402","commentId":544402,"userName":"HilariousPete","timestamp":1319040465,"content":"silverhand77 said:\n\nsome of the wording on cards, in the rules and in the officail FAQ is ambiguous and can be interpreted different ways so there needs to be clarification. It might  be ok for casual play, but some of us would like to be involved in tournaments and so forth and in such a setting there need to be a set agreement on the interpretation.\n\n\n\nYeah, I agree to that. I'd especially like the timing of effects or \"card reading order\" to be covered in a single place, with a clear structure. I just noticed the new CoC FAQ 2.0 (link if you're interested, but 17 MBytes: http://www.fantasyflightgames.com/ffg_content/coc/support/coc-faq%20Ver%202.0.pdf [http://www.fantasyflightgames.com/ffg_content/coc/support/coc-faq%20Ver%202.0.pdf] ), and I really like it. On p. 15 and 16 FFG explicitly gives a timing structure (when you execute actions, responses etc.). I'm no CoC player, but this structure seems very clear (perhaps not simple to memorize, but not ambiguous). I'd love to have such a thing for LotR, too! So let's hope FFG is fulfilling this wish with the next LotR FAQ :-)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544428","commentId":544428,"userName":"radiskull","timestamp":1319043305,"content":" I bet they will.  They've had one for Game of Thrones for quite some time, and it gets used absolutely extensively.  It's nice to have such a detailed framework available."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544433","commentId":544433,"userName":"HilariousPete","timestamp":1319043613,"content":"Yeah, great news :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544625","commentId":544625,"userName":"GhostWolf69","timestamp":1319078492,"content":"My point (and I might be wrong but I think the OP would agree with me) is that I don't care how CLEAR they make it.\n\nIf they start to go down the Magic road and introduce Event Stacks, and rigorous timing rules... they could be 100% crystal clear... and I would still hate them.\n\nThat is NOT the game I want to play basically.\n\nIt's a design choice.\n\nSo why I am disapointed in some of the answers, is not only because I think they are unclear or causes more questions.\n\nIt's also because I simply don't like the way the game is taking.\n\nI'd rather play games with broad generic and SIMPLE rulles that I can explain to my 8 year old daughter (who btw love this game) without her looking at me funny and go; \"What?\"\n\nAnd right now... with the direction I can see this game taking... that's not going to happen and it makes me sad.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544646","commentId":544646,"userName":"jhaelen","timestamp":1319082981,"content":"I agree. The LotR LCG is too complicated for most casual players. As are all LCGs. As are all CCGs, too. As are most of FFG's games.\n\nStill, there's apparently a large enough number of geeks enjoying these games. Personally, I don't believe it's possible to create 'simple' rules for any game that is extensible in the way LCGs are."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544650","commentId":544650,"userName":"GhostWolf69","timestamp":1319083526,"content":"jhaelen said:\n\nPersonally, I don't believe it's possible to create 'simple' rules for any game that is extensible in the way LCGs are.\n\n \n\nI do.\n\nThat's where we disagree I guess, and that is why I'm disappointed in FFG (Nate) right now.\n\nIt's all a matter of design choices.\n\nAnd we play lots of games, tons of them in fact. So I wouldn't categorize myself (or my friends and family) as casual gamers.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/54948-appeal-to-ffg-pls-make-the-game-rules-simpler-and-easier-to-understand/?do=findComment&comment=544697","commentId":544697,"userName":"jaycadiramen","timestamp":1319091670,"content":"booored said:\n\nI do not think the game needs to be more simple... in fact I would like more complex interactions.. my problem is that the design of the keywords and stuff are to simplistic, meaning that it breeds confusion. If the game had better defined keywords and stuff the rules would be more plain, and allow more complex interactions. There are many rules that are easy to \"assume\" and understand.. but in fact if you read the cards these effects can be interpreted 100% correctly in a number of ways due to the cards simply not have the devices needed to be more accurate at a low word count.\n\nI think this could be the OPs original point.. not simple as in simplistic rules, but if the rules were better written and the card keywords were more refined then the entire game as a whole would be much easier to understand and not require 21 page unofficial FAQ, that doesn't even address many issues.\n\n\n\n \n\nI think I would have to agree with booored. As a primarily solo player I found the rulebook challenging enough that I had to keep referring to it throughout my first game (and probably will for the next few too), but haven't so far come across a scenario that has had me rushing to the Web to do some research. Sure, I did come across one or two rather ticklish moments in the game when I got a bit confused, but I just re-read the rules carefully, examined the card(s), and thought about it carefully before interpreting it for myself. Perhaps I got it wrong, perhaps I got it right... at the end of the day my objective was to enjoy myself and try and win the game (I didn't). With more games under my belt, and further exploration of the FAQ and forums, I'm sure I'll be able to resolve these issues better/more accurately in the future, but I also believe more questions will be raised in this way too.\n\nI just think that if the game ever becomes so much about struggling to ensure you are getting the rules exactly right and you spend more time agonising over that than actually playing the game... then what's the point?"}]}