{"url":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/","title":"Tournament rules - some ideas","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=544343","commentId":544343,"userName":"guciomir","timestamp":1319034101,"content":"This can be used in multi 2 player coop and also solo.\n\nFirst round starts:\n\n0. The scenario which will be used in the round is chosen (for example randomly)\n\n1. 2 teams are paired against each other. Each team has its own encounter deck (both teams are playing against same quest, just different  encounter decks, so the cards are not shared, each encounter deck is shuffled)\n\n2. Team A starts playing and takes a turn (roll a die to determine who starts). Team B is watching how team A is playing so rules are not broken. After that, team B plays and team A watches.\n\n3. If  team A wins before team B (the number of turns counts), they get 3 points. Losing team gets 0.\n\n4. If both teams win on the same turn, they share 1 point each.\n\n5. If team A gets killed before team B (the number of turns counts), team B wins and gets 3 points. Team A gets 0.\n\n6. Threat, score etc does not count at all.\n\n \n\nSecond round starts:\n\n0. new scenario is chosen\n\n1. new pairs are being made. For example 4 teams A,C,F, M have 3 points each. So now A is playing against C and F against M\n\n// how the opponents are determined can be borrowed from some other tournament games like MtG for example\n\n \n\nWhat do u think about it?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=544365","commentId":544365,"userName":"Dwnhmcntryboy","timestamp":1319036976,"content":" There needs to be formats for tournaments from Solo to 4 player teams. The missions should be standardized. Each format keeps score as usual and the winner has the lowest Tournament score. No need to make things more complicated then that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=544376","commentId":544376,"userName":"Lenbo","timestamp":1319038060,"content":"I'm glad to have some tournament discussion, but there are some issues with what you're proposing.\n\nFirstly, it's a pretty bad idea to have players watch each other play. This game doesn't require players to directly compete against each other, thus players' time is better spent actually playing the game. It would save a great deal of time to just have the players play simultaneously. Ideally each game would have a referee or supervisor of some kind.\n\nSecondly, I think most players would find the scoring system you propose to be too simplistic as it doesn't take into account enough factors except speed. Speed shouldn't be the only way to measure player skills in this game. There are a great many factors to consider. Also the proposed scoring system in the rule book is wholly inadequate.\n\nA couple of ideas have been suggested in this thread:\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=561572&efpag=0 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=561572&efpag=0]\n\nMy current iteration is this one:\n\nFinal Threat Level + Number of Threat Lowered Using Card Effects + Number of Hero Defeats - Victory Points Earned\n\nThis formula makes things only slightly more complicated in that it requires you to keep track of 2 variables. However, it doesn't discourage any strategies in particular and doesn't encourage cycling of players' decks, while keeping in theme with the original game's formula of punishing players' scores for losing heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=544513","commentId":544513,"userName":"Periculum","timestamp":1319059947,"content":"I've had a few thoughts on running a tournament. I'm interested in coming up with a good way to run a tourney. Perhaps we can combine ideas here for something awesome. I was thinking a \"swiss\" style of sorts with two players paired in each game. The scenarios step up each round. For instance the intro scenario for the first game, a rank 4 for the next and and one of the 7's for the last round. Each pair keeps a record of their score for each game (total score for the two players). Avoid pairing players with each other in following rounds. Each player keeps track of their cumulative score from first to last scenario and it would be highly unlikely that two people would have the same score by the end of the day. This way even a low threat player (such as a player playing spirit all day) would have to keep his ally in mind during their game because they each take away the same score. I thought that perhaps the last scenario could be three players instead of two based on how difficult the final scenarios can be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=544546","commentId":544546,"userName":"Dwnhmcntryboy","timestamp":1319064739,"content":" K.I.S.S!!!!! There are numerous threads complaining about how many steps to do this or that. Tournaments do not need to be that hard. FFG already gives you a formula to see how well you or your team did.\n\nOrganize a tournament.\n\nAre you hosting a solo or team event?\nHow many people per team?\nHow many teams?\nHow many of what scenario<s> do you need?\nIs there a time limit per round?\nDo you want to exclude multiple core sets?\nWhat are the over all win conditions? <lowest score as per rule book logging all scores each round>\n\n\nSingle elimination is best IMO. If your team does not beat the first scenario you are eliminated. If you beat the first scenario then you advance to the next one <and so on> or just choose the winner by lowest score.\n\nThe more steps you add to determine who wins what the more room there is for error and confusion and players like things to be self explanatory and would rather handle things themselves than have to turn top the Judge all the time.    \n\nThe only problem is keeping people/teams honest since this is a co-op game and not a vs. game.   For me trying to make a co-op game be Vs. is an abomination. Play another game if you want to play a heads up game.        \n\nI know I probably sound like a ****** but you need to have things be ironclad and a T/O cannot be taken for a weakling in these things. This is all just my opinion and I don;t have the answers for everything but hopefully I have given you a good place to start.                                                                                                                               "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=544564","commentId":544564,"userName":"Lenbo","timestamp":1319068288,"content":"Dwnhmcntryboy said:\n\n \n\n K.I.S.S!!!!! There are numerous threads complaining about how many steps to do this or that. Tournaments do not need to be that hard. FFG already gives you a formula to see how well you or your team did.                                                                                                                            \n\n \n\n \n\nSo you want to allow people to continuously cycle their decks with Will of the West/Dwarven Tomb and The Galadrim's Greeting/Gandalf to get their score as low as possible? That's one of the major reasons I suggested my scoring system, because it removes Threat lowering effects from the scoring. Almost anything is better than the scoring system FFG suggests. Why would you ever want to count Hero damage as a way of gauging how well you did? Gimli/Gloin users would be screwed, as well as any decks without healing.\n\nOtherwise, I don't have much of a problem with your tournament questions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=544611","commentId":544611,"userName":"Glaurung","timestamp":1319076278,"content":"As i heard they will develop special tournaments pack with special tournaments quests. So this sounds cool!!!\n\nYou come with your friend declare as a team and have another team daclare them self as well. than you start to play against quest which one no one see before.\n\nThis make tournaments interesting. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/54996-tournament-rules-some-ideas/?do=findComment&comment=545083","commentId":545083,"userName":"Dwnhmcntryboy","timestamp":1319137190,"content":"Lenbo said:\n\nDwnhmcntryboy said:\n\n \n\n K.I.S.S!!!!! There are numerous threads complaining about how many steps to do this or that. Tournaments do not need to be that hard. FFG already gives you a formula to see how well you or your team did.                                                                                                                            \n\n \n\n \n\nSo you want to allow people to continuously cycle their decks with Will of the West/Dwarven Tomb and The Galadrim's Greeting/Gandalf to get their score as low as possible? That's one of the major reasons I suggested my scoring system, because it removes Threat lowering effects from the scoring. Almost anything is better than the scoring system FFG suggests. Why would you ever want to count Hero damage as a way of gauging how well you did? Gimli/Gloin users would be screwed, as well as any decks without healing.\n\nOtherwise, I don't have much of a problem with your tournament questions.\n\n\n\nThis is why time limit and scenario choice is so important. It allows you to use the frame work FFG has already laid out without making it complicated."}]}