{"url":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/","title":"change in special abilities for solo play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=544932","commentId":544932,"userName":"ulrik","timestamp":1319119368,"content":"i would like to have new abilities to replace those which are useless in solo play ,  it will make that fantastic game  a real solo game  thank you FFG\n\nex : ranged allow to target staging area in solo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=544951","commentId":544951,"userName":"Svenn","timestamp":1319120981,"content":"Simple changes like this completely change the game. Being able to have any ranged character attack enemies in the staging area might seem like a simple change, but it has a massive effect on game balance. I would be very careful about what you change.\n\nAlso, you don't need every single card to be useful for single player. Part of deck building is knowing when a card is going to be useful and when it will not. If you are playing solo then any card designed around the coop aspect just shouldn't be in your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=544986","commentId":544986,"userName":"gatharion","timestamp":1319123822,"content":" Yeah. Geeze, Legolas would be a freaking BEAST in solo play if he could attack enemies in the staging area. As he is, he's still quite useful for his Progress Token giving power.\n\nBrand is a lot less useful in solo play, but so what? That's one Hero. I think there are getting to be enough deck building options for solo play that having some stuff be kinda useless just isn't that big a deal.\n\nSometimes they might even surprise you. Last night I decided to try out a Lore/Leadership deck I had made and forgot that I had included Gildor's Council, Play during the Quest phase, before characters are committed to the Quest.\nAction: Reveal 1 less card from the encounter deck this phase. (To a minimum of 1.) which looks useless in solo play, but then I ended up playing Journey Down the Anduin and the second stage of that requires revealing an extra card from the encounter deck (which I had forgotten about) and suddenly those Council cards were really handy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=546133","commentId":546133,"userName":"ulrik","timestamp":1319374983,"content":"well ok this exemple is not so good but it's was just an exemple the purpose of the post was to state that if every card is poentialy usefull in a two player game they can be useless in a single's one or too expensive because you will never use the ability (ranged, sentinel etc)l"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=546143","commentId":546143,"userName":"guciomir","timestamp":1319376596,"content":"Actually, ranged is used a lot in Rhosgobel quest even in Solo play. And I really think that FFG will do something similiar with Defender keyword soon.\n\nNo changes are necessary I think, the only thing I would name is Brand as his ability is completely worthless in solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=546152","commentId":546152,"userName":"ulrik","timestamp":1319378077,"content":"or they can make a pack with a hero or cards for solo play only  because it's just one hero or you don't need to have every cards usefull...gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=546178","commentId":546178,"userName":"gatharion","timestamp":1319383073,"content":" I play both Solo and co-op (prefer co-op). Just like I'm perfectly fine with Brand, I'd be perfectly fine with a Hero who had an ability that was only useful in solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55065-change-in-special-abilities-for-solo-play/?do=findComment&comment=546348","commentId":546348,"userName":"Glaurung","timestamp":1319420622,"content":"Yes Bard ability is only in coop. But this ability is really amazing!!!!\n\nIt helps a lot for example in the beginning of Osgiliath quest where is many enemies attack both players and Brand ability helps to get extra defender or attacker or ready some important ally and allow to use him ability again. For example Doghter of Nimrodel can heal 4 damages in 1 round instead 2.So in 2 rounds she ca heal 6 damage or Beravur can draw more 2 cards or defender can be untap for attack again. Very cool hero and with U courage his more effective."}]}