{"url":"https://community.fantasyflightgames.com/topic/55096-played-with-a-mistake-doublechecking/","title":"Played with a mistake: doublechecking","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55096-played-with-a-mistake-doublechecking/?do=findComment&comment=545227","commentId":545227,"userName":"Darthvegeta800","timestamp":1319171623,"content":"Apparently at the local store we all were playing things wrongly but the shopkeeper found noticed it recently.\n\nBut to doublecheck (which never hurts):\n\nDefending heroes are assigned 1 by one. Not all at once by all players. A hero assigned to defend (or ally) that is untapped after defending by an action ro effect can then defend a 2nd, 3rd, 4th,... time. In the case of Sentinels even a 1st or later time at another player's location?\n\nAttacker is basically the same. Each attack fights 1 by one. Assigning only when it's up to the next battle. Hence a ranged hero for instance could partake at it's own 'battlefield', be untapped and then assist in attacking at an opposing player's battle?\n\nLOL if this is true we made things for us needlessly hard to a degree. >_>; Sometimes I wonder how many other things in other games I or others do wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55096-played-with-a-mistake-doublechecking/?do=findComment&comment=545245","commentId":545245,"userName":"richsabre","timestamp":1319176246,"content":"i have been fighting one by one on all characters, i think thats right"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55096-played-with-a-mistake-doublechecking/?do=findComment&comment=545254","commentId":545254,"userName":"Sportacus","timestamp":1319177124,"content":"Did you ever read the manual??\n\nDefending is on 1 on 1 basis, attaccking is many to 1 basis.\n\nSentinel and Ranged may be used to defend and attack enemy engaged with another player"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55096-played-with-a-mistake-doublechecking/?do=findComment&comment=545628","commentId":545628,"userName":"Angus Lee","timestamp":1319237043,"content":"After a character defends or attacks, that character remains exhausted (will not ready/untap) until the refresh phase (which comes after the whole combat phase).  So normally, a character can only defend or attack once (if that is not exhausted previously in that turn) in the combat phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55096-played-with-a-mistake-doublechecking/?do=findComment&comment=545667","commentId":545667,"userName":"Festerduley","timestamp":1319248497,"content":"That's why he specifically mentioned abilities that untap that character like the Event \"Ever Vigilant\" or Aragorn's ability."}]}