{"url":"https://community.fantasyflightgames.com/topic/55162-an-idea-regarding-tournament-play/","title":"An Idea regarding tournament play:","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55162-an-idea-regarding-tournament-play/?do=findComment&comment=545795","commentId":545795,"userName":"xGaffgarion","timestamp":1319289616,"content":"A few months back the idea of tournament play was thrown around here quite a bit.  It seems lately that discussion has died down.  Is this because FFG has already announced their idea for tournaments?\n\n \n\nIf so, let me know here, and a link would be appreciated.  If not, I have an idea for tournament play that I would enjoy the communities feedback on:\n\n \n\nLord of the Rings LCG Tournament Play:\n\nThis format would require 1 tournament organizer.  The organizer would select which sequence of quests would be played week to week.  Meaning that in a given tournament a team would have to make a deck that could stand up to multiple adventures.  Players would know how who won by a point system. Below will be bullets on how the actual tournament would work: \n\nThe Previous week the quest sequence for the rounds are announced.  (this week, the organizer has decided that it will be Journey->HfG->MaO)\n\nPlayers arrive in teams of 2 with decks they believe will be able to complete these quests. \n\nTeams sit across from one another, and next to another team.  Before every round, encounter/player decks are shuffled and cut the other seated team.  The setup of quest 1 a is read, and players set up the staging area.  After the organizer gives the call, players flip to 1b and the quest begins. \n\nRound 1 begins with players starting with Journey Down the Anduin:  This round is timed.  The first team to finish the Final Objective Claims 8 points the 2nd finisher received 7 and 3rd receives 6.   Everyone else who finishes claim 5.  Any who fail or cannot complete in the alloted time receive 0. \n\nAt the end of the round points are placed, and players begin prepareing for the 2nd round. \n\nRound 2  is also timed, and has the same rules as round 1.  Same scoring scale, etc  Except for this round players play the 2nd quest in the list, which for our exanple is The Hunt for Gollum.  After the time allotment players add their current scores to the score for the previous round. \n\nThe 3rd round follows as 2 and 1, and for this example players are now playing Massing at Osgiliath.  After the time limit players tally their finishing scores and the winner is announced. \n\n \n\nThis is just a rough outline of a tournament idea.  Of course there will always be situations and fine tunings, but i feel that an announced multiquest structure allows for a living deck building meta, as well as the flexibility to play and feel like every deck may have a shot depending on the current quests selected for that tournament.\n\nAny questions or elaborations needed please post,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55162-an-idea-regarding-tournament-play/?do=findComment&comment=545842","commentId":545842,"userName":"silverhand77","timestamp":1319300224,"content":"I like your idea :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I posted a similar suggestion on another thread though not as detailed.\n\nSo you are suggesting teams of 2 and 1 deck each for all 3 quests. Maybe keeping it simple like this is the way to go early on, But I've been thinking that you could have divisions, so there could be solo, 2 player, 3 player and 4 player. Also you could allow a different deck for each quest or (and I'm not sure if this would even work) a sideboard of cards that can be interchanged with the main deck to deal with situational differences in the quests, for example if you are playing Journey To Rhosgobel, you might need more healing etc. "}]}