{"url":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/","title":"I can see Minas Tiroth from my house - A Massing at Osgilaith session report [its looooooong]","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547148","commentId":547148,"userName":"Bohemond2","timestamp":1319550274,"content":"\nI just got my hands on Osgilith and was itching to try a solo session against it. At the same time, based on some discussions in other posts, I wanted to show people how a Spirit/Lore draw-control deck functioned in practice. This seemed like a good chance to do both. Of couse, I knew Osgilith was going to be beast, so there was always the possibility I would be stomped early, especially in my first couple of attempts. But, I decided to give it a whirl.\n\nAs for my deck, I have 2 core sets and all of the expansion. I maintain four decks at any given time, and don’t adjust my decks based on the scenario I face. This spirit lore deck is my strongest deck from solo play, but I don’t make any claim that it is an ideal deck, and it could certainly use improvement. The Stand & Fights in particular are a relic from when I used to think you could use them on Gandalf.\n\nThe deck takes advantage of massive Card draw (beravor, Unexpected Courage, Gelowin & ancient Mathon), and uses low threat and cancelation cards (A test of wills, hasty stroke, strider’s path) to control the encounter deck. You have to healing (daughters and Lore), and with dwarven Tomb, Stand and Fight, Erebor Hammersmith & Will of the west you have access to most of the cards in your discard pile and meaning the deck can stay in action indefinetly. So, you want to keep your threat low, slowly build up resources and use your powerful allies and Protector of Lorien to carry the day for the deck.\n\n\nHeroes: Eowyn, Eleanor, Beravor Threat: 26\nWhich heroes to choose was one of my biggest debates in the game. With this deck, I always take Eowyn and Beravor, but I switch between Eleanor and Dunhere for my third. I didn’t remember being horrified by the treachery cards I had seen from the set, and Dunhere would be a champ against the Wainriders and Wolves (once I lower my threat). However, I am worried about the first turn. My deck only has one ally it can drop first turn. If I don’t get it, the Wolves will tear me apart. I decide to go with Eleanor just so I can wait until turn 2 to fight off the Wolves\n\nInitial Draw: Stand & Fight, Eomund, Hasty Stroke, Rivendell Minstrel, Stand & Fight Northern Tracker\nThe next decision; do I mulligan? It’s not a great draw, but I am suckered into keeping it because of northern Tracker and Eomund. Going over the game, I should not have kept the hand.\n\n\nTurn 1\nResources: beravor [1], Eleanor [1], Eowyn [1]\nDraw: Erebor Hammersmith\nPlay: -\nStaging: Snaga Scouts, Wolves From Mordor, Wainrider\nQuest: Eleanor, Eowyn [5 Will]\nEncounter: Snaga Scouts [5 Threat]\n0 Progress\nTravel: -\nEngagement: Engage Snaga Scouts, Engage Snaga Scout\nCombat: Snaga Scouts Attack, no defender, Captured Watchtower shadow card, 1 damage to Beravor\nSnaga Scouts Attack, no defender, Pelennor Fields shadow card, 1 damage to Beravor\nBeravor Attacks Snag Scouts, Killing them\nThreat: 27\nThe hammer smith is a great draw at this stage, giving me another turn 2 ally. Now, do I quest with Eleanor or Beravor? I take a gamble and quest for 5, knowing that I can toss a card to get to 6 if I have to. The gamble pays off and take some undefended attacks (and which I don’t think are as risking in MaO as other scenarios), so that Beravor can start clearing up the Snaga.\n\nTurn 2\nResources: beravor [2], Eleanor [2], Eowyn [2]\nDraw: Erebor Hammersmith\nPlay: Erebor Hammersmith, Northern Tracker\nStaging: Wolves From Mordor, Wainrdier Active Location: -\nQuest: Eleanor, Eowyn [5 Will]\nEncounter: Wainrider [5 Threat]\n0 Progress\nTravel: -\nEngagement: Wolves From Mordor,\nCombat: Wolves From Mordor, Erebor Hammer smith defends, Massing at Osgilith shadow card, Erebor Hammer smith dies, Wolves return to the deck\nSnaga Scouts Attack, Northern Tracker Defends, Wolves From Mordor shadow Card, 2 damage to northern Tracker\nBeravor Attacks Snag Scouts, Killing them\nThreat: 28\nNow we are cooking! I just wish I had attachments to cycle with Eowyn to get the hammersmith card advantage train rolling. Sure, I won’t make much progress, but my new allies let me restore control of the board. At the end of the turn the Saga is dead, the wolf has eaten my dwarf and I am left with two wainriders, that I should never have to engage. I am beginning to feel I have control of the game. Time to start getting some cards.\n\nTurn 3\nResources: beravor [1], Eleanor [1], Eowyn [1]\nDraw: Dwarven Tomb\nPlay: -\nStaging: Wainrider, Wainrider Active Location: -\nQuest: Eleanor, Eowyn, Northern Tracker [6 Will]\nEncounter: Wainrider [6 Threat]\n0 Progress\nTravel: -\nEngagement: -\nCombat: -\nBeravor draws Lorien Guide and Strider’s Path\nThreat: 29\nWait? More wainriders? Where is Dunhere when I need him? In any case, my low threat let’s me quest with everyone save before, who can block in an emergency, and otherwise draw cards. I need a few more tools before I actually start making progress. The Guide and Path put me in great shape to handle locations that might spring up. Still feeling good.\n\nTurn 4\nResources: beravor [2], Eleanor [2], Eowyn [2]\nDraw: The Galadhrim’s Greeting\nPlay: Lorien Guide\nStaging: Wainrider, Wainrider, Wainrider Active Location:\nQuest: Eleanor, Eowyn, Northern Tracker, Lorien Guide [7 Will]\nEncounter: Sanaga Scouts [7 Threat],\n0 Progress\nTravel: -\nEngagement: Engage Snaga Scouts\nCombat: Snaga Scouts Attack, no defender, Ruins of Osgilith shadow card, 1 damage to Eowyn\nBeravor Attacks Snag Scouts, Killing them\nThreat: 30\nI keep on with the same plan. The scouts present an interesting choice. I take a bit of gamble, don’t defend, and use beravor on clean up duty.\n\nTurn 5\nResources: beravor [3], Eleanor [1], Eowyn [2]\nDraw: Will of the West\nPlay: The Galadhrim’s Greeting, Rivendel Mistrell\nStaging: Wainrider, Wainrider, Wainrider Active Location: -\nQuest: Rivendel Mistrel, Eowyn, Northern Tracker, Lorien Guide [8 Will]\nEncounter: Cut Off [6 Threat]\n2 Progress\nTravel: -\nEngagement: -\nCombat: -\nBeravor draws Ancient Mathon, A Test of Will\nThreat: 26\nAt long last, progress! The minstrel pushes me over the top, and Greeting drops my back into a safe threat zone. It looks like we can finally start moving forward.\n\nTurn 6\nResources: beravor [1], Eleanor [1], Eowyn [1]\nDraw: Stand and Fight\nPlay: -\nStaging: Wainrider, Wainrider, Wainrider Active Location: -\nQuest: Rivendel Minstrel, Eowyn, Eleanor, Northern Tracker, Lorien Guide [9 Will]\nEncounter: Captured Watchtower [7 Threat]\n2 Progress\nTravel: -\nEngagement: -\nCombat: -\nBeravor: Gleowine and Gandalf\nThreat: 27\nWith this turn, I start getting confident. Given the cards I have, getting a location is actually a plus. Drawing Gleowine and Gandalf means I have the tools to make a big push.\n\nTurn 7\nResources: beravor [2], Eleanor [2], Eowyn [2]\nDraw: Miner of the Iron Hills\nPlay: Gleowine and Ancient Mathom [on Captured Watchtower]\nStaging: Wainrider, Wainrider, Wainrider, Captured Watchtower Active Location: -\nQuest: Rivendel Minstrel, Eowyn, Eleanor, Northern Tracker, Lorien Guide, Beravor [11 Will + 1 progress on watchtower]\nEncounter: Emyn Arwen Overlook [9Threat], Discard Miner of the Iron Hills\n3 Progress, completing stage 1\nTravel: Emyn Arwen Overlook\nEngagement: -\nCombat: -\nGleowine: draws a test of wills\nThreat: 28\nI decide to hold Gandalf for stage 2. Getting at gleowine allows me to commit beravor to the quest and still have an emergency blocker. I quest for enough to clear the stage and the watchtower, cashing in on the Ancient Mathon.\n\nTurn 8\nResources: beravor [1], Eleanor [3], Eowyn [2]\nDraw: Song of Wisdom\nPlay: Gandalf, killing Wainrider\nStaging: Wainrider, Wainrider, Captured Watchtower Active Location: Emyn Arwen Overlook\nQuest: Rivendel Minstrel, Eowyn, Eleanor, Northern Tracker, Lorien Guide, Beravor, Gandalf [15 Will + 1 progress on watchtower, clearing Watchtower, +1 progress on Emyn Arwen Overlook]\nAncient Mathom draws: Lore of Imladris, Lorien Guide, The Galadhrim’s Greeting\nEncounter: Morguldun [5Threat]\n10 Progress, completing stage 2\nTravel: -\nEngagement: -\nCombat: -\nGleowine: Lore of Imaldris\nThreat: 29\nWith Gandalf in hand, I decide to make a big push, and try to complete this stage in a single turn, in part so I can clear the Overlook, which looks particularly nasty. I finally kill one of those **** Wainriders. In retrospect, I should have kept playing the slow game. I have drawn over half my deck, but still have yet to get a Protector of Lorien or an Unexpected Courage. I need those cards to win. But they must be coming up soon. Right?\n\nTurn 9\nResources: beravor [1], Eleanor [2], Eowyn [1]\nDraw: The Galadhrim’s Greeting\nPlay: The Galadhrim’s Greeting\nStaging: Wainrider, Wainrider, Morguldun, WitchKing Active Location: -\nQuest: Sacrifice Eleanor\nRivendel Minstrel, Eowyn, Northern Tracker, Lorien Guide, [8 Will + 1 progress on Morguldun]\nEncounter: Cut Off [5Threat], Discard Erebor Hammer Smith\n3 Progress, completing stage 3\nTravel: -\nEngagement: -\nCombat: -\nGleowine & Beravor: Striders Path, Forest Snare & Northern Tracker\nThreat: 25\nI begin to see the trap I have stumbled into. The sacrifice requirement for the stage means I have to push through on this turn. I sacrifice Eleanor without a second thought. She has literally been as useful as a Wandering Took in the game thus far. She got me through the first turn, but hasn’t done anything beyond that. At least my threat looks low. I have now drawn thirty cards and not found what I need. I am starting to think that two PoLs are the bottom cards in my deck.\n\nTurn 10\nResources: beravor [2], Eleanor [1], Eowyn [1]\nDraw: Protector of Lorien\nPlay: Protector of Lorien on Eowyn\nStaging: Wainrider, Wainrider, Morguldun, Witch King Active Location: -\nQuest: Rivendel Minstrel, Northern Tracker, Eowyn [4 Will + 1 progress on Morguldun]\nEncounter: Dark Pursuit [13Threat], cancel with A test of will\nDiscard Song of Wisdom (x2), Lore of Imladris (x3), Striders Path (x2) Forest Snare, Northern Tracker\n0 Progress\nTravel: -\nEngagement: Engage Witch King\nCombat: Witch King attacks, Lorien Guide Defends, Mass at Osgilith Shadow Card, Guide Dies\nGain 3 Threat\nGleowine & Beravor: Self Preservation, Rivendell Minstrell, Lorien Guide\nThreat: 29\nProtector of Lorien! However, I hadn’t wrapped my head around just how awful the Witchking was. If I had engaged him last turn, I would now be riding back home to Minas Tirath. As it stands, I have to slough 9 cards just to keep from failing my quest. I engage the Nazghul Lord. Since I don’t plan on travelling, the guide is the first to face his wrath.\n\n\nTurn 11\nResources: beravor [2], Eleanor [2], Eowyn [2]\nDraw: Hasty Stroke\nGleowine & Beravor: Daughter of Nimrodel Unexpected Courage, Dwarven Tomb\nPlay: The Galadhrim’s Greeting\nStaging: Wainrider, Wainrider, Morguldun Active Location: -\nQuest: Rivendel Minstrel, Northern Tracker, Eowyn, [7 Will + 1 progress on Morguldun, clearing it]\nEncounter: Ruins of Osgilith [5 Threat]\nPlay: The Galadhrim’s Greeing\nDiscard 13 of 15 Cards\n15 Progress\nSure… now I draw UC. In retrospect, reducing threat was yet another poor decision. It worked out, but I would have been furious if I need that extra willpower that I could have gotten from playing unexpected courage, or Stand & fight.\n\nOverall, it was a very fun scenario. I doubt I will enjoy the same success on subsequent play throughs. I was never badly burned on my early gambles, and I drew what I needed to overcome some bad mistakes (though, in that many draws, I should find the cards I need). I certainly know that I will be better prepared next time through and won’t fall into the same traps.\n\n \n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547156","commentId":547156,"userName":"Bohemond2","timestamp":1319551064,"content":"I forgot to add that this is a complex scenario with a ton of restrictions and conditional modifiers.  It's certainly possible that I screwed something up in the scenario; apologies for any mistakes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547165","commentId":547165,"userName":"Glaurung","timestamp":1319552498,"content":"Cool Report. And cool quest. I already get it in August so i little bit bored with this one.\n\nI wanna hear your opinion after when you play this one for a while and comeback to Mirkwood cycle and maybe find it really not so exiting as before???\n\nThis quest very good in my opinion is the best but is only one for now...........\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547175","commentId":547175,"userName":"Dam the Man","timestamp":1319553572,"content":"All those undefended attacks early and no real Shadow Effects on them? Lucky bastard demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547187","commentId":547187,"userName":"Bohemond2","timestamp":1319554990,"content":"Dam said:\n\n \n\nAll those undefended attacks early and no real Shadow Effects on them? Lucky bastard demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] !\n\n \n\n \n\nIt's not AS lucky as it seems. 21 of the 40 cards in the set have shadow effects. But seven of those 21 only effect you if you have a defender. 4 more introduce effects that have no bearing at all on the defender.  The remaining 10 shadow cards would have been worse, but I don't there was ever a situation where a bad shadow card draw on an undefended attack would have cost me to lose a hero.  For a deck with card draw, the worst shadow effect in the encounter is Morguduin, and it doesn't matter if that comes out against a defender or not.\n\nhonestly, against 1 str attacks, I think you almost have better odds not defending than defending.\n\n@Glaurung - I liked it a lot, but I won't have any porblem going back to non-Emyn Muil scenarios in Mirkwood.   I think my favorite thing in MAO may be the lack of random damage that gets thrown into mirkwood encounter cards to make scenarios challenging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547238","commentId":547238,"userName":"silverhand77","timestamp":1319559599,"content":"@ Bohemond,\n\nAny chance you could post your decklist for this scenario? I just received MAO 2 days ago and would love to build your deck and give it a go. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547253","commentId":547253,"userName":"Bohemond2","timestamp":1319561334,"content":"silverhand77 said:\n\n@ Bohemond,\n\nAny chance you could post your decklist for this scenario? I just received MAO 2 days ago and would love to build your deck and give it a go. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nSure thing.  Though, as I said, it is by no means a perfect list\n\nLore - 19 cards\n\nEvents - 5 cards\n\n * Striders Path (x2)\n * Lore of Imladris (x3)\n\nAllies – 11 cards\n\n * Rivendel Minstrel (x2)\n * Daughter of Nimrodel (x2)\n * Gleowine (x2)\n * Erebor Hammersmith (x2)\n * Miner of the Iron Hills (x2)\n * Henamath riversong (x1)\n\nAttachments – 3 cards\n\n * Forest Snare (x1)\n * Protector of Lorien (x2)\n\nSpirit – 27 cards\nAllies - 7 cards\n\n * Eomund (x1)\n * Lorien Guide (x3)\n * Northern Tracker (x3)\n\nEvents -15 cards\n\n * Dwarven Tomb (x2)\n * The Galadhrim’s Greeting (x3)\n * Hasty Stroke (x2)\n * Stand & Fight (x3)\n * A Test of Will (x3)\n * Will of the West (x2)\n\nAttachments - 5 cards\n\n * Ancient Mathon (x3)\n * Unexpected Courage (x2)\n\n\nNeutral - 4 cards\n\n * Gandalf (x2)\n * Song of Wisdom (x2)\n    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547279","commentId":547279,"userName":"silverhand77","timestamp":1319564969,"content":"Thanks Bohemond, I'll build and try it. I can let you know how I go if you like. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547345","commentId":547345,"userName":"Bohemond2","timestamp":1319580312,"content":"I would love to hear how it goes.  I did three more play throughs.  I won one, lost another in the first few turns, and had a second loss because I moved too fast.  Slow and steady is key to this deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547386","commentId":547386,"userName":"booored","timestamp":1319588741,"content":"This is pretty sim to my own deck, but I splash Leadership though the Prince and use songs to make his mana pool worthy. this sounds like a real handicap but I find that this forced \"saving\" of coin until the song is drawn or the minstrel pulls it, means you suddenly have all this cards ready to play as by then your card draw is on par. The splash for leadership allows the gondor mana gain thing, so resources are not even slightly a problem by late game, just when things are getting crazy.\n\nThe only \"complex\" thing is that my deck dose not run Eleanor. Now she is great, but I think that her inclusion in many decks is a old habit from playing dueling games, were you need answers to surprise events. In LoTR you know exactly what threats are in the encounter deck, and MaO is even easier as the card pool of the encounter deck is so shallow. This means you do not need such a broad tool as Eleanor, instead you can just use the spirit cancels and know that you only use them when the correct card comes out. This frees up the hero slot for something more aggressive, as in the prince (in my deck), whom is also a leet quester or Denathor for sifting the encounter deck to make sure you hit those ranger allys, jus tremeber to sift after questing, and before shadow cards.. as you want to pull the rangers then, no matter WHAT it is send it down... get though teh encounter deck as fast as poss when running Den.\n\nWill of the West's inclusion shows you know what your doing. So many people think this card is trite, but in a Unexpected-Beravor deck were drawing 6+ cards a round is a regular game state, well these cards are true gold...\n\nAll in all interesting deck... I do not think this will run Journey to Rhosgobel though.. have you tried it on that one yet? I am finding that this quest is the killer in trying to design a deck to run the entire shadows of mirkwood campaign. I think that many deck builders are looking to build a solo or a Team Deck to run the entire block after the last 2 packs come out.\n\nDo you think we should try and make up a variant rule for sideboarding for this? Or is is one deck, no changes for the entire quest?\n\n \n\nPS - consider posting yoru deck at www.cardgamedb.com [http://www.cardgamedb.com] I would love to see this site used more often, as FFGs forum is really bad for archiving stuff. CGDB has a fantastic way of archiving decks for posperity.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547463","commentId":547463,"userName":"silverhand77","timestamp":1319608627,"content":"Bohemond said:\n\nI would love to hear how it goes.  I did three more play throughs.  I won one, lost another in the first few turns, and had a second loss because I moved too fast.  Slow and steady is key to this deck.\n\n\n\nSweet :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I haven't built it yet, I'm still playing with Glaurung's deck that he posted the other day. But I will build it soon :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547592","commentId":547592,"userName":"Glaurung","timestamp":1319633035,"content":"Bohemond said:\n\nsilverhand77 said:\n\n \n\n@ Bohemond,\n\nAny chance you could post your decklist for this scenario? I just received MAO 2 days ago and would love to build your deck and give it a go. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\nSure thing.  Though, as I said, it is by no means a perfect list\n\nLore - 19 cards\n\nEvents - 5 cards\n\n * Striders Path (x2)\n * Lore of Imladris (x3)\n\nAllies – 11 cards\n\n * Rivendel Minstrel (x2)\n * Daughter of Nimrodel (x2)\n * Gleowine (x2)\n * Erebor Hammersmith (x2)\n * Miner of the Iron Hills (x2)\n * Henamath riversong (x1)\n\nAttachments – 3 cards\n\n * Forest Snare (x1)\n * Protector of Lorien (x2)\n\nSpirit – 27 cards\nAllies - 7 cards\n\n * Eomund (x1)\n * Lorien Guide (x3)\n * Northern Tracker (x3)\n\nEvents -15 cards\n\n * Dwarven Tomb (x2)\n * The Galadhrim’s Greeting (x3)\n * Hasty Stroke (x2)\n * Stand & Fight (x3)\n * A Test of Will (x3)\n * Will of the West (x2)\n\nAttachments - 5 cards\n\n * Ancient Mathon (x3)\n * Unexpected Courage (x2)\n\n\nNeutral - 4 cards\n\n * Gandalf (x2)\n * Song of Wisdom (x2)\n    \n\n\n\nHmmm I see the way how you build up your decks is really different to my way. Looks very solid and cocked. Interesting deck i should try it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547670","commentId":547670,"userName":"muemakan","timestamp":1319643082,"content":" Nice play report. I hope more players put down some detailed reports. I find them quite entertaining.\n\nJust one thing I noticed. It seems to me you played 2 Galadhrim´s Greeting in you last turn with only one resource to use. Wouldn´t have changed much if you\n\nhaven´played them, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547713","commentId":547713,"userName":"Bohemond2","timestamp":1319651673,"content":"You are correct, i scrwed up and should not have been able to play that last greeting.  Luckily, it just alters final score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547785","commentId":547785,"userName":"Kobby","timestamp":1319667778,"content":"Nice writeup and nice Deck, it is very similar to a deck i am running as a part of a 2 deck combo (together with Glaurung) and that made me try it solo against  MaO.\n\n   It is not designed to go solo and is not design to be specifically against MaO (Its a take them all kind of deck), but surprisingly it was doing very good as a solo deck against MaO.\n\nHeroes\n\n *         Eleanor\n *         Eowyn\n *         Beravor\n\n \n\nAllys (22) \n\n *         Lorien Guide x3\n *         Northern tracker x3\n *         The Riddermark's Finest x3\n *         Daughter of the Nimrodel x3\n *         Gildor Inglorion x1\n *         Gleowine x2\n *         Henamarth Riversong x2\n *         Haldir of Lorien x1\n *         Miner of the Iron Hills x2\n *         Gandalf x2 \n\nEvents (19) \n\n *         A Test of Will x3\n *         Dwarven Tomb x3\n *         Fortune or Fate x1\n *         Hasty Stroke x3\n *         The Galadhrim's Greeting x3\n *         Will of the West x1\n *         Stand and Fight x3\n *         Lore of Imladris x2 \n\nAttachments ( 9 ) \n\n *         Unexpected Courage x3\n *         A Burning Brand x2\n *         Protector of Lorien x2\n *         Song of Wisdom x2\n\nyou can play with it as is for a more than avg win % against MaO or fit it better for Massing ( probably change L.o Imladris for Erebor Hammersmith ) for even better win %.\n\n   I saw you are running Ancient Mathon, i tried it few times on my deck and I never found it helped my deck that much, every time i drew it i much have rather drew an UC (or any other card for that matter) I strongly suggest getting a 3rd UC instead one of the A.M, I would also drop a copy of Will of The west. I have one in my deck and its enough to handle 2 decks discard piles changing it for another dwarven tomb will give you better control IMO.\n\n \n\nCheers\n\n  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547802","commentId":547802,"userName":"booored","timestamp":1319670636,"content":"yea this is much more like mine... but again.. I think Elenore is a bad choice in a quest like this one... her ability it just to braod.. and uneeded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547815","commentId":547815,"userName":"Kobby","timestamp":1319675010,"content":"you might be right. But this deck was not designed for a solo play and not for MaO only.\n\n  Eleanor is a back up cancel when revealed and with 2 def she is a decent defender. I don't see any other spirit hero fitting more for this deck atm."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547819","commentId":547819,"userName":"Glaurung","timestamp":1319677059,"content":"Actually i just realize Ancient Matton is a perfect combo with Riddermark finest. You play Matton on location and if you have Horse you just get rid of Location and get 3 cards. Not bad. I like it a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55296-i-can-see-minas-tiroth-from-my-house-a-massing-at-osgilaith-session-report-its-looooooong/?do=findComment&comment=547825","commentId":547825,"userName":"Kobby","timestamp":1319679556,"content":"Glaurung said:\n\nActually i just realize Ancient Matton is a perfect combo with Riddermark finest. You play Matton on location and if you have Horse you just get rid of Location and get 3 cards. Not bad. I like it a lot.\n\n\n\nIts a nice combo but not for this deck. this deck already have insane ability to draw cards, but have problem with resources, AM just gives you more of what you have and take from what you lake."}]}