{"url":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/","title":"Who&#039;s your favorite Hero so far? :)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=548924","commentId":548924,"userName":"DurinIII","timestamp":1319890713,"content":"So, I thought this may be an interesting thread. Who's your favorite hero and why do you like them?\n\nI will start: Gimli. Reason: He is my favorite character in the books, but as far as gameplay it should be pretty obvious...this dwarf is a tank!!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=548938","commentId":548938,"userName":"Mighty Jim 83","timestamp":1319892690,"content":"Up until Emyn Muil, the tactics deck in our multi-player games was generally fairly  strongly centred around Gimli. However, now we almost always use use Brand/Legolas/Thalin. Thalin's ability can make a massive difference to revealed enemies, even if his willpower isn't too hot. (especially against Eastern Crows) and the ranged keyword on the others is generally the best way forward for a multi-player game.\n\nAlthough it disappoints me slightly, as she's not a \"proper\" character. I think by far the most useful hero so far is Eleanor. Ok, sometimes it backfires, and you draw something as bad (or worse?) to replace the cancelled card, but generally speaking, the ability to have another chance at avoiding a nasty card (especially in Rhosgobel) is just priceless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=548943","commentId":548943,"userName":"Narsil0420","timestamp":1319894413,"content":"Legolas and Imrahil for me.\n\nWhat inspires my admiration is a combination of liking the character from the source material, good art for the card, and usefulness in the game. For me all three of those things have to be right to make it a stand out hero. Legolas is my favorite character in the books and Imrahil is also awesome. I saw Imrahil as the epitome of what a Gondorian should be. Denethor and his boys are all important but flawed in some way. The art for both cards is great. Everytime I look at Imrahil's card I want to sing some riding war-chant like the Rohirrim do when they ride into battle. And Legolas' art is my favorite piece in the game, I love the decision to make his hair dark. Both of these heroes are very versatile, Imrahil combos great with Rohan and I love that Legolas has a foot in both worlds: fighting and questing. I think that is so appropriate given his role in the fellowship as both a wicked assassin and the \"eyes and the ears of the fellowship\" as Orlando Bloom put it.\n\nThere's my two cents"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=548956","commentId":548956,"userName":"lleimmoen","timestamp":1319898140,"content":"Nicely said, Matthew. Or written.\n\nI very much like Legolas and Imrahil, too. It is very hard to call a favourite though, especially from the gaming point of view. For instance, Dúnhere is the best in some quests, like Osgiliath, if deck-built well around, but in other quests he is far, far from it. Obviously, Beravor and Éowyn are both very powerful. But I like how they make it harder for Éowyn, at first she seemed an obvious choice for any solo deck, now she shall struggle hard in some quests that damage questing characters.\n\nWith the options ever growing, I much enjoy building thematic decks, like Rohan, even though I am perhaps more looking forward to Gondor or Noldor.\n\nI see I am not answering the question. My most favourite from the books have usually become allies, like Gandalf or Beorn, and Tom Bombadil will as well, I think. Out of the heroes, Boromir is my favourite character from the books, and he will likely take the spot in the game. I'd like to see a new and more potent version of Glorfindel, as I like him a lot, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=548972","commentId":548972,"userName":"richsabre","timestamp":1319902508,"content":"i think bilbo, he's one of my favourites from the books and the double card draw is great, either him or beravor, because the art is awesome"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=548983","commentId":548983,"userName":"Doom1502","timestamp":1319904366,"content":"Legolas, for the exact same reasons Narsil0420 pointed out ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=548993","commentId":548993,"userName":"marlow4","timestamp":1319906289,"content":"I would probably have to say Legolas as well. His ability plus the fact that he is ranged is great. I don't really have to worry about what I am going to use him for from round to round, I know he's basically my sniper. I could see where he might not be as popular for players that play primarily solo, but in multi he is a great asset."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549059","commentId":549059,"userName":"gatharion","timestamp":1319929186,"content":" I've only played him once, but Prince Imrahil really impressed me and I'm really looking forward to using him more.\n\nPrince Imrahil + \"Nor am I a Stranger\" w/ a bunch of Rohan allies = GOLD!!!\n\n \n\nI must also like Bilbo quite a lot as he seems to keep sneaking into my decks.\n\n \n\nGlorfindel, Thrain, Eowyn, and Legolas all get a lot of play too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549060","commentId":549060,"userName":"Puzzle2","timestamp":1319929292,"content":"I would have to agree with Narsil about Imrahil: I love both the art and the game mechanics. In fact I have used him in every Leadership deck since he was available, replacing Aragorn. I am also very excited about Boromir and I can see him becoming a strong favorite. As a strictly solo player, anyone that can ready themselves is fantastic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549093","commentId":549093,"userName":"booored","timestamp":1319938070,"content":"Prince Imrahil is my fav at the moment. I think he has so must versatility, a good quester, good attacker and good defender and more importantly can synergise with a heap of cards, making it one of the only real combo enabled heroes.. witch of course allows you to make brokenly awesome plays that blow the encounter deck into rubble. No other hero has this kind of versatility, as in the sheer amount of game situations that he can be used in due to his triggers from other the other neat cards in your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549106","commentId":549106,"userName":"Narsil0420","timestamp":1319942916,"content":"lleimmoen said:\n\nNicely said, Matthew. Or written.\n\n\n\nThank you sir!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549118","commentId":549118,"userName":"Mighty Jim 83","timestamp":1319946829,"content":"I'm a bit surprised by the amount of Imrahil love around here. What's so great about him? I used him a few times when he first appeared, but have basically given up since.\n\nHis stats are good, sure but that just makes him very expensive threat-wise. His ability is only much use if you've got lots of characters leaving play (ideally one per round) which makes him pretty hopeless in a quest like Escape from Dolguldur, where there's an Ally cap, and nobody wants to waste it on someone for chump-blocking.\n\nLastly, and I think, most crucially, his lack of useful keywords. Aragorn is obviously the most similar character to Imrahil, and the fact that he is \"sentinel\" makes him far more useful. All too often, Imrahil sits around and doesn't do anything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549121","commentId":549121,"userName":"lleimmoen","timestamp":1319947993,"content":"I have tried both Aragorn and Imrahil a lot. A lot. And I can honestly say I prefer Imrahil without hesitation. It fits my style of playing better.\n\nThe things that are better for Aragorn: indeed, the sentinel keyword. That can be most helpful. The synergy with the Stone, yes, very good. Hit points, ok.\n\nImrahil has 1 lower thrat, useful, I'd say it balances the hit points well. In some scenarios, like Dol Guldur, hit points are probably the more useful, elsewhere it is vice versa. Imrahil's ability to ready is, in my opinion, way better though. Of course you need deckbuild around it but the opportunities here are ever growing. Most of the expansions favour this \"leaving play\" aspect. Horn of Gondor and Valiant Sacrifice strengthten this more. Think most of the Rohan allies, the Eagles, even Beornings, and the new Took.\n\nIt is funny because with this game, my initial thoughts have been very often far from what I have learnt later. With Imrahil I argued on the day he was previewed that he shall be better than Aragorn. I then played both in my decks without bias (I hope) and found my initial expectations justified.\n\nHowever, as I said above, this is very subjective point of view."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549178","commentId":549178,"userName":"Eryx_UK","timestamp":1319961280,"content":"For me it would be a close tie between Eowyn and Prince Imrahil, because both are priceless heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549446","commentId":549446,"userName":"Puzzle2","timestamp":1320015666,"content":"Mighty Jim said:\n\nI'm a bit surprised by the amount of Imrahil love around here. What's so great about him? I used him a few times when he first appeared, but have basically given up since.\n\nHis stats are good, sure but that just makes him very expensive threat-wise. His ability is only much use if you've got lots of characters leaving play (ideally one per round) which makes him pretty hopeless in a quest like Escape from Dolguldur, where there's an Ally cap, and nobody wants to waste it on someone for chump-blocking.\n\nLastly, and I think, most crucially, his lack of useful keywords. Aragorn is obviously the most similar character to Imrahil, and the fact that he is \"sentinel\" makes him far more useful. All too often, Imrahil sits around and doesn't do anything.\n\n\n\nOn the contrary to your last statement, I find that Imrahil gets used for two different actions almost every turn (quest/attack in early game and defend/attack in late game). While the chump block is the most obvious moment an ally leaves play, there are so many player cards that allow you to control when your cards leave play. Events like Sneak Attack, Ride to Ruin, and Born Aloft bring allies out of play. Also, many allies have abilities that require them to leave play. You can discard Westfold Horse-Breaker to ready one hero, and then because it leaves play, you can ready Imrahil as well.\n\nSince most of my play has been solo, I can't really comment on the usefulness of sentinel. I have seen ranged get a lot of action, but I can't recall in my limited co-op experience us ever using the sentinel keyword. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=549495","commentId":549495,"userName":"lleimmoen","timestamp":1320030793,"content":"Puzzle said:\n\nMighty Jim said:\n\n \n\nI'm a bit surprised by the amount of Imrahil love around here. What's so great about him? I used him a few times when he first appeared, but have basically given up since.\n\nHis stats are good, sure but that just makes him very expensive threat-wise. His ability is only much use if you've got lots of characters leaving play (ideally one per round) which makes him pretty hopeless in a quest like Escape from Dolguldur, where there's an Ally cap, and nobody wants to waste it on someone for chump-blocking.\n\nLastly, and I think, most crucially, his lack of useful keywords. Aragorn is obviously the most similar character to Imrahil, and the fact that he is \"sentinel\" makes him far more useful. All too often, Imrahil sits around and doesn't do anything.\n\n \n\n \n\nOn the contrary to your last statement, I find that Imrahil gets used for two different actions almost every turn (quest/attack in early game and defend/attack in late game). While the chump block is the most obvious moment an ally leaves play, there are so many player cards that allow you to control when your cards leave play. Events like Sneak Attack, Ride to Ruin, and Born Aloft bring allies out of play. Also, many allies have abilities that require them to leave play. You can discard Westfold Horse-Breaker to ready one hero, and then because it leaves play, you can ready Imrahil as well.\n\nSince most of my play has been solo, I can't really comment on the usefulness of sentinel. I have seen ranged get a lot of action, but I can't recall in my limited co-op experience us ever using the sentinel keyword. \n\n\n\nThis is what I believe, puzzle. And for those who don't, just consider the last sentence, puzzle enjoys Imrahil even though he is mostly playing solo. With more players, his usefulness obviously grows. You then get almost guaranteed double use in every round (perhaps not the first that likely). That is very powerful I'd say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55490-whos-your-favorite-hero-so-far/?do=findComment&comment=550193","commentId":550193,"userName":"gatharion","timestamp":1320146857,"content":" How useful Imrahil will be depends on what else you're playing.\n\nIf you're using lots of events/attachments that let you bring allies in and out of play his value goes up. He also pairs up REALLY well with the various Rohan allies. Prince Imrahil and the escort from Edoras go questing and that's a solid six willpower! Then the Escort leaves and Imrahil readies and can attack or defend as needed. Slap some of the Dunedain cards on him (which are in his own Sphere) and he become a versatile beast. Other Leadership and Gondor cards have less synergy with him (except for Sneak attack), but he's basically the best hero ever to pair up with the Rohan cards."}]}