{"url":"https://community.fantasyflightgames.com/topic/55526-massing-at-osgiliath-deleted/","title":"Massing At Osgiliath (Deleted).","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55526-massing-at-osgiliath-deleted/?do=findComment&comment=549214","commentId":549214,"userName":"Kobby","timestamp":1319968164,"content":"   Deleted Due to a mistake done on the 3rd Turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55526-massing-at-osgiliath-deleted/?do=findComment&comment=549230","commentId":549230,"userName":"lleimmoen","timestamp":1319972785,"content":"Just read first few rounds as of now. On round three you play Gandalf even though you only have 4 resources to pay for. You cannot use Radagast's resources to pay for Gandalf.\n\nIt seems like a minor point but you would probably be done very soon had you played this right. With no offense, please.\n\nI like Boromir very much but I think high threat is not a way to go into Osgiliath, although I believe you if you say you beat it consistently. Check out my strategy in the other thread if you have time. If I survive the beginning, I usually win in 8 or 9 rounds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55526-massing-at-osgiliath-deleted/?do=findComment&comment=549232","commentId":549232,"userName":"Kobby","timestamp":1319974408,"content":"I was Sure I had it right.\n\ntook a long time to do it, shame i need to delete it.\n\nstill, deck took out MaO a lot of time ( with out the mistake).\n\nseems like Osgiliath is the trickiest on the 1st few rounds if you manage to pass them you will probably win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55526-massing-at-osgiliath-deleted/?do=findComment&comment=549249","commentId":549249,"userName":"lleimmoen","timestamp":1319977290,"content":"You should not have deleted it due to that one mistake, I think. But I am sure you can provide a flawless session. I myself could not find strength to write such a thorough report (and my profession is writing, actually). I admire the patience and precision of those who can.\n\n[edit] And I agree, and I said in my post, I also find the first few rounds very tricky. I can even usually tell from the set up hand what my chances are."}]}