{"url":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/","title":"Sooooo........what do we think about the new scoring system?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549754","commentId":549754,"userName":"Titan","timestamp":1320070462,"content":"The long and short of it is that you must now add 10 points to your score for every round of play. This certainly will stop the over reliance on stalling the game for a better score while still keeping threat reducing abilities a factor. I don't now if this is the final answer, much is yet to be seen, including what happens at tournaments. However, I do think that taking into consideration the number of rounds required to beat a quest is a big step in the right direction. I've always felt that if you can beat a quest in less turns than the next guy, that constitutes a more impressive outing. So, do we like, dislike, or feel it won't change much?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549763","commentId":549763,"userName":"Bohemond2","timestamp":1320070714,"content":"You can still put me down in the \"I don't ever think a scoring system will work well for this game\" category."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549770","commentId":549770,"userName":"HilariousPete","timestamp":1320071511,"content":"I like the new scoring system. I did some calculations, if someone is pulling of the Beravor/Unexpected Courage/Galadrim's Greeting/Will of the West trick, if he's good, he can get 3 GG with 1 WotW back into his deck (and into his hand with enough UC on Beravor). This costs 3x3+1 = 10 resource points. With 3 heroes, he gets 3 resources per round. (5 if he has Steward of Gondor). So statistically he can pull of this trick every 3/10 = 0.3 rounds (or 0.5 rounds with Steward). Everytime, he gets 3x6 = 18 threat reduction. This makes 5.4 Threat per round (9 with Steward). Since each round now \"costs\" 10 scoring points, there's no point in stalling the game. The value of 10 has been chosen wisely, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549777","commentId":549777,"userName":"Svenn","timestamp":1320072035,"content":"I like it. I'm going to have to try and remember to track turns now, but otherwise I think it will do a pretty good job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549778","commentId":549778,"userName":"Bohemond2","timestamp":1320072118,"content":"10 is a huge number.  Not only does it prevent stalling, it effectively makes number of rounds the only meaningful statistic, with other numbers breaking ties, or perhaps giving you a +/- of 1 round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549790","commentId":549790,"userName":"Svenn","timestamp":1320073191,"content":"Bohemond said:\n\n10 is a huge number.  Not only does it prevent stalling, it effectively makes number of rounds the only meaningful statistic, with other numbers breaking ties, or perhaps giving you a +/- of 1 round.\n\n\n\nNumber of rounds really is one of the most important things I think.\n\nStill, threat varies from 0-50 per player. That's a pretty large difference right there... 1 dead hero is almost a full game turn's worth of points as well. Healing doesn't make much of a difference, maybe 1 turn worth at best, but then again it never really did make a huge difference.\n\nThe only thing that worries me is that Victory Points are not as valuable any more. Perhaps they'll errata those to be increased or at least make them worth more in future expansions.\n\nScores will be much higher than they were with the old system, but it will be like that across the board so that is pretty arbitrary.\n\nAlso, for comparison, let's take 2 made up games with the same number of turns and compare scores:\n\nGame 1: 3 players, threat values 34, 35, 36. No dead heroes. 5 damage tokens. 14 Victory Points. 7 turns. Score = 166\nGame 2: 3 players, threat values 45, 47, 48. 3 dead heroes (threat value 27). 4 damage tokens. 5 Victory Points. 7 turns. Score = 236\n\nI'd say that number of rounds is not the ONLY meaningful statistic here. That's a difference of 70 points (aka 7 rounds) in 2 (made up) games with the same number of rounds. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549795","commentId":549795,"userName":"Bohemond2","timestamp":1320074311,"content":"I would take issue with your example, but I think your post illustrates a very important point.  If you have a single player, number of turns is almost the only factor that matters (for instance, we see a drop from 7 rounds sperating the two teams, to 2.3 rounds sperating the first two players).  Other scoring factors become more important the more players you add to the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549800","commentId":549800,"userName":"Svenn","timestamp":1320074863,"content":"Bohemond said:\n\nI would take issue with your example, but I think your post illustrates a very important point.  If you have a single player, number of turns is almost the only factor that matters (for instance, we see a drop from 7 rounds sperating the two teams, to 2.3 rounds sperating the first two players).  Other scoring factors become more important the more players you add to the game.\n\n\n\nThis is a very good point. Number of rounds becomes more important the fewer players you have. You can still vary your score by up to 50 from threat, and a few extra points from healing. I bet this scoring system was set up specifically with 2 players in mind.\n\nA way of normalizing the score so that number of players is not a factor would be nice. In the other discussion threads I had suggested averaging out the players' scores in a multiplayer game and I still think that is one of the best ideas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549813","commentId":549813,"userName":"leptokurt","timestamp":1320076275,"content":"I like it better, though it's still not perfect. The new system certainly encourages risky moves and punishes more cautious players - which is apparently  how they intended it to be. IMO it also makes those heroes more useful that allow you to draw additional cards, as on average you're able to get the important cards earlier in the game. Heroes with a high threat level won't hurt you as much as they do now (scorewise).\n\n \n\nI would have prefered a system in which each round playes gives you more points to your result instead of adding the same amount of pijts in each round. For example, first round adds one point, second round adds two points etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549814","commentId":549814,"userName":"Doom1502","timestamp":1320076738,"content":"It kind of fixes Emyn Muil as you need more rounds to collect the VPs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549838","commentId":549838,"userName":"leptokurt","timestamp":1320080277,"content":"Just finished my first game with the new scoring system. Journey Down The Anduin with Eowyn, Dunhere and Bilbo.\n\nScore: 155 (14 rounds + 29 threat - 14 VP)\n\n \n\nChanges in gamestyle:\n\nI ended the game with one Gandalf still in my hand. I also decided to engage the troll earlier than usual, sacrificing Eomund and getting 3 threat, so that I could kill the (already Dunhere-injured)troll to enter the second stage of the scenario.\n\n \n\nFirst impression: Yup, it's more interesting to play like this! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549857","commentId":549857,"userName":"Bohemond2","timestamp":1320083452,"content":"Doom1502 said:\n\nIt kind of fixes Emyn Muil as you need more rounds to collect the VPs.\n\n\n\nI think it makes Emyn muil much worse.  The player has almost no control of how many rounds it takes to get 20+ VP of locations to hit the table. Scoring will depend almost entirely on the how lucky you are at pulling locations.  It represents the new scoring system at its worst."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549894","commentId":549894,"userName":"Beast Rabban","timestamp":1320087523,"content":"Bohemond said:\n\nYou can still put me down in the \"I don't ever think a scoring system will work well for this game\" category.\n\n\n\nI tend to agree. I find it hard to see how you will get a scoring system that can be used to run competitive organised play. I note they are testing the organised play system. I am interested to see how they try and put it all together.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549918","commentId":549918,"userName":"ppsantos","timestamp":1320090986,"content":"Why not keep it simple? Some have already said that the number of rounds seems to be a good indicator.  In that case, the score should simply  be the number of rounds taken to finish the quest.  No total threat, no damage, no victory points, etc. \n\nOr if that's too simple, how about score = number of rounds + total number of heroes that players started the game with.  Victory points are just tie-breakers. Dead heroes' threat cost are added as penalty to the score.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=549989","commentId":549989,"userName":"arcana10","timestamp":1320103702,"content":" My main complaint is the incompatibility with the old scores. I've logged a lot of plays here on the Quest Log, and now those scores either have to be deleted or have to be ignored in when comparing to other players' scores. In any case, it messes up the score statistics, even when just comparing your own scores from previous sessions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550032","commentId":550032,"userName":"Mighty Jim 83","timestamp":1320121360,"content":"arcana10 said:\n\n My main complaint is the incompatibility with the old scores. I've logged a lot of plays here on the Quest Log, and now those scores either have to be deleted or have to be ignored in when comparing to other players' scores. In any case, it messes up the score statistics, even when just comparing your own scores from previous sessions.\n\n\n\nDefinitely.\n\nIdeally, they need to follow this up with a quest log 2.0 that allows you to indicate which version of the scoring you're using, and includes some other improved features - such as the ability to log the heroes used by others in a multi-player game, or for one player to log for a group.\n\n \n\nMore generally though, whilst it's good to see them reacting to what people have said about the scoring system, it's still not a great fix - as people have said, it doesn't scale well at all, and it will encourage a very specific type of deck - Boromir was already looking moderately useful, and cool thematically. Suddenly he seems like an auto-include. In fact, it seems like they want us all to play at full-tilt, not pausing to assess the risk of the situation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550055","commentId":550055,"userName":"GhostWolf69","timestamp":1320125139,"content":"Any Scoring System is only relevant in relation to itself.\n\nSo comparing this with the old one makes little sense to me.\n\nDoes this make Healing less important?\n\nLess important than What, I have to ask?\n\nLess important than finishing the Quest Early and not get so many Rounds scored. Yes. But that is also true for everyone else playing the game using the same system. So comparing to other playing by the same rules, Healing is still healing.\n\nI like the idea behind this system. I like the idea that healing two or three wounds here or there can never compare to finishing the Quest when you have the chance. I like the idea that stalling to play another Gandalf och G.Greeting, will NOT pay off, but rather those cards should be used as a bonus along the road, rather than a goal in themselves.\n\nHow this new system plays out in reality is another story. But I'm cautiously possitive.\n\n/wolf\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550058","commentId":550058,"userName":"Feqz","timestamp":1320126658,"content":"I've mixed feelings about it; tending not to like it.\n\nWhile it's a big improvement to count each round with a score of 10 this just fixes endless games completly and forces you to rush (which is a good intention but I thought the one point threat per round should deal with - we've seen that this doesn't work). In the end it's no real improvement. The different spheres are not accounted for in the system.\n\nIn the end it might be irrepairable...  enfadado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/enfadado.gif]I'm coming closer to think of a completely new system and as threat is the field for spirit, rounds might/should be the first indicator of a good game. But just first thoughts... preocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550091","commentId":550091,"userName":"DrNate","timestamp":1320134062,"content":"Bohemond said:\n\nYou can still put me down in the \"I don't ever think a scoring system will work well for this game\" category.\n\n\n\nI might have scored the first game I ever played. Since then I have never scored a game I have played, win or lose. It feels pointless to me. I just like to treat the game as a pass/fail ordeal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550115","commentId":550115,"userName":"Eryx_UK","timestamp":1320136592,"content":"DrNate said:\n\nI might have scored the first game I ever played. Since then I have never scored a game I have played, win or lose. It feels pointless to me. I just like to treat the game as a pass/fail ordeal.\n\n\n\nThat's exactly the point to me. The scoring system is a bit of fun not something to be taken seriously. FFG should be focusing on other aspects of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550122","commentId":550122,"userName":"ClydeCloggie","timestamp":1320137397,"content":" I like the addition of valuing speed to the scoring system. Threat reduction and healing have their unique contribution to the system, and through the VP system questing and combat prowess are in it as well. \n\nAs a solo player, 10 points/round seems an awful lot, as the speed with which quests are finished is now by far the main contributor to the overall score. My fastest ever win was 3 turns on Passage through Mirkwood, so that's 30 points, meaning even a ridiculously fast victory gives you a score contribution roughly equal to threat, previously the main contributing factor to the score. In more normal games, I will be looking at a contribution of >100 points (Rhosgobel excepted) to the score.\n\nAnd what I really don't like: in the old system you didn't have to pay attention to the score as it could easily be calculated after the game from information available at that time. Now we'll need to keep track of the number of turns to enable us to calculate the score. Good thing I have a spare threat tracker and some D10s.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nBut this does give me the challenge of trying to set some good scores on all the quests with the new system."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550182","commentId":550182,"userName":"gatharion","timestamp":1320145686,"content":" Since healing and threat reduction are already useful tools towards victory, I like that they're now de-emphasized in scoring.\n\nHowever, I still don't think that I'll bother keeping score any time soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550210","commentId":550210,"userName":"Kiwina","timestamp":1320148649,"content":"It gives threat reduction a more equal weight with the other score affecting mechanics which is nice.  It's been mentioned before, but the new scoring system now favors a different kind of deck.  Instead of turtling it rewards rushing.  I'm the kind of player that likes to approach things cautiously.  I only stall if I feel like I will lose if I don't, but I'm also not the kind of player that discards a card to Eowyn every time she is questing.  I do like the change though.  It does add a little to the urgency to finish the game as quickly as possible.  I agree that rounds now have the strongest weight in scoring, and everything else acts as a tie-breaker.  I still want to see this system in an official setting before I make any solid decision about how much I like or dislike it though.\n\nThe biggest disappointment for me is the effect on the quest log.  The first thought that went through my head when I read there was a new scoring system was that I would now need to get onto my quest log and delete all my previous entries.  I like my scores to represent what I would score if playing at an official event, which now they don't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550283","commentId":550283,"userName":"ArcherAve","timestamp":1320156813,"content":"I'm not so sure if the new scoring balances the game or rather swings from favoring one strategy to another. Ideally the scoring should favor no strategy and let the player decide what they want to play.\n\n\nThe ten points make your score dependent on the order of the treachery deck. If you get more locations it will take you much longer to pass the quest phases that require questing. If you get more enemies in a quest phase with a battle condition it will add to your score. None of this has to do with how well you played, but the order of the treachery deck.\n\n\nThis may be what they want the game to be but it is not the game I wanted to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55582-sooooowhat-do-we-think-about-the-new-scoring-system/?do=findComment&comment=550298","commentId":550298,"userName":"Svenn","timestamp":1320158164,"content":"ArcherAve said:\n\nI'm not so sure if the new scoring balances the game or rather swings from favoring one strategy to another. Ideally the scoring should favor no strategy and let the player decide what they want to play.\n\n\nThe ten points make your score dependent on the order of the treachery deck. If you get more locations it will take you much longer to pass the quest phases that require questing. If you get more enemies in a quest phase with a battle condition it will add to your score. None of this has to do with how well you played, but the order of the treachery deck.\n\n\nThis may be what they want the game to be but it is not the game I wanted to play.\n\n\n\nIf you get more locations then it's possible to counter them with other cards (Ride to Ruin, Northern Tracker, Snowbourn Scout, etc). If you get more enemies then it's possible to counter them with more damage or other cards (forest snare).\n\nAll kinds of things can delay you. A well rounded deck that can handle any situation is going to give the best score. Isn't this how it should be? And of course your score is subject to some randomness. Random cards come from both your deck and the encounter deck every turn, that's just part of the game. You can never make up for this. If someone ends up with lots of treacheries with little effect and another player ends up with a ton of locations... well, that's just luck and is going to have an effect on any scoring system."}]}