{"url":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/","title":"Is Spirit a total no brainer?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550149","commentId":550149,"userName":"Shelfwear","timestamp":1320140280,"content":"I have the feeling that Spirit is on the way to become a no brainer-sphere: you'll always want to include it as a minor sphere if not major sphere in your deck. So far the distinction between the spheres seems as follows:\n\nLeadership: Ressource generation, hero manipulation (adding attributes and keywords), ally manipulation\n\nTactics: Direct damage, combat effects, damage manipulation\n\nLore: Healing, drawing cards/player deck manipulation, encounter deck manipulation, threat reduction in the staging area\n\nSpirit: Will Power/questing, countering treacheries and shadow effects, discard pile manipulation, threat manipulation, location control\n\nOn top of that Spirit has two of the most powerful cards in the game (Unexpected Courage and Northern Tracker), then it can ressurrect Heroes and allies (Hello Lore?!), it recently got the best card drawing card (Ancient Mathom which puts all similar Lore cards to shame), it will receive ressource generation in Khazad-Dum (Zigil Miner). That just leaves direct damage and healing the only things Spirit is not capable... yet (well, Dunhere can already do direct damage on that account)\n\nNot sure why Spirit gets so much love when everyone agrees that Tactics is the most unversatile sphere and nobody uses Leadership creatures except Snowborn Scout and Faramir. But I see an issue in game balance coming towards us..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550150","commentId":550150,"userName":"GhostWolf69","timestamp":1320140532,"content":"In our group we have sorted the Spheres into \"Action Spheres\" being Spirit and Tactics, and \"Support Spheres\" being Lore and Leadership.\n\nThe reasoning is that the game basically requires Killing Monsters and Exploring locations/Questing.\n\nBoth Lore and Leadership can kick some monsters and explore some as well... but it's not as good as Tactics or Spirit at either of them.\n\nThey DO however have some unique abilities that support the actions of Spirit and Tactics rather well.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550155","commentId":550155,"userName":"Svenn","timestamp":1320141412,"content":"Shelfwear said:\n\n\nthen it can ressurrect Heroes and allies (Hello Lore?!)\n\nWell, technically when a hero takes enough damage he is \"defeated\". He is not \"killed\". You aren't resurrecting anyone, but more healing their wounds to send them back into battle.\n\nI do agree that Spirit is very powerful right now. We don't quite know everything they have in store for the other spheres, but I hope they start giving other spheres some comparable cards.\n\nI don't see it as being a huge deal though. When you are playing with multiple players you end up with 2-4 spheres (usually closer to 4 I think) so you will be using most/all spheres anyway. There are still plenty of really good cards from other spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550158","commentId":550158,"userName":"Shelfwear","timestamp":1320141744,"content":"Sure, its not about winning or losing, for me its about the game experience.\n\nThe question is: Would you ever consider a solo or two-player game without any Spirit cards? Probably not. Would you consider the same for Lore, Leadership or Tactics? Probably yes (exception Rhosgobel/Lore).\n\nFor me, a game becomes stale and loses its challenge and game experience when game balance runs out of control regardless if its a cooperative or confrontative game (especially if its a deck building game)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550159","commentId":550159,"userName":"silverhand77","timestamp":1320141833,"content":"I wonder if in the future we might see new spheres on influence come into the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550171","commentId":550171,"userName":"ClydeCloggie","timestamp":1320144682,"content":"Shelfwear said:\n\nSure, its not about winning or losing, for me its about the game experience.\n\nThe question is: Would you ever consider a solo or two-player game without any Spirit cards? Probably not. Would you consider the same for Lore, Leadership or Tactics? Probably yes (exception Rhosgobel/Lore).\n\nFor me, a game becomes stale and loses its challenge and game experience when game balance runs out of control regardless if its a cooperative or confrontative game (especially if its a deck building game)\n\n\n\nI play almost exclusively solo, and regularly build decks without Spirit. Looking at my quest log entries, Spirit does have the heighest weight (33%), and Eowyn is the most used hero (17%, which if I interpret the stats correctly means i use her in just over half my logged quests), but this is by no means a \"Spirit and then the rest\" affair.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550216","commentId":550216,"userName":"Eryx_UK","timestamp":1320149255,"content":"90% of my decks are Spirit as I don't believe you can adequately play solo without it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550236","commentId":550236,"userName":"gatharion","timestamp":1320151663,"content":" Yeah, I generally haven't had much luck in my solo games, but what success I've had has been primarily because of Spirit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55620-is-spirit-a-total-no-brainer/?do=findComment&comment=550241","commentId":550241,"userName":"Dam the Man","timestamp":1320152053,"content":"Shelfwear said:\n\nThe question is: Would you ever consider a solo or two-player game without any Spirit cards? Probably not. Would you consider the same for Lore, Leadership or Tactics? Probably yes (exception Rhosgobel/Lore).\n\n\n\nMy four decks are (first sphere has 2 heroes, second one 1) Lore/Leadership, Leadership/Tactics, Tactics/Spirit and Spirit/Lore. So no question I play without Spirit cards. I consider Lore/Leadership (Denethor, Glorfindel, Gloin) to be the best deck out of those four (split the 12 Core Set heroes around, so each deck can be paired with any other deck and no duplicate heroes). Spirit/Lore (Dunhere, Eleanor, Beravor) is probably the weakest of the bunch, it can't really anything well on its own, can't quest, can't defend, can't fight. It's a very good support deck, pumping out a ton of cards with Beravor and providing threat reduction, but if ever called to fight, it can grind to a halt like no other. I've beaten Anduin, Gollum, Carrock and as of today Rhosgobel (and Mirkwood, but that really does without saying) all with pairings that didn't feature Spirit. For some reason did better vs Gollum when I didn't get Northern Trackers out sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif] ."}]}