{"url":"https://community.fantasyflightgames.com/topic/55686-noob-questions/","title":"Noob Questions :)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55686-noob-questions/?do=findComment&comment=550736","commentId":550736,"userName":"soldric","timestamp":1320236818,"content":" Hi all,\n\nI played 2 games with a friend, we used starter decks, what kind of advice or example i should use to build my own deck ?\n\nI like a lot Aragon deck \n\nSoldric"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55686-noob-questions/?do=findComment&comment=550746","commentId":550746,"userName":"Mighty Jim 83","timestamp":1320237717,"content":" Do you just have the Core set?\n\nRemember that any card you put in the deck is only useful if you can find a way to pay for it. In the core set, the only way to give a hero a second sphere to spend their resources in, is by putting Celebrian's stone on Aragorn, and if you're building full-size decks, that's only 1 card in 50. Multiple Core Sets, or the adventure packs with the various songs in, can all make this a lot easier (and more expensive of course)\n\n2 spheres is probably the best way to do a custom build. If you're using leadership, then Theodred can be useful for giving an extra resource to the sphere with only 1 hero. Otherwise, 1 sphere will have half the resources of the other. Bear this in mind when picking cards. If you only have one spirit card, that Northern Tracker will take 4 turns to save up for. Every time you cancel an effect with an event card, that gets put back another turn. Because of this, you need to balance the number and the cost of the cards you have for each sphere with the heroes you're using and the cost of them.\n\nIf you have multiple core sets, and/or lots of adventure packs, don't make the mistake of just throwing in everything you have.  The more cards you have, the less likely it is that the one you want/need will come up.\n\nAbove all, experiment, try it, then change it - so long as you're still having fun, it doesn't matter if you don't build the perfect deck first time (and unless you've a lot of experience deck-building in similar games, it's pretty certain that you won't.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55686-noob-questions/?do=findComment&comment=550757","commentId":550757,"userName":"TheRomance","timestamp":1320239715,"content":" Also, if you want to see some decks that some sample decks that people have constructed, check out http://www.cardgamedb.com/ [http://www.cardgamedb.com/].  It will give you a taste of what other people are doing and might help get your own ideas going."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55686-noob-questions/?do=findComment&comment=550809","commentId":550809,"userName":"soldric","timestamp":1320245136,"content":" Thanks guys\n\n \n\ni will get the expansion packs soon and add the one to get more resources in it"}]}