{"url":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/","title":"Thalin vs Brand","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/?do=findComment&comment=550818","commentId":550818,"userName":"Dam the Man","timestamp":1320246586,"content":"Talk to me people. I've been using four decks with each of the 12 Core Set heroes featured once across the decks since I got around to building the decks. Thus Thalin has been one of the heroes, having no better option at the time. Deck with Thalin is Tactics/Spirit, along with Eowyn and Gimli, usually the first two quest, Gimli takes hits and kills stuff. Having Thalin in that deck also provides the perfect patsy for Sacked!, Caught in a Web and such, he is very much the least useful of the bunch. Added Emyn Muil today, so now I have Brand. Since I'm currently working through Rhosgobel, Brand's Ranged would help probably no small amount, but I'm still worried about his durability. Fricking 3HP!!! Then again, Emyn Muil is next on the agenda and it features Eastern Crows again, so Thalin would probably get swapped in right away, he was a life-saver in HFG against those Crows in at least two games. I did beat Rhosgobel today with one half being the above deck, Horseback Archers took care of most of the killing. Starting Threat 29 vs 30 doesn't really matter in anything but Anduin.\n\nWhat say you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/?do=findComment&comment=550830","commentId":550830,"userName":"gatharion","timestamp":1320249060,"content":" I would generally stick with Thalin for solo play, but switch to Brand for multi-player games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/?do=findComment&comment=550838","commentId":550838,"userName":"Glaurung","timestamp":1320250094,"content":"In coop game Brand is amazing. Even in solo he is good too. \n\nDam you try 1 game with him and you will understand your self. After 1 game i switch Thalin for Him witout any doubts. Brand much better in my Opinion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/?do=findComment&comment=550866","commentId":550866,"userName":"gmerwin2","timestamp":1320254869,"content":"We used Brand in two 3 player games last night and he was awesome.  Allowing a loaded Gimili to attack twice using Brand's ability, brutal!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/?do=findComment&comment=551005","commentId":551005,"userName":"Dam the Man","timestamp":1320284124,"content":"Greg M said:\n\nWe used Brand in two 3 player games last night and he was awesome.  Allowing a loaded Gimili to attack twice using Brand's ability, brutal!\n\n\n\nWell, Gimli would be in the same deck as Brand, so couldn't use that combo myself.\n\nSimilarly, Glaurung, since this Tactics/Spirit is generally the one engaging Enemies and it can handle them, not sure how much Brand would get used. Both Rhosgobel and Emyn Muil are looking fairly thin as far as Enemies in the Encounter deck go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/?do=findComment&comment=551010","commentId":551010,"userName":"Glaurung","timestamp":1320286152,"content":"Dam said:\n\nGreg M said:\n\n \n\nWe used Brand in two 3 player games last night and he was awesome.  Allowing a loaded Gimili to attack twice using Brand's ability, brutal!\n\n \n\n \n\nWell, Gimli would be in the same deck as Brand, so couldn't use that combo myself.\n\nSimilarly, Glaurung, since this Tactics/Spirit is generally the one engaging Enemies and it can handle them, not sure how much Brand would get used. Both Rhosgobel and Emyn Muil are looking fairly thin as far as Enemies in the Encounter deck go.\n\n\n\nIn our game i use Brand this way: Allow to engage another player lore/Spirit 1 enemy and then attack with Brand to kill him and Beravur draw 4 cards instead 2.\n\nBut in beginning Massing in Osgiliath Brand helps a lot cose there is so many enemies engage both players i  the first round and Brand really help for 1 more attack or defense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55695-thalin-vs-brand/?do=findComment&comment=551257","commentId":551257,"userName":"Dam the Man","timestamp":1320323163,"content":"I've decided to keep Thalin for now, not a fan of altering decks between rotations, three more plays of Rhosgobel before I even add player cards from Emyn Muil to my decks. Honestly, Brand wouldn't have made a difference today, played a great start, first stage completed on the first turn, starting hand for Lore/Leadership had both Lore of Imladris and Steward of Gondor, but on turn three just got locations and couldn't get through stage two with Wilyador on 1 wound and Glorfindel ready to heal him. After that, didn't really have a shot as both Athelas that I saw got tossed as Shadow cards (as did Forest Groves) and eventually accidentally quested too much, 2 WP enough to complete the stage two. Not that it made a difference even in hindsight, would've needed at least three total of Lore/Athelas and that would've required a recycle the Encounter deck and threat would've killed me long before that I think. Sucks when you are playing great but there is nothing you can actually do when the cards just don't come up. Wilyador was enough to take out most winged Enemies, thanks to Thalin wounding them when questing, didn't have a single Ranged character in the game. Readying with Brand would've have really helped anything since only Denethor had exhaust ability that was constantly used and he was ready most of the time at the end of the turn anyway."}]}