{"url":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/","title":"Ambush Mechanic","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=551605","commentId":551605,"userName":"Svenn","timestamp":1320392525,"content":"Is this really so bad? It takes away your control of choosing who will engage an enemy but at the same time it removes that enemy from the staging area during questing, meaning you get to skip dealing with their threat level. The enemy would have engaged that turn anyway.\n\nI'm hoping they have some cards with specific Forced effects after an Ambush is successful, such as bonus attack power until the end of the round or something. That would be pretty cool.\n\nI'll have to wait and see how it all plays out to say for sure just how devastating it can be though. What does everyone think about Ambush?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=551614","commentId":551614,"userName":"LEGA","timestamp":1320393637,"content":"I think it is really bad. There just must be some effect that prevents it. Or there will be very easy quests and enemies).\n\nOr only 3 Thalins simultaneously can help us against that orc on the card)))"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=551616","commentId":551616,"userName":"LEGA","timestamp":1320393893,"content":"If seriously, I don't think it is bad idea. As I like Tactics set most of all it is rather positive effect for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=551628","commentId":551628,"userName":"HilariousPete","timestamp":1320394905,"content":"It depends strongly on the number of players and how evil FFG makes accompanying effects for the Ambush keyword.\n\nFor solo play, the Ambush keyword itself doesn't change a lot, even makes the game a bit easier (moving the enemy out of the staging area, so no threat by him, like you said). In a 4 player game, with the accompanying effect of the Orc Raider, if you got to discard e.g. 4 of your attachments because of 2 ambushing Raiders, AND have to face 2 enemy attacks, that could be devastating (Steward, Unexpected Courage, Burning Brand, all the Songs gone... perhaps a previously Forest-Snared enemy now attacking again?)\n\nAnd we don't know how many ambushing cards are in the AP and how they interact. Image e.g. this effect on an ambushing enemy: \"When Revealed: Search the encounter deck for the next X cards with the Ambush keyword. Reveal and place them in the staging area. Shuffle the Encounter deck. X is the number of players.\" This would fit the concept of an ambush. It could be quite devastating in a solo game. And a killer in a 4 player game, if the ambushing enemies are not too weak. So we'll have to wait and see... I guess FFG has had to put a lot of effort in balancing the encounter deck, so that it's hard, but not unbeatable.\n\nIn all cases, it makes the quest phase more interesting in multiplayer games, because players lose the option to willingly engage an enemy to protect weaker players from it. I guess this is a good thing, especially when I consider the scaling of Journey Down the Anduin and Escape from Dol Guldur, which are way more difficult in solo game than in a multiplayer game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=551716","commentId":551716,"userName":"OnkelZorni","timestamp":1320404964,"content":"There is a special rule, that \"Ambush\" only triggers if one of the players is Glaurung demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\nGetting serious, I like this mechanic and can't wait to play this scenario, sounds quite challenging...won't be good for my win/loose balance anyway"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=551721","commentId":551721,"userName":"Glaurung","timestamp":1320405794,"content":"OnkelZorni said:\n\nThere is a special rule, that \"Ambush\" only triggers if one of the players is Glaurung demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\nGetting serious, I like this mechanic and can't wait to play this scenario, sounds quite challenging...won't be good for my win/loose balance anyway\n\n\n\nLook like people remember my words a??? Good joke thanks.\n\nAbout ambush: i think is really good. Specially i love the force effect of those orcs. They look really powerful and i like it!!!\n\nDiscard Attachment that the game need. Other wise players deck start to be too powerful with all those attachments form Adv. packs.\n\nI also like the idea to make some cool attachment for specific charachters as Hobbit, Silvan. So if you want to use this you must start to build tematic Silvan or Gondor or Hobit deck.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=551748","commentId":551748,"userName":"TheRomance","timestamp":1320408997,"content":" Agreed regarding the need for encounter decks to force players to discard attachments.  I felt as if they were too strong of an investment, since up until now there haven't been many ways to punish someone for playing a ton of powerful attachments( UCs, BBs, etc.).  Allies come and go, but attachments seemed a little more capable of weathering the storms."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=552090","commentId":552090,"userName":"lleimmoen","timestamp":1320474122,"content":"I share the sentiment. It makes the game versatile when you can lose different stuff in different quests.\n\nI even liked Caradhras, it makes Favour of the Lady more potent as opposed a 2 cost ally with 1 willpower (which many players would have generally considered a safer bet into a deck, I feel). Because that ally would quest for nothing against Caradhras whilst the Favour will negate the negative effect on the hero. This may seem off topic but I just continue about the versatility of the encounters, and I like where the game is taking us."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=552385","commentId":552385,"userName":"silverhand77","timestamp":1320532891,"content":"Does anyone know of a card that cancels forced effects? or do you think one will come out in the future?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55780-ambush-mechanic/?do=findComment&comment=553021","commentId":553021,"userName":"Narsil0420","timestamp":1320665745,"content":"There isn't one yet Silverhand\n\nThe important factor with Ambush is that it makes an engagement check before anyone has a chance to optionally engage it, thereby removing the players ability to decide where it goes. Also if it has a \"when engaged\" effect that could have some effect on you. I'm thinking of something like: \"after this enemy engages a player, the players as a group may not travel to a location for the remainder of the round.\"\n "}]}