{"url":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/","title":"Me and my girlfriend beat dead marshes first try!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=551910","commentId":551910,"userName":"DurinIII","timestamp":1320429916,"content":" Yay win! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] We had a good time playing this one, though we got extremely fortunate to make very few escape tests. In fact, Gollum never accumulated a single resource token. How is the quest coming along for you guys?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=551911","commentId":551911,"userName":"TheRomance","timestamp":1320429961,"content":" It is coming along quite well... in the mail."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=551938","commentId":551938,"userName":"Bullroarer Took","timestamp":1320433354,"content":"In my first game with Marshes I played using my stock Three Hunters deck, no new cards and no tweaking.  Kicked it's xxx.  In fact it was disturbingly easy, but may be I got lucky.  The same thing happened the first time I played HfG too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=552033","commentId":552033,"userName":"player582283","timestamp":1320456483,"content":"Picked it up tonight and we won our first game - 2 player.  Gollum had 4 resources on him for the final escape attempt, but we corralled him easily.\n\nFun scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=552236","commentId":552236,"userName":"xBeakeRx","timestamp":1320502968,"content":"I beat it first try with a final score of 93.  Took me 6 turns to finish it and final threat of 33.  Gollum had 5 resource tokens on him at the end, but I was fortunate that he got \"0\" escape in his escape test...then again, I had about 12 willpower commited to the test counting Gandalf so I think I would have captured him even if he got a few escape cards.  Although I beat it first try, this quest definitely provides some difficult challenges.  I can see the game turning for the worst quickly if the encounter deck pulls some of their key cards at the right time.  On that note, I had 5 resource tokens on him after the second round.  One failed escape test and the first two turns they pulled 2 Impassable Bogs in the staging area.  I was pretty worried after that second Bog, but luckily I was able to get some good allies in play and cruised from rounds 3-6.\n\nThis quest is a lot of fun, and goes to show that a \"low enemy\" encounter deck can still be fun and challenging if it's done the right way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=552264","commentId":552264,"userName":"Young Ranger","timestamp":1320508359,"content":" My meta beat it last night. We had a ton of bad luck though. We got several of the events that adds resources on Gollum in the beginning. Thanks to those we lost him and had to try digging for him in the encounter deck. Then he came up as a shadow card so we had to go through the encounter deck again. Our saving graces were getting the Impassable Bogs after we lost Gollum. Then we had a big buffer to hold us off on part 2 of the quest, allowing us to search for Gollum. Denethor, Eleanor, and Brand were the MVPs of the quest. Denethor to look ahead for Gollum and if it wasn't him, the card went to the bottom. Eleanor for allowing us to cancel events and get another encounter card, hoping it was Gollum. Brand for being able to stand Denethor to use him again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=552970","commentId":552970,"userName":"gatharion","timestamp":1320659077,"content":" I finally played it last night. (Solo)\n\nI beat it really easily, but that was with a Rohhirm deck. Rohhirm just destroy location-heavy quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=553232","commentId":553232,"userName":"DurinIII","timestamp":1320696526,"content":"Indeed they do Gatherion! That is their strength, which fluff-wise really does them justice. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55815-me-and-my-girlfriend-beat-dead-marshes-first-try/?do=findComment&comment=553286","commentId":553286,"userName":"gatharion","timestamp":1320711475,"content":" I played twice more today with an elf-centric Lore/Tactics deck. I lost the first game, but won the second time."}]}