{"url":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/","title":"First cycle tendencies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=552979","commentId":552979,"userName":"Titan","timestamp":1320660435,"content":"Does anyone else think that this first cycle is very heavily geared towards the questing mechanic? You have two of six scenarios(HFG and Emyn Muil) which are very quest heavy. No other scenarios so far are so geared towards a single mechanic. You have the advancing of the questing type of deck (mostly Spirit) which has become the preeminent deck early on. Even with Dead Marshes, willpower continues to be a major need. I wonder if with the next cycle questing will continue to be as dominating or if we will see the same type of advances for other areas like combat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553033","commentId":553033,"userName":"lleimmoen","timestamp":1320666818,"content":"That Caradhras location would suggest it may continue. But that is very feeble theory. However, I feel Willpower shall remain an important factor throughout. Even in the more fighting quests like Carrock, it is quite important to quest well (at least the round after the trolls appear so you would not have to fight them all at once), it also helps tremendously in Rhosgobel, to not linger too long.\n\nRhosgobel is not my favourite quest perhaps but I like how it differes substantionaly from the rest. I hope to see more of such variety in the future scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553042","commentId":553042,"userName":"Titan","timestamp":1320668536,"content":"You may be right. In thinking about it a bit more, the nature of the game makes it difficult to lessen the quest mechanic, while you don't always have to fight. I guess that's in keeping with the flavor of it, exploration and adventure, but not fighting and killing all the time.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553062","commentId":553062,"userName":"guciomir","timestamp":1320670538,"content":"Ambush mechanic will fit fighting decks better as they won't have to quest as much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553446","commentId":553446,"userName":"ClydeCloggie","timestamp":1320746978,"content":" Questing will have to play a central role.\n\nSuppose you had a combat-heavy scenario with little questing progress needed, a fast questing deck would actually be the best way to deal with it. Just quest well for a few turns and you pass the finish line before the combat nasties have a chance to come out of the encounter deck.\n\nThe currently available heavy combat scenarios either erect a combat barrier right at the start (Anduin, Osgiliath) or punish you for questing fast (Carrock). There are only so many ways of pulling this trick off, so I'm guessing future combat scenarios may actually require quite a lot of questing progress to allow the encounter deck to bring out its enemies at random times.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553463","commentId":553463,"userName":"guciomir","timestamp":1320749274,"content":"Or just invest some tricky mechanic, like \"you can't put progress tokens during quest phase, but when you kill enemy put a progress token\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553476","commentId":553476,"userName":"Dam the Man","timestamp":1320750839,"content":"guciomir said:\n\nOr just invest some tricky mechanic, like \"you can't put progress tokens during quest phase, but when you kill enemy put a progress token\".\n\n\n\nYep, maybe put progress in some relation to the hitpoints (for example) of the Enemy you killed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553490","commentId":553490,"userName":"Dwnhmcntryboy","timestamp":1320752268,"content":" I think the next cycle will have cards (Tactics) that give you more quest value but at a cost, like not readying the next ready step or taking additional wounds or raising your threat or sacrificing an ally. Just some thoughts I would be ok with in a tactics deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553736","commentId":553736,"userName":"player582283","timestamp":1320787728,"content":"I think questing will continue to be a central theme in the game.  I expect to continue to see things that will change within the mechanism.  A tactics card that substitutes attack strength for will is one that I bet we'll see at some point as an example"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553770","commentId":553770,"userName":"guciomir","timestamp":1320797866,"content":"Spirit, which is a questing sphere has quite a few allies who have 2 attack and cost 4. It would make sense if Tactics got a counterpart like 2 quest and 4 cost (+a nice ability)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55945-first-cycle-tendencies/?do=findComment&comment=553943","commentId":553943,"userName":"Yenninho","timestamp":1320832396,"content":"If FFG stays to the books, we see combat heavy quests in Khazad-dûm... Like when you explored a certain location, a group of goblins jumps out a gap in the wall and engages you immedeately "}]}