{"url":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/","title":"Deckbuilding Help","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553054","commentId":553054,"userName":"Shingen2","timestamp":1320669735,"content":"Hello All:\n\nI am an experienced card gamer, but still new to the LotR LCG. I am playing solo, and i needed some input on general deckbuilding proportions and strategies.\n\nFrom what I gather, it is typical to use 3 heroes, with 2 coming from one sphere and a third from a second. I need to know, roughly, how many cards people typically include from each sphere, and of each type (actions, attachments, etc). I couldn't figure out if the 3 heroes count towards the 50 card minimum, but input is welcome. Also, statistical considerations for hero selection would be helpful; ie, how much adventuring power and combat power should they carry, wound levels, etc. \n\nAny general ideas or strategies useful for deckbuilding would be a great help to me. I don't mind spending a lot of time testing and tweaking, but I want to start from a good base. \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553058","commentId":553058,"userName":"TheRomance","timestamp":1320670205,"content":"Heroes do not count toward your minimum 50 cards.  Lots of experienced players here will be able to articulate the answers to some of your other questions, but since I am not one of them I shall instead direct you to a nice resource: \n\njavascript:void(0);/*1320691640563*/ [http://www.cardgamedb.com/]\n\n \n\nYou can see some submitted player decks there (and a tool for managing your own), as well as a statistical breakdown of each deck (both in terms of sphere of influence, as well as by event/ally/attachment).  Good luck!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553253","commentId":553253,"userName":"stahlwolle","timestamp":1320701513,"content":"I use heroes from three different spheres in most of my decks. My favorite choice: Eowyn(strong willpower), Beravor(allrounder) and Legolas(good fighting and useful ability). More allies than events and attachments. Expensive cards only if they justify the benefit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553267","commentId":553267,"userName":"booored","timestamp":1320706065,"content":"There are really no rules like this for you to follow in deck building. Just make a 50 card deck, then include your Heroes. Unlike say magic (from what you said I think your coming from there) There is nothing like \"use 17% of your deck for land in limited\" or w/e... Just make a deck that functions properly... the deck building is a large part of what makes this game fun (for me)\n\nFor solo players the 3 Heroes from 3 Spheres thing is getting less and less needed as you can now easily splash a sphere with songs. Still most solo decks that are no tailored to a single quest seam to still use 3 spheres.. but as I said, you can splash them now with songs so no need to really force 3 different heroes anymore.\n\nAs a general rule, in my experience Tactics is the weakest for solo. Spirit threat reduction is extremely powerful, Lore card draw is likewise crazy.. so a good solo deck will usually always have 2 or 1 and a splash. Leadership can be strong but many people are splashing now just for a few tricks and the steward of Gondor attachment.\n\nYour best place for decks are not these forums.. but www.cardgamedb.com [http://www.cardgamedb.com] So head over there and just try out a few decks.. this will give you the xp needed to start making your own.. and imo, that is where the fun really begins."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553472","commentId":553472,"userName":"Eryx_UK","timestamp":1320750382,"content":"Personally I prefer a single sphere deck for playing. Costs can become too prohibitive when playing two or three spheres, at least in my experience. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553510","commentId":553510,"userName":"Dwnhmcntryboy","timestamp":1320754148,"content":" I usually try to go 30 allies and 20 other. Allies are so important for saving you bacon both questing and combat. I try to avoid allies that have proactive abilities, draw/heal, because they sit there and that is their only function. They don't help out with anything else unless you are in a real pickle and then they aren't doing what you want them to. Plus actions are usually better. I am a fan of the one off allies that come into plat do what they are supposed to do and then do what you need them to do. To each their own though. There is no prescribed way to do things other than solo NEEDS Eowyn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553546","commentId":553546,"userName":"Kingbee","timestamp":1320757378,"content":"I agree completely about the need for Eowyn.  Shes the best at what she does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553687","commentId":553687,"userName":"Shingen2","timestamp":1320777897,"content":" Thanks for the input!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553733","commentId":553733,"userName":"Dwnhmcntryboy","timestamp":1320787080,"content":" I am working on a solo 2 1/2 sphere deck using Prince Imrahil, Aragorn, and Boramir Splashing Spirit for  Ancient Mathom, Unexpected Courage, The Favor of the Lady and Greeting with Song of Travel. I Just started this evening and am playtesting it through Mirkwood Cycle. HfG has been vetted. On to the next one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/55951-deckbuilding-help/?do=findComment&comment=553922","commentId":553922,"userName":"ClydeCloggie","timestamp":1320830410,"content":" In my experience, you can either go for a 2-sphere or 3-sphere deck, the latter of which can conceivably become 4-sphere even.\n\nFor 2 sphere, Spirit and Lore are good choices for the major sphere (i.e., 2 heroes) as they provide good willpower and additional effects for questing. Lore also has good combat cards, although they tend to be expensive (Forest Snare, Haldir, Gildor). Leadership and Tactics are better as the minor sphere (i.e., 1 hero), for me, as Tactics is excellent at combat but at not much else (teams up well with Spirit), and leadership is good at spreading the wealth through cards like Steward of Gondor, but simply hasn't got enough decent allies to carry a deck by itself. a typical breakdown for such a deck would be 28-30 cards in the major sphere, 15-17 cards in the minor sphere, and 3-6 neutral cards (3 Gandalfs and up to 3 Songs so all 3 heroes can cover both of the deck's spheres). Quite often, I choose 2 from Lore/Spirit/Tactics and splash Leadership into the deck through Song of Kings, just for Steward of Gondor and Sneak Attack. this changes the make-up of the deck somewhat, as it will increase the number of neutral and 'off-sphere' cards in the deck at the expense of minor and major sphere cards.\n\nAs a solo player, I tend to favour 3-sphere decks, since one deck has to cover all aspects of the game. Quite often the fourth sphere is splashed through its Song for one or two crucial cards (e.g., I beat Conflict at the Carrock solo with a Lore/Leadership/Tactics deck which had Song of Travel in it purely to allow me to play The Galadhrim's Greetings). Normally it would be Leadership to miss out, as the other 3 spheres cover all aspects of the game to an extent. A Song of Kings for Steward of Gondor is heartily advised in such a case,  in effect making the deck 4-sphere. In such cases I use a 13-13-13-11 split, so 13 cards for each of the 3 spheres, plus 11 neutral and 4th sphere cards. it is important to include mostly low value cards in the deck, as you won't get much chance to play big stuff; you will only generate 1 resource per sphere each turn, after all. \n\n \n\n "}]}