{"url":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/","title":"A Walk in the Marsh - A Dead Marshes Quest Summary","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554236","commentId":554236,"userName":"Bohemond2","timestamp":1320871371,"content":"I decided to test my Red Arrow deck (Rohan riding to the assist of Gondo) against dead marshes. It’s not my best deck, but I just gave it an overhaul and wanted to see how it hangs against the new scenario. Work has been killing me, so its my first chance to venture into the Dead Marshes\n\nHeroes: Eowyn, Theodred, Prince Imrahil Threat: 28\nNot much in the way of hero choice. The deck discards a ton of allies to power the Prince. It has a lot of Spirit cards, so Theodred is a must for resource acceleration. Eowyn rounds out the curve as a spirit hero, a Rohan character, and an amazing quester.\n\n\nInitial Draw: Escort From Edoras, Dunedain Watcher, Ride to Ruin, Snowborn Scout, Grim Resolve, The Riddermark’s Finest.\nI love this initial draw. The scouts and ride to ruin let me remove almost any location. I have a lot of flexibility with turn two allies, and Grim Resolve gives me a powerful end game card. No doubt about keeping this hand.\n\n\nSetup: Gollum & The Heart of the Marshes\n\n\nTurn 1\nResources: Eowyn [1], Theodred [1], Prince Imrahil [1]\nDraw: West Fold Horse-Breaker\nPlay: Snowborn Scouts [One Progress on The Heart of the Marshes]\nStaging: Gollum & The Heart of the Marshes\nQuest: Eowyn, Theodred, Prince Imrhail [Resource to Eowyn]\nEncounter: Giant Marsh Worm\nPlay Ride to Ruin on Snobowrn Scouts, Clear The Heart of the Marshes, Untap Prince Imrhail\n6 Progress\nEscape: The Brown Lands\nTravel: -\nThreat: 29\n\nSnowborn scouts allows me to clear the potential treacherous Marsh without travelling to it, and also lets me quest with everyone, but untap the Prince for Escape Checks or combat. He doesn’t end up being needed, but I am off to a flying start in the quest. Killing those worms might be a trick, but at 36 engagement rating and a single threat, I reasonably confident I can ride circles around them and never have to fight.\n\nTurn 2\nResources: Eowyn [2], Theodred [2], Prince Imrhail [1]\nDraw: Valiant Sacrifice\nPlay: Escort From Edoras, Dunedain Watcher\nStaging: Gollum & Giant Marsh Worm\nQuest: Eowyn, Theodred, Prince Imrahil, Escort from Edoras, Dunedain Watcher [Resource to Theodred]\nEncounter: Wolf Rides, surge brings The Heart of the Marshes\n7 Progress, Completing Stage 1A,\nDiscard Escort, play Valiant Sacrifice [Grim Resolve and Escort From Edoras] Untap Prince Imrahil.\nTravel: -\nEscape: Treacherous Fog\nEngagement: Engage Wolf Riders\nCombat, Wolf Riders Attack, no defender, Shadow card is The Light of the Dead\nPrince Imrahil Kills Wolf Riders\nThreat: 30\n\n\nTurn two lets me drop powerful allies as planned. I can potentially clear the second stage this turn, so I go for my big hitter, the escort, rather than the more permanent Riddermark’s Finest. Valiant Sacrifice makes this another easy choice. The Watcher is just gravy, and gives some backup in case of an ugly shadow draw. Again, the escort allows me to quest at full bore, and leave the Prince back for defense. I get a location, but have so much questing power I don’t travel. I don’t want to make those escape checks any harder. Still, no need to make an escape check, and the prince easily puts down those pesky wolves.\n\n\nTurn 3\nResources: Eowyn [1], Theodred [1], Prince Imrhail [1]\nDraw: Snowborn Scouts\nPlay: -\nStaging: Gollum, Giant Marsh Worm & The Heart of the Marshes\nQuest: Eowyn, Theodred, [Resource to Theodred]\nEncounter: Despair\n1 Progress\nTravel: -\nEscape: Pursed by Shadow\nThreat: 31\nGollum is in sight, and I can almost get him. I opt to play conservatively, setting up a capture attempt for next turn. I figure I cn bail cards to Eowyn if I absolutely need to stop threat. In the end, I don’t need it. Despair is a very fortunate draw. Everything is nicely set up to spring my trap\n\n\nTurn 4\nResources: Eowyn [2], Theodred [3], Prince Imrhail [2]\nDraw: Faramir\nPlay: Escort From Edoras\nStaging: Gollum, Giant Marsh Worm & The Heart of the Marshes\nQuest: Eowyn, Theodred, Prince Imrahil, Escort from Edoras, Dunedain Watcher [Resource to Eowyn]\nPlay Grim Resolve to Untap Everyon\nEncounter: Impassable Bog, 2 counters on Gollum (should this have been 1?)\n7 Progress, completing Stage 2\nEscape: Treacherous Fog\nCapture Check, Wargs & a Wisp of Pale Sheen [4 escape total]\nTap Everyone to capture Gollum\n\n\nPart of me wants to Play Faramir, just so I can have him capture Gollum. I toss my love the books aside, and follow the plan. Another escort boosts my quest power, ensuring I can complete the stage with willpower to spare. The Grim Resolve of Prince Imrhail of his followers means Gollum has no chance to escape. I actually get an unfortunate draw, dropping progress tokens on Gollum [question: I put two tokens on him. Was that right, or should it have been 1?] , but it doesn’t matter. The fiend is ours.\n\n \n\nWait, it’s over already? I have to say, the quest seemed remarkably easy. Maybe I just had solid draws, but it was a walk in the park. A marshy park, but a park none the less. I will have to run it a few more times against other decks before I pass judgment.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554242","commentId":554242,"userName":"Bohemond2","timestamp":1320872567,"content":"BAH!  I screwed up the rules on capture  checks.  You lose on ties. Fortunately, the only effect it would have had on the game is adding two more progress tokens to gollum on turn two.  I drew two additional escape cards, and it (thankfully) didn't effect the final outcome of the game.\n\nI also ran it back a second time and got roughly the same result, another turn 4 win.  Maybe I should try a different deck..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554255","commentId":554255,"userName":"marlow4","timestamp":1320875095,"content":"My first stab at Marshes was with a Rohan oriented deck as well. Pretty much exactly what I used against Emyn Muil.\n\nI kinda like the Escape mechanic.\n\nI'm going to try Marshes with 4 mono decks. I'm sure Mono Tactics won't go as smoothly as Leadership/Spirit Rohan does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554279","commentId":554279,"userName":"Runner5","timestamp":1320881373,"content":" Yup It was pretty easy with a spirit/leadership deck but I agree I like the escape tests.  Overall I thought it was a fun quest, a good short one which is good cause I didn't have much time to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554355","commentId":554355,"userName":"Lenbo","timestamp":1320897109,"content":"Bohemond said:\n\nWait, it’s over already? I have to say, the quest seemed remarkably easy. Maybe I just had solid draws, but it was a walk in the park. A marshy park, but a park none the less. I will have to run it a few more times against other decks before I pass judgment.\n\n\n\nYou're not alone, this quest is easy. Let's just say Eowyn + Unexpected Courage + Celebrian's Stone = Gollum captured."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554364","commentId":554364,"userName":"guciomir","timestamp":1320900802,"content":"Guys, you try this adventure using the deck that by definition is designed to kill it.\n\nI really hope that Khazad is released soon, so those quest oriented decks will get punished by combat heavy scenarios. (and at the same time, Khazad combat decks will get punished by Mirkwood quest - heavy scenarios). I really wonder if finding right balance will be easy or not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554371","commentId":554371,"userName":"lleimmoen","timestamp":1320903355,"content":"Marlow said:\n\n \n\nMy first stab at Marshes was with a Rohan oriented deck as well. Pretty much exactly what I used against Emyn Muil.\n\nI kinda like the Escape mechanic.\n\nI'm going to try Marshes with 4 mono decks. I'm sure Mono Tactics won't go as smoothly as Leadership/Spirit Rohan does.\n\n \n\n \n\nMono Tactics will go nowhere, I feel. But I don't mind being proven wrong sometimes.\n\nThe quest is real fun, I say. I just wished there was an escape that took defense instead of will (as Through the Mist does with attack)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554402","commentId":554402,"userName":"Bohemond2","timestamp":1320912681,"content":"guciomir said:\n\nGuys, you try this adventure using the deck that by definition is designed to kill it.\n\nI really hope that Khazad is released soon, so those quest oriented decks will get punished by combat heavy scenarios. (and at the same time, Khazad combat decks will get punished by Mirkwood quest - heavy scenarios). I really wonder if finding right balance will be easy or not.\n\n\n\nMy deck isn't \"designed to kill [Dead Marshes]\".  The deck isn't even built with solo play in mind, and doesn't contain the strongest spirit card against this scenario, Unexpected Courage.\n\nI ran my Lore/Tactics deck against Marshes this morning, a deck with heavy amounts of combat and healing.  It took longer, but that deck one with relative ease.  I am unsure I even want to try my Spirit/Lore control deck against this scenario, because I know the encounter deck will not be able to compete against it.\n\nAt least for solo play (I have yet to try it multi-player), this is an easy scenario.  That's not to say it isn't fun or I didn't enjoy myself, or that the scenario is \"bad\" but we should all be able to acknowledge the low level of difficulty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554410","commentId":554410,"userName":"Mighty Jim 83","timestamp":1320914126,"content":"Lenbo said:\n\nBohemond said:\n\n \n\nWait, it’s over already? I have to say, the quest seemed remarkably easy. Maybe I just had solid draws, but it was a walk in the park. A marshy park, but a park none the less. I will have to run it a few more times against other decks before I pass judgment.\n\n \n\n \n\nYou're not alone, this quest is easy. Let's just say Eowyn + Unexpected Courage + Celebrian's Stone = Gollum captured.\n\n\n\nUnexpected courage + Celebrian's stone = most quests fairly easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554411","commentId":554411,"userName":"Bohemond2","timestamp":1320914251,"content":"Actually,, in most quests the combination of those two cards is not helpful.  They are solid cards on their own, but this is the only scenario where they have synergy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554431","commentId":554431,"userName":"guciomir","timestamp":1320918326,"content":"Bohemond, I think you play the game wrongly. You have to commit characters to escape test before an escape card is drawn. Once you draw the card and you see escape value, you can't play any action or tap any characters.\n\nEdit: I missed that you realised the mistake already. The outcome of the game was not changed as you say, but wouldn't you play more defensively?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56081-a-walk-in-the-marsh-a-dead-marshes-quest-summary/?do=findComment&comment=554437","commentId":554437,"userName":"Bohemond2","timestamp":1320919105,"content":"Play more defensively, not at all.  If the game is going to be short, I am very comfortable comitting 2 willpower to the escape check, especially with a Grim Resolve in my hand. \n\nFor what its worth, I tried my solo deck against it.  I won't bore you with the details, but if you have Beravor, Unexpected courage and Protector of Lorien, a turn 3 win is very possible."}]}