{"url":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/","title":"Gandalf Too Good? What do you think and why?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554612","commentId":554612,"userName":"DurinIII","timestamp":1320943660,"content":"So, over the past few months of watching different threads, I have noticed many players who are of the opinion that Gandalf is too powerful to run 3 copies of, and that he should come to be restricted.  Whether it is simply because three is too much overkill, or that combining Gandalf with certain other great cards (sneak attack comes to mind as one such card) is too powerful, there seem to be many who are unhappy with what I shall call \"Gandalf Abuse.\" \n\nI am not of the opinion that Gandalf by himself is too good, and I think it is appropriate to have up to 3 copies of him if you want.  As I have said before, story wise, Gandalf has a tendency to just \"show up\" to assist the the Free Folk of Middle-Earth (especially in the Hobbit...\"He comes and goes as he wills...\" says one of the dwarves.  Of course this is a game, and making an argument based strictly on fluff  does face up to the actual game interactions.  So, is he too good? \n\nWhat do you all think about him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554619","commentId":554619,"userName":"Bohemond2","timestamp":1320944423,"content":"I am confused.  If Gandalf was restricted, you could still run three copies of him. Are you familiar with the way in which other LCGs restrict cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554639","commentId":554639,"userName":"TheRomance","timestamp":1320946753,"content":"Although he is expensive, I personally feel like he is borderline game breaking due to his versatility.  While obviously his willpower/attack/defense values are nice, I think what makes him great is that he is able to accomplish what you are needing at that particular point in the game.  High threat?  He can reduce it by 5, and help you overcome questing difficulties with his willpower (i.e. if you're location-locked).  Struggling with strong enemies?  Immediately deal 4 damage to any enemy and use his attack to finish it off or absorb an attack with his defense and health.  I think that this versatility allows him to cover weaknesses of certain decks as well -- for example, if you're running a non-spirit deck and are lacking a source of threat reduction, he can provide it to you without requiring The Galadhrim's Greeting and spirit resources.  In this sense, he's kind of a bridge between the spheres.\n\nI feel like I'm stating the obvious that playing a Gandalf card has strong benefits, while the real point in question is whether or not he is cost effective for what he offers.  It's pretty subjective, but I think for five unmatched resources along with other cards that can bring him into play (such as Sneak Attack), he's quite worth the investment, especially when you're in a pinch.  So far I have been including three copies of him in all my decks, as I see him as a free \"get out of jail\" card.  Just my humble opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554647","commentId":554647,"userName":"Titan","timestamp":1320947795,"content":"My take on Gandalf is that he may become overpowered due to the combos he may have with other cards. By himself, he is very powerful but hardly game breaking. That's because you can only play him 3 times and you'd have to pay 5 resources each time. That's 5 resources for a card that will only stay in play one turn. I think that the interactions with other cards (Sneak Attack, Born Aloft, etc) is what could cause the problem.\n\nFor those that aren't familiar with restricting cards, the way it works is that you are only allowed to have one set of restricted cards per deck. To be clear, if Gandalf and Sneak Attack were restricted, you could field 3 copies of one or the other, but you could not have them both together. My belief is that eventually we will see a restriction that deals with Gandalf and his enabler cards. It's just a question of what exactly will be put on that list. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554657","commentId":554657,"userName":"silverhand77","timestamp":1320948980,"content":"Titan said:\n\nFor those that aren't familiar with restricting cards, the way it works is that you are only allowed to have one set of restricted cards per deck. To be clear, if Gandalf and Sneak Attack were restricted, you could field 3 copies of one or the other, but you could not have them both together. My belief is that eventually we will see a restriction that deals with Gandalf and his enabler cards. It's just a question of what exactly will be put on that list. \n\n\n\nI think what mght be confusingis the fact that there are already restricted attachments which mean that you can only have 2 copies attached to one character. I think that what you guys are talkng about is a restricted list of cards, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554661","commentId":554661,"userName":"DurinIII","timestamp":1320949390,"content":"I must confess, I thought I knew what restricted meant but I didn't.  I now see what you are saying Bohemond.  TheRomance, I see what you are saying, though I agree more with Titan, that he becomes \"too good\" combined with other cards.  You are right though TheRomance, he can do amazing things on his own at a neutral cost...this is Highly effective! I'm curious TheRomance, would you suggest FF change Gandalf's stats in the future? That is a possible option (though I don't think they'll do that).   Thanks for the comments guys!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554669","commentId":554669,"userName":"Dwnhmcntryboy","timestamp":1320950567,"content":" Gandalf is only as broken as the deck he is in. In a dual sphere Leadership/Lore Deck with Thalin/Glorfindel Steward of Gondor and healing and draw yeah he is broken because you can play him 6 times, EASILY, in a game rather than at most twice in any other deck.  I have played him 4 times in another leadership deck 1 time in that deck was hard cast. It is all about the deck he is played in. This is the reason he is not broken. It is the decks, with him in it, that are broken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554672","commentId":554672,"userName":"Titan","timestamp":1320950818,"content":"silverhand77 said:\n\nTitan said:\n\n \n\nFor those that aren't familiar with restricting cards, the way it works is that you are only allowed to have one set of restricted cards per deck. To be clear, if Gandalf and Sneak Attack were restricted, you could field 3 copies of one or the other, but you could not have them both together. My belief is that eventually we will see a restriction that deals with Gandalf and his enabler cards. It's just a question of what exactly will be put on that list. \n\n \n\n \n\nI think what mght be confusingis the fact that there are already restricted attachments which mean that you can only have 2 copies attached to one character. I think that what you guys are talkng about is a restricted list of cards, right?\n\n\n\nsilverhand77 said:\n\nTitan said:\n\n \n\nFor those that aren't familiar with restricting cards, the way it works is that you are only allowed to have one set of restricted cards per deck. To be clear, if Gandalf and Sneak Attack were restricted, you could field 3 copies of one or the other, but you could not have them both together. My belief is that eventually we will see a restriction that deals with Gandalf and his enabler cards. It's just a question of what exactly will be put on that list. \n\n \n\n \n\nI think what mght be confusingis the fact that there are already restricted attachments which mean that you can only have 2 copies attached to one character. I think that what you guys are talkng about is a restricted list of cards, right?\n\n\n\n\n \n\nCorrect, good point. We are talking about a restricted card list. \n\nFFG certainly does have a different take on a restricted card list. On every non-FFG game I can remember, you can have all restricted cards in the same deck, but it usually means you can only run 1 copy or 2 max. This is usually geared towards breaking up the power of the single card. But FFG's method is geared towards breaking up combos.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554691","commentId":554691,"userName":"marlow4","timestamp":1320953220,"content":"Here's how I feel about Gandalf:\n\nHe's fine. The combos that he is a part of are fine. If people want to focus on lowering their threat to 0 the whole game, that's fine. If people want to deal 4 damage or draw three cards, fine and fine.\n\nI will build decks without Gandalf. I'm already at the point where he only gets to be in the Leadership deck when I make 4 mono decks for group games. 1) It makes sense since he's a leadery type of character and 2) Leadership can afford him easily enough. I do not consider him a must have. I can successfully complete quests without him. Am I setting a world record for lowest score? No. Am I trying to? No. Am I having fun with or without him? Yes.\n\nMost of the time I can't even draw the S.O.B. I don't deck myself and play for 20 rounds and I have terrible luck. After all the sessions I've played, I can probably count within my first ten fingers how many times I've had Sneak Attack + Gandalf in my hand at the same time. And the times when I do get to play him I never get the feeling that the game just shifted heavily into my favor. He reduced my threat which will go back up shortly due to some crazy cards the encounter deck is spitting at me or he killed a weakling or wounded something that's about to pound on me. Maybe if I used him to draw three cards then I'd see the overpoweredness?\n\nHe might have been the cat's meow in 30 card decks, but in 50+ I think he's just fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554709","commentId":554709,"userName":"Bohemond2","timestamp":1320957406,"content":"In isolation, Gandalf is a well balanced card.  He has a huge impact on the game, with amazing stats and both powerful and versatile come into play effects.  However, he has a very high cost, and doesn't stay on the board after the turn, which lower his value.\n\nWhen you pair him with cards which let you ignore his disadvantage (Borne Aloft and Sneak Attack) and return him to your hand you have a very powerful, potentially unbalancing combination.  I don't think the card should be banned, but if you restrict Gandalf and resource acceleration, you solve what I see as a problem. I think placing Gandalf and Stweard makes for a better game, because you undermine the ability of a specific decks to drop Gandalf every turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554723","commentId":554723,"userName":"player582283","timestamp":1320961101,"content":"I echo Marlow's comments.  I'm rarely, if ever, unhappy to see Gandalf, but there are plenty of solo games where I don't see him that turn out as wins.  I enjoy the game with him or without him.\n\nI do love him showing up, making an impact and disappearing - very thematic.  I've been in a few 3 player games where he seems to show up every turn between us...I have to admit that takes some of the fun out of the experience..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554748","commentId":554748,"userName":"Glaurung","timestamp":1320967821,"content":"I think Gandalf is good and quite balanced card. Yes his powerful but for 1 round and 5 cost. But some cards like Sneak attack and before Stand and fight make him sometimes to broken. I remember in my previous deck i have 3 sneak 3 stand and fight and 3 Gandalf. WOW!!!! Some sessions i can play Gandalf every round!!! This is ti much!!!!  Now we have  Stand and fight errata which is good. I dont think we need do something with sneak attack but  sure we dont need such a powerful combos in the future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554822","commentId":554822,"userName":"DurinIII","timestamp":1320995353,"content":"Nice review Marlow (all your reviews are thoughtful and useful).   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554825","commentId":554825,"userName":"Shelfwear","timestamp":1320995751,"content":"The Gandalf card itself is fine as it is, 5 resources are not cheap. The problem is the combo with sneak attack which turns Gandal into a 1-resource card. Allmost every deck has a tactics song, sneak Attack and Steward of Gondor. This problem will further increase when probably a card shows up in the future that will bring back events from the discard pile (to re-use sneak attack over and over).\n\nI guess at some point FFG will rule that sneak attack is only playable on non-neutral cards (like stand and fight)..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=554985","commentId":554985,"userName":"booored","timestamp":1321024184,"content":"The thing is that this game isn't competitive.. there is no reason to build a deck using this card or its combos if you do not wish to. While he on his own isn't a problem, it is the combos that are already here, maybe more down the road that make it \"to\" powerful.\n\nThe thing is that you can customize your own experience with this game.. is it to easy.. then use less powerful cards\n\nStill for \"competitive\" play I would think that at some stage Gandalf's combo'ing ability and unexpected courage will be nurffed somehow... especially UC... that card is mega broken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=555020","commentId":555020,"userName":"DurinIII","timestamp":1321031123,"content":"Unexpected Courage is REALLY GOOD but I am only of the opinion that it is \"broken\" if you are running more than one copy per deck.  It's like they gave us 1 copy knowing how good it was...for a reason perhaps?  The only problem with that is that you theoretically can play 3, you just have to purchase 2 more boxed sets to do so (a marketing scheme perhaps?).   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56131-gandalf-too-good-what-do-you-think-and-why/?do=findComment&comment=555048","commentId":555048,"userName":"Eryx_UK","timestamp":1321037472,"content":"I think Gandalf is fine as is. Not meaning to be rude to anyone but it does seem that many just want the game to be even more challenging than it already is. If you think that just don't use him. Simples."}]}