{"url":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/","title":"4-player gamers&#039; experiences","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=554743","commentId":554743,"userName":"Cabelos","timestamp":1320965440,"content":"Folks that are playing 4-person games where each person is playing a single sphere, vanilla, with all cards released to date from core + expansions...are you having a hard time managing the first two rounds of the game?\n\nHere's the thing - I've dropped a lot of money on this game having bought all the expansion packs to date. The three guys I game with are about ready to throw this game out the window because by the time we do the encounter setup procedure and get ***** slapped around by treachery cards, we're already in a world of hurt. AND THEN, you draw four cards from the encounter deck on the first turn and have to deal with more Treachery, Surge, Doom, Locations, etc. We are typically cooked before we make it out of the second round. I've had Gimli killed twice in the first found because he can't take a 5 HP hit. What is the fun in losing a hero in the first round? My friends think we are somehow missing an important mechanic of the rules.\n\nThe Dead Marshes was a nightmare for us. We didn't even make it past the setup and 4 card draw because by the time we exhausted for our first Escape Check we had no way to control threat, and I swear to God, our threat hit 48 by the time we were done pulling Treachery, Surge, Doom, etc. It totally sucked, and this has happened to us before.\n\nHas anyone else had this problem, either with Dead Marshes, Hunt for Gollum, or other packs and how did you handle it?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=554751","commentId":554751,"userName":"marlow4","timestamp":1320968708,"content":"I haven't done Dead Marshes with 4 but I've done all of the others with at least 3.\n\nIt can be a bit overwhelming sometimes when drawing that much nastiness from the encounter deck, but that's where the \"strategery\" comes into play between you and your team.\n\nSome things to keep in mind for your next session:\n\nLet Leadership and Tactics take on the worst of the enemies, let Lore and Spirit take out the little guys when possible. During the beginning of the Engagement Phase, talk openly about who is or isn't optionally taking on an enemy and who is taking what. This is probably the most important step in making sure things don't gang up on people.\n\nAnd remember that you can attach attachments to other player's characters unless there is a sphere restriction like with that Lore torch thingie (can't think, it's 12:30am). Spread the love.\n\nTry to avoid exhausting any 1hp characters during Questing, cause chances are something is going to be drawn from that infernal encounter deck and clobber them. If they have an ability you want to use that requires that they exhaust to use it, exhaust them after the Quest phase if at all possible.\n\nCoordinate some timely Sentinel defense and Ranged attacks. It's too easy to get caught up with the enemy that is engaged to you and plan on dealing with it when you probably should be helping to take out something engaged with someone else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=554786","commentId":554786,"userName":"Mighty Jim 83","timestamp":1320984250,"content":" A lot of the existing quests seem to be harder at the start than later on - 1 encounter card per player, plus 1 encounter card per player in the first questing phase.\n\nOn the other hand, a lot of shadow cards in set-up have no effect: damage to exhausted, damage to player with threat over 35, remove progress tokens etc.\n\nAlso, the more players you have, particularly if everyone has a mono-sphere deck, the more chances you've got of getting allies/attachments etc into play first turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=554793","commentId":554793,"userName":"Narsil0420","timestamp":1320985697,"content":"All the 4 player games I've played have actually seemed too easy, it's good to hear that they can be a challenge! Sorry about your frustration though, stick with it. The game has slightly different pros and cons for each number of players you play with. However, that's part of the fun and keeps you wanting to play again and again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=554852","commentId":554852,"userName":"Troymk1","timestamp":1321000433,"content":"I run this 4 player a lot.\n\n \n\nI actually think the game is rather trite with 4 so yes you guys are missing something.\n\n \n\nCould be deck construction, could be tactical decisions as to who quests etc\n\n \n\nCase in point,  In Dead Marshes in your first turn just fail the escape checks, you are too weak to do those as well.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=554856","commentId":554856,"userName":"Shelfwear","timestamp":1321001300,"content":"We once had a day long 4-player session and yes, for us it was easier than solo or two-player. We still had fun organizing all the ranged/sentinel chars and distributing the enemies to the combat heavy players. It was rather a social experience than a tight tactical challenge to be honest..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=555039","commentId":555039,"userName":"gatharion","timestamp":1321036167,"content":" I haven't played four player since Hunt for Gollum came out, but all of those games were just super easy. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=555050","commentId":555050,"userName":"Eryx_UK","timestamp":1321037766,"content":"I haven't played a four player game since the basic box was released, and we creamed the first two quests. No challenge at all. I think i would rather play two players than four. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=555187","commentId":555187,"userName":"gatharion","timestamp":1321094151,"content":"The_Big_Show said:\n\nI haven't played a four player game since the basic box was released, and we creamed the first two quests. No challenge at all. I think i would rather play two players than four. \n\n\n\n \n\nUnless you're teaching the game to new players, I tend to agree. Better to have two games with two players each going than a single four person game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=555221","commentId":555221,"userName":"Morbid666","timestamp":1321106142,"content":"We play it it exactly the way you do and we have a blast. I do agree with Quests like Journey To Rhogsbel can be a bear. We find that we have a 60/40 win loss ratio. I also agree that if you can just survive the first 3 rounds, you will do fine. A lot of it is just the luck of the draw though. Do not give up, it is a great game and keep plugging away at it...you WILL win!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=555418","commentId":555418,"userName":"Grimbob","timestamp":1321182104,"content":"We play 4-player almost exclusively. We plan our deck strategies around multiplayer and specializing in various roles (primary attacker/ranged, sentinel defender, threat mitgation & cancels, healing/card draw, etc.) Usually the first couple times through a scenario we don't do stellar, and will fall short of our expectation. However, with the exception of osgiliath, we've eventually done well with every scenario including marshes which we just played yesterday.\n\nProbably more importantly we enjoy the game regardless of whether we win/lose. Its fun just to play but it can also be rewarding discussing ways to address challenges or coming up with interesting ideas/combos especially after losing a scenario or falling short in an unexpected way. Rather than jumping on this bandwagon of 'if you aren't winning every scenario right out of the packaging, there's something wrong with you and your genes', I'd look at it more- does your group enjoy the game in general? Everyone has their share of bad games (last night we pulled two goblin snipers in a row on the 2nd turn of our first run through dead marshes- not fun) but its more important to look at the overall game- do you and your group like the cooperative aspect, the deckbuilding, the new challenges, and the general background/immersion of a lord of the rings game?\n\nOur gaming group consists of about 7-8 enthusiastic/weekly players and about 2-3 irregulars. We play a solid mixture of boardgames and paper/pencil rpgs. We've tried out this game with nearly everyone and it only appeals to less than half of us. Some people like it but don't like some specific things like the cooperative aspect, the cost of monthly packs, the time investment, or simply have middle-earth fatigue. Even within our 4-player lotr group we have some variability in enthusiasm and expectation. But we taylor the game to match what we want as a gaming experience. If we get our asses handed to us by osgiliath a few times in a row, we'll go back to the carrock for a quick morale boost. My advice is to stick with it for now or just take a break and maybe revisit the game with the khazad-dum/dwarrowdelf cycle.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56143-4-player-gamers-experiences/?do=findComment&comment=555462","commentId":555462,"userName":"Skowza","timestamp":1321197698,"content":"Cabelos said:\n\nThe Dead Marshes was a nightmare for us. We didn't even make it past the setup and 4 card draw because by the time we exhausted for our first Escape Check we had no way to control threat, and I swear to God, our threat hit 48 by the time we were done pulling Treachery, Surge, Doom, etc. It totally sucked, and this has happened to us before.\n\n\n\nI'm relatively new to the game, but it sounds to me like something is being done incorrectly unless your luck is spectacularly bad... one player really got to 48 threat before a single round was over?  That would mean he/she got like 12-15 threat piled on before combat even began...\nIt seems to our group that the more people you add to the game the easier it gets; you only pull one additional card from the encounter deck per player but each player contributes 3 heroes and numerous other benefits which should easily make up for the extra card; you also get the benefit of having heroes that are less efficient for smaller groups (in our 3-player games we don't use Tactics much, but in our 4-player games the extra heroes are a huge boon) - the only downside is that its a lot easier to abuse draw mechanics, threat reduction, etc with less players."}]}