{"url":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/","title":"How much is your LGS selling Osgiliath for?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=554932","commentId":554932,"userName":"Periculum","timestamp":1321016408,"content":"I was wondering if anyone else was running into this. My LGS has the print on demand expansion for 20.00 instead of the 14.95 it's available for in the online store. I know shipping would almost cost me the same if I were to order it from the online store. It just seems odd to me that it would cost me more to pick it up from my LGS."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=554935","commentId":554935,"userName":"Doom1502","timestamp":1321016853,"content":"I bought it today for over 21 dollar (I know in Sweden is everything a little more expensive^^) but I too thought it was much preocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=554936","commentId":554936,"userName":"TheRomance","timestamp":1321016899,"content":" My local hobby store (California, USA) has it for $14.95 as well... although I bought mine on ebay, lols."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=554980","commentId":554980,"userName":"prune","timestamp":1321023512,"content":"I'm selling it for $15 with free shipping in the US, and discounted shipping internationally.  I guess these other vendors assume that people are not well informed; myself, I figure I need to offer a reason (better price when you factor in shipping) than you'd be able to get going direct to FFG.\n\nhttp://stores.ebay.com/prunesquallors-secret-cache [http://stores.ebay.com/prunesquallors-secret-cache]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555068","commentId":555068,"userName":"DurinIII","timestamp":1321043652,"content":"Yeah guys, depends on your gamestore and how much the owners decide to mark it up. My gamestore is quite fair (in fact they price everything for at least under $1 than the direct distributors do. I got Osgiliath at $13.95. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555130","commentId":555130,"userName":"jhaelen","timestamp":1321075751,"content":"The German publisher of LotR has announced that the price will be 14.95 Euros. That's twice as expensive as a regular AP which I don't quite understand since it's fewer cards. Then again, in contrast to the English version they're supposed to be identical in print-quality to the standard cards, so perhaps that's the reason for the higher price."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555171","commentId":555171,"userName":"Big Borg","timestamp":1321089141,"content":"I really hate this conversation.  So many LGS are going out of business.  Why?  Because of people like those posting here: \"I want to save a dollar or two.\"  These players totally ignore the fact that it costs quite a lot for a LGS to have a gaming venue for them (e.g., heat, electricity, rent, etc.).\n\nSo many customers buy off of the internet.  I've heard Magic, Yu-Gi-Oh, MonPoc players constantly saying the same thing. And they say this at the LGS -- sometimes in front of the store owner. \n\nWell, if your local LGS closes, especially during these hard economic times and you have fewer if any places to do gaming.  Remember, you are the cause!!\n\nSupport your LGS -- always!!!  In these times, every dollar helps these stores."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555192","commentId":555192,"userName":"Eryx_UK","timestamp":1321095565,"content":"Big Borg said:\n\nI really hate this conversation.  So many LGS are going out of business.  Why?  Because of people like those posting here: \"I want to save a dollar or two.\"  These players totally ignore the fact that it costs quite a lot for a LGS to have a gaming venue for them (e.g., heat, electricity, rent, etc.).\n\nSo many customers buy off of the internet.  I've heard Magic, Yu-Gi-Oh, MonPoc players constantly saying the same thing. And they say this at the LGS -- sometimes in front of the store owner. \n\nWell, if your local LGS closes, especially during these hard economic times and you have fewer if any places to do gaming.  Remember, you are the cause!!\n\nSupport your LGS -- always!!!  In these times, every dollar helps these stores.\n\n\n\nHere! Here! I fully agree.\n\nWe lost our FLGS because local players bought online rather than go through the store. So they lost a store and a place to play and hang out. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555203","commentId":555203,"userName":"Periculum","timestamp":1321098505,"content":"I would love to support my local gamestore, but new management has made it pretty hard for us. He doesn't order enough copies of the APs to go around on the first try. He wouldn't even know about the Osgiliath expansion if I hadn't reminded him several time that it was PoD. He ordered only one copy of the Civ expansion when at least three people had expressed their interest in it and this is the first time ever that I have noticed a mark up on the MSRP. I'm perfectly fine with paying a small mark up (assuming, perhaps, they had to make a separate order and pay shipping for it). They are selling copies at my LGS for 20.00US. LGS's fail when they don't meet the demands of the people that are still willing to buy from them even if the internet is cheaper. I've always bought from my LGS first. But now, I can't expect to get a new game for a month or two after it comes out because he only orders one copy (that an extreme board game fan gets his hands on first, always) and then he has to wait for the second wave of the game, which we all know isn't fast.\n\n \n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555267","commentId":555267,"userName":"Dwnhmcntryboy","timestamp":1321121213,"content":" Fact of the matter is No store should be buying Massing to resell since it is POD unless players do not have a shipping address and have prepaid the FFG listing price for the store to get it in for them.\n\nDo you think Walmart gets all pissed because I went to K-mart? No they say hey we will price match and since Walmart is everywhere and K-Mart not so much they will get more business. That is the price of convenience. \n\nGame stores never make money on product alone. If your game store has not gone to Costco or another warehouse and loaded up on munchies and soda and price hiked those then there is a flaw. The more you can keep a gamer in a store and supply them with what they need so they don't have to leave the more money you are going to make.\n\nMy FLGS has come out and said matter of fact that Snacks and Sodas pay his bills and the games make his profit. \n\nNow for those of you who have that owner who wont buy stuff for those who want it...Well alot of that comes down to finances and how he is managing his money. Sucks for you. And I mean that sympathetically. Been there done that. What you should be having him do is Pre-ordering the stuff you want. You Prepay retail he orders it in he make money up front instead of having to order one thing at a time and hope he makes enough money to buy the other one fore the next guy and so on. If he is not doing that for you guys....He is stupid.\n\nAnother thing you guys have to understand is MOST game store owners are gamers not businessmen. They have opened a store without doing the really hard research. A guy with a business degree is far more likely to do better than a fanboy running a storefront. Know who your store owner is and your expectations will be layed out reasonably before you.\n\nMy FLGS tries really hard to please the community through open honest communication to the Clique Heads. You know who I am referring to. This way he makes money and instills loyalty in the community.\n\nEvery Gamer is a responsible party to keeping a Store open. You are a business partner in a sense as without you there is no store. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555274","commentId":555274,"userName":"Runner5","timestamp":1321122690,"content":"Dwnhmcntryboy said:\n\n Fact of the matter is No store should be buying Massing to resell since it is POD unless players do not have a shipping address and have prepaid the FFG listing price for the store to get it in for them.\n\nDo you think Walmart gets all pissed because I went to K-mart? No they say hey we will price match and since Walmart is everywhere and K-Mart not so much they will get more business. That is the price of convenience. \n\nGame stores never make money on product alone. If your game store has not gone to Costco or another warehouse and loaded up on munchies and soda and price hiked those then there is a flaw. The more you can keep a gamer in a store and supply them with what they need so they don't have to leave the more money you are going to make.\n\nMy FLGS has come out and said matter of fact that Snacks and Sodas pay his bills and the games make his profit. \n\nNow for those of you who have that owner who wont buy stuff for those who want it...Well alot of that comes down to finances and how he is managing his money. Sucks for you. And I mean that sympathetically. Been there done that. What you should be having him do is Pre-ordering the stuff you want. You Prepay retail he orders it in he make money up front instead of having to order one thing at a time and hope he makes enough money to buy the other one fore the next guy and so on. If he is not doing that for you guys....He is stupid.\n\nAnother thing you guys have to understand is MOST game store owners are gamers not businessmen. They have opened a store without doing the really hard research. A guy with a business degree is far more likely to do better than a fanboy running a storefront. Know who your store owner is and your expectations will be layed out reasonably before you.\n\nMy FLGS tries really hard to please the community through open honest communication to the Clique Heads. You know who I am referring to. This way he makes money and instills loyalty in the community.\n\nEvery Gamer is a responsible party to keeping a Store open. You are a business partner in a sense as without you there is no store. \n\n\n\nI went over to Dragon's Keep the other day for the first time to get The Dead Marshes.  That store is awesome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555286","commentId":555286,"userName":"Dwnhmcntryboy","timestamp":1321132820,"content":" I'm sorry I was not there to meet you. They are doing great things at that store. They are constantly remodeling the store to make it better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555297","commentId":555297,"userName":"Periculum","timestamp":1321143154,"content":"The big downside of my situation is watching a drastic change from the guy who used to manage this stuff to the new guy that now has control over it. Pre orders are nice and helpful most of the time. I live in a military town and most of them are impulse buyers. Lots of money can be lost when you don't prepare for impulse buys."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56166-how-much-is-your-lgs-selling-osgiliath-for/?do=findComment&comment=555301","commentId":555301,"userName":"Dwnhmcntryboy","timestamp":1321145456,"content":" I completely agree with your assessment of impulse buys. If the new guy's not pulling his weight and supporting the gaming community as you see fit you should raise the issue. I am one of the biggest asses you will ever meet and have no problem voicing my opinions. Every group needs one of me otherwise all you have is a bunch of good people getting pissed that nothing is being done. When you take on the roll of voice of the group, even if you are not head of the clique, you will be noted as a trouble maker and an ass. If your groups backs the play though you can get a lot accomplished. The owners do not normally have a problem with the ass, the employees who have to relay the message and then get grilled as to why they are not doing their job by the owner usually have the problem with the ass. If the employees don't relay the message then go over them. You have a reasonable expectation to have your group's games supported at of all places a Game Store. I am fortunate that I am friends with most of the employees at my FLGS and they know how I am and can temper my message to the owner or they deal with it themselves. \n\nThe other problem you have to deal with is the Fact you are in a military town. I understand, I have it worse I live in a college town. Your FLGS has to deal with the fact that gaming groups change. In your case 2-4 years in mine about every 6 months. It is hard for them to figure out what to carry and how much. The big thing you need to do is get one of the employees or the owner into your game. If they are vested in the game you will see more support for it.\n\nYou could also use the nasty \"squatting\" tactic. I have been fortunate to be a part of some of these. All you do is get everyone together and well in advance of say.. Friday night Magic  you have 6-20 guys playing the same game and you leave no room for other games. You do that a few times and the store will take notice and find some way to accommodate you. That is all you are saying really, \"Accommodate us!\"\n\nIt is all about communication and getting your point across. There are many ways to communicate your desires. Find yours.\n\n "}]}