{"url":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/","title":"Dead Marshes Gollum question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555280","commentId":555280,"userName":"jpowers","timestamp":1321128654,"content":"My wife and I were playing The Dead Marshes and we ran into something that seems to make the scenario a bit too easy to win.\n\nWe were on stage 2b, but not yet on the final Escape test, when Gollum got his eighth resource token and was shuffled into the encounter deck. Quest stage 2b states that the Quest deck gets re-set to 1b if the final Escape test is failed, but we didn't see it indicated anywhere that the Quest gets re-set if Gollum gets shuffled into the Encounter deck.\n\nSo we get the three progress tokens on 2b and then dither about exploring locations and killing monsters, waiting for Gollum to come back during a quest phase. He eventually does, and since we've got the progress tokens needed to defeat stage 2b, we do the final Escape test, but Gollum has no resource tokens on him so the final Escape test is an instant win.\n\nI'm sure we're missing something, but it seems like you want Gollum to escape early on so he'll come back with no resource tokens on him, although I do realize you run the risk of him getting drawn as a Shadow card, ending up in the discard pile, and having to wait for the Encounter deck to be reshuffled.\n\nAny thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555318","commentId":555318,"userName":"marlow4","timestamp":1321149866,"content":"You'd also be extending the game after the new scoring system has been put in place that adds points per round. Letting Gollum escape should be avoided if you don't want your final score to look like a zip code.\n\nCourse if you don't care about any kind of scoring or potentially exploiting a loophole in the scenario, go ahead and let the little bugger escape like Faramir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555321","commentId":555321,"userName":"wraith428","timestamp":1321150075,"content":"Yeah... we ran into something similar.\n\n \n\nEarly on lost Gollum.  Got to 2B and tried to stall to get him back out... but he came out as a Shadow Effect.  Kept playing, reshuffled the encounter deck after a couple turns, play a few more turns and Gollum appears again... as part of an Escape Check.  No way we were going to get through the entire encounter deck again before our threat reached 50 so we called it.\n\n \n\nIf he escapes... its over unless you're really lucky.  Kinda annoying.\n\n \n\nWraith428\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555330","commentId":555330,"userName":"Narsil0420","timestamp":1321152948,"content":"I just lost gollum right before the end and went through the whole deck again (playing solo it takes a LONG TIME!), Gollum was the last card in the deck! But I found that creepy little bugger! Only took 23 turns..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555365","commentId":555365,"userName":"Doom1502","timestamp":1321164524,"content":"I played it that I have to reset the Quest even when Gollum isn't there. But I don't really know why now that I think about it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555454","commentId":555454,"userName":"Skowza","timestamp":1321194955,"content":"jpowers said:\n\nWe were on stage 2b, but not yet on the final Escape test, when Gollum got his eighth resource token and was shuffled into the encounter deck. Quest stage 2b states that the Quest deck gets re-set to 1b if the final Escape test is failed, but we didn't see it indicated anywhere that the Quest gets re-set if Gollum gets shuffled into the Encounter deck.\n\n\n\nHave to preface this by saying I'm a pretty new player, but isn't it kind of implied that if you reset the Quest to 1b you don't get to keep progress tokens on Quest 2b?  Are you allowed to have two Quests \"active\" at the same time? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555607","commentId":555607,"userName":"GhostWolf69","timestamp":1321243325,"content":"I think the whole idea of making Escape Tests when Gollum has already Escaped (i.e. been shuffled into the Encounter Deck or Discard) sits kind of bad with me and would require more FAQ-ish explanations.\n\nIf a Failed Escape Test (when Gollum is not in Staging Area) tells me to Add Progress to Gollum and Raise my Threat, will I Raise Threat only? Will I ignore the Escape Test all together?\n\nI just had the feeling that there are a lot of things referring to Goluum being in play that gets a little fuzzy when he's not. Q2b included.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56205-dead-marshes-gollum-question/?do=findComment&comment=555626","commentId":555626,"userName":"booored","timestamp":1321248607,"content":"jpowers said:\n\nI'm sure we're missing something, but it seems like you want Gollum to escape early on so he'll come back with no resource tokens on him, although I do realize you run the risk of him getting drawn as a Shadow card, ending up in the discard pile, and having to wait for the Encounter deck to be reshuffled.\n\nAny thoughts?\n\n\n\n \n\nYour not missing anything. This is exactly what you want to do.\n\nThe I basically do not give a rats about Goloum tokens, all those escape tests and treachery cards.. stuff em. If you have a decent threat control deck the threat gain is laughable. With Denathor to skry the encounter deck, say, 2xUC on him for example, so he is scrying 3 cards a turn, and with Elenore causing a second draw every time you see a when revealed means you can burn the encounter so fast. By the time he goes back in the deck the encounter deck is so small, it only takes a few turns to get him back again, and then BALM, you finish the quest with zero to only a few counters on him.\n\nThis method has worked every time so far. I have never failed this quest, not even once."}]}