{"url":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/","title":"Meneldor&#039;s Flight Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=555322","commentId":555322,"userName":"wraith428","timestamp":1321150251,"content":"Question popped up in the last game.  Can Meneldor's Flight which says \"Action: Choose and Eagle ally.  Return that character to its owner's hand.\" be used to return an Eagle card from the discard pile to a player's hand.\n\n \n\nWraith428"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=555325","commentId":555325,"userName":"silverhand77","timestamp":1321151632,"content":"wraith428 said:\n\nQuestion popped up in the last game.  Can Meneldor's Flight which says \"Action: Choose and Eagle ally.  Return that character to its owner's hand.\" be used to return an Eagle card from the discard pile to a player's hand.\n\n \n\nWraith428\n\n\n\nI don't beleive so because it says on page 25 of the rule book \"Cards effects do not interact with cards in an out of play state unless the effect specifically refers to that state\". Cards in a player's discard pile are considered to be \"out of play\" and Meneldor's Flight doesn't specifically refer to the discard pile. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=555335","commentId":555335,"userName":"lleimmoen","timestamp":1321154818,"content":"I really wonder if this card will not be in vain. So far there is only one eagle (Descendant of Thorondor) for which this card is useful. And I thought there shall probably be no more eagles after this cycle. It would have been great had it worked on Guardian or Vassal, but apparently it does not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573319","commentId":573319,"userName":"Kostas Antonopoulos","timestamp":1325408471,"content":" I believe it can (but I am not 100% sure). The rule in page 25 says: \"Cards effects do not interact with cards in an out of play state unless the effect specifically refers to that state\". In and Out.   So with the same logic the event can not be playd because it does not says: \"Chose an Eagle Ally In PLAY\", It's Says: Chose an Eagle Ally...Not in Play or out of Play. And again with the above rule (Cards effects do not interact with cards in an out of play state unless the effect specifically refers to that state) it's not possible. \n\nSo, my thoughts are: chose from wherever you want.\n\nIt is also logical when you have many Eagles with forced rules about discarding. And that 's why (just a theory ofcourse) the card says Eagle Ally, because it's balance to use it with 2-3 Ally cards (Eagles), but not other allies. \n\nOpinions? Still I am not 100% sure about the above, so any feedbck is welcome. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573387","commentId":573387,"userName":"Dam the Man","timestamp":1325423590,"content":"Cards affecting other cards already in play is the default position. They only affect other cards that are out of play if specifically mentioned. So you can play an Event targetting an Eagle in play even if the Event doesn't say \"in play\", as in play is taken as given."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573472","commentId":573472,"userName":"Kostas Antonopoulos","timestamp":1325442986,"content":"Sounds reasonable, but you never know with card games. I've playing card games (Magic, Lord of the Rings TCG, Wizard's Star Wars, Decipher's Star Wars, Wars, Young Jedi, War Cry, Dark Millenium, Game of Thrones) for almost 13 years, and I have seen situations like that a lot of times. I am also working in a Hobby Store and I run tournaments for various games, so again I have deal with a lot of rulings. But this one is tricky. But the main thing in card games is \"Rules as writen\". So again it's very possible that I am wrong, but I believe that you can bring an Eagle from the discard pile. Discard pile is an area of the game. It's not out of the game. For example Witch King from the Osgiliath scenario is concideret out of the game and the rule for that is clear, but there is no rule that says Discard pile is out of the game, and for that reason it can be a target if it is alloweded. And in page 25 of the rulebook it determines what \"In play\" means and what \"Out of play\" means (not to be confused with my erlier commet about out of the game). So if a card says \"Choose a card in play\" it must be from the playing area. If it says \"Chose a card from the discard pile\" it must be from there. If it NOT says \"In play\" then by the rules you choose from where ever you can choose. It's the same as with other rules, for example: \"Choose an Ally you control\" / \"Choose an Ally\". There is no need to have rules for \"In Play\" if it is standard and there are no exceptions.\n\nFrom the other hand maybe it's something that got away and it really means In Play. But if yes, what's the reason for that card? There is already \"Born Aloft\" and it can be any Ally!\n\nOh, and thanks for the awnser!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573526","commentId":573526,"userName":"booored","timestamp":1325455091,"content":"This is one of the big WTF rule combos that NEEDS an answer from FFG... Here is a 48 page post on it at BBG. I gave up on this rule problem a while back.. like many errors in teh rule system in this game, there is no \"correct answer\" yet until the faq comes out. So just play as you think is correct.\n\nhttp://www.boardgamegeek.com/thread/725099/meneldors-flight-and-vassal-of-the-windlord [http://www.boardgamegeek.com/thread/725099/meneldors-flight-and-vassal-of-the-windlord]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573594","commentId":573594,"userName":"jhaelen","timestamp":1325481856,"content":"silverhand77 said:\n\n \n\nI don't beleive so because it says on page 25 of the rule book \"Cards effects do not interact with cards in an out of play state unless the effect specifically refers to that state\". Cards in a player's discard pile are considered to be \"out of play\" and Meneldor's Flight doesn't specifically refer to the discard pile. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\nThis. It's consistent with the ruling in other LCGs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573620","commentId":573620,"userName":"muemakan","timestamp":1325489138,"content":" It´s not meant to target dead allies. It´s best, and at the moment only, used with Descendant of Thorondor. You could also \" heal\" eagles in this was or get the cards which you placed on the Eegles of the Misty Mountains  back to you discard pile.\n\nThe only cards to bring back something from the discard pile are: Stand and Fight, Dwarven Tomb, Fortune and Fate, Erebor Hammersmith and Second Breakfast. All of them clarify that the cards have to be in the discard pile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573635","commentId":573635,"userName":"Bohemond2","timestamp":1325491429,"content":"In addition, the card text says \"choose an eagle ally.\"  As far as I know, a card in your hand or the discard pile is not an 'ally'.  It is a 'card'.  More Specifically , it may be an 'ally card', or even an 'eagle ally card', but it is still a 'card' and not an 'eagle ally'.  It doesn't become an 'eagle ally' until it enters play.  When in your hand or the discard pile it is a 'card'. \n\nFor Meneldor's to work the way you interpret it, it would have to say \"choose an eagle ally card\", but it does not contain that crucial word."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=573847","commentId":573847,"userName":"Kostas Antonopoulos","timestamp":1325523018,"content":"Bohemond said:\n\n As far as I know, a card in your hand or the discard pile is not an 'ally'. It is a 'card'. More Specifically , it may be an 'ally card', or even an 'eagle ally card', but it is still a 'card' and not an 'eagle ally'.\n\nThere is no such rule in the main rulebook or the FAQ (As far as I know ofcourse). Also the Event \"Ever Vigilant\" says: Chose and ready 1 Ally card. Why it says Ally Card and not just Ally? Is it not in play? Also the Event \"Stand and Fight\" that brings card back from the discard pile says: Choose an ally with...An Ally, not an Ally Card. \n\nDon't forget there are scales to each rule. Example (not specific cards):\n\n 1. Choose an Ally from the Discard Pile\n 2. Choose a Card from the Discard Pile\n\nNumber one is more limited than number two (Obviously!)\n\nAnother Example: \n\n 1. Choose a Hero...\n 2. Choose an Ally...\n 3. Choose a Character \n\nAgain the same logic \n\nAnd finaly:\n\n 1. Choose an Ally In Play... \n 2. Choose an Ally from the Discard Pile...\n 3. Choose an Ally...\n\nAnd again with that logic there is no rule in the Rulebook or the FAQ to suggest otherwise. Again the main thing in all the games is Rules As Written.\n\nBut I will say one more time that this whole thing is maybe is just a bad-written rule. Which in that case we need an Errata!   \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=574041","commentId":574041,"userName":"jhaelen","timestamp":1325557746,"content":"Kostas Antonopoulos said:\n\nAnd again with that logic there is no rule in the Rulebook or the FAQ to suggest otherwise. Again the main thing in all the games is Rules As Written.\nThen why do you keep ignoring the relevant RAW? silverhand77 already quoted it above:\n\nit says on page 25 of the rule book \"Cards effects do not interact with cards in an out of play state unless the effect specifically refers to that state\". Cards in a player's discard pile are considered to be \"out of play\" and Meneldor's Flight doesn't specifically refer to the discard pile.\n\nThere's no ambuiguity here! The card text is sufficient because it doesn't need to repeat rules that are already clearly stated in the rule book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=574149","commentId":574149,"userName":"Style75","timestamp":1325580637,"content":"Could you use Meneldor's Flight to remove a debilitating condition from an Eagle Ally? Once the ally is returned to your hand, the conditions and attachments on it should be discarded. Yes, you'd have to pay the resource cost to get it back into play, but if the condition is bad enough the ally is effectively useless anyways. Am I reading this correctly?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=574157","commentId":574157,"userName":"Svenn","timestamp":1325582890,"content":"Style75 said:\n\nCould you use Meneldor's Flight to remove a debilitating condition from an Eagle Ally? Once the ally is returned to your hand, the conditions and attachments on it should be discarded. Yes, you'd have to pay the resource cost to get it back into play, but if the condition is bad enough the ally is effectively useless anyways. Am I reading this correctly?\n\n\n\nYes, this is a good use of the card.\n\nAs has been stated several times, this can only be used on a card in play. The rules state this very clearly. I'm not sure why this is even still being debated.\n\n\"Cards effects do not interact with cards in an out of play state unless the effect specifically refers to that state\". The card does NOT refer to the out of play state, so it only works on cards in play.\n\n@Kostas Antonopoulos: It says \"in an out of play state\" not \"in AND out of play state\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=574165","commentId":574165,"userName":"Bohemond2","timestamp":1325583732,"content":"Kostas Antonopoulos said:\n\nBohemond said:\n\n As far as I know, a card in your hand or the discard pile is not an 'ally'. It is a 'card'. More Specifically , it may be an 'ally card', or even an 'eagle ally card', but it is still a 'card' and not an 'eagle ally'.\n\nThere is no such rule in the main rulebook or the FAQ (As far as I know ofcourse). Also the Event \"Ever Vigilant\" says: Chose and ready 1 Ally card. Why it says Ally Card and not just Ally? Is it not in play? Also the Event \"Stand and Fight\" that brings card back from the discard pile says: Choose an ally with...An Ally, not an Ally Card. \n\nDon't forget there are scales to each rule. Example (not specific cards):\n\n 1. Choose an Ally from the Discard Pile\n 2. Choose a Card from the Discard Pile\n\nNumber one is more limited than number two (Obviously!)\n\nAnother Example: \n\n 1. Choose a Hero...\n 2. Choose an Ally...\n 3. Choose a Character \n\nAgain the same logic \n\nAnd finaly:\n\n 1. Choose an Ally In Play... \n 2. Choose an Ally from the Discard Pile...\n 3. Choose an Ally...\n\nAnd again with that logic there is no rule in the Rulebook or the FAQ to suggest otherwise. Again the main thing in all the games is Rules As Written.\n\nBut I will say one more time that this whole thing is maybe is just a bad-written rule. Which in that case we need an Errata!   \n\n\n\nNone of your examples deal with the issue at hand, the difference between \"choose an ally\" and \"choose an ally card:\n\nLet’s stick with examples, not hypotheticals. Yes, there was linguistic sloppiness in general throughout the core set. In the particular case you cited, Stand and Fight, the designers viewed the word ‘card’ as redundant because they had already specified an out of play state. However, they became far more precise in the Mirkwood cycle. The best way to see this is contrast the language between Second Breakfast and Erebor Hammersmith\n\nErebor Hammersmith\n“return the topmost attachment in any player's discard pile to his hand” [the word card should follow attachment. It does not[\n\nSecond Breakfast\n“Each player returns the topmost attachment card from his discard pile to his hand.” [ In second breakfast, the take the exact same but become more precise in the wording.\n\nThrough the set there are numerous examples off the specification of ‘card’\n\nThe Eagles Are Coming!\nSearch the top 5 cards of your deck for any number of Eagle cards and add them to your hand.\n\nMustering The Rohirrim\nSearch the top 10 cards of your deck for any 1 Rohan ally card and add it to your hand.\n\nRivendell Minstrel\nsearch your deck for 1 Song card\n\nPerhaps most clear, is the comparison between Cut Off, which makes you discard cards from hand and Ride to Ruin, which makes you discard cards in play. As others gave noted, out of play states are explicitly referenced. In addition, the word ‘card’ is used to distinguish between in play and out of play allies\n\nCut Off\nEach player must discard all ally cards from his hand\n\nRide to Ruin\nDiscard a Rohan ally to choose a location.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=574177","commentId":574177,"userName":"zeb","timestamp":1325585221,"content":"Kostas Antonopoulos said:\n\n I believe it can (but I am not 100% sure). The rule in page 25 says: \"Cards effects do not interact with cards in an out of play state unless the effect specifically refers to that state\". In and Out.   \n\n\n\n \n\nIt is \"in an out\", not \"in and out\". So no, by default a card does not interact with out-of-play cards, unless specified."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56211-meneldors-flight-question/?do=findComment&comment=574712","commentId":574712,"userName":"Kostas Antonopoulos","timestamp":1325680703,"content":"Yes, you are right! I have noticed that...a little bit late thoughpreocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]\n\nWhat confusion from a single \"d\"! But with that the rule is crystal clear. \n\nThanks to all for the reply and sorry for the confusion! "}]}