{"url":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/","title":"Son Of Arnor (Core Set)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555467","commentId":555467,"userName":"Mandalorian2011","timestamp":1321198769,"content":"New player question.\n\nThe question has come up regarding the Son of Arnor \"ally\" card.  It says to choose an enemy card in the staging area or currently engaged with another player and to engage that enemy.  The questions are the following:\n\n * If the enemy is in the staging area, once it is engaged, does it stay in the staging area or move directly to its engagement with your heros and allies?\n * If the enemy is engaged with another player, when you engage it and resolve conflict, does the enemy card stay engaged with another player or does it transfer to engagement with your heros and allies?\n\nOur first two attempts at this game were interesting.  The first game, we played the questing wrong where we added all the enemy points in the staging area plus the engaged enemies.  After a complete blood letting by the enemies we read those rules again and corrected the play.  The second game was the complete opposite.  The enemy deck delt minimal enemies, but may locations.  That was easy to beat.  We are reshuffling and starting our next game.  Hopefully it will fall somewhere in the middle.\n\nI did like the questing dynamic created by the Theodred/Aragor/Faramir combo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555471","commentId":555471,"userName":"marlow4","timestamp":1321199348,"content":"Son of Arnor will actually pull the enemy over to be engaged with you and it will stay there unless removed by another card effect or defeated. It's a way of pulling an enemy off of another player if they have more than they can handle or a way to pull an enemy out of the staging area for various reasons.\n\nEdit to add: There are several clever uses for Son of Arnor. Think about a deck with Leadership and Tactics cards in it or even a multi-player game where Leadership and Tactics are being played. Look at the card Quick Strike. You can kneel a character to attack an eligible target. Well say there is something in the Staging Area that you want to kill using Quick Strike but it is not an eligible target for any of your characters because it is in the Staging Area and you aren't playing with Dunhere. Play Son of Arnor, force the enemy out of the Staging Area and to engage the owner of Son of Arnor, it now becomes an eligible target for Quick Strike for either the characters of the Son of Arnor owner or for another player with Ranged characters which Tactics has.\n\nThat's how twisted this game is. There's always some tricksy combo that'll show up. Lots of inter-Sphere synergy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555473","commentId":555473,"userName":"Mandalorian2011","timestamp":1321200108,"content":" Thanks for the insight Marlow.  This game does have a lot of clever twists and turns.  Its a different experience each and every time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555542","commentId":555542,"userName":"zeb","timestamp":1321221626,"content":"I have a related question: if you decide to pull Hummerhorns from another player, does the Forced effect (deal 5 damages) occurs again on the new engaged hero?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555543","commentId":555543,"userName":"marlow4","timestamp":1321221956,"content":"zeb said:\n\nI have a related question: if you decide to pull Hummerhorns from another player, does the Forced effect (deal 5 damages) occurs again on the new engaged hero?\n\n\n\nYes, Hummerhorns forced effect would fire off anytime it engages a player. Pretty nasty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555576","commentId":555576,"userName":"ppsantos","timestamp":1321233348,"content":"Situation: Player 2 is now resolving his enemy's attack against him.  Player 1 (the first player, done resolving his enemies' attacks against him) plays Sneak Attack: Son of Arnor.  Son of Arnor targets P2's enemy and now engages P1 (say, because P2 can't handle the enemy, due to shadow effect or any other reason). What happens?\n\nIf Son of Arnor enters after Step 3: Resolve shadow effect of the combat phase, but before Step 4: Determine combat damage, does the attacking enemy still deal damage? To whom? To P2's defending character (even if he's no longer engaged with that enemy)?\n\nWhat if P1 plays Sneak Attack: Son of Arnor while P2's is resolving his enemy's attack, after P2 chose an enemy (step 1 of Combat phase)? P2 can no longer choose a defender against that enemy as it is no longer engaged to him. Does P2 continue resolving the remaining steps of the combat? Is the attack considered \"undefended\"? Who gets damaged? Or does the change in engagement stops all combat for that enemy and it doesn't attack P1 as he's done resolving his attack already (he's the first player).\n\nAnybody knows?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555606","commentId":555606,"userName":"marlow4","timestamp":1321243077,"content":"ppsantos said:\n\nSituation: Player 2 is now resolving his enemy's attack against him.  Player 1 (the first player, done resolving his enemies' attacks against him) plays Sneak Attack: Son of Arnor.  Son of Arnor targets P2's enemy and now engages P1 (say, because P2 can't handle the enemy, due to shadow effect or any other reason). What happens?\n\nIf Son of Arnor enters after Step 3: Resolve shadow effect of the combat phase, but before Step 4: Determine combat damage, does the attacking enemy still deal damage? To whom? To P2's defending character (even if he's no longer engaged with that enemy)?\n\nWhat if P1 plays Sneak Attack: Son of Arnor while P2's is resolving his enemy's attack, after P2 chose an enemy (step 1 of Combat phase)? P2 can no longer choose a defender against that enemy as it is no longer engaged to him. Does P2 continue resolving the remaining steps of the combat? Is the attack considered \"undefended\"? Who gets damaged? Or does the change in engagement stops all combat for that enemy and it doesn't attack P1 as he's done resolving his attack already (he's the first player).\n\nAnybody knows?\n\n\n\nThis issue came up before, I forget the resolution or if there was one. It might be in the Unofficial FAQ thread. Might even be in the updated official FAQ. I forget.\n\nI would be inclined to play it so that it actually interrupts the combat that round and just changes which player the enemy is engaged to. Any Shadow cards dealt to that enemy would be discarded at the end of the combat phase. Similar to an enemy with Forest Snare attached, they can't attack but they still get a shadow card dealt to them that is discarded at the end of the phase.\n\nBut I'm probably wrong because that would be beneficial to players and the unspoken bronze rule around here is if a ruling benefits the players in any way, you're doing it wrong. llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif]\n\nThe reality is the enemy probably gets to kill every character on the table because it was inconvenienced by Son of Arnor or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555661","commentId":555661,"userName":"zeb","timestamp":1321256445,"content":"I read on BGG forums someone asked Nate about this: http://boardgamegeek.com/article/7791898#7791898 [http://boardgamegeek.com/article/7791898#7791898] : \"if you use Sneak Attack/Son of Arnor to change who an enemy is engaged with mid-attack, the attack will resolve against the NEW player, rather than the original one.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/56236-son-of-arnor-core-set/?do=findComment&comment=555892","commentId":555892,"userName":"Kiwina","timestamp":1321287690,"content":"zeb said:\n\nI read on BGG forums someone asked Nate about this: http://boardgamegeek.com/article/7791898#7791898 [http://boardgamegeek.com/article/7791898#7791898] : \"if you use Sneak Attack/Son of Arnor to change who an enemy is engaged with mid-attack, the attack will resolve against the NEW player, rather than the original one.\"\n\n\n\nMoral of the story is that you should Sneak Son of Arnor before the targeted enemy starts attacking."}]}