{"url":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/","title":"Question regarding defending","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555619","commentId":555619,"userName":"arisgl","timestamp":1321246229,"content":"Hello I have one question regarding attacks that are initially defended and then become undefended during combat.\n\nExample:\n\n1) A player has an enemy engaged with to him\n\n2) He decides to defend with an eagle\n\n3) The shadow card dealt to the enemy states\n\na) something \n\nb) something else if the attack is undefended\n\n4) After the step 3 Resolve shadow effect the player plays an actions that return the eagle to his hand\n\nIn page 18 of the rulebook it sais that the attack is now considered undefended. \n\nThe questions that I have are:\n\n1) In the above example how the shadow card effect is resolved, as defended or undefended? My question is because during the \"step 3 Resolve shadow effect\" the attack wasn't undefended but in the end it became undefended.\n\n2)I cannot undertand the usage of Actions (not responses) that can be used to return allies to your hand. Since they cannot be used to save an ally from being killed or to defend agains an attack and save the ally before it receives any damage. However If in the above example the shadow card is resolved as a defended one then I see some usage.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555627","commentId":555627,"userName":"LEGA","timestamp":1321248683,"content":"arisgl said:\n\nHello I have one question regarding attacks that are initially defended and then become undefended during combat.\n\nExample:\n\n1) A player has an enemy engaged with to him\n\n2) He decides to defend with an eagle\n\n3) The shadow card dealt to the enemy states\n\na) something \n\nb) something else if the attack is undefended\n\n4) After the step 3 Resolve shadow effect the player plays an actions that return the eagle to his hand\n\nIn page 18 of the rulebook it sais that the attack is now considered undefended. \n\nThe questions that I have are:\n\n1) In the above example how the shadow card effect is resolved, as defended or undefended? My question is because during the \"step 3 Resolve shadow effect\" the attack wasn't undefended but in the end it became undefended.\n\n2)I cannot undertand the usage of Actions (not responses) that can be used to return allies to your hand. Since they cannot be used to save an ally from being killed or to defend agains an attack and save the ally before it receives any damage. However If in the above example the shadow card is resolved as a defended one then I see some usage.\n\n \n\n1) You defending by some ally A. For example attacking enemy gets 2 shadow cards. You reveal fist shadow card and it defeats your defending ally A (shadow effect resolved for defeated attack). So after that current attack becomes undefeated. Then you reveal the second shadow card and resolve its effect as for undefeated attack. And then enemy attacks you as undefeated.\n\n2) This action uses just for returning your defeated ally back into your hand (not in play). So you buy and can put it in play in the Planning phase of the next round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555637","commentId":555637,"userName":"arisgl","timestamp":1321251878,"content":" Hello and thank you for your try to answer my questions. Two clarifications:\n\n1) By a and b I did not mean two different shadow cards. I mean one shadow card that gives for example +1 (+3 if the attack is undefended). a is the defended case and b is the undefended. The question is whether the effect of the shadow card is affected, if after the 'resolve shadow cards\" step the attack suddenly becomes from defended undefended.\n\n2) I never implied that those cards are used to return an ally in to play. They are only used to return them to your hand. The problem is that they are not good to save an ally from dying  since according to the action frameworks\n\na)there is no action step between assigning damage to an ally and putting that ally to your discard pile\n\nb)if the ally leaves combat before damage assignment, the attack becomes undefended, so the damage is dealt to one of your heroes.\n\nThis means that in both cases the actions that return one ally to your hand are useless. The only use I see in them is for allies that have abilities that do something when they come in to play. Am I right or do I miss something?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555644","commentId":555644,"userName":"Eryx_UK","timestamp":1321253255,"content":"1. If you can bounce the ally back to your hand after the effects of the shadow card/s are played then the attack is undefended and the enemies damage must be applied to a hero.\n\nOn a personal level I think this a poor part of the rules. Once an enemy has been defended against that attack should be considered defended regardless of what happens to the ally (or hero if applicable).\n\n2. The only use I can see is if you have an ally you want but has already taken damage, you can bounce it back to your hand thus removing the damage tokens and then replaying it afresh."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555692","commentId":555692,"userName":"arisgl","timestamp":1321262690,"content":" Thank you The_Big_Show!\n\nMy question in 1) is wether the shadow card will be triggered  as undefended? I agree with you that it will be undefended and the damage will be dealt to a Hero. The question is whether the shadow card will do the defended or the undefended effect, since when the shadow card resolved the attack was still defended?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555698","commentId":555698,"userName":"LEGA","timestamp":1321263432,"content":"arisgl said:\n\n Thank you The_Big_Show!\n\nMy question in 1) is wether the shadow card will be triggered  as undefended? I agree with you that it will be undefended and the damage will be dealt to a Hero. The question is whether the shadow card will do the defended or the undefended effect, since when the shadow card resolved the attack was still defended?\n\n\n\nSorry arisgl for my previous misunderstanding.\n\nIt depends on time when you will use your action (return ally to your hand). If just after step 3 (Resolve Shadow effect) then the shadow card will be defended, but if after step 2 (Declare a Defender) then the shadow effect will be undefended. (Rules. p.18.Players may play event cards and take actions at the end of each step.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555702","commentId":555702,"userName":"Dam the Man","timestamp":1321263679,"content":"\"If a defending character leaves\nplay or is removed from combat before damage is\nassigned, the attack is considered undefended.\" (p. 18)\n\nCombat damage being step 4 during combat, so basically anytime the defender leaves play, the attack becomes undefended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555719","commentId":555719,"userName":"Svenn","timestamp":1321266082,"content":"Dam said:\n\n \n\n\"If a defending character leaves\nplay or is removed from combat before damage is\nassigned, the attack is considered undefended.\" (p. 18)\n\nCombat damage being step 4 during combat, so basically anytime the defender leaves play, the attack becomes undefended.\n\n \n\n \n\nThe question isn't whether or not the attack is undefended, but whether the shadow card effect changes after it has already resolved as a defended attack (+1 attack). The Shadow card is flipped and resolved, THEN the ally is returned to hand. Does the shadow effect suddenly switch to +3 attack because it became undefended or is it still +1 attack?\n\nI would say it's a +3 since the shadow effect seems to be more of a constant effect. It is not an Action or Response that triggers once and then is done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=555720","commentId":555720,"userName":"radiskull","timestamp":1321266151,"content":" In your example, the attack will be considered defended for purposes of the shadow card, but undefended for the purposes of assigning damage.  This is indeed one use of abilities that return allies to your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556079","commentId":556079,"userName":"arisgl","timestamp":1321331916,"content":"Thank you very much for your answers and mainly for understanding what exactly I am asking.\n\nBut as you both can see you disagree with each other and this is why I posted this question. I can understand the interpretation from both sides but I cannot find any official proof of which one of them is the right one. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556193","commentId":556193,"userName":"radiskull","timestamp":1321352274,"content":" My take on it: I see it as a one-time buff to the enemy.  In code, it's like\n\nif attack=defended\n\ngive +1 atk\n\nelse\n\ngive +3 atk\n\n \n\nIf that makes any sense at all - the only time the defendedness is checked is during step 3 of combat, when the shadow card is revealed and resolved.  I don't see it as a constant buff - there's an encounter card that gives +1 threat to everything in the encounter area that works the same way - it doesn't buff any cards that come after it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556204","commentId":556204,"userName":"Svenn","timestamp":1321354425,"content":"radiskull said:\n\n \n\n My take on it: I see it as a one-time buff to the enemy.  In code, it's like\n\nif attack=defended\n\ngive +1 atk\n\nelse\n\ngive +3 atk\n\n \n\nIf that makes any sense at all - the only time the defendedness is checked is during step 3 of combat, when the shadow card is revealed and resolved.  I don't see it as a constant buff - there's an encounter card that gives +1 threat to everything in the encounter area that works the same way - it doesn't buff any cards that come after it.\n\n \n\n \n\nAre you referring to Driven by Shadow (\"Each enemy and each location in the staging area gets +1[threat] until the of the phase. If there are no cards in the staging area, Driven by Shadow gains surge.\")? I've always played that as all locations and enemies get +1 threat, regardless of whether they were revealed before or after the treachery...\n\nEdit: I just sent rules questions about both of these situations now because I am very curious."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556206","commentId":556206,"userName":"leptokurt","timestamp":1321354514,"content":"IMO the shadow effect should be handled as defended, but  the damage afterwards as undefended. My reasoning is that the shadow effect was already resolved before the attack became undefended. Otherwise you'd have to go back in time to change the outcome of the shadow effect. There's no time travelling machine in Middle-Earth as far as I know!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556207","commentId":556207,"userName":"leptokurt","timestamp":1321354713,"content":"Svenn said:\n\nradiskull said:\n\n \n\n My take on it: I see it as a one-time buff to the enemy.  In code, it's like\n\nif attack=defended\n\ngive +1 atk\n\nelse\n\ngive +3 atk\n\n \n\nIf that makes any sense at all - the only time the defendedness is checked is during step 3 of combat, when the shadow card is revealed and resolved.  I don't see it as a constant buff - there's an encounter card that gives +1 threat to everything in the encounter area that works the same way - it doesn't buff any cards that come after it.\n\n \n\n \n\nAre you referring to Driven by Shadow (\"Each enemy and each location in the staging area gets +1[threat] until the of the phase. If there are no cards in the staging area, Driven by Shadow gains surge.\")? I've always played that as all locations and enemies get +1 threat, regardless of whether they were revealed before or after the treachery...\n\n\n\nMe too, but then I read something in this forum that said otherwise. I think it was either the unofficial or official FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556224","commentId":556224,"userName":"radiskull","timestamp":1321357977,"content":"That was the card I was referring to, Svenn.  And please share if you get an official response!\n\nI think the reasoning behind it is that the effect resolves completely when it reveals, so the game doesn't go back and \"recheck\" when new cards are drawn.  I think it'd say something like \"every enemy and each location in the staging area or revealed this phase gets +1...\" if the other way were meant.\n\nThis is, of course, pure speculation and I could be totally wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556232","commentId":556232,"userName":"Svenn","timestamp":1321358861,"content":"radiskull said:\n\n \n\nThat was the card I was referring to, Svenn.  And please share if you get an official response!\n\nI think the reasoning behind it is that the effect resolves completely when it reveals, so the game doesn't go back and \"recheck\" when new cards are drawn.  I think it'd say something like \"every enemy and each location in the staging area or revealed this phase gets +1...\" if the other way were meant.\n\nThis is, of course, pure speculation and I could be totally wrong.\n\n \n\n \n\nThis makes perfect sense, but at the same time it seems weird to me to have to track which ones were revealed after the treachery card to know what gets a +1 and what doesn't. The real question there is are you revealing 1 card at a time or are all cards revealed simultaneously? If they are revealed simultaneously then I would say that all cards are in the staging area before the effects start to resolve, in which case it would apply even to the newly revealed cards.\n\nAs for the original question about the shadow effects... it does make sense that the shadow card has resolved, but at the same time it's basically an attachment. It doesn't get discarded immediately, it hangs around with it's effect. In that respect, it seems like this is a constant effect to me, rather than a one time \"resolve this effect\" thing.\n\nEdit: Just re-read the staging section of questing. It looks like it does say they are revealed and resolved one at a time. Your interpretation makes the most sense from a strict interpretation of the rules at this point, radiskull. I still feel like it makes more sense for it to be ALL cards in the staging area that turn, not just those already in the staging area, if only for simplicity, but that would be more of an errata probably."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556273","commentId":556273,"userName":"radiskull","timestamp":1321365315,"content":" I agree that it's definitely more to keep track of in the Pursued by Shadow case, but I still think my interpretation is correct in spite of that.  I handle it by essentially keeping a running total (ok, that's 6 threat, 7 threat, oh no! Pursued by shadow puts it at...12 threat, ok now 14 threat.  Do we have that much willpower?)\n\nIn the shadow card case, I hadn't considered treating shadow cards as \"temporary attachments\" - I think there may be something to that argument that would make that case come out differently than the previous one - reading the card with an implicit \"while this card is attached, the attacking enemy gets +1 strength, or +3 while undefended\".  Very anxious to see if you hear from Nate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556293","commentId":556293,"userName":"pumpkin","timestamp":1321368829,"content":" I agree with radiskulls interpretation of driven by shadow mainly because of the rest of the text on the card- if there are no cards in the staging area, driven by shadow gains surge....\n\nIf it affected subsequent cards to be revealed, surge wouldn't reallybe necessary- I think surge is there to ensure driven by shadow still has imPact even if it is first card drawn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=556966","commentId":556966,"userName":"The Strolling Bones","timestamp":1321525832,"content":"So as an aside, how do you handle the Northern Trackers ability? I personally only put progress tokens on the locations in the staging area before the new encounter cards are revealed? This effect is very similar to the pursued by shadow effect and so I was wondering.\n\nAs for the actual question of this thread I'd been treating it as though the attack were considered block as long as I'd declared a blocker and no nasty shadow effects removed my blocker from play, however after reading this thread and re-reading the rules it seems as though I'm incorrect. I'd personally rule that the shadow effect is a one time effect and so if as its revealed the attack is considered defended then the shadow effect resolves as though the attack were defended.\n\ngreat question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56254-question-regarding-defending/?do=findComment&comment=557050","commentId":557050,"userName":"radiskull","timestamp":1321537801,"content":" The difference between PbS and the Northern Tracker's ability is that the Tracker's ability has a very specific time that the ability triggers - immediately after it commits to a quest.  This doesn't create an ongoing effect; it just adds tokens to the locations that are there at that moment.\n\nIn short, you're playing it correctly."}]}