{"url":"https://community.fantasyflightgames.com/topic/56316-middle-earth-history/","title":"Middle Earth History","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56316-middle-earth-history/?do=findComment&comment=556240","commentId":556240,"userName":"Narsil0420","timestamp":1321359747,"content":"This is in response to a question posted on the RtM preview asking about if Sauron was in Dol Guldur at the time of the Hunt for Gollum.\n\nHe wasn't actually. 2941 of the Third Age was the year that Bilbo and the Dwarves went to the Lonely Mountain and all the events of the Hobbit took place, including Bilbo finding The Ring. When Gandalf leaves the Dwarves at the edge of Mirkwood he goes down to meet with the White Council (Galadriel, Elrond, Radagast, Saruman, Celeborn) and they decide to attack Dol Guldur. Sauron feints defeat but was actually preparing to move back to Mordor at this time. One of the cool things about The Hobbit movie that's coming up is that Peter Jackson is going to include this attack on Dol Guldur!\n\nSo then in the years when the game takes place, 3001-3018, Sauron is already in Mordor. This is why we could actually get out of Dol Guldur when we had to rescue one of our friends there, there was only a measly Ringwraith in charge of Dol Guldur, ha ha. And this is why the previews talk about Sauron being in Mordor\n\ncheck out: http://en.wikipedia.org/wiki/Timeline_of_Arda#3019 [http://en.wikipedia.org/wiki/Timeline_of_Arda#3019]\n\nif you want to read more!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56316-middle-earth-history/?do=findComment&comment=556298","commentId":556298,"userName":"Gibby","timestamp":1321369717,"content":" Cool, thanks for the answer!  \n\nDo you have an idea when the scenarios included in the base game take place? \nSuppose at the time we rescued our friend from the dungeons of Dol Guldur it had already been assaulted by the white council. Did they not destroy it entirely or take it over? How else could a Ringwraith retake it? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56316-middle-earth-history/?do=findComment&comment=556344","commentId":556344,"userName":"player582283","timestamp":1321377487,"content":"Good info...and I did not know that the movie was going to include the assault on Dol Guldur.  That will be very cool.  If only Tolkien had expanded all the references and  side plots further... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56316-middle-earth-history/?do=findComment&comment=556439","commentId":556439,"userName":"gamestar10","timestamp":1321404741,"content":"Gibby, the instruction book on pg 2 says that the \"quests take place during a timespan of 17 years: from when Bilbo celebrates his 111th birthday (and Frodo's 33rd) to days just prior to Frodo's leaving the Shire.\"\n\nThis would put the scenerios happening between 3001 - 3018 3rd Age.\n\nDuring these years, Dol Guldur housed 3 Nazghul that Sauron has sent to reclaim it after he was driven out by the White Council in 2941 3rd Age.  Attacks were launched from Dol Guldur against Lothlorien (3 total) and after the last one failed, Celeborn led an attack against Dol Guldur in spring of 3019 (just after the defeat of Sauron) and overthrew it. Gladriel then broke down the walls of Dol Guldur and the shadow that was over Mirkwood was cleansed. So, at the time we rescue our friend in the scenerio, yes, the White Council had run Sauron out but after they departed, it was inhabited by Nazghul.\n\nNow, as we come to our last Adventure Pack \"Return to Mirkwood\", we are just inside of 3018 3rd Age.\n\nAlso, if you're interested in the \"Story behind the Cards\", you might enjoy our podcast The Fellowship of the Cards!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56316-middle-earth-history/?do=findComment&comment=556479","commentId":556479,"userName":"Gibby","timestamp":1321413722,"content":" Great info, thanks! "}]}