{"url":"https://community.fantasyflightgames.com/topic/56415-where-were-the-heroes-in-3001-to-3018/","title":"Where were the Heroes in 3001 to 3018?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56415-where-were-the-heroes-in-3001-to-3018/?do=findComment&comment=557116","commentId":557116,"userName":"BoundForGlory","timestamp":1321548244,"content":"Although I do not know much about it yet, I really enjoy learning about the history of Middle Earth, and I like recreating possible scenarios in the LCG.  I'm trying to figure out where our heroes were during the 17 year span that this game is supposed to cover.\n\nHobbits:\n\nBilbo - In 3001, he traveled with 3 dwarves (unnamed in LotR, but named Nar, Anar, and Hannar in History of Middle Earth) from the Shire to Dale and the Lonely Mountain, and settled in Rivendell in 3002.\n\nFrodo - in the Shire the whole time.\n\n \n\nRohan:\n\nEowyn - In 3001, she was about 6 years old!  By 3018, she was 23, but was caring for her uncle Theoden, whose health was very poor.  It is unlikely she was galavanting about on adventures in the interim, but it is remotely possible, I suppose.\n\nTheodred - 23 years old in 3001 (same age as Boromir).  I'm sure he goes on quests during the next 17 years, but I don't know much about him until he dies the day before Boromir dies.\n\nDunhere - don't know much about him, except that he died in 3019 defending Minas Tirith.\n\n \n\nDunedain:\n\nAragorn - Searched for Gollum beginning in 3001.  Finally finds Gollum and catches him in February, 3018.  Then delivers him to Legolas' father in Mirkwood in March.  (Gollum escapes in June.)\n\n \n\nGondor:\n\nBoromir - Boromir is 23 years old in 3001.  In 3018, he is involved in holding Osgiliath.\n\nPrince Imrahil - Was 46 years old in 3001, but was not \"Prince\" until 3010, at age 55.  By 3017, he was 62 years old and a grandpa!  Yet he fought valiantly in the war of the ring and survived it.\n\nDenethor - Steward of Gondor during the entire 17-year span.  Probably stayed in Minas Tirith most of the time, but then, defending in his strong point in the game, anyway.\n\n \n\nElves:\n\nLegolas - in August of 3018, Legolas is sent to Rivendell to let them know that Gollum escaped and that the Mirkwood elves had lost his trail.\n\nGlorfindell - Don't know anything about him before he rides to Frodo's rescue.\n \n\nDwarves:\n\nGloin - 218 years old in 3001.  \n\nGimli - 122 years old in 3001 (11 years older than Bilbo).\n\nDain Ironfoot - King under the mountain during the whole period.  Friend/Ally of Brand.  \n\nDwalin - \n\n \n\nDale:\n\nBrand - Became King of Dale in 3007 (years after Bilbo's visit in 3001-3002).  Friend/ally of Dain Ironfoot.\n\n \n\n \n\nIf you know any more details about these heroes during that time span, please post here and maybe I'll edit this post to fill in those details."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56415-where-were-the-heroes-in-3001-to-3018/?do=findComment&comment=557181","commentId":557181,"userName":"Narsil0420","timestamp":1321562535,"content":"Nice post! I enjoyed catching up on all that info.\n\nGood reminder that Dain II and Brand are friends, I'll have to make a deck with them!\n\nOne of the most interesting parts to me is the whole first battle at Osgiliath (which is lead up to in Massing at Osgiliath) You pointed out that Boromir was there, and this is when he had his vision which led him to Rivendell. That attack at Osgiliath was really just a ruse to get the Ringwraiths across the Anduin in secret, after which they could begin their hunt for the ring. I'm hoping we'll get to visit that whole scene again in the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56415-where-were-the-heroes-in-3001-to-3018/?do=findComment&comment=557611","commentId":557611,"userName":"BoundForGlory","timestamp":1321665131,"content":"Now that I have an idea of what the heroes were doing during these years, I'm going to try to piece together the dates [and key characters] for some of these adventures.\n\n3001\n\nThe Hunt for Gollum [Aragorn]\n\n \n\n3009 - 3016\n\nThe Hills of Emyn Muil [Aragorn and Gandalf] - Tolkien says that during these years they renewed their hunt and searched \"in the vales of Anduin, Mirkwood, and Rhovanion to the confines of Mordor.\" While the hills of Emyn Muil are not specifically mentioned, it would be logical to assume that they would have been searched.\n\nThe Redhorn Gate [Elves] - One would assume that elves from Lorien and/or Rivendell would have been involved in Arwen's safe transport from Lorien to Rivendell\n\nRoad to Rivendell [Elves] - One would assume that elves from Lorien and/or Rivendell would have been involved in Arwen's safe transport from Lorien to Rivendell\n\n \n\n3017\n\nThe Dead Marshes [Aragorn] - January-February (capture happens Feb 1)\n\nReturn to Mirkwood [Aragorn] - 50 day march from February 1 - March 21 (delivery to King Thranduil happens March 21)\n\n \n\n3018\n\nMassing at Osgiliath [boromir] - Sauron attacks Osgiliath in June, so I assume the massing happens in the months leading up to June, in preparation for that attack\n\n \n\nNot recorded in literature (please correct me if I am wrong):\n\nC1 - Passage Through Mirkwood [Elves?]\n\nC2 - Journey Down the Anduin [Elves?]\n\nC3 - Escape from Dol Guldur\n\nSM2 - Conflict at the Carrock [?]\n\nSM3 - A Journey to Rhosgobel [?]\n\n \n\nI welcome your corrections and feedback."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56415-where-were-the-heroes-in-3001-to-3018/?do=findComment&comment=557624","commentId":557624,"userName":"timbolton","timestamp":1321669850,"content":"Don't think there is anything you missed that I posted quite a while ago regarding the time period, but here's a link to that thread just in case there is -\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=480369 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=480369]\n\n \n\nGood job! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}