{"url":"https://community.fantasyflightgames.com/topic/56437-vassal-of-the-windlord-born-aloft-timing/","title":"Vassal of the Windlord &amp; Born Aloft timing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56437-vassal-of-the-windlord-born-aloft-timing/?do=findComment&comment=557360","commentId":557360,"userName":"Grimbob","timestamp":1321610847,"content":" i had a question regarding vassal of the windlord's forced ability (discard after its attack resolves) and the use of either born aloft or meneldors flight, both of which can return the card to its owners hand as an action. can u trigger those cards after attacking but before forcing the discard? im guessing no, but wanted to be sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56437-vassal-of-the-windlord-born-aloft-timing/?do=findComment&comment=557508","commentId":557508,"userName":"Kiwina","timestamp":1321633221,"content":" If you do return Windlord to your hand in order to keep it from being discarded, you must use the action before damage is resolved.  That would mean the Windlord's attack strength wouldn't be added to the damage unfortunately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56437-vassal-of-the-windlord-born-aloft-timing/?do=findComment&comment=557509","commentId":557509,"userName":"Valyrian Steel","timestamp":1321633309,"content":" The forced effects trigger before you would get a chance to use any actions. You can use it before damage is assigned but then the attack would be undefended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56437-vassal-of-the-windlord-born-aloft-timing/?do=findComment&comment=557581","commentId":557581,"userName":"TheLightdarker","timestamp":1321647607,"content":"Grimbob said:\n\n i had a question regarding vassal of the windlord's forced ability (discard after its attack resolves) and the use of either born aloft or meneldors flight, both of which can return the card to its owners hand as an action. can u trigger those cards after attacking but before forcing the discard? im guessing no, but wanted to be sure.\n\n\n\n\n\nThere's this thread [http://boardgamegeek.com/thread/725099/meneldors-flight-and-vassal-of-the-windlord] covering the same question on Boardgamegeek\n\nAlso, it just so happens that someone asked me my opinion on this question last night, so here are my thoughts (which may be completely wrong, of course, but the rulebook isn't exactly clear on this topic imho):\n\nFirst of all, the rulebook contradicts itself by 1) on page 20 saying that players can play event cards and take actions at the end of each step, and 2) in the back, where the flowchart says that players can take actions \"generally\" on sections highlighted in green, which is most of the entire combat phase. I am going to go with the latter, more strict ruling.\n\nFor Vassal of the Windlord... p20 says \"To resolve an attack against an enemy, a player follows these 3 steps, in order. Players may play event cards and take actions at the end of each step.\"\n\nIt seems like once you finish step 3 of attacking - that is, to deal damage to whatever VotW attacked, then players have a window to take actions/play event cards (where you CAN play Melendor's Flight to save VotW). After that, combat will count as being resolved.\n\n \n\nFor Winged Guardian... p18 says \"When resolving enemy attacks, the players follow these 4 steps, in order. Players may play event cards and take actions at the end of each step.\"\n\nIn the rulebook, the players seem to clearly have an opportunity to take actions/play events after step 4, and that after they choose to take advantage of this opportunity OR decline to do so, the combat then is resolved. So, it would seem that you can play Meneldor's Flight once combat damage has been determined (step 4) in order to save Winged Guardian.\n\nSo... I am going to vote for \"yes, you can use Melendor's Flight to save either Vassal of the Windlord or Winged Guardian.\"\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56437-vassal-of-the-windlord-born-aloft-timing/?do=findComment&comment=557583","commentId":557583,"userName":"marlow4","timestamp":1321649894,"content":"Lightdarker said:\n\nSo... I am going to vote for \"yes, you can use Melendor's Flight to save either Vassal of the Windlord or Winged Guardian.\"\n\n\n\nI go back and forth on this issue in my head. The thing that keeps making me second guess things is the fact that we seem to keep getting allies that are one trick ponies who do their thing then get discarded and then we also get events that look like they should work with these same allies that are going to end up forcibly discarded. The Eagles are prime examples.\n\nBut I just don't know. Are we really supposed to be able to do these combos with these particular allies or are they specifically given these forced effects to take them out as possible targets of these events/attachments?\n\nRohan allies are following the same pattern. But we can't discard Escort from Edoras in order to play that Rohan event that adds 3 progress to a location during the quest phase where Escort was committed. There's no window for the event to be played before the Escort is forced into the discard pile after the quest resolves, right? So why should we be able to save the discarding Eagles during combat steps?\n\nSomeone fire up the Nate signal and shine it into the sky."}]}