{"url":"https://community.fantasyflightgames.com/topic/56431-perfect-card-storage/","title":"Perfect card storage.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56431-perfect-card-storage/?do=findComment&comment=557297","commentId":557297,"userName":"Xealous","timestamp":1321593990,"content":"I have a dream, a dream of a perfectly stored game. All cards sleeved, and stored in a zippered album, I have glimpsed some cases such as on Ultra Pro's site, and any number of collector sheets and folders. I can imagine the player cards stored beautifully three to a slot in these. However three sleeved cards do not sit pretty in the collector sheets and the same for the cases I presume.\n\nHas anyone found or seen perfect albums/cases to store cards in this manner? Considering you also need to store numerous player and encounter decks, these can perhaps be stored seperately and ready for transportation with all available player cards in an album (sorted by sphere, card type and possibly cost naturally...you know you'd do it to!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] ).\n\nI am also thinking of having all my Hero and quest card in sturdy top loaders, as these cards are never shuffled into any deck and this would avoid any accidental shuffling (during play or storage) & make them stand out somewhat from other cards, & allow them to hold plenty of counters securing.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56431-perfect-card-storage/?do=findComment&comment=557316","commentId":557316,"userName":"Svenn","timestamp":1321600917,"content":"Maybe it's just me but having all my cards in a book just sounds... tedious. I haven't sleeved all of my cards yet, but this is how I store both my LotR and Warhammer: Invasion cards:\n\ntabletopgeeks.com/warhammer-invasion-living-card-game-review/cardbox/ [http://tabletopgeeks.com/warhammer-invasion-living-card-game-review/cardbox/]\n\nI simply turned the original box into a holder and cut a bunch of sturdy cardboard to make sections for everything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56431-perfect-card-storage/?do=findComment&comment=557345","commentId":557345,"userName":"Shiv@n","timestamp":1321606405,"content":"www.boardgamegeek.com/filepage/71751/my-dividers-english [http://www.boardgamegeek.com/filepage/71751/my-dividers-english]\n\nMy storage solution... The picture at bottom show the case with an old version of dividers, but the storage solution is the same now...\n\nVery convenient for me, every card is sleeved with dragon shield clear !"}]}