{"url":"https://community.fantasyflightgames.com/topic/56440-wiped-out-with-barely-any-enemies-anywhere/","title":"Wiped Out With Barely Any Enemies Anywhere","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56440-wiped-out-with-barely-any-enemies-anywhere/?do=findComment&comment=557416","commentId":557416,"userName":"Dam the Man","timestamp":1321621393,"content":"And it all started so well llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif] .\n\nLeadership/Tactics (Aragorn, Theodred, Legolas) and Tactics/Spirit (Eowyn, Gimli, Thalin) decks vs Emyn Muil. I was sitting on 5-0 after the first five plays, honestly hadn't even had any close calls. Odd how another diff 4 quest feels so much easier than other 4s (Anduin 3-3 and HFG 4-2, latter had at least two wins that were narrow as hell).\n\nOn a side note, no, still haven't gotten around to swapping out Thalin for Brand, maybe I should dump Legolas instead from Leadership/Tactics? Ugh, and Boromir is coming when I get Dead Marshes, dump Gimli?\n\nAnyway, everyone quests first turn, Thalin earns his keep by killing Eastern Crows, then Impassable Chasm surges into Driven By Shadow and thanks to Eowyn, actually get one progress on the quest card, all that's needed. Travel to Amon Lhaw, ready to clear it, Faramir arrives turn two. And whammo, another Impassable Chasm drops Amon Lhaw out of active location spot and back to staging area followed by Rockslide. Everyone takes a hit, travel to Lhaw again. Turn three, it's basically game over, Rockslide again, killing Eowyn, Thalin, Theodred. Ironically, these same two decks were involved in the turn one loss vs Rhosgobel as Exhaustion + Festering Wounds killed the smae three heroes.\n\nEncounter deck keeps dropping locations, even Faramir + ton of allies isn't enough to make progress even on Amon Lhaw, so no clearing -> staging area keeps getting more and more cluttered. When finally manage three tokens, bam, Treachery that clears all progress from locations is drawn, along with more locations. No Enemies means Legolas is a wasted willpower 1 even with him questing. I think the end came on turn 9 or 10 (total of 22 cards drawn from the Encounter deck) as Necromancer's Reach kills Aragorn, Gimli and a few allies. Orc Horse Thieves was the second card, but the game was decided even before they were drawn, 20+ threat in the staging area, not even 10 willpower total, threat 44 for both.\n\nTallying up after the game, 22 cards from the Encounter deck were 11 Treachery, 8 locations (+2 from setup), 1 Eastern Crowsenfadado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/enfadado.gif](plus the Orc Horse Thieves) .\n\nOnly one of the five wins featured Northern Trackers in any real form, game before this one managed to get two of them out, other wins were sans NTs."}]}