{"url":"https://community.fantasyflightgames.com/topic/56482-random-card-idea/","title":"Random Card Idea","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56482-random-card-idea/?do=findComment&comment=557785","commentId":557785,"userName":"Grimbob","timestamp":1321727125,"content":"not sure if there is a card like this out, but  had an idea for a spirit card today\n\ncourage in unlikely places, cost: 1, effect: target ally counts as a hero until the end of the round. \n\nbasically it would allow an ally to benefit from effects that target heroes only (daughter of nimrodel, common cause, etc.) or soak damage from undefended enemies. because of the time limitation it would make attaching items wasteful in general. let me know what u think.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56482-random-card-idea/?do=findComment&comment=557860","commentId":557860,"userName":"Mighty Jim 83","timestamp":1321757728,"content":" Like the idea.\n\nFirst instinct is that it might be too cheap, but not really sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56482-random-card-idea/?do=findComment&comment=557905","commentId":557905,"userName":"Shiv@n","timestamp":1321773693,"content":"A song could promote an ally to a hero too... So you can collect ressources, benefits from other \"hero only\" attachment on him..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56482-random-card-idea/?do=findComment&comment=558067","commentId":558067,"userName":"Grimbob","timestamp":1321815959,"content":"i thought about that too. my opinion that having a permanent fourth hero for resource generation could be broken. i figured an event would be temporary so it require some coordination to gain the benefits, or maybe even limiting it to just dunedain, gondor, or hobbits. I also thought thematically it would also make sense, maybe showing our allies \"stepping up\" or making a sacrifice during a needed occasion but not necessarily becoming leaders. however i do like the idea of more songs, and I would like to eventually see minstrels or musicians in each sphere."}]}