{"url":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/","title":"Cards are curved - unable to mix them","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=557783","commentId":557783,"userName":"leptokurt","timestamp":1321726281,"content":"This might sound a bit strange, but today I got Rhosgobel and played it a few times. My first impression was that the Rhosgobel cards felt strange in my hand when I sorted them into the encounter deck. I didn't think too much about it, but when in my fourth game I only managed to win because I drew three Athelas in a row I became curious. I mixed the encounter deck thoroughly and looked at the order of the cards afterwards. At the bottom of the deck I foun 12 Rhosgobel cards in a row, in the middle was a block of 8 and at the top a block of 4 cards. I mixed the deck again with a similar result. After 15 minutes of mixing the deck I still wasn't able to separate these blocks - they sometimes even grew bigger. Then I mixed my cards the poker way and it was roughl ok. Then I mixed it again in my usual way and again I had those blocks. Apparently I was sorting the cards instead of mixing them. Very frustrating!\n\nI didn't have these problems with HfG and Carrock. Like I said, I feel the Rhosgobel cards are curved in one direction, whilst my other cards are sightly curved into the other direction - which apparently prevents them from being seperated.\n\n \n\nMy question is if someone had the same problem and how they solved it. I'm not a friend of sleeves, mainly because I think that it's harder to mix sleeves cards. Now I think about buying some, but I wanted to know if mixing is indeed a problem with sleeved cards.\n\nOr is there a way to \"straighten\" the curved cards without destroying them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=557784","commentId":557784,"userName":"Eryx_UK","timestamp":1321726428,"content":"I've never had a problem with sleeves on cards other the first few times you shuffle them.\n\nI'm not quite sure what you mean by your cards being curved though. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=557788","commentId":557788,"userName":"leptokurt","timestamp":1321727972,"content":"The_Big_Show said:\n\nI've never had a problem with sleeves on cards other the first few times you shuffle them.\n\nI'm not quite sure what you mean by your cards being curved though. \n\n\n\n \n\nNot sure if I used the right word  - I'm German.\n\nCurved, bent, buckled...?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=557834","commentId":557834,"userName":"Kiwina","timestamp":1321747949,"content":"You used the right word.  I've had that same issue when mixing two different decks of playing cards, but never with any of the LotR cards.  Although, I have been putting all my LotR cards into penny sleeves, and I think I started doing that before JtR.  I haven't had any issues with shuffling, but the sleeves might be helping with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=557945","commentId":557945,"userName":"conykchameleon","timestamp":1321785853,"content":"One way that might help to uncurve them is to put the stack of them on table with the curve facing down so that there will be a slight gap between the cards and the table. And put a bunch of heavy books on top of them. This probably won't fix it 100%, but it definitely won't harm your cards. Good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=558051","commentId":558051,"userName":"leptokurt","timestamp":1321810509,"content":"conykchameleon said:\n\nOne way that might help to uncurve them is to put the stack of them on table with the curve facing down so that there will be a slight gap between the cards and the table. And put a bunch of heavy books on top of them. This probably won't fix it 100%, but it definitely won't harm your cards. Good luck!\n\n\n\n \n\nYeah, I tried that last night with three of George Martin's ASOIF books. The cards look better, so I ill do the same this night and hope for the best.\n\n \n\nBtw, can the German fellows tell me where I can get those sleeves? Do they sell them at stores like Karstadt or should I better visit a Gameshop?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=558057","commentId":558057,"userName":"Klaen","timestamp":1321811826,"content":"Putting your cards into plastic sleeves will definately help resolve thsi problem.\n\nWhilst a slight added expense, sleeves will help make your cards last a very long time in mint condition.\n\nThese days I find the thought of shuffling any gaming related cards without sleeves akin to blasphemy!\n\nI have even purchased the cute little 'board-game' sized card sleeves for the cards in Middle Earth Quest as well.\n\nFantasy Flight supply make some of the best quality sleeves on the market at the moment IMO, but I am a self confessed FFG fanboy and a little bias these days.\n\nUltra-pro are ok for a cheaper but poorer quality option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=558160","commentId":558160,"userName":"OnkelZorni","timestamp":1321844451,"content":"leptokurt said:\n\n \n\nBtw, can the German fellows tell me where I can get those sleeves? Do they sell them at stores like Karstadt or should I better visit a Gameshop?\n\n\n\n \n\nYou should be able to find sleeves in (well-sortet) gamestores, but if you live in a small town like me, you'll probably have to order them online or take a trip to the nearest city.\n\nbtw i don't use sleeves, I made the experience that they get quite sticky over the time"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=559119","commentId":559119,"userName":"Skowza","timestamp":1321995008,"content":"Klaen said:\n\nThese days I find the thought of shuffling any gaming related cards without sleeves akin to blasphemy!\n\n\n\nQFT!  I don't know why so many people on these forums don't like sleeves...\n\nKlaen said:\n\n\nFantasy Flight supply make some of the best quality sleeves on the market at the moment IMO, but I am a self confessed FFG fanboy and a little bias these days.\n\n \n\nUltra-pro are ok for a cheaper but poorer quality option.\n\n\n\nI've always been a big fan of Ultra-Pro, are FFG sleeves really that much better?\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=559232","commentId":559232,"userName":"jhaelen","timestamp":1322019712,"content":"Skowza said:\n\n \n\nI've always been a big fan of Ultra-Pro, are FFG sleeves really that much better?\n\nWell, I prefer the Ultra-Pro sleeves. The FFG sleeves are too smooth for my taste. But obviously, YMMV gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=559253","commentId":559253,"userName":"Xealous","timestamp":1322023364,"content":"These cards are noticably thinner than most card games I have experienced, although printed on perhaps longer lasting linen card. I had the joy of opening my first core box yesterday and the last of the cards were already warping as I found emergency sleeves from old card collections. I think the warping is a product of temperature and humidity, once sleeved they are rather resilient to this. I will definately be purchasing higher grade backed sleeves to keep all my lotr cards safe n sound for years to come.\n\nAnyone experiencing sticky sleeves, these are likely to contain pvc...I sleeved my 7 wonders set in these initially and it become unplayable :/ Look for NO PVC sleeves always is my advice for a start :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI would prefer the tactile and traditional feel of the cards, certainly with the overwheling theme in this game, but its sad to see the linen print cards are prone to warping due to the card stock used. A decision FFG can hardly go back on now :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] unless they perhaps released a hugh premium master sets, ie for the core set (x3 of each cards) ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=559287","commentId":559287,"userName":"Spleen","timestamp":1322033406,"content":"@conykchameleon: I bought my sleeves via amazon.\n\nBest Regards from Paderborn (Germany)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=559291","commentId":559291,"userName":"Feqz","timestamp":1322035347,"content":"@ieptokurt: at Karstadt you might face problems. I wouldn't expect them to offer card sleeves for games like LotR. If they do it'd mostly be poor quality. First address should be your friendly local gaming store. If you lack one, look for gaming stores who sell via the internet. There are quite a few in Germany.\n\nFeel free to PM me if you have questions on german online stores or sleeve types (bei Fragen einfach eine kurze PM an mich)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56481-cards-are-curved-unable-to-mix-them/?do=findComment&comment=559496","commentId":559496,"userName":"leptokurt","timestamp":1322059828,"content":"Thanks everyone for your help. We have a gameshop in my town, and I plan a visit ASAP. Although I could use my Rhosgobel deck as a magic trick - I will shuffle the cards ten times aaaaaaaaand\n\n \n\n* drumroll *\n\n \n\nlook at me, two \"Exhaustion\" cards in a row. No joke, it really gets annoying."}]}