{"url":"https://community.fantasyflightgames.com/topic/56531-victory-at-osgiliathwith-hobbits/","title":"Victory at Osgiliath...with Hobbits?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56531-victory-at-osgiliathwith-hobbits/?do=findComment&comment=558077","commentId":558077,"userName":"Grimbob","timestamp":1321817222,"content":"i played a solo game of osgiliath earlier this week and i've been using a tri-sphere deck lately with boromir-frodo-bilbo for both solo and multi-player. to my surprise i actually was able to defeat it with a final threat of 36 including the death of the witch king. wasnt keeping track of the turns, but i had to shuffle the encounter deck once. this is the first time i defeated osgiliath solo. i used tons of spirit cancels, northern trackers, galadrim's greetings (no surprise there), and fast hitches for the hobbits. im interested to know how have other ppl defeated this difficult scenario, solo or otherwise?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56531-victory-at-osgiliathwith-hobbits/?do=findComment&comment=558805","commentId":558805,"userName":"lleimmoen","timestamp":1321955743,"content":"As I posted, I have defeated it regularly - more than I lost to it - with a Rohan deck (Dunhere, Eowyn, Theodred). I have not defeated it with any other deck solo. I have only once defeated it in a coop. I find it very difficult to beat it with any other strategy but the one that Rohan uses: keep threat low at the start and get rid of the enemies (except Snaga) with Dunhere. Sometimes I kill the Witch-king too, if I collect more than 1 Sneak Attack along the way and combine it with Gandalf, but that is both rare and often unneccessary. In coop we struggle because the other deck has a hard time keeping the threat below 27 for more than one turn (and sometimes not even that). Also the encounters turn much more deadly in coop, I feel, surging and dooming more often. In solo, Elfhelm can really help with doomed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56531-victory-at-osgiliathwith-hobbits/?do=findComment&comment=559112","commentId":559112,"userName":"Skowza","timestamp":1321994503,"content":"We've only played it once b/c I just got it about a week ago... we won a 4-player game with the following hero combos (I think):\n\nGloin + Frodo + Eleanor (me)\nAragorn + Eowyn + Dunhere\nLegolas + Imrahil + Theodred\nBrand + Beravor + Bilbo\n\nHow much of a win can be attriubted to luck, and how much is good deckbuilding?  I think part of it was luck; we did get 2 Unexpected Courage on Beravor, one on the first turn.  We also got lucky in that we got Steward of Gondor, Self Preservation, and Citadel Plates on Gloin and I kept drawing Parting Gifts, which allowed him to pass off about 25 resources to those who needed them, one turn I played multiple Snowbourne Scouts to clear out a really awful location (Emyn Arnen Overlook) which had multiple Ancient Mathoms on it.  We did kill the Witch-king almost as soon as he came out with a Gandalf Sneak Attack + Infighting.  Forest Snare + Infighting is becoming a go-to combo for us, and boy did we use a lot of Galadhrim's Greetings...  \nI have no idea what our scores were, I wish we had kept track.  We kind of assumed \"Oh god, oh god, we're all gonna die\" at the beginning so we didn't bother."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56531-victory-at-osgiliathwith-hobbits/?do=findComment&comment=559130","commentId":559130,"userName":"Bohemond2","timestamp":1321998180,"content":"Despite the many difficulties the scenario presents, it has no direct damage.  As a consequence, certain strategies and heroes which can struggle when faced by Exhaustion, Necromancer's Reach, Rockslide, and similar cards can shine against Osgiliath.  Bilbo would be a great example of a hero who matches up very well with the scenario.  Boromir is another, since he helps \"solve\" the potentially horrible first turn."}]}