{"url":"https://community.fantasyflightgames.com/topic/56542-some-info-please/","title":"some info please","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=558184","commentId":558184,"userName":"monk","timestamp":1321847377,"content":"Looking at buying this as I like the idea of solo/co-op play. However, I have read that the game is very hard solo, is this true? Also, can all expansion quests be played solo and are they also difficult in solo play?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=558197","commentId":558197,"userName":"gobliin","timestamp":1321848888,"content":"I played the game mostly solo and it is true that it is very hard and you need some specific cards to succeed, but this is mostly because the card pool is low for now. Even if I didn't win a lot of games, I always feel that I might have a chance to succeed.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=558230","commentId":558230,"userName":"guciomir","timestamp":1321858509,"content":"Casual players will tell you that the game is very hard, experienced players will be complaining that they are winning too much. The truth is somewhere in the middle. Give a game a try, buy a core set. If you like it, think about buying expansions.\n\n// edit: so far just one quest is extremaly hard solo (third scenario from core set)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=558323","commentId":558323,"userName":"Puzzle2","timestamp":1321870985,"content":"guciomir said:\n\nCasual players will tell you that the game is very hard, experienced players will be complaining that they are winning too much. The truth is somewhere in the middle. Give a game a try, buy a core set. If you like it, think about buying expansions.\n\n// edit: so far just one quest is extremaly hard solo (third scenario from core set).\n\n\n\nTo echo guciomir it really does depend on the type of gamer you are and whether or not your purpose is for the experience of good thematic gameplay, or to have the highest winning percentage.\n\nAs a strictly solo player, I find that my win percentage is around 50% normally for each quest, but then again I try to create theme decks or weird combos. I know I have said this before, but keep in mind this is a co-op game with the option for solo play, not the other way around. It scales nicely to two people with combos being played with your partners cards, etc.\n\nIf you are a fan of the LORT universe, or simply games with very strong thematic appeal, I would say this is a must have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=558649","commentId":558649,"userName":"jhaelen","timestamp":1321928487,"content":"It depends strongly on how interested you are in deck tuning. Myself I don't care much about it.\n\nYou should also be aware that the game is quite obviously designed around the default assumption of two players.\n\nWithout building / tuning decks, the only quest you'll win consistently is the very first. For all other quests I recommned to use two player decks - even if you're playing solo. Then it's fun and you're likely to win more often than not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=559061","commentId":559061,"userName":"Bohemond2","timestamp":1321987289,"content":"I echo what jhaelen said.  I will also add that I don't think the scenarios in the core deck are particularly interesting well designed (though, most people disagree with me on Anduin), so you need to get into the expansion packs to fully determine how much you like the game.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=559067","commentId":559067,"userName":"USS Daedalus","timestamp":1321987712,"content":"And you still get pummeled into the ground with two decks if you aren't careful. The two decks need to be built with a strict eye for complementing strategies. Of course, just do what I do: make themed decks that suck but sure give you a laugh when Thalin manages to kill off two swarms of bats in a row. Only time he's EVER useful.\n\n \n\nThe adventure packs do make for a great deal more fun because they offer new cards and allow you to use different tactics, although right now it's clear each sphere has one chief tactic:\n\nSpirit: questing strong and relying on Rohan combos\n\nTactics: fighting stuff and hoping for Legolas and Gondolin swords to quest\n\nLeadership: Well rounded, play lots of allies and use them as fodder while heroes quest.\n\nLore: umm.. sucks on it's own but absolutely vital as a backup"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=559080","commentId":559080,"userName":"Bohemond2","timestamp":1321988724,"content":"I disagree on lore.  I think it has, top to bottom, the best allies in the game.  It may have been weak in core, but it is quite strong at this point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=559111","commentId":559111,"userName":"gatharion","timestamp":1321994495,"content":"Some of the expansion packs can be pretty easy in solo play. The Hunt for Gollum, The Hills of Emyn Muil, and The Dead Marshes I all beat first time through with solo play. (Although, the Dead Marshes was a very close call and a I failed my second time through with the same deck.)\n\nSome of the expansions I consider nigh impossible in solo play; specifically Conflict at the Carrock and Journey to Rhosgobel. Other players find them easier, but said players tend to buy multiple core sets and finely tune their decks for dealing with those specific quests.\n\n \n\nBohemond said:\n\nI disagree on lore.  I think it has, top to bottom, the best allies in the game.  It may have been weak in core, but it is quite strong at this point.\n\n\n\nYeah, it does have a large \"support' roll, but even so, I feel like my lore-centric deck is currently my most well-balanced deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=559114","commentId":559114,"userName":"Beast Rabban","timestamp":1321994690,"content":"USS Daedalus said:\n\nLore: umm.. sucks on it's own but absolutely vital as a backup\n\n\n\nYou must be kidding. My Lore deck is by far the most powerful solo deck I have. The allies have some of the best abilities in the game and the attachments are awesome. Throw in a splash of spirit and its brilliant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=559187","commentId":559187,"userName":"Trantor3","timestamp":1322009722,"content":"Bohemond said:\n\nI echo what jhaelen said.  I will also add that I don't think the scenarios in the core deck are particularly interesting well designed (though, most people disagree with me on Anduin), so you need to get into the expansion packs to fully determine how much you like the game..\n\n\n\nI disagree with this. I think the quests in the Core Set (especially Anduin and Dol Guldur) feature by far the most interesting ideas and mechanics. They do scale badly, but that is their only fault in my eyes. A lot of the expansion packs feature very dull quests in my opinion. Emyn Muil is simply collecting location cards, and Dead Marshes is just terribly designed with regards to losing Gollum. Finding him again can take HOURS of boredom. Also, a lot of the cards suddenly don't really make sense anymore once Gollum is gone.\n\nMy advice would be: If the Core Set doesn't convince you, don't bother with the expansion packs. You get more variety in the quests and of course can really only start deck-building with a few expansion packs. But the Core Set should leave you with the feeling of \"I want more of this!\", or the expansion packs won't be worthwhile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=560465","commentId":560465,"userName":"USS Daedalus","timestamp":1322309120,"content":"Haters gonna hate, but I still think Lore is weak. Well, any advice on how to make it a useable deck on it's own?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=560478","commentId":560478,"userName":"Mighty Jim 83","timestamp":1322312980,"content":" I'm not convinced by Lore 1-player mono-sphere: not saying it can't be done, just that it can't access some of its best options.\n\nThere are some really good Lore allies - mostly elves, but many are best for multi-player (i.e Haldir - ranged/Sentinel) or very expensive - Haldir, Gildor, etc. Combined with Leadership for the extra resource generation, it's pretty good, and some of the high-cost event cards can start to kick in - obviously gildor's counsel only works multi-player, but the options for extra draw work well with any leadership resource generation, and there are some great combos if you can pull them off - Gloin + self-preservation (maybe with a song of wisdom and a burning brand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56542-some-info-please/?do=findComment&comment=560482","commentId":560482,"userName":"starhawk77","timestamp":1322314455,"content":"USS Daedalus said:\n\nHaters gonna hate, but I still think Lore is weak. Well, any advice on how to make it a useable deck on it's own?\n\n \n\n\n\nQuesting can be a bit of an issue if you aren't using Glorfindel. Longbeard Map-Maker is really useful in this department; between its ability and Protector of Lorien, a mono-Lore deck can usually muster plenty of Willpower. Damage output isn't great, although Haldir of Lorien, Gildor Inglorion, and Mirkwood Runner have given Lore more ways to put the hurt on enemies. Other than that, Lore offers great card draw, healing, and defensive abilities. I usually use Glorfindel, Bilbo, and Denethor for a solo deck, and it works quite well for most scenarios. "}]}