{"url":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/","title":"3 to 4 player game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/?do=findComment&comment=559613","commentId":559613,"userName":"thedarkelf007","timestamp":1322071824,"content":" Hi All,\n\nHaving just bought the Introductory game, I am happy with the play style.\n\nI am a little curious at how to play 3-4 players. It suggests using another starter set, but what from the 2nd start set do you need to use?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/?do=findComment&comment=559645","commentId":559645,"userName":"marlow4","timestamp":1322076665,"content":"thedarkelf007 said:\n\n \n\n Hi All,\n\nHaving just bought the Introductory game, I am happy with the play style.\n\nI am a little curious at how to play 3-4 players. It suggests using another starter set, but what from the 2nd start set do you need to use?\n\n \n\n \n\nIt is suggested that you buy a second Core Set for the extra two threat counters pretty much. You can play 4 player games with one Core Set. Just use a piece of paper or dice or something to keep track of threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/?do=findComment&comment=559648","commentId":559648,"userName":"thedarkelf007","timestamp":1322077361,"content":" thanks, I intend to buy some of the expansions, but didn't want to buy another starter just for the threat counters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/?do=findComment&comment=559689","commentId":559689,"userName":"juicebox","timestamp":1322092211,"content":"Hi thedarkelf007,\n\nIf you are interested in playing with Tournament legal decks, you'll need a minimum of 50 cards per deck.  With several Adventure Packs, you'll eventually be at a point where you could play a 3 or 4 player game with each person wielding a 50 card deck, but purchasing a second Core Set will sure get you there a lot quicker. Of course, there's nothing stopping you from playing with fewer cards, but it seems the game was designed with a 50 card deck in mind. So, while the threat trackers are pretty sweet, they are not the only reason for picking up a second copy, as purchasing a second Core Set will also substantially boost your deck building flexibility right off the bat.\n\nThat said, the Khazad Dûm big box expansion (first big box expansion to be released for the game) is going to be released soon. So, with a little patience, you could pick that up and have a lot more cards available for deck building. After that comes out, if you purchase it (along with whatever Adventure Packs you pick up), if you find you are regularly playing with 3 or 4 players and still having trouble building satisfying 50 card decks for each player, you might want to reconsider a second Core Set.\n\nHope that helps. Welcome to the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/?do=findComment&comment=559991","commentId":559991,"userName":"thedarkelf007","timestamp":1322160273,"content":"I think I will wait for the new expansion and add a few of the smaller ones before I buy another starter.\n\nIt helps I have a local convention on next month and I can shop through all the game stalls :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThanks for the advice.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/?do=findComment&comment=560005","commentId":560005,"userName":"Beast Rabban","timestamp":1322167836,"content":"The main reason to get extra starter sets is to get multiples of some of the cards that you only get one or two of ina starter. If you are just a casual player then there is no real need."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56706-3-to-4-player-game/?do=findComment&comment=561721","commentId":561721,"userName":"Zjb12","timestamp":1322576843,"content":" Beast Rabban is probably right.  Outside of the extra threat counters, getting a second set would mostly seem to be about getting extra copies of various cards you really like and many people want to use, I.e, gandalf.  We play three players very often and the easier quests are not too much of a problem with 1 core set and the first four expansions, which is what we have.   There are definitely enough cards.  There are some cards, like gandalf, that would be esp. Helpful to have more of in the harder level 6-7 rated quests.  I am torn.  Last night I realized a second core set could've helpful, but with so many aps and the expansion on the way, not sure if I should bother or not."}]}