{"url":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/","title":"Silvan Tracker","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560072","commentId":560072,"userName":"Mighty Jim 83","timestamp":1322189883,"content":" \"Response: After a Silvan character readies during the refresh phase, heal 1 damage from that character.\"\n\nno requirement to exhaust, no paying of resources. So, does this mean, that for 1 Silvan tracker in play, I can heal a point of damage off of EACH of my Silvan characters in play?\n\nI always knew trackers were the best allies..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560075","commentId":560075,"userName":"LEGA","timestamp":1322190746,"content":"Mighty Jim said:\n\n \"Response: After a Silvan character readies during the refresh phase, heal 1 damage from that character.\"\n\nno requirement to exhaust, no paying of resources. So, does this mean, that for 1 Silvan tracker in play, I can heal a point of damage off of EACH of my Silvan characters in play?\n\nI always knew trackers were the best allies...\n\n\n\nI think yes. And you can heal a point of damage off of each of any player's character in play.\n\nAwesome card for Silvan deck. We have improvements for Rohan, Dwarfs, some Gondor. And this is improvement of Silvan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560082","commentId":560082,"userName":"Dam the Man","timestamp":1322191472,"content":"I went through the cards after getting DM with Silvan Tracker and honestly didn't find too many Silvan characters that would benefit. , Henamarth, Silverlode Archer and Daughter all have 1hp so moot. I think it was really only Haldir and Tracker itself that were the main beneficiaries, Legolas as well, but he doesn't get many wounds if any. Lorien Guide is the last Silvan, but I removed those from decks as soon as I had cards to replace them with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560085","commentId":560085,"userName":"starhawk77","timestamp":1322192407,"content":"Dam said:\n\nI went through the cards after getting DM with Silvan Tracker and honestly didn't find too many Silvan characters that would benefit. , Henamarth, Silverlode Archer and Daughter all have 1hp so moot. I think it was really only Haldir and Tracker itself that were the main beneficiaries, Legolas as well, but he doesn't get many wounds if any. Lorien Guide is the last Silvan, but I removed those from decks as soon as I had cards to replace them with.\n\n\n\nYeah, right now the Silvan Tracker has pretty limited utility due to a dearth of Silvan characters with more than one health. However, it looks like the elves might be a prominent theme in the Dwarrodelf cycle, so the Tracker will only get better. Right now, its best application is probably as a defender able to soak up attacks and heal itself every turn. In fact, if you can get two into play, they will both regenerate two hit points every turn, effectively allowing you to stave off multiple mid-size enemies almost indefinitely. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560163","commentId":560163,"userName":"Bohemond2","timestamp":1322213493,"content":"I have a deck that uses the sylvan tracker with legolas and Song of Mocking.  The song allows you to shunt damage on to legolas, while the tracker heals it.  Between Legolas and Haldir I find the tracker worth playing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560168","commentId":560168,"userName":"Mighty Jim 83","timestamp":1322214631,"content":" Haldir and the Tracker(s) seem the most obvious combination for the moment - Sentinel plus an alternate source of healing.\n\nThink this will really come into its own in Dwarrowdelf though- think we've only seen Noldor previewed so far, but I expect there should be at least one or two Silvan in there somewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560175","commentId":560175,"userName":"Dam the Man","timestamp":1322217361,"content":"For those familiar with Call of Cthulhu LCG, you think LotR might get some card that does something similar to Dutch Courage (+1 Toughness)? +1 hp to all allies perhaps, I could see dwarves getting something like that. If it affected all allies, could boost Tracker up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560317","commentId":560317,"userName":"Beast Rabban","timestamp":1322263046,"content":"There is Mirkwood Runner from RtM as well now. I find the tracker is also perfect to soak up a goblin sniper damage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560451","commentId":560451,"userName":"Narsil0420","timestamp":1322306229,"content":"I love Silvan Tracker. If you get two of them down, they could be great small enemy defenders. Her art is also amazing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56749-silvan-tracker/?do=findComment&comment=560496","commentId":560496,"userName":"The Sil","timestamp":1322318545,"content":"As already mentioned this card will be awesome once more Sylvans with multiple hit points come into play.\n\nRight now I found it very very useful for Rhosgobel. If you can get 2+Trackers and Hadir out, you can scout with them all the time and pretty much laugh at all the \"deal x damage to your characters\" cards in there, which could be dangerous otherwise. Add some Mirkwood Runners for defense or extra questing and maybe a Faramir in there to boost their willpower and you have a very hard to kill scouting and defense party.\n\nBasically everything that deals damage to characters and can be guided onto the tougher Sylvans can be weakened or neutralised with the new trackers."}]}