{"url":"https://community.fantasyflightgames.com/topic/56752-solo-play/","title":"solo play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560150","commentId":560150,"userName":"monk","timestamp":1322209692,"content":"If I bought this game I'd mostly use it for solo play. Is it still worth getting this game as I've been told one of the core game quests is very difficult in solo play.\n\nDo the expansions allow for good solo play games?\n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560153","commentId":560153,"userName":"marlow4","timestamp":1322210481,"content":"monk said:\n\n \n\nIf I bought this game I'd mostly use it for solo play. Is it still worth getting this game as I've been told one of the core game quests is very difficult in solo play.\n\nDo the expansions allow for good solo play games?\n\nThanks\n\n \n\n \n\nSome quests scale better for solo play while others become easier in multi-player. The 3rd scenario in the Core Set is nearly impossible to complete solo simply due to one of the setup mechanics of the scenario (one of your heroes is taken prisoner and while playing solo that is a big handicap to overcome).\n\nIt is also fairly easy to play with two decks while playing solo and just simulate a two-player game. Technically we're not supposed to know what is in each other's hands while playing but that's something most of us don't have a problem overlooking for solo play with two decks.\n\n5 out of 6 of the Adventure Pack scenarios are fine for solo'ing though some are harder than others. The 6th and latest one to come out is pretty tough solo from reports of those who have tried."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560300","commentId":560300,"userName":"Eric W","timestamp":1322250977,"content":"Checkout out week 1 juicebox tournament thread.  Lots of people having solo fun with only core box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560308","commentId":560308,"userName":"DurinIII","timestamp":1322255003,"content":"The answer to your question about solo play worth is a definite YES!  I play about 95% of all my games solo and I have a blast!  Indeed, as has been brought to your attention, some of the quests are nearly impossible to beat in a non-multiplayer game; but I still attempt these quests from time to time, in order to have a real good challenge.  The expansions thus far have provided a very good supply of new scenarios that are surprisingly adaptable to solo and multiplayer.  \n\nWhat I love best about this game is its superb card illustrations and the designers' obvious love for Middle-Earth; they really have created a game in the card format that captures the depth and majesty of Tolkien's beloved world.  Well, enough of me waxing my profound love for the Lord of the Rings and all things Middle Earth.\n\nIn short, yes; buy this game man (at least the core starter if you haven't already) and have fun! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560336","commentId":560336,"userName":"player582283","timestamp":1322270913,"content":"Solo play is viable and fun for almost all the quests.  Try it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560337","commentId":560337,"userName":"guciomir","timestamp":1322271165,"content":"As per my experience, only 3rd quest from core set is extremaly hard solo. All other quests, including 6 expansions have difficulty that vary from easy to hard, but you can beat them all.\n\nAdditionally, as our card pool gets bigger and bigger, we may be soon able to challenge 3rd core quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560370","commentId":560370,"userName":"Mighty Jim 83","timestamp":1322282854,"content":"one of the quests - massing at Osgiliath is probably harder with more players (not tried it solo yet admittedly) - there's definitely scope for this as a solo-only game\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56752-solo-play/?do=findComment&comment=560603","commentId":560603,"userName":"Zjb12","timestamp":1322346647,"content":" The first 2 of the core set quests are doable solo.  3rd seems like it should be possible, but haven't cracked it yet.  The first expansion is possible.  The second is pretty tough, but with the right mix can be overcome.  "}]}