{"url":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/","title":"So - Best mirkwood AP?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/?do=findComment&comment=560120","commentId":560120,"userName":"koraldon","timestamp":1322201293,"content":"Well got some extra funds and thinking to get one AP from the mirkwood cycle - which one is best?\n\nI play 60% solo, 40% two player, very rare more than that.\n\nWould like a decent quest & decent player's cards - not planning on getting additional AP from this cycle (do plan on khazad-dum) ... so no rohan/eagle synergies.\n\nWhat is your pick?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/?do=findComment&comment=560127","commentId":560127,"userName":"marlow4","timestamp":1322202901,"content":"I think it's pretty much impossible to avoid Rohan and Eagles oriented cards out of this cycle since that's pretty much what Tactics and Spirit got out of each pack.\n\nReturn to Mirkwood is the most challenging quest to solo according to what others are reporting.\n\nHills of Emyn Muil is consider by many to be the least interesting/exciting of the cycle.\n\nJourney to Rhosgobel contains some enemies that require Eagle characters or characters with Ranged in order to deal with them.\n\n \n\nI just think you're really limiting your card pool by only getting one pack. This isn't like the other LCGs where all of the cards are player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/?do=findComment&comment=560157","commentId":560157,"userName":"starhawk77","timestamp":1322211569,"content":" I enjoy them all, so it's a bit hard to pick one. Given your criteria, though, I'd recommend either Conflict at the Carrock or The Dead Marshes.\n\nConflict at the Carrock has a solid hero (Frodo) and some pretty decent player cards. The quest is fun and involves a showdown with four monstrous trolls. It can be pretty tough on a solo player, but it's quite entertaining if you're up for a challenge.\n\nThe Dead Marshes has an awesome hero (Boromir) and generally very good player cards. The scenario adds an interesting Escape mechanic and revolves around keeping an objective card in play, so it will be quite different from the other quests you've played. On the other hand, it can be a very frustrating and arduous process should Gollum ever actually escape, so that might diminish the enjoyability of the scenario.\n\nEither one would be a good option. If pressed, I'd probably favor The Dead Marshes, but both packs have a lot to offer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/?do=findComment&comment=560530","commentId":560530,"userName":"Trantor3","timestamp":1322326130,"content":"Conflict at the Carrock is, for me, the most interesting quest by far. I'd avoid the Dead Marshes, that one is terribly designed (though it does feature some good player cards). Also, Hills of Emyn Muil is pretty dull."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/?do=findComment&comment=560534","commentId":560534,"userName":"Shelfwear","timestamp":1322327280,"content":"Carrock, Rhosgobel and Return to Mirkwood are the most interesting and challenging ones (but solo they are very difficult, so that might frustrate you).\n\nDead Marshes and Emin Muil are a bit dull (heavy questing, less fights)\n\nHunt for Gollum is somewhere in the middle, some people like it, some not\n\nHave you thought of chosing the AP on base of the player cards included instead of the quest? The card pool is very limited without the AP player cards, maybe you should decide to focus on one or two spheres you wanna play and buy the APs that include good cards for these spheres?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/?do=findComment&comment=560545","commentId":560545,"userName":"Kiwina","timestamp":1322329203,"content":"Shelfwear makes a good point.  Are you buying the AP for the quest or the player cards?  If it's just for the quest I'd recommend Hunt for Gollum.  Rhosgobel is a very different kind of quest from the core quests.  It is okay for solo or two player games, but it almost requires you to play with Lore cards.  Return to Mirkwood is practically unbeatable if you are playing solo.\n\nIf player cards are also important to you then I'd look at the different cards you get in each AP, and make a decision from there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56750-so-best-mirkwood-ap/?do=findComment&comment=560618","commentId":560618,"userName":"koraldon","timestamp":1322351906,"content":"Hi,\n\nThanks for the Advice, at the end I got CatC, which seems also to have nice player's card - and frodo."}]}