{"url":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/","title":"Fleeing to victory!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560381","commentId":560381,"userName":"zeb","timestamp":1322287888,"content":"Hi,\n\n \n\nI was replaying Passage to Mirkwood solo yesterday. Using the leadership heroes and only the core set cards, things looked good until the start of the 3rd quest (where I needed 10 progress tokens to win, as long as there is no Ugoliant's Spawn in play). I got two heroes caught in a web (I forgot I could stack two caught cards on the same heroes), meaning only Aragorn was being readied for free during the refresh payment. Shortly, I got 4 strong enemies engaged against me, and would probably be shortly defeated as I could not put too much resource into combat. However, I had three allies: Faramir, a Dwarf with 2 will power and another 1-will power ally.\n\nI just took a bet: that Ugoliant's Spawn would not appear, committed all available characters to the quest (I had been able to pay 2 resources for one of my \"caught in a web\" hero), except for Faramir. Instead I used his action, allowing +1 to all committed characters. The staging card was a minor foe with low threat, meaning that I finally got more than 10 progress points, and was able to finish the 3rd quest at once.\n\nDoes the game end in a victory, even if my characters are still engaged with 4 or 5 enemies? Thematically, that could mean they flew and exited the passage into safety. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560407","commentId":560407,"userName":"lleimmoen","timestamp":1322298694,"content":"Yes it ends so. And seems right thematicaly as you described it. The only dwarf ally with 2 willpower is Brok, however, and you really play that guy? :]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560408","commentId":560408,"userName":"starhawk77","timestamp":1322298900,"content":"  In this case, yes. Beorn's Path reads \"If the players defeat this stage, they have won the game.\" So, as soon as you place the tenth progress token on the quest card, you immediately win (unless Ungoliant's Spawn is in play, of course). Sounds like you survived fair and square against some pretty steep odds. A number of scenarios can create this feeling of a desperate flight to safety, which is plenty thematic.\n\nAlso, kudos for paying Brok's entire cost. That right there should be worth about 5 victory points lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560466","commentId":560466,"userName":"gatharion","timestamp":1322309390,"content":" Brok get's a bad rap. I've played numerous games where I end up with extra resources sitting on a Leadership hero. Of course, I don't play with three copies of Gandalf in every deck.\n\nHe's not a *good* card, but he's no where near as useless as people like to say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560521","commentId":560521,"userName":"Trantor3","timestamp":1322323658,"content":"This is basically the default way to win Escape from Dol Guldur. Once you come to stage 3 of that quest, simply quest with everybody and escape in that one turn. So yes, it's totally legitimate unless the quest card says you can't finish the quest when there are still enemies around.\n\nAbout Brok: He isn't exactly bad, he is just too expensive for his stats. His special ability is useless because you are in deep, deep trouble if you ever need to use it. Compare his stats with Gildor Inglorion or Beorn (and his useful abiltiy!), and it's easy to see why nobody likes him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560680","commentId":560680,"userName":"zeb","timestamp":1322369409,"content":"Thank you for your answers.\n\nIndeed I played Brok, because I realised early I would not be able to sustain so many enemies with two of my heroes handicapped by the web effect. I had accumulated many resource tokens and thought that in addition to Faramir's Action, Brok would substantially add to quest commitment. I was right (and lucky that Ugolian's Spawn did not appear, because in that case I would have been in a very serious trouble and probably lost the game).\n\nWhat is interesting with this game is that an ally like Brok, who can seem useless at first glance because of his high price, may become determinant in winning a quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560693","commentId":560693,"userName":"zeb","timestamp":1322374380,"content":"Besides, I just realised that the best way to play \"Caught in a web\" was to attach them to Aragorn, as he has an alternative way to refresh. Still learning the strategies here!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56787-fleeing-to-victory/?do=findComment&comment=560956","commentId":560956,"userName":"Skowza","timestamp":1322431350,"content":"About Brok... he can combo with Landroval and come into play for free before using Landroval's response to return the hero to play, right?  Kind of a desperate and unlikely combo, but its legal isn't it?"}]}