{"url":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/","title":"The juicebox LOTR LCG 2 Player Tournament (#1) [December &#039;11] [COMPLETED]","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=560620","commentId":560620,"userName":"juicebox","timestamp":1322352415,"content":"Welcome & Introduction:\n\nWelcome to what has evolved into an extended edition of my first LOTR LCG 2 Player Tournament. After some thoughtful discussion (see the first 2 pages of posts to this thread) the idea for hosting a LOTR LCG 2 Player Tournament has grown from the confines of what was a weeklong affair to a month long extravaganza.\n\nThe idea behind this is that for one month (December ’11 - with the days beginning from November 27th grandfathered into this particular tournament), everyone is invited to participate in playing a particular quest with particular deck building requirements in a 2 Player Tournament. You are then invited to record and post your final score, the heroes used, specifics on deck building components, and any additional narrative you’d like to add.\n\nNote: this is not a place to post results from the past. The tournament has a one-month lifespan, and only games played and recorded throughout this month are valid. As the month unfolds, I will keep this first post updated with the Top Ten results. (Each participant can occupy a maximum of one Top Ten spot at a time, so you’re welcome to try and best your own result throughout the month.) See also, The juicebox LOTR LCG Top Ten Hall of Fame [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=582954].\n\nWill you place in the final Top Ten? I hope you’ll participate and find out!\n\nAfter the end of this month’s tournament, you are welcome to continue to post results to this thread if you continue to play this particular quest under these particular parameters. However, the Top Ten on this first post will not continue to be updated after the month is over, thus preserving (like a time capsule) the results from this 2 Player tournament. Further, please refrain from using this thread for extensive theorizing and/or conversation that is not directly related to this particular tournament. Nothing against other conversations – it’s just, that’s what other threads are for. Specifically, if you have ideas for a future tournament of the month, feel free to suggest them in the Ideas Thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=579104].\n\nAnd now… on to this month’s 2 Player Tournament!\n\n2 Player Tournament #1:\n\nQuest: Escape from Dol Guldur\nDeck Parameters: 1-3 Core Sets + Up to 1 Adventure Pack of Your Choice*\nNumber of Players: 2 Players\n\n*In deck building for this month’s tournament, each player may use cards from 1-3 copies of the Core Set + up to 1 chosen Adventure Pack per deck. When you post your results, please indicate how many core sets were used in construction and which adventure pack(s) were included (if you included an AP) in each deck. The number of CS/AP included will only matter in the case of needing a tie breaker, with the advantage going to the players who used fewer core sets and/or did not include an adventure pack(s) in deck building. Enjoy this month’s challenge!\n\nTop Ten:\n\n1. muemakan ~ 102 (Éowyn, Glóin, Théodred) & (Bilbo, Beravor, Denethor) [3 CS + HfG & ThoEM]\n2. Narsil0420 ~ 112 (Prince Imrahil, Glóin, Berevor) & (Éowyn, Eleanor, Dúnhere) [1 Core Set + JtR]\n3. Mighty Jim ~ 123 (Aragorn, Théodred, Éowyn) & (Glorfindel, Beravor, Legolas) [2 Core Sets + 1AP]\n4. LEGA ~ 124 (Beravor, Glorfindel, Denethor) & (Aragorn, Prince Imrahil, Éowyn) [1 Core Set + JtR]\n5. juicebox ~ 125 (Aragorn, Théodred, Legolas) & (Éowyn, Beravor, Glorfindel) [1 CS + HfG & CotC]\n6. Fatty ~ 128 (Beravor, Bilbo, Éowyn) & (Legolas, Thalin, Gimli) [3 CS + HfG & CotC]\n7. Chac ~ 174 (Éowyn, Beravor, Denethor) & (Aragorn, Théodred, Dúnhere) [3 Core Sets + HfG]\n8.\n9.\n10.\n\nLast Updated:\n\nJanuary 1, 2012 (1:17am)  [FFG Time]\n\n[This 2 Player tournament will run from November 27 – December 31, 2011 and will officially close at the end of the month (midnight) as time-stamped by the FFG forum time clock.]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561095","commentId":561095,"userName":"Bungo_Underhill","timestamp":1322467353,"content":"Just a quick question to clarify the construction rules.\n\nWhen you say 1-3 coresets +1AP of your choice. Do you mean each player has access to 1-3CS +1AP of their choice, or is there just one pool of cards from which both decks must be constructed?\nIf each player gets their own pool of cards, can they choose different Adventure packs, or do they both have to use the same one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561172","commentId":561172,"userName":"juicebox","timestamp":1322480174,"content":"Bungo_Underhill said:\n\nJust a quick question to clarify the construction rules.\n\nWhen you say 1-3 coresets +1AP of your choice. Do you mean each player has access to 1-3CS +1AP of their choice, or is there just one pool of cards from which both decks must be constructed?\nIf each player gets their own pool of cards, can they choose different Adventure packs, or do they both have to use the same one?\n\n\n\nHi Bungo_Underhill, thanks for the clarifying question.\n\nEach player may use 1-3 Core Sets + 1 Adventure Pack of their choice. So, the chosen AP that is used per deck can be different.\n\n[basically, I want to make this as accessible as possible for those who like to play 2 player games. Theoretically, someone could still compete with just one Core Set and no Adventure Packs shared between 2 players (And, small consolation, will likely win out in the case of a needed tie breaker for doing so). However, if 2 players come together to play, each having constructed their own deck from up to 3 Core Sets and 1 AP of their choice, that's fine too.]\n\nI'll make an attempt at a slight revision above so as to help clarify this further. Let me know if it still seems unclear.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561228","commentId":561228,"userName":"Bungo_Underhill","timestamp":1322488517,"content":" Thanks for clarifying that's what I'd originally assumed, but I didn't want to cheat inadvertently."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561267","commentId":561267,"userName":"leptokurt","timestamp":1322497223,"content":"I have to sit this one out, having no partner to play with. I simulated two 2-player games this afternoon though, using the Rhosgobel AP with Gimli-Legolas-Beravor and Éowyn-Imrahil-Glóin as my hero combos. I lost the first one after a good start, as I wasn't able to play any lore cards (Beravor was captured). The second one was really tough: Gimli was in prison, I had to face a Beastmaster and a Jailer who were soon joined by Ufthak and another Jailer. There also was the Necromancer's Pass right from the beginning which I didn't dare to travel to. Fortunatly I got SoG (but lost it in midgame) and Parting Gifts, which enabled Legolas to play the Citadel Plate (on Glóin) and some allies. A Daughter of the Nimrodel kept healing my heroes, and the leadership sphere pulled out one ally after the other (2 x Orc Slayer, Brok, Faramir), in midgame I finally got a Northern Tracker. Two Snowborn Scouts cleared the Tower Gates, and Èowyn pushed the questing together with Celebrían's Stone. I only had one Gandalf and one Galadrim's Greeting, which is why both threat levels became pretty high, but after drawing two treacheries in a row in stage 2B (2x Necromancer's Reach) I could defeat the remaining enemies, claim the remaining objectives and thus continue to stage 3B and go for the win.\n\nThe result was 167 (9 rounds tallied + 43 threat + 44 threat + 4 damage - 14 VP). Don't know if this is any good, but it might serve as an orientation mark for others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561445","commentId":561445,"userName":"leptokurt","timestamp":1322536964,"content":"Oops, forget about the above result. I forgot the rule about playing only one ally each round. sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]\n\nGood news that today I played according to the rules (same deck as above) and got a 135. Reached the end in round 7, thanks to the fact that 5 out of the 7 first cards were treacheries and that locations only came into play after I played my Northern Tracker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561551","commentId":561551,"userName":"juicebox","timestamp":1322556855,"content":"leptokurt, thanks for the simulation reports!\n\nWhile it's true, that a literal second player is needed for it to be a valid tournament entry, I think it is helpful in terms of creating an orientation mark for others as they take this quest for a spin. As for me, I may end up in the same boat as you. I'm still hoping I'll be able to coordinate time with a buddy this week to try this out and take a stab at placing in this week's tournament, but it certainly is trickier to coordinate than playing solo games.\n\nIn any case, thanks again! And if you do end up teaching someone else the game and squeezing in a valid finish before the end of the week, I'll look forward to posting your score! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561570","commentId":561570,"userName":"plueschi2","timestamp":1322559487,"content":" Why not score leptokurt? I don't find the difference between 2 players and 1 player controlling two decks too important."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561599","commentId":561599,"userName":"leptokurt","timestamp":1322563074,"content":"Well, there is a difference in knowing each others cards. One example for the above game where it really made a difference: Player 2 (me) had Parting Gifts in his hand. Glóin had 4 or 5 resources that could be shifted to another hero. Player 1 (also me) had Citadel Plate, and both threat levels were near 40. In the staging areal loomed some Hummerhorns. That's why player 1 shifted Glóin's resources via Parting Gifts to Legolas who now had enough resources to play the Citadel Plate on Gimli (who just was freed from prison). This way none of my heroes died, and I could even use the Hummerhorn's forced effect to pimp Gimli even more*.\n\nI don't know if this would have worked with two players not being able to communicate about their hand cards.\n\n \n\n* which was really needed, as I revealed Ungoliant's Spawn that round and my threat levels did rise both beyond the 40+ mark. Super-Gimli was now able to kill Ungoliant's Spawn together with Beravor with one single blow, while on the other side player 1 had to face the Nazgul, Dol Guldur Orcs and a 4 point damaged) Dungeon Jailer. Probably one of the mightiest battles I have ever fought in this game (and the only losses I had was one Longbeard Orcslayer against the Nazguk and a Gondorian Spearman against Ungoliant's Spawn).\n\n \n\nEdit:\n\nBtw I had two other successes with scores of 159 and 151. I usually need 7-8 tallied rounds to win, but 6 rounds is apparently doable. 5 rounds is  not impossible, but therefore you'd need a very, very, very lucky card draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561614","commentId":561614,"userName":"plueschi2","timestamp":1322564843,"content":"I totally agree that there is a difference. But I think that it is not worth it to emphasize that difference in the tournaments as this excludes some players like you and me. I don't know, juicebox has to decide how he wants to run everything, but I would prefer the format that allows for more participants (I am obviously biased here).\n\n \n\nAnd while you cannot simulate a single player not knowing the \"other\" players hand, you can allow 2 players more freedom of speech to have everybody on an equal ground. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561849","commentId":561849,"userName":"juicebox","timestamp":1322600836,"content":"This seems like a very worthwhile discussion.\n\nIn general, one of my ideas behind the tournament of the week is that it can help to highlight various ways to enjoy this game and possibly encourage players (including myself) to try playing it in new ways - this includes encouraging players who are used to playing multi-player games to give it a try solo and for those who are used to solo play exclusively to try and share the game with others and give multi-player games a chance.\n\nSpecifically, I do think that there is a distinct enough difference between 2 actual players and 1 player simulating 2 players. However, I'd love to hear others weigh in on this too. For now, since this week's tournament is already almost 3 days in, I'd like to stick with the original intention (2 actual players) and see how it goes. Turn out last week (considering it was the first tournament) was great - I thought. We'll see how this week's tournament goes. If turnout is low, that will demonstrate to me that 2 player tournaments may not be as attractive to players as solo player tournaments (though 2 weeks is hardly a big enough sample size to get a true reading on this).\n\nSo, for now, let's give the 2 (actual) player tournament a chance this week. If you are reading this and you enjoy the idea of a 2 player tournament, you can show that you value it by playing in this week's tournament. If there's a lack of interest this week, and if enough people express the desire for a 2 player tournament in the future that allows for 1 player to control both decks, that will undoubtedly impact future tournament offerings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=561951","commentId":561951,"userName":"Bungo_Underhill","timestamp":1322627942,"content":"I think the issue is with a 2 player specific tournament it is a lot harder just to fit in a game - thats what I was doing with the 1 player one, one game here and there when I had spare time. \n\nI do like playing Two player games as well but those tend to be more organised and formal where me and a freind will get together once or twice a month and play an evening of games.\n\nPerhaps giving a longer time frame for two player tournaments would work netter for people?\n\nYou could even run a 1-player and a 2-player tournament at the same time, give them both a two week time frame but staggerred a week a part?\n\nSo maybe something like\n4th Dec-17th Dec, 1 player Hunt for Gollum\n11th Dec - 24th Dec, 2 player Spiders and Flys (mono sphere decks only)\n18th Dec= 1st Jan, Solo Conflict at the Corrock (no restrictions)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562001","commentId":562001,"userName":"juicebox","timestamp":1322637579,"content":"Bungo_Underhill said:\n\nI think the issue is with a 2 player specific tournament it is a lot harder just to fit in a game - thats what I was doing with the 1 player one, one game here and there when I had spare time. \n\nI do like playing Two player games as well but those tend to be more organised and formal where me and a freind will get together once or twice a month and play an evening of games.\n\nPerhaps giving a longer time frame for two player tournaments would work netter for people?\n\nYou could even run a 1-player and a 2-player tournament at the same time, give them both a two week time frame but staggerred a week a part?\n\nSo maybe something like\n4th Dec-17th Dec, 1 player Hunt for Gollum\n11th Dec - 24th Dec, 2 player Spiders and Flys (mono sphere decks only)\n18th Dec= 1st Jan, Solo Conflict at the Corrock (no restrictions)\n\n\n\nHmmmm... this is sparking some ideas for me, with the possibility of a significant shift. What about this?\n\nA tournament of the week could continue to be run each week that focuses on solo play only, while a tournament of the month (say, literally for the whole month of December) could run concurrently, focusing on 2 player only.\n\nI think it does take more coordination to fit in multi-player games, and spreading the 2 Player tournaments out over a month will give those who play 2 Player (or those who haven't yet but want to give it a go) plenty of chance. Plus, having it run during a calendar month might be easiest for people to remember (rather than it feeling like somewhat random dates). Meanwhile, the weekly tournaments (solo play only) could continue to run every Sunday-Saturday, as those who enjoy playing solo can indeed just fit in a game (or 4 or 5 or 15) here or there throughout the week.\n\nI think this could work. I'd even be glad to create a separate Top Ten Hall of Fame (housed under the same thread) for both the Solo Play (weekly) and the 2 Player (monthly) tournaments.\n\nAnd, if this ends up being the route, this particular tournament (from this week) could be rolled (expanded) into the entire month of December for the first monthly 2 Player tournament, and a NEW tournament of the week #2 could be initiated to begin this coming Sunday.\n\nThoughts on this?\n\n[As a side note... aren't beginnings and the forming of new traditions exciting? The creative process is a delightful thing. To all of you who have lent your voice to this process - thank you. This is fun!]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562008","commentId":562008,"userName":"Bungo_Underhill","timestamp":1322638590,"content":"juicebox said:\n\n\nA tournament of the week could continue to be run each week that focuses on solo play only, while a tournament of the month (say, literally for the whole month of December) could run concurrently, focusing on 2 player only.\n...\nI think this could work. I'd even be glad to create a separate Top Ten Hall of Fame (housed under the same thread) for both the Solo Play (weekly) and the 2 Player (monthly) tournaments.\n\nAnd, if this ends up being the route, this particular tournament (from this week) could be rolled (expanded) into the entire month of December for the first monthly 2 Player tournament, and a NEW tournament of the week #2 could be initiated to begin this coming Sunday.\n\n\nThis gets my Vote!\n\nI might get to participate in some 2-player tournies this way :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIt should also give the two players time to redesign their decks and get back together for multiple attempts ( I know I tried the Solo one with a number of different builds before suceeding)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562115","commentId":562115,"userName":"Mighty Jim 83","timestamp":1322654781,"content":" well, it looks disappointingly like this may have all been in vain, but I'll post my report anyway.\n\nI had a Spirit/Leadership Deck with Aragorn, hoping to draw Celebrian's stone to get a Spirit icon, and Theodred to move resources around. I picked Dead Marshes as my 1 AP, to give song of Battle to the other deck.\n\nPlayer 1 (me) Aragorn, Theodred, Eowyn,\nPlayer 2 Glorfindel, Beravor, Legolas\n\nBeravor was the prisoner.\n\nPretty much a perfect start-hand, Steward of Gondor, unexpected courage, and a Northern Tracker. Put Steward on Eowyn to play unexpected courage on Glorfindel, and gave Eowyn the Theodred resource to play Northern Tracker Round 2.\n\nPretty lucky questing - all the nasties came out as no-effect shadow cards, only 1 enemy per round Aragorn defending, Legolas killing for progress points.\n\nRescued the Prisoner in turn 3 (with Legolas progress) other player had an event to ignore Nazgul's threat in next round, and Gandalf - cleared stage 2 in 1 round (Questing + Legolas killing something) got a second Northern Tracker out on turn 5, and threw everything into questing to win.\n\nFinal score\n\nP1 39 Threat, 4 damage\nP2 39 Threat, 1 damage\n\nsub-total 83\n\nfour rounds completed\n\n123 points\n\ni expect i could play it another 20 times and not get better cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562131","commentId":562131,"userName":"Mighty Jim 83","timestamp":1322657082,"content":" btw - forgot to say - used 2x core sets. think that may have been a tie-breaking piece of information. But only used 1x adventure pack for both the decks, as i hadn't read the thread since the OP\n\nHaving now had time to read the above in more detail, I'd say that I think a month for 2-player seems a very long time. On the other hand for 4 player, once a month would be about as often as i'd be likely to be able to muster the troops.\n\nPerhaps - although it'd be tricky to administer 1 week per player?\n\neither way, I'd be inclined to leave it until the end of the week before changing things- seem to remember a Friday and Saturday rush last week, perhaps even more the case with multi-player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562133","commentId":562133,"userName":"Chac2","timestamp":1322657343,"content":"Hi,\n\n \n\nWe made our first game this afternoon.\n\nUnfortunately we have a hard time beating this quest, with very bad draw during the entire game.\n\n \n\nThe two decks we played were made with a total of 3 core sets and one AP (Hunt for Gollum).\n\nChac : Eowyn, Beravor, Denethor\n\nThomas : Aragorn, Theodred, Dunhere\n\n \n\nFinal score : 174\n\n \n\nRound Markers : 11 (110)\n\nFinal Threat (Chac) : 32\n\nFinal Threat (Thomas) : 31\n\nWounds on Heroes (Chac) : 3\n\nWounds on Heroes (Thomas) : 3\n\nVictory points : 5 (Hummerhorns)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562140","commentId":562140,"userName":"leptokurt","timestamp":1322658054,"content":"Bungo_Underhill said:\n\njuicebox said:\n\n\nA tournament of the week could continue to be run each week that focuses on solo play only, while a tournament of the month (say, literally for the whole month of December) could run concurrently, focusing on 2 player only.\n...\nI think this could work. I'd even be glad to create a separate Top Ten Hall of Fame (housed under the same thread) for both the Solo Play (weekly) and the 2 Player (monthly) tournaments.\n\n \n\nAnd, if this ends up being the route, this particular tournament (from this week) could be rolled (expanded) into the entire month of December for the first monthly 2 Player tournament, and a NEW tournament of the week #2 could be initiated to begin this coming Sunday.\n\n \n\nThis gets my Vote!\n\nI might get to participate in some 2-player tournies this way :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIt should also give the two players time to redesign their decks and get back together for multiple attempts ( I know I tried the Solo one with a number of different builds before suceeding).\n\n\n\n \n\nDito! Sounds good to me.\n\n \n\nOne more thought - t probably would be better to have some breaks between the solo player tournaments. First, I think this way each tournament would get more participants, as no one would get tired after playing x tournaments in a row. Second, tournaments would become more special and prestigious (and you'd have more time to prepare stuff)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562143","commentId":562143,"userName":"leptokurt","timestamp":1322658510,"content":"Mighty Jim said:\n\nPretty lucky questing - all the nasties came out as no-effect shadow cards, only 1 enemy per round Aragorn defending, Legolas killing for progress points.\n\n\n\nWow, congrats! I agree that this is near to the optimum one can get in this game. aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]\n\nI envy you for these card draws though. I think in 7 out of 8 games I always had at least on Jailor sitting on an objective, and only 3 games with a treachery card in the setup. I usually like the Jailors, but if you want to finish this scenario as fast as possible, they really get annoying with their defense of 3!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562230","commentId":562230,"userName":"Scoob4","timestamp":1322671534,"content":"I was going to be lucky and have one member of my play group available to try the tournament this Saturday, but overall monthly is probably what I can put together for 2 player attempts. I really like the idea of weekly solo and monthly 2 player tournaments. That definitely gets my vote."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562237","commentId":562237,"userName":"juicebox","timestamp":1322672249,"content":"To Mighty Jim, Chac, and all others actively participating in attempting to place in this tournament:\n\nFirst of all ~ Mighty Jim, and Chac, nice job!  Each of you, great reports.\n\nSecond, I want to assure you that these scores matter. Even if the time frame for this week's tournament gets extended (even if it becomes a December long tournament) your scores will be grandfathered in, as this tournament formally began on November 27, 2011.\n\nRelated, the primary decisions before me at this time are:\n\n1) Whether to create distinct Top Ten Hall of Fame listings per Tournament (based on number of players).\n\n2) Whether to offer an extended time frame for 2 Player (and/or other multi-player) tournaments (this one included).\n\n3) How to facilitate #2 on this list in a way that will be sustainable and satisfying (for many... it's going to be impossible to please everyone).\n\nI will likely make the decision that will impact this particular tournament (whether to extend the time frame or not) towards the end of this week. At that time I will also announce other decisions (likely in the Ideas Thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=579104]) that will impact future tournaments. In the mean time, feel free to continue to post your thoughts, ideas, and feedback. It is helpful to the process. Further, I can imagine the initial weeks of offering these kinds of tournaments being essential in fine tuning a process that over time will then become more routine and established. So to all of you who have participated so far (in these early days), good stuff!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562365","commentId":562365,"userName":"LEGA","timestamp":1322704923,"content":"Absolutely have no time to play this week, but FYI: I played it with my wife last week and we defeated it with score 154: 7 rounds, 0 victory, 5-7 wounds (I have no log with me now). We used 1 Core set and 1 AP (Rhosgobel).  Infighting was very useful card to defeat Nazgul very quickly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562369","commentId":562369,"userName":"Mighty Jim 83","timestamp":1322707012,"content":" obviously the timing needs to be what suits the majority of people.\n\nOne thing, I would say though - this is a multi-player game that can be played solo, not the other way around - I think it'd be a real shame, if we ended up with 4 solo challenges per month and only 1 multi-player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=562783","commentId":562783,"userName":"juicebox","timestamp":1322778923,"content":"Mighty Jim said:\n\n \n\n obviously the timing needs to be what suits the majority of people.\n\nOne thing, I would say though - this is a multi-player game that can be played solo, not the other way around - I think it'd be a real shame, if we ended up with 4 solo challenges per month and only 1 multi-player.\n\n \n\n \n\nIt's certainly a fair point Mighty Jim. We'll have to see what the community response is like though... see where the \"ideal\" and the \"real\" meet up.\n\nPersonally, I like to host tournaments that enough people have an appetite for to make them both fun and meaningful experiences.\n\nIf, over time, the appetite for multi-player tournaments grow, what is offered in the form of juicebox Tournaments will likely grow to reflect that as well.\n\nI'm looking forward to seeing how the next couple of days play out with this particular tournament (before making an official call whether to extend it or not). From there, I'll announce my plans on the Ideas Thread for how I imagine the foreseeable future (realistically, that means the next couple of months) looking in more general terms for what I'm planning for future events.\n\nOn another note, it sounds like you've got a pretty regular/flexible gaming group going where you are. That sounds awesome (and like something some others on here sure wish they had as well). Sounds pretty enjoyable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=563464","commentId":563464,"userName":"juicebox","timestamp":1322938609,"content":"Well folks... later this evening I'll be posting some thoughts to the Ideas Thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=579104] to help map out my intentions for the next couple months worth of juicebox LOTR LCG Tournaments. In the mean time, I wanted to announce here that I am planning to expand the time frame for this 2 Player tournament.\n\nI'm going to extend this tournament through the month of December.\n\nPresently, one week does not seem like enough time for a Multiplayer Tournament. After trying this out in December, we may find that a month proves too long, but I'm going to try it out and see if we can find the sweet spot for future 2 Player tournaments.\n\nSo, keep at it! After all, Dol Guldur needs escaped!\n\nI'll be revising this thread a bit later tonight too to reflect the cosmetic changes that are happening, but the tournament parameters remain the same.\n\nHope you enjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=563506","commentId":563506,"userName":"juicebox","timestamp":1322950663,"content":"Update Posted. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=563545","commentId":563545,"userName":"Narsil0420","timestamp":1322966690,"content":" Player 1 (me) Prince Imrahil, Gloin, Berevor\nPlayer 2 (my lovely wife) Eowyn, Eleanor, Dunhere\n\nWe used 1 core set and Journey to Rhosgobel as our 1 adventure pack since it had the best cards for the spheres we used plus Imrahil.\n\nBeravor was the prisoner.\n\nI was very discouraged when Beravor was selected as the prisoner but we proceeded anyway. This was our third attempt at the scenario in one evening, the others had early reveals of Ungoliant's Spawn that quickly went downhill.\n\nI got a starting hand that included Steward of Gondor and thanks to Parting Gifts was able to give my Spirit playing wife some extra resources to play Northern Tracker (which didn't actually help that much) and Gandalf. The turn we played Gandalf was awesome because it was the turn that the Nazgul came out. I had  2 Ever Vigilant(s) in my hand so Gandalf put 4 damage on the Nazgul, quested, defended, and attacked! Even with all that we still needed another turn to finish it off. By the end of the game Eowyn had 8 willpower thanks to Celebrian's stone, Dunedain Quest, and Favor, hence our speedy 4 turns to complete the quest.\n\nIt was very fun having this challenge to motivate us. Thanks Juice!\n\nFinal score\n\nP1 32 Threat, 8 damage\nP2 35 Threat, 2 damage\n\nMinus 5 for Hummerhorns (thanks Dunhere!)\n\nfour rounds completed\n\n112 points\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=564042","commentId":564042,"userName":"juicebox","timestamp":1323083937,"content":"Narsil0420 said:\n\nIt was very fun having this challenge to motivate us. Thanks Juice!\n\n\n\nYou're very welcome Narsil0420! gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nAnd, nice result. You're currently top of the table!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=565653","commentId":565653,"userName":"juicebox","timestamp":1323393072,"content":"Just over three weeks remain in this month's 2 Player Tournament!\n\nYour friend lies languishing in the dungeons of the Hill of Sorcery. preocupado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/preocupado.gif]\n\nWill this be your weekend for the great jailbreak adventure?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=566572","commentId":566572,"userName":"LEGA","timestamp":1323660053,"content":"We'd played 2 times on weekends and got 133 and 124! We used 1 Core set and 1 Rhosgobel totally. I played core-lore: Beravor, Grorfindel, Denethor and my lovely wife played Aragorn, Prince Imrahil, Eowyn.\n\nMe: 41 result threat.\n\nWife: 37 threat, 5 wounds.\n\n9 victory points (Jailor, Chieftank).\n\n5 rounds.\n\n= 83 - 9 + 50 = 124."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=567046","commentId":567046,"userName":"juicebox","timestamp":1323768064,"content":"Nice work LEGA! Way to make it onto the board. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=567530","commentId":567530,"userName":"muemakan","timestamp":1323868227,"content":" Finally able to get my brother to play with me.\n\n \n\nEowyn, Eleanor and Gloin ( 3 wounds, 21 threat, 2 core sets+1 AP)\n\nDunhere, Theodred and Aragorn ( 3 wounds, 12 threat, 2 core sets+1 AP)\n\n \n\nTook us 9 rounds and we got 5 victory points.\n\n \n\n124 points total."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=567610","commentId":567610,"userName":"muemakan","timestamp":1323882294,"content":"Yeah, we managed to play a couple more rounds.\n\n \n\nBest score was with:\n\n \n\nDeck 1: Eowyn, Gloin, Theodred    ended with a super threat of 16 and 0 wounds.\n\nDeck 2:  Bilbo, Beravor, Denethor   ended with nicely 19 of threat and also 1 wound.\n\n \n\nWe even managed to kill a trapped Ufthak in our last round…..4 victory points.\n\n \n\n7 rounds\n\n \n\nI had all but 4 cards of my deck in Hand, thanks to 2 Unexpected Courage on my brothers Beravor.\n\nGloin was the game winner………with a superb regenerating flow of resources.\n\nGreen was able to trap Ufthak early in the game ( with help of Theodreds resources that went to Bilbo who had a few near death experiences when a total of 3 Necromancer´s Reach came up in the course of the game.\n\n \n\nWe used 3 core sets. In addition Lore had HfG as AP and Spirit/Leadership had ThoEM.\n\n \n\nTotal Score 102 "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=568403","commentId":568403,"userName":"silverhand77","timestamp":1324056852,"content":"If anyone anywhere wants to play in this tournament, but doesn't have a second player, may I suggest using Lackey and the plugin for it that our fellow player Tragictheblathering has spent so much time creating and refining? it works really well. All you need is Skype for communication  or something similar.  the links are available from the thread that Tragic posted here: http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=587410. [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=587410.]\n\nI really can't recommend it enough. I know that there are players out there who are somewhat isolated and don't have many people to play with and this seems to be the perfect solution. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=568684","commentId":568684,"userName":"juicebox","timestamp":1324124160,"content":"silverhand77 said:\n\nIf anyone anywhere wants to play in this tournament, but doesn't have a second player, may I suggest using Lackey and the plugin for it that our fellow player Tragictheblathering has spent so much time creating and refining? it works really well. All you need is Skype for communication  or something similar.  the links are available from the thread that Tragic posted here: http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=587410. [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=587410.]\n\nI really can't recommend it enough. I know that there are players out there who are somewhat isolated and don't have many people to play with and this seems to be the perfect solution. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nThanks silverhand77. This is absolutely an option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=568777","commentId":568777,"userName":"juicebox","timestamp":1324154271,"content":"Finally got in some 2 Player action today and had a chance to take this for a spin. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nWow, this quest is tough. Played 3 games total. The first 2 were absolute failures. Then, after a break and some deck tweaking... sweet success!\n\nHeroes:\n\n1) Aragorn, Théodred, Legolas\n2) Éowyn, Beravor, Glorfindel\n\nWe used 1 Core Set and 1 Hunt for Gollum Adventure Pack.\n\nFinal Threat:\n\n1) 38\n2) 39\n\nTotal Hero Damage: 8\n\nPoints for Rounds: 40\n\nFinal Score: 125"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=568817","commentId":568817,"userName":"juicebox","timestamp":1324170423,"content":"juicebox said:\n\n \n\nFinally got in some 2 Player action today and had a chance to take this for a spin. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nWow, this quest is tough. Played 3 games total. The first 2 were absolute failures. Then, after a break and some deck tweaking... sweet success!\n\nHeroes:\n\n1) Aragorn, Théodred, Legolas\n2) Éowyn, Beravor, Glorfindel\n\nWe used 1 Core Set and 1 Hunt for Gollum Adventure Pack.\n\nFinal Threat:\n\n1) 38\n2) 39\n\nTotal Hero Damage: 8\n\nPoints for Rounds: 40\n\nFinal Score: 125\n\n \n\n \n\n*Oops... in all the excitement of victory, I forgot that we actually used 1 Core Set between us + 1 AP each:\n\n1) HfG\n2) CotC\n\nFixed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=570268","commentId":570268,"userName":"Zjb12","timestamp":1324508428,"content":" One of the hobbits and I made decks tonight.  Hoping to play tomorrow.  Have only beaten this scenario once as a trio, so not sure what our score will be like!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=570675","commentId":570675,"userName":"juicebox","timestamp":1324630958,"content":"Just over one week remains to make your great escape. . .\n\nTime.\n\nIt's running.\n\nOut."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=570748","commentId":570748,"userName":"Zjb12","timestamp":1324645464,"content":" Tried a few times yesterday---no wins!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=573116","commentId":573116,"userName":"p_toler","timestamp":1325338790,"content":"Finally managed to get a 2p game played.\n\nHeroes:\n\n1) Beravor, Bilbo, Eowyn\n2) Legolas, Thalin, Gimli\n\n3 CS, 1 HFG and 1 Carrock.\n\nFinal Threat:\n\n1) 31\n2) 34\n\nTotal Hero Damage: 7\n\nPoints for Rounds: 70\n\nVictory Points: 14 \n\nFinal Score: 128\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56819-the-juicebox-lotr-lcg-2-player-tournament-1-december-11-completed/?do=findComment&comment=573225","commentId":573225,"userName":"juicebox","timestamp":1325380383,"content":"Happy New Year Everybody! And so, we come to the end of my first ever 2 Player Tournament! Congrats all around!\n\nWell done to all who participated. Way to rock the multiplayer action! gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nYour scores will be updated to the Top Ten Hall of Fame [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=582954] shortly.\n\nBe sure to come back in January for the next 2 Player Tournament.\n\nIt promises to be a quite shadowy and mirkwoody experience.\n\nCheers to all,\n\njuicebox"}]}