{"url":"https://community.fantasyflightgames.com/topic/56877-stand-together-how-does-it-actually-work/","title":"Stand Together: how does it actually work?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56877-stand-together-how-does-it-actually-work/?do=findComment&comment=561124","commentId":561124,"userName":"Bungo_Underhill","timestamp":1322473134,"content":"Stand Together 0\n[Event]\nAction: Choose a player. That player may declare any number of his eligible characters as defenders against each enemy attacking him this phase.\n\nIf a player defends with multiple characters what does this mean in terms of the rules?\nI take it we add our defenses together? \nAm I free to split damage dealt how I like between any of the defenders?\n\ne.g. if Gimli & Gondorian Spearman defended together agaist a cave troll would that be 3 damage (6 -2 -1) and I could choose to deal it all to Gimili? Could I choose to deal it all to the spearman (even though he has less HPs than the total damage)?\n\nAnyone got an answer?\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56877-stand-together-how-does-it-actually-work/?do=findComment&comment=561128","commentId":561128,"userName":"booored","timestamp":1322473705,"content":"Yes, that is right.\n\nSo far stand together is the ONLY situation were you add card values like you do when using multiple attackers on a single target. So just add the defense values of the cards.\n\nIt is worth noting that this dose NOT work on sentinel toons when you wish to defend a attack on one of your team mate as it says on the card \"That player may declare any number of his eligible characters as defenders against each enemy attacking him this phase.\" Key words here are \"attacking him (the player the card is cast on)\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/56877-stand-together-how-does-it-actually-work/?do=findComment&comment=561139","commentId":561139,"userName":"LEGA","timestamp":1322474813,"content":"Yes, you combine their defense strength together and deal damage to only ONE of defenders.\n\nInteresting does responses of every defender triggers? E.g. if I defend with 3 Gondorian Spearmen will they deal 3 damage to attacker?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56877-stand-together-how-does-it-actually-work/?do=findComment&comment=561153","commentId":561153,"userName":"Bungo_Underhill","timestamp":1322477031,"content":"Thanks guys - can you let me know where this ruling is from? I can't see anything in the rule book that deals with this.\n\nAlso Am I allowed to distribute damage as I like?\n\nFor example if I defened against the troll with Veteran Axehands could I deal one damage to each of them leaving them all alive?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56877-stand-together-how-does-it-actually-work/?do=findComment&comment=561181","commentId":561181,"userName":"Xealous","timestamp":1322481212,"content":"Damage is applied to only one character I'm afraid, clarified in the errata/FAQ\n\n\"(1.04) Damage and Multiple Defenders\nIf a player uses card effects to declare multiple\ndefenders against a single enemy attack, the defending\nplayer must assign all damage from that attack to a\nsingle defending character.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/56877-stand-together-how-does-it-actually-work/?do=findComment&comment=561324","commentId":561324,"userName":"leptokurt","timestamp":1322504895,"content":"Here's  the link to the FAQ, if you haven't found it yet: www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LOTR_FAQ_1.2.pdf [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LOTR_FAQ_1.2.pdf].\n\nRegarding triggered actions, I see no reason why they shouldn't trigger. I didn't think very much about this card as I see it as almost completly useless, but three spearmen combined sounds like a good idea."}]}