{"url":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/","title":"Crushed before we even began","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561141","commentId":561141,"userName":"player266669","timestamp":1322475044,"content":"Has anyone here played a game of LotR that was basically over before it started, because keywords like Surge now take effect during setup?\n\nThis happened to my friends and I over the weekend. We decided to try \"The Hunt for Gollum\", which directs the players to draw one encounter card per player at game setup, and to place these cards in the staging area. Because of Surge and Guarded, we ended up with something like four lcoations, a clue card, two crows and a Huntress of Mordor. I don't recall the exact number, but there was something like 13-16 threat in the pool when the game began.\n\nWhen we hit the quest phase, we drew more crows, which surged more locations and a Huntress of Mordor, and another clue, which powered up the two Huntresses even more.\n\nEven if we had played an absolutely perfect game, I think there is no way we could have survived that. OUr threat skyrocketed and we simply could not match up to that many monsters in turn 1.\n\nIt is no exaggeration to say that game was over before it started. While that's frustrating in casual play, I'd hate to see a world championship match get decided by something flukey like one team drawing a bunch of killer setup cards like we did.\n\nCan this really be what FFG intended? Are we the only group that has run into this problem? Perhaps we were just unluccky and hit a fringe case, but man, the game really dropped the hamme on us. It was not fun going on that death-march.\n\nI think I preferred the game when surge, doomed nad guarded only took effect during the staging step of the quest phase and the rulebook stipulates. It's still plenty challenging when played that way, but a lot less demoralizing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561158","commentId":561158,"userName":"marlow4","timestamp":1322477836,"content":"No, it happens to everyone. The encounter deck is a sinister and tricksy opponent.\n\nWhile it might be frustrating when it happens, it's all part of the unpredictability and replay value of the scenarios. We are not guaranteed a win. Bad stuff can and will happen and we'll lose sometimes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561171","commentId":561171,"userName":"BoundForGlory","timestamp":1322480138,"content":" I greatly prefer the scenarios where the cards that begin in the staging area are preset, and not random.  I prefer it from a gameplay standpoint (more balanced from game to game), and from a story standpoint (it tells a better or more accurate story).\n\nFor Return to Mirkwood, my son and I like to start with a Forest Gate (Location from the Core set) or two in the staging area, rather than the random card(s).  Not only does it tell the more accurate story of Aragorn entering Mirkwood (as recounted in Unfinished Tales), but it helps as you get to draw some cards when you travel to it.  Since we have 3 core sets, we have a couple extra Passage Through Mirkwood sets.  In fact, we shuffle an extra Passage through Mirkwood encounter set into the Return to Mirkwood encounter deck to give even more variety."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561449","commentId":561449,"userName":"Rubinon","timestamp":1322537945,"content":"You realize that this makes the quest easier, don't you?\n\nBut I think it's a great idea to customize encounter decks. If you just can't beat a certain quest, why not shuffle a Passage through Mirkwood in (If it is fitting thematically)? Sure, one hasn't beaten the \"official\" quest, but in the end, it's about having fun with the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561473","commentId":561473,"userName":"BeardFan","timestamp":1322543975,"content":"You seem to have forgotten that the \"surge\" keyword only affects cards revealed during the staging step of the quest phase (see p.24 of the rule book). Surge has NO effect during scenario setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561480","commentId":561480,"userName":"ShadowGhost2","timestamp":1322545246,"content":"BeardFan said:\n\nYou seem to have forgotten that the \"surge\" keyword only affects cards revealed during the staging step of the quest phase (see p.24 of the rule book). Surge has NO effect during scenario setup.\n\n\n\nNot any more...\n\nLOTR FAQ v1.2\n\n\"(1.01) Encounter Keywords Surge, Doomed, and Guarded keywords should be resolved any time the card on which they occur enters play, including during setup.\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561504","commentId":561504,"userName":"jhaelen","timestamp":1322548981,"content":"Well, I had plenty of games that were over in less than five minutes when I tried to beat the third core scenario solo. I prefer it to a game that drags on endlessly only to find out an hour later that I never had a real chance to win in the first place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561505","commentId":561505,"userName":"BeardFan","timestamp":1322549106,"content":"ShadowGhost said:\n\nBeardFan said:\n\n \n\nYou seem to have forgotten that the \"surge\" keyword only affects cards revealed during the staging step of the quest phase (see p.24 of the rule book). Surge has NO effect during scenario setup.\n\n \n\n \n\nNot any more...\n\nLOTR FAQ v1.2\n\n\"(1.01) Encounter Keywords Surge, Doomed, and Guarded keywords should be resolved any time the card on which they occur enters play, including during setup.\"\n\n \n\n\n\nSeems I have been FAQed lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]. Just when you thought you remembered the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561537","commentId":561537,"userName":"UnthoughtKnown","timestamp":1322554475,"content":" It's a random blowout that has to happen every once in a blue moon. The scenario that you described above is so unlikely to happen that its remotely impossible to calculate its chance. It also works the other way around where you get like two entirely meaningless treacheries during setup. \n\nAnd yeah, this can happen in a competitive setup and theres nothing bad about it. You can lose the magic world final championship by drawing 10 lands in a row. It's so unlikely though that it happens only once in couple of hundreds game or so. \n\nReshuffle and deal with it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561590","commentId":561590,"userName":"Zjb12","timestamp":1322560558,"content":" There have been several games when I have played solo that I knew within the first few rounds there was really no hope because of similar things to what you listed.  Gather the cards together and start again!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561739","commentId":561739,"userName":"jackalmonkey","timestamp":1322579388,"content":"The aforementioned variance and unpredictability does make the game a little more interesting, but I think we can all admit that there's still plenty of randomization out of the encounter deck even when using a preset setup.\n\nOne suspects that FFG's central design pillar for LOTR is to make players feel inadequate enough to keep them chasing new player cards in expansions: if players fail often, they'll feel that there's plenty of room for improvement as promised by new cards. From a marketing perspective, this is a perfectly sound idea - but from a gameplay perspective it's very risky. It's not enough for a game to merely be unfair, which LOTR often is. What makes games great are those moments where players make meaningful and difficult decisions, and LOTR shines most when players are forced to weigh between two very costly alternatives. This is the perfect marriage between difficulty and player agency. But if players feel defeated before the game's outset (i.e. before they've had the chance to make any judgments or actions) then the game becomes less of a game and more of a coin toss, and we can all sit at home playing heads-I-win/tails-I-lose just fine without spending a hundred dollars on paper cards.\n\nThe manner in which difficulty enters the game and ramps up should be controlled by better scenario construction, and players know this: it's evident in the careful construction of many excellent player-created scenarios available online. But this isn't only a matter of whether or not the game is fun or satisfying; if the game's difficulty varies too wildly, it has no future in [already questionable] tournament play. Imagine a tournament in which 15% of players are gimped from the startup by a 12-16 threat staging area, while another 15% start with a couple of treacheries that only affect exhausted characters. Sure, these are both the minority cases, but if this is a tournament we already have clear winners and clear losers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56880-crushed-before-we-even-began/?do=findComment&comment=561840","commentId":561840,"userName":"ricedwlit","timestamp":1322597271,"content":"jackalmonkey said:\n\n \n\nImagine a tournament in which 15% of players are gimped from the startup by a 12-16 threat staging area, while another 15% start with a couple of treacheries that only affect exhausted characters. Sure, these are both the minority cases, but if this is a tournament we already have clear winners and clear losers.\n\n \n\n \n\nPersonally if I were FFG setting up a tournament, I'd play with pre-constructed encounter decks (similar to what's done with bridge). That way, everyone faces the same deck, and how well you do is up to your team.  Then, to toss a wrench in, they could also restrict which heros could work together (maybe set up some fixed sets of heros -- you supply the deck). Then it truly comes down to how well people assemble a deck and how they play."}]}