{"url":"https://community.fantasyflightgames.com/topic/56952-4-questions-with-frodo-frightened-beast-game-mechanics-and-last-minute-playssacrificing/","title":"4 Questions with Frodo, Frightened Beast, Game Mechanics, and Last Minute Plays/Sacrificing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/56952-4-questions-with-frodo-frightened-beast-game-mechanics-and-last-minute-playssacrificing/?do=findComment&comment=561915","commentId":561915,"userName":"Ironmanrcm","timestamp":1322620470,"content":" Hi, \n\n \n\nI had a few questions I was hoping someone would be able to answer for me. \n\n \n\n1.  If you don't declare a defender and let's say an enemy attacks with an attack of 5 - I assign the damage to Frodo, who cancels the damage and I raise my threat.  My question is, do I raise my threat by 5 or, since he is only capable of receiving 2 damage at the most (his life is 2), do I raise my threat by 2 (assuming he doesn't have 1 damage on him at the time)? \n\n \n\n2.  Frightened Beast states that Any player may discard a creature ally from play to cancel the effects of the card -  If one person discards a creature ally from play, does that cancel the effects for everyone or just for that person?  Would each person have to independently discard a creature ally from play to cancel the effects of the card on them?  \n\n \n\nI know the next 2 have been answered but I read conflicting statements on them.\n\n3.  Example, 3 people are playing and it's the questing phase - we have to flip over 3 encounter cards - If the first encounter card says to shuffle it back in the encounter deck, do we shuffle the card back in prior to turning over the remaining 2 encounter cards OR, are all 3 encounter cards turned over at the \"same time\" (meaning... do we shuffle the card back in after all encounter cards are turned over, or do we shuffle the card back in and then turn over the remaining 2 cards?)\n\n \n\n4.  If an encounter card says deal 1 damage to each exhausted character, for example, if that character has only 1 life, can you play something from your hand at that time to save the character (such as something that returns it to your hand)?  Also, along those same lines, if it is a card like Daughter of Nimrodel, can you use her ability to heal damage from a hero before SHE, (daughter of nimrodel), dies (same thing with other cards like the horsebreakers who have to be discarded to use their ability...can you discard them in response to them taking a damage and dying?)?  \n\n \n\nThanks in advance for the input!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56952-4-questions-with-frodo-frightened-beast-game-mechanics-and-last-minute-playssacrificing/?do=findComment&comment=561939","commentId":561939,"userName":"starhawk77","timestamp":1322624893,"content":"1. Your threat would increase by 5. From p.18 of the rule book:\n\n\"If an attack is undefended, all damage from the attack must be assigned to a single hero controlled by the active player.\" [emphasis mine]\n\nSo, in your example, Frodo would be dealt 5 damage (as a hero's defense is ignored when assigning damage from undefended attacks). Frodo's response forces you to raise your threat by the amount of damage ignored, so it would go up by 5. It doesn't matter that Frodo only has two health.\n\n2. One player may discard a Creature to cancel the entire effect. The \"when revealed\" effect on A Frightened Beast is a singular occurrence that impacts both players. Therefore, it is canceled if either player discards an appropriate ally.\n\n3. Encounter cards are always revealed one at a time. From p.14 of the rules (the \"Staging\" subsection):\n\n\"These encounter cards are revealed one at a time, with any 'when revealed' effects being resolved before the next card is revealed.\"\n\n4. Generally, no. There is no opportunity for player actions during staging, or when a shadow card deals direct damage (e.g. Wolves from Mordor in The Massing at Osgiliath). As soon as the Wolves are revealed as a shadow card, they deal their damage. Check the turn sequence chart at the end of the rule book. The only exceptions are Event cards or character abilities with a Response: effect, which can be played whenever the appropriate trigger occurs (e.g. A Test of Will & Eleanor, which can respond to specific encounter effects revealed during staging). Continuing the Wolves from Mordor example, you could cancel their damage with Hasty Stroke, but only because its specific Response: text allows you to cancel the effects of a shadow card. For the most part, there are very few answers to direct damage from encounter cards.\n\nHope that helps :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/56952-4-questions-with-frodo-frightened-beast-game-mechanics-and-last-minute-playssacrificing/?do=findComment&comment=562025","commentId":562025,"userName":"leptokurt","timestamp":1322641849,"content":"Couldn't express it much better than Starhawk.\n\n \n\nAll that I can add is that as someone who has never played a LCG before it took me quite a while to realize how important keywords like 'action' or 'reaction' are. You really have to read the card text carefully and have a look at the rules from time to time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56952-4-questions-with-frodo-frightened-beast-game-mechanics-and-last-minute-playssacrificing/?do=findComment&comment=562288","commentId":562288,"userName":"Ironmanrcm","timestamp":1322681769,"content":" Thanks for the reply...that was really helpful. \n\n \n\nJust want to make sure I completely understand what you are saying about the Frodo thing though...\n\n \n\nIn my example, I said he didn't defend.... but, what if he defended against an enemy with attack of 6 ... he would defend 2 with his defense...then 4 would get through.... do I raise my threat by 4 in this case as well?  \n\n \n\nThanks again for the quick response."},{"commentUrl":"https://community.fantasyflightgames.com/topic/56952-4-questions-with-frodo-frightened-beast-game-mechanics-and-last-minute-playssacrificing/?do=findComment&comment=562303","commentId":562303,"userName":"Titan","timestamp":1322684190,"content":"Yes, you would increase the threat by 4, as that is the amount of damage he would have received if he had defended in that example."}]}