{"url":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/","title":"really really easy win against muil with spirit deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/?do=findComment&comment=562447","commentId":562447,"userName":"richsabre","timestamp":1322726266,"content":"just got it in the post, took it out, sorted it, and thought a single sphere spriti deck will do it.\n\n \n\nman it was easy, i had two lorien guides, northern tracker, eowyn and frodo questing, i just breezed through without barely anything of significance happening.\n\n \n\ni know i was my first time, but anyone else find it really easy or is this just a fluke? anyways im going for another go....\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/?do=findComment&comment=562478","commentId":562478,"userName":"Untergeher","timestamp":1322731904,"content":"The quest is a breeze when you play spirit and have some trackers on the board. I think if you wanna have more of a challenge, you should try some other deck against it... \n\nI didn't dislike the quest as much as some other players here in the forums, but it certainly is one of the easier ones out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/?do=findComment&comment=562482","commentId":562482,"userName":"Bohemond2","timestamp":1322732334,"content":"The quest is generally easy.  That being said, if you play single sphere spirit you will have a fair amount of luck involved in winning.  the game comes down to, can you pull 20 VP of locations before direct damage events kill your characters.  One or two rockslides can ruin the day of even the mightiest spirit decks.\n\nConsequently, Eleanor may be the most important hero for securing victory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/?do=findComment&comment=562556","commentId":562556,"userName":"richsabre","timestamp":1322743291,"content":"i actually enjoyed it alot, it was nice to have an easier quest, something different"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/?do=findComment&comment=562601","commentId":562601,"userName":"Titan","timestamp":1322747830,"content":"Spirit with all of it's questing abilities absolutely kills this quest. Spirit with just a bit of leadership added for good measure, and I don't see how you can lose. This is, by far, the most one dimensional of all the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/?do=findComment&comment=562619","commentId":562619,"userName":"gatharion","timestamp":1322750340,"content":" Yeah, the first time I played against Hills of Emyn Muil it was with a Rohan themed deck (obviously Spirit heavy). Even without any Northern Trackers or Lorien Guides I absolutely destroyed that quest.\n\n \n\nHowever, it is possible to get a bad run of treachery cards in that quest that can really mess you up. The last time I played that quest it was a two-player game, my brother was using my Rohan deck and I was using a Gondor themed deck. Some bad combinations of treachery, enemies, and shadow effects led to me losing all of my heroes and my brother barely pulling off a win with only Dunhere left and over 40 threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57004-really-really-easy-win-against-muil-with-spirit-deck/?do=findComment&comment=562995","commentId":562995,"userName":"DurinIII","timestamp":1322823132,"content":"Haha! Nice! Can't stop them horses! "}]}