{"url":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/","title":"New Player Question: How to continue?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/?do=findComment&comment=562554","commentId":562554,"userName":"lant","timestamp":1322742630,"content":"Hi all,\n\nI picked up this game last week and after playing and losing a lot I decided to spend some time (re)-reading the manual, FAQ and this forum.\n\nI am getting the hang of it and Passage Through Mirkwood has been conquered.\n\nNow for the level 4 quest Journey Dawn the Anduin, how should I continue? Do I keep playing with the mono-sphere 30 card decks (is this winnable?) or do make 50 card bi-sphere decks?\n\nSince it's a core set, I guess there is no need to add cards from AP's to build a (consistenly) winning deck?\n\n \n\nSomething different: to obtain 3x every card, it's necessary to buy 3 Core sets. Question: are (some of) these Core set cards really that good and worth it? In  other card games, core sets often contain weaker cards (or reprints) that get to be replaced soon with better cards from new expansions.\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/?do=findComment&comment=562555","commentId":562555,"userName":"richsabre","timestamp":1322742834,"content":"quite simply mono sphere decks will fall apart in most other quests- build some decks, double or tri sphere.\n\n \n\nsome cards you would need to buy multiple core sets to have 3, but many of us dont, i havnt and have got along fine, also despite you not needing to buy aps they certainly have some useful card in there \n\n \n\nmy advice for anduin is GIMLI!!!! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n also see my post of mono spheres from earlier today\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/?do=findComment&comment=562569","commentId":562569,"userName":"Bohemond2","timestamp":1322744653,"content":"As a side note, most players would agree that the strongest cards in the game (Thinks like northern Tracker, Unexpected Courage, Steward of Gondor, etc.) are all in the core set/"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/?do=findComment&comment=562585","commentId":562585,"userName":"starhawk77","timestamp":1322746292,"content":"Like Rich said, Journey Along the Anduin will be very challenging with any of the pre-constructed decks. Leadership would probably stand the best chance, but even that would require quite a bit of luck. Go ahead and give it a try, but you'll definitely have more success if you do a little deck-building. \n\nYou definitely don't need AP cards to make a quality deck, although many of the options in the Shadows of Mirkwood cycle are both powerful and fun to use. I'd advocate picking up at least a pack or two, but they are certainly not necessary. As Bohemond pointed out, many of the strongest cards in the game right now are actually in the Core Set. There are plenty of underwhelming inclusions (I'm looking at you, Stand Together...), but many Core Set cards are still very popular.\n\nWith regard to the question of multiple Core Sets, it really depends on what makes the game enjoyable for you. If winning consistently, building the strongest decks available, and having play sets of every card makes you happy, then you'll likely be able to justify the additional purchases. If you play with a large group, multiple Core Sets can allow different players to each utilize cards from a certain sphere. On the other hand, if you already enjoy the game, having three Stewards of Gondor as opposed to just two might not make for a worthwhile expenditure. Also, keep in mind that the extra encounter and scenario cards will be almost entirely useless. As a result, additional Core Sets really offer diminishing marginal returns; the second copy gives you play sets of cards like Steward, Northern Tracker, Sneak Attack, The Galadhrim's Greeting, Feint, Quick Strike, etc., while a third box basically amounts to a $30 Unexpected Courage (and Brok Ironfist, but we won't go there...).\n\nPersonally, I'd caution against multiple Core Sets unless you have a large group or consider yourself a \"power gamer\" who derives enjoyment from building the most efficient decks available. If you do choose to buy additional copies, be advised that a third set adds very, very little. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/?do=findComment&comment=562837","commentId":562837,"userName":"jhaelen","timestamp":1322792773,"content":"lant said:\n\nNow for the level 4 quest Journey Dawn the Anduin, how should I continue? Do I keep playing with the mono-sphere 30 card decks (is this winnable?) or do make 50 card bi-sphere decks?\n\nSince it's a core set, I guess there is no need to add cards from AP's to build a (consistenly) winning deck?\n\nSomething different: to obtain 3x every card, it's necessary to buy 3 Core sets. Question: are (some of) these Core set cards really that good and worth it? In  other card games, core sets often contain weaker cards (or reprints) that get to be replaced soon with better cards from new expansions.\n\nYou forgot to mention whether you're playing solo or not. The pre-built decks work fine if you use them in multi-player games. They don't work for playing solo. Note that you can play two (or more) decks even if you're playing solo.\n\nWith 50-card decks your chance to win a scenario is a lot worse. If you only have the Core Set, forget about tournament-legal decks.\n\nYou have to decide for yourself if it's worth it for you to buy multipl core sets. Myself I'm happy with a single copy. But I'm also not into deck-building. There are arguably some good cards that don't come in triplicates in the core set.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/?do=findComment&comment=562845","commentId":562845,"userName":"lant","timestamp":1322794730,"content":"Thanks all for your replies\n\n@jhaelen: I play solo (most of the time). Actually, that was the main reason to buy this game. Most games are 2+ players and I was looking for some good/fun 1 player games and through Google I stumbled on this one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57016-new-player-question-how-to-continue/?do=findComment&comment=562861","commentId":562861,"userName":"richsabre","timestamp":1322798094,"content":"lant said:\n\nThanks all for your replies\n\n@jhaelen: I play solo (most of the time). Actually, that was the main reason to buy this game. Most games are 2+ players and I was looking for some good/fun 1 player games and through Google I stumbled on this one\n\n\n\nSame here, made my year"}]}