{"url":"https://community.fantasyflightgames.com/topic/57179-adding-a-resource-icon-to-a-hero/","title":"Adding a resource icon to a hero?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57179-adding-a-resource-icon-to-a-hero/?do=findComment&comment=564165","commentId":564165,"userName":"CrowOfPyke","timestamp":1323097878,"content":"I am sure this has been asked before, but I didn't see it in the current FAQ document.\n\n \n\nExample: You have Aragorn in play, a Leadership sphere character.  You play Celebrian's Stone on him, which gives him the Spirit sphere icon.\n\nQuestion:  This simply means you can use resources on Aragorn to pay for Leadership and Spirit cards correct?  It does *not* mean he gets one Leadership resource and one Spirit resource during Phase One, correct?\n\n \n\nI ask because I taught a couple of new players the game (which they enjoyed a great deal), but they were convinced it must mean you get 1 of each resource type during Phase One because of a similar mechanic in the Warhammer 40k card game by FFG.  I assured them that was not the case and it simply means resources in Aragorn's pool (as per above) can be spent for cards in either sphere.\n\n \n\nJust wanted to double check my understanding here, thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57179-adding-a-resource-icon-to-a-hero/?do=findComment&comment=564169","commentId":564169,"userName":"Kiwina","timestamp":1323098413,"content":"You are correct.  Aragorn still only gets 1 resource each round, but he can use his resources as spirit or leadership resources when Celeborian's Stone is attached."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57179-adding-a-resource-icon-to-a-hero/?do=findComment&comment=564393","commentId":564393,"userName":"silverhand77","timestamp":1323137239,"content":"He also belongs to the spirit sphere while the stone is attached :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}