{"url":"https://community.fantasyflightgames.com/topic/57209-healing-wilaydor/","title":"healing Wilaydor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57209-healing-wilaydor/?do=findComment&comment=564424","commentId":564424,"userName":"pumpkin","timestamp":1323146011,"content":" \n\nHi,\n\n \n\nJust got round to playing JtR, although I've had it for ages and want to make sure I haven't missed any ways of healing him for when I'm deck building.\n\n \n\nAs far as I can tell the options are...\n\nGlorfindel (currently I don't see this as an option as i like to keep all my heroes alive and in the game, and count a game where I lose one a loss, but realise I may need to change my mind here - I play solo you see, so losing a hero is a pretty big deal)\n\nDaughter of Nimrodel - fine, but was wanting to try a Leadership/tactics deck, so need songs to obtain lore resource icons\n\nLore of Imladris - see above\n\nRadagast - seems like he'll take a while to get the resources to have the value to heal ol wil!\n\nany others?\n\nI'm also keen to only use cards available at the time (more or less, there's the odd exception) that were available at the time JtR was released, so haven't looked at many cards form later adventure packs\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57209-healing-wilaydor/?do=findComment&comment=564443","commentId":564443,"userName":"starhawk77","timestamp":1323148924,"content":"Actually, Daughter of the Nimrodel won't work. It only heals heroes, so it can't remove damage from Wilyador. Right now, the three other cards you listed are really the only options. Lore of Imladris is definitely your best bet; you don't want to sacrifice Glorfindel, and it'll take several turns before Radagast can do any substantial healing. If you're playing Leadership/Tactics, adding Lore of Imladris and some Songs of Wisdom is probably the way to go. It is possible to complete the scenario without any healing cards, but the odds won't be in your favor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57209-healing-wilaydor/?do=findComment&comment=564453","commentId":564453,"userName":"pumpkin","timestamp":1323149770,"content":"starhawk77 said:\n\nActually, Daughter of the Nimrodel won't work. It only heals heroes, so it can't remove damage from Wilyador. Right now, the three other cards you listed are really the only options. Lore of Imladris is definitely your best bet; you don't want to sacrifice Glorfindel, and it'll take several turns before Radagast can do any substantial healing. If you're playing Leadership/Tactics, adding Lore of Imladris and some Songs of Wisdom is probably the way to go. It is possible to complete the scenario without any healing cards, but the odds won't be in your favor.\n\n\n\nCheers, my deck was built exaclty as you described - even not having DoN, as I must have realised she was pointless during deck building, just not when i sent the post!\n\n \n\n \n\n \n\n "}]}