{"url":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/","title":"Quick question from a new player","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/?do=findComment&comment=564501","commentId":564501,"userName":"soly2","timestamp":1323157365,"content":"With all the adventure packs and the new \"expansion\" coming out for the LOTR card game, what exactly would I need to play with 3-4 players? Also, is the game more like Thunderstone or the Game of thrones ccg? Thanks in advance. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/?do=findComment&comment=564520","commentId":564520,"userName":"starhawk77","timestamp":1323159819,"content":"For 3-4 players, you can get by just fine using only a Core Set. Each person can use one of the pre-constructed decks, although two of the players will have to track threat using dice or a pen and paper. You certainly don't \"need\" any of the expansions in order to play with a large group.\n\nThat being said, picking up an Adventure Pack or two definitely won't hurt. It'll give you another scenario as well as a few more player cards for each sphere. This will allow 3-4 players to do a bit of deck customization. If you want more quest options and like building decks, APs are the way to go. \n\nI haven't played Thunderstone, but I have played AGoT. Although both are LCGs, LotR and Game of Thrones are completely different experiences. Both great games, but the cooperative aspect of LotR is entirely unlike the strategic backstabbing and manipulation of AGoT. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/?do=findComment&comment=564525","commentId":564525,"userName":"Mighty Jim 83","timestamp":1323160568,"content":" This game is like AGoT in terms of having a hand of cards that you can play, acquiring resources each round to pay for them. Cards all come from your deck, which you build from an ever-expanding card-pool, depending on how much cash you want to spend on the game.\n\nThe card types are pretty similar attachments and events are the same. Characters are slightly different, in that you have you starting heroes, and then allies. The mechanics are similar too - generally you exhaust (= kneel) characters to do things some special effects ready (=stand) them, but otherwise it just happens at the end of the round. The round is divided into distinct phases that happen in order, with player actions or reactions being possible at some points and not others.\n\nSo in all those respects, if you've played AGoT, the mechanics of this will be easy to pick up.\n\nOther things are quite different though- characters have more stats, fighting is a bit different, with attacking and defending being resolved separately, the shadow cards provide a random element in every combat.\n\nThe biggest difference though, as mentioned already is that this is a co-operative, and the thing you're battling against is the game itself - a deck composed entirely of bad things which are being dealt randomly for you and your heroes to deal with.\n\nSo, to sum up, experience with AGoT will probably help you grasp how the game works a little quicker, but there's a LOT of difference about teh whole gameplay experience, which makes this worth getting even if you already have AGoT.\n\n \n\nThis game is nothing like Thunderstone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/?do=findComment&comment=564537","commentId":564537,"userName":"Xealous","timestamp":1323164302,"content":"2 x the core set would certainly be handy for 3-4 players, aside from having 4 chucky threat trackers and plenty of tokens the bulk of cards this provides is the best foundation I think. You'll have enough of all the best cards to build up the decks, for example enough Gandalfs to go around (Theres 4 in the core set). This said, 4 can play with core set (easier mode perhaps as every player has minimalised 30 card deck).\n\nBeware, all 4 players may very shortly be addicted. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/?do=findComment&comment=564658","commentId":564658,"userName":"TragicTheBlathering","timestamp":1323179806,"content":"I have 3 copies of core, I started playing with one... then got the other 2.. I havn't regretted it....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/?do=findComment&comment=564861","commentId":564861,"userName":"jhaelen","timestamp":1323225532,"content":"Soly said:\n\nWith all the adventure packs and the new \"expansion\" coming out for the LOTR card game, what exactly would I need to play with 3-4 players? Also, is the game more like Thunderstone or the Game of thrones ccg? Thanks in advance. \n\n\n\nYou can play with four players using a single core set just fine. I'd also recommend it before investing a lot of money in a game you may not like.\n\nAll of the LCGs work similarly, so it's a lot closer to the AGoT LCG than it is to Thunderstone. However, since it's cooperative there are also some notable differences to the other LCGs. Most importantly a pre-built quest/encounter deck replaces an opponent's deck. You may want to download the rules first to decide if it might be for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57215-quick-question-from-a-new-player/?do=findComment&comment=564940","commentId":564940,"userName":"soly2","timestamp":1323246458,"content":" Thanks for all the replies. We might have to try it on tuesday :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}