{"url":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/","title":"Wow; I just realized how good &#039;The Eagles Are Coming&#039; is.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565167","commentId":565167,"userName":"DurinIII","timestamp":1323281555,"content":"So, I finally worked out a deck that brings in a fair amount of Eagle cards and I put in The Eagles Are Coming.  I happened to draw two in my opening hand. I played one; searched the top five, grabbed two eagles.  I haven't spent a single resource token yet and I already have drawn two cards. I shuffle my deck; play a second copy, and I draw two more Eagles. 4 cards drawn and I finally begin to plan my first resource phase.\n\nI know this is an exceptionally fortunate case, but I do now see the true potency of this card and I love it!  Anyone else had some fun with it? \n\n@TragictheBlathering (if you happen to read this): I watched a few of your videos online (the ones of you opening the adventure packs) and I must say that I found you reviews very helpful and full of card gamer's knowledge. Thank you for the posts. Also, I noticed how well you predicted The Eagles Are Coming. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565169","commentId":565169,"userName":"Bohemond2","timestamp":1323281900,"content":"Keep in mind that you played two cards to draw four cards.  So your net advantage was only 2 cards (and a trimmed down player deck).  Its become a decent card, and certainly worth playing in an eagle deck, but no more than that\n\nPublish [../../../edge_public/img_edge/spacer.gif]\n\n."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565171","commentId":565171,"userName":"richsabre","timestamp":1323282166,"content":"im still trying to find a deck i like, i was just then trying to build an eagle deck that worked, but it was giving me a bad head trying to figure it out, but then again i will chose to deck build at 12.20 in the morning, insomnia has its benefits lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565178","commentId":565178,"userName":"DurinIII","timestamp":1323283788,"content":"So this is my deck that incorporates Eagles.  So far I have only played it 3 times; once against Journey Through Mirkwood, and twice against Journey Down the Anduin.  I won all three games, which excites me because I have been losing the majority of my solo games of late.\n\nHeroes:\n\n-Gimli\n\n-Bilbo\n\n-Frodo\n\nAllies:\n\nGandalf x3\n\nVassal of the Windlord x3\n\nWinged Gurdian x3\n\nDescendant of Thorondor x3\n\nEagles of the Misty Mountains x3\n\nBeorn x1\n\nErebor Hammersmith x2\n\nMiner of the Iron Hills x2\n\nAttachments:\n\nSong of Kings x3\n\nSteward of Gondor x2\n\nCelebrian's Stone x1\n\nDunedain Mark x3\n\nFast Hitch x2\n\nProtector of Lorien x2\n\nAncient Mathom x3\n\nUnexpected Courage x1\n\nCitadel Plate x2\n\nDwarven Axe x2\n\nEvents:\n\nThe Eagles Are Coming x3\n\nFeint x2\n\nA Test of Will x2\n\nThe Galadhrim's Greeting x2\n\nAnd that's the deck! Hope you guys are able to mess around with it and let me know how it works/what you think!\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565222","commentId":565222,"userName":"Titan","timestamp":1323294430,"content":"For me it's usually a one for one card. I did grab Eagles of the Misty Mountains and Vassal of the Windlord with it today. But I haven't gotten more than one card with it yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565242","commentId":565242,"userName":"TheLightdarker","timestamp":1323301451,"content":" To mathematically calculate just how useful The Eagles Are Coming! would be in your deck (given how many Eagles you plan on including), check out this website [http://www.kibble.net/magic/magic10.php]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565320","commentId":565320,"userName":"booored","timestamp":1323321464,"content":"I think the thing about the eagles are coming card is that it is zero to play. So yes it dose pad your deck (reduces chance of drawing a good card) , but on a successful hit it thins your deck (increases the chance of drawing a card) as well as at least replacing the dead draw that was eagles itself, and at best gives you card advantage. Engels is a card you can stock over the 50 card mark and make a 53 card deck for this reason. This + the zero cost + fetch completely cancels out the \"cost\" of slowing down your draws by a single card. Witch is why you can pad to 53 with out worries. It works best when you have tactic/lore and add card draw, say Bilbo / Beravor / Gelowine. So you compleatly negate the \"dead draw\" cost as well.\n\nEaglesAC is a no brainier if you are making the \"eagle\" deck.. witch btw imo.. isn't even a thing.. and as we are in kaz now deep in the mines.. we prob will not see more eagles, at least for a while. So what we are most likely talking about here is a \"creature\" deck.\n\nEither way for now, a Eagle heavy deck, + some card draw makes eagles a completely \"costless\" card, that has a pretty neat affect. So... put it in your decks\n\nLightdarker said:\n\nTo mathematically calculate just how useful The Eagles Are Coming! would be in your deck (given how many Eagles you plan on including), check out this website.\n\nIsn't that for a 60 card deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565330","commentId":565330,"userName":"Shelfwear","timestamp":1323324797,"content":"booored said:\n\n and as we are in kaz now deep in the mines.. we prob will not see more eagles, at least for a while.\n\n\n\nThere could be other eagle themed player cards in the first two Dwarrowdelf APs as they lead the players across the Misty Mountains... but once AP# 3-6 lead back into Moria we wont see any other Eagle card..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57290-wow-i-just-realized-how-good-the-eagles-are-coming-is/?do=findComment&comment=565395","commentId":565395,"userName":"gatharion","timestamp":1323338759,"content":" Yeah, I've drawn three Eagle cards with it a time or two. I like it WAY more than Mustering the Rohirim."}]}