{"url":"https://community.fantasyflightgames.com/topic/57301-clarification-of-combat-rules-please/","title":"Clarification of combat rules, please.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57301-clarification-of-combat-rules-please/?do=findComment&comment=565248","commentId":565248,"userName":"Konoster","timestamp":1323305358,"content":" Hi,\n\nregardless of how many times I read the section in the rules about defending and taking damage, I never get wiser. Could anyone please enlighten me on the following topic;\n\nare you allowed to choose and disperse battle damage across all your heroes AND allies, regardless of defender?\n\nAccording to the rules, you are not:\n\n\"...the remaining value is the amount of damage that must be dealt to the defending character\"\n\n \n\nBut further down it then says on the subject of undefended attacks:\n\n\"...if an attack is undefended, all damage from the attack must be assigned to a single hero controlled by the active player\"\n\nTo me, emphasized like that, it would imply that there might be a case when some of the damage could be assigned to several heroes, or characters.\n\n \n\nHow to play the game?\n\n \n\nThanks in advance,\n\ncheers\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57301-clarification-of-combat-rules-please/?do=findComment&comment=565250","commentId":565250,"userName":"zeb","timestamp":1323305646,"content":"What is meant is that if it is undefended, then you cannot deal damage to an ally, but to any one hero. If it is defended, you assign damage to the defender, who may be a hero or an ally. The \"single\" word has no particular meaning, damage is always assigned to a single character (as far as I know)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57301-clarification-of-combat-rules-please/?do=findComment&comment=565264","commentId":565264,"userName":"LEGA","timestamp":1323308845,"content":"We don't have such case when we can disperse damage among characters. Even if you use \"Stand Together\" [http://lotrlcg.com/cardFocus.php?Title=Stand%20Together] damage must be assigned to a single character (FAQ).\n\nMaybe we'll have some card that allows it, but at the moment we can't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57301-clarification-of-combat-rules-please/?do=findComment&comment=565267","commentId":565267,"userName":"zeb","timestamp":1323309177,"content":"LEGA said:\n\nWe don't have such case when we can disperse damage among characters.\n\n\n\nVery often it is also an advantage. It is great to assign 5 damages to a 1-hit point ally. You kill the ally but the 4 damage points in excess are not carried over other characters. A great and cheap way to defend against even the most powerful enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57301-clarification-of-combat-rules-please/?do=findComment&comment=565270","commentId":565270,"userName":"LEGA","timestamp":1323309531,"content":"Yes, I think it's better too. But it would be great to have a card that allows you to disperse damage between some characters, e.g. for response of Hummerhorns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57301-clarification-of-combat-rules-please/?do=findComment&comment=565333","commentId":565333,"userName":"richsabre","timestamp":1323324910,"content":"Hi\n\nEg. enemy attacks Bilbo with 4 attack against his 2 defense and deals 2 point of damage- they have to go to him as he is the defender (in this case he dies).\n\nnext another enemy attacks with 4 attack but you have no heros or allies left to defened so then the entire 4 attack gets converted into 4 damage points which have to go to one hero. the only benefit is that you get to choose which, but it remains the same, damage cannot be split\n\n \n\nthanks"}]}