{"url":"https://community.fantasyflightgames.com/topic/57300-need-good-demo-for-store/","title":"Need Good Demo For Store","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57300-need-good-demo-for-store/?do=findComment&comment=565243","commentId":565243,"userName":"Will Fuqua","timestamp":1323303181,"content":"Hey Guys,\n\nI work at a gaming store called The Next Level Games and we're going to start demoing all the living card games in-store upon request for customers who are interested in the games.  For this game I'd like something straight forward that also wouldn't be too long to play.  I'm thinking that a simply two player game would be best because the rounds would be shorter and less confusion, but I'd like to hear your thoughts on deck builds and what quest to run.\n\nThanks so much,\n\nWill"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57300-need-good-demo-for-store/?do=findComment&comment=565293","commentId":565293,"userName":"Xealous","timestamp":1323316423,"content":"Dunno if  these would skew the game experience too much but I would be tempted to play 2+ single sphere minimal decks from the core set with the 3 heroes available for each, this smooths out card play and resources and gives them a choice of 4 spheres for their personal play preference. Which ever they wish to do; kill stuff, command stuff, heal stuff, or quest and explore the world. Then a supporting sphere can be selected for balance, combat to balance support.\n\nThe first quest Passage through Mirkwood is the obvious choice, a straight foward and simple quest with atmospheric flavour. Also used without spoilers to the further quests.\n\nI would also be tempted to stack the encounter deck with a obvious and gradual flow of encounters, or simply jam the horrific cards at the bottom. You are just trying to demonstrate the flow and experience of the game, the tension and difficulty will always be obvious wthout back to back The Necromancer's Reach treachery cards!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57300-need-good-demo-for-store/?do=findComment&comment=565336","commentId":565336,"userName":"Spirit Juggler","timestamp":1323325978,"content":"Yes I'd do the same. Just go with base decks from the core set against Passage through Mirkwood. Not too many cards to confuse and a good introductory quest to the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57300-need-good-demo-for-store/?do=findComment&comment=565346","commentId":565346,"userName":"Will Fuqua","timestamp":1323327208,"content":" Yeah Mirkwood seemed like a decent choice and it's what I use to introduce my friends to the game.  About the mono spheres, I was thinking of having the Tactics and Leadership being the two options, then I run support with Spirit/Lore."}]}