{"url":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/","title":"This is great fun but wait....why is everyone telling me it&#039;s easy?!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565353","commentId":565353,"userName":"Konoster","timestamp":1323330798,"content":"I have just started playing Lotr LCG, and enjoy it so far. I have also seen some posts telling it is no match beating most scenarios on one player terms. Hmm. I haven´t yet got past Down the Anduin (?), 2nd quest. These trolls beat me out.\n\nI mean, with three heoes, of which one will pretty constantly be useless in combat since being fatigued from questing, then the other two have a tough match as soon as monsters accumulate in the staging area. Plus, if only committing one hero to questing, that one is not at all sure to secure any quest points. Result is being bogged down quickly. Have been playing with a lore/tactics deck combo. Any tips?\n\nAlso, about travelling, which should commense after quest phase. If you travel, are you supposed to quest the new active location right away? Or will you linger at that card until next round and quest it then?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565366","commentId":565366,"userName":"richsabre","timestamp":1323333047,"content":"hi\n\n \n\nanduin is tough solo, so dont worry, try and get an unexpected courage on a hero as fast as possible so they can refresh in the round, also for general questing spirit card and especially eowyn is a big help as she can get +1 willpower so often she can quest alone. Aragorn is also good as he can refresh after paying 1 resource. The troll can be dealt with by Gimli taking damage which puts his attack stats up, then next round throw everything you have at it. if you havnt got it by then, then its going to be tough for you\n\n \n\nas for the travel, after you've travelled there, you only quest with that in the next round\n\n \n\nalso this game isnt easy solo, but dont mention it on here becuase you will get your head bitten off gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif], it gets easier though, if you're interested enough get some adventure packs, theres some great cards that can really help with what you're saying, you have trouble with, also theres about 4 that are actually easier than anduin, so just becuase its in the core set dont think its meant to be easy (just look at guldur!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565427","commentId":565427,"userName":"Konoster","timestamp":1323344786,"content":" Ahh, that´s good to hear. Just bought a couple of AP's. Eager to try them,\n\n \n\ncheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565442","commentId":565442,"userName":"richsabre","timestamp":1323346576,"content":"which ones did you buy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565476","commentId":565476,"userName":"Konoster","timestamp":1323351851,"content":" Conflict At The Carrock and Emyn Muil. Mostly because all others were out of stock ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] Would have gotten the whole cycle otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565486","commentId":565486,"userName":"booored","timestamp":1323352721,"content":"the reason you hear that is that the game is easy is because many of the players here have been playing a while and have played the quest multiple times. What this means is that the encounters decks do not surprise them, they no what to expect and build deck around it. More than that they no what cards to hold for special moments. For example in Journey, you put \"Miner of the Iron Hills\" in your deck and NEVER cast him unless sacked comes out, or if you are going to sac him and then recast form the yard with \"stand and fight\"\n\nSo what you end up with is a deck and strategies that make pretty much every quest fairly trivial. Apart from Osgiliath and Escape you have a way way way better then average chance to win every single time, once you have a good deck built and even those 2 can be beaten solo regularly.\n\nAlso \"power creep\" means that quest that were once hard are now so easy it is ridiculous. Journey is an example of this. Multi-UCs on Dunhere in a threat control deck + Dunedain Mark means you can pretty much auto win this scenario, as in 2B there are no encounter checks, so all monsters stay in the staging area no matter what your threat is so, UC on Dunhere, and just tap kill, tap kill, tap kill. Get 3 marks on him and he is hitting for 6 each time. (card draw is your friend)\n\nThis is why a popular variant called \"Restricted\" has popped up, that limits your card pool to what was released at the time of release.. so a \"Lone Quest: Journey Down the Audin *RESTRICTED\" would mean you are making a deck JUST for Journey (not for the entire chain) and can ONLY use cards from CORE. This keeps the quests nice and hard and challenging, even when you go back to them with a much bigger card pool and more powerful cards.. like the Marks for example on this quest.\n\nefidm\n\n * Conflict At The Carrock and Emyn Muil. Mostly because all others were out of stock ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] Would have gotten the whole cycle otherwise.\n\nCaTC is a perfect example.. .this quest LOOKS really hard and at first play though is like WTF... but after a few plays and some deck tweaking it is in fact one of the easiest quest in the entire game so far.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565525","commentId":565525,"userName":"DurinIII","timestamp":1323359340,"content":"Welcome to the game Konoster! I back what Boooored and Richsabre said.  They have been with this game (including myself) from basically the start.  Solo is indeed a bit harder than multi, but after awhile, you will get the hang of it (like Boooored said).  What makes this game so fun (besides the fact that you get to tromp around in Middle-Earth killing things) is its ever growing card pool and mechanics.  Solo for instance will get easier as time goes on (of course you can say that of multi player too).  Happy gaming! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565643","commentId":565643,"userName":"Konoster","timestamp":1323391209,"content":" Well, thanks all of you!\n\n \n\nSome good bits of info there boored. I will try building a deck for multiple quests and see how it goes, modifying from there. For campaign playing like that, would you recommend striving for a 'good odds' 50 card limited deck, or go for more options in a 60-65 card deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565649","commentId":565649,"userName":"booored","timestamp":1323392081,"content":"General rule of thumb is that the smaller your deck the better as the faster you will draw your \"money cards\". Do not be to afraid to go over 50, especially if you have a lot of drawing power. Though in general you deck will function best trimmed of fat and having as fast a draw as possible into your key engine cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565672","commentId":565672,"userName":"UnthoughtKnown","timestamp":1323399695,"content":"Try not to get frustrated, especially on the  new quests you purchased. As a very general rule of thumb, when you play a difficulty 7 (like Conflict at the Carrok if Im not mistaken) quest from the get-go, its entirely fine to loose 7 out of 10 times. The game isnt easy nor stupidly difficult, its a fine ballanced (theres been discussion on how ballanced for 1 player mode) challenge. As such it gets easier with practice and deck tuning. \n\nIn regard of what booored was saying: When you start building your decks you should really try not to exceed 50 cards. Going up to 60 won't ruin your deck, but deffinitely weaken it. More importantly though, its good practice. When youre new to TCGs it often feels like you can improve your deck with tossing all good cards in there, but this is somewhat of a false conception. See, naturally you draw a card a turn. From there its a matter of propability of whether you draw a card you really really like (like steward of gondor or unexpected courage) or something that you liked a little less, but couldnt decide on wheter to throw it out. Ask yourself the question \"what cards do I really need to do this\" and scrap from there. Deck construction can be awfully difficult and fun at the same time. After years of TCGs I still struggle on what cards to exclude. When I cant make up my mind about it I play a couple of games and exclude those cards aftewards that were sitting in my hand unused for the longest (because they are highly situational) or the ones that  I really hated to draw when I was struggling to win. \n\nps.: Durin, have you gotten my message? Im not sure whether  this message system here is actually doing anything. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565709","commentId":565709,"userName":"DurinIII","timestamp":1323409638,"content":"Hey Unthoughtknown, yeah, I did get you message and thanks! I emailed you back; you get it? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565731","commentId":565731,"userName":"UnthoughtKnown","timestamp":1323413830,"content":"DurinIII said:\n\nHey Unthoughtknown, yeah, I did get you message and thanks! I emailed you back; you get it? \n\n\n\n \n\nNope :S\n\n If you want, resend to cal9mm at hotmail dot com"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57311-this-is-great-fun-but-waitwhy-is-everyone-telling-me-its-easy/?do=findComment&comment=565831","commentId":565831,"userName":"Konoster","timestamp":1323433181,"content":" Ok, so I have put together a deck of 52 cards - 2 parts lore and 1 part leadership. Hoping that bonus resources, drawing cards and healing will keep me going. Thanks for all input!"}]}