{"url":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/","title":"The SUPER FAST solo deck - version 1.3","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=565809","commentId":565809,"userName":"sortylege","timestamp":1323429618,"content":"SUPER FAST Deck: a solo deck that easily wins all first cycle quests.\n\nSTRATEGY: utmost flexibility and insanely fast card collecting with Beravor with up to 3x Unexpected Courage are the keys of this deck. This deck doesn't rely on allies but on good attachments.\n\nYou will draw from 3 to 9 cards every turn!\nTake lot of cards in hand, then use Will of the West to recycle Sneak Attack+Gandalfs+Galadhrim Greetings+A Test of Will in a small player deck.\nKeep Henamarth Riversong working.\n\nRESOURCE MANAGEMENT: easily find Song of King with one of the 2 Rivendell Minstrels, choose Beravor as multi-sphere resource collector and play Steward of Gondor on him + all the other Songs.\n\nWILLPOWER, ATTACK AND DEFENSE: use Celebrian's Stone and Dunedains attachments to increase Eowyn's Willpower (up to 8), Beravor's attack strength (up to 4) and Denethor's defense strength (up to 5). Attach \"A Burning Brand\" to Denethor and Protector of Lorien to Beravor, to increase both defense ability and willpower. Feed Protector of Lorien with multiple spare cards, as needed. You could have 20-40 cards in hand from which to choose in the last turns!\nSneak Gandalfs, play Northern Trackers and Mirkwood Runners to add great attack/defense power.\n\nIMPRESSIVE CONTROL: version 1.3 added Denethor and one great trick that I use all the turns. Use Henamarth Riversong ability than, if needed, use Denethor ability to bury the very nasty encounter card. Use Forest Snare to block big guys.\n\nFAST QUESTING: very easy with Protector of Lorien on Beravor and/or Denethor. Just discard the number of cards you need. With this deck you will have tons of cards to choose from!\n\nATTACKING TRICKS: Forest Snare + Mirkwood Runner + Infighting = kill enemies as soon as they appear on the stage!\nTrap some enemy with at least 4 HP with Forest Snare. Don't kill it, but attack it with Mirkwood Runner alone ('cause he ignores the enemy's defense stregth!) until the enemy has only 1 HP. Play Infighting from hand and move the damage from the trapped enemy to an enemy just revealed in the quest phase to kill it before it can even engage you!\n\nGood HEALING POWER granted by 3x Lore of Imladris and 2x Daughter of the Nimrondel (he has only 1HP, play her only when really needed)\n\nOTHER CARDS: play Miners to keep your heroes safe from nasty attachments, and Hammersmith to get back your most valuable discarded attachment. Play Dwarven tomb as needed.\n\nSIDE DECK: for Rhosgobel quest you can swap 1 Hammersmith, 2x Infighting, 2x Forest Snare for 2x Radagast and 3x Dunedain Cache to have Beravor ranged.\n\nHISTORY:\nVersion 1.2: changed Bilbo for Eleanor, 1 Runner for 1 Hammersmith and 1 Rumour of the Earth for 1 Dwarven Tomb\nVersion 1.3: changed Eleanor for Denethor, 1 Minstrel for 1 Song of Kings\n\n \n\nThe SUPER FAST Solo Deck v1.3\n\nHero (3)\nBeravor (Core) x1\nEowyn (Core) x1\nDenethor (Core) x1\n\n\nAlly (17)\nGandalf (Core) x3\nHenamarth Riversong (Core) x3\nDaughter of the Nimrodel (Core) x2\nMiner of the Iron Hills (Core) x2\nNorthern Tracker (Core) x2\nRivendell Minstrel (THFG) x2\nMirkwood Runner (RtM) x2\nErebor Hammersmith (Core) x1\n\n\nAttachment (24)\nProtector of Lorien (Core) x2\nForest Snare (Core) x3\nSteward of Gondor (Core) x3\nCelebrian's Stone (Core) x1\nUnexpected Courage (Core) x3\nSong of Kings (THFG) x2\nSong of Travel (THoEM) x1\nDunedain Mark (THfG) x2\nDunedain Quest (AJtR) x2\nDunedain Warning (CatC) x2\nA Burning Brand (CatC) x2\nSong of Wisdom (CatC) x1\n\n\nEvent (18)\nSneak Attack (Core) x3\nThe Galadhrim's Greeting (Core) x3\nWill of the West (Core) x1\nFortune or Fate (Core) x1\nA Test of Will (Core) x3\nInfighting (AJtR) x3\nLore of Imladris (Core) x3\nDwarven Tomb (Core) x1\n\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=565841","commentId":565841,"userName":"Bohemond2","timestamp":1323434497,"content":"I think that you need dwarven tomb in a deck like this one. You want to be able to get will of the west west back in your hand.\n\nI would encourage you to think more about your inital turns.  A deck like this always works well if it survives into mid game, but what's the best way to make sure you get there?  I think you are FAR better off with Elanor than Bilbo.  yes, it reduces the number of first turn allies you can play, but it also lowers your threat and gives you protection against events in the early turns.\n\nIn addition, you deck needs song of kings to really hum.  With only one song in the deck, you are quite vulnerable to anything that makes you discard the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=565869","commentId":565869,"userName":"booored","timestamp":1323441978,"content":"I would swap out Beravor for Elenore, and use your leadership splash to put in a ally with some higher attack power, maybe that orc slayer guy or the archer. Also 1xWill of the West and 1cFFate needs at least one Tomb, and 3 tombs imo is a must have for a spirit heavy deck like this. I mean Steward means you can cast Greating out of the yard for 4... that is pretty powerful ... Also if your running only one song you need to run hammersmiths and also, why use a slot for Rumor of the earth if you are making a draw deck.. who cares what the next card is.. your going ot be drawing at least 2 a turn anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=565880","commentId":565880,"userName":"Bohemond2","timestamp":1323443852,"content":"Rumour of earth let's you see the next encounter card, not the next player card.  That being said, the inclusions of three riversongs make it a tad redundant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=565907","commentId":565907,"userName":"sortylege","timestamp":1323450311,"content":"Until now, after 10 plays with all the Mirkwood cycle quests, I never had big problems with treachery cards.\n\nBut I've just finished another session with the last quest of the cycle, \"Return to Mirkwood\". My deck likes it very much.\nThis time I won and finished it in 9 turns, but with only two heroes alive 'cause a treachery card destroyed Bilbo on the second turn!\n\nI finished with more than 45 cards in my hand!\n\nI triggered Will of the West and  triggered one time the Forest Snare+Infighting trick but it was really crucial: trapped an Attercop, put 5 damage tokens and next turn I moved 3 of them to the poor King Spider as soon as it appeared on the stage! The same turn I won by sneaking Gandalf to put the remaining 4 damage tokens on the Attercop.\n\nDuring the game I used Beravor + 3 Unexpected Courage to draw up to 9 cards every turn. The Miner discarded a Condition on Beravor.\n\nI used 5 times Galadhrim's Greetings and sneaked Gandalf to lower my threat up to 50 points.\n\nSince I discovered that Bilbo isn't important - I managed a difficult quest without you, sorry old buddy! - I will change something next time.\n\n \n\nNext time I want to try to use Eleanor or Theodred instead of Bilbo.\nBilbo: + 1 card/turn.\nEleanor: very good control of Treacheries; less initial Threat; 1 more HP than Bilbo.\nTheodred: 1 more resource to Eleanor; no problem with initial Leadership resources\n\nI will listen to your advice and use Eleanor and I will trade 1 \"Rumour from the Earth\" for a 1 Dwarven Tomb. Maybe also I will swap a Mirkwood Runner for an Hammersmith.\n\nI must use her to attack and Beravor to defend, because I really want to protect my attachments from nasty shadow effects, using \"A Burning Brand\".\n\nBut Eleanor needs an Unexpected Courage, so I will not draw 9 cards per turn, but only 7. Will it be worth the sacrifice?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=565967","commentId":565967,"userName":"booored","timestamp":1323462724,"content":"Bohemond said:\n\nRumour of earth let's you see the next encounter card, not the next player card.  That being said, the inclusions of three riversongs make it a tad redundant.\n\n\n\n \n\noh yea tottaly, I've still not picked up Return yet.. opps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=566047","commentId":566047,"userName":"guciomir","timestamp":1323495441,"content":"Why do you call your deck super fast? It looks good, but also really slow. Don't take offence, I think your deck is efficent and can win many games. You need to set up an engine and gain massive resource / card advantage and then you proceed to win the game in just a few moves. But this is control strategy, not rush. Think about Rohan decks - they are really fast and can finish games way way before you. I am not saying that Rohan decks are better than yours, I am just saying they are faster.\n\nAnyway, this is the first time I see someone is using Infighting is solo deck, quite interesting.\n\nHow is your deck against Rhosgobel ? (no sideboard) . Did you play 10+ games and can you provide your victory ratio? Also, did you try Dol Guldur / Osgiliath ? I think your deck may have problems against enemies in the first 1-3 turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=566139","commentId":566139,"userName":"sortylege","timestamp":1323523153,"content":"I have done another game with Return to Mirkwood, this time with Eleanor instead of Bilbo. It was a mistake.\n\nAt the second turn Attercop arrived and killed her. So I had to give her to feed him. This is not a deck for two spirit heroes.\n\nThis deck need green resources in the first three turns to build up.\n\nI won easily, but too slowly, because my Gandalfs were buried at the bottom of my deck. It took me 15 turns!\n\nUsually no more then 10 turns with this very difficult scenario.\n\nNext time I will try with another green hero.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=566249","commentId":566249,"userName":"sortylege","timestamp":1323543253,"content":"With version 1.3 I reached the sweet spot\n\nToday with the very difficult quest Return to Mirkwood, this deck won 4 times very easily in 7-9 turns with best score of 107 (7 turns) and lost 2 times due to very bad big foes revealed on first/second turn.\n\nversion 1.3 added Denethor and one great trick that I use all the turns. Use Henamarth Riversong ability and then, if needed, use Denethor ability to bury the very nasty encounter card.\n\nTo reach a very fast conclusion of the quest, I realized it's not necessary to pick up many cards, but only if needed. So I used Beravor to attack and help Eowin questing and not only to drawing cards. I discarded from my hand 11 cards to feed Protector of Lorien, and I had only 5 cards in hand, but won on 8 turns this very difficult quest.\n\nAfter 3-4 turns you have 20 and more cards in hand, so it's very easy to find one of the cards I need: 2 Songs of Kings + 2 minstrels + 3 Stewards.\n\nEven if you don't find a way to collect violet resources with Steward, you can play only green and blue cards: first of all use Henarmath+Denethor abilities to push away bad guys and nasty Treacheries, secondly use Protector of Lorien (very powerful with 20 cards in hand!) and Forest Snare + Infighting + Runners to help defending/attacking.\nThis deck is pure flexibility and control and can be very fast.\n\nAnd thank you really for your good advices!\n\nNext time I think I will use a third Song of Kings, it's too important for this deck to find it fast.\n\nHISTORY\n\nVersion 1.2: changed Bilbo for Eleanor, 1 Runner for 1 Hammersmith and 1 Rumour of the Earth for 1 Dwarven Tomb\nVersion 1.3: changed Eleanor for Denethor, 1 Minstrel for 1 Song of Kings"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=566266","commentId":566266,"userName":"booored","timestamp":1323547830,"content":"Just remember that denathor puts the card at the bottom of the deck, so if the game goes long you end up with every single encounter draw being \"bad\" as you reach the point in the deck you have been scrying ... so every single draw is a card you previously discarded with denathor... Also if you are playing for points, sometimes it is worth letting a monster with VPs get though. I think the \"torny\" play will greatly hinge on players choosing to engage a VP monster"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=566310","commentId":566310,"userName":"Dam the Man","timestamp":1323572028,"content":"booored said:\n\nJust remember that denathor puts the card at the bottom of the deck, so if the game goes long you end up with every single encounter draw being \"bad\" as you reach the point in the deck you have been scrying ... so every single draw is a card you previously discarded with denathor...\n\n\n\nSolo game and if he is winning in 10 turns or so, that's 10 cards out of the Encounter deck which probably normally has 50-60 cards (?). Even using Denethor once per turn, that's still only 20 cards, maybe a few more due to surge, but in a 1-player game, especially with threat going up by 4 each turn, you'll finish a lot sooner than you see the bottom cards. Even in 2-player/deck games, I think I've gone through the entire Encounter deck in less than 5 plays (61 plays atm)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57364-the-super-fast-solo-deck-version-13/?do=findComment&comment=566312","commentId":566312,"userName":"booored","timestamp":1323573686,"content":"I play a lot of 3 player... drawing 3 cards a turn min can zip though an encounter deck .... I am not saying do not scry.. but it is something to remember when using Denathor, as if you DO get to the base of the deck.. you are in some trouble... therefore you need to build your deck appropriately so you can beat the quest in a single run of the encounter deck."}]}