{"url":"https://community.fantasyflightgames.com/topic/57406-healing-is-damage-removal-not-damage-reduction-right/","title":"Healing is damage removal not damage reduction right?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57406-healing-is-damage-removal-not-damage-reduction-right/?do=findComment&comment=566149","commentId":566149,"userName":"Sprenger","timestamp":1323524515,"content":"First off I'm fairly new to LOTR LCG, and I tried searching in the forums for this topic but was unsuccessful.\n\nThe player that taught me how to play the game told me, when a character would be defeated you can heal that character to reduce the damage it takes from an attack so your hero doesn't get killed.However that doesn't make any sense to me.\n\nI can see if your hero had 2 damage on him with 1 hit point left and an enemy would deal 2 damage to said character you could heal the 2 damage points off your hero before he recieve the next 2 damage but I don't agree with the fact that if Hummerhorns engages my hero who only has 4 points and no damage that I could use Daughter of the Nimrodel to prevent 2 of the 5 damage my hero would take so he could live.\n\nCan someone please confirm whether or not I can use healing cards/actions/abilities to prevent damage done by encounter cards/enemies.\n\n \n\nThanks,\nSprenger\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57406-healing-is-damage-removal-not-damage-reduction-right/?do=findComment&comment=566155","commentId":566155,"userName":"richsabre","timestamp":1323525775,"content":"you are correct in that its damage removal, you cant be attacked by hummerhorns against say bilbo (2hp) and reduce that damage so he could live"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57406-healing-is-damage-removal-not-damage-reduction-right/?do=findComment&comment=566159","commentId":566159,"userName":"Sprenger","timestamp":1323526584,"content":"Cool thanks.\n\nSo with that out of the way. Can I heal a character who already has damage on him between resolving the Shadow Effect and determining damage? This is a pretty fine line which I wouldn't be surpise if it was abuse constantly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57406-healing-is-damage-removal-not-damage-reduction-right/?do=findComment&comment=566164","commentId":566164,"userName":"17th Knight","timestamp":1323528313,"content":"If you look under \"Resolving Enemy Attacks\" it states that:\n\n\"Players may play event cards at take actions at the end of each step\"\n\nThe game steps during an enemy attack are:\n\n1. Choose an enemy\n\n2. Declare a defender\n\n3. Resolve Shadow effects\n\n4. Determine combat damage\n\n \n\nAlso, in the back of the rules, the entire combat phase (after the enemy is deal shadow cards) is in green. The green-highlighted rule states that in any phase where it is highlighted in green: \"Any player can take actions generally, or between the game steps stated int he rules\"\n\n \n\nSo, as 3 and 4 are separate steps, you can heal between them, as per the rules.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57406-healing-is-damage-removal-not-damage-reduction-right/?do=findComment&comment=566192","commentId":566192,"userName":"starhawk77","timestamp":1323532251,"content":"Sprenger said:\n\n \n\nI can see if your hero had 2 damage on him with 1 hit point left and an enemy would deal 2 damage to said character you could heal the 2 damage points off your hero before he recieve the next 2 damage but I don't agree with the fact that if Hummerhorns engages my hero who only has 4 points and no damage that I could use Daughter of the Nimrodel to prevent 2 of the 5 damage my hero would take so he could live.\n\n \n\n \n\nYou're basically right. The phase sequence posted by 17th Knight illustrates how your first example could work. If, after revealing the shadow card, you were to find your hero in peril, you would then have a chance to trigger actions (including healing any damage already on said hero). Keep in mind, though, that you can not heal in response to \"when revealed\" effects on treachery cards or damage from shadow effects. For instance, The Necromancer's Reach will damage all exhausted characters as soon as it is revealed, giving you no opportunity to use Daughter of the Nimrodel or play cards like Lore of Imladris. \n\nIn short, healing does not act as damage reduction. In the second example, the hero would be destroyed should you choose it as the target of the Hummerhorns' effect. Your instincts were correct happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n "}]}