{"url":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/","title":"infinte loop question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566530","commentId":566530,"userName":"kuffdaddy","timestamp":1323640858,"content":"So, we are playing Dead Marches yesterday.  Getting our butts handed to us just a horrible game, but an interesting situation popped up that had us scratching our heads here it is\n\nThalin is questing, last card to be dealt is the crows.  Now as we read it Thalins ability ticks auto killing it which immediately returns it to the deck so its surge ability triggers the same style effect basically creating an infinite loop of dying and triggering its own surge(since it never really hits the discard pile requiring us to shuffle because it is still the encounter deck by itself)\n\nWe looked through the FAQ and rule book, and that couldn't clearly answer it, unless we overlooked something.  The faq stated for an ability like Ealanor's cancel treachery the card is canceled but surge and doom still ticks off of it, so since it was revealed it died to Thalins ability rebecoming the encounter deck and then its surge happens from the previous death really just being an infinite loop\n\nthe unofficial faq kinda indicated the exact opposite of this when i was reading the section on Thalin.  So how would this resolve\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566534","commentId":566534,"userName":"radiskull","timestamp":1323641763,"content":" There's been a ruling that Thalin will kill the crows BEFORE surge triggers, IIRC."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566536","commentId":566536,"userName":"Young Ranger","timestamp":1323642026,"content":" 1. This is not an infinite loop. Look at the FAQ again. It tells you that Thalin's passive ability happens before keywords. So then Eastern Crows are killed before Surge happens.\n\n2. The real question is when do you have to shuffle the encounter discard pile back into the encounter deck. According to the rulebook, any point during the quest phase the encounter deck is empty, shuffle the encounter discard pile and make it the new encounter deck. So do you have to shuffle the encounter discard pile back in with the Eastern Crows or do you have Eastern Crows come off the encounter deck for each player?\n\nI am not sure and I think this is a question for Nate. But my initial reaction is that Eastern Crows comes off the encounter deck for each player because Eastern Crows gets shuffled back in before you have to get the next encounter card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566636","commentId":566636,"userName":"kuffdaddy","timestamp":1323679401,"content":"Young Ranger said:\n\n 1. This is not an infinite loop. Look at the FAQ again. It tells you that Thalin's passive ability happens before keywords. So then Eastern Crows are killed before Surge happens.\n\n2. The real question is when do you have to shuffle the encounter discard pile back into the encounter deck. According to the rulebook, any point during the quest phase the encounter deck is empty, shuffle the encounter discard pile and make it the new encounter deck. So do you have to shuffle the encounter discard pile back in with the Eastern Crows or do you have Eastern Crows come off the encounter deck for each player?\n\nI am not sure and I think this is a question for Nate. But my initial reaction is that Eastern Crows comes off the encounter deck for each player because Eastern Crows gets shuffled back in before you have to get the next encounter card.\n\n\n\n \n\nexactly which is what we thought too.  But there in is the infinite loop"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566788","commentId":566788,"userName":"starhawk77","timestamp":1323700712,"content":"From p.14 of the rules:\n\n\"If the encounter deck is ever empty during the quest phase, the encounter discard pile is shuffled and reset back into the encounter deck.\"\n\nSeems pretty clear to me. \"Ever\" is the key term here. As soon as Eastern Crows is no longer in the encounter deck (i.e. as soon as you pick it up to reveal it) the deck is empty. This forces a reshuffle of the entire encounter discard pile. Thalin's effect would then destroy the Crows and send them back into the (now restocked) encounter deck.\n\nRegardless, as Young Ranger noted, this will not create an infinite loop. Assuming my above interpretation is correct, here is what would happen in a two-player game:\n\n1. Thalin is committed to the quest. Eastern Crows is revealed (encounter discard reshuffled). Thalin kills the Crows before their surge keyword triggers (per the FAQ). The Crows are shuffled back into the full encounter deck.\n\n2. A second encounter card is revealed. Other stuff happens. No infinite loop.\n\nNow, assume my interpretation is wrong, and that the discard pile would not be reshuffled as I have indicated:\n\n1. Thalin is committed to the quest. Eastern Crows is revealed. Thalin kills the Crows before their surge keyword triggers. The Crows again become the only card in the encounter deck.\n\n2. Thalin is still committed to the quest. The Crows are revealed again, as the second encounter card. Thalin again kills them before they can surge. The Crows go back as the lone card in the encounter deck. No infinite loop.\n\nEither way, there is no loop, thanks largely to the fact that Thalin kills the Crows prior to any surge effects. The only difference between the two scenarios is that the first would leave you with one random encounter card in the staging area, while the second would leave the staging area empty. \n\nAlso note that, with the second sequence, the encounter deck would never actually get reshuffled as long as the players were to send Thalin questing each round. Unless the Crows were dealt as a shadow card, they would effectively serve as every revealed encounter card each round. Because this would leave the staging area empty and prevent the discard pile from ever reshuffling, I think my proposed sequence is more probable.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566821","commentId":566821,"userName":"Rashley","timestamp":1323708105,"content":"Many games leave it unclear as to exactly when discard piles are reshuffled to make new decks.  In some games it makes little difference wether you reshuffle as soon as the main deck is empty or when you have to draw.  However, in this game it can make a big difference.  The Thalin/Crows problem was fixed in the FAQ, so no loop, but I had to carefully read the rules again when some players were stating that you could get no Shadow Cards if during Questing your last Encounter card drawn emptied the deck.  I believe the rule as stated must be taken literally.  As soon as the deck is emptied DURING THE QUEST PHASE, reshuffle the discards.  Thus in the instance above, the Crows would be shuffled back into the newly formed deck.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566956","commentId":566956,"userName":"LEGA","timestamp":1323747454,"content":"Situation: Journey Down the Anduin. After successffull questing we proceed to step 3B and there left 1 encounter card. We provide this card as shadow at the Combat phase. So there is no more cards in encounter deck. Round is over. We proceed to Quest phase. And here is the questions: should we shuffle encounter discard pile and reset it to encounter deck or live it as is?\n\nAs info about reseting encounter deck described in staging step and according to quest card we must skip this step, so we don't need to reset it, am I right?\n\nActually this is question about what variant of Starhawk77's answer is correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566981","commentId":566981,"userName":"Rashley","timestamp":1323752439,"content":"LEGA.  I believe that there still is a Questing Phase but you don't add any new Encounter Cards as the 'Staging' part is ignored.  Therefore you would reshuffle the discards at the start of the Quest Phase.  You  may need to overcome Threat still in the Staging Area, and engaged enemies will now get Shadow Cards.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=566987","commentId":566987,"userName":"LEGA","timestamp":1323753272,"content":"Rashley, thanks. It is all clear, the question was in shadow cards. It would be nice not to give shadow cards to enemies. \"Don't seek the easy way\".)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57467-infinte-loop-question/?do=findComment&comment=567002","commentId":567002,"userName":"starhawk77","timestamp":1323756592,"content":"Rashley said:\n\nLEGA.  I believe that there still is a Questing Phase but you don't add any new Encounter Cards as the 'Staging' part is ignored.  Therefore you would reshuffle the discards at the start of the Quest Phase.  You  may need to overcome Threat still in the Staging Area, and engaged enemies will now get Shadow Cards.  Cheers!\n\n\n\nYeah, this is correct. The quest card only removes the staging step, not the whole quest phase. The encounter discard pile is reset if the encounter deck is ever empty at any point during the quest phase. Even though that rule is described in the staging section, it clearly applies to the entire phase. So, in LEGA's example, the supply of shadow cards would indeed be restocked. \n\nIn a shocking turn of events, the interpretation that makes life more difficult for the players is the correct one gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"}]}