{"url":"https://community.fantasyflightgames.com/topic/57468-2-questions-rumor-from-the-earth-questing/","title":"2 Questions (Rumor from the Earth, Questing)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57468-2-questions-rumor-from-the-earth-questing/?do=findComment&comment=566574","commentId":566574,"userName":"Ironmanrcm","timestamp":1323660650,"content":"I think I probably know the answers to these questions, but I wanted to make sure I was playing it right.\n\n \n\n1.   I was wondering if you had the opportunity to play Rumor from the Earth before each encounter card is turned over... (my guess is no, although would be really cool if it did work that way)\n\n \n\nFor instance, 3 players, rumor from the earth is played prior to questing and returned to hand after paying a lore resource.  Then, 1st encounter is turned over, can I play rumor from the earth again prior to the 2nd encounter card being turned over?  \n\nI know the \"Reveal 1 encounter card per player\" section is red on the chart...but the sub bullet is green...AND it does say in the rules that each encounter card is revealed 1 at a time and it's effects are resolved prior to turning over the next... \n\n \n\n2.  With regards to questing... If I were to quest successfully on Hunt for Gollum stage 1 and obtain the last progress token needed to move to stage 2, does the text on the stage 1 card still resolve \"after questing successfully...\"  or does the stage move to 2 before the text has a chance to trigger?   (my guess is yes)\n\n \n\nThanks for the responses in advance.\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57468-2-questions-rumor-from-the-earth-questing/?do=findComment&comment=566591","commentId":566591,"userName":"richsabre","timestamp":1323667343,"content":"not sure about 1 but after the last needed token is on that quest card its goes to stage 2 without the forced effect"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57468-2-questions-rumor-from-the-earth-questing/?do=findComment&comment=566593","commentId":566593,"userName":"starhawk77","timestamp":1323668234,"content":"1. No, you can't. If you look at the turn sequence chart at the back of the rule book, you'll see that the Quest Phase step \"Encounter deck reveals 1 card per player\" is highlighted in red. You can play cards and take actions before or after all encounter cards are revealed during a given Quest Phase. The exceptions, of course, are response effects like those on Eleanor and A Test of Will. Such effects can be played immediately when their specified triggers occur.\n\nSo, in your example, you could play Rumor from the Earth before revealing the first encounter card. You could then pay a resource to return Rumor from the Earth to your hand. However, you could not play Rumor from the Earth in between revealing the first and second encounter cards.\n\n2. Actually, you will still resolve the forced effect on stage 1B before proceeding to stage 2A. This was clarified in the latest FAQ (p.5):\n\n(1.24) Questing Successfully: Questing successfully and the physical placement of progress tokens are two separate game occurrences that happen in sequence during the Quest Resolution step. As soon as the players determine that the total committed Willpower is greater than the total Threat in the staging area, they are considered to have quested successfully. Any Forced or passive effects initiated by questing successfully resolve before physically placing progress tokens.\n\nExample: Tom has just successfully quested during stage 1B of The Hunt Begins (SoM 11), and he will be placing enough progress to advance to the next stage. However, he must first resolve the Forced effect (which resolves immediately upon the occurence of \"questing succesfully\") before placing progress tokens on the quest.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57468-2-questions-rumor-from-the-earth-questing/?do=findComment&comment=566594","commentId":566594,"userName":"Bungo_Underhill","timestamp":1323668365,"content":"richsabre said:\n\nnot sure about 1 but after the last needed token is on that quest card its goes to stage 2 without the forced effect\n\n\n\nThis incorrect the forced effect does trigger even on the turn the quest is completed. Check the latest FAQ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57468-2-questions-rumor-from-the-earth-questing/?do=findComment&comment=566597","commentId":566597,"userName":"richsabre","timestamp":1323669000,"content":"ah my bad, there was a discussion about this when it came out that ended with what ive been doing, didnt realise it had been clarified"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57468-2-questions-rumor-from-the-earth-questing/?do=findComment&comment=566749","commentId":566749,"userName":"Ironmanrcm","timestamp":1323693544,"content":" Thanks for the clarification guys!"}]}