{"url":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/","title":"Usage of Meneldor&#039;s Flight or Born Aloft?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=566768","commentId":566768,"userName":"zeb","timestamp":1323697221,"content":"Now that Nate has ruled [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=589087] that Meneldor's Flight cannot be used to return Vassal of the Windlord at the end of a combat, how would you use it effectively? Same question for Born Aloft: since you cannot use it to return Escort  from Edoras at the end of Quest, what is the best use for it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=566772","commentId":566772,"userName":"starhawk77","timestamp":1323698000,"content":"Right now, the only card that makes sense in conjunction with Meneldor's Flight is Descendant of Thorondor. Play the eagle, deal 2 damage to an enemy in the staging area, and then return it to your hand with Meneldor's Flight for another 2 damage. That combo is probably inferior to Sneak Attack + Descendant, but it could have its uses. Plus, it doesn't require any Leadership resources in case you happen to be using a mono-Tactics deck.\n\nAs for Born Aloft, it can also work with the Descendant. However, its flavor text hints at its best application: returning Gandalf to your hand. You could also use it to remove Eomund from play and ready several Rohan characters. So, even with the ruling, Born Aloft is still pretty good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=566775","commentId":566775,"userName":"zeb","timestamp":1323698410,"content":"starhawk77 said:\n\nAs for Born Aloft, it can also work with the Descendant. However, its flavor text hints at its best application: returning Gandalf to your hand. You could also use it to remove Eomund from play and ready several Rohan characters. So, even with the ruling, Born Aloft is still pretty good.\n\n\n\nThanks! I forgot the obvious indeed: Gandalf!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567053","commentId":567053,"userName":"Kobu","timestamp":1323768971,"content":"I'm afraid that the issue is still clear as mud. I was thinking the various return to hand actions could be used to defend and then save the ally from dying, which really seems to be the intent, but I really have no idea if that's valid."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567068","commentId":567068,"userName":"zeb","timestamp":1323771034,"content":"Kobu said:\n\n \n\nI'm afraid that the issue is still clear as mud. I was thinking the various return to hand actions could be used to defend and then save the ally from dying, which really seems to be the intent, but I really have no idea if that's valid.\n\n \n\n \n\n \n\nHi Kobu. Can you give examples of combos you are not sure about? I was hoping my thread was clear. What is important is that:\n\n * Forced effects must be played at the end of the step they are triggered, but before voluntary player actions or events;\n * An attack resolves when you do step 4 of enemy attack or step 3 of player attack -> this triggers \"Forced: After an attack in which X attacked/defended resolves\" or \"Forced: After X attacks...\";\n * A quest resolves when you do step 3 of quest phase -> this triggers \"Forced: After resolving a quest to which X was committed...\"\n\nThis leads to the sequence: Step actions (such as calculations/token placements/threat increases/etc) -> Forced effects -> Player actions/events. So if a card has a Forced effect that discards it, you cannot return this card with an Action that returns a card from play, because the Action arrives too late (except if the Action allows you to return a card from the discard pile)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567093","commentId":567093,"userName":"Valyrian Steel","timestamp":1323773301,"content":"I am also a big fan of born aloft + snowborn scout. I'm sure this would work to even greater effect with decks built around Prince."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567103","commentId":567103,"userName":"17th Knight","timestamp":1323774863,"content":"I have the same problem as kobu. If you are in combat, and you have an ally who blocks, can you assign them damage and then \"born aloft\" to save them from death? Essentially blocking the attack, taking the damage, but not destroying the ally.\n\n \n\nIf not then...what's the point of the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567149","commentId":567149,"userName":"starhawk77","timestamp":1323782443,"content":"17th Knight said:\n\nI have the same problem as kobu. If you are in combat, and you have an ally who blocks, can you assign them damage and then \"born aloft\" to save them from death? Essentially blocking the attack, taking the damage, but not destroying the ally.\n\n \n\nIf not then...what's the point of the card.\n\n\n\nNo, this won't work. Once the damage has been tallied in step 4 of the enemy attack resolution (rule book, p.18), it is assigned immediately; there is no chance to play actions. You could use Born Aloft prior to step 4, but then the attack would be undefended and you would be forced to assign all damage to one of your heroes. \n\nI already offered a few examples of how one might use Born Aloft effectively. Returning Gandalf to your hand before the end of the round, removing Eomund from play, etc. Usually, Born Aloft operates as copies 4-6 of Gandalf, but it's actually pretty flexible. Also, if one of your meaty allies (say, Beorn) has taken a lot of damage, Born Aloft will act as a heal of sorts (although you'll have to pay the ally's cost a second time).\n\nAs for Meneldor's Flight, it works well with Descendant of Thorondor (as does Born Aloft, incidentally). Aside from that, though, it's pretty useless if you're a competitive gamer. On the other hand, players who favor a thematic experience (\"Bilbos\") might enjoy Meneldor's Flight precisely because it works well with a particular eagle character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567150","commentId":567150,"userName":"zeb","timestamp":1323782742,"content":"Valyrian Steel said:\n\n \n\nI am also a big fan of born aloft + snowborn scout. I'm sure this would work to even greater effect with decks built around Prince.\n\n \n\n \n\nThere is no problem with this combo. Snowbourn is not forced to leave play when quest or attack is resolved. This would be similar to returning Gandalf, as starhawk77 pointed out in the post above.\n\nI think there is a misunderstanding about what these clarifications try to achieve. They clarify that a Forced response triggered by \"Forced: After combat resolves\" is played before player actions of the last step of the attack. The ambiguity was when an attack is considered as resolved: it is at the end of the step 4 of an enemy attack, or at the end of step 3 of a player attack.\n\nIf your ally is not forced to be discarded, then no worries."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567300","commentId":567300,"userName":"qwertyuiop","timestamp":1323812076,"content":" Doesn't removing a defender from combat result in the attack being considered undefended? \n\nAnd does Meneldor's Flight affect cards that are already discarded?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567322","commentId":567322,"userName":"starhawk77","timestamp":1323818594,"content":"qwertyuiop said:\n\n \n\n Doesn't removing a defender from combat result in the attack being considered undefended?\n\nAnd does Meneldor's Flight affect cards that are already discarded?\n\n \n\n \n\n1. Yes. From p.18 of the rules:\n\n\"If a defending character leaves play or is removed from combat before damage is assigned, the attack is considered undefended.\"\n\n2. No. According to p.25 of the rules, the discard pile is an \"out of play\" state, and card effects do not interact with cards in an out of play state unless those effects specifically allow it (e.g Stand and Fight or Fortune or Fate)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57488-usage-of-meneldors-flight-or-born-aloft/?do=findComment&comment=567345","commentId":567345,"userName":"zeb","timestamp":1323825473,"content":"qwertyuiop said:\n\n Doesn't removing a defender from combat result in the attack being considered undefended? \n\n\n\nThat is correct. Furthermore, Nate has also clarified that removing an attacker between steps 2 and 3 of player attacks also removes their attack strength from the total."}]}