{"url":"https://community.fantasyflightgames.com/topic/57668-tips-for-3-and-4-player-games/","title":"Tips for 3 and 4 player games","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57668-tips-for-3-and-4-player-games/?do=findComment&comment=568230","commentId":568230,"userName":"Skowza","timestamp":1324025119,"content":"We mostly play 3 player games right now and have an occasional 4th who joins us.  We don't generally have problems getting through a quest but we do have a few problems no matter how many people are in the game.  What combination of characters does everyone suggest for a 3 player game and what sphere(s) can we skimp on?  Currently gave 2 Core sets and we use decks consisting of the following heroes\nGloin + Eowyn+  Eleanor\nGimli + Thalin + Dain Ironfoot\nBeravor + Frodo + Glorfindel\n\nFrankly I think we would be better off with the Lore player ditching Glorfindel and adding another sphere to his deck, but he's really happy with it the way it is.  I feel like we have problems dealing with heavy combat and we only managed to handle Gollum's escape attempts by getting a Fast Hitch + Celebrian's Stone + Protector of Lorien on Frodo so he could Quest and then ready to deal with Gollum (I was using Frodo instead of Eleanor at that point). \n\nThe deck that is most likely to change is the Spirit deck since it is mine and I have a full Core to myself (hopefully 2 soon), so I can play pretty much anything as long as I am not using their heroes.  Any suggestions or critique would be welcome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57668-tips-for-3-and-4-player-games/?do=findComment&comment=568594","commentId":568594,"userName":"Zjb12","timestamp":1324110383,"content":" We only have 1 core set and the aps through emyn muil.  I play with my two hobbits at home, or alone.  As of last week, we finally beat the only quest we had left, Dol Guldur.  It seems to me, if there is a sphere we are light on, it is usually leadership.  I look at spirit as quest power and threat control, lore as healing power with a minor in questing, tactics as battle, leadership as battle and extra cash(kuz of steward of gondor!). When I play alone, I tend to do a multisphere deck, this has often centered upon glorfindel, eowyn, and Gimli.  I still throw in probably 4-5 leadership cards, (sneak attack and steward).  Though I don't always get the right song card, when I do and the cArds come out in good order, the extra cash and sneak attacks for gandalf or desc. Of thorondor are big."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57668-tips-for-3-and-4-player-games/?do=findComment&comment=568704","commentId":568704,"userName":"Young Ranger","timestamp":1324129659,"content":" My meta is almost always 3 player games. My one friend uses Elanor, Eowyn, and Imrahil with a Rohan themed deck. The second friend uses Glorfindel, Legolas, and Denethor. He wants it to become an Elf deck and is slowly working toward it. My deck (right now) is Gimli, Thalin, and Brand with an Eagle theme. I have dropped Thalin for Gloin and added in Leadership cards at times.\n\nI hope this helps"}]}