{"url":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/","title":"Thoughts on Gwaihir and eagle heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568248","commentId":568248,"userName":"Titan","timestamp":1324029063,"content":"So, I've been playing a bit with an eagle deck and the most glaring omission I see is that there are no eagle heroes. This got me to thinking a bit: one would expect that said hero would be Gwaihir. It also would be safe to assume that he would be a member of the tactics sphere since every eagle, so far, is in that sphere. But what if he was made a member of the leadership sphere with an effect like \"Gwaihir can pay for eagle cards regardless of sphere affiliation\" ? I think that would really help the deck, being able to include leadership cards without having to rely on Songs and still be able to pay for eagles. Then, perhaps, you could have a straight tactics eagle hero(Meneldor??????) to complement him. \n\nI sort of envision Gwaihir as a strong quester, he is an eagle after all, and good all around. This too would fit in with Leadership. Say, a 3/2/2 with 4 hit points. Yeah, he would be an expensive hero, but except for Gloin, all leadership heroes are expensive. \n\nSo, what do you guys think? Does it make any sense, or am I way off here? I know that we are also moving off eagles in favor of dwarves, but since we have a number of dwarf cards already, including multiple heroes, and more on the way in the expansion box, I think there could be room for an eagle. Perhaps in the early packs of the next cycle, since those involving travelling over the Misty Mointains?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568300","commentId":568300,"userName":"richsabre","timestamp":1324040763,"content":"yeah i agree, strange we havnt seen him, maybe in the dwarrowdelf cycle? i know it wouldnt tie in to the underground quests, but some are in the mountain passes, also mirkwood cycle had some random heros thrown in (imrahil......)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568387","commentId":568387,"userName":"CrowOfPyke","timestamp":1324052144,"content":"I doubt we will ever see any heroes from the eagles.  Why?  Well, in the books, specifically \"The Silmarillion\", we learn that the eagles were made by the Valar in the First Age to serve as protectors of mighty elven lords and their hidden cities, against the might of Morgoth (Sauron's boss).\n\n \n\nThey were never intended as great heroes of Middle Earth, even though they still guard the elves and answer to the wizards (also created by the Valar).  Given that the wizards are treated as allies in this LCG, I would expect exactly the same of the eagles and no more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568413","commentId":568413,"userName":"Titan","timestamp":1324059088,"content":"That would be a disappointment, as that seems like a poor reason not to have an eagle hero. It would leave a rather glaring hole in terms of deck symmetry. Other theme decks, be it Rohan, dwarves, etc, seem to have multiple heroes, yet an \"eagle\" deck cannot even muster one? It would be an unfinished product if FFG gave us the tools to put together an entire deck, but not the proper heroes for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568464","commentId":568464,"userName":"zombiemailman","timestamp":1324070335,"content":"I hear you, Titan! I've wanted Gwaihir as an Eagle Hero for awhile now. I don't think that it would be out of character for him to be a hero, either.  I'd also throw in here that since we will be traveling all over the Misty Mountains and in contact with Lothlorien, that an Eagle hero would fit nicely in the Dwarrowdelf cycle.\n\nThe chapter Out of the Frying Pan and Into the Fire from The Hobbit refers to \"The Lord of the Eagles\":\n\n\"There he found all the others sitting with their backs to the mountain wall. The Lord of the Eagles also was there and was speaking to Gandalf.\"\n\nThe next chapter ***** Lodgings foreshadows that Eagle's future rule:\n\n\"And so they parted. And though the Lord of the Eagles became in after days the King of All Birds and wore a golden crown, and his fifteen chieftains golden collars (made of the gold that the dwarves gave them), Bilbo never saw them again—except high and far off in the battle of Five Armies.\"\n\nI'd say the Leadership sphere would fit Gwaihir well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568588","commentId":568588,"userName":"Zjb12","timestamp":1324109256,"content":" Good arguments!  Makes me wonder on a tangent if we will ever see Shadowfax, not as a hero neccessarily, but maybe a future ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568595","commentId":568595,"userName":"richsabre","timestamp":1324110439,"content":"Zjb12 said:\n\n Good arguments!  Makes me wonder on a tangent if we will ever see Shadowfax, not as a hero neccessarily, but maybe a future ally.\n\n\n\n \n\nShadowfax (SPIRIT)\n\nALLY\n\nexhaust and discard shadowfax to discard all locations in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568602","commentId":568602,"userName":"Zjb12","timestamp":1324110824,"content":"richsabre said:\n\nZjb12 said:\n\n \n\n Good arguments!  Makes me wonder on a tangent if we will ever see Shadowfax, not as a hero neccessarily, but maybe a future ally.\n\n \n\n \n\n \n\nShadowfax (SPIRIT)\n\nALLY\n\nexhaust and discard shadowfax to discard all locations in play.\n\n\n\n \n\nKaboom!!!  Whats the cost on that going to be!  Like 10?!?  happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568610","commentId":568610,"userName":"richsabre","timestamp":1324111667,"content":"Zjb12 said:\n\nrichsabre said:\n\n \n\nZjb12 said:\n\n \n\n Good arguments!  Makes me wonder on a tangent if we will ever see Shadowfax, not as a hero neccessarily, but maybe a future ally.\n\n \n\n \n\n \n\nShadowfax (SPIRIT)\n\nALLY\n\nexhaust and discard shadowfax to discard all locations in play.\n\n \n\n \n\n \n\nKaboom!!!  Whats the cost on that going to be!  Like 10?!?  happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\n \n\nhaha, probably only can be played when you have gandalf in your hand or something thematic like that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568615","commentId":568615,"userName":"Titan","timestamp":1324112410,"content":"Zjb12 said:\n\n Good arguments!  Makes me wonder on a tangent if we will ever see Shadowfax, not as a hero neccessarily, but maybe a future ally.\n\n\n\n\n \n\nI don't see why not. He should be made at some point. And he would be fine as an ally. Creature allies, particularly those from the spirit sphere, fit well in the eagle deck because you usually need a strong questing hero(Eowyn, for me) plus you have Radagast, therefore it's easy to play them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=568718","commentId":568718,"userName":"USS Daedalus","timestamp":1324133595,"content":"The only issue with eagles as heroes is that they only rarely show up in the novels, and only then as brief helpers or assitants. It's like Beorn, yes he is HEROIC, but he doesn't care to stick around long enough. I can't see Gwaihir caring enough to wander around with a bunch of groundlings for long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=569117","commentId":569117,"userName":"richsabre","timestamp":1324262135,"content":"Brand doesnt either though, just briefly mentioned through the appendixes (if i remember rightly?),  gloin or dain arent heard of much, or actually when i think about it quite a few of the heros, but i guess thats what i like about the games, they dont just stick to the obvious heros ie. the fellowship charcters (though i cant wait to see sam and pippin)\n\n \n\ni really do think he'll show up though, i mean they seem to be really pushing the eagle theme so far (and rohan), and i hope the eagle theme stays, not so much the rohan, i dont know why, even in the books they were never my most interested people"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=569204","commentId":569204,"userName":"gatharion","timestamp":1324289827,"content":" I'd love to see an Eagle Hero or two. Frankly it's weird that we have so many eagle allies and Gwaihir is nowhere to be seen.\n\nI've suggested the same thing as the OP. Gwaihir as a Leadership Hero with the special ability of being able to spend his resources on Eagle cards.\n\n \n\nAlso, Shadowfax as an Ally seems like a given."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=569356","commentId":569356,"userName":"dvang","timestamp":1324304182,"content":"He is a hero as much as Gandalf is a hero.  In other words, he isn't a Hero, but will and should be a unique ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57669-thoughts-on-gwaihir-and-eagle-heroes/?do=findComment&comment=569361","commentId":569361,"userName":"richsabre","timestamp":1324304682,"content":"theres nothig to say hes anything yet- he may not even turn up at all"}]}