{"url":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/","title":"eowyn finally lost her monopoly of the solo quester","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569124","commentId":569124,"userName":"richsabre","timestamp":1324264384,"content":"I know this hasnt JUST happened, its been getting better since HFG came out, but i dont know about others but ive been waiting for months for enough willpower boost cards to come out to start questing successfully with almost any other hero selection (especially tactics), at the start several people inc. me were a bit mythed as to why she almost had to have place to make a strong quest deck, but now my eyes can rest elsewhere. not to say her 4 will power isnt handy, she just appears to have lost some of the ooomph that she had when only the core set existed, and im pleased that i can now take my 1 willpower tanks along with my eagles, slap song of travel on them, and both quest and smash the enemy to pieces"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569144","commentId":569144,"userName":"Beast Rabban","timestamp":1324272754,"content":"Protector of Lorien makes pretty much any hero into a willpower generating machine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569155","commentId":569155,"userName":"Glaurung","timestamp":1324277948,"content":"I didn use her already for 4 months without any problem. She is good but there is the way to how to play without her.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569158","commentId":569158,"userName":"richsabre","timestamp":1324278499,"content":"Beast Rabban said:\n\nProtector of Lorien makes pretty much any hero into a willpower generating machine.\n\n\n\n \n\ntrue, it is a very powerful card, matched with bilbos extra card draw it is amazing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569367","commentId":569367,"userName":"Titan","timestamp":1324305924,"content":"The one advantage she still has is that her 4 willpower is built in. For everyone else, something must be played and resources spent to get to that level. Even getting her to 5 willpower isn't too difficult. The only real answers, without having to rely on playing something, are a much more expensive Glorfindel and using Dain in a dwarf deck. Aside from that, yes, several options, but all have to be drawn and paid for.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569431","commentId":569431,"userName":"booored","timestamp":1324315397,"content":"yea, most players after a while start to realize that she is not as good as she seams. When the card pool was smaller she was much better though.. still as people started to play it soon became apparent that she was basically for noobs. A hero that had some uses, but is in many ways designed to help new players get a grip on the game by giving them a nice base quest power to begin with.\n\nFor more advanced players we all soon started to notice that by mid game we where questing or 16-20 each time and that with some of the combos, like UC+Beravor+Protector or MapMaker, Farimar.. etc etc we could even precisely control our questing, never to much , never to little. And then we all started to notice that she is in fact really bad.\n\nIf you take her quest power off the table, what has she got? Nothing. Low HP, no cool effects... once you start running more powerful questing allies, she basically becomes unless. Much better to pick a hero with some utility in their card text. Otherwise you are effectivly playing a 2 hero game, as 1 of your heroes is now a dead card... contributing nothing.\n\nShe still has some use though in 3player + games. We all know that these quest start with a bang and get easier as the quest gose long, you often win or loose in 1b. In a 3 player game, pulling 3 encounter cards a turn minimum, that initial need to raw questing power right at the start is pretty huge. So she can still make it into 3+ player games imo.\n\nefidm - not to say her 4 will power isnt handy, she just appears to have lost some of the ooomph that she had when only the core set existed\n\nexactly, and I think this effect will get larger and larger, as more and more cool cards come out the fact that her only good point is her quest power, will basicly mean she slowly be phased out of most decks, well... assuing she isn't already"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569440","commentId":569440,"userName":"leptokurt","timestamp":1324316580,"content":"booored said:\n\n \n\nIf you take her quest power off the table, what has she got? Nothing. Low HP, no cool effects... once you start running more powerful questing allies, she basically becomes unless. Much better to pick a hero with some utility in their card text. Otherwise you are effectivly playing a 2 hero game, as 1 of your heroes is now a dead card... contributing nothing.\n\n \n\n \n\nHuh? Éowyn's big plus is her WP, so if you take it away, yes, there's not much left. As when you take away Gimli's special power, he's just a funny dwarf. That's exactly why she is so useful - while she is questing, the other heroes and allies can attack, defend or use their special abilities. If Èowyn is in your deck, the game becomes much easier and you get besser scores. Especially if you play with only coreset as I do.\n\nHer other plus, of course, is being a spirit hero that has a threat of 9 only. And that she's there for you at the start of the game, unlike those cards that are in your deck - and we all know that the first two rounds are the most important ones.\n\n \n\nETA: only read your edit after writing this - with that I can agree"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569446","commentId":569446,"userName":"booored","timestamp":1324316905,"content":"leptokurt said:\n\nHuh? Éowyn's big plus is her WP, so if you take it away, yes, there's not much left.\n\nthat is the entire point. She is nearly usless once you do not consider her WP... the low threat is somthing I forgoit to mention, but even with that there are much better options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569459","commentId":569459,"userName":"Trantor3","timestamp":1324318009,"content":"I don't really get this thread. Willpower is arguably the hardest stat to come by, and there is still no comparable other hero who is nearly as good at questing. It's true that there are now more good questing allies than just in the Core Set., but the same is true for all other aspects as well. I haven't quite understood why she seems less and less necessary for you guys; is it just better questing allies? Because the heroes can't be it.\nYeah, Eowyn is totally focussed on questing, she is inflexible, and playing with her is neither very sophisticated nor very exciting. But I still consider her the best hero in the game together with Beravor. She is a superb quester all on her own, without needing any support at all. Calling her \"bad\" is certainly an exaggeration and simply not true.\n\nMaybe I should add that I play 95% of my games with 2 players where Eowyn is probably stronger than in solo mode. We also play several games without Eowyn to have variety, but games with her always seem to be easier than ones without her (similar to Beravor)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569466","commentId":569466,"userName":"Titan","timestamp":1324319056,"content":"I have to totally agree with Trantor. I find the assertions that she is for new players and worthless later in the game, ridiculous. Does questing somehow stop after the first few turns? She is the most efficient quester out there, beginning to end. She frees up your other heroes and allies to do other things that need doing and decreases the need to be playing combos that increase willpower. This is huge for a single player, specially early on. Just about anything that helps other characters to quest more effectively will help her, as well. \n\nOne good example of how she is still very useful is the Gollum escape checks on Dead Marshes. I used her exclusively to deal with them and she almost never loses them. With her, the chances of losing Gollum to the encounter deck are remote. One Unexpected Courage and she will handle both questing and the checks. And the rest of your characters can handle whatever else that quest can throw at them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569479","commentId":569479,"userName":"booored","timestamp":1324320548,"content":"questing doesn't stop, but as you get better at the game and better at deck building you son realize that quest power is not as rare a commodity as it seamed when you started playing. She is a hero that is pretty much only usable for questing, and that usability itself becomes nearly obsolete in the mid to late game as your questing power is so high that 4 WP is pretty trivial.\n\nMost players start to work this out and stop using her, as you can use a hero that has much much much more utility in her place. Creating faster stronger and higher scoring decks.\n\nPut her aside and look at your deck construction to handle the questing and start using your heroes for printed abilities... you will be surprised.. and I doubt you will go back.\n\nAlso, just to re-state, she dose have a place in 3+ player games still."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569482","commentId":569482,"userName":"Bullroarer Took","timestamp":1324320986,"content":" So when Fantasy Flight runs a tournament for solo players at the next GenCon with a $10k prize you aren't taking Eowyn?  As much as I hate her, I sure would."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569487","commentId":569487,"userName":"booored","timestamp":1324322173,"content":"Bullroarer Took said:\n\n So when Fantasy Flight runs a tournament for solo players at the next GenCon with a $10k prize you aren't taking Eowyn?  As much as I hate her, I sure would.\n\n\n\n \n\nwe will find out eventually.. but my money says \"no she would NOT be the winning players groups.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569496","commentId":569496,"userName":"Titan","timestamp":1324323607,"content":"booored said:\n\nquesting doesn't stop, but as you get better at the game and better at deck building you son realize that quest power is not as rare a commodity as it seamed when you started playing. She is a hero that is pretty much only usable for questing, and that usability itself becomes nearly obsolete in the mid to late game as your questing power is so high that 4 WP is pretty trivial.\n\nMost players start to work this out and stop using her, as you can use a hero that has much much much more utility in her place. Creating faster stronger and higher scoring decks.\n\nPut her aside and look at your deck construction to handle the questing and start using your heroes for printed abilities... you will be surprised.. and I doubt you will go back.\n\nAlso, just to re-state, she dose have a place in 3+ player games still.\n\n\n\nbooored said:\n\nquesting doesn't stop, but as you get better at the game and better at deck building you son realize that quest power is not as rare a commodity as it seamed when you started playing. She is a hero that is pretty much only usable for questing, and that usability itself becomes nearly obsolete in the mid to late game as your questing power is so high that 4 WP is pretty trivial.\n\nMost players start to work this out and stop using her, as you can use a hero that has much much much more utility in her place. Creating faster stronger and higher scoring decks.\n\nPut her aside and look at your deck construction to handle the questing and start using your heroes for printed abilities... you will be surprised.. and I doubt you will go back.\n\nAlso, just to re-state, she dose have a place in 3+ player games still.\n\n\n\n\n \n\nBut that's just it, I don't need to worry too much about my deck questing because that's what she does. She doesn't go into every deck, but when she does, it immediately changes the considerations for the deck build. Cards that would have to go in there to compensate, become unnecessary. And I've never needed enormous amounts of willpower to quest effectively. Managing the staging area usually suffices. Perhaps if you are playing for a score, this is a consideration, but I couldn't care less about it, I'm just interested in winning and I manage that fine with her.\n\nAs for the heroes, was that a tip? Look, there are many reasons I use them, their attributes, starting threat, how they fit into the deck, printed abilities is just one consideration. And I wonder just how many players have decided that they are better off without her. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569513","commentId":569513,"userName":"Zjb12","timestamp":1324327380,"content":" Tonight when I had her questing at 8-9 (celebrain's stone, 2 favor of the lady, discard) iit sure helped out a lot!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569530","commentId":569530,"userName":"Zjb12","timestamp":1324330196,"content":" P.S.  She is in everyone of the top six players set of heros for juicebox's weekly tournament so far this week."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569534","commentId":569534,"userName":"Beast Rabban","timestamp":1324331260,"content":"Zjb12 said:\n\n P.S.  She is in everyone of the top six players set of heros for juicebox's weekly tournament so far this week.\n\n\n\nI wouldn't read to much into that.\n\nShe fits a particular deck style well as other heroes do for other decks. I use her in my Rohan deck and I don't use her in my lore spirit deck at all.\n\nI think what the original poster is implying is correct that she is not the crutch that we used to rely on all the time that she used to be. With better allies, better card pool that make decks without her work better she has lost a little of her luster. I also think that as we got quests where questing for as much as you could as quick as you could came out that she was not as useful.\n\nI like her but I have more decks that don't use her than those that do now. I would confidently say that my best and most efficient deck doesn't use her.\n\nTop spirit hero for my mind is Frodo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569586","commentId":569586,"userName":"richsabre","timestamp":1324352453,"content":"the point is is that with the ever growing card pool, if you have to rely on one hero all the time to do any particular thing, then the game has a fault. this isnt the case though- eowyn was there to break beginners in when the card pool was small and the game still seemed impossibly hard, and yes she is extremely powerful questing, but she isnt the be all and end all of a good quester like she was in april.  that was the point of this thread\n\n \n\nthis is coming from a 'bilbo' player, so my point is that it is good for thematic players, becasue you dont have to think,eeermm now how to i fit eowyn into my dwarf  deck!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569646","commentId":569646,"userName":"Glaurung","timestamp":1324367487,"content":"Wow!!! All players love Eowyn so much!!! Here is really big discus. And someone notice she is the best hero in the game together with Beravur.\n\nYes she is good hero but Beravur is not a good hero. SHe really unbalanced hero with so POWEWFULL ability which is broke the game completely!\n\nI think Beravur should to have errata: Limit once per round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569669","commentId":569669,"userName":"leptokurt","timestamp":1324370690,"content":"richsabre said:\n\nthe point is is that with the ever growing card pool, if you have to rely on one hero all the time to do any particular thing, then the game has a fault. this isnt the case though- eowyn was there to break beginners in when the card pool was small and the game still seemed impossibly hard, and yes she is extremely powerful questing, but she isnt the be all and end all of a good quester like she was in april.  that was the point of this thread\n\n \n\nthis is coming from a 'bilbo' player, so my point is that it is good for thematic players, becasue you dont have to think,eeermm now how to i fit eowyn into my dwarf  deck!\n\n \n\n \n\n\n\nThat's what I can agree with, but not with Boored's statement that she has become useless. Furthermore I think most of the posters here have 2 or 3 corsets. I have only one corset, so only 1x UC, 2xGG, 2xNT and so on. So if I don't use Eowyn I have to take either Glorfindel to ahve ebough WP or one of the card drawing heroes to increase tmy chances to get the good cards. Frodo of course also a good alternative, but the other two spirit heroes just can't replace Éowyn.\n\nThere's of course also a difference between playing solo or with 2 players. More players means more deck building flexibility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569691","commentId":569691,"userName":"Zjb12","timestamp":1324374629,"content":" I only play with one core set as well.  Also, I have only been playing since November.  Eowyn certainly does have her weaknesses, basically attack and defense are useless.  I recognize that and accept it when I use her.  Also, I have definitely learned a lot from you guys in the last few weeks which has really accelerated my game play.  So thanks!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569940","commentId":569940,"userName":"Grimbob","timestamp":1324413736,"content":"I agree that her base willpower is less impressive given that its easier to field several heroes with base 2-3 wp ( especially with dain.)  Eowyn's ability still shines in multiplayer games with higher card draw (beravor/uc, bilbo, mathom/second breakfast, etc)because she makes a useful \"card dump\" for the group. dont feel that the Rohan keyword is a huge advantage either (im just not impressed with Rohan strategies). My sense is that she can reclaim some of her thunder if there are better synergies for the Rohan keyword."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569962","commentId":569962,"userName":"TragicTheBlathering","timestamp":1324419822,"content":"I have 3xcore + shadows... and I agree with the most of the people here, she is good.. but her place in decks is diminishing. IMO, there are better options then her right now in most cases."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=569973","commentId":569973,"userName":"soullos","timestamp":1324424500,"content":"Anyone want to give me some advise on what would be a good replacement for Eowyn in solo mode? I admit, I don't play that much and I play even less in solo play. My main reason was the noob in me (and still is) can't justify not using her. And I find that boring. I want to enjoy the solo aspect of the game. I play mostly Tactics, but Lore and Leadership are fun as well (Spirit is my least favorite, mainly becuase of Eowyn's monolpoy for so long...). I have every AP so far, but I've grown rusty from the lack of play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=570281","commentId":570281,"userName":"Beast Rabban","timestamp":1324513289,"content":"Glaurung said:\n\n \n\nWow!!! All players love Eowyn so much!!! Here is really big discus. And someone notice she is the best hero in the game together with Beravur.\n\nYes she is good hero but Beravur is not a good hero. SHe really unbalanced hero with so POWEWFULL ability which is broke the game completely!\n\nI think Beravur should to have errata: Limit once per round.\n\n \n\n \n\nCan I just say that you are a complete ass.\n\nI am really getting sick of your condescending  attitude to other posters on this forum. We all know you are gods gift to LCG players but if you have nothing worth while to say other than to ridicule other players posts and ideas then please don't bother.\n\nOh and the thread is about Eowyn not Beravor so if you wish to generate discussion on the balance of that hero start your own thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57785-eowyn-finally-lost-her-monopoly-of-the-solo-quester/?do=findComment&comment=570316","commentId":570316,"userName":"mkultra","timestamp":1324536114,"content":"Beast Rabban said:\n\nCan I just say that you are a complete ass.\n\nThat's funny."}]}