{"url":"https://community.fantasyflightgames.com/topic/57939-timing-of-recycling-the-encounter-discard-pile/","title":"Timing of recycling the encounter discard pile","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/57939-timing-of-recycling-the-encounter-discard-pile/?do=findComment&comment=570556","commentId":570556,"userName":"ooryl2","timestamp":1324584908,"content":"Hi :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Just a quick question on the timing of when to recycle the encounter discard pile when a couple of specific cards are in effect.\n\nI know the rule book says that during the quest phase, if the encounter deck is ever empty, the discard pile is shuffled and reset into the deck.\n\nHow does it work in this situation:\n\nPlayer 1 (of 4 players) has Thalin committed to the quest.  There is one card left in the encounter deck, Eastern Crows.  When it is revealed, Thalin's text instantly kills it.  The Forced effect says to shuffle the crows back into the encounter deck.  What is the order of operations with Thalin's text, the Forced effect and reshuffling the discard pile rule when the Crows are revealed for the first card of the Staging step?\n\nIs the discard pile reshuffled before Thalin's effect is triggered and the Crows destroyed?\n\nDoes Thalin's effect trigger, thus triggering the Forced effect of the Crows before the discard pile reshuffling would trigger, thereby negating the reshuffle of the discard pile because the Crows go right back into the encounter deck? \n\nWe ended up in this situation with a game tonight (note we aren't currently playing with the Shadow card use).  Going with option 2, we ended up at a point where basically no cards ended up being added to the Staging area, since all that was left in the encounter deck was the one crow card, it ended up just being destroyed and put back in the deck to be revealed again as the next card for all four cards of the Staging step."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57939-timing-of-recycling-the-encounter-discard-pile/?do=findComment&comment=570559","commentId":570559,"userName":"Beast Rabban","timestamp":1324586094,"content":"You could argue both ways on this however in my opinion you would reshuffle the discard into the deck before the crow goes back. My logic being that it says at ANY time if there are no cards in the encounter draw deck during the quest phase. It doesn't mention anything about reshuffling after coming into play effects of cards are resolved etc.\n\nQuick checklist.\n\nYou reveal the crows.\n\nIs it the encounter phase. Yes.\n\nIs the Encounter draw deck empty. Yes.\n\nTherefore reshuffle and resolve Thalin and the crow.\n\nThat's my thoughts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/57939-timing-of-recycling-the-encounter-discard-pile/?do=findComment&comment=570617","commentId":570617,"userName":"player663513","timestamp":1324612736,"content":"I would go with Rabbans logic on this one. Otherwise it would simply be too easy and against the spirit of the game in my oppinion."}]}