{"url":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/","title":"Need a hand with Hunt for Gollum","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=572692","commentId":572692,"userName":"peterstepon","timestamp":1325232263,"content":"I finally got around to trying Hunt for Gollum, but after two attempts am trying to still win it.  It is all based on very challenging locations.  I know that Willpower will be essential to a victory.  Can anyone suggest how to make a deck (or decks) to win?  I also hear it is a scenario which is scaled well to use fewer decks but I am not against using 2 decks to win. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=572701","commentId":572701,"userName":"richsabre","timestamp":1325234727,"content":"my solo advice-\n\n \n\nEOWYN- great for questing solo and can get a +1 willpower boost\n\nARAGORN- readys after spending a resource token after questing\n\nDUNHERE- can attack enemies in staging area such as hunters from mordor before the become too powerful\n\n \n\ntry to get a couple of NORTHER TRACKERS in play, every time they quest they add progress tokens to each loaction in staging area, so these are extremely useful cards in this quest for getting rid of EAST and WEST BANK and of course GLADDEN FIELDS\n\n \n\nalso try not to have too many clues in play at once otherwise hunters become deadly, get em killed while you have the chance with with either dunhere with a attack boost, or engage them and use dunhere and aragorn. obviously keep eowyn out of combat at all costs\n\n \n\nAlso if you want to go tactics THALIN is great for getting rid of them eastern crows while commited to a quest, also if you go tactics with dunhere get a gondolin blade and dwarven axe on him so he can tear apart enemies, especially Hunters, in the staging area and get a progress token from the blade while he's at it\n\n \n\nof course three gandalfs always help, and im not sure how many SONG cards you have (i think HFG comes with SONG OF KINGS?) but utilise them, for 1 cost you can get all your heros into the same sphere which is great for buying expensive cards\n\n \n\nand lastly i think it goes without saying that when you draw 3 cards in 1b (or 2 in 2b) and have to chose one of them, think very carefully about which is best to add, i think its normally a treachery to be honest (such as deal one damage to each character if your threat is over 35 etc) as often these dont have much or an effect if your threat is low or you have already quested\n\n \n\ngran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=572828","commentId":572828,"userName":"booored","timestamp":1325261459,"content":"I go a different rout with this quest. I prefer a high encounter control deck.\n\nElenore, Bilbo and Denethor.\n\nI go multi+UC on Denathor, and a single copy on Elenore. Scry that encounter deck as much as possible. Leave Elenore up for treachery control, and use Denethor to skry that encounter deck. You need some decent questing power though, as you are using Denathor, so if you can not compleat the quest by the time you get to teh bottom of the encounter deck you will have all the bad cards in a row. So splash for Steward and run the map makers. Mar kup Elenore as she will be untaped a lot in readyness for killer treachery cards, this makes her a blocking wall ... keep a copy of crows live in your staging area, so you can use it to thin the encounter deck even more. If you can get 2 of them in play then your laughing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=572847","commentId":572847,"userName":"peterstepon","timestamp":1325264491,"content":"richsabre said:\n\nmy solo advice-\n\n \n\nEOWYN- great for questing solo and can get a +1 willpower boost\n\nARAGORN- readys after spending a resource token after questing\n\nDUNHERE- can attack enemies in staging area such as hunters from mordor before the become too powerful\n\n \n\n\n\n \n\nWow!  Thanks for the advice.  I used this set up and absolutely dominated the game.  Lots of gossip encounter cards turned up which were pretty harmless and very little \"location creep\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=572858","commentId":572858,"userName":"richsabre","timestamp":1325265926,"content":"..........................sweet, glad i helped gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=573070","commentId":573070,"userName":"peterstepon","timestamp":1325330703,"content":" \n\nI played again but got demolished once I had 1 clue and 3 hunters from Mordor in the staging area.  Progress slowed to a crawl\n\nOne quick question, it says on the quest cards that during the quest phase you take 2 or 3 cards from the encounter deck and pick one.  Is that EVERY quest phase or only when you start or finish that quest card?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=573085","commentId":573085,"userName":"ricedwlit","timestamp":1325333149,"content":" The card draw triggers every quest phase.  Also, don't forget to apply the effect on the 1B card when you finally complete that card (if it's by questing) since the response triggers before you move to 2A."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=573093","commentId":573093,"userName":"richsabre","timestamp":1325333803,"content":"ricedwlit said:\n\n  Also, don't forget to apply the effect on the 1B card when you finally complete that card (if it's by questing) since the response triggers before you move to 2A.\n\n\n\n \n\nyes this is an important point, and a commonly made mistake- one i was playing wrong for several months before figuring out otherwise"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=573120","commentId":573120,"userName":"peterstepon","timestamp":1325340522,"content":"That makes the adventure Sooo much easier.  Being able to pick and choose encounter cards (best of 2 or 3) would make this a snap.\n\nI want to try the adventure again!\n\ngran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=573132","commentId":573132,"userName":"peterstepon","timestamp":1325342775,"content":"Played it again and finished it without a sweat.\n\nIt seems a bit daunting at first because it appears that an extra encounter will appear each round.  However, since you get to pick the best out of 2 or 3, it is not so scary.  In addition, it allows the player to cycle through the deck faster and get those clues.\n\nOnce a clue has been found, it is a race to the finish.  Since many of the encounters are locations it pays to quest often and quest hard to land those progress tokens.  Ranger of the North and Lorien Guide are extremely useful.\n\nOne other thing, I found that Banks of the Anduin get placed up at the top of the encounter deck.  This almost makes things too easy since once can just keep cycling through them and finish the game since they have such a low threat level (only 1)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=573136","commentId":573136,"userName":"richsabre","timestamp":1325343326,"content":"yes everytime banks of anduin comes up i breath a sigh of relief, it is an extremely player friendly card"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58199-need-a-hand-with-hunt-for-gollum/?do=findComment&comment=573207","commentId":573207,"userName":"booored","timestamp":1325373019,"content":"peterstepon said:\n\nThat makes the adventure Sooo much easier.  Being able to pick and choose encounter cards (best of 2 or 3) would make this a snap.\n\nI want to try the adventure again!\n\ngran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\n\n\n \n\nexactly this is why UC+Denathor makes this quest easy as pie. Encounter control decks imo seam to be the best option for almost every quest in fact."}]}