{"url":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/","title":"A Couple Card Questions - Not Answered from BGG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573274","commentId":573274,"userName":"hendersondayton","timestamp":1325400128,"content":"1. Sneak Attack Card - At the end of what phase do i put the ally i played back? I placed the Ally during the planning phase and I am not sure what phase he should return. Which brings me to my next question.\n\n2. Can you play cards from your hand in any phase or only in the planning phase?\n\n3. Son of Arnor - I played this card which asks me to \"choose and enemy card in the staging area or currently engaged with another player. Engage that enemy.\" If I am playing Solo without a second player, does this card work?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573279","commentId":573279,"userName":"Doom1502","timestamp":1325401044,"content":"1. At the end of the phase you played Sneak Attack. In your excempel the ally would return at the end of the planning phase.\n\n2. Attachments & Ally-cards only in the planning phase (in a multiplayer game the possibility to play attachments and allies circles clockwise with the beginning with the first player - so in multiplayer games you can't even play allies and attachments during the whole planning phase)\n\n3. Yes, you can still engage an enemy from the staging area and thus removing his threat from the staging area and having an easier time while questing (but you have to fight it afterwards of course)\n\nI hope that helps! =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573296","commentId":573296,"userName":"booored","timestamp":1325404925,"content":"He gose back in your hand AT THE END OF THE PHASE YOU PLAYED HIM IN. So many people use this card wrong. Like for example, you can not sneak attack Gandalf to quest, then also have him to defend and attack. Note that the encounter phase is a phase, so not sneak attackign to drop threat to stop a guy attacking you and then having gandalf to defend or attack.\n\njust remeber, what ever phase you play him, as the end of it the ally gose back into your hand.\n\n \n\nOnly during the planning phase, unsless it is an event card, and they can only be played during Player action steps. Witch occour at the end of each step in each phase.\n\n \n\nyes, it will still pull a card from the stanging area to attack you. I can not see the card as it is not in front of me but I think it is a response, these are optional, unless it has teh qualifying text \"forced responce\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573366","commentId":573366,"userName":"hendersondayton","timestamp":1325421257,"content":"So I can only play an ally or attachment card during the planning phase?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573368","commentId":573368,"userName":"richsabre","timestamp":1325421414,"content":"basically yes you can only play it then, in other words you can only buy the card and use it then, so you couldnt get half way through questing and think i wish i had rivendell minstrel, ill play it from my hand...that isnt allowed"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573371","commentId":573371,"userName":"hendersondayton","timestamp":1325421698,"content":"Well then isn't the Sneak Attack card useless? If i can only play it in the planning phase....then i place an ally from my hand (for free)...and then at the end of the planning phase the ally i placed goes back into my hand, the ally i placed doesn't get to help quest, fight or defend. Makes no sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573374","commentId":573374,"userName":"richsabre","timestamp":1325422129,"content":"sneak attack is an event card, so you buy it, then use it when in whatever phase you want -events work differently to attatchments"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573404","commentId":573404,"userName":"booored","timestamp":1325429750,"content":"hendersondayton said:\n\nSo I can only play an ally or attachment card during the planning phase?\n\n \n\nNo, you can play any card during teh planning phase. This means Allies and Attachments AND events. You can also play events during any \"player action\". Player Action windows occour at the end of every step of every action. At the same times you can use card abilities that have teh word ACTION printed on them. Not Action is NOT the same as INSTANT in magic the gathering. You can only use actions during action windows. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573430","commentId":573430,"userName":"hendersondayton","timestamp":1325434899,"content":"Unfortunately, this is my first experience with Card Games. May be good, but may be bad. Probably contributing to some to the confusion.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573463","commentId":573463,"userName":"richsabre","timestamp":1325439347,"content":"its always a learning experience, believe me.....................and each time a new adventure pack comes out, you got to start again with all the vague rules again and how the interact"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573625","commentId":573625,"userName":"Titan","timestamp":1325489509,"content":"hendersondayton said:\n\nUnfortunately, this is my first experience with Card Games. May be good, but may be bad. Probably contributing to some to the confusion.\n\n \n\n\n\n\n \n\nOne good thing to keep in mind is the Golden Rule, rulebook P. 4. \"If the game text of a card contradicts the text of this rulebook, the text on the card takes precedence.\" This is a commonly used rule in just about any card game. What it essentially boils down to is that some cards will go against the game's established rules. That is their value. Sneak Attack is a perfect example of this. And as per the Golden Rule, Sneak Attack takes precedence over game rules, thus you may play allies in any phase, when you use it. Of course, they balance this by not allowing the ally to stick around for very long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573711","commentId":573711,"userName":"radiskull","timestamp":1325504123,"content":" A small nitpick: \"playing\" an ally or attachment card means you pay its cost in resources to get it into play.  This can only be done in the planning phase.  Some other cards (most notably Sneak Attack) will \"put into play\" an ally or attachment card.  This is not restricted to the planning phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58271-a-couple-card-questions-not-answered-from-bgg/?do=findComment&comment=573785","commentId":573785,"userName":"Titan","timestamp":1325515080,"content":"radiskull said:\n\n A small nitpick: \"playing\" an ally or attachment card means you pay its cost in resources to get it into play.  This can only be done in the planning phase.  Some other cards (most notably Sneak Attack) will \"put into play\" an ally or attachment card.  This is not restricted to the planning phase.\n\n\n\nActually, not a nitpick at all. This is a more accurate explanation than mine."}]}