{"url":"https://community.fantasyflightgames.com/topic/58322-questions-about-nightmare-mode/","title":"Questions About Nightmare Mode","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58322-questions-about-nightmare-mode/?do=findComment&comment=573678","commentId":573678,"userName":"Maggical","timestamp":1325498638,"content":"Hi there,\n\nYesterday we decided to play our first \"nightmare\" game marathon with a friend and we have several questions about it, hope you can help!\n\n1) When playing this mode the idea is to play all 3 quests from the Core Set and then move on to Massing and the adventure packs without reseting? Or the idea is to play the 3 quests from the Core Set, then reset and play Massing, and then reset and play all adventures from Hunt for Gollum?\n\n2) In the 3rd quest of the Core Set a hero is capture, what happens to the attachments, damage and resources of that character when it's flipped over? Do they remain there and there return with him when he is rescued or are they lost?\n\n3) In case that the idea is to play all the quests from the Core Set and then move on to the others without reseting, what happens with the objective cards from the last quest of the Core Set? It will be painful to keep them attached and keep raising threat by 2, taking 1 damage and not to attack nor defend with one hero for the rest of the games...\n\nThanks!\n\nJavier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58322-questions-about-nightmare-mode/?do=findComment&comment=573745","commentId":573745,"userName":"muemakan","timestamp":1325509287,"content":"Maggical said:\n\nHi there,\n\nYesterday we decided to play our first \"nightmare\" game marathon with a friend and we have several questions about it, hope you can help!\n\n1) When playing this mode the idea is to play all 3 quests from the Core Set and then move on to Massing and the adventure packs without reseting? Or the idea is to play the 3 quests from the Core Set, then reset and play Massing, and then reset and play all adventures from Hunt for Gollum?\n\n2) In the 3rd quest of the Core Set a hero is capture, what happens to the attachments, damage and resources of that character when it's flipped over? Do they remain there and there return with him when he is rescued or are they lost?\n\n3) In case that the idea is to play all the quests from the Core Set and then move on to the others without reseting, what happens with the objective cards from the last quest of the Core Set? It will be painful to keep them attached and keep raising threat by 2, taking 1 damage and not to attack nor defend with one hero for the rest of the games...\n\nThanks!\n\nJavier\n\n\n\nFFG states in the last FAQ:\n\n When playing the “nightmare” variant each player’s threat, wounds, and discard pile do not reset when setting up a new scenario.\n\nTo reset the other game elements at the beginning of a new \"nightmare\" scenario, perform the following steps in order:\n\n1) All non-hero cards in play and in hand are shuffled into their owner’s decks. All encounter cards are returned to their encounter sets so they are available for the next scenario, if needed. This includes cards in players' victory display.\n\n2) All unspent resources are discarded from the heroes’ resource pools.\n\n3) Each player draws a new starting hand per the regular setup rules of the game. A single mulligan may be taken by each player at this time.\n\n4) A player cannot start a scenario with a threat level that is lower than the combined threat cost of his heroes. If a player’s threat is lower than the starting threat cost of his heroes, he must increase his threat to that value.\n\n5) Follow all setup instructions for the new scenario.\n\nEach scenario should be scored separately, and then all the scores added together at the end of the variant. \n\nThere are no specifications for the Mirkwood-Cycle. There variant was designed for the 3 corset quests. \nSo just play the scenarios in any combination as you like.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58322-questions-about-nightmare-mode/?do=findComment&comment=573864","commentId":573864,"userName":"Klaen","timestamp":1325525046,"content":"I agree with meumakan - re: nightmare mode being played with the pure core set.\n\nYou would probably have to augment those rules a reasonable degree to accomodate a 6-quest campaign like the Mirkwood cycle. You probably ahve a significant challenge on your hands just coming up with deck combinations to be versatile enough to take on the 6 quests without changing any of the  cards in the decks between quests. Perhaps that could be a beginning challenge in it's own right - as the mechanics of the Mirkwood cycle expansions often require very specific deck builds to conquer reliably.\n\nI am guessing with the range of things being produced by FFG at the moment that their developers won't really have time to come up with rules for this type of thing and that it would be a player community driven thing to develop rules for. More than likely to be a scoring convention than anything else to start with.\n\n \n\nIn regards to the official nightmare variant rules - I don't really agree with the FFG ruling to reset your threat to your starting character threat level each time - I think if you have managed to gain ground and reduce your threat, that it should carry over from quest to quest. Might have to play it with and without this rule and see what the difference is.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58322-questions-about-nightmare-mode/?do=findComment&comment=592030","commentId":592030,"userName":"Bonus Card","timestamp":1328778436,"content":"Ok, I have a question about Nightmare Variant and dead heroes. If during a certain scenario one hero dies off, what will happen in the next scenario?\n\n \n\n1. Will said hero be exempt from the game, therefore making the starting threat level lower because only calculating the starting threat level of left over heroes?\n\n2. Will the dead hero be in the discard pile, ready for a revival by \"Fortune or Fate\"?\n\n3. Will the dead hero still be calculated into starting threat level but not able to be revived?\n\n4. Will starting threat level only calculate remaining heroes, but you can still revive the dead hero later?\n\n \n\nI am not quite sure, but I am thinking that number 2 would make sense, or number one if not 2. Number 3 and 4 would pretty much suck and be broken from my view.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58322-questions-about-nightmare-mode/?do=findComment&comment=592045","commentId":592045,"userName":"cordeirooo","timestamp":1328779756,"content":"muemakan said:\n\n \n\nThere are no specifications for the Mirkwood-Cycle. There variant was designed for the 3 corset quests. \nSo just play the scenarios in any combination as you like.\n\n \n\n \n\nI agree there is no specifications for the SoM, but, I can't see anything saying this was designed for the 3 core quests either.\nIs it specified in another part that wasn't posted here?\n\n \n\n \n\n \n\nOn an unrelated note: Heeey Maggical! Dunno if the news already got to you, but I'll be in Buenos Aires for the Kotei in March!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58322-questions-about-nightmare-mode/?do=findComment&comment=592111","commentId":592111,"userName":"Budgernaut","timestamp":1328788494,"content":"Bonus Card said:\n\n \n\nOk, I have a question about Nightmare Variant and dead heroes. If during a certain scenario one hero dies off, what will happen in the next scenario?\n\n \n\n1. Will said hero be exempt from the game, therefore making the starting threat level lower because only calculating the starting threat level of left over heroes?\n\n2. Will the dead hero be in the discard pile, ready for a revival by \"Fortune or Fate\"?\n\n3. Will the dead hero still be calculated into starting threat level but not able to be revived?\n\n4. Will starting threat level only calculate remaining heroes, but you can still revive the dead hero later?\n\n \n\nI am not quite sure, but I am thinking that number 2 would make sense, or number one if not 2. Number 3 and 4 would pretty much suck and be broken from my view.\n\n \n\n \n\n \n\n \n\nI think number 2 makes the most sense.\n\nAnd I think Muemakan's right about the Adventure Pack scenarios not being included in the official \"nightmare\" variant rules. I would imagine that any number of quests beyond 3 would become quite difficult. From a Bilbo perspective, it would be most important to choose 3 scenarios that tie together in a cohesive story and try those out, like Hunt for Gollum, The Dead Marshes, and Return to Mirkwood. But again, that's just getting into custom variants."}]}