{"url":"https://community.fantasyflightgames.com/topic/58366-new-player-expension-order/","title":"New Player: Expension Order","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58366-new-player-expension-order/?do=findComment&comment=574174","commentId":574174,"userName":"Captain Poe","timestamp":1325584981,"content":"Hi,\n\nI'm a new player... got this game for christmas and have been playing daily since! I was gifted the core box set and the hunt for gollum expension. I've noticed that the quests all tie together, and was not sure if the expansions continue the story that is provided in the core set. If so, I wanted to make sure I played everything in the correct order. After completing the three quests in the core set, what are you supposed to move onto? Should I start with the hunt for gollum, or is there another expansion I should play through first to not mess the story up?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58366-new-player-expension-order/?do=findComment&comment=574192","commentId":574192,"userName":"richsabre","timestamp":1325586390,"content":"hi!\n\n \n\nit is addictive isnt it? well what happens is that hunt for gollum starts a brand new story line off - so the order is hunt for gollum, conflict at the carrock, journey to rhogobel, emyn muil, dead marshes, return to mirkwood, then the big box expansion which is just about to come out khazad dum, that starts a new storyline off, and the adventure packs after it will revolve around moria and the misty mountains"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58366-new-player-expension-order/?do=findComment&comment=574193","commentId":574193,"userName":"richsabre","timestamp":1325586446,"content":"sorry double post...this site is sooooo slow that i ended up having to refresh then it loaded two up"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58366-new-player-expension-order/?do=findComment&comment=574203","commentId":574203,"userName":"Captain Poe","timestamp":1325587423,"content":"Thanks for the reply. So does the stater kit's story end with the 3rd quest that it comes with, and Hunt for gollum starts a new unrelated story?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58366-new-player-expension-order/?do=findComment&comment=574204","commentId":574204,"userName":"richsabre","timestamp":1325587472,"content":"yes thats correct, the core set quests are pretty much to start you off, then the storyline really kicks off with Hfg"}]}