{"url":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/","title":"Passage Thru Mirkwood quest questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=574419","commentId":574419,"userName":"hendersondayton","timestamp":1325621479,"content":"First question, I managed a WillPower of 7 which was more than enough to defeat the location (3) I had....do I get to put the leftover (4) on the actual quest card or do i just lose what is beyond the current location card? Basically, can I put the remaining 4 progress tokens from my quest result on the current quest card?\n\nI have read the FAQ 5.1 PDF which gives the list of cards and the FAQs (awesome!)..with that said, on to my next two questions:\n\nMy next two questions are based on the two random \"Chosen Path\" cards from the passage of Mirkwood. I really don't understand either of these cards.\n\nCard #121 - \"Don't Leave the Path\" - It says to search the encounter deck and discard pile for a spider and add it to the staging area. Why not just get the Ungoliant Spawn card and be done with it? \n\nCard #122 - \"Beorn's Path\" - I have to continue playing as normal until I reveal the Ungoliant Spawn card (if i have defeated it already, i have to play thru a re-build and re-shuffle of the encounter deck). Then, I have to defeat the Ungoliant Spawn AND get 10 progress tokens?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=574431","commentId":574431,"userName":"booored","timestamp":1325623054,"content":"1) - Yes, that is correct. After the location is completed, excess quest counters are placed on the main quest card itself. So if you quest for +7, have a location in the travel slot needing 3 counters, you clear the location as well as add 4 counters to the main quest. BUT, quest counters do not carry over from the main quest card to the next. So in the same example, if you only need 3 counters to pass the main quest card, then the last (1) extra counter is not placed on the next quest card.\n\n2) - This is a rule wording to handle multiplayer games. The idea is that all players place a spider card in the staging area, but one of them HAS to be the Spawn. So in a solo game, you ALWAYS place the Spawn, there is no choice here.\n\n3) - No, you just need to finish the stage.. BUT if you draw the Spawn naturally you need to defeat him to finish it. So if he is in the discard pile or you do not draw him b4 the end of the stage.. then you got out with out having to face down the brute!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=574437","commentId":574437,"userName":"hendersondayton","timestamp":1325624459,"content":"Your answer on 1 and 2 make perfect sense. Thank you. #3 is still a little sketchy. As long as I don't reveal Ungoliant Spawn when pulling from the encounter deck, I can go out with 10 progress tokens?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=574450","commentId":574450,"userName":"choppic","timestamp":1325630824,"content":" I believe booored is correct. \n\nThe Beorn's Path card says that players cannot defeat the stage while Ungoliant's Spawn is in play. It doesn't say that you have to kill Ungoliant's Spawn.\n\nSo if you have Ungoliant's Spawn in play, you have to kill it first.\n\nIf you don't have it in play and you haven't pulled it from your encounter deck (lucky you), the only requirement for defeating the stage is putting 10 progress tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=574525","commentId":574525,"userName":"booored","timestamp":1325656074,"content":"hendersondayton said:\n\n. Thank you. #3 is still a little sketchy. As long as I don't reveal Ungoliant Spawn when pulling from the encounter deck, I can go out with 10 progress tokens?\n\n\n\nit isn't really sketchy, it is a thematic rule.\n\nYou are in the heart of the spiders next, or at least near in.. deep in the forest and you are trying to sneak out to safety. That is the 10 quest points... they represent you travelling though the forest to escape. So you can just rush the quest and escape (sneak out).. no problems.. BUT if while ******* about in the nest you in fact bump into the spawn you need to kill it to escape as it is blocking your path, so you have to kill the spawn before you can complete the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=574594","commentId":574594,"userName":"hendersondayton","timestamp":1325668933,"content":"booored said:\n\nYou are in the heart of the spiders next, or at least near in.. deep in the forest and you are trying to sneak out to safety. That is the 10 quest points... they represent you travelling though the forest to escape. So you can just rush the quest and escape (sneak out).. no problems.. BUT if while ******* about in the nest you in fact bump into the spawn you need to kill it to escape as it is blocking your path, so you have to kill the spawn before you can complete the game.\n\n\n\nWell Said"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=576633","commentId":576633,"userName":"VTSvsAlucard","timestamp":1326053481,"content":" To add on, could anyone confirm if we played this correctly?\n\n2 Player game, Ungoliant's Spawn is currently engaged with me and has 7 wound tokens. We complete the quest, and the Chosen Path became \"Don't stray from the path!\". We each pulled out  forest spider and placed it. After engagements and enemy attacks, we just took down the Spawn. Game over, right?\n\n \n\ni'm 99% sure we played this right, but I might as well ask.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58395-passage-thru-mirkwood-quest-questions/?do=findComment&comment=576649","commentId":576649,"userName":"booored","timestamp":1326054866,"content":"yes, that is correct. You only get a 2nd spawn if it is pulled out of the discard pile."}]}