{"url":"https://community.fantasyflightgames.com/topic/58434-rules-attacking-and-exausting/","title":"Rules: Attacking and Exausting","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58434-rules-attacking-and-exausting/?do=findComment&comment=574717","commentId":574717,"userName":"Captain Poe","timestamp":1325681132,"content":"I needed a bit of rules help. In last night's game I worked with a friend. During the combat phase, I acted as first player, and blocked an attacking enemy with my only non-exhausted hero. My team mate then played her turn, and played a card that readied all exhausted characters. I checked the rulebook, and could not figure out if my exhausted characters would then receive a chance to attack. It says that combat goes around the table clockwise from player 1, but i could not tell if it was supposed to return to player one, and keep going until all attacks were made. Or, if each player only gets one attack \"turn\" during the phase, and the phase ends once the circle returns to the first player.\n\nI couldn't find what I wanted in the FAQ, but I did find this interesting little blurb of information that helped to further confuse me. A character may only attack once during combat, unless a card (in this example, Quick strike) grants you a chance to attack again. What confuses me is that in this example, both Aragorn and Legolas are said to be legally allowed to attack the hill troll again... but I don't understand why Legolas is included. Aragorns player played the card, not the legolas player... why is he included in this second attack?\n\n \n\nThanks\n\n \n\n \n\n(1.11) Limitations on Attacks\nWhen a player is the active attacker during the combat\nphase, the game rules grant him the option to declare\n1 attack against each enemy with which he is engaged.\nIf, through card effects such as ranged, a player is able\nto declare attacks against enemies with which he is\nnot engaged, he is still only permitted a single attack\nagainst each of these enemies.\nCharacters are not limited as to how many times they\ncan participate in attacks against the same enemy,\nprovided each attack can be legally declared, and the\ncharacter is ready and eligible to be declared as an\nattacker.\nExample: Tom exhausts Aragorn to attack a Hill\nTroll, and Kris exhausts Legolas to participate in the\nattack. The Hill Troll takes 3 wounds but survives. All\ncharacters in play are then readied via Grim Resolve\n(CORE 25). Because the Hill Troll has already been\nattacked by Tom, he cannot declare another attack\nagainst it this round except through a card effect. So\nif Tom exhausts Aragorn to play Quick Strike (CORE\n35) which reads, \"Action: Exhaust a character you\ncontrol to immediately declare it as an attacker...\" both\nAragorn and Legolas could attack the Hill Troll again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58434-rules-attacking-and-exausting/?do=findComment&comment=574729","commentId":574729,"userName":"Svenn","timestamp":1325683027,"content":"You resolve player attacks 1 player at a time. If your turn has passed and your characters are readied they do not get to make an attack at that point, the opportunity has passed.\n\nThat example is pretty awful and the cause for a lot of confusion in the past. That example is actually invalid now due to a ruling in the FAQ.\n\nFrom the FAQ:\n\n\"Q: Can characters with the ranged keyword participate\nin an attack declared through the card Quick Strike\n(CORE 35)?\nA: No. There is no opportunity for other characters to\njoin a Quick Strike attack. One character is exhausted\nto pay for the cost of Quick Strike, and the effect is that\nthe exhausted character is immediately declared as an\nattacker against the target enemy. The card's resolution\ndoes not allow for a standard declaration step in which\nother characters can declare.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/58434-rules-attacking-and-exausting/?do=findComment&comment=574736","commentId":574736,"userName":"Captain Poe","timestamp":1325684336,"content":"Got it. So even though my cards have not attacked, and are capable of attacking, after the second players combat actions (assuming a 2 player game), the game is forced onto the next phase.\n\n \n\nYeah, i wasn't even sure what the logic was behind giving legolas another attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58434-rules-attacking-and-exausting/?do=findComment&comment=574898","commentId":574898,"userName":"Angus Lee","timestamp":1325706502,"content":"Please note that the combat sequence is as follows (assume in a 2-player game):\n\n1a. 1st player defend (you block with the only non-exhausted character)\n\n1b. 2nd player defend (then he plays an event that ready all exhausted characters)\n\n2a. 1st player attack (you can attack with your (now readied) characters)\n\n2b. 2nd player attack"}]}