{"url":"https://community.fantasyflightgames.com/topic/58468-frodo-baggins-and-west-road-traveller/","title":"Frodo Baggins and west road traveller","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58468-frodo-baggins-and-west-road-traveller/?do=findComment&comment=575067","commentId":575067,"userName":"Ileopsoas","timestamp":1325753226,"content":"Hi to all! Here're the questions:\n\n1.Can Frodo activate his ability if the damage he wants to avoid would kill him?My doubt was born because the card says \"after Frodo is damaged\"...If that is true, this hobbit guy's ability become of little use to me...\n\n2.Do I need an active location To use West Road traveller ability?Or I can use it tto istant travel there?And do I activate the travel effect? I think not becuse the card say just switch...but I want to her ye fellows!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58468-frodo-baggins-and-west-road-traveller/?do=findComment&comment=575077","commentId":575077,"userName":"HilariousPete","timestamp":1325754290,"content":"A similar question popped up to me because of Landroval's \"after a hero has been destroyed\"...\n\nI think it is possible to prevent Frodo from dying. A detailed timing scheme hasn't been published for LotR yet, but cancellation abilities have to happen after the framework action (like an enemy's attack) has been initiated, but before it is actually resolved, to have a positive effect for the player triggering it. You can see this pretty clearly when you take the card \"A Test of Will\" - the cancellation has to happen before the When Revealed effect is resolved, otherwise it would be of no use. I suppose it is the same with Frodo's cancellation ability. This would mean that Frodo's ability can be used to cancel any damage, regardless of the amount.\n\nMy knowledge of the timing scheme of AGoT or CoC is limited, perhaps someone else with more experience in those games can provide you a better answer. But I think/hope the reasoning will go this way.\n\nGreetings,\n\nPete"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58468-frodo-baggins-and-west-road-traveller/?do=findComment&comment=575101","commentId":575101,"userName":"radiskull","timestamp":1325757652,"content":" You're correct - cancels are special.  They sort of interrupt the flow of the game and actually prevent something from happening.  So if there was some effect that dealt Frodo 10 damage, his ability would kick in BEFORE he died and cancel all of that damage. (Otherwise, it's true, his ability is mostly worthless.)\n\n \n\nWest Road Traveler - you need an active location to use the ability, and you're not traveling to anything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58468-frodo-baggins-and-west-road-traveller/?do=findComment&comment=575161","commentId":575161,"userName":"Ileopsoas","timestamp":1325766300,"content":"Thank you!This clears a lot"}]}