{"url":"https://community.fantasyflightgames.com/topic/58462-questions-on-thalin-landroval-and-quick-strike/","title":"Questions on Thalin, Landroval and Quick Strike","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58462-questions-on-thalin-landroval-and-quick-strike/?do=findComment&comment=575010","commentId":575010,"userName":"brightknight_216","timestamp":1325740470,"content":"Dear all,\n\nI'm new to the LotR: The Card Game.  Have a few questions about the Tactic cards.  Would appreciate if some of you guys can clarify how they work.\n\nQ1. Eastern Crow and Thalin\nWhat happened if Eastern Crows was revealed and I have Thalin committed to the quest? Thalin’s ability said, “While Thalin is committed to a quest, deal 1 damage to each enemy as it is revealed by the encounter deck.\". Would Eastern Crows automatically be destroyed before its ‘surge’ effect takes place or would ‘surge’ comes into effect before it was destroyed?\n\n\nQ2. Landroval and Heroes\nWhen a hero is destroyed, if it is put back into play using Landroval’s ability and the hero was previously exhausted before it was destroyed, would it return to the board as exhausted or unexhausted.\n\nFor example: Beravor was exhausted in order to give a player the opportunity to draw 2 cards. She only had 1 life left and then Evil Storm was revealed during the Encounter Phase. The player who was controlling Beravor has more than 35 threat points and therefore had each of his character received a damage. Beravor was damaged and destroyed. Would Beravor be put back into play ‘unexhausted’ using Landroval’ ability or would it return following the condition she was in before she was destroyed? (Note: I have a combination of Lore and Tactic sphere in my deck and therefore it has Landroval and Beravor.)\n\nQ3. Quick Strike\na. Can I use Quick Strike to exhaust a hero to attack an enemy at the staging area? If yes, this can be very useful in getting rid of…\n- Hummerhorns (from Spider of Mirkwood)\n- Goblin Snipers and Wargs (from Wilderland)\n… at the staging area.\n\nb. Also, when using Quick Strike which state ‘Action: Exhaust a character you control to immediately declare it as an attacker (and resolve its attack) against any eligible enemy target’ on an enemy engaged with a player, must we still deal it with a Shadow Card for the purpose of running through the deck? This idea was a result from some discussions that say even though an enemy cannot attack the player’s heroes or allies through card effects (such as ‘Forest Snare’, ‘Feint’, and ‘Thicket of Spears’), Shadow Card will still be dealt to each enemy.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58462-questions-on-thalin-landroval-and-quick-strike/?do=findComment&comment=575046","commentId":575046,"userName":"Svenn","timestamp":1325748701,"content":"1. Straight from the FAQ:\n\"Thalin CORE 6\nWhen an enemy card is revealed from the encounter deck, Thalin’s ability resolves before any keyword or “When Revealed” card effects on the encounter card.\"\n\n2. The hero would return back into play as ready. The card is destroyed, and then it is brought back into play. When a card is brought into play it is brought in readied, and when a card is destroyed it does not save any states it was in.\n\n3. a. No, Quick strike says you may make an attack against any eligible enemy target, which means you must follow all the normal requirements for combat including only attacking enemies engaged with you (unless using ranged, Dunhere's ability, or something else which allows you to make attacks against other targets).\n\nb. No, shadow cards are only dealt at the appropriate time during the combat phase. That clarification simply states that if an enemy is unable to attack in the combat phase you will still deal them a shadow card at the appropriate time each turn. Otherwise, dealing a shadow card is not part of resolving an attack, which is what Quick Strike allows you to do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58462-questions-on-thalin-landroval-and-quick-strike/?do=findComment&comment=575066","commentId":575066,"userName":"Captain Poe","timestamp":1325753184,"content":"I think this is a double post? These were answered in this other thread http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=596985 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=596985]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58462-questions-on-thalin-landroval-and-quick-strike/?do=findComment&comment=575075","commentId":575075,"userName":"Svenn","timestamp":1325754236,"content":"Whoops... Weird, this was near the top of the page with no responses, seems like a late double post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58462-questions-on-thalin-landroval-and-quick-strike/?do=findComment&comment=575090","commentId":575090,"userName":"brightknight_216","timestamp":1325756504,"content":"Captain Poe said:\n\nI think this is a double post? These were answered in this other thread http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=596985 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=596985]\n\n\n\n\n\nYou are right.  I couldn't find the post earlier and so I reposted the questions.  Anyway, thank you for the clarification.\n\n \n\n "}]}