{"url":"https://community.fantasyflightgames.com/topic/58471-the-temple-of-melkor/","title":"The temple of Melkor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58471-the-temple-of-melkor/?do=findComment&comment=575122","commentId":575122,"userName":"Memetix","timestamp":1325761410,"content":"I have completed production of my first quest, please feel free to download it from here [http://www.blackmoor.org.uk/gaming.html]and post your feedback in this forum when you've had a play through or two. I estimate the difficulty level to be about 5.\n\nI used the Lord of the Rings plug-in for Strange Eons to create the new cards and I'm really impressed with the production levels that are possible.\n\nYou don't need to shuffle any of the new cards into the encounter deck, so you don't need to print and cut them out if you don't want to. I have, however, laid them out so that they can be printed double sided onto a single A4 sheet of paper if you do want to produce our own cards.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58471-the-temple-of-melkor/?do=findComment&comment=575160","commentId":575160,"userName":"guciomir","timestamp":1325766125,"content":"It looks really nice! I'll surely try it sometimes.\n\nI have a comment that you may find useful. Players will try to stall the game during stage 1 and 2. They will commit enough characters so they don't have threat raise but at the same time, they don't put any progress on quest. As a result, quest will become easy because players will easily put a ton of allies into play before the quest becomes more interesting. During stage 2, they will simply keep nazgul in staging area for many many turns. Think about adding some effects that make people want to finish the stages faster. The easiest example (maybe not the best), is to decrease number of progress points on stage 1 and during stage 2, nazgul should be engaged with the player and not in staging area. But those are only examples, think about something better.\n\nAdditionally, you use the encounter set from passage to mirkwood. While I agree that some cards from this set are very nice, the set makes the quest much more easy. Just take a look at the locations, they benefit the player instead of punishing him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58471-the-temple-of-melkor/?do=findComment&comment=586451","commentId":586451,"userName":"Hannibal_pjv","timestamp":1327806134,"content":"I like the quest. It is themathically sound, and that is very important thing for me!\n\nThe problem can be the High priest, that goes back to the staging area everytime if there is minion in discard pile and normally there allways is at least one to 10 minions in the discard pile, so it may become impossible to kill that high priest. You have to have very good draw with cards that can cause damage to the staging area and they have to come out in very short time period because the soul gem heals High priest allmost every turn. So players can be trapped in stage 4 very, very long time...\n\nSo be prepared to staging are bombarment when fasing this quest! It allso makes this quest harder that 5. 7 or 8 may be more like it, and if you don't have Pumped up Dunharrow, and multible sneak attacks this can become impossible to win.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58471-the-temple-of-melkor/?do=findComment&comment=586468","commentId":586468,"userName":"Memetix","timestamp":1327808122,"content":"Thanks for the feedback, I'm glad you have enjoyed the quest and you are right, it is now a tougher challenge since I put in Wilderlands. I've also updated the text on the Soul Gem since the first release.\n\nThe Necromancer can be really easy if you time it right, or an overwhelming challenge if you don't. To be fair, that was part of the design...\n\nIf you haven't tried it, my second quest, Four Seasons, is even better and scales well for multiple players.\n\n "}]}