{"url":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/","title":"Lord of the Rings - LCG - YouTube Videos","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=575411","commentId":575411,"userName":"TragicTheBlathering","timestamp":1325810155,"content":"Hi there…\n\nI'm addicted to making YouTube vids.. and have been making them for LoTR-LCG recently.. so thought I would post them here as well as on BBG. Warning these ALL have spoilers.\n\nThe problem is that FFG forums are really terrible and one of the MANY things it can not do is allows you to edit posts for adding new information… (one of the reason there are no good FAQ threads for example) So as I make more vids you will have to find them in the thread for I will not be able to edit the post and add them to this top thread.\n\nCORE\n\nLone Quest(x1) - Passage though Mirkwood - RESTRICTED = 111 -----\n\n\n\n \n\nShadows of Mirkwood\n\nHunt for Gollum Unboxing and Initial Card Evaluation -\n\n\n\nLone Quest(x1) - Hunt for Gollum - RESTRICTED = 138 ---- \n\n\n\nConflict at the Carrock Unboxing and Initial Card Evaluation -\n\n\n\nLone Quest (x1) - Conflict at the Carrock - RESTRICTED = 144 ---- \n\n\n\nA Journey to Rhosgobel - Unboxing and Initial Card Evaluation -\n\n\n\nThe Hills of Emyn Muil - Unboxing and Initial Card Evaluation -\n\n\n\nThe Dead Marshes - Unboxing and Initial Card Evaluation -\n\n\n\nReturn to Mirkwood - Unboxing and Initial Card Evaluation -\n\n\n\n \n\nDarrowDelf\n\n [1] The Redhorn Gate - Unboxing and Initial Card Evaluation -\n\n\n * \n\n[2] Road to Rivendale - Unboxing and Initial Card Evaluation -\n\n\n * \n   (Tactics+Spirit - \"Kill to Quest [http://tinyurl.com/bmqhrga]\")\n\n[3] The Watcher in the Water- Unboxing and Initial Card Evaluation  -  \n\n\n * \n   - Wall of Lore [http://www.cardgamedb.com/forums/index.php?/topic/2781-lotr-deck-wall-of-lore/]\n\n\n\n\n\n  \n\nDeck Construction\n\nThe Dog, The Leash and the Master (3 Player Deck) ---\n\n\n\n Brothers in Arms (2 Player Deck) -  \n\n\n\n \n\n \n\nCustom Quests\n\n * Set Review -\n   \n   (Custom Quest) - - (Download) [http://bit.ly/QjkbkM]\n\n \n\n \n\nHope you like them!!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=575462","commentId":575462,"userName":"muemakan","timestamp":1325824202,"content":"Burning Brand has to go to a LORE character. So Grimbeorn is not a valid target for it. \n\nNice videos by the way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=575470","commentId":575470,"userName":"booored","timestamp":1325827345,"content":"cool vids.. but full of errors.. you should probably learn to play b4 you post them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=575473","commentId":575473,"userName":"TragicTheBlathering","timestamp":1325827568,"content":"muemakan said:\n\nBurning Brand has to go to a LORE character. So Grimbeorn is not a valid target for it. \n\nNice videos by the way.\n\n\n\nyea, there are a few errors here and there. These are just initial card evaluations made on the time i open the boxes.. so they sneak though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] and no onw is perfect.. least of all me!! I think that  error is not remembering that songs can only be played on heroes. I had a full Mirkwoood cycle deck that used the lore song on a eagle and then burning brand as a major function... I was so crushed when i found  out i was doing it wrong!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=575479","commentId":575479,"userName":"choppic","timestamp":1325828721,"content":" Hi Tragic, I'm waiting for your initial evaluation on Khazad-dum. \n\nThank you for the videos. I like them a lot :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=575480","commentId":575480,"userName":"TragicTheBlathering","timestamp":1325828864,"content":"I got my order from lotus vaults in ... so I should be getting it soon.. maybe a week or 2...  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=633887","commentId":633887,"userName":"TragicTheBlathering","timestamp":1337600146,"content":"Hey guys… now that the Mirkwood Cycle is out in LackeyCCG here is a Deck Construction video that I gets mailed on YouTube for all the time! Have fun… More to come…\n\n \n\n The Dog, The Leash and the Master (3 Player Deck)\n\n\n\n\n \n\n1) Introduction and Hero talk.\n2) The Dog [http://is.gd/we4ucV]\n3) The Leash [http://is.gd/R6yown]\n4) The Master [http://is.gd/vOX68Q]\n5) Conclusions\n\nThis deck is designed as if all players own their own copy of core and between them they all own the entire Mirkwood Cycle. It is designed to beat the Mirkwood Cycle and is a modification of my 3 man group's deck witch we used to 1 shot the entire cycle recently.\n\nhave fun!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=634008","commentId":634008,"userName":"Morbid666","timestamp":1337611976,"content":"I enjoy the videos a lot. It is cool that you take the time and effort to do this. (my you tube name is dungeon666, you might have seen some of my comments) Keep making these videos."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=634385","commentId":634385,"userName":"Ted Sandyman","timestamp":1337680065,"content":"Hey tragic, just watched the new deck building guides. Thanks for spending the time and effort to do these, i realise even more now about taking plenty of time to construct decks. The combos you highlight will definately help me improve my gaming. Cheers mate and any more solo you tube vids would be appreciated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=638241","commentId":638241,"userName":"TragicTheBlathering","timestamp":1338413955,"content":"Anyway, here is my initial card evaluations and thoughts as I open the 3rd pack in the Darrowdelf Cycle!\n\nI have tried a new way of doing this with out all the editing work.. so it takes about 1/10th of the time to make the video.. let me know what you think!\n\nHope you like it!!\n\n \n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=638355","commentId":638355,"userName":"starhawk77","timestamp":1338440361,"content":"Good stuff, Tragic! I think the new format works fine. Obviously, having the card images pop up would be ideal, but you should still be able to convey all of the relevant information/give a taste of the artwork without spending all those hours in post-production. \n\nAs for the content in this latest video, I'm inclined to agree with most of your individual card evaluations. Arwen is every bit as good as she seems, Legacy of Durin is indispensable in a Dwarf deck, and the new Aragorn enables some really amusing threat reduction shenanigans (especially in a two-player game with Song of Earendil and Wandering Took). Wrapped! is a nicely flavorful treachery, while Doors of Durin recreates the idea of trying out password after password in order to enter Moria. All in all, a very solid AP."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=638361","commentId":638361,"userName":"TragicTheBlathering","timestamp":1338441208,"content":" \n\noh hey.. I didn't think of that.. the card effect is basically a way to visualize \"code breaking\" in the game as they try to work out how to open the door.. That is really cool.. I just couldn't work out wtf they thinking with that manic .. it seamed so random.. but after you explaining it it makes total sense now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=642728","commentId":642728,"userName":"TragicTheBlathering","timestamp":1339360925,"content":"Deck Construction - 2 Player Deck - Brothers in Arms -\n\n\n\n \n\nHere is my 2nd deck building video. I have been trying to make my videos shorter so I hope that this one is a little faster and more interesting :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nHave fun!\n\n[1] Brothers in Arms - Elrohir [http://tinyurl.com/bnndjxl]\n[2] Borthers in Arms - Elladan [http://tinyurl.com/cl449xs]\n\n \n\nMore Card Evaluations\n\n\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=643803","commentId":643803,"userName":"TragicTheBlathering","timestamp":1339548020,"content":"Well this is the last pack for a while .. until I get my next shipment.. I will most likely be not ordering it until the entire cycle is finished and 2 or 3 coc packs are out as well.\n\nAnyway… this is a very good pack with some real power player cards and what looks like a really good quest… very excited about this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=661508","commentId":661508,"userName":"TragicTheBlathering","timestamp":1342797938,"content":" \n\n \n\n\n\n\n\nBeen fooling about with Hama while I wait for the \"real\" deck building to start after Darrowdelf is completed. I rarely play Tactics or Solo so this was a bit of a experiment for me. . I think it came out really well.. despite a few missplays as pointed out by the friendly rules hawk Matthias Maccabeus.. thanks for that! \n\nI enjoyed this deck and the combo is powerful and satisfying… but I have already dumped this deck list as I have heavily modified it so I am not going to post it.. instead I think I will just post a new quest running it! I think I will do a solo game this time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=661845","commentId":661845,"userName":"TragicTheBlathering","timestamp":1342889116,"content":"Well here is the next quest.. Road to Rivendale.. I have modified the deck pretty heavy and said. screw it and fully committed to the eagle draw engine for deck thinning… This deck is basically a kill to quest system were Blade of Gondilin and Lego place progress tokens. So that is teh name of it.. \"Kill to Quest\"\n\nThis is a pretty fun deck and I feel it is worht having a look at… though I am not sure if it will work vs a huge variety of quests. So far it can crush Darowdelf.. and I am about to take on the watcher next!!!\n\nHave fun and stay classy middle earth!\n\nDeck List - ]Kill to Quest! [http://tinyurl.com/bmqhrga]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=661966","commentId":661966,"userName":"booored","timestamp":1342923846,"content":"Another invalid game.. Arewen would be killed at 9:10 in the video as she gets a wound AND right ta the beginning she was supposed to get a wound form that treachery….. Way to not know how to play…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=661987","commentId":661987,"userName":"mr.thomasschmidt","timestamp":1342931897,"content":"booored said:\n\nAnother invalid game.. Arewen would be killed at 9:10 in the video as she gets a wound AND right ta the beginning she was supposed to get a wound form that treachery….. Way to not know how to play…\n\n\n\nIf you don't like it, don't watch it. It's that simple. Maybe you should make some videos together with your good budy Glaurung, you know, since between you two you know everything, never makes mistakes, always plays perfectly? Just to teach all of us other morons how to play the game? THEN you can go back to being a **** again afterward!\n\nTo you tragic, please just ignore him, and continue to make those entertaining videos. They are really good and I get a lot out of them. And of cause there's a few mistakes,but show me a movie ever made without, eh? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662027","commentId":662027,"userName":"Glaurung","timestamp":1342949964,"content":"I know Tragic long time and i even use to talk to him by skype many times. He always do mistakes and many times i told him about it.\n\nBut in this video Tragic make a lot of Big mistakes what is really surprise me……  But there is no tournament system so who really cares….\n\nQuest log\n\nI got Boored point when he told me long time before about Quest log:\n\nAll quest log results is wrong cose people dont know the rules well.  So after watch Mitch and ko videos and some Tragic videos i understand Boored point.\n\nIf most active players on this forum play wrong, so how about others players? \n\nMtg community is different cose if you play wrong you will just lose all the time and  there is no fun to play. And tournaments teach you really fast. But in this game everything is different. Here is different kind of players.\n\n I use to  play cards game more then 10 years and my approach to the game is different from players like Mitch for example.. I play MTG really serious. Then i  use to play LOTR TCG Decipher and also i was tournament director of Decipher. I use to play many tournaments and play world cups where 1 small mistake or wrong rules understanding cost you and your team a lot. You opponents is strong and if you dont know the rules well you have no chance……\n\nMany players here just dont understand me………But as Tournament Director i cannot just ignore mistake of some players. This is natural think. Like birds is flying, director is watching and count all mistakes. This is like a second skin.\n\nFor example i remember all Lotr cards game text. I dont to look on the card text for me is enough to see the picture. But this is how you train your brain to be a good player. You must know the cards, you must feel the flow of the game. And you must know the rules like 2+2=4. Otherwise you will never be a good player.\n\nIn all good times i use to take 6 sides dice roll and every mistake in your game cost you 1. If you reach 6 you lose. Doesn matter even if you still in the game and game going well. 6 mistakes you lose!\n\nBut as i say is different approach to the game. Just a fun or as a sport.\n\nlet me tell you one thing Boored. There is no point casting pears before the swine.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662030","commentId":662030,"userName":"Runner5","timestamp":1342950704,"content":"Glaurung said:\n\n \n\nlet me tell you one thing Boored. There is no point casting pears before the swine.\n\n \n\n\n\nThat is fine I am not a big fan of pears anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662046","commentId":662046,"userName":"richsabre","timestamp":1342953849,"content":"the point is though….does it really matter.?…i mean really matter…\n\ni also know all the cards off by heart and am a very competant mathematician and on the vast majority of occasions play correctly, but that still doesnt mean that i dont make mistakes- everyone makes mistakes in a game that has such a swiftly growing card pool that its easy to get caught up in the moment and forget a rule. doesnt matter how good you are…but right now it really doesnt matter as even if the quest log is wrong (which it is bound to be) it makes no difference….even if juicebox's  listings are wrong it again doesnt matter, as this isnt a competative game and those who play wrong play wrong and those who play correctly play correctly….simple as that\n\nanyways im probably the wrong person to judge the validation of your opinion, being a strong theme player i spend my time enjoying this game and getting 'caught up in the moment' and not really caring if i make a few mistakes. on the rare occasion i do mess up i make a mental note to take more care next time and then carry on.\n\nstill everyones entiltled to thier take on the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662081","commentId":662081,"userName":"Dain Ironfoot","timestamp":1342962789,"content":"booored said:\n\nAnother invalid game.. Arewen would be killed at 9:10 in the video as she gets a wound AND right ta the beginning she was supposed to get a wound form that treachery….. Way to not know how to play…\n\n\n\n \n\ngood god, i know it's the internet and it's anonymous and all that…but why on earth do you have to be such a prick? take out the first part of the sentence and the last part and this *might* be constructive but instead, you take the low road and just tick everyone off.\n\nwhat is your purpose? why do you even come to the forums? do you get off on being all high and mighty?\n\nseriously, all you do is diminish the community and make it a less welcoming environment. try being constructive. try being polite. freedom to speak your mind doesn't give you the right to be intolerable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662087","commentId":662087,"userName":"Dam the Man","timestamp":1342963873,"content":"Checking over on BGG, I see that the video itself is 36 minutes and change long (which is where another poster, not booored pointed out the Arwen-hickup in the first place). Given that a critical, absolutely game-changing (game-ending in this case) happens barely 1/4 into the game, I would definately class this one as invalid. Haven't watched the game, so don't know if that is turn 1 or turn 10, but time-wise watching a game where 75% action shouldn't have taken place doesn't seem to have a point.\n\nI for one am very anal-retentive when it comes to rules when I play. My order of priorities are:\n\n#1: get the rules right\n\n#2: win\n\nrest being of immaterial importance. To my view of looking at games, if you don't care about the rules, you don't care about the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662089","commentId":662089,"userName":"mr.thomasschmidt","timestamp":1342964138,"content":"Glaurung said:\n\nI know Tragic long time and i even use to talk to him by skype many times. He always do mistakes and many times i told him about it.\n\nBut in this video Tragic make a lot of Big mistakes what is really surprise me……  But there is no tournament system so who really cares….\n\nQuest log\n\nI got Boored point when he told me long time before about Quest log:\n\nAll quest log results is wrong cose people dont know the rules well.  So after watch Mitch and ko videos and some Tragic videos i understand Boored point.\n\nIf most active players on this forum play wrong, so how about others players? \n\nMtg community is different cose if you play wrong you will just lose all the time and  there is no fun to play. And tournaments teach you really fast. But in this game everything is different. Here is different kind of players.\n\n I use to  play cards game more then 10 years and my approach to the game is different from players like Mitch for example.. I play MTG really serious. Then i  use to play LOTR TCG Decipher and also i was tournament director of Decipher. I use to play many tournaments and play world cups where 1 small mistake or wrong rules understanding cost you and your team a lot. You opponents is strong and if you dont know the rules well you have no chance……\n\nMany players here just dont understand me………But as Tournament Director i cannot just ignore mistake of some players. This is natural think. Like birds is flying, director is watching and count all mistakes. This is like a second skin.\n\nFor example i remember all Lotr cards game text. I dont to look on the card text for me is enough to see the picture. But this is how you train your brain to be a good player. You must know the cards, you must feel the flow of the game. And you must know the rules like 2+2=4. Otherwise you will never be a good player.\n\nIn all good times i use to take 6 sides dice roll and every mistake in your game cost you 1. If you reach 6 you lose. Doesn matter even if you still in the game and game going well. 6 mistakes you lose!\n\nBut as i say is different approach to the game. Just a fun or as a sport.\n\nlet me tell you one thing Boored. There is no point casting pears before the swine.\n\n \n\n\n\nBetter to be a pig than a ****…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662091","commentId":662091,"userName":"Dain Ironfoot","timestamp":1342964860,"content":"Dam said:\n\nChecking over on BGG, I see that the video itself is 36 minutes and change long (which is where another poster, not booored pointed out the Arwen-hickup in the first place). Given that a critical, absolutely game-changing (game-ending in this case) happens barely 1/4 into the game, I would definately class this one as invalid. Haven't watched the game, so don't know if that is turn 1 or turn 10, but time-wise watching a game where 75% action shouldn't have taken place doesn't seem to have a point.\n\nI for one am very anal-retentive when it comes to rules when I play. My order of priorities are:\n\n#1: get the rules right\n\n#2: win\n\nrest being of immaterial importance. To my view of looking at games, if you don't care about the rules, you don't care about the game.\n\n\n\ni don't see anyone debating whether this is a valid or invalid game -- it's all about how you approach a poster with your comments.\n\nif he missed some text on a card, that's not quite the same as not knowing the rules; regardless, i think most here would agree with you: if you don't care about the rules, you don't care about the game.\n\nbut there is a difference between rules and card text. and there is a huge difference in missing a rule, missing card text and not \"caring\" about the rules -- \"not caring\" is something that certainly can't be assumed from simply making a mistake or missing card text, or just being plain forgetful.\n\ni think the larger point here is that certain folks are putting themselves out there for the enjoyment of others, and then in response, certain posters go out of their way to be completely rude (and interestingly, don't put themselves out in the same way). people are going to make mistakes. that's life. but this is supposed to be a \"gaming community\" where we all help each other.\n\nsnarking at one another does no one any good -- and that's the larger point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662094","commentId":662094,"userName":"richsabre","timestamp":1342965113,"content":"Dam said:\n\n \n\n#1: get the rules right\n\n#2: win\n\nrest being of immaterial importance. To my view of looking at games, if you don't care about the rules, you don't care about the game.\n\n \n\n \n\ni cant agree with this- i played HFG wrong for about 3 months before i realised i was messing the timing up- still had a lot of fun\n\nso my list would be\n\n#1 immersion into the atmosphere and theme (what i would call fun)\n\n#2 rules\n\n#3 winning"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662095","commentId":662095,"userName":"richsabre","timestamp":1342965483,"content":"mr.thomasschmidt said:\n\nGlaurung said:\n\n \n\nI know Tragic long time and i even use to talk to him by skype many times. He always do mistakes and many times i told him about it.\n\nBut in this video Tragic make a lot of Big mistakes what is really surprise me……  But there is no tournament system so who really cares….\n\nQuest log\n\nI got Boored point when he told me long time before about Quest log:\n\nAll quest log results is wrong cose people dont know the rules well.  So after watch Mitch and ko videos and some Tragic videos i understand Boored point.\n\nIf most active players on this forum play wrong, so how about others players? \n\nMtg community is different cose if you play wrong you will just lose all the time and  there is no fun to play. And tournaments teach you really fast. But in this game everything is different. Here is different kind of players.\n\n I use to  play cards game more then 10 years and my approach to the game is different from players like Mitch for example.. I play MTG really serious. Then i  use to play LOTR TCG Decipher and also i was tournament director of Decipher. I use to play many tournaments and play world cups where 1 small mistake or wrong rules understanding cost you and your team a lot. You opponents is strong and if you dont know the rules well you have no chance……\n\nMany players here just dont understand me………But as Tournament Director i cannot just ignore mistake of some players. This is natural think. Like birds is flying, director is watching and count all mistakes. This is like a second skin.\n\nFor example i remember all Lotr cards game text. I dont to look on the card text for me is enough to see the picture. But this is how you train your brain to be a good player. You must know the cards, you must feel the flow of the game. And you must know the rules like 2+2=4. Otherwise you will never be a good player.\n\nIn all good times i use to take 6 sides dice roll and every mistake in your game cost you 1. If you reach 6 you lose. Doesn matter even if you still in the game and game going well. 6 mistakes you lose!\n\nBut as i say is different approach to the game. Just a fun or as a sport.\n\nlet me tell you one thing Boored. There is no point casting pears before the swine.\n\n \n\n \n\n \n\nBetter to be a pig than a ****…\n\n\n\npersonally i think this is all an elaborate plot on tragic's and booored's behalf to get more forum time…..****! why didnt i think about that for my tolkienology series haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662127","commentId":662127,"userName":"Dam the Man","timestamp":1342971027,"content":"Dain Ironfoot said:\n\nbut there is a difference between rules and card text. and there is a huge difference in missing a rule, missing card text and not \"caring\" about the rules -- \"not caring\" is something that certainly can't be assumed from simply making a mistake or missing card text, or just being plain forgetful.\n\n\n\nTo me there isn't. Game rules are added on/changed/whatever by card text, they are very much part of the rules as a whole. Actually think rules themselves people probably have down to a T fairly soon after they've played the game (esp. a game like LotR which has specific phases for stuff), so all you really have to pay attention to are the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662133","commentId":662133,"userName":"Dain Ironfoot","timestamp":1342971524,"content":"Dam said:\n\nDain Ironfoot said:\n\n \n\nbut there is a difference between rules and card text. and there is a huge difference in missing a rule, missing card text and not \"caring\" about the rules -- \"not caring\" is something that certainly can't be assumed from simply making a mistake or missing card text, or just being plain forgetful.\n\n \n\n \n\nTo me there isn't. Game rules are added on/changed/whatever by card text, they are very much part of the rules as a whole. Actually think rules themselves people probably have down to a T fairly soon after they've played the game (esp. a game like LotR which has specific phases for stuff), so all you really have to pay attention to are the cards.\n\n\n\nbut to paint a broad brush, blanket statement that \"people don't care\"  when all they (probably) did was make a mistake, is arrogant, dismissive, and ultimately, unhelpful. why you feel the need to do so is, frankly, beyond me.\n\nPublish [http://www.fantasyflightgames.com/edge_public/img_edge/spacer.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662140","commentId":662140,"userName":"Glaurung","timestamp":1342973547,"content":"Dam said:\n\n To my view of looking at games, if you don't care about the rules, you don't care about the game.\n\n\n\nto explain my view i wright so many words but you was really short and really come to the the point. Shoot the apple!!!\n\nGood Point Dam!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662144","commentId":662144,"userName":"Glaurung","timestamp":1342974000,"content":"mr.thomasschmidt said:\n\nGlaurung said:\n\n \n\nI know Tragic long time and i even use to talk to him by skype many times. He always do mistakes and many times i told him about it.\n\nBut in this video Tragic make a lot of Big mistakes what is really surprise me……  But there is no tournament system so who really cares….\n\nQuest log\n\nI got Boored point when he told me long time before about Quest log:\n\nAll quest log results is wrong cose people dont know the rules well.  So after watch Mitch and ko videos and some Tragic videos i understand Boored point.\n\nIf most active players on this forum play wrong, so how about others players? \n\nMtg community is different cose if you play wrong you will just lose all the time and  there is no fun to play. And tournaments teach you really fast. But in this game everything is different. Here is different kind of players.\n\n I use to  play cards game more then 10 years and my approach to the game is different from players like Mitch for example.. I play MTG really serious. Then i  use to play LOTR TCG Decipher and also i was tournament director of Decipher. I use to play many tournaments and play world cups where 1 small mistake or wrong rules understanding cost you and your team a lot. You opponents is strong and if you dont know the rules well you have no chance……\n\nMany players here just dont understand me………But as Tournament Director i cannot just ignore mistake of some players. This is natural think. Like birds is flying, director is watching and count all mistakes. This is like a second skin.\n\nFor example i remember all Lotr cards game text. I dont to look on the card text for me is enough to see the picture. But this is how you train your brain to be a good player. You must know the cards, you must feel the flow of the game. And you must know the rules like 2+2=4. Otherwise you will never be a good player.\n\nIn all good times i use to take 6 sides dice roll and every mistake in your game cost you 1. If you reach 6 you lose. Doesn matter even if you still in the game and game going well. 6 mistakes you lose!\n\nBut as i say is different approach to the game. Just a fun or as a sport.\n\nlet me tell you one thing Boored. There is no point casting pears before the swine.\n\n \n\n \n\n \n\nBetter to be a pig than a ****…\n\n\n\nIm sorry my friend but……. Im always prefer to be a **** cose im a man. So if you are prefer to be a pig is up to you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662149","commentId":662149,"userName":"richsabre","timestamp":1342976497,"content":"Edit- never mind im staying out of it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662222","commentId":662222,"userName":"mr.thomasschmidt","timestamp":1343000098,"content":" Well, since you put it that way Glaurung then…no not really. A **** doesn't make you a may cause everyone can get one of those. What makes a man a man is his actions through life. And don't try and hide behind your \"my English is bad but improving\" excuse. First of all, it's not that much better since you began at this forum. Secondly and most import, it's not the language that makes your statements so poisonous but the spirit you write them In. Over a year you have spewed you destructive meanings and critics at everyone else and that would never change or be taken in any other way even if your English should some day improve. And all that crap about playing for 10 years, really serious, tournament master bla bla bla doesn't give you any right at all to think you are the god of this game. So how about getting a life outside this game and this forum, try and get some friends and see how it is to be a nice guy, or just a human being to begin with. But of cause,if you act like you do here at the forum I can understand that you don't have any friends in the real world and why this game is the only \"friend\" you have…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662303","commentId":662303,"userName":"leptokurt","timestamp":1343023400,"content":"Hmmh, I'm always glad when someone points out a mistake I made, so I can avoid them in the future.\n\n \n\nOf course I am also glad when said person takes the time to spell this out in a polite way that doesn't make me look like an idiot. After all it's not that difficult and doesn't even depend on your gender."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662437","commentId":662437,"userName":"booored","timestamp":1343047197,"content":"everyone makes mistakes… this is the point… rich and G and dan say they don't but that is bull, the fact that it is solo means if you make a mistake YOU NEVER NOTICE.. so you probably think you are playing right but i assure you, you aren't. Spesh G who claims such a win ratio.. he for sure is cheating.\n\nIf you make videos like tragic and those cardboardof the rings guys, then you are opening yourself to the public, and people pointing out when you suck. That isn't being mean.. your the one that is sucking and getting it wrong.. not them\n\nTragic is a bit better at this than the cardboard guys, even though he gets more wrong, as he is just having fun, despite what dan thinks.. winning and rules are WAY down the lsit of what makes a game good. The Cardboard guys put on all these airs liek they are telling us something, talking with all this authority when they are way way way worse players than most of the people that post on this forum.\n\nI think that is what pisses me off and probably what anoys G as well.. if your going to post and set yourself up as a authority on the game then yes.. you should probably NOT play liek a total pudding."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662454","commentId":662454,"userName":"richsabre","timestamp":1343048171,"content":"booored said:\n\n \n\neveryone makes mistakes… this is the point… rich and G and dan say they don't but that is bull, the fact that it is solo means if you make a mistake YOU NEVER NOTICE.. so you probably think you are playing right but i assure you, you aren't. Spesh G who claims such a win ratio.. he for sure is cheating.\n\nIf you make videos like tragic and those cardboardof the rings guys, then you are opening yourself to the public, and people pointing out when you suck. That isn't being mean.. your the one that is sucking and getting it wrong.. not them\n\nTragic is a bit better at this than the cardboard guys, even though he gets more wrong, as he is just having fun, despite what dan thinks.. winning and rules are WAY down the lsit of what makes a game good. The Cardboard guys put on all these airs liek they are telling us something, talking with all this authority when they are way way way worse players than most of the people that post on this forum.\n\nI think that is what pisses me off and probably what anoys G as well.. if your going to post and set yourself up as a authority on the game then yes.. you should probably NOT play liek a total pudding.\n\n \n\n \n\ntheres no point in me repeating something ive already said so heres one i made earlier:\n\n\"i also know all the cards off by heart and am a very competant mathematician and on the vast majority of occasions play correctly, but that still doesnt mean that i dont make mistakes- everyone makes mistakes\"\n\nrichsabre 2012\n\nplease read my posts…and while were at it what makes you so in the know? can you refer me onto one of your vids? and done bother to say im not experienced in card games…im aware of that….lets talk about booored for a change"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662482","commentId":662482,"userName":"Dain Ironfoot","timestamp":1343050015,"content":"booored said:\n\n \n\nIf you make videos like tragic and those cardboardof the rings guys, then you are opening yourself to the public, and people pointing out when you suck. That isn't being mean.. your the one that is sucking and getting it wrong.. not them\n\n \n\n \n\nbooored is completely discussing side issues that no one is raising (and it comes as no surprise that he is dodging the real issue here -- that he's less than polite/constructive).\n\nas far as i can see, not a single soul has said putting videos out there for the universe to see doesn't open yourself up to criticism. i'm pretty sure most have acknowledged that, certainly I have, certainly the COTR guys have, and many, many others.\n\nthe issue, that you continuously ignore, is that you, again, are beyond utterly rude in your comments which makes you less than unhelpful for anyone on these boards/YouTube/elsewhere. someone should have taught you a long time ago you can catch more flies with honey than with vinegar.\n\n\"you are the one sucking and getting it wrong…not them\" -- and you are the one \"sucking\" at being constructive, building a positive gaming environment where all can come and learn how to be better players, better parts of a gaming community, etc.\n\nagain, why you feel the need to constantly denigrate others is disturbing and if you truly want to add value to the boards, try being constructive, polite, and helpful in your comments. you can get the same point across, without pissing off everyone in the process."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662492","commentId":662492,"userName":"leptokurt","timestamp":1343050906,"content":"Kay, if I should ever plan to submit a gameplay video (to become an AUTHORITY!), I'll let it check by my lawyer first, just so that no one gets offended in case there's a mistake in it.\n\nI guess there's only one way to solve this problem: Tragic has to realize that he's a - uhm - pudding and joins Rodney Smith's Watchitplayed, now that he realizes that his effort to share his fun with LOTR LCG utterly failed. Together they can produce like - what? -  thousands of thousands of - silly! - mistakes. Starting with a review of Rich's bestseller \"Breaking the rules without noticing -  don't mess with the ally trait\".\n\nlengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662499","commentId":662499,"userName":"TheLightdarker","timestamp":1343052050,"content":"booored said:\n\n \n\neveryone makes mistakes… this is the point… rich and G and dan say they don't but that is bull, the fact that it is solo means if you make a mistake YOU NEVER NOTICE.. so you probably think you are playing right but i assure you, you aren't. Spesh G who claims such a win ratio.. he for sure is cheating.\n\nIf you make videos like tragic and those cardboardof the rings guys, then you are opening yourself to the public, and people pointing out when you suck. That isn't being mean.. your the one that is sucking and getting it wrong.. not them\n\nTragic is a bit better at this than the cardboard guys, even though he gets more wrong, as he is just having fun, despite what dan thinks.. winning and rules are WAY down the lsit of what makes a game good. The Cardboard guys put on all these airs liek they are telling us something, talking with all this authority when they are way way way worse players than most of the people that post on this forum.\n\nI think that is what pisses me off and probably what anoys G as well.. if your going to post and set yourself up as a authority on the game then yes.. you should probably NOT play liek a total pudding.\n\n \n\n\n\nThings I have learned from Booored's criticism to make better videos:\n\n- Begin each video explaining that I am a \"way way way worse player\" than most people who post on the FFG forums. Hopefully, doing that will ensure that as few people as possible are exposed to my terrible gameplay and close out of the video as soon as they can.\n- Be sure to remove any hint of enthusiasm, energy or passion from my voice, because I don't want to come off as an \"authority\"\n- No matter how many mistakes other players make, they will always be better than me (this is a highly logical statement)\n\nSome idle thoughts:\n\n- I've never once described myself as an \"authority\" on this game.\n- Booored has spent over a year critiquing almost every single player that ever posts anything on these forums - hasn't he been trying as hard as he can to seem like an \"authority\" himself? He will deny this, I'm sure, but really, think about it.\n- Is Booored jealous that there are people out there that respond positively to me, or Tragic, or COTR, whereas most posters tend to think he's an ignorant troll that continues to run these forums into the ground?\n\nHmm.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662512","commentId":662512,"userName":"Cunir","timestamp":1343053253,"content":"TheLightdarker said:\n\n- I've never once described myself as an \"authority\" on this game.\n\n \n\ni was going to say exactly the same thing… but you beat me to it. maybe booored doesn't bother listening to your podcasts, but he would have got that if he did. none of the COTR guys pretend they are anything other than fans of the game\n\nbut seriously… people need to stop feeding the trolls in this place. Booored and glaurung like being the centre of the conversation. they like it when people argue with them. that is probably the whole reason why are so rude all the time, because they get more enjoyment out of provoking people than they than do talking about the game.\n\nbut i do agree with booored on one thing… in his signature he says that the FFG forum software isn't very good (in a totally rude way, obviously!) but he's right… because we desperately need an \"ignore feature\" -- so we can block people like him and glaurung\n\nwhat disappoints me most of all is that decent people who know a lot about the game dont bother coming here anymore, purely because of the bad vibe that they generate. i have seen people say that exact thing on COTR's facebook page -- so it is definitely true. they are slowly ruining the forum by putting good people off sticking around. i have only been contributing to this forum for about a month, and already i am sick and tired of every conversation turning into a \"booored and glaurung, why are you so rude?\" argument. it gets boring very quickly"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662539","commentId":662539,"userName":"Glaurung","timestamp":1343056341,"content":"I think better we stop this kind of things here. Anyway we will not come to any solution here. I try to explain my position but i dont think my English is good enough for that ( here Mr Shmidt is right). Problem is, we just blame each other and we not even really hearing each other. This is pointless! Specially when i see most of conclusions of players about my motive is so wrong!\n\nBetter stop it!\n\nNow we have a new Amazing hero as Elrond coming. Cool card! Look like FFG start to support solo decks  more and more.Maybe they understand now most of the loyal players is solo players?\n\nJust scare for coop game. With hero like Elrond and new Glorifindel coop game can be really walk in the park. Specially for quests with difficulty 4 or less.\n\nAlso look on new Gandlalf from Hobbit set. He is also very powerful. They want to make game more easy or we will get more powerful encounter cards?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662547","commentId":662547,"userName":"Cunir","timestamp":1343056989,"content":"how about we talk about tragic's videos instead? that's what this thread is supposed to be about… before it was hijacked for two pages by everyone arguing about the same old people (again)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662554","commentId":662554,"userName":"leptokurt","timestamp":1343057577,"content":"Cunir said:\n\nhow about we talk about tragic's videos instead? that's what this thread is supposed to be about… before it was hijacked for two pages by everyone arguing about the same old people (again).\n\n\n\nYeah - Zombie Arwen has been saving the day!\n\n \n\nAnd one day I have to bring myself to actually understand this Lackey software…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662595","commentId":662595,"userName":"mr.thomasschmidt","timestamp":1343060818,"content":" Leptokurt, do yourself a favor and get into the lackey as soon as you can. It's awesome :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] As I haven't really tried it in multiplayer over the net it's a treasure for solo/single play. Octgn or how it's spelled is probably a better multiplayer version BUT they don't respect the 6 month \"rule\" set by FFG. (A card/pack/AP/set whatever, has to be in sale for at least 6 months before getting published for this kind of software.) Tragic has a great respect for this and since it's him that makes the plugin for this particular game we only have up until Kazard-Dum. The first Dwerowdwelf pack will be updated around sep I think. Just for your info :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAnd to Tragic, great plugin and videos. Please disregard the last two pages and continue your great contribution to create a nice, entertaining atmosphere :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAnd to you Mitch, you have really contributed greatly to making the CotR way it is today, together with the rest of the crew of cause ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] please don't let trolls keep you from the things you just posted. The rest of us like when you are enthusiastic :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] (maybe try and throw a couple of forest snares on the G & B trolls? Could never hurt :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662605","commentId":662605,"userName":"richsabre","timestamp":1343061708,"content":"mr.thomasschmidt said:\n\nmaybe try and throw a couple of forest snares on the G & B trolls? Could never hurt :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] )\n\n\n\nhaha i like this…well done"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662694","commentId":662694,"userName":"Glaurung","timestamp":1343075662,"content":"richsabre said:\n\nmr.thomasschmidt said:\n\n \n\nmaybe try and throw a couple of forest snares on the G & B trolls? Could never hurt :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] )\n\n \n\n \n\nhaha i like this…well done\n\n\n\nYes sounds good but……Glaurung is a dragon! Cannot snare him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662732","commentId":662732,"userName":"TragicTheBlathering","timestamp":1343086358,"content":"Here is another deck, this one is pretty fun, and it can slot very nicely into multiplayer with minimal alteration, just add some sentinel marks. Anyway, let me know if there are any mistakes…\n\nWall of Lore (Solo Edition) [http://www.cardgamedb.com/forums/index.php?/topic/2781-lotr-deck-wall-of-lore/]\n\nHere is the deck list… I changed Heroes to Aragorn as I nvr really utilize The princes ability… and there is ample resources in this dec for the untap effect. I really only had the prince in so I was forced not to quest with him, as the \"discard attachment\" when reveal on the orcs that effects questing characters is a deck engine wrench. If you run aragorn, think about adding teh stone as well…\n\nTROLL FEINT\n\n1) Grasping Tentacle activates when the shadow card is a tentacle OR has a shadow effect. You drew \"Wargs\" which has a shadow effect, and hence the Grasping Tentacle should have been activated.\n\n * D'oh! Oh well.. but I think this is a fairly trivial problem… while it was an error I think the deck can handle this situation.. I am not sure when this happened as you didn't put in a time code.. but I am fairly certain I always attacked the grasping Tentacle with a chump ally.. so the attachment would have gone on them and not ever affected the outcome of the game.\n\n2) Biting Winds (?) You should discard 3 resources for each hero. You only discarded resources from one hero\n\n * True but again, no affect on the game as I was pulling 5 resources a turn or w/e on the prince and he had both a spirit and lore resource.. so 3 resources here or there would have made no difference. Still yeah.. what a **** up I am !!! oh well.\n\n3) You cast a Leadership card with a Lore resource on your very firt act!!\n\n * WOW… that is totally true.. I am pretty badly dyslexic, and I must have seen the Lore song and planned to cast it next turn and confused myself or something.. oh well.. again, this is a pretty major problem.. but all that would have resulted.. is … nothing. Denathor would have been delayed a turn or 2 in getting to 6 defense… I do not think this caused a wound not to be placed.. but yeah.. I'm a screw up!!!\n\n4) You could have won the game by discarding Stargazer!\n\n * Totally… I keep forgetting that you can \"discard\" form your hand AND form the table and that this game uses the same keyword for both actions.. I always get confused as like 99% of card games use \"discard\" to me \"from hand\" and something like \"Sacrifice\" to mean form table. Oh well.. I also could have won that very first deck peak by discarding that useless lore event witch started with T and so did the encounter card I sent to the bottom of the deck!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=662846","commentId":662846,"userName":"Glaurung","timestamp":1343115330,"content":"Actually i like the idea of your deck. Very simple but also quite effective.\n\nYou open my eyes to Resourseful card which one can be really playable with SOG. Never think about this card this way. Cool Cool!\n\nAbout your mistakes:  yes there is some and you have more then worthy answer already without any hysteric.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=663293","commentId":663293,"userName":"TragicTheBlathering","timestamp":1343166031,"content":"Thanks G! Yeah it is a pretty fun deck, has some weaknesses but is very flexable as you can keep the core engine and deck design and compleatly change the \"fringe\" cards to suit what ever quest you like and even splash off sphere allies with stand and fight if you need that extra attack power or healing or progress placement or w/e… It also should fit into multiplayer decks very sug.\n\nI would demo that but no one in my play group wants to record their voice for youtube!!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=663391","commentId":663391,"userName":"mr.thomasschmidt","timestamp":1343195748,"content":"Wrong thread for my post. Moved to Plugin for Lackey thread"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=663398","commentId":663398,"userName":"mr.thomasschmidt","timestamp":1343196496,"content":"Just an apology for my previous post before I found out that you can edit you own posts :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] So this was a wast of space also :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58504-lord-of-the-rings-lcg-youtube-videos/?do=findComment&comment=664439","commentId":664439,"userName":"TragicTheBlathering","timestamp":1343360302,"content":"Here is a little instructional video on how to make Proxies and also a cheap way to build custom quests!! This is the cheap way (assuming you are already sleeving your cards) The entire quest cost me like 3 bucks or so, and it only cost that much due to a error in the printing so i had to print it twice.\n\nThe quest I use in this demo is ORC HUNT\nDownload at BGG [http://boardgamegeek.com/filepage/80417/orc-hunt-custom-scenario]\n\nI used music in this one.. if the video is banned anywhere I am sorry :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\n--------- --- -------------- --------- --- -------------- --------- --- -------------- --------- --- -------------- --------- --- -------------- --------- --- -------------- --------- --- --------------\n\n\n\n\n\nDownload at BGG [http://boardgamegeek.com/filepage/80417/orc-hunt-custom-scenario]\n\nThis is a set review.. as the store sent me a Warhammer Invasion pack instead of the new LoTR AP! This is ORC HUNT one of the best Custom Sets I have seen and easily the equal of some of the quest from FFG, like The Barrow Downs before it this is a MUST play.\n\n "}]}