{"url":"https://community.fantasyflightgames.com/topic/58520-discard-escort-from-edoras-for-questpoints-after-adventure/","title":"Discard Escort from Edoras for questpoints after Adventure?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58520-discard-escort-from-edoras-for-questpoints-after-adventure/?do=findComment&comment=575533","commentId":575533,"userName":"Knoedelmeister","timestamp":1325838677,"content":"Hey guys,\n\nafter finishing one part of the Adventure \"Escort from Edoras\" is discarded as i get it. But am I able to play \"Ride to Ruin\" before it is discarded? Or would it even be possible after counting my willpower after the quest to use \"Ride to Ruin\" to discard \"Escort from Edoras\"  befor progress tokens are placed and put the 3 \"extra\" progress tokens on the aktive lokation and still got his willpower for this quest?\n\nGreetings Knoedelmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58520-discard-escort-from-edoras-for-questpoints-after-adventure/?do=findComment&comment=575549","commentId":575549,"userName":"muemakan","timestamp":1325840570,"content":" There was an answer from Nate French somewhere here in this forum. I guess this would mean nothing can be done with the Escort to save or use her.\n\n\n\nA: The quest resolves at the conclusion of its final step. Forced effects should resolve before player player actions.\n\n \n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58520-discard-escort-from-edoras-for-questpoints-after-adventure/?do=findComment&comment=575550","commentId":575550,"userName":"muemakan","timestamp":1325840594,"content":" By the way.......http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=589087"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58520-discard-escort-from-edoras-for-questpoints-after-adventure/?do=findComment&comment=575576","commentId":575576,"userName":"zeb","timestamp":1325843411,"content":"As muemakan said, Nate clarified that Forced effects resolve before Player Actions (and Responses that can be triggered off the same prerequisite, see FAQ 1.09). Quest step 3 cannot be interrupted until you place tokens and apply the Forced effects, so you would not be able to play \"Ride to Ruin\" action first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58520-discard-escort-from-edoras-for-questpoints-after-adventure/?do=findComment&comment=575701","commentId":575701,"userName":"HilariousPete","timestamp":1325862489,"content":"Knoedelmeister said:\n\nafter finishing one part of the Adventure \"Escort from Edoras\" is discarded as i get it.\n\nJust to clarify: You have to discard the Escort not when you advance to the next stage of the adventure, but when a quest has been resolved. Quest resolution is phase 3 in every turn, so you would have to discard the Escort even if you quested unsuccessfully. (Only if the Escort has been comitted, of course.)\n\nBy your nickname I'd guess you use German cards? When I first read the Escort's text, I was confused about that, too. \"Abenteuer abhandeln\" may sound like advancing to the next stage, but is defined as phase 3 of every turn (see the title of the upper box / example on page 15 of the German rules. Took me some time to find it ;-) But it's well defined because of that title.)\n\nGreetings,\n\nPete\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58520-discard-escort-from-edoras-for-questpoints-after-adventure/?do=findComment&comment=575822","commentId":575822,"userName":"Knoedelmeister","timestamp":1325881027,"content":"thanks a lot for all the info. This link was quite usefull, i had to read for a while till i finally unterstood everything.\n\nAnd yes i use the german cards and i used them wrong. I only discarded them after completing one chaper of the advernture not after every Quest. Spezial thank for this info. The German translation sucks at this card, but i have to say it is normaly pretty good.\n\nGreetings Knoedelmeister"}]}