{"url":"https://community.fantasyflightgames.com/topic/58530-wrong-italian-translations-in-shadows-of-mirkwood-cards/","title":"Wrong Italian translations in Shadows of Mirkwood Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58530-wrong-italian-translations-in-shadows-of-mirkwood-cards/?do=findComment&comment=575606","commentId":575606,"userName":"ThelomenToblakai","timestamp":1325848583,"content":"Hi everybody\n\nI just wanted to report a couple of translation errors/typos in the Italian edition:\n\nDiscordia (Infighting  - Shadows of Mirkwood, 58).\n\nItalian text reads: \"Azione: Sposta un qualsiasi numero di danni da un eroe a un altro\". (\"Action: move any number of damage from a hero to another\").\n\nWhile it should read \"Azione: Sposta un qualsiasi numero di danno da un nemico a un altro\" (\"Action: move any number of damage from an enemy to another\")\n\n \n\nI Migliori del Riddermark (The Riddermark's Finest - Shadows of Mirkwood, 77).\n\nItalian text reads: \"Azione: Esaurisci I Migliori del Riddermark per paizzare 2 segnalini progresso su un luogo qualsiasi\". (\"Action: Exhaust The Riddermark's Finest to place 2 progress tokens on any location).\n\nWhile it should read: \"Azione: Esaurisci e scarta I Migliori del Riddermark per paizzare 2 segnalini progresso su un luogo qualsiasi\". (\"Action: Exhaust and discard The Riddermark's Finest to place 2 progress tokens on any location)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58530-wrong-italian-translations-in-shadows-of-mirkwood-cards/?do=findComment&comment=575688","commentId":575688,"userName":"richsabre","timestamp":1325860576,"content":"if this is so, then i would recommend contacting FFG directly. i do not think they check these posts"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58530-wrong-italian-translations-in-shadows-of-mirkwood-cards/?do=findComment&comment=576744","commentId":576744,"userName":"jhaelen","timestamp":1326083722,"content":"I think you'll have to contact the Italian publisher's customer support for things like that. FFG itself doesn't really have anything to do with localized versions of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58530-wrong-italian-translations-in-shadows-of-mirkwood-cards/?do=findComment&comment=577547","commentId":577547,"userName":"ArturiStellare","timestamp":1326204468,"content":"aaaah now is right. Infact I didn't understand Discordia!\n\nI hope in the future italian release pack, the italian FFG give us some fixed cards"}]}