{"url":"https://community.fantasyflightgames.com/topic/58543-one-deck-to-rule-them-all/","title":"One Deck To Rule Them All","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58543-one-deck-to-rule-them-all/?do=findComment&comment=575672","commentId":575672,"userName":"Stenun","timestamp":1325858116,"content":"So does anyone have one deck that has beaten all the scenarios without needing any changes at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58543-one-deck-to-rule-them-all/?do=findComment&comment=575682","commentId":575682,"userName":"booored","timestamp":1325860152,"content":"There is a few floating about that can beat all of mirkwood.. but I have yet to here of one that dose all quests that are released including escape and massing. Try cardgamedb.com there are a few decks there that claim to be able to thrash all sanarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58543-one-deck-to-rule-them-all/?do=findComment&comment=575686","commentId":575686,"userName":"richsabre","timestamp":1325860402,"content":"while im sure there are, i do not think this was an intended possibility,  this is after all a deck building game, and the scenarios vary much so that you are encouraged by design to make different decks.\n\ni think as the games goes on one supreme deck will become harder to make, as the quests will become so varied, up coming packs look to back this point up"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58543-one-deck-to-rule-them-all/?do=findComment&comment=575726","commentId":575726,"userName":"SiCK_Boy","timestamp":1325865268,"content":"I haven't played much in a while (a few games over the holidays), but I did keep on buying the expansion packs.\n\nI don't know about a current deck beating all scenarios consistently, but I'm sure there are decks out there beating \"most\" scenarios with high win percentage... and we should be seeing more and more of those as we move forward. What we can hope for is to see a great variety amongst those decks.\n\nUntil they start putting more and more restrictions in the scenarios construction (ex: lower the maximum treat, force the use of only 2 or 1 hero, etc.), we'll keep seeing scenarios following regular patterns. The basic rule is still to quest, defend and attack. And as expansions are released, players will have access to more and more cards to allow them to perform those functions.\n\nPlayer versatility will keep on increasing much faster than scenario complexity or strategy, I believe. We've seen it with the release of the songs (everyone can have access to the best hero abilities while still playing the best cards from each sphere). Certain scenarios require specific skills or cards (Journey to Rhosgopel comes to mind); as of right now, that scenario is very difficult without Tactics and/or Lore. But as they'll release more cards with Ranged in various Spheres, it'll reduce the difficulty of the scenario. Who's to say we won't see a healing implement in a different sphere eventualy. As those \"versatile\" cards become common staples in future decks, more and more scenarios (from the past) will become easier."}]}