{"url":"https://community.fantasyflightgames.com/topic/58662-any-play-the-lotr-mmo-to-get-in-the-mood/","title":"Any Play the LOTR MMO To Get In The Mood?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58662-any-play-the-lotr-mmo-to-get-in-the-mood/?do=findComment&comment=576722","commentId":576722,"userName":"Will Fuqua","timestamp":1326073100,"content":"Besides listening to the trilogy soundtrack while playing the card game, I will sometimes play The Lord of the Rings Online mmorpg before playing solo to get into the feel.   I don't go do quests or fight anything in the game, I actually load in my hobbit and wander around the Shire either drinking in a pub, fishing next to a lake, smoking pipeweed, relaxing in my hobbit hole, or sometimes I head over to the Prancing Pony in Bree to get involved in the role-play that you can almost always find happening there on the Landroval server (rp server).  The sounds and music are pretty relaxing, and it gets me in the mindset of being in Middle-Earth before I set off on my adventure with the card game.  If you play any and are on Landroval, let me know.  If you're curious about it, it's play for free for the most part.  I don't personally pay for it myself because I don't play it to get to high levels but simply for the immersion.  If  you play through LackeyCCG, then perhaps think about meeting up in the Prancing Pony and talk about what adventure you'll be taking on while drinking some ale next to the fire and listening to a bard playing some music.  Then switch over the program and set out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58662-any-play-the-lotr-mmo-to-get-in-the-mood/?do=findComment&comment=576746","commentId":576746,"userName":"booored","timestamp":1326084337,"content":"no.. glad you have fun.. but that sound mega lame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58662-any-play-the-lotr-mmo-to-get-in-the-mood/?do=findComment&comment=576766","commentId":576766,"userName":"Eryx_UK","timestamp":1326091374,"content":"I play the LotRO MMO but I can't justs it around and chill. I'm in it for the quests and the adventures that Middle Earth brings. But I do play it to refresh my desire to play the LCG from time to time. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58662-any-play-the-lotr-mmo-to-get-in-the-mood/?do=findComment&comment=576775","commentId":576775,"userName":"richsabre","timestamp":1326093665,"content":"whats so lame?? sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif] i occasionally play it, i prefer the lower level areas such as shire/ ered luin, becuase they look nice and the themes better\n\ni cant say i enjoy to a level where id pay though, it gives me nowhere near as much enjoyments as this does, but yes, i do like to get immersed from time to time when my laptops 2kb of ram (joke) can handle it. my problem with it is that past lvl 20 or so, the areas such as shire etc become pointless as everything is so weak there...i was talking about this in another thread about power creep and how this game takes no actions to stop it...\n\n also the forum.......man the forum is terrible...every post literally...this is rubbish, i want my money back this game is dead...sad thing is they may be right, its a dying game...i was banned from the forum for no reason for a week, i contacted the and got nothing back, i eventually got back on and posted on the forum asking if anyone knew why...i was warned for discussing it by the moderators!!\n\nanyways if we're talking lame...beat this....i like to go to michel delving auctions house buy some pipe weed, go to bag end and watch the sunset and have a smoke.....gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] by the way im on dwarrowelf"}]}