{"url":"https://community.fantasyflightgames.com/topic/58888-question-about-goblin-archerkhazad-dum/","title":"Question about GOblin Archer(Khazad-Dum)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58888-question-about-goblin-archerkhazad-dum/?do=findComment&comment=578825","commentId":578825,"userName":"Glaurung","timestamp":1326426689,"content":"I didn get Khazad-Dum yet but i see some spoilers and Goblin Archer card game text is really surprise me.\n\nHere is game text:\n\nGoblin Archer\nType: Enemy\nEncounter Set: Plundering Goblins\nThreat Threashold: 48\nThreat: 2 Attack: 1 Defense: 3 Hit Points: 1\nGoblin. Orc.\nPlayers cannot optionally engage Goblin Archer.\nCharacters with ranged are eligible to attack Goblin Archer while it is in the staging area.\nForced: After an enemy is revealed from the encounter deck, the first player must deal 1 damage to 1 character he controls.\n\n \n\nCharacters with ranged are eligible to attack Goblin archer while it is in staging area???? How it can be??? As i know only Dunhere can attack enemies on the staging area and he is not ranged. And ranged never give ability to attack staging area. So why this text is there??? Any thought??\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58888-question-about-goblin-archerkhazad-dum/?do=findComment&comment=578831","commentId":578831,"userName":"Dam the Man","timestamp":1326427319,"content":"It effectively gives Ranged characters Dunhere-ability for attacking the Goblin Archer. Nothing more.\n\nWhen I see that text, I picture the flight to the Bridge scene from the movie, archers popping shots from well outside melee range, where the heroes have no way to reach them, with Legolas dropping them with his own shots."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58888-question-about-goblin-archerkhazad-dum/?do=findComment&comment=578868","commentId":578868,"userName":"richsabre","timestamp":1326437546,"content":"yeah its a theme thing... there was a similar scene in the book- just before the bridge of khazad dum... when the orcs had failed to trap the fellowship with the 'new devilry' which is my profile pic............i always thought that ranged would have given this to all enemies, then i realised that would be far too powerful"}]}