{"url":"https://community.fantasyflightgames.com/topic/58954-khazad-dum-my-review/","title":"khazad dum- my review","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58954-khazad-dum-my-review/?do=findComment&comment=579379","commentId":579379,"userName":"richsabre","timestamp":1326545109,"content":"finally got my hands on khazad so i thought id give my early impressions\n\nfirstly i used maelstrom games uk and have to put in a good word....free shipping and it came next day. great stuff. im pleased ive preordered the upcoming packs from them.\n\n \n\npresentation: i love the box it came in, i was expecting something much more flimsy than the nice card box. the artwork on the box is beautiful. the cards were all well wrapped in the plastic film, and all were in perfect cut condition APART- and here's my only small niggle- from 3/4 cards- 3 of the zigil miner and 1 khazad khazad. they had extremely small creases at the top, about 1 mm big. not important to me, but im doing a fair review here.\n\n \n\ntheme/artwork: this is where khazad shines (no surprise coming from me..........). the artwork has some of my favourites in the box- stray goblin, veteran of nadhurion, first hall....its all amazing. there are quite a few new keywords in the game, which all adds to an interesting experience that actually feels like you are in the mines, fighting off goblins left right and centre. the theme i think is the best so far. much better than mirkwood cycle. it seems much more focused on getting the feeling right, and it accomplishes this easily.\n\n \n\nplayer cards: no complaints here, very useful cards which can see use in all quests to date. there is however a huge amount of encounter cards in the box....i would have liked a few more player cards but hey, again its not big deal, and the game needs some new good encounter sets to set up dwarrowdelf\n\n \n\nquests: first things first......these arent easy. i spent about 3 times on the first quest thinking it was level 3 before i realised it was level 5, so i went onto the level 3 quest. i got a little closer on this one, havnt cracked it yet but got close. again the continuing feel is being swarmed by goblins, so if you like fighting you're in for a treat. i havnt tried the last quest yet, but it looks good.  my only complaint so far is the 'blah blah last player....' cards, if you're a soloer these are a pain in the ................ as you constantly get shadow effects like +3 attack. still its a challenge, which is good, and i cant see these quests getting old any time soon.\n\n \n\nConclusion: there was a huge build up to this, but it doesnt dissapoint, theres something for everyone on here, a good range of quests, player cards, plenty of challenges all wrapped up in a nice tolkien faithful package\n\nwell done FFG, give yer'selves a pat on the back"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58954-khazad-dum-my-review/?do=findComment&comment=579385","commentId":579385,"userName":"player1761766","timestamp":1326545827,"content":"richsabre said:\n\nthe theme i think is the best so far. much better than mirkwood cycle. it seems much more focused on getting the feeling right, and it accomplishes this easily.\n\n\n\nCouldn't agree more! Something I've really enjoyed about this game so far, from the core set and all through the Shadows of Mirkwood lot, is the continually evolving way that new bits are added here and there, just a little something extra to make an expansion slightly different from the one beforehand. But Khazad-dum?! This one really feels like a whole new game! Here's hoping this will continue on into Dwarrowdelf and whatever they decide to spring on us next (Rivendell, perhaps? With Elrond as a Gandalf-like ally?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58954-khazad-dum-my-review/?do=findComment&comment=579389","commentId":579389,"userName":"richsabre","timestamp":1326546005,"content":"spalanzani said:\n\nrichsabre said:\n\n \n\nthe theme i think is the best so far. much better than mirkwood cycle. it seems much more focused on getting the feeling right, and it accomplishes this easily.\n\n \n\n \n\nCouldn't agree more! Something I've really enjoyed about this game so far, from the core set and all through the Shadows of Mirkwood lot, is the continually evolving way that new bits are added here and there, just a little something extra to make an expansion slightly different from the one beforehand. But Khazad-dum?! This one really feels like a whole new game! Here's hoping this will continue on into Dwarrowdelf and whatever they decide to spring on us next (Rivendell, perhaps? With Elrond as a Gandalf-like ally?)\n\n\n\ni dont think you are far off there....the slip also mentions lothlorien as well, so looking forward to it now"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58954-khazad-dum-my-review/?do=findComment&comment=579397","commentId":579397,"userName":"booored","timestamp":1326547002,"content":"I'm actually disappointed in Kaz myself. I feel like the entire pack is just a \"booster\" and not a \"real\" adventure in many ways. What it basically is, is a product to get into our hands a number of alternative encounter decks, so future APs are able to use them. That is its main function in the \"scheme of things\", as a dilivery system to updates our generic encounter sets.. NOT to play a quest. The individual APs were so awesome as they had a custom encounter set JUST for a single quest, that then took some of some of the other sets to make the deck. This gave the quest some great individuality and some real cool functions and stuff. As the Kaz decks are just made form the generic encounter decks the quest themselves feel flat and lifeless.\n\nAlso I found them super easy, as in I beat the Into the Pit and The 7th gate scenario on my very first attempt with the first decks I made after reading their encounter cards. Pretty disappointing. I have yet to play the one with all the billions of quest cards though as I'm saying it for a first run though with my co-op partner.\n\nAnyway. What we have here is a product that is basically just to get into our hands a series of encounter decks, witch will ALLOW them in future to make more interesting quests that have been adjusted for power creep among other things. I think that once Darowdelf is out and we again have 100% unique encounter cards that are designed just for 1 quest only the quest will once again feel fresh and interesting. For now though, I mean I waited for so long, and I've already gone back to refining my Cycle: Mirkwood - RESTRICTED deck, as I find it simply more interesting.\n\nDo not get me wrong the new encounter cards are cool and they seam interesting, but I really think the lack of the custom and unique encounter cards we got used to in Mirkwood cycle made Kaz just a flat experience.\n\nI'm not saying you shouldn't get it, as you will HAVE to play Darrowdelf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58954-khazad-dum-my-review/?do=findComment&comment=579399","commentId":579399,"userName":"richsabre","timestamp":1326547453,"content":"if im perfectly honest, as long as it was true to the theme of moria and had good artwork, i was going to love it. yes....incase you hadnt noticed i am a sucker for anything tolkien, especially moria....so.....yeah....interesting that you were dissapointed though boored, i got the impression you were really hyped for khazad"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58954-khazad-dum-my-review/?do=findComment&comment=579403","commentId":579403,"userName":"booored","timestamp":1326550195,"content":"I was... checking the fourm like 50 times a a hour... just hanging for it.. I guess that is why I am a bit down now... maybe it isn't that it is bad, but it ws just so hyped. I have strong hopes for the next cycle though, as I said before, once they move form these generic decks I think it will be more interesting."}]}