{"url":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/","title":"Dwarf God, Zigil Miner 5. Two decks that work well for just about any scenario.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579600","commentId":579600,"userName":"Grevane","timestamp":1326602412,"content":"Sick of always playing with Eowyn? Want to play something other than Rohan or Eagles? Think outside the box and don't knock them before you try 'em.\n\nZigil Miner 5.\n\nGloin, Dwalin, Frodo Baggins (25 starting threat)\n\nALLY\n\n3 x Zigil Miner (most important card in the deck. You need this as early as possible. Use card draw from Beravor till you have this card. Only card you need to keep a starting hand. When using his ability chose the number 5 unless you know what is on top)\n\n3 x Gildor Inglorion (second most important card. Get him in play with a miner and you will generate resources in abundance)\n\n3 x Radagast\n\n3 x Gandalf  (if you don't get an early Zigil Miner don't be afraid to use a sneak attack on Gandalf to use his draw 3 card ability. You NEED Zigil Miner)\n\n3 x Landroval\n\n3 x Beorn\n\n3 x Brok Ironfist\n\nEVENT\n\n3 x Stand and Fight (Great way to get Gildor in play)\n\n3 x Darting Gifts (You generate so much resource it is nice to share the wealth)\n\n3 x Dwarven Tomb\n\n3 x Will of the West\n\n3 x Sneak Attack\n\n3 x Grim Resolve\n\n3 x Fortune or Fate\n\n3 x Beorn's Hospitality\n\nATTACHMENT\n\n3 x Unexpected Courage (early game they go on Beravor but try and save one for Dwalin later in the game for multi attacks)\n\n3 x Narvi's Belt (find it usually works best with Gloin. Probably the 3rd most important card.Lets Gloin generate that green or red icon to hard cast fatties)\n\nYou really only ever need 2 Miners out as long as you get Gloin going. Don't forget to shuffel your discard pile back in your deck when it gets too full of 5 drops) Just make sure you get a minor out in the first couple turns (ideal first turn) The Dwarf God deck will help you out quite a bit. Remember to grab monsters and take the damage on Gloin. The other deck should be constantly healing Gloin. If there is undefended damage that would kill Gloin you can always just raise your threat from Frodo instead. In this deck you can even lose Gloin and just play Fortune or Fate to get him back in a bad luck situation.\n\n \n\nDwarf God. (Dain is the dwarf god don't let anyone tell you different)\n\nBeravor, Bifur, Dain Ironfoot (NEVER quest with the dwarf god) (28 Starting Threat)\n\nALLY\n\n3 x Erebor Record Keeper\n\n3 x Miner of the Iron Hills\n\n3 x Erebor Hammersmith\n\n3 x Daughter of the Nimrodel (Keep healing Gloin, hopefully he will throw some resources your way!)\n\nEVENT\n\n3 x Common Cause (Try and save for the end of turn to untap Beravor by tapping Dain and draw more cards)\n\n3 x Durin's Song (Try and save for when you have multiple attacks with Dwalin)\n\n3 x Lore of Imladris (Save for Gloin)\n\nAttachment\n\n3 x Boots from Erebor (First one goes on Gloin)\n\n3 x Song of Kings\n\n3 x Song of Wisdom (it's good to get one on Dain incase he needs A Bruning Brand)\n\n3 x Duenedain Signal (first one goes on Dain or Frodo if he has a Fast Hitch and or Protector of Lorien.)\n\n3 x Fast Hitch (goes on Frodo obviously)\n\n3 x Protector of Lorien (usually put one on Frodo)\n\n3 x A Burning Brand (Nice to have on Dain if he has sentinel)\n\n3 x Celebrian's Stone (I usually put on Gloin but not needed)\n\n3 x Steward of Gondor (Usually end up putting it on Bifur)\n\n3 x Self Preservation (Put on Gloin)\n\nThe idea is to heal Gloin and draw a bunch of cards to dominate with protector of Lorien. I usually play with 3 decks the third being an Eagle Tactic deck with the two red dwarfs and either Legolas or Boromir. When they all work together the Red deck gets fed resources and card draw and just tears stuff apart.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579629","commentId":579629,"userName":"booored","timestamp":1326612559,"content":"are thee meant ot work together? or are they solo decks?\n\nAlso eyowen is bad, do not use her... many better options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579641","commentId":579641,"userName":"DurinIII","timestamp":1326614010,"content":"Hey man, you keep talking about Berevor, but she isn't in your starting heroes.  What's up? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579642","commentId":579642,"userName":"DurinIII","timestamp":1326614101,"content":"Oh never mind.  I think I understand now; this deck is a \"big-ally support deck\" for multi games.  Pretty cool idea, though your right, you really need miners or stewards to make this work well. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579696","commentId":579696,"userName":"Grevane","timestamp":1326625474,"content":"Yes the decks are made to play together. The idea being decks that work together that can compete well in most scenarios. I'm not a fan of making a deck to just beat one specific scenario. You really have to play the Miner 5 deck to get how powerful it is. On paper it is not that impressive and some of the hands you start with will make you think its a joke, until you get that first turn Miner..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579722","commentId":579722,"userName":"booored","timestamp":1326630044,"content":"Yea, I know what you mean. my play group is currently refining a 3 player deck and the individual deck lists look retarded because it is co-op and there is zero reason to have a spell in the deck it is meant for. So a % of spells in 1 deck is supposed to be cast on the other deck. It is basically like building 1 big deck.\n\n \n\nSomeone on the forum said it b4 (his icon is a leadership symbol). Many deck solutions are really luck based, so like if yuo look at Juices scores some are really low, but they might have played teh quest 10 times to get that score and die a bunch. I think the score system shoud lrecord rounds and include that in the score somhow, as consistant well made decks are slower in general, but safer. Witch is important if you are playing a competition. Like a rabbit run set might do return to mirkwood with a great score 1 out of 10 times, but a consistant deck that wins 90% of the time will get a much lower score. I am not saying that risky decks do not have a place, but in comps full losses should be counted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579807","commentId":579807,"userName":"guest455987","timestamp":1326639286,"content":" booored, the updated score system does include rounds; +10 per round. Check the latest FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=579871","commentId":579871,"userName":"booored","timestamp":1326649587,"content":"Grudunza said:\n\n booored, the updated score system does include rounds; +10 per round. Check the latest FAQ.\n\n\n\nI mean rounds as in complete games. So a single game is say the best score out of three games. So you have to build a deck that is consistent, not a super high risk.. great score but 80% loose rate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580475","commentId":580475,"userName":"Zjb12","timestamp":1326750070,"content":" @booored, now I see where u got your idea!  I might have to build these three decks tomorrow.  Seem adaptation required since we only have 2 core sets."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580481","commentId":580481,"userName":"booored","timestamp":1326751372,"content":"As I said in the other [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=602711] thread Ziggy was inspired by Nightmare Cycle. Witch is a deck designed for nightmare mode that pulls your entire deck into your hand. So you have all 50 cards in your hand at one time. You see in nightmare mode you use the same deck, and do not reset it between scenarios. So with teh cycle deck as you had the entire deck in your hand, you started the 2nd quest with that same huge hand, so in fact nightmare mode was easier than playing the quest as a stand alone, once you got past the first quest. The core of that deck was to use will of the west to cycle your discard pile into your deck, before it got larger than your per turn card draw. This way you only needed 1 of every card, and thus could have a deck that was able to deal with anything. Cause once you drew it you can just keep cycling it forever.\n\nThis deck set is simular in some way, I mean anything that uses that miner ability would have similarities. But I didn't like copy this deck list, or even remember this deck when making Ziggy. I was remembering \"Nightmare Cycle\" witch i think Glaurung put it together.\n\nZiggy took all of 5 seconds to make, all I did was add every high cost card and the miner and some card draw... there was no real thought. That is why i posed it here as it was such a sock that the deck was so effective and more importantly really fun to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580484","commentId":580484,"userName":"Zjb12","timestamp":1326752189,"content":" @booored, that's really cool!  Thanks again!  Is there a link to hour nightmare cycle deck?  I'd like to see it too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580485","commentId":580485,"userName":"Zjb12","timestamp":1326752230,"content":" Hour should be your."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580555","commentId":580555,"userName":"p_toler","timestamp":1326773045,"content":"booored said:\n\nAs I said in the other [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=602711] thread Ziggy was inspired by Nightmare Cycle. Witch is a deck designed for nightmare mode that pulls your entire deck into your hand. So you have all 50 cards in your hand at one time. You see in nightmare mode you use the same deck, and do not reset it between scenarios. So with teh cycle deck as you had the entire deck in your hand, you started the 2nd quest with that same huge hand, so in fact nightmare mode was easier than playing the quest as a stand alone, once you got past the first quest.\n\n\n\nI suppose you mean that the deck was inspired by the old nightmare rules. According to the latest FAQ you shuffle all your hands into your draw deck after each scenario and then draw a new starting hand per the regular setup rules of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580576","commentId":580576,"userName":"TragicTheBlathering","timestamp":1326778483,"content":"Fatty said:\n\n \n\nI suppose you mean that the deck was inspired by the old nightmare rules.\n\n\n\nexactly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580578","commentId":580578,"userName":"booored","timestamp":1326778579,"content":"Yea the deck \"Nightmare Cycle\" no longer exists. Though the \"draw\" deck still dose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580939","commentId":580939,"userName":"Grevane","timestamp":1326824752,"content":"booored said:\n\nThis deck set is simular in some way, I mean anything that uses that miner ability would have similarities. But I didn't like copy this deck list, or even remember this deck when making Ziggy. I was remembering \"Nightmare Cycle\" witch i think Glaurung put it together.\n\nZiggy took all of 5 seconds to make, all I did was add every high cost card and the miner and some card draw... there was no real thought. That is why i posed it here as it was such a sock that the deck was so effective and more importantly really fun to play.\n\n\n\n... so you see my deck list on the 15th, then make your version of it the next day because you realize it is very fun to play... then say you didn't remember my deck... and post a link to your topic...  as well as turn my topic into off topic scoring system/ nightmare cycle crap. Helpful. Thank you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580955","commentId":580955,"userName":"booored","timestamp":1326826760,"content":"Grevane said:\n\n \n\nbooored said:\n\n \n\nThis deck set is simular in some way, I mean anything that uses that miner ability would have similarities. But I didn't like copy this deck list, or even remember this deck when making Ziggy. I was remembering \"Nightmare Cycle\" witch i think Glaurung put it together.\n\nZiggy took all of 5 seconds to make, all I did was add every high cost card and the miner and some card draw... there was no real thought. That is why i posed it here as it was such a sock that the deck was so effective and more importantly really fun to play.\n\n \n\n \n\n... so you see my deck list on the 15th, then make your version of it the next day because you realize it is very fun to play... then say you didn't remember my deck... and post a link to your topic...  as well as turn my topic into off topic scoring system/ nightmare cycle crap. Helpful. Thank you.\n\n \n\n \n\n \n\nrofl, did I hurt your feelings mate cause I didn't remember you?That is sooo cute!\n\nWith major card like this ziggy guy there are going to be similar decks. It is like saying a deck that centers around steward of gondor is similar to another. I mean it don't take a genius to go.. this guy gets money form high cost cards in your deck.. hey lets put high cost cards in there.. and I would bet that almost everyone that got the game made a deck with that scrying elf.. I mean Ziggy has been spoiled for a long time and there are posts on cardboardoftherings from the DAY of the spoiler way back last year, with people talking about ways to exploit this idea and those two cards. I think darklighter even posted a ziggy type deck on the day kaz came out. I think you should be less concerned about your pathetic need for self validation and more interested in the fact that you shared a cool duel deck with the community. Witch is all that I did. Also that I have been running my deck in my co-op team from the 8th... well b4 you posted.\n\nDon't take it as a insult that I wasn't thinking of you when I made my deck and thinking of a different deck.. or do.. dosn't matter to me.. either way you should grow up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=580966","commentId":580966,"userName":"Grevane","timestamp":1326828984,"content":"That's sweet but I'm more annoyed that the topic was shat on as a whole. Not one post was relevant  and you just posted a link to your thread and talked about nothing. I would rather see advice on how to improve the decks themselves or see other takes on it, answer questions about my choices of cards... you know post that are actually about the topic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=583347","commentId":583347,"userName":"SiCK_Boy","timestamp":1327266404,"content":"Not trying to take sides here, and hopefuly, the thread may continue on topic (that is, discussing the power of Zigili Miner instead of arguing over who invented it).\n\nI tried similar decks after seeing a few posts speaking of the power of the Miner. I didn't believe it would be that strong, but it sure is. Here are the two decks used (made from 3 Core + all expansions):\n\nDeck # 1 - Miner Support\n\nHero (3)\nDain Ironfoot (RtM) x1\nEleanor (Core) x1\nEowyn (Core) x1\n\n\nAlly (15)\nGandalf (Core) x3\nGildor Inglorion (THoEM) x3\nLandroval (AJtR) x3\nRadagast (AJtR) x3\nZigil Miner (KD) x3\n\n\nAttachment (2)\nNarvi's Belt (KD) x2\n\n\nEvent (33)\nA Test of Will (Core) x3\nBeorn's Hospitality (Core) x3\nDwarven Tomb (Core) x3\nFortune or Fate (Core) x3\nGrim Resolve (Core) x3\nParting Gifts (AJtR) x3\nSneak Attack (Core) x3\nStand and Fight (Core) x3\nThe Galadhrim's Greeting (Core) x3\nWe Do Not Sleep (TDM) x3\nWill of the West (Core) x3\n\n\nDeck # 2 - Unique Lore\n\nHero (3)\nBeravor (Core) x1\nBifur (KD) x1\nBilbo Baggins (THFG) x1\n\n\nAlly (25)\nBeorn (Core) x1\nBrok Ironfist (Core) x1\nErebor Hammersmith (Core) x3\nErebor Record Keeper (KD) x2\nFaramir (Core) x1\nGandalf (Core) x3\nGleowine (Core) x1\nHaldir of Lorien (AJtR) x1\nHenamarth Riversong (Core) x1\nLongbeard Map-Maker (CatC) x3\nMiner of the Iron Hills (Core) x3\nNorthern Tracker (Core) x3\nRivendell Minstrel (THFG) x2\n\n\nAttachment (17)\nA Burning Brand (CatC) x2\nFast Hitch (TDM) x3\nForest Snare (Core) x2\nProtector of Lorien (Core) x2\nSelf Preservation (Core) x2\nSong of Kings (THFG) x1\nSong of Travel (THoEM) x1\nSteward of Gondor (Core) x1\nUnexpected Courage (Core) x3\n\n\nEvent (8)\nGandalf's Search (Core) x2\nLore of Imladris (Core) x2\nRumour from the Earth (RtM) x1\nSneak Attack (Core) x3\n\nThese two lists are not even optimal, but I just took them through every scenario (including The Massing at Osgiliath) for easy wins. I suffered one loss against Flight from Moria where I had no Miner after going through 25 cards from the support deck. I took a chance on the quest where you must look at the top of the encounter deck and you lose if you find treacheries. I knew the first card was a treachery (having looked with Rumour from the Earth), but I had enough cards and questing power to overcome the quest with Protector of Lorien if it worked for the second player.\n\nThe only other game I had trouble with was Osgiliath, again because I had a hard time getting that first miner. Once I did, I was bringing back dead heroes galore and there wasn't much challenge (although I ended with 48 and 45 threat, respectively).\n\nThe Miner Support needs a mulligan if you don't have a Miner. Once you do, you just abuse it for 5 and you end up playing all your cards. That deck is the \"draw\" target as long as it doesn't have all 3 A Test of Will in hands. Only after do you let the Lore deck draw. Once in a while, you setup a massive resource transfer to the Lore deck from Dain via Parting Gifts. The Narvi's Belt always goes on Dain, allowing him to play the Lore cards (once in a while, a Beorn's Hospitality is welcome). Stand and Fight is used to play the Beorn from the Lore deck (only card that deck can't play by himself) and any other ally that dies. Don't forget that you can't use it on Radagast or Gandalf (see FAQ). Make sure you always keep a Will of the West so you never end up with an empty deck.\n\nI wouldn't change anything in the build. Once more 5 cost cards are released, it should be reevaluated which ones are kept. We Never Sleep is never cast; if a more useful card was available, it'd be better. I wouldn't replace any of the support cards by additional 5 cost except if they were playable cards in their own right (like a new Istari). Otherwise, the percentage of 5 costs is enough to guarantee more than 50 % success with Miners (and you can help this with Gildor).\n\nThe second deck includes all Unique cards in 1 of, plus a solid Lore basis. Having played it for a while, I'd remove the 2 Gandalf's Search, since I never cast it once. Either a 3rd A Burning Brand or Self Preservation, or maybe a ranged ally, or maybe even the 3rd Minstrell plus Song of Battle would be options. The 3rd Erebor Records Keeper would also be nice. The main objective with this deck is to get Fast Hitch and A Burning Brand on Bilbo and use him as a main blocker. Self Preservation should go to the hero needing it at the time. If they're all full, go for Dain. Unexpected Courage always goes on Beravor. You take mulligans if your hand includes off-color cards without access to the right song (either directly or via Minstrel). After that, you play allies and create an army. Don't forget the other Lore heroes can activate Bifur's ability (he always gets the Songs and Steward of Gondor), if required. Bifur is almost always questing with Eowyn initialy.\n\nThe question I have after this is: what were they thinking when they made that miner? To me, it totally screws the game, especially for 2 players. I'll probably try a 3 players setup with the above 2 decks and an additional one (not sure yet, either a spirit-based one with lots of Rohan, or a Tactics Eagles theme), but I expect similar results...\n\nAnyone else thinks they made a mistake with that dwarf?\n\nI read somewhere it was a \"joke\" deck, but it isn't. Try it, you'll see. Being able to play Forture or Fate repeateadly changes the whole dynamic of the game. You don't need to always block, you can easily have 10 or 15 points of resources worth of allies in play on turn 2 (like a Radagast and Gildor along with 2 miners).\n\nDo you see any way the designers can find to \"limit\" the power of the miner? I understand I could just \"not\" play it (note: I find it broken, but still fun for now), but other than that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=583371","commentId":583371,"userName":"booored","timestamp":1327270471,"content":"Looking at your deck lists it seams to me that you are still building decks correctly for multiplayer, as in building them as a single deck. This is a common problem I think with a lot of players. The most common symptom of this is, \"I need a song splash, I'll put a song in my deck\". When in fact it can go in the sister deck. You can see that you are running Galdalf's Search in the Lore deck, when the obvious starget is the Ziggy deck, as that allows you to hit your resource gain well before you draw Gildor. Still I think if you want to push this \"ziggy\" idea you need a much more engine driven setup. Your avrage resource draw after Gildor is on the table is going to be 3, maybe 6 if you have 2 miners out. This is a far cry from the 10-12 resources in other decks posted. Now this deck looks cool, but I think it is using only a fraction of the power of Ziggy. In essence you have just made a \"normal\" deck that has a light resource engine.. and that is fine.. but I think Ziggy can do so much more. It is WAY more powerful than this deck setup is abusing.\n\nAs to you comments on Ziggy's power? Well I totally agree, I have literally never lost a SINGLE game from when Kaz came out playing 2 player.. including massing and escape. As you say fortune fate is like wtf.. who cares about blocking or being careful.. just kill your heroes and bring them back. I also am finding it fun, we have been experimenting with a 2 player set up that only uses 4 heroes, 3 on one team 1 on the other as a prelude to the new \"sneak, or hidden or w/e it is called\" function were you need to be under 20 threat. So ziggy is opening up very very different deck ideas that could never have been possible.. but this isn't power creep.. this is basically removing resources from the game.\n\nThe new cards just keep coming though.. this is the card we are waiting for for the 1 hero Ziggy deck.. (partner running teh Dwarf God)\n\nbofur.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/the-redhorn-gate/bofur.png]\n\nWhat you basically have here is the Prince Questing, and readying, AND +3 will for 1 resource.... wtf... seriously.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=583454","commentId":583454,"userName":"SiCK_Boy","timestamp":1327297394,"content":"booored said:\n\nStill I think if you want to push this \"ziggy\" idea you need a much more engine driven setup. Your avrage resource draw after Gildor is on the table is going to be 3, maybe 6 if you have 2 miners out.\n\n\n\nWhat do you mean by \"more engine driven\" setup? Do you mean the miner deck or the Lore one, which doesn't do much in terms of abusing the resources (to be honest, the Lore deck is mostly there for the heroes; the content itselft could be a similar strong ally base from any sphere if it wasn't for the fact that Beravor and Bilbo are the main draw engine and Bifur is a 3-questing ally).\n\nbooored said:\n\nwe have been experimenting with a 2 player set up that only uses 4 heroes, 3 on one team 1 on the other as a prelude to the new \"sneak, or hidden or w/e it is called\" function were you need to be under 20 threat.\n\n\n\nI think it's called \"Secrecy\". Is it really working well to let go of one or more heroes? The main point of Secrecy is to play cards cheaper, but shouldn't you NOT care about cost with a Zigil deck strategy anyway? And will the reduced hero really improve scores now that # of rounds is the primary driver of it?\n\nI can see it being an interesting intellectual challenge to make decks work with less than 3 heroes, but is it a serious winning strategy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/58984-dwarf-god-zigil-miner-5-two-decks-that-work-well-for-just-about-any-scenario/?do=findComment&comment=583527","commentId":583527,"userName":"booored","timestamp":1327312901,"content":"SiCK_Boy said:\n\nbooored said:\n\n \n\nStill I think if you want to push this \"ziggy\" idea you need a much more engine driven setup. Your avrage resource draw after Gildor is on the table is going to be 3, maybe 6 if you have 2 miners out.\n\n \n\n \n\nWhat do you mean by \"more engine driven\" setup? Do you mean the miner deck or the Lore one, which doesn't do much in terms of abusing the resources (to be honest, the Lore deck is mostly there for the heroes; the content itselft could be a similar strong ally base from any sphere if it wasn't for the fact that Beravor and Bilbo are the main draw engine and Bifur is a 3-questing ally).\n\nI just mean that Ziggy can be abused way more than you are doing in this deck is all.\n\nSiCK_Boy said:\n\nbooored said:\n\n \n\nwe have been experimenting with a 2 player set up that only uses 4 heroes, 3 on one team 1 on the other as a prelude to the new \"sneak, or hidden or w/e it is called\" function were you need to be under 20 threat.\n\n \n\n \n\nI think it's called \"Secrecy\". Is it really working well to let go of one or more heroes? The main point of Secrecy is to play cards cheaper, but shouldn't you NOT care about cost with a Zigil deck strategy anyway? And will the reduced hero really improve scores now that # of rounds is the primary driver of it?\n\nI can see it being an interesting intellectual challenge to make decks work with less than 3 heroes, but is it a serious winning strategy?\n\n\n\nI dunno, it is just fun something to do. I am not sure there is a point to it. I do have a 4 player deck for Massing that uses 9 heroes, 3,3,2,1 and it works really well. Also in a 2+ player game until the cycling starts proper the resources are all on one side. I supose you coudl run a \"lite\" version of ziggy in all decks easy enough. Still I like making \"wired\" decks .. I find it fun. I find that not using all 3 heroes works well, especially in 3+ player games."}]}