{"url":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/","title":"We Need More Player Cards!!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=580479","commentId":580479,"userName":"glasswalkerx","timestamp":1326751173,"content":"First, let me start off by saying that I really enjoy this game, but I have a real issue with the lack of player cards.  I really expected more player cards in the Dum Expansion.  FF is releasing these cards too slow, making deck construction no fun for me or my player group.  I would love to see every other monthly expansion come with mostly player cards with a scenario with only a few cards to support it (using mostly cards from the Dum expansion).  Out of the 5 players in my group, only 3 of us still buy cards.  The other two will still play, but they are ok just using my decks.  Now the third player is debating the same thing.  Part of this decision came from the lack of variety in deck building due to a small card base and the other part was the difficulty in building decks for 4 player games, not knowing who was playing with what heroes.  I realize this is not a problem for everyone, but it is causing us to lose players.  I am hoping StarWars will be different but I am really scared it will have the same issues, so for that game I plan on being one of the players who do not purchase but play with other peoples decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=580526","commentId":580526,"userName":"Glaurung","timestamp":1326767893,"content":"glasswalkerx said:\n\nFirst, let me start off by saying that I really enjoy this game, but I have a real issue with the lack of player cards.  I really expected more player cards in the Dum Expansion.  FF is releasing these cards too slow, making deck construction no fun for me or my player group.  I would love to see every other monthly expansion come with mostly player cards with a scenario with only a few cards to support it (using mostly cards from the Dum expansion).  Out of the 5 players in my group, only 3 of us still buy cards.  The other two will still play, but they are ok just using my decks.  Now the third player is debating the same thing.  Part of this decision came from the lack of variety in deck building due to a small card base and the other part was the difficulty in building decks for 4 player games, not knowing who was playing with what heroes.  I realize this is not a problem for everyone, but it is causing us to lose players.  I am hoping StarWars will be different but I am really scared it will have the same issues, so for that game I plan on being one of the players who do not purchase but play with other peoples decks.\n\n\n\nActually is true. I also try create some community of players and people start to play but then quickly stop cose game is quite limited for now. Not only a players cards , but also not so much quests and diffiucult level of quests is quite low so there is no really point to play with 3 or 4 people cose is too easy and boring.\n\nIn my opinion the game perfect now for SOLO game. If you play 2 players most of the time you win too easy (even Osgiliath). So for last 3-4 months we dont  have a reason to  gather together. Play only osgiliath all the time???? Is boring..... But if you make 2 decks which can win Osgiliath, all other quests is soo easy to win. OK KD change it now. I love it!!! And now we will gather and play again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=580605","commentId":580605,"userName":"richsabre","timestamp":1326785842,"content":"as a solo player i dont see a problem.....yes khazad had way more encounter cards than player, but i think for the amount of new material thats coming out its ok....i mean look at the new keywords. ambush.secrecy.lost. all these are adding new elements to the game, and it takes me till next adventure pack to properly get my head round how best to use them in a deck....but that's me by myself, so i cant speak for a player group etc.\n\nas for the packs themselves well what do we get? about 8 new player cards? ok so not that much, but for me its the quality that matters more than quantity, as i easily get immeresed in the theme and artwork (which people on here are sooooooo tired of hearing from me i know lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]) but i think thats the point....players who come under the pippin or boromir types of players i guess will agree with you, and want more, as for me, im happy with what im getting. i would rather they took their time and made some great cards than release mediocre packs full of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=580701","commentId":580701,"userName":"Shiv@n","timestamp":1326798578,"content":"Well, if you do the maths with an amount of tolerated mistakes :\n\nIn one year, since the original release in april 2011, and assuming we get Dwarrodelf quickly we got :\n- 8 new heroes (against 12 in the core set) + ~2 from Dwarrowdelf.\n- 65x3 new player cards (~14 per sphere + 7 neutral).\n- 10 new scenarios (against 3 in the core set) + ~2.\n\nIf you count it another way : 2 full cycles+1 expansion in a year :\n- 14 heroes\n- ~26x3 player cards in each sphere\n- ~13x3 neutral player cards\n- 15 scenarios\n\nEvery way I look at it, I find it more than honorable...\n\nLike you, I would be tremendously excited if I got a lot more of new player stuff every month, but since it is not a competitive game against other player, I don't find it usefull to build X-treme unbeatable decks and I appreciate that FFG (Edge in my country) try to build some really cool thematic decks more than releasing ultimate weapon to attach to allies or heroes. Then, I can try to build theme decks and beat each one of the existing scenarios with them. This way, I can play it deeper in the story.\n\nFor the most competitive players of yours, I think you start to have some good deckbuilding options now and every month a little more anyway...\n\nJust my opinion..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581010","commentId":581010,"userName":"glasswalkerx","timestamp":1326839417,"content":"My group definitely are not Boromir types.  They just see no need in buying the cards to build their own decks when there is very little in deck variety and really no competition.  Why not just use my cards/decks since i will be building for the group to win.  Had they released more player cards quicker, I think they would have stuck with the game and built their own decks.  If they want a certain deck they can just ask me too build it for them.  I see that as being the weakness of this game, unless u are playing alone u do not need to own the cards just use somebodies deck.  The other thing is, for me they are taking to long to get out theme deck construction.  Sure we can now build a Dwarf deck, but what about the elf fans out there.  How long before we can build a deck, over a year, maybe two.  Hell we still do not have all 9 Walkers!  I already hear several people avoiding the Star Wars game for the same reason."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581155","commentId":581155,"userName":"richsabre","timestamp":1326871252,"content":"firstly i play this because its lord of the rings and lets be honest, this is the best out there for a die hard tolkien fan, not matter where you look, so i wont be one who will jump ship when things are slow, especially not for star wars, but i do actually think in design concept star wars LCG will be ALOT like LOTR, so if those people are not liking this i doubt theyll like that, but back to that point, i hope they dont speed up. if they start rushing through things theyll run out of cards. i mean tolkiens world is vast, but the license only goes so far. if they release all the fellowship, and other main characters in the 1st year, the rest of the releases would probably only interest those with a keen interest in middle earth, and perhaps those who play other games would go elsewhere...i do not think releasing more cards would be good for the game at all. i would just see the game burning itself out in a couple of years.personally i cant wait for character like merry/pippin/ saruman etc, but for now im happy to wait\n\nsaying all that, if you play several other lcgs, ccgs, which i can see you play at least warhammer and game of thrones, and things are too slow for you then perhaps it is better for you to concentrate on another game, i honestly dont see it getting any faster than 60 cards per month"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581328","commentId":581328,"userName":"mekros41","timestamp":1326889798,"content":"Personally I believe their release of the game is very well done.  Granted the amount of player cards are lower than I had expected, however I would much rather have a new scenario with every chapter pack.  The song idea was brilliant direction I didn't think they would open up so early.  The idea of combining spheres through card mechanics (offering a percentage of failure) was bold for the first cycle, instead of working to each spheres strengths.  It really makes me wonder what other mechanic we will get with the next cycle.  The other thing you have to take into account is the game is still balanced!  The designers are tasked with telling a story with each cycle, designing encounter cards strong enough to keep us playing, and just enough player cards that don't allow us to blow through all the scenarios.\n\nYou are starting a game at the first phase, a new style of card game.  Give the designers some credit.  Remember this game is only designed for one to two players.  Enjoy the journey.  I haven't worked my way up to Kaz yet, but can't wait for the challenge.\n\nAnd dude, the only thing I want to do is play with an all Hobbit deck and sneak through encounters.  Guarantee we will see Elves before The Shire.  Maybe even before we see another Hobbit hero.  But I will wait and the long quest to get.  After all, LotR's is all about the journey."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581329","commentId":581329,"userName":"richsabre","timestamp":1326890032,"content":"mekros41 said:\n\nPersonally I believe their release of the game is very well done.  Granted the amount of player cards are lower than I had expected, however I would much rather have a new scenario with every chapter pack.  The song idea was brilliant direction I didn't think they would open up so early.  The idea of combining spheres through card mechanics (offering a percentage of failure) was bold for the first cycle, instead of working to each spheres strengths.  It really makes me wonder what other mechanic we will get with the next cycle.  The other thing you have to take into account is the game is still balanced!  The designers are tasked with telling a story with each cycle, designing encounter cards strong enough to keep us playing, and just enough player cards that don't allow us to blow through all the scenarios.\n\nYou are starting a game at the first phase, a new style of card game.  Give the designers some credit.  Remember this game is only designed for one to two players.  Enjoy the journey.  I haven't worked my way up to Kaz yet, but can't wait for the challenge.\n\nAnd dude, the only thing I want to do is play with an all Hobbit deck and sneak through encounters.  Guarantee we will see Elves before The Shire.  Maybe even before we see another Hobbit hero.  But I will wait and the long quest to get.  After all, LotR's is all about the journey.\n\n\n\ni cannot wait for the shire/old forest/ downs/ the first book of the fellowship of the ring was the best of the entire trilogy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581396","commentId":581396,"userName":"Vyron2","timestamp":1326896150,"content":" personally I like the system and FFG is doing a GREAT JOB on the timetable - \n\n \n\nI mean, I don't know about you guys - but to all people complaining we have too few cards n quests - I've got all the cards and I haven't even played the APs with my group... solo only up to dead marshes! you complaining people have WAY too much time for this game... I can BARELY manage to read all cards and stay up to date with the FAQ etc. the SPEED IS FINE!!! I DO NOT want another MtG or whatever, where 80% of my cards are just useless throwaways, only good for limited. I DO NOT want to spend more money, e.g. 100 $ every 3-4 months for only ONE display and still not have all the cards... \n\n \n\nI WANT to know all the cards and \n\nI WANT to be able to play them all and THEN decide which ones I don't want to use - have you REALLY tried ALL the possible combinations so far? (kudos if you have, but then again - you spend too much time with the game - enjoy it slowly, like a good meal - don't devour it!!!)\n\n \n\nto each his own, but I am totally content... ... ... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581491","commentId":581491,"userName":"DurinIII","timestamp":1326908972,"content":"Here are some of my thoughts:\n\nAs of now I am content with the chapter pack distributions.  It is evident the production team is paying especially close attention to design and overall game flavor...they are exceeding on all accounts there.  I also think (like several of you) that they are purposefully releasing less player cards on purpose to prolong the game for one, and most importantly to focus more on the endless possibilities of creating new locations/quests for players to explore.  overall this seems like a good idea to me, but I have to confess that I don't get as excited about new quest cards as I do over new player cards.  Encounter decks are fixed, whereas player decks can be varied almost infinitely (exaggeration here of course).  So, though I do like the awesome attention paid to new quests and encounter cards, ideally I would like to see either a \"every-other\" type of distribution (like the one mentioned by the poster above) or some type of additional player quest pack that releases once a set cycle giving us x number of new player cards.  Just some ideas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581495","commentId":581495,"userName":"richsabre","timestamp":1326909710,"content":"DurinIII said:\n\nHere are some of my thoughts:\n\nAs of now I am content with the chapter pack distributions.  It is evident the production team is paying especially close attention to design and overall game flavor...they are exceeding on all accounts there.  I also think (like several of you) that they are purposefully releasing less player cards on purpose to prolong the game for one, and most importantly to focus more on the endless possibilities of creating new locations/quests for players to explore.  overall this seems like a good idea to me, but I have to confess that I don't get as excited about new quest cards as I do over new player cards.  Encounter decks are fixed, whereas player decks can be varied almost infinitely (exaggeration here of course).  So, though I do like the awesome attention paid to new quests and encounter cards, ideally I would like to see either a \"every-other\" type of distribution (like the one mentioned by the poster above) or some type of additional player quest pack that releases once a set cycle giving us x number of new player cards.  Just some ideas.\n\n\n\nstrangely i seemed to get most excited about location card....dont know why....maybe i like the beautiful landscapes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581552","commentId":581552,"userName":"divinityofnumber","timestamp":1326919041,"content":" I like that there is not an overabundance of player cards. I think that the more difficult the scenarios, the better. And, it is best to go slow and take time with the player cards so as not to release anything broken or that makes the game too easy. Less player cards now = less errata and annoyance later. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581571","commentId":581571,"userName":"Uthanar","timestamp":1326925459,"content":"My wife and I have also felt that there is not enough cards out there for the players to customize their decks with.  When we heard how few cards would be in Khazad Dum we had a serious talk about not picking up any more of the LotR cards.  One of the reasons to play games like this is the deck construction, I know it is specifically what brings me to games of this kind.  If the KD expansion had a half and half breakdown similar to chapter packs I would have been far happier. \n\nWe will see what the future brings, but I hope that FFG does increase player cards by a bit, give us a set of 3 heroes whenever a hero shows up, and break up the encounter cards in chapter packs into smaller groupings (rather than 30 cards under 1 symbol, smaller groupings). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581578","commentId":581578,"userName":"lkb57","timestamp":1326927502,"content":"richsabre said:\n\nDurinIII said:\n\n \n\nHere are some of my thoughts:\n\nAs of now I am content with the chapter pack distributions.  It is evident the production team is paying especially close attention to design and overall game flavor...they are exceeding on all accounts there.  I also think (like several of you) that they are purposefully releasing less player cards on purpose to prolong the game for one, and most importantly to focus more on the endless possibilities of creating new locations/quests for players to explore.  overall this seems like a good idea to me, but I have to confess that I don't get as excited about new quest cards as I do over new player cards.  Encounter decks are fixed, whereas player decks can be varied almost infinitely (exaggeration here of course).  So, though I do like the awesome attention paid to new quests and encounter cards, ideally I would like to see either a \"every-other\" type of distribution (like the one mentioned by the poster above) or some type of additional player quest pack that releases once a set cycle giving us x number of new player cards.  Just some ideas.\n\n \n\n \n\nstrangely i seemed to get most excited about location card....dont know why....maybe i like the beautiful landscapes\n\n\n\n \n\nI gotta agree . . . I have a ton of fun reading through the locations cards . . . they're kind of the backbone of the story. They show you where you're headed! I think the release rate has been great so far . . . I don't know what the rest of your budgets are, but I'm still saving up for the Hunt for Gollum APs. This game is about story telling, detail and just having a fun time, and so far FFG hasn't disappointed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581672","commentId":581672,"userName":"mkultra","timestamp":1326956419,"content":"Maybe FFG should listen to you guys and release nothing but player cards. That way we can beat the same old quests a thousand times over the next six months. Won't that be exciting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581679","commentId":581679,"userName":"Glaurung","timestamp":1326957626,"content":"I think with players card every thing ok. Much more i worry about encounter cards and quests! First cycle was so bad and boring so i hope second will be much better!!! KD show goood start with cool quests and really hard encounter cards so let hope second cycle will be even better! I hope we will not get in this cycle packs like Hills of E M or Dead marches..........."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581744","commentId":581744,"userName":"richsabre","timestamp":1326968381,"content":"Glaurung said:\n\nI think with players card every thing ok. Much more i worry about encounter cards and quests! First cycle was so bad and boring so i hope second will be much better!!! KD show goood start with cool quests and really hard encounter cards so let hope second cycle will be even better! I hope we will not get in this cycle packs like Hills of E M or Dead marches...........\n\n\n\ni think you better prepare yourself then glaurung.....there will ALWAYS be a place in a thematically rich game such as lord of the rings for quests like dead marshes (emyn i agree was far too linear), whether they are too easy or not....i loved dead marshes....however i think the best for both the bilbo in me and the boromir in you is that we have both thematically rich quests that are CHALLENGING. khazad delivers this which is why we both like it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=581826","commentId":581826,"userName":"Spirit Juggler","timestamp":1326976430,"content":"I think people need to remember that this game is still very new in the scale of things. The player card pool will keep on and on expanding. We have plenty of cards for deck construction now even within single sphere decks. Even more so for mixed sphere. Are you really saying that if each ap had more players cards you'd do more than tweak current decks just a bit anyway?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=583303","commentId":583303,"userName":"glasswalkerx","timestamp":1327257489,"content":"Yes, I can say i would do more then tweak my deck if i had multiple strategies to choose from for different spheres.  To the guy who said to give us what we want, all player cards, you really need to read the post before speaking.  I really think you guys are missing my point.  I hear statements like i am happy with the current amount of cards and that is fine, but were u saying that when we had only packs 1 through 3?  I was just pointing out that I basically lost my play group for this game because of slow card addition and if no other people are having this problem then more power to them.  No, i have not tried every card but this was not about me, I still buy and play (hope to use all the cards someday if i can find people to play with).  I understand the defensive responses from some but I am not attacking the game.  I am just giving info on why my play group has dissolved and giving a suggestion of what i would like to see them do (more player cards).   They should keep making quest, but would any one mind a new quest with fewer cards in the pack, leaving more room for player cards.  Maybe there is no problem here for the majority of the players of this game and if it is not then things will stay the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=583323","commentId":583323,"userName":"richsabre","timestamp":1327260048,"content":"glasswalkerx said:\n\nYes, I can say i would do more then tweak my deck if i had multiple strategies to choose from for different spheres.  To the guy who said to give us what we want, all player cards, you really need to read the post before speaking.  I really think you guys are missing my point.  I hear statements like i am happy with the current amount of cards and that is fine, but were u saying that when we had only packs 1 through 3?  I was just pointing out that I basically lost my play group for this game because of slow card addition and if no other people are having this problem then more power to them.  No, i have not tried every card but this was not about me, I still buy and play (hope to use all the cards someday if i can find people to play with).  I understand the defensive responses from some but I am not attacking the game.  I am just giving info on why my play group has dissolved and giving a suggestion of what i would like to see them do (more player cards).   They should keep making quest, but would any one mind a new quest with fewer cards in the pack, leaving more room for player cards.  Maybe there is no problem here for the majority of the players of this game and if it is not then things will stay the same.\n\n\n\ni see your point, i see why you lost your player group and i think thats a shame, however i can probably say 90% surely that the amount will not change, unless FFG start seeing a big change in player opinion, and looking at the responses of this thread, most players are in disagreement.\n\npersonally even when i only had 1 pack, i was fine with the amount, as i change my decks often and get a huge play time out of each pack, however that is my personal experience, i am not here to force it on anyone else"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=583364","commentId":583364,"userName":"mkultra","timestamp":1327269262,"content":"glasswalkerx said:\n\nTo the guy who said to give us what we want, all player cards, you really need to read the post before speaking.  I really think you guys are missing my point.\n\nIt's not the player cards that will keep this game fun and challenging, it's the quests and encounters. If you can't understand this, then it is you (and your friends) who are missing the point.\n\nI'm sorry your friends don't share the same enthusiasm towards this game that you do. I'd like to see more player cards also, but not at the expense of having fewer new quests. There is only so much room left in an AP when a large portion of it is taken up with encounter cards.\n\nAnd btw, don't ever tell me when I can or can't postgran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=583377","commentId":583377,"userName":"bitva","timestamp":1327273101,"content":"I found the player card count in Khazad-Dum to be disappointingly low, especially when they included the Misty Mountians encounter set that cannot even be used with rest of the expanision or anything previous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=583380","commentId":583380,"userName":"Glaurung","timestamp":1327273701,"content":"mkultra said:\n\nglasswalkerx said:\n\nTo the guy who said to give us what we want, all player cards, you really need to read the post before speaking.  I really think you guys are missing my point.\n\n \n\nIt's not the player cards that will keep this game fun and challenging, it's the quests and encounters. If you can't understand this, then it is you (and your friends) who are missing the point.\n\nI'm sorry your friends don't share the same enthusiasm towards this game that you do. I'd like to see more player cards also, but not at the expense of having fewer new quests. There is only so much room left in an AP when a large portion of it is taken up with encounter cards.\n\nAnd btw, don't ever tell me when I can or can't postgran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif].\n\n\n\nTotally Agree with you. Most important in this game is quests. First cycle was a bit boring. KD is much much better. So let hope second cycle will be more better then KD."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59080-we-need-more-player-cards/?do=findComment&comment=583861","commentId":583861,"userName":"glasswalkerx","timestamp":1327360133,"content":"bitva said:\n\nI found the player card count in Khazad-Dum to be disappointingly low, especially when they included the Misty Mountians encounter set that cannot even be used with rest of the expanision or anything previous.\n\n\n\n \n\nAgree.  BTW, did not tell you when you can or cannot post, all I said was you should read the post before commenting  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]   Also, I see the need for new quests on a regular basis, but why not make a quest with only 10 to 15 new encounter cards.  Maybe use the first cycle of encounter cards combined with these smaller quests.  I for one, really hope we will still get some quests that use the first cycle of encounter cards.  Anyway, I see I am in the minority on this subject (at least with the people on the forums) , so good questing  and enjoy the game people."}]}