{"url":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/","title":"Zjb1248 Hour Weekend Tournament","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582449","commentId":582449,"userName":"Zjb12","timestamp":1327079085,"content":"Hi!  Welcome to this weekend's Zjb12 48 Hour Quest.  This is a restricted quest, meaning that certain cards will not be allowed and the initial hero pool will be limited.\n\n2 Part Quest: Passage Through Mirkwood & Journey Down the Anduin\n\nHero Pool:  Choose 3 from the following:  Bilbo, Thalin, Gimli, Dain Ironfoot, Gloin, Bifur, Dwalin.\n\nOff limit cards:  The following cards are not allowed in this tournament: Galadhrim's Greetings; Protector of Lorien; Forest Snare; Steward of Gondor; Horn of Gondor.  See also, allowed allies.\n\nAllowed Allies:  Only allies with the following character traits are allowed: Dwarf; Beorning; Eagle.  Gandalf is also allowed.\n\nDeck Size: 50 cards, no more, no less.  No changes in your heros or deck are allowed between the two quests since they constitute a complete game.  (Hero and Deck changes are allowed between game attempts.)\n\nPlaying & Scoring the Scenario: \n\nPassage Through Mirkwood:  Play per the normal scenario except for quest card 3.  For quest card 3, all players must use Don't Leave the Path. \n\nAfter defeating this quest, total up your score, including threat, dead heroes; and damage on remaining heroes, per normal rules.  However, since we are playing these 2 quests with a somewhat restricted card pool, rounds points will be 5/ROUND and VICTORY POINTS will count DOUBLE.  Calculate your score for this first quest as a sub-total.\n\nThen reset your threat level to the same level you began the first quest, (even if you have a dead hero(s)) and start Journey Down the Anduin as if starting it as a new game.  HOWEVER, DO NOT REMOVE ANY DAMAGE TOKENS OR PUT BACK INTO PLAY ANY DEAD HEROES.  Damage markers may only be removed through normal healing cards and dead heroes can only be returned to play with FORTUNE OR FATE during the quest in which they were killed.  A hero that dies in the first quest cannot be returned into the second quest. Shuffle your deck back together and go. \n\nAfter completing the second quest, sub-total your points as noted above and then total everything together.\n\nYou can attempt to beat this 2 part quest up to 7 times within the 48 hours, but please, only submit your lowest score.  Each player should only submit their lowest score out of their attempts.  If wish to submit a score from less than 7 attempts, that is fine, but once a score is submitted, that is your one and only score for the tournament.  An attempt is considered an attempt as soon as you draw your initial hand of 6 cards.  You may take 1 mulligan at the beginning of each scenario for your opening hand as per normal rules.  When you post your scores please include: sub-totals for each quest with threat, damage, dead heros, rounds, and victory points, and heros used, as well as final total.  (When including rounds, give the number of rounds as well as the calculated points).\n\nAt the end of the 48 hours I will post the overall results and placings.  Please post your results to this forum topic.  As scores come in I will try to keep a posted scorecard going!\n\nQuestions?  Please ask!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582450","commentId":582450,"userName":"Zjb12","timestamp":1327079619,"content":" P.s. pls list your victory point cards if possible too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582469","commentId":582469,"userName":"p_toler","timestamp":1327082788,"content":" Sounds interesting. Hopefully I will have time to participate in this. I suppose you are allowed to use multiple core sets?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582474","commentId":582474,"userName":"Zjb12","timestamp":1327083470,"content":"Yes, I meant to say that, any other cards from the core set, aps, or khazad expansion area usable.  Multiple core sets allowed as well, standard rules, no more than 3 of any card as normal. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582546","commentId":582546,"userName":"radiskull","timestamp":1327101380,"content":" Did you want us to reset completely between quests?\n\nDiscard allies/attachments? Y/N\n\nDiscard hand, draw back up? Y/N\n\nShuffle discard pile back into deck? Y/N"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582594","commentId":582594,"userName":"radiskull","timestamp":1327117241,"content":" I tried a few attemps at this, and I have to say: your setup is extraordinarily difficult.  Don't get me wrong, I had a fun time trying it, but I was unable to get past the Hill Troll with my 2nd deck.  (My first few attempts with a different deck couldn't even beat Mirkwood.)\n\nI had the most success with Bilbo, Thalin, and Gimli, with a strong Eagles theme.  I ran Radagast for the extra resources, and song of Wisdom for some extra Lore access.  That worked reasonably well (and The Eagles are Coming x3 is just ridiculously good in an Eagle deck, since it itself has the Eagle trait).  With the heroes you allowed, your maximum questing Willpower is 5 without allies, and it's pretty difficult to generate extra resources (without Gloin, anyway).\n\nI'm looking forward to see other people's scores, if they attempt this.  I wasn't able to generate a score, although my best attempt was as follows:\n\nMirkwood:\n\nStarting threat 29.  End threat 39.\n\nDamage: Bilbo 1, Thalin 0, Gimli 0 (I healed him with Self Preservation before finishing)\n\nDead heroes: none. (Yet.)\n\nRounds: 15 x 5 = 75\n\nVP: 5x2 = 10 (Hummerhorns.  Got him with Thalin and a next-round Descendant of Thorondor.)\n\nSubtotal: 105.\n\nAnduin:\n\n3 heroes dead in round 9 (or round 24, depending on how you look at it).  Threat 49.  VP 4 (Hill Troll).\n\nI thought I would threat out, but no - Chieftain Ufthak (undefended) -> Shadow Wolf Rider (undefended) -> Pursued by Shadow + Misty Mountain Goblins (undefended) took out all 3 of my heroes before I could hit 50 threat.\n\nI don't think that counts as a score...but I thought it was an entertaining matchup.  Sadly, I won't be trying again.\n\n \n\nBest of luck to anyone else who gives it a go!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582628","commentId":582628,"userName":"leptokurt","timestamp":1327130429,"content":"@ Radiskull: I think Radagast is not allowed to play - he's no dwarf, he's no eagle and he's no Beorninger.\n\n \n\nI gave the game three tries, using Gimli, Thalin and Glóin. I once made it to stage 2 (Sneak/Gandalf in my starting hand), defeated the troll but lost Glóin and lacked WP to make progress in the quest. No chance at all in the other two games (lost in rounds 1 and 4).\n\n \n\nThere are too many restrictions if you don't own KD. You need Thalin and Gimli to play all the eagles in your deck, so only Bilbo and Glóin are alternatives for the third slot, as Dain's threat level is too high."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582643","commentId":582643,"userName":"leptokurt","timestamp":1327135228,"content":"Tried it four more times, never got near to stage 2B of Mirkwood, as I kept drawing enemies from the encounter deck which forced me to use the dwarves to fight, which is why I couldn't make progress in the adventure, which is why I was doomed pretty early.\n\n \n\nEdit: Zjb, did you try this double scenario yourself? Did you ever succeed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582645","commentId":582645,"userName":"Zjb12","timestamp":1327135502,"content":"radiskull said:\n\n Did you want us to reset completely between quests?\n\nDiscard allies/attachments? Y/N\n\nDiscard hand, draw back up? Y/N\n\nShuffle discard pile back into deck? Y/N\n\n\n\nYes, yes, yes, & yes!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582647","commentId":582647,"userName":"Zjb12","timestamp":1327136106,"content":" @radiskull----great attempt!  Leptokurt is right, radaghast would have been off limits, though i did consider allowing him.\n\n@leptokurt----sounds like some good games as well!  No, I was going to play it today.  I knew it would make it much harder, but I wanted to try it.  I think it is probably possible, but might take me some time working out the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582712","commentId":582712,"userName":"Zjb12","timestamp":1327144304,"content":" Wow!  Just got slaughtered in my first attempt, didn't even make it to 2b in the first quest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582729","commentId":582729,"userName":"radiskull","timestamp":1327147270,"content":" Crap, you're right about Radagast.  He's just such an obvious inclusion in an Eagle deck.  It was his help that got be through Mirkwood, so please disregard my above score.  I'd be curious if anyone succeeds here.  (I believe it's possible.  But I don't think it's likely.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582739","commentId":582739,"userName":"Zjb12","timestamp":1327149759,"content":" @radiskull--no problem!  My second attempt was a blood bath too!  I will have to change plans and try something else!  I think it's possible too, but I didn't realize how hard the limitations make it.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582758","commentId":582758,"userName":"leptokurt","timestamp":1327152468,"content":"radiskull said:\n\n Crap, you're right about Radagast.  He's just such an obvious inclusion in an Eagle deck.  It was his help that got be through Mirkwood, so please disregard my above score.  I'd be curious if anyone succeeds here.  (I believe it's possible.  But I don't think it's likely.)\n\n\n\nI came through with Gimli heavily damaged (4 HP). I played Gandalf with Sneak attack first round and killed the Forest Spider. His 4 WP were also helpful to get through stage 1B. I got King Spider in turn 1 which dealt 4 HP to Gimli (shadow effect = East Bight Patrol) and I used Gimli to kill the spider immediatly. Had \"Caught in a Web\" (played on Thalin) and \"Pursued by Shadows\" as my next encounters. I think it took 6 turns to complete thecomplete scenario. Then I got butchered at the Anduin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582767","commentId":582767,"userName":"Bonus Card","timestamp":1327153258,"content":"Can you have cards in your deck that give specialized traits/races? Like a card that gives the Rohan trait/\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582774","commentId":582774,"userName":"leptokurt","timestamp":1327153874,"content":"Bonus Card said:\n\nCan you have cards in your deck that give specialized traits/races? Like a card that gives the Rohan trait/\n\n \n\n\n\n \n\nI think so. Sure, you can make Gimli a Rohan horse rider so you could use Rohan specific events and attachments on him. The real question is, if it is worth it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582784","commentId":582784,"userName":"cordeirooo","timestamp":1327155125,"content":"I thought I was going well until Anduin's second stage. partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]\n\n \n\nSeriously, I was a walk in the park for all those enemies throwing rocks at my 'boat'; way too high threat to overcome with my guys questing. \n\nI (rage)quit when I revealed the East Bight (sp?) and right after that 5Threat Location.\n\n \n\nMaybe someone with the KD set can overcome this challenge. I never built a dwarf-themed deck because I do not own KD, but others can try it out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582788","commentId":582788,"userName":"leptokurt","timestamp":1327156046,"content":"Perhaps one should try Gimli/Dain/Glóin. With that you have 6 WP from the start. The main problem is that you have to face the troll in round 1 when you start JdtA. However, Dain is able to block the first attack and Feint could block a second one, if neccessary."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582791","commentId":582791,"userName":"muemakan","timestamp":1327156773,"content":" Hmmmmm, took me 10 rounds to compelte \"Passage\" and as I read all this I fear I will be butchered on the river......"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582792","commentId":582792,"userName":"Zjb12","timestamp":1327156804,"content":"Bonus Card said:\n\nCan you have cards in your deck that give specialized traits/races? Like a card that gives the Rohan trait/\n\n \n\n\n\nSure!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582794","commentId":582794,"userName":"SiCK_Boy","timestamp":1327157149,"content":"I tried using Dain Ironfoot, Gloin and Thalin as my heroes.\n\nThis gave me a strating threat of 29, leaving me at least a full turn before engaging the Troll, while Thalin would be able to prevent the Crows from surging. And I had 5 points of questing willpower from my heroes while retaining Dain to block.\n\nThe deck included mostly dwarves (Longbeard Orc Slayer, Veteran Axehand, Veteran of Nadurion) with a few eagles (Vassal of the Winglord, Eagles of the Misty Mountains). I splashed Lore (via Nandurion Belt) for Self Preservation. Attachments included Dwarrowdelf Axe, Blade of Gondolin and Citadel Plate.\n\nI went easily enough through Passage through Mirkwood, ending with only 1 wound each on Gloin and Thalin (scored around 70).\n\nAnd I thought I had a perfect start for Journey along the Anduin, with my starting hand including Gandalf, Sneak Attack and Ever Vigilant. Sadly, although I managed to kill the first troll without too much problem, I soon found myself jammed by Chieftan Ufthak in the staging area where he was joined by the second troll and two goblin snipers during stage 2 of the quest (I managed to get rid of the Snipers with Longbeard Orc Slayer played twice via Born Aloft). I ended up busting the 50 threat limit cap when I revealed both Necromancer's Pass while there was already a Gladden Fields in staging.\n\nI never got more than 7 or 8 point of questing Willpower during that whole game. The lack of card drawing was a major issue since I ended up with many unused resources on my heroes. I guess a well-timed Grim Resolve or Ever Onward could have given me the needed break, but all in all, the building restrictions makes this tournament way too hard and luck-dependant, I think.\n\nI'll see if I feel like giving it another try. I'd probably go with Dain again, but matching him with Bilbo (or Bifur, not sure) and Dwalin and try to get Zigil Miners active. Having Lore would give access to better dwarves allies (Erebor Hammersmith, Erebor Record Keeper, Longbeard Map-Maker, Miners of the Iron Hills) while Spirit could offer some protection in the form of A Test of Will and Hasty Stroke."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582814","commentId":582814,"userName":"Zjb12","timestamp":1327161476,"content":" Attempt number 3 was the furthest I have gotten---Dain, dwalin, and bifur made it as far as 3b on the first one, but just when I thought I would be able to take ungodly ants spawn out over a couple of rounds with my Heros and dwarf allies, bunch more enemies started dropping down like spiders---which mostly, they were...Dead again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582829","commentId":582829,"userName":"Zjb12","timestamp":1327163824,"content":" Attempt number 4: 1/2 way through---1st half score: 110; 13 rds (65); threat 38; 7 damage.  Going to need some healing ASAP of I'm dead against that hill troll!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582836","commentId":582836,"userName":"Zjb12","timestamp":1327164541,"content":" Lasted three rounds in the second half and then was dead.  Too many enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582838","commentId":582838,"userName":"leptokurt","timestamp":1327165036,"content":"Zjb12 said:\n\n Lasted three rounds in the second half and then was dead.  Too many enemies.\n\n\n\n \n\nBut you killed the troll? Because that's the only important thing here, because right that troll would have stolen The Ring from Frodo had he survived.\n\n \n\n \n\n \n\n \n\n \n\n \n\nI already mentioned that I killed the troll, right? lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582844","commentId":582844,"userName":"Zjb12","timestamp":1327166136,"content":" No, damaged, but not dead.  Attempt five just failed too.  1 damage away from killing ungodly ants spawn.  Too many spiders!!!  Left one attack undefended that killed bifur and then it went downhill from there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582845","commentId":582845,"userName":"Zjb12","timestamp":1327166248,"content":" LOL!  Just laughed at my own post---dumb iPad spell correct!!!  partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582886","commentId":582886,"userName":"Zjb12","timestamp":1327173187,"content":" And I am 0-7.  Attempts 6 & 7 didn't even make it past the first scenario.  So the best I did was make it 1 time into the second quest and survive about 3 rounds.  One of my hobbits, he has his own core set, is trying it too---finding it a little tough----he says I made it too hard!  ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582887","commentId":582887,"userName":"Zjb12","timestamp":1327173306,"content":"muemakan said:\n\n Hmmmmm, took me 10 rounds to compelte \"Passage\" and as I read all this I fear I will be butchered on the river......\n\n\n\nSo, how'd the second half go?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582888","commentId":582888,"userName":"Zjb12","timestamp":1327173387,"content":"SiCK_Boy said:\n\nI tried using Dain Ironfoot, Gloin and Thalin as my heroes.\n\nThis gave me a strating threat of 29, leaving me at least a full turn before engaging the Troll, while Thalin would be able to prevent the Crows from surging. And I had 5 points of questing willpower from my heroes while retaining Dain to block.\n\nThe deck included mostly dwarves (Longbeard Orc Slayer, Veteran Axehand, Veteran of Nadurion) with a few eagles (Vassal of the Winglord, Eagles of the Misty Mountains). I splashed Lore (via Nandurion Belt) for Self Preservation. Attachments included Dwarrowdelf Axe, Blade of Gondolin and Citadel Plate.\n\nI went easily enough through Passage through Mirkwood, ending with only 1 wound each on Gloin and Thalin (scored around 70).\n\nAnd I thought I had a perfect start for Journey along the Anduin, with my starting hand including Gandalf, Sneak Attack and Ever Vigilant. Sadly, although I managed to kill the first troll without too much problem, I soon found myself jammed by Chieftan Ufthak in the staging area where he was joined by the second troll and two goblin snipers during stage 2 of the quest (I managed to get rid of the Snipers with Longbeard Orc Slayer played twice via Born Aloft). I ended up busting the 50 threat limit cap when I revealed both Necromancer's Pass while there was already a Gladden Fields in staging.\n\nI never got more than 7 or 8 point of questing Willpower during that whole game. The lack of card drawing was a major issue since I ended up with many unused resources on my heroes. I guess a well-timed Grim Resolve or Ever Onward could have given me the needed break, but all in all, the building restrictions makes this tournament way too hard and luck-dependant, I think.\n\nI'll see if I feel like giving it another try. I'd probably go with Dain again, but matching him with Bilbo (or Bifur, not sure) and Dwalin and try to get Zigil Miners active. Having Lore would give access to better dwarves allies (Erebor Hammersmith, Erebor Record Keeper, Longbeard Map-Maker, Miners of the Iron Hills) while Spirit could offer some protection in the form of A Test of Will and Hasty Stroke.\n\n\n\nSounds like a pretty good account of yourself considering how we are all doing in this bloodbath I have created!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=582928","commentId":582928,"userName":"SiCK_Boy","timestamp":1327183917,"content":"Tried it twice more with Dain, Dwalin and Bifur. The deck was based mostly on dwarven allies, but as usual, the only true saving grace the format offers is Sneak Attack + Gandalf. At least I had some healing (2 x Self Preservation, 1 x Lore of Imladris) and acceleration in the form of Zigil Miners (although I was always calling 1 since my cost distribution was 2-24-15-5-1-3, going from 0 to 5 cost).\n\nThe first game was going okay until I reached the point where I engaged Ungoliant's Spawn. I was about to destroy it with an army of Miners, but a shadowy Hummerhorn put a stop to my dreams of conquest...\n\nSecond game went better. By the time I was about to win, I didn't have any injury and Bifur was Self-Preserved. But two shadow effects in a row, including again the Hummerhorn, had me win the Passage through Mirkwood with a score of 96 and 1 injury on each of Dwalin and Bifur.\n\nSecond quest was much harder. I had an interesting choice when I reached 30 points of threat since I had Gandalf in hand at that point. I decided to stall and played him for threat reduction. I was hoping those 5 turns would allow me to further build my base, possibly hit an Ancient Mathom or something. But I kept getting enemy after enemy in the staging area, including 2 Eastern Crows, Wolf Rider (first got him as a shadow card) and Wargs. I barely managed to contain them all, although I had both Self Preservation out by then. Once the Troll joined the fray, it was game over...\n\nMaybe getting a few more locations instead of so many enemies, or getting some orc enemies (Dol Guldur or Misty Mountain variety) would have given me a chance.\n\nI'm giving up. There's a reason why all those cards (The Galadhrim's Greetings, Steward of Gondor, Forest Snare, Protector of Lorien) are staples of deckbuilding. There's really no alternative to their effects. Added to this the hero and allies restriction, and it becomes an almost impossible challenge. Even card drawing is severely limited, with our only options becoming Bilbo Baggins, Ancient Mathom and Valiant Sacrifice.\n\nI'd be curious to see it played 2 players, however. I think the odds would become slightly better, probably running a deck similar to what I had on my second try combined with an Eagles deck splashing Lore for Bilbo (Gimli, Thalin, Bilbo).\n\nAt least, it gave me a chance to play with some rarely used cards like Dunedain Quest (anything to get the questing power up!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583020","commentId":583020,"userName":"Zjb12","timestamp":1327217065,"content":"@Sickboy:  Thanks for the account!  Your point about those cards being staples is well put.  That's part of the reason why I removed them, to see how we would do without these cards.  Th other part was a desire to make these two quests a little harder since they are really the opening quests of the whole game, and for many people now, very easy.  But wow, I never imagined this little tweaking of mine would make it sooooooo difficult!  Ouch!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583033","commentId":583033,"userName":"muemakan","timestamp":1327221428,"content":"Played the first half yesterday and the second half after my girlfriend left for work after lunch.\n\nDid win on my first try but man was that hard. First quest was fairly easy......but I had to fight 2 Hill Trolls and one Chieftain Ufthak in quest number 2.\n\nThe harder part was those f**** treacheries that deal damage. Bilbo was slain.\n\nLet´s see if I can sneak in another go this evening. \n\n \n\nEDIT: nooooooooooooooooo, I forget to get rid of my Snowbourn Scouts..............all for nothing.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583073","commentId":583073,"userName":"muemakan","timestamp":1327230442,"content":"Man that´s too hard. I think to limit all key elements  ( draw management, resource management and threat management ) and in addition limit allies to only two traits is way too hard.\n\nSo far I played 5 games and lost every game but the first. ( in which sadly I used Snowbourn Scout )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583156","commentId":583156,"userName":"muemakan","timestamp":1327241367,"content":"Dam you forum software!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583159","commentId":583159,"userName":"muemakan","timestamp":1327241695,"content":"  Wow, that was kinda epic.\n\nDid play 7 games and won......tatatatata: the last one. Hard as hell. This is my lowest and only score. \n\nMy deck had nearly every dwarf in it that we have so far. I think the key was Bilbo and the 2 cards per turn he provided.\n\n \n\nHeroes were Gloin, Dain and Bilbo\n\nQuest 1:\n\nRounds: 13\n\nWounds: 0\n\nThreat: 39\n\nVictory points: 0\n\nScore: 104\n\n \n\n \n\nQuest 2:\n\nRounds: 9\n\nWounds: 6\n\nThreat: 39\n\nVictory points: 7\n\nScore: 76\n\n \n\nTOTAL SCORE: 180 ..........if I am not mistaken\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583164","commentId":583164,"userName":"Zjb12","timestamp":1327242209,"content":" Meumaken, so what was the key strategy do you think?  You're the only to post a score, the rest of died horrid, brutal deaths either in the woods, or by or on the river!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583167","commentId":583167,"userName":"leptokurt","timestamp":1327242720,"content":"Zjb12 said:\n\n Meumaken, so what was the key strategy do you think?  You're the only to post a score, the rest of died horrid, brutal deaths either in the woods, or by or on the river!\n\n\n\n \n\nKey strategy: Not to draw too many enemies or locations in a row?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583233","commentId":583233,"userName":"cordeirooo","timestamp":1327252282,"content":"leptokurt said:\n\nZjb12 said:\n\n \n\n Meumaken, so what was the key strategy do you think?  You're the only to post a score, the rest of died horrid, brutal deaths either in the woods, or by or on the river!\n\n \n\n \n\n \n\nKey strategy: Not to draw too many enemies or locations in a row?\n\n\n\n \n\nThat's a very good strategy, actually. hahahah\n\nI might try it sometime."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583240","commentId":583240,"userName":"muemakan","timestamp":1327253117,"content":"Zjb12 said:\n\n Meumaken, so what was the key strategy do you think?  You're the only to post a score, the rest of died horrid, brutal deaths either in the woods, or by or on the river!\n\n\n\n \n\nWith Dain ready, questing wasn´t that hard for me. To kill the huge amount of enemies the deck throws at you was the hardest point. \n\nWoods were fairly easy. Never really had a problem there. But the setup-troll was brutal.\n\n \n\nTo get Gloin with Self Preservation into play was key. Apart from that it was mostly luck. As I stated bevor: It was way too hard. There were far too many limitations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59291-zjb1248-hour-weekend-tournament/?do=findComment&comment=583246","commentId":583246,"userName":"Zjb12","timestamp":1327253649,"content":" And the winner and only finisher is muemakan!!!  \n\nHey, thanks everyone for trying this bloodbath!  Sorry it was so hard, as I mentioned earlier, I meant to make it harder, but I didn't mean to make it impossible!  Kudos to everyone who gave it a go!  \n\nI will try to make next weekends not quite so hard.\n\nGive me some ideas though!  I'll post an idea link and let me know they types of interesting ways we might twist some of the scenarios to do them a little differently!  Plus, I will try the next one out beforehand to make sure it's winnable, though I am certainly not the best player in the world!  You guys have actually taught me a lot, so I hope that these tournaments along with Juicebox's are a good way to give back to the community and a lot of fun!\n\nThanks again and kudos muemakan!"}]}