{"url":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/","title":"Beating Into The Pit Solo with a Dwarf Themed Deck?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=582820","commentId":582820,"userName":"RGun","timestamp":1327162339,"content":"Has anyone been able to consistently beat Into The Pit Solo with a Dwarf Themed Deck?  I just picked up Khazad-dum and am getting crushed by the first scenario - after 4 tries have yet to get past 1B of the quest deck.  I was feeling pretty confident with my solo play after recently beating Return to Mirkwood, so have not been used to getting hammered this bad in awhile.  I am wondering if I have gotten sucked into using a heavy Dwarf deck by the Khazad-dum theme, when that isn't actually a winning deck build for solo play on this scenario?\n\nI have been using Dain, Dwalin and Gimli and I am now going to try a strategy loading my deck with almost all ally cards - using every single dwarf ally available, as well as Faromir.  This won't leave me much in the way of attachments or events, but will really capitalize on Dain's abilities.  Has anyone tried building this type of deck and had any success?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=582843","commentId":582843,"userName":"richsabre","timestamp":1327165739,"content":"RGun said:\n\nHas anyone been able to consistently beat Into The Pit Solo with a Dwarf Themed Deck?  I just picked up Khazad-dum and am getting crushed by the first scenario - after 4 tries have yet to get past 1B of the quest deck.  I was feeling pretty confident with my solo play after recently beating Return to Mirkwood, so have not been used to getting hammered this bad in awhile.  I am wondering if I have gotten sucked into using a heavy Dwarf deck by the Khazad-dum theme, when that isn't actually a winning deck build for solo play on this scenario?\n\nI have been using Dain, Dwalin and Gimli and I am now going to try a strategy loading my deck with almost all ally cards - using every single dwarf ally available, as well as Faromir.  This won't leave me much in the way of attachments or events, but will really capitalize on Dain's abilities.  Has anyone tried building this type of deck and had any success?\n\n \n\n\n\ni first tried a dwarf deck and got killed ALOT\n\nim using a lore/spirit deck based around card draw and ive beaten 7th level and gotten to close to into the pit\n\ni really think the whole way you approach khazad quests is entirely diffreent from mirkwood quests, if you go at it the same way you get overran quickly"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=582889","commentId":582889,"userName":"Zjb12","timestamp":1327173654,"content":" I have beaten all three, but the first several games against the first two scenarios were pretty bad bloodbaths!  Booored and a few others posted some decks centering around zigil miner and the ability to generate handfuls of resources and end up putting lots of expensive allies in.  Richsabre might have a link to those."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=582894","commentId":582894,"userName":"richsabre","timestamp":1327176680,"content":"just google fantasy flight ziggy, or look a couple of pages back happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=582918","commentId":582918,"userName":"RGun","timestamp":1327181696,"content":"I wonder if the 3 khazad-dum quests are a little harder right now because since the intent is that the encounter cards included will be used to fill the encounter deck for the next cycle of 6 APs there are some key player cards coming that we don't have yet which make defending against them a little easier.  I recall reading that they test an entire cycle at the same time so it seems to make sense dealing with the initial \"base\" encounter cards for the cycle when you are missing many of the player cards that are part of the cycle would be trickier.\n\nDoes anyone know how they assign a quest difficulty rating - is it based using only the player cards available at the time the quest is released or is it based on how that quest compares against the rest of the quests in the cycle assuming all of the player cards included in the cycle are available for each quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=582989","commentId":582989,"userName":"sonicu","timestamp":1327204664,"content":"Good question I wonder the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583186","commentId":583186,"userName":"RGun","timestamp":1327245626,"content":"Several more attempts into the late hours last night and I finally managed to beat this one - barely (finished with 47 threat, only 1 ally left, and Dain hanging on by a thread with 1 HP remaining).  Stuck to my dwarf heavy ally deck, but what seemed to make the difference was when I replaced Gimli with Dunhere and was able to pick off the orcs accumulating in the staging area during phase 1B - I took my time completing this phase so I had an opportunity to play my allies and some key attachments.  Still don't think I have a deck to beat this one consistently - got some key lucky card draws where I was holding my breath hoping there wouldn't be a nasty shadow effect that would have done in one Dain.\n\nNow, onto The 7th Level this evening!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583218","commentId":583218,"userName":"richsabre","timestamp":1327250391,"content":"RGun said:\n\nSeveral more attempts into the late hours last night and I finally managed to beat this one - barely (finished with 47 threat, only 1 ally left, and Dain hanging on by a thread with 1 HP remaining).  Stuck to my dwarf heavy ally deck, but what seemed to make the difference was when I replaced Gimli with Dunhere and was able to pick off the orcs accumulating in the staging area during phase 1B - I took my time completing this phase so I had an opportunity to play my allies and some key attachments.  Still don't think I have a deck to beat this one consistently - got some key lucky card draws where I was holding my breath hoping there wouldn't be a nasty shadow effect that would have done in one Dain.\n\nNow, onto The 7th Level this evening!\n\n\n\n7th level should be much easier for you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583226","commentId":583226,"userName":"ClydeCloggie","timestamp":1327251492,"content":" Zigil Mineshaft has been my downfall so far, although I've only played Into the Pit three times with a Gimli/Dain/Dwalin deck.\n\nThe deck doesn't quest fast enough to get through the East-gate quickly. In all three games, I had to deal with two Zigil Mineshafts during the East-gate stage, which I had to take out by raising my threat to avoid getting stuck completely. I couldn't get threat down again in time and that meant a loss each time. \n\nFrom these early games, I think Gimli and Dwalin don't work too well together, since both want to be the attacker among the heroes and it's hard to build up both of them in time for the post-East-gate battle and then keep them ready until the attack step.\n\nAlso, Dwarves are spread over all four spheres which makes it hard to build a cohesive deck with those cards. Despite Dwalin, Spirit seems to be the least Dwarfish sphere, but then it has the excellent Zigil Miner. Choices will have to be made to make a really strong Dwarven deck at this point. I feel.\n\nI did try out the potential killer combo of Zigil Miner and Keen-eyed Took, with an interesting result. Brought the Took into play and revealed Gandalf as the top card from my deck. Since I had two Longbeard Orc Slayers in my hand I decided I could use the 5 resources, so bit the bullet and used Zigil Miner, calling number 5. Obviously, I won, as the first card discarded was Gandalf. Unfortunately, the second card discarded was also Gandalf.  So a high price to pay for those 5 resources. Too high, for my liking, but it shows how well-designed a card Zigil Miner is.\n\n. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583270","commentId":583270,"userName":"RGun","timestamp":1327255672,"content":"I agree - a dwarf deck is enticing because of all the potential synergies, but there isn't enough quest power available right now to be successful playing solo with it and also not enough dwarf cards to build a strong 2 sphere weighted deck.\n\nI haven't really tried using zigil miner's action yet - constructing a deck to try this evening loaded with 4 and 5 cost cards.  I'm not sure I like the idea of having to discard cards to take advantage of it though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583283","commentId":583283,"userName":"DurinIII","timestamp":1327256328,"content":"I play a Gimli, Dwalin, Frodo deck completely \"dwarf\" and \"Hobbit\" themed, and it works very well. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583286","commentId":583286,"userName":"DurinIII","timestamp":1327256383,"content":"I especially love it when Frodo gets a Blade of Gondolin and starts hurting some orcs!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583293","commentId":583293,"userName":"richsabre","timestamp":1327256694,"content":"DurinIII said:\n\nI play a Gimli, Dwalin, Frodo deck completely \"dwarf\" and \"Hobbit\" themed, and it works very well. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\n\n\nim playing with dwarf and silvan at the moment....really diggin it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583339","commentId":583339,"userName":"SiCK_Boy","timestamp":1327263201,"content":"ClydeCloggie said:\n\nToo high, for my liking, but it shows how well-designed a card Zigil Miner is.\n\n\n\nNot to sidetrack your topic, but Zigil Miner is anything but well-designed (at least for multiplayer play, especially two players. See other posts about the Zigil 5 support deck for reference).\n\nAs for your topic, you should try to bring in Lore. They have the best dwarven allies. For 2 costs, you get a 2-2-1-3 ally in Erebor Hammersmith. Erebor Record Keeper ensures Dain Ironfoot is always ready when required and is a 2 Willpower guy for 1 resource.. Miners of the Iron Hills comes in handy against those persky condition cards.\n\nAs you indicated, besides Zigil Miner and Dwalin, Spirit isn't much of a \"dwarfish\" sphere (more of an Hobbit one). Maybe try something with Dain, Bifur and Dwalin (splashing Spirit for A Test of Will, Hasty Stroke, Ancient Mathom and Unexpected Courage)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583434","commentId":583434,"userName":"Mighty Jim 83","timestamp":1327289766,"content":" I think Dwarves work really well for multi-player, less so for solo.\n\nThe main issue is Dain - he actually makes things worse by doing anything! with enough other dwarves in play, you can just leave him standing there boosting everyone else- with only 1 player (and three heroes max) you'll be struggling to have someone standing by like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583435","commentId":583435,"userName":"starhawk77","timestamp":1327289843,"content":"Yeah, I've had quite a bit of success with Bifur, Dain, and Dwalin. I don't think Gimli makes much sense, because he'll just be questing; Bifur performs the same function for 4 less threat AND allows you to play all of the awesome Lore dwarves. Since you probably won't be using Dain's resources very much, he can just funnel them to Bifur to pay for a steady stream of Erebor Hammersmiths, Longbeard Map Makers, etc. Untroubled by Darkness solves all your questing problems. You can throw in some Songs of Battle if you want to include Veteran Axehands, Khazad! Khazad!, and the like. Dwarves are a very well-rounded theme deck.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59332-beating-into-the-pit-solo-with-a-dwarf-themed-deck/?do=findComment&comment=583589","commentId":583589,"userName":"Spirit Juggler","timestamp":1327321928,"content":"I've managed all three with a tri sphere dwarf deck. The first is certainly the most difficult and requires a little luck with the draw to get some allies and cards that can help your willpower. "}]}