{"url":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/","title":"Good deck for A Journey to Rhosgobel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583163","commentId":583163,"userName":"peterstepon","timestamp":1327242166,"content":"Hello,\n\nI have been devoting weekends to get through my backlog of scenarios before I buy more Lord of the Rings Products.\n\nAny suggestions on a good deck (or 2 decks) to complete Journey to Rhosgobel?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583168","commentId":583168,"userName":"Zjb12","timestamp":1327243033,"content":" In the recent tournament, good winning decks were quick and relied less on finding the athelas, but using lore of imladris.  These decks cleared the first part of the quest in the opening round, kept damage as much as possible to a minimal for the eagle, (read: under the 5 cap of healing or athelas cards) and finished the whole game in the next round.  This means good questing cards, spirit; and good hanging cards, lore.  A splash of leadership with some sneak attacks for gandalf doesn't hurt either!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583174","commentId":583174,"userName":"booored","timestamp":1327243999,"content":"yeah, the score system is broken.. it encourages deck building that relies on speed and \"hope\" to not draw bad cards. The idea is to get through teh encounetr as fast as possible and see as little of the encounter deck as possible and draw as little as possible.. the scoring system as it is now encourages decks were you do nto even play the game, you may as well just draw form the encounter deck, if you get  bad one start again. Also, unless you are putting into your scores points for every time you fail the quest, the scores are meaningless as they do not reflect your skill or deck strength. Making a Rabbit deck to beat Journey works, but you may haveto play the game 5 times to get a win or mulligan 10 times to get the correct opening hand (people honestly do that I you know)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583175","commentId":583175,"userName":"booored","timestamp":1327244029,"content":"peterstepon said:\n\nHello,\n\nI have been devoting weekends to get through my backlog of scenarios before I buy more Lord of the Rings Products.\n\nAny suggestions on a good deck (or 2 decks) to complete Journey to Rhosgobel?\n\n\n\n \n\nwhat is your card pool?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583182","commentId":583182,"userName":"richsabre","timestamp":1327245296,"content":"peterstepon said:\n\n \n\nHello,\n\nI have been devoting weekends to get through my backlog of scenarios before I buy more Lord of the Rings Products.\n\nAny suggestions on a good deck (or 2 decks) to complete Journey to Rhosgobel?\n\n \n\n \n\nhave denethor in, he's key for getting rid of those 2 damage on exhausted characters, also you may as well have riversong in\n\nlore of imladris in, 3 of, as theyre pretty vital to healing alongside athelas\n\ni did a lore.spirit, to be honest there isnt many bad enemies in this, its more treachery cards you need to worry about so get some test of will in there, and elanor as a hero\n\noh yeah and some ranged allies or eagle allies to fight off the birds\n\nmap maker is useful for controlling your questing power becasue you dont want to go to 3b too fast as wilyador needs to be healed completely, so you need to manage questing alot\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583329","commentId":583329,"userName":"peterstepon","timestamp":1327260702,"content":"For the record, I do not keep score.  I am just looking for a deck which will allow me to win. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583334","commentId":583334,"userName":"richsabre","timestamp":1327262053,"content":"i have won twice, once really fast without needing any athelas, and once very slowly, however i had 3 athelas and 2 lore of imladris- thats 25 heal points!= not that i needed that many\n\nim not great at posting my decks, if get the time i will, but basically the strategy is flying through your deck to find imladris, and controling the encounter deck to 1.draw athelas and 2. prevent treachery cards- this strategy i think it the key way to win this easily"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583340","commentId":583340,"userName":"SiCK_Boy","timestamp":1327263486,"content":"As the others said, what's your card pool?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=583458","commentId":583458,"userName":"peterstepon","timestamp":1327298368,"content":"The core set, plus the first 4 expansions (hunt for Gollum to the Hills of Emyn Muil)\n\n \n\nSiCK_Boy said:\n\nAs the others said, what's your card pool?\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584410","commentId":584410,"userName":"alpha5099","timestamp":1327448250,"content":"Dear god, this quest is kicking my ass. Just spent the last few hours trying this, probably made about 8 attempts, and man I just cannot get it to work.\n\nReading through this thread, several of you have talked about being able to heal the eagle quickly. All I can think is: HOW?! He gets so much flippin' damage, I have no idea how I could possibly heal him enough. With the exception of one or two games, I've had a terrible time getting my Lores of Imladris out. Hell, I even had one game where I played two Lores in one round, and the eagle was doomed a round later. Are there other cards that can heal the eagle that I should be using? Daughter of the Nimrodel only works on heroes, Self Preservation won't go on the eagle, and Radagast's ability is so costly. I keep ending up with an extremely injured eagle, and I just cannot get enough Lores and Athelas to keep up.\n\nI don't have enough Eagle cards and ranged cards it seems to ever effectively fight off the flying enemies I seem to get plenty of. I don't like Tactics, but it feels like I don't have any choice but to plop in Legolas and what eagles and ranged allies I have from that sphere, but they don't seem to do me any good. When I try and deal with the enemies, I get routinely screwed over by Exhaustion or Festering Wound. Plus I seem to very consistently get the shadow effects that target the eagle very specifically.\n\nWhen I retool my deck with Denethor and Eleanor to try to focus on dealing with the treachery cards, it doesn't go any better. Either I end up getting swarmed by enemies, many of which I can't attack, I can't effectively quest because two of my heroes are so dedicated to other matters and I can't hope to get enough allies out to deal with anything, or I still end up getting screwed over by Treachery cards despite all the work I've put in it prioritizing them. There're so many treachery cards in the encounter deck, I am very frequently finding myself having several treacheries in a row. **** Eleanor and her ability that requires replacing the encounter card. Plus, putting all that focus on those cards means I can't seem to get any significant draw going, meaning I'm even less likely to get my Lores out. Playing this quest is the first time I've found myself using Gandalf's draw ability, because I have on several occasions been desperately close to having a dead eagle on my hands and I just need a Lore dammit! GAAAAAAAAAAH!\n\n(I'm frustrated, if you couldn't tell. enfadado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/enfadado.gif])\n\nWhat has been so truly frustrating though is how very, very close I have come several times. Let me tell you, I have screamed at Exhaustion several times as it has cost me several games, including one where I think I would have won from questing if that hadn't come up and killed Eowyn and Bilbo. There was even one where I was sure I had it down. I counted out the damage on the eagle, fifteen. I used a Lore, and successfully quested. With my two Athelases, I counted off the damage token, and discovered I'd miscounted, leaving that stupid bird with one damage token left. SUCK IT UP, YOU PIECE OF CRAP BIRD!\n\nSo yes, I am having a very very hard time figuring out how to finish this quest. Something always seems to be going wrong. Either I can't quest to save my life and the threat shoots through the roof, or I get swamped with **** dirty bats I can barely deal with, or I get screwed over repeatedly by some **** Treachery or another. When I try and make adjustments, something else just seems to go wrong. I have only the one core set and the first three APs, and I just can't seem to get anything to work. My deck just seems to be swelling because there always seems to be something else I need to deal with. Obviously I have to have Lore here; Spirit seems a necessity for cancels; I don't really like the sphere but my attempts without Tactics for eagles and ranged just seems doomed; and I can't seem to part with a least a little Leadership, if only for Marks so Legolas can get through some of the higher defense, Steward so my resources don't crap out, and Sneak Attack for Gandalf, though I'm not sure I've actually been able to get Gandalf snuck in in any of these most recent games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584432","commentId":584432,"userName":"17th Knight","timestamp":1327454068,"content":"alpha5099 said:\n\nVery frustrated\n\n\n\n \n\nYou and I both.\n\n \n\nI'm getting frustrated at the entire game in general at this point. I have spent 2 days solid trying to beat Rhosgobel and could not freaking do it, no matter what I tried, no matter what decks I made. I even made a viable deck that used all four spheres, plus neutrals, came within 1 turn of winning and got goddamn \"exhaustion\".\n\n \n\nSo then I get Khazad-Dum today and figure, \"Well, I'll just play the easy one of these so I can feel better\". NOPE!!!!!!!!!!!! Can't even beat it, 20+ attempts later, with more deck variations than I can count.\n\n \n\nAt this point, I feel like this game demands I play with two players.\n\n \n\nI bought this because I used to be in the Navy, none of my gaming friends live within 2,000+ miles of me, and I wanted a fun game to play by myself. Instead it's simply endless frustration, zero fun, and the realization that the only way I can win is to make two decks, play them both myself, and basically just cheat.\n\n \n\nI'm furious right now. I think I've spent 5-6 hours today trying to beat these two quests and I haven't done it ******* ONCE"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584433","commentId":584433,"userName":"booored","timestamp":1327454224,"content":"You 2, give me your deck pools and I'll make you a solo deck that can beat this quest easy..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584435","commentId":584435,"userName":"17th Knight","timestamp":1327455051,"content":"booored said:\n\nYou 2, give me your deck pools and I'll make you a solo deck that can beat this quest easy...\n\n\n\n \n\nThe only cards I don't have are the \"Emyn Muil\" pack. I do appreciate your offer, but I'm not sure I want a deck just handed to me. 9/10s of why I enjoy card games is building my own decks, experimenting, etc. Yet everything I do just fails and fails. I was so excited to get Khazad-Dum today, and spent the entire evening saying I'd stop playing when I just beat that one easy quest in it. And here I am, at 1:00am, a lot of obscenities later, and I'm just mad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584439","commentId":584439,"userName":"booored","timestamp":1327455322,"content":"well, why not post your deck, maybe there are some sugestions that can help but not \"do it for you\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584472","commentId":584472,"userName":"richsabre","timestamp":1327464498,"content":"17th Knight said:\n\nalpha5099 said:\n\n \n\nVery frustrated\n\n \n\n \n\n \n\nYou and I both.\n\n \n\nI'm getting frustrated at the entire game in general at this point. I have spent 2 days solid trying to beat Rhosgobel and could not freaking do it, no matter what I tried, no matter what decks I made. I even made a viable deck that used all four spheres, plus neutrals, came within 1 turn of winning and got goddamn \"exhaustion\".\n\n \n\nSo then I get Khazad-Dum today and figure, \"Well, I'll just play the easy one of these so I can feel better\". NOPE!!!!!!!!!!!! Can't even beat it, 20+ attempts later, with more deck variations than I can count.\n\n \n\nAt this point, I feel like this game demands I play with two players.\n\n \n\nI bought this because I used to be in the Navy, none of my gaming friends live within 2,000+ miles of me, and I wanted a fun game to play by myself. Instead it's simply endless frustration, zero fun, and the realization that the only way I can win is to make two decks, play them both myself, and basically just cheat.\n\n \n\nI'm furious right now. I think I've spent 5-6 hours today trying to beat these two quests and I haven't done it ******* ONCE\n\n\n\none guy should be in your deck- denethor....he is key to this. he can both get rid of horrible treachery and also fly through the encounter deck to find athelas.\n\nim guessing your already questing with eowyn, your already running lore so get protector of lorien on her and buff up her will power\n\nif your using POL then you'll want a nice card draw so beravor/bilbo/gleowine/wealth of lorien are all good cards to use, having big card draw means 1. you have a tonne of cards to discard to buff up willpower (remember protectors action is unlimited- you could buff up willpower by dozens if you have the cards) and 2. you can again fly through your own deck to find lore of imladris\n\nso to sum up- this is how i win this, once i had 25 points of healing with lores and athelas in my hand, another time i quested so fast i didnt even need any athelas\n\n1.denethor- preferably with unexpected courage attatched\n\n2.card draw cards\n\n3.protector of lorien\n\n4.use these to quickly get through both decks\n\n5.buff up willpower so not too much damage goes on wilyador\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584521","commentId":584521,"userName":"pumpkin","timestamp":1327475059,"content":"richsabre said:\n\n17th Knight said:\n\n \n\nalpha5099 said:\n\n \n\nVery frustrated\n\n \n\n \n\n \n\nYou and I both.\n\n \n\nI'm getting frustrated at the entire game in general at this point. I have spent 2 days solid trying to beat Rhosgobel and could not freaking do it, no matter what I tried, no matter what decks I made. I even made a viable deck that used all four spheres, plus neutrals, came within 1 turn of winning and got goddamn \"exhaustion\".\n\n \n\nSo then I get Khazad-Dum today and figure, \"Well, I'll just play the easy one of these so I can feel better\". NOPE!!!!!!!!!!!! Can't even beat it, 20+ attempts later, with more deck variations than I can count.\n\n \n\nAt this point, I feel like this game demands I play with two players.\n\n \n\nI bought this because I used to be in the Navy, none of my gaming friends live within 2,000+ miles of me, and I wanted a fun game to play by myself. Instead it's simply endless frustration, zero fun, and the realization that the only way I can win is to make two decks, play them both myself, and basically just cheat.\n\n \n\nI'm furious right now. I think I've spent 5-6 hours today trying to beat these two quests and I haven't done it ******* ONCE\n\n \n\n \n\none guy should be in your deck- denethor....he is key to this. he can both get rid of horrible treachery and also fly through the encounter deck to find athelas.\n\nim guessing your already questing with eowyn, your already running lore so get protector of lorien on her and buff up her will power\n\nif your using POL then you'll want a nice card draw so beravor/bilbo/gleowine/wealth of lorien are all good cards to use, having big card draw means 1. you have a tonne of cards to discard to buff up willpower (remember protectors action is unlimited- you could buff up willpower by dozens if you have the cards) and 2. you can again fly through your own deck to find lore of imladris\n\nso to sum up- this is how i win this, once i had 25 points of healing with lores and athelas in my hand, another time i quested so fast i didnt even need any athelas\n\n1.denethor- preferably with unexpected courage attatched\n\n2.card draw cards\n\n3.protector of lorien\n\n4.use these to quickly get through both decks\n\n5.buff up willpower so not too much damage goes on wilyador\n\n \n\n\n\nI concur with this, not because I've done it but because I have consistently failed by not doing it.\n\nI had all the other parts in place, but was getting hurt by treachery but not having Denethor's ability to get rid of the card completely. The rest of my deck already worked very much like this but I think Denethor is key (for solo play at least).\n\nTime for Bilbo to move over and let a yet to be slightly mad Steward of Gondor into the party....\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584707","commentId":584707,"userName":"Captain Poe","timestamp":1327499076,"content":"I won the last two plays with the following deck. I was playing incorrectly, in that when I beat the scenario, I did not realize steward of gondor was a unique card, so I had 2 in play. That being said, i think this deck (when cleaned up a little and fine tuned) should still be able to win the scenario without too much difficulty.\n\nTheodred - Quester, use to generate needed resources, depending on card draw and sphere requirements.\nBeravor - use mainly for card draw\nEowyn - use for questing.\n\nNeutral -\n2x Gandalf - Used with sneak attack twice, then played twice. Each time i used him to lower threat by 5\n2x Song of wisdom - Used one on Eowyn\n2x Song of Kings - Used on on Eowyn\n\nSpirit -\n3x - Ancient Mathom - Pulled two, and put both of them on rosgobel. When i explored it, it was like christmas :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n2x Galadhrim's Greeting - Used both, and eventually redrew one of them for a second time.\nDwarven Tomb - Used with Galadhrims Greeting.\n2x Escort From Edoras - Didn't come into play\n2 Westfold Horse-Breaker - Had one in play. never used him, but could have been used with beravor if needed\n2x Hasty Stroke - Used to prevent extra damange from shadow cards\n2x test of will - One of the most valuable cards in this quest. Almost used Dwarven tomb on this, but took my chances.\nUnexpected Courage - Used on Beravor for extra card generation, or to use her as attack/block/object gather if needed\n\nLeadership:\n2x Sneak attack - Used to lower threat with gandalf. Could have been used to instead kill enemies with gandalf if needed.\n2x steward of gondor - put on eowyn. With her 2 songs, she was a money making machine.\n3x Snowborn scout - Used to take out locations quicker, to keep threat in check.\n2x Farimar - never came into play.\n2x Silverlode archer - used to attack flying enemies, only one came into play.\nParting gift - never came into play, but useful if you dont have songs in play or a steward.\n\nLore\n3x Lore of imladris - Used 2 on wyliador, one on Theordred (I let an orc attack go unblocked because i had a hasty stroke in hand).\n3x Self Preservation - Put one on Beravor and used her to block a few times after my deck ran out and I no longer needed her to generate draw\n2x Radagast's cunning - Never needed to use\n2x Secret Paths - never needed to use.\n2x Minor from Iron hills - Never used. When I won, theodred was caught in a web, but by that point, i wasn't even worried.\n3x haldir - had him in play. Useful for killing flying enemies.\nBeorn's Hospitality - Never needed to use it.\nLoriens wealth - used for 3 extra cards earlier in game.\n\nI would say that you have sufficient questing power with Eowyn, so drop Radagast's cunning and Secret path. Likewise, the snowborn's could probably be dropped, but they did come in a bit of use to me to more quickly get through questing phases. My experience with the game was mostly drawing locations... though i have seen through flipping through the decks that there are some pretty gruesome enemies. You could theoretically drop the cards i mentioned in favor of stronger allies to help deal with them, or not drop them and just hope to keep your threat super low and out quest your enemy. God speed.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584720","commentId":584720,"userName":"17th Knight","timestamp":1327500613,"content":"I appreciate the help, and did better with it, but I've lost 3 times in a row now because of 1 exhaustion draw. The first time it wiped out half my part, the second time it wiped out all 4 heroes, the third time it wiped out all but 2. sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]\n\n \n\nI'm just not going to bother unless I can find someone else to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584734","commentId":584734,"userName":"booored","timestamp":1327501768,"content":"Dude, you should NEVER get killed by a treachery... just run Elenore in a scary treachery quest... she basically makes treachery cards completely useless.\n\nmed_eleanor-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_eleanor-core.jpg]\n\nShe (or Denathor) are a MUST have for this quest... I run both. Use Riversong.. so you can see what is coming.. and bang.. NEVER EVER get hit by a treachery card..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584737","commentId":584737,"userName":"richsabre","timestamp":1327502106,"content":"booored said:\n\n \n\nDude, you should NEVER get killed by a treachery... just run Elenore in a scary treachery quest... she basically makes treachery cards completely useless.\n\nmed_eleanor-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_eleanor-core.jpg]\n\nShe (or Denathor) are a MUST have for this quest... I run both. Use Riversong.. so you can see what is coming.. and bang.. NEVER EVER get hit by a treachery card...\n\n \n\n \n\nyeah and she's easy on the eyes to gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\non a more serious note, i think on other quests you can get away with taking a few treacheries. some are actually almost player friendly in the right situation, however the point of this one is the you probably shouldnt be taking them, or as you found out, you will lose"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584739","commentId":584739,"userName":"Budgernaut","timestamp":1327502242,"content":"booored said:\n\n \n\nDude, you should NEVER get killed by a treachery... just run Elenore in a scary treachery quest... she basically makes treachery cards completely useless.\n\nShe (or Denathor) are a MUST have for this quest... I run both. Use Riversong.. so you can see what is coming.. and bang.. NEVER EVER get hit by a treachery card...\n\n \n\n \n\nNow here's something I've been wondering for a while. How do you use Denethor to look at the encounter deck? It seems that whenever I have him on my team, I need his 3 defense to save my life. Barring Unexpected Courage, how could I look at the deck AND make sure I don't get pasted. Same goes for Eleanor. I usually need her to take the hits, but when I do cancel treachery cards, about half the time it feels like the replacement card is even worse for my situation. I suppose everyone will jump on me at this point and say, \"Study the deck!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584742","commentId":584742,"userName":"richsabre","timestamp":1327502494,"content":"Budgernaut said:\n\n \n\nbooored said:\n\n \n\nDude, you should NEVER get killed by a treachery... just run Elenore in a scary treachery quest... she basically makes treachery cards completely useless.\n\nShe (or Denathor) are a MUST have for this quest... I run both. Use Riversong.. so you can see what is coming.. and bang.. NEVER EVER get hit by a treachery card...\n\n \n\n \n\nNow here's something I've been wondering for a while. How do you use Denethor to look at the encounter deck? It seems that whenever I have him on my team, I need his 3 defense to save my life. Barring Unexpected Courage, how could I look at the deck AND make sure I don't get pasted. Same goes for Eleanor. I usually need her to take the hits, but when I do cancel treachery cards, about half the time it feels like the replacement card is even worse for my situation. I suppose everyone will jump on me at this point and say, \"Study the deck!\"\n\n \n\n \n\nwell there a few other readying cards out there, but there leadership cards....basically i think theres times when youll have to make that decision- do you want an ally to sacrifice and take the hits while denethor looks into his palantir, or do you want him to take the hits and rist a treachery?\n\nyou could also you test of will for when revealed effects, but core set only has 2"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584746","commentId":584746,"userName":"Dam the Man","timestamp":1327502828,"content":"Budgernaut said:\n\nNow here's something I've been wondering for a while. How do you use Denethor to look at the encounter deck? It seems that whenever I have him on my team, I need his 3 defense to save my life. Barring Unexpected Courage, how could I look at the deck AND make sure I don't get pasted. Same goes for Eleanor. I usually need her to take the hits, but when I do cancel treachery cards, about half the time it feels like the replacement card is even worse for my situation. I suppose everyone will jump on me at this point and say, \"Study the deck!\"\n\nIn Rhosgobel, Denethor can't even block the flyers since only Ranged chars can block them (or Eagles), so he tends to be ready at the end of the turn. Other quests, you can decide if you want to take an attack undefended (I have Gloin in the deck with Denethor) and then use Denethor for scouting the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584769","commentId":584769,"userName":"gatharion","timestamp":1327508796,"content":" I haven't beaten this one yet either.\n\n \n\nI tried making a deck specifically for it with Elenore, but I'd still end up getting swamped one way or another.\n\nI guess I can see how the \"rabbit\" method would work, but it seems like it would really require near perfect draws in your opening hand and from the Encounter deck. I might try that, just to see if I can, but generally I'm more interested in building a deck that handle whatever the encounter deck throws at me.\n\nIt's tricky. It feels like I need to have three spheres at my disposal all at once.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584773","commentId":584773,"userName":"cordeirooo","timestamp":1327509331,"content":"gatharion said:\n\nIt's tricky. It feels like I need to have three spheres at my disposal all at once.\n\n\n\n \n\nYou should try a tri-sphere for Rhosgobel, utilizing Lore/Leadership/Spirit.\n\nIf you like to build decks, you'll love the possibilities this opens to you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584902","commentId":584902,"userName":"17th Knight","timestamp":1327540155,"content":"Budgernaut said:\n\nbooored said:\n\n \n\nDude, you should NEVER get killed by a treachery... just run Elenore in a scary treachery quest... she basically makes treachery cards completely useless.\n\nShe (or Denathor) are a MUST have for this quest... I run both. Use Riversong.. so you can see what is coming.. and bang.. NEVER EVER get hit by a treachery card...\n\n \n\n \n\nNow here's something I've been wondering for a while. How do you use Denethor to look at the encounter deck? It seems that whenever I have him on my team, I need his 3 defense to save my life. Barring Unexpected Courage, how could I look at the deck AND make sure I don't get pasted. Same goes for Eleanor. I usually need her to take the hits, but when I do cancel treachery cards, about half the time it feels like the replacement card is even worse for my situation. I suppose everyone will jump on me at this point and say, \"Study the deck!\"\n\n\n\n \n\nIt's pretty easy if you roll with 4 characters instead of 3. Some might think that a bit risky, but you have a lot of ways of reducing threat between gandalf and spirit.\n\nSo I might use Denethor, Eowyn, Bereavor, and Dwalin.   Bereavor can defend, or attack, Dwalin can attack, and you're good to go.\n\nDwalin lowers threat every time he kills something, and with spirit (and the ability to replay a spirit card using the Tomb) I have never had a threat problem with this combination. It then frees up two of your characters to go wild (like Eowyn questing, or Denethor card looking, or Bereavor card-drawing).\n\nIf you're not using Spirit, it isn't viable, really, because your threat is simply too high to deal  with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584907","commentId":584907,"userName":"cordeirooo","timestamp":1327540991,"content":"17th Knight said:\n\nBudgernaut said:\n\n \n\nbooored said:\n\n \n\nDude, you should NEVER get killed by a treachery... just run Elenore in a scary treachery quest... she basically makes treachery cards completely useless.\n\nShe (or Denathor) are a MUST have for this quest... I run both. Use Riversong.. so you can see what is coming.. and bang.. NEVER EVER get hit by a treachery card...\n\n \n\n \n\nNow here's something I've been wondering for a while. How do you use Denethor to look at the encounter deck? It seems that whenever I have him on my team, I need his 3 defense to save my life. Barring Unexpected Courage, how could I look at the deck AND make sure I don't get pasted. Same goes for Eleanor. I usually need her to take the hits, but when I do cancel treachery cards, about half the time it feels like the replacement card is even worse for my situation. I suppose everyone will jump on me at this point and say, \"Study the deck!\"\n\n \n\n \n\n \n\nIt's pretty easy if you roll with 4 characters instead of 3. Some might think that a bit risky, but you have a lot of ways of reducing threat between gandalf and spirit.\n\nSo I might use Denethor, Eowyn, Bereavor, and Dwalin.   Bereavor can defend, or attack, Dwalin can attack, and you're good to go.\n\nDwalin lowers threat every time he kills something, and with spirit (and the ability to replay a spirit card using the Tomb) I have never had a threat problem with this combination. It then frees up two of your characters to go wild (like Eowyn questing, or Denethor card looking, or Bereavor card-drawing).\n\nIf you're not using Spirit, it isn't viable, really, because your threat is simply too high to deal  with.\n\n\n\nYou need a houserule to play with 4+ Heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=584931","commentId":584931,"userName":"Dam the Man","timestamp":1327548567,"content":"17th Knight said:\n\nIt's pretty easy if you roll with 4 characters instead of 3. Some might think that a bit risky, but you have a lot of ways of reducing threat between gandalf and spirit.\n\n \n\nSo I might use Denethor, Eowyn, Bereavor, and Dwalin.   Bereavor can defend, or attack, Dwalin can attack, and you're good to go.\n\nDwalin lowers threat every time he kills something\n\n \n\nOf course it's easy if you change the rules to your favor. Hell, why limit yourself to just 3 Gandalfs and Sneak Attacks either? And Dwalin only lowers threat when he kills an Orc Enemy, not everytime he kills something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=585155","commentId":585155,"userName":"17th Knight","timestamp":1327585780,"content":"cordeirooo said:\n\n \n\nYou need a houserule to play with 4+ Heroes.\n\n\n\n \n\nAre you shitting me? I thought you just had to increase the threat accordingly.\n\n \n\nWell sweet, I just beat this illegitimately. What a horrible rule. Okay, fantastic, Rhosgobel is still 100% impossible on solo.\n\n \n\nI'm really starting to loathe this game.\n\n \n\nSo you NEED Eleanor, Eowyn, AND Denethor. Giving you zero combat ability. How in the blazing **** is this supposed to be a solitaire game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=585159","commentId":585159,"userName":"richsabre","timestamp":1327586128,"content":"17th Knight said:\n\n \n\ncordeirooo said:\n\n \n\n \n\nYou need a houserule to play with 4+ Heroes.\n\n \n\n \n\n \n\nAre you shitting me? I thought you just had to increase the threat accordingly.\n\n \n\nWell sweet, I just beat this illegitimately. What a horrible rule. Okay, fantastic, Rhosgobel is still 100% impossible on solo.\n\n \n\nI'm really starting to loathe this game.\n\n \n\nSo you NEED Eleanor, Eowyn, AND Denethor. Giving you zero combat ability. How in the blazing **** is this supposed to be a solitaire game.\n\n \n\n \n\nno sorry man, only 3 most\n\nrhosgobel really doesnt have that bad enemies, it isnt a fighting quest really, get some allies in, forest snare the really bad ones, of course you need some ranged or creature cards for the birds, anyways i put out elanor for dunhere\n\nits all about the balance, thats the key to this game solo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=585166","commentId":585166,"userName":"Captain Poe","timestamp":1327586750,"content":"17th Knight said:\n\ncordeirooo said\n\n \n\n \n\nAre you shitting me? I thought you just had to increase the threat accordingly.\n\n\n\n \n\nWe all make mistakes, some of us make them all the times. I was very proud of myself when i wupped the **** out of this quest only to find out i'd cheated by having two stewards of gondor in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=585192","commentId":585192,"userName":"Zjb12","timestamp":1327589502,"content":" @17th knight:  the first time I won it was a rather speedy affair.  I was really surprised.  Now, I will take some flack for this, but a rabbit deck is the way here.  You have to think of the scenario like this:  it's like an old episode of ER where you have to save this bird's butt ASAP!  There can be no slowness.  Think healing cards, questing cards, things that will block treachery and let you peak at the encounter deck.  Eowyn, denethor, Eleanor, hennamath riversong, radagast, escort from edoras, the riddemark's finest.  If you don't care about score, you cold even use Glorfindel and right before the last stage heal the bird of 1 damage if you are just over the 5 per athelas limit.\n\nYou can do it!  (now, others may commence throwing of fruit at me for suggesting a rabbit deck!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=585212","commentId":585212,"userName":"richsabre","timestamp":1327590490,"content":"Zjb12 said:\n\n @17th knight:  the first time I won it was a rather speedy affair.  I was really surprised.  Now, I will take some flack for this, but a rabbit deck is the way here.  You have to think of the scenario like this:  it's like an old episode of ER where you have to save this bird's butt ASAP!  There can be no slowness.  Think healing cards, questing cards, things that will block treachery and let you peak at the encounter deck.  Eowyn, denethor, Eleanor, hennamath riversong, radagast, escort from edoras, the riddemark's finest.  If you don't care about score, you cold even use Glorfindel and right before the last stage heal the bird of 1 damage if you are just over the 5 per athelas limit.\n\nYou can do it!  (now, others may commence throwing of fruit at me for suggesting a rabbit deck!)\n\n\n\nwhats wrong with a rabbit deck??sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif] that term was named after a deck i made....and i say go for it, ive had a lot of fun with them decks, it may not be sopisticated  (see i cant even spell the word) but its a rush....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=585860","commentId":585860,"userName":"booored","timestamp":1327689110,"content":"Lets see the real deal?\n\nPut up or Shut Up - A JOURNEY TO RGOSGOBEL (online solo comp) [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=608313]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=598748","commentId":598748,"userName":"peterstepon","timestamp":1330186393,"content":"Finally got around to playing this scenario\n\nThanks for all the help in setting up my deck.  I actually found this to be a cakewalk.  Here were some thoughts\n\nElanor - very helpful in getting rid of treachery which would be crippling to my quest\n\nBilbo - can do some questing and the 2 cards a turn does not hurt\n\nLegolas - not only does he kill monsters, but he also gets progress tokens doing so\n\nDaughter of Nimrodel - quite possibly the most valuable characters.  One will stem the bleeding of Wilyador, 2 will bring him to stable condition by the end.\n\nEscort from Erodas - even though can only be used once, great for surging through the quest phase and getting lots of progress tokens\n\nWinged Guardian - great to defend the group from flying enemies, so that Legolas could kill them.\n\nI was bracing for a tough match, but it was quite pleasant.  Nice to turn over the last card and see 0 progress tokens.  I had 2 Athelas cards already so the scenario was a win. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=598761","commentId":598761,"userName":"booored","timestamp":1330191099,"content":"remember the daughter gets saced after healing that 2 points, also elenore can only cancel 1 treachery at a time... as action of UC is slower than response so you can not cancel a treachery, then uptap her and cancel another. I would like to see your deck list, if you are playing with the restricted I would bet you have made grievous errors in gameplay.. there is simply no way you can regually win this quest with teh restricted card pool.. and rember i have a open comp wit ha 1 AP reward for anyone that can win 4/5 games in a row."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=598765","commentId":598765,"userName":"starhawk77","timestamp":1330191915,"content":"peterstepon said:\n\nDaughter of Nimrodel - quite possibly the most valuable characters.  One will stem the bleeding of Wilyador, 2 will bring him to stable condition by the end.\n\n\n\nUnfortunately, this won't work. Daughter of the Nimrodel only heals damage from heroes, and Wilyador is considered an ally for gameplay purposes. Lore of Imladris is probably the best solution, as having an event removed from the game after use generally won't matter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=598773","commentId":598773,"userName":"Budgernaut","timestamp":1330193561,"content":"I beat this quest for the first time last night. It was a little easier than I thought. I pulled out the quest, made a deck, and beat it in about two-hours. In that time I actually had 3 deck changes. I played 5 games and won the last one. That deck used Eowyn, Bilbo, and Legolas. I had no threat cancellation to speak of (just the two spirit cards from the core) and I think I was really lucky on the card draw. The deck I won with lost the game before so it's only at a 50% win rate so far. I think the reason it felt easier than CatC is that the games are shorter. Where I spent 3 nights on Conflict at the Carrock, It took me only a couple hours to beat this one because a game lasts less than 10 rounds. I don't think that this quest is easy in terms of reliability.\n\nSo why is it so tough? Your only hope at healing the blasted bird is to use Lore of Imladris (restricted to 5 damage) or use Athelas (which are extremely hard to find in solo play). Radagast is another way to heal, but at 5 cost, he's hard to use. You pay 5 resources to wait 5 turns so he can heal 5 damage and be removed from play. In five turns, Wilyador has taken 10 damage so I think you'd be falling behind in the healing. Glorfindel can heal 1 damage, but do you really want a starting threat of 12 to heal one damage and have that hero removed from the game? We're talking removed from the game so you can't even bring Glorfindel back with any cards. Is there anything else that can heal him that I'm not aware of? Daughter of the Nimrodel and Beorn's Hospitality only heal heroes. I'm siding with Booored that this scenario can't be beaten consistently, but I reemphasize that the feeling of ease comes from the speed of the scenario, not win %s."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=599057","commentId":599057,"userName":"Faradey","timestamp":1330266676,"content":"I've gotten around to playing this quest, finally, and of the quests I've played so far (core and APs in order up to this one), this one is FAR AND AWAY the most luck-based quest, to the point that it's not fun at all. I've tried a few different strategies (mostly from these forums and 1 or 2 of my own) and it still all comes down to the luck of the draw, plus the fact that the clock is ticking rather quickly, makes it seem almost impossible. Overall, I find this to be a very poorly designed quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=617054","commentId":617054,"userName":"peterstepon","timestamp":1334271515,"content":"I got around to finishing this quest properly, but I used two decks.  Mostly Lore, Willpower, and tactics.  I did not really see the need to use Leadership in this.\n\nIt was pretty predicable, Try to cycle as many Lore cards as possible to get as many Lore of Imaldris cards in your hand (Beravor is essential for this).  Have Elanor for getting rid of the nasty treachery cards.  Use lots of Willpower allies to race through the quests.  Legolas is great for killing bats (and getting progress while doing it).  Daughter of Nimrodel was actualy good for healing heroes and I never used to heal that bird.\n\nI found it was true what someone said, playing solo is tough because you don`t get enough Athelas cards in your deck.  Elanor and Demathor allow one to cycle through the encounter decks faster and get more plants.  As a two deck game, I found it pretty simple.  Assuming you get about 3 Imaldris or Athelas cards, you should be able to win, especially if you have Eowyn and Glorfindel questing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59370-good-deck-for-a-journey-to-rhosgobel/?do=findComment&comment=618512","commentId":618512,"userName":"newdarkages","timestamp":1334615763,"content":"Here is a solo deck I used for this quest.  Played 3 times, got close the first two and beat it the third.  It's probably not perfect but works well enough for now.\n\nTotal Cards: 58\n\nHero (3)\nBeravor (Core) x1\nDenethor (Core) x1\nEleanor (Core) x1\n\nAlly (23)\nDaughter of the Nimrodel(Core) x2\nGandalf (Core) x3\nGleowine (Core) x2\nHaldir of Lorien (AJtR) x2\nHenamarth Riversong (Core) x1\nMiner of the Iron Hills (Core) x2\nRivendell Minstrel (THFG) x3\nSilverlode Archer (Core) x2\nSnowbourn Scout (Core) x3\nWestfold Horse-Breaker (THfG) x3\n\nAttachment (9)\nCelebrian's Stone (Core) x1\nDunedain Mark (THfG) x2\nProtector of Lorien (Core) x2\nSong of Kings (THFG) x1\nSteward of Gondor (Core) x2\nUnexpected Courage (Core) x1\n\nEvent (26)\nA Test of Will (Core) x2\nCommon Cause (Core) x2\nDwarven Tomb (Core) x1\nEver Vigilant(Core) x2\nHasty Stroke (Core) x2\nLore of Imladris (Core) x3\nRadagast's Cunning (Core) x2\nSecret Paths (Core) x2\nSneak Attack (Core) x2\nStand and Fight (Core) x2\nStrength of Will (Core) x2\nStrider's Path (THFG) x2\nThe Galadhrim's Greeting (Core) x2"}]}