{"url":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/","title":"Ideas for the next Zjb12 48 Hour Tournament","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583344","commentId":583344,"userName":"Zjb12","timestamp":1327265359,"content":"Hey!  So give me some ideas for next weekends tournament.  What did you like about this weekends tournament?  What didn't you like?  What ideas seem realistic but put a spin on things?  Perhaps a quest with only 2 heroes?  Or a 2 part quest with no reset in the middle?  Let me know some ideas!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583348","commentId":583348,"userName":"cordeirooo","timestamp":1327266679,"content":"I liked the idea of your previous tournament, the problem is that you haven't tested it. It, by itself, is the greatest error you could've made. Now, you (we all, actually) suffer from that, and I believe you learned your lesson.\n\nSo... Maybe do the same scenario, the same two quests, but alleviate the restrictions a bit.\n\n \n\nOh, another thing, when imposing restrictions, try to go with those cards that people have more ample access. I do not have KD, so, it was a pain to build a deck (yeah, I had the eagles... not that good in solo play). I'll try your tournaments always when they come up, whatever is the setup, but I would like to have more freedom to buy the deck.\n\n \n\nAnyway, there's my two honest cents. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583372","commentId":583372,"userName":"Zjb12","timestamp":1327271591,"content":"cordeirooo said:\n\nI liked the idea of your previous tournament, the problem is that you haven't tested it. It, by itself, is the greatest error you could've made. Now, you (we all, actually) suffer from that, and I believe you learned your lesson.\n\nSo... Maybe do the same scenario, the same two quests, but alleviate the restrictions a bit.\n\n \n\nOh, another thing, when imposing restrictions, try to go with those cards that people have more ample access. I do not have KD, so, it was a pain to build a deck (yeah, I had the eagles... not that good in solo play). I'll try your tournaments always when they come up, whatever is the setup, but I would like to have more freedom to buy the deck.\n\n \n\nAnyway, there's my two honest cents. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nHey!  Thanks!  Good points, and I will certainly try out whatever I come up with for an idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583447","commentId":583447,"userName":"leptokurt","timestamp":1327295245,"content":"I have some ideas which I might test at some point, but you're up to use them yourself, if you want to. My aim is that players won't get punished but rewarded for slaying enemies and exploring locations. Hopefully this can be a good compromise between hurrying through a scenario (new scoring system) and delaying it (old scoring system)\n\n \n\n1) Players start with 50 points\n\n \n\n2) Players use the official rules to get a result which they substract from the 50 points\n\n \n\n3) Players get bonus points for defeated enemies (enemies had to be engaged with you before they were killed)\n\n \n\nPlayers calculate the extra VP by adding the (printed) threat, attack, defense and HP of an enemy.\n\n \n\nExample: King Spider\n\n2 threat + 3 attack + 1 defense + 3 HP = 9 points\n\n \n\nIf an enemy has printed VP, like Marsh Adder, those points will also be added.\n\n \n\nExample: Marsh Adder\n\n3 threat + 4 attack + 1 defense + 7 HP + 3 VP = 18 points\n\n \n\n4) Players get bonus points for explored active (!) locations\n\n \n\nPlayers add the threat and the points needed to explore that location.\n\n \n\nExample: Dry Watercourse\n\n2 threat + 2 exploration points = 4 points\n\n \n\n \n\nThe final result would be calculated like this:\n\n \n\nFinal Score = 45\n\nBonus Points for defeated enemies (incl. printed VP) = 16\n\nBonus Points for explored locations = 7\n\n \n\nTotal result:\n\n50 - 45 + 16 + 7 = 28\n\n \n\n \n\nHopefully this is not too complicated. Thoughts are welcome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583457","commentId":583457,"userName":"SiCK_Boy","timestamp":1327297965,"content":"I don't have a specific idea to suggest, but try not to go too far outside the box. If that's the kind of thing you're looking for, you should consider working on developing your own quests instead (it's easier to integrate new concepts via the encounter decks than by self-restricting players).\n\nThe best part of your tournament was still the hero restriction. I initialy found it reminescent of the Arkham Horror league. Maybe go with something similar, but without preventing someone from using the staples.\n\nI mean, we can live without threat reduction up to a point, if a rushing strategy becomes viable (for example, with Rohan allies). Forcing the use of Dwarves and Eagles should be geared at a more combat-oriented scenario (The Seventh Level, maybe, or even Conflict at the Carrock).\n\nMaybe you could offer choice between \"packages\", that is: you cannot use resource acceleration, but then you're entitled to use certain type of allies. Or you choose not to have access to healing, but you can play another type.\n\nWhy not try to make something out of Gondor, Noble or Warrior? There are a certain number of cards with those traits, but they don't see much love from the game designer (for now; I'm sure they'll get to shine once we get to a Minas Tirith cycle)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583568","commentId":583568,"userName":"Zjb12","timestamp":1327319251,"content":"@leptokurt:  I think I kind of get what you are saying.  Would it be easier to say something like this:  In addition to attempting to finish this quest, you are also actively trying to score points by exploring locations and killing enemies.  Therefore, the following points add to your score, (then use your system) while threat, damage, dead heros and round points (reduced to 5/pts per round) take away from your score.  This means that we are actually trying to achieve a higher score in order to win.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583572","commentId":583572,"userName":"Zjb12","timestamp":1327319569,"content":"@Sickboy---that makes sense about the restrictions.  I could see something like what leptokurt is talking about and only limiting GG, Gandalf, Elf Helm, Snowbourn Scouts, Lorien Guide, Northern Tracker,  as well as other cards that put progress tokens on locations.  That way you are only limiting the ability to decrease threat so someone could not just sit there and try to anihiliate the whole deck and/or cheat and not really explore the locations.  Plus you perhaps include some type of penalty or reward for those who choose not to use Eowyn.  This might be to simply run through the Emyn Muil deck but add in an additional encounter set from the core set that includes extra enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583633","commentId":583633,"userName":"booored","timestamp":1327325814,"content":"I like the restriction rules, but yea.. play test them yourself first.. but what your event needs, as do Juices events btw, is to have a record of LOST games. You need a way to record how many games the player played, like if somone plays 20 games and gets a good score but lost 18 of them, then their deck sucks ... but if somone played 5 games and lost none of them and got a okish score.. then their deck is a bucket load better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583639","commentId":583639,"userName":"cordeirooo","timestamp":1327326584,"content":"Zjb12 said:\n\n@Sickboy---that makes sense about the restrictions.  I could see something like what leptokurt is talking about and only limiting GG, Gandalf, Elf Helm, Snowbourn Scouts, Lorien Guide, Northern Tracker,  as well as other cards that put progress tokens on locations.  That way you are only limiting the ability to decrease threat so someone could not just sit there and try to anihiliate the whole deck and/or cheat and not really explore the locations.  Plus you perhaps include some type of penalty or reward for those who choose not to use Eowyn.  This might be to simply run through the Emyn Muil deck but add in an additional encounter set from the core set that includes extra enemies.\n\n\n\n \n\nThe way I see, it's noble to expect people won't lie or cheat (because, well, what's the point of lying?), but making some restrictions solely for that purpose is lacking objectivity. Gandalf and Elfhelm are good cards that help in a variety of ways, and shouldn't be blocked. I have no idea what GG is (that's the main reason I don't like abbreviations in forums), so I won't comment here.\n\nCards like Snowbourn, Lórien Guide and Northern Tracker are good cards to be forbidden (just like Steward), because it add to the fun of the game increasing the difficulty.\n\n \n\nThe reward for NOT using Éowyn is kinda funny, but I have nothing against it (after booored - I don't remember how many 'o's is the correct - told me to try, I realized he was right, I was so depending on Éowyn and her pumping ability that the difficulty really arose for a while when she was sitting in my binder).\n\n \n\nAgain, try not to push that hard on the first try. Do something 'easy', test it, than start to put your restrictions to a point that you can say 'oh, that one was hard and I liked it', then, there you got your perfect Tourny! Even if you find another idea after testing, don't add it; wait for another round! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nGood luck, I'm waiting for this weekend!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583676","commentId":583676,"userName":"leptokurt","timestamp":1327331855,"content":"Zjb12 said:\n\n@leptokurt:  I think I kind of get what you are saying.  Would it be easier to say something like this:  In addition to attempting to finish this quest, you are also actively trying to score points by exploring locations and killing enemies.  Therefore, the following points add to your score, (then use your system) while threat, damage, dead heros and round points (reduced to 5/pts per round) take away from your score.  This means that we are actually trying to achieve a higher score in order to win.\n\n \n\n\n\n \n\nYou put the words right out of my mouth. For me it would be more motivating if I play to get a highscore and not a lowscore.\n\n \n\nI totally agree with booored's last post about including the lost games. Perhaps the result could be multiplied with the win/loss ratio of a player?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583715","commentId":583715,"userName":"Zjb12","timestamp":1327337439,"content":"leptokurt said:\n\nZjb12 said:\n\n \n\n@leptokurt:  I think I kind of get what you are saying.  Would it be easier to say something like this:  In addition to attempting to finish this quest, you are also actively trying to score points by exploring locations and killing enemies.  Therefore, the following points add to your score, (then use your system) while threat, damage, dead heros and round points (reduced to 5/pts per round) take away from your score.  This means that we are actually trying to achieve a higher score in order to win.\n\n \n\n \n\n \n\n \n\nYou put the words right out of my mouth. For me it would be more motivating if I play to get a highscore and not a lowscore.\n\n \n\nI totally agree with booored's last post about including the lost games. Perhaps the result could be multiplied with the win/loss ratio of a player?\n\n\n\nLike some type of weighted average?  How would that work?  Say I won 5/10 games and my scores (looking for high scores here) were: 100; 125; 110; 90; 135.  560 total.  Average of those would be 112.  But if you counted the five games I lost as 0's, I'd have an average of 56.  Or are you thinking something else?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583718","commentId":583718,"userName":"radiskull","timestamp":1327337852,"content":" Well, a 0 would be a phenomenal score; maybe you'd need to score it as thought you went, I dunno, 20 rounds, 50 threat, and all heroes dead or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583721","commentId":583721,"userName":"booored","timestamp":1327338075,"content":"Well in our comps we play best of three. You pick your best score from your wins to be recorded. 2 Fails and you fail the entire quest. If you fail once you +50 to your best score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583729","commentId":583729,"userName":"Zjb12","timestamp":1327338788,"content":"booored said:\n\nWell in our comps we play best of three. You pick your best score from your wins to be recorded. 2 Fails and you fail the entire quest. If you fail once you +50 to your best score.\n\n\n\nOuch!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583736","commentId":583736,"userName":"booored","timestamp":1327339358,"content":"it seams to work well, and people need to build really good decks. The 3 games means that luck is less of a factor, and at the same time the elimination means that you need to build a quality consistent deck, you can not rely on a “good draw” to speed though. I think this is what is missing fro mall comps I see, as getting a good score dose not reflect on how good a player you are or how good your deck is when you can just grind at the quest ad infinitum until you luck out and get a good score with out any considerations to how many times you totally ****** up and lost in disgrace.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583759","commentId":583759,"userName":"leptokurt","timestamp":1327341641,"content":"radiskull said:\n\n \n\n Well, a 0 would be a phenomenal score; maybe you'd need to score it as thought you went, I dunno, 20 rounds, 50 threat, and all heroes dead or something.\n\n \n\n \n\nI think he was referring to my scoring systems (in which you win if you have more points).\n\n \n\n \n\n@ZjB: that's what I meant.\n\n \n\n \n\n \n\nAs an example I try to convert my two high sores to my new system:\n\n \n\nMy 77 points result would convert into a  -13 result.\n\n \n\n50 - 77 = - 27\n\nThen I get 4 points for the Mirkwood Bats, and 2x 5 points for the Spider's Circle. Makes 14 points\n\n-27 + 14 = -13\n\n \n\nMy 93 points result would look like this:\n\n \n\n50 - 93 = -43\n\nI defeated both Marsh Adder (15 points) and the King Spider (9 points) on my way. Explored locations were Brown Lands (6 points), Mountains of Mirkwood (5 points) and Dry Watercourse (4 points).\n\nMakes -43 + 39 = -4\n\n \n\nThe second scenario scored a better result, rewarding the player for defeating monsters and exploring locations.\n\n \n\n \n\n \n\n \n\nI'm going to rebuild my dwarven deck tomorrow, and will let them quest against RtM using my rule suggestions. Will give you some feedback afterwards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583783","commentId":583783,"userName":"Zjb12","timestamp":1327344432,"content":" @leptokurt:  tel me again, what is the purpose of the original 50 points, is it must a baseline in order to help push the scores over into positive territory?\n\n@booored: so if we let people make 7 attempts like last week, 4 fails would constitute total failure even if they won the other 3, correct?  But if they won 4 and lost 3, they'd be successful but have to add 50 points to the lowest score which is what they'd submit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583790","commentId":583790,"userName":"booored","timestamp":1327344842,"content":"yea.. but the draw back with this system (and we are trying to think of a solutrion for as well) is that you need to play (in your case)  at least 4 games for the scores to work, as you need to win 5 to be the best of 7."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583808","commentId":583808,"userName":"muemakan","timestamp":1327347482,"content":" And then you have to do a lot of counting...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583828","commentId":583828,"userName":"Zjb12","timestamp":1327350662,"content":"muemakan said:\n\n And then you have to do a lot of counting....\n\n\n\nNot just counting, but addition and subtraction, maybe even multiplication!  Def. don't want to have too many pints while you're playing! babeo.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/babeo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583832","commentId":583832,"userName":"juicebox","timestamp":1327350863,"content":"Such a great discussion!\n\nI've had a wildly busy week or so, otherwise I was hoping to have tried my hand at Z's first weekend tournament myself.\n\nZjb12 - just want to say publicly that I think it's such a fun thing you are doing, offering some tournaments that come with a more focused time frame and with various experimental parameters.\n\nOne practical idea... if you aim to run with the weekend tournament idea for a while, would be to announce the plans for the tournament early in the week (like on Tuesday or something - kind of like my Wednesday weekly announcements) just to give people a chance to start planning ahead and ask questions ahead of time. This also could help build momentum and excitement for the next tournament, and more of us will have a chance to plan toward joining in the fun.\n\nAs to the general discussion - there really is a tension, isn't there? Parameters help keep things wildly interesting. In general, I'm for them. In particular though, I also like elegance, and when the number of things to count and keep track of outside playing the game itself grows too large, the elegance factor breaks down and what can be fun for many seems to begin to break down as well - at least, in my opinion, for most people - some are driven to count and count and count.\n\nThat said, I really like the idea of tracking the number of games played (with a win/loss ratio) for a given scenario (tournament) and I've been toying around with ideas for how to make that a meaningful statistic. On one hand it could be a stand alone statistic. It is meaningful in and of itself. The situation here though is about whether to create a way for that statistic to also interact with scoring and ranking (in a tournament system). A tricky matter.\n\nI'll continue to think about this, and I look forward to seeing what other thoughts and ideas come as a result of this discussion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=583843","commentId":583843,"userName":"cordeirooo","timestamp":1327354344,"content":"You could also keep a tracking of people's victory ratio. Making it a semester-championship, and in June you see who have the better % and congratulate him and give him a virtual handshaking as a prize.\n\n \n\nI suppose after so many games (if you keep it once per weekend) there is very hard to have a draw, and if it does happen, you already have the score of everyone and can see who was better! Heck, I liked the idea so much that if you don't, I might do it myself. partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]\n\n \n\nAnyway, the idea of a heads-up some days before the tourney is a VERY good idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=584241","commentId":584241,"userName":"Zjb12","timestamp":1327421134,"content":" Ok, so I am working on this weeks scenairio and trying a play through, but may need a bit more time---hopefully make an announcement tomorrow sometime."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=584838","commentId":584838,"userName":"Zjb12","timestamp":1327521824,"content":" Alright, I think I have this double scenario set up.  I wanted to do it differently and harder, but it just doesn't seem to be working out.  My final game tonight, I didn't win, but I was really close.  (I got a bad treachery in the second half of the game that killed of my Heros off.  If I had had some damage healed or the right counter card, I would have been okay and probably gone on to win.). Hoping to write this up and post it in the morning.  We will probably use RGun's scoring idea that is noted in the post by Juicebox.  \n\nQuestion, knowing that the tournament is only 48 hours (5pm fri-5pm Sun, CST/FFG time), and that it uses two AP scenarios, how many games should we do, 5, 7, 9?  \n\nHere's an idea of scoring with 7 attempts, L=loss;  90/L/85/79/L/100/74.  Average score: (90+85+79+100+74)/5= 428/5 = 85.6\n\nWin ratio: 7/5 = 1.4\n\nWeighted would be 85.6 * 1.4 = 119.84."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=584875","commentId":584875,"userName":"RGun","timestamp":1327531517,"content":"As a \"gut check\" on whether multiplying the average score by the win ratio seems like an appropriate scoring approach consider the following.  Doing this means a deck that wins 50% of the time would need to win with an average score that is twice as good as the average score from a deck that wins 100% of the time.  To me, that feels right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=584877","commentId":584877,"userName":"booored","timestamp":1327531805,"content":"no, you need to set a max nunmbr of attempts for each score. Otherwise the scores are meaningless as the more you play teh more the scores even out (that is how avrages work)\n\n \n\nJust set it up as a best fo 3.. simple.. no need for stupid math..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=584881","commentId":584881,"userName":"RGun","timestamp":1327532420,"content":"I am not saying this approach is better than any other approach or is even necessarily the best one to use, but I disagree that the scores would be meaningless with this approach.  Yes, the more you play the more the scores would even out for a specific deck/strategy used by a player but that is what you want as the evening out is what removes the luck factor of a good draw from the encounter deck.  If a player's deck/strategy is better than someone elses it should consistently end up with a higher score using this approach.  Saying the scores are meaningless the more you play amounts to saying that one deck is no better than any other deck and it is just based on luck (i.e. whoever gets the best draw from the encounter deck)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=584882","commentId":584882,"userName":"juicebox","timestamp":1327532493,"content":"booored said:\n\n \n\nno, you need to set a max nunmbr of attempts for each score. Otherwise the scores are meaningless as the more you play teh more the scores even out (that is how avrages work)\n\n \n\nJust set it up as a best fo 3.. simple.. no need for stupid math...\n\n \n\nbooored, could you expand on this in a more thoughtful way please? Sometimes your ideas get lost in your rather blunt tone.\n\nAlso, I'm just not sure what you're saying \"no\" to. A best of 3 is nice for a 2 hour tournament. I think what we're talking about here is finding a system that can accommodate a playing experience that reflects a slightly larger body of gaming. So, are you advocating a cap to the playing experience?  Like 5 games, 7 games, 10 games? Those are all caps. Are you saying \"no\" to the idea of a variant that would allow for a minimum number of plays (3, 5, 10, whatever) and then the option of an open ended number of plays beyond that, continuing to measure for win ratio?\n\nAlso, insinuating that someone's ideas are \"stupid\" is a good way to shut down conversation. I'm hoping this forum can remain a place where the tone is set for ongoing and open conversation. Words like \"stupid\" about anything really don't help that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=584893","commentId":584893,"userName":"leptokurt","timestamp":1327537115,"content":"booored said:\n\nno, you need to set a max nunmbr of attempts for each score. Otherwise the scores are meaningless as the more you play teh more the scores even out (that is how avrages work)\n\n \n\nJust set it up as a best fo 3.. simple.. no need for stupid math...\n\n\n\nBoored, but that's quite the sense of big numbers influencing the average result - the more you play, the less luck is involved and you will get an average score that identifies the strength of your deck(s),\n\n \n\nPehaps for the next tournament we should still play a given number of games (I think 7 like in the last one might be a good number to start with) to prevent to make things overcomplicated, but those who want to play more games could post a second result for scientific purposes, so we could get an idea how the number of games played influences your total score (or how it has no influence at all)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59380-ideas-for-the-next-zjb12-48-hour-tournament/?do=findComment&comment=585204","commentId":585204,"userName":"Zjb12","timestamp":1327590179,"content":" Tournament posting is out there!  Let me know if you have any questions!"}]}