{"url":"https://community.fantasyflightgames.com/topic/59384-lightless-passage-and-patrol-leader/","title":"Lightless Passage and Patrol Leader","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59384-lightless-passage-and-patrol-leader/?do=findComment&comment=583398","commentId":583398,"userName":"PESKPESK","timestamp":1327278723,"content":"There is a shadow effect on this card that puzzles me. Lightless Passage: \"Cancel all combat damage dealt to attacking enemy.\"\n\nUsually I resolve the shadow effect immediately. Here, that does not seem possible unless I don't understand how it works. At the instant I \"resolve\" the effect, there is no discernible combat damage on the enemy. Oh, there might be old damage from before, but one cannot distinguish between combat damage and any other damage, so that can't be right. I'm guessing the effect means to say: \"Cancel all combat damage this enemy might receive in the upcoming attack.\" Also which damage is not combat damage to a enemy?\n\nMaybe why shadow cards aren't discarded until the end of the phase is the key. Usually I just discard them right away.\n\nThis brings me to a second card's Shadow effect. Patrol Leader. \"Cancel all damage dealt to this enemy.\" This is where I get really puzzled. Does this mean to only remove damage that is already on the enemy? Cancel all upcoming damage to be dealt to this enemy this turn (and leave the old damage alone)? Or what?\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59384-lightless-passage-and-patrol-leader/?do=findComment&comment=583426","commentId":583426,"userName":"starhawk77","timestamp":1327288176,"content":"\"Maybe why shadow cards aren't discarded until the end of the phase is the key. Usually I just discard them right away.\"\n\nYep, you've hit the nail on the head. Shadow cards aren't discarded until the end of the combat phase (rule book, p.20), so Lightless Passage effectively makes an enemy invulnerable for the duration of a combat phase. Note, though, that it only prevents \"combat damage\" (i.e. damage from attacks), so effects like Gandalf or Swift Strike will still work. \n\n\n\n\n\"This brings me to a second card's Shadow effect. Patrol Leader. \"Cancel all damage dealt to this enemy.\" This is where I get really puzzled. Does this mean to only remove damage that is already on the enemy? Cancel all upcoming damage to be dealt to this enemy this turn (and leave the old damage alone)? Or what?\"\n\nIt works the same way as Lightless Passage, except it will also prevent damage from cards like Gandalf (should you Sneak Attack him into play). If you reveal Patrol Leader as a shadow card, the enemy to which it is attached will be immune to damage until the end of the combat phase (it doesn't heal, though).\n\nEdit: sorry for the weird format; the pasting/quoting function on these boards can be a bit ornery sometimes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59384-lightless-passage-and-patrol-leader/?do=findComment&comment=583539","commentId":583539,"userName":"radiskull","timestamp":1327314482,"content":"You got that right re: quoting with this forum software. Bleh.\n\nANYway, it's important to note that a cancel will NOT remove damage that is already there.  \"Cancel damage\" means if you are about to put damage tokens on someone, stop, and don't do it.  So I have to interpret this card as meaning \"While this shadow text is active, don't deal any damage/combat damage (those are different) to this enemy that you otherwise normally would.\"\n\nAnd yes, this is exactly why it's important not to discard shadow cards until after combat. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59384-lightless-passage-and-patrol-leader/?do=findComment&comment=583551","commentId":583551,"userName":"richsabre","timestamp":1327317267,"content":"im pleased someone asked this - it was starting to confuse me to"}]}