{"url":"https://community.fantasyflightgames.com/topic/59396-attachments-from-eliminated-players/","title":"Attachments from Eliminated Players?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59396-attachments-from-eliminated-players/?do=findComment&comment=583519","commentId":583519,"userName":"Svenn","timestamp":1327311961,"content":"If a player is eliminated then according to the rules all of the cards he controls are removed from play/sent to owners' discard piles. What about cards that are owned by that player but controlled by another player, such as an attachment. Do those stay in play? Looking over the rulebook there doesn't seem to be a mention of other cards owned by that player.\n\nIf they do stay attached, what happens if they get removed. Since the other player is eliminated his discard pile is removed from the game already. Does the card simply leave the game completely then? This seems the most likely thing, but it is a weird interaction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59396-attachments-from-eliminated-players/?do=findComment&comment=586440","commentId":586440,"userName":"Sylvicolus","timestamp":1327803776,"content":"Rules: \"When a player is eliminated, his hand, all of the cards he controls, and his deck are placed in their owner's discard piles.\"\n\nMy interpretation: It does not say the dead player's cards controlled by other players are affected so those remain where they are. If the attachment is later removed then it goes to the owner's discard pile, in this case the discard pile of the dead player. That discard pile is \"Out of Play\" but I don't see anywhere where it says that it is removed from the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59396-attachments-from-eliminated-players/?do=findComment&comment=586922","commentId":586922,"userName":"jhaelen","timestamp":1327893715,"content":"Sylvicolus said:\n\nMy interpretation: It does not say the dead player's cards controlled by other players are affected so those remain where they are.\n\n\n\nWell, the important question is: are the dead player's cards actually controlled by the other players?\n\nIn the other LCG's if a player plays an attachment on another player's character he still retains control over it. I'm not sure if the rule makes much sense for LotR because of its coopertative nature, but I cannot recall a rule that says that control of these cards actually changes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59396-attachments-from-eliminated-players/?do=findComment&comment=586932","commentId":586932,"userName":"Bonus Card","timestamp":1327894737,"content":" \n\n \n\nWhen a player is eliminated, his hand, all of the cards he controls, and his deck are placed in their owners’ discard piles.\n\n \n\nThis means to me that if that eliminated player is eliminated then all attachments on him go into the other owner players' piles, however, it seems to imply that other non-eliminated players keep whatever eliminated player's attachments or characters that are used. Therefore, cards taken by \"stand and fight\" or \"wandering took\" would be kept as they are owned by non-eliminated players.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59396-attachments-from-eliminated-players/?do=findComment&comment=587069","commentId":587069,"userName":"radiskull","timestamp":1327915922,"content":"jhaelen said:\n\n \n\nIn the other LCG's if a player plays an attachment on another player's character he still retains control over it. I'm not sure if the rule makes much sense for LotR because of its coopertative nature, but I cannot recall a rule that says that control of these cards actually changes.\n\n\n\nYou're right about LCG's in general, but this one's different:\n\n\"Players always assume control of attachments that\nhave been played on their characters. If control of\nthat character changes, so does the control of any\nattachments on that character.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/59396-attachments-from-eliminated-players/?do=findComment&comment=587570","commentId":587570,"userName":"jhaelen","timestamp":1327983247,"content":"radiskull said:\n\n \n\nYou're right about LCG's in general, but this one's different:\n\n\"Players always assume control of attachments that\nhave been played on their characters. If control of\nthat character changes, so does the control of any\nattachments on that character.\"\n\n\n\nAh, thanks! This makes all the difference."}]}