{"url":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/","title":"What are your tactics for Tactics?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583606","commentId":583606,"userName":"player1761766","timestamp":1327323396,"content":"I find it difficult to play with the tactics deck. I can never seem to get a good enough balance to see much play with them. There are some very pretty cards in this sphere, and some really very useful ones, but for a long time now I've been neglecting them in favour of Leadership/Spirit, with the odd Spirit/Lore deck making an appearance. These days, I strictly play solo, by the way. I prefer a dual-sphere deck, as triple-sphere I find too unwieldy.\n\nI think my main issue with it is a lack of anything useful to me aside from one or two combat-centric cards. I'm fairly sure I'm missing something important, but can't put my finger on what. In the past, I've tried playing with a Tactics hero, but that is often a waste of a hero. And mixing in a few cards and relying on the Song of Battle has never worked for me.\n\nSo, to all the people who play with Tactics, how do you do it? What is the mark of a good Tactics deck? Which spheres do you usually combine with? Do you usually prefer to use Tactics for certain adventures?\n\nI'd appreciate any help you can all give to help me get some Tactics cards back on the table!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583608","commentId":583608,"userName":"richsabre","timestamp":1327323579,"content":"spalanzani said:\n\n \n\nI find it difficult to play with the tactics deck. I can never seem to get a good enough balance to see much play with them. There are some very pretty cards in this sphere, and some really very useful ones, but for a long time now I've been neglecting them in favour of Leadership/Spirit, with the odd Spirit/Lore deck making an appearance. These days, I strictly play solo, by the way. I prefer a dual-sphere deck, as triple-sphere I find too unwieldy.\n\nI think my main issue with it is a lack of anything useful to me aside from one or two combat-centric cards. I'm fairly sure I'm missing something important, but can't put my finger on what. In the past, I've tried playing with a Tactics hero, but that is often a waste of a hero. And mixing in a few cards and relying on the Song of Battle has never worked for me.\n\nSo, to all the people who play with Tactics, how do you do it? What is the mark of a good Tactics deck? Which spheres do you usually combine with? Do you usually prefer to use Tactics for certain adventures?\n\nI'd appreciate any help you can all give to help me get some Tactics cards back on the table!\n\n \n\n \n\ni prefer dual sphere too, tactic and spirit are what i like, questing and fighting\n\nor lore and tactics for fighting and card draw and healing - a nice combo\n\ni like boromir as a hero, so i usually have 2 spirit and him as he can defend and ready to attack, and can be a beast with citadel plate on\n\nalso i can never resist putting horn of gondor on him, even if its suited better somewhere else\n\npoint here is what is tactics rubbish at???? yes i hear you shout- questing!!! so i basically power up on good quest cards and youve got a nice even deck\n\nas a soloers i think we have to use tactics more carefully, as primarily i think it is a support deck at the moment"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583621","commentId":583621,"userName":"gatharion","timestamp":1327325293,"content":" Solo play with a mono-sphere Tactics deck. There aren't many quests that you'll be able to pull off.\n\nTactics works best as part of a multi-sphere deck or with multi-player games.\n\n \n\nAlthough, I have had some limited success with an Eagles-based Deck, utilizing Radaghast for his two willpower and ability to help pump out Eagle allies. Legolas' ability also being pretty key."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583628","commentId":583628,"userName":"cordeirooo","timestamp":1327325553,"content":"As good richsabre said, when using tactics you lack quest-power, so you should build the second 'part' of the deck with some good willpower guys.\n\nWhen soloing (75% of the time) I use a Tactics/Spirit deck, with a veeeery low-cost. Instead of Boromir I use Legolas, mainly because I thought you do not add excess progress tokens from the Location to the quest (just knew that you do yesterday); still, I'd probably try Gimli instead of Boromir.\n\n \n\nMy most expensive Tactic ally in the deck is 2 Horseback Archer (to deal with those pesky bats in Rhosgobel), all others are 1 or 2 Cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583629","commentId":583629,"userName":"booored","timestamp":1327325606,"content":"tactics is fine now.. but it sucked for the longest time. A good eagle deck can hold its own very well, but for solo player you most likly need to \"pollute\" it with a 2nd sphere. Spirit most likely though Lore is a good option. Out of all the spheres they have added into teh game so far it is by far the least flexible as a splash. I find it is a must use for multiplayer, but when playing solo I do not use it much.\n\nI have a pretty okish deck that uses mainly tactics for solo play that uses blades and legolas to place tokens rather then questing, it is splashed with spirit for threat managment, but it dose well in most cases, like it can own the kaz quests for example. Still it fails at return (the worst designed quest in the game) and Journey (awesome quest but very strict deck needs) The deck revolves around eagles and that eagle support card.\n\nAlso now that ziggy has totally destroyed the game you can run a much more effective solo tactic / spirit+lore splash deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583637","commentId":583637,"userName":"richsabre","timestamp":1327326166,"content":"zigil miner has not broke solo play, its much less effective, im also pretty certain all decks based around that will be short lived, FFG arent daft, theyll come up with quest, encounter cards that make him less powerful"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583657","commentId":583657,"userName":"booored","timestamp":1327329063,"content":"Yes it has, I havn't even come close to loosing a single game after kaz was released.. and I have almost played though the entre set now...\n\n \n\nrichsabre said:\n\n \n\n im also pretty certain all decks based around that will be short lived, FFG arent daft, theyll come up with quest, encounter cards that make him less powerful\n\n \n\n \n\n \n\nlol, as you havn't played other LCGs I can forgive you this foolish thinking :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583660","commentId":583660,"userName":"starhawk77","timestamp":1327329917,"content":"If you feel like Zigil Miner has destroyed your game experience, then don't use it. There's no meta-game to keep up with in a cooperative LCG. I think the MIner is fine. \n\nAs for the Tactics question, I've had pretty decent success with a mono-Tactics Eagle deck using Thalin, Boromir, and Legolas. It can be tough sledding in solo play if you don't pull an early Radagast or Eagles of the Misty Mountains, but it's viable in some scenarios. It's the perfect complement to a Rohan deck or any other deck that quests and removes locations, as Eagles just massacre enemies with disturbing ease. It also utilizes Gondorian Spearman, since he works extremely well with Thalin against nearly all of the Khazad-Dum enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583662","commentId":583662,"userName":"player1761766","timestamp":1327330367,"content":"I can't think if I've ever used Tactics with Spirit, and I'm fairly certain I haven't used them with Lore. The two decks that stick out in my mind involve Tactics and Leadership both, once for Conflict at the Carrock, using I think Legolas as a hero, and again with Khazad-dum's release, using Gimli and Thalin. The first one barely scraped through, and the second one was sheer awful.\n\nSo would you say one tactics hero and two from whichever other sphere I'm using will be the best way to go? I think this weekend might see some tactics efforts once more!!!\n\nThanks, folks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583663","commentId":583663,"userName":"booored","timestamp":1327330493,"content":"starhawk77 said:\n\nIf you feel like Zigil Miner has destroyed your game experience, then don't use it. There's no meta-game to keep up with in a cooperative LCG. I think the MIner is fine. \n\n\n\nI don't , I am just testing its brokeness... I also do not play with Beravor, or Northern Tracker and run a restricted house ruile on UC"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583682","commentId":583682,"userName":"richsabre","timestamp":1327332440,"content":"booored said:\n\nYes it has, I havn't even come close to loosing a single game after kaz was released.. and I have almost played though the entre set now...\n\n \n\nrichsabre said:\n\n \n\n im also pretty certain all decks based around that will be short lived, FFG arent daft, theyll come up with quest, encounter cards that make him less powerful\n\n \n\n \n\n \n\nlol, as you havn't played other LCGs I can forgive you this foolish thinking :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n\n\nwhat so your actually telling me theyll just leave the game in a state where every quest is 100% beatable by just 1 strategy???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583698","commentId":583698,"userName":"SiCK_Boy","timestamp":1327334186,"content":"Personnaly, I never use Tactics solo. At most, I'd splash it for Feint. But none of the Tactics heroes are to my suiting and I just prefer other spheres.\n\nHowever, the eagle deck can do wonder in a multiplayer environment and Tactics is a good support deck to have to distribute equipment left and right (as well as take on the biggest baddies with Gimli).\n\nAs for Miner's power, I have to side in with Booooored. As was pointed out, the fact that there's no competitive environment (yet; we keep hearing about it from FFG, but it feels like waiting for Hunt for Gollum did after a few weeks) is to me the biggest impediment to the designers correcting the situation.\n\nSure, one can just simply ignore him, just like other people are challenging themselves by not using Northern Tracker, for example. But the Miner simply allows you to bypass one of the basic principle of the game (you usualy get one resource per hero per turn, meaning you normaly generate 3 resources a turn; 5 with Steward of Gondor; all other resources acceleration had an inbred drawback [wounds on Gloin, characters leaving play with Horn of Gondor]), without any severe drawback, and in such a huge fashion that it becomes easy to beat any scenario when using it as a strategy.\n\nWith some luck, we may start seeing encounter cards to counterbalance it (restrictions on how many cards a player can play in a turn, or damage to heroes based on how many resources they hold), but it'll become redundent after a time. I just think they did not playtest it enough. We see it with all card games (Magic comes easily to mind) where they try to expand on something and just miss a potential abuse. In the case of Miner, played in a \"regular\" deck, it's a good-better-than-average card, generating a resource here and there (or more consistently with Gildor and other forms of deck manipulation). With a deck shock-ful of 5 costs cards, however, it becomes a resource engine like no other in the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583702","commentId":583702,"userName":"richsabre","timestamp":1327334503,"content":"SiCK_Boy said:\n\n \n\nWith some luck, we may start seeing encounter cards to counterbalance it (restrictions on how many cards a player can play in a turn, or damage to heroes based on how many resources they hold), but it'll become redundent after a time. I just think they did not playtest it enough.\n\n \n\n \n\nthis was my point entirely, i mean seriously....i may not be experienced in ccgs lcgs etc , but why would devs leave a broken game to stew????"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583708","commentId":583708,"userName":"booored","timestamp":1327336597,"content":"richsabre said:\n\n \n\n \n\nwhat so your actually telling me theyll just leave the game in a state where every quest is 100% beatable by just 1 strategy???\n\n \n\n \n\n \n\nThat is exactly what I am saying.\n\n\nWe are not talking about a card that can be adjusted though a Errata, nor are we talking about a rule inconsistency. We are talking about a BAN or a RESTRICTED list.. something his game has yet to start on. All card games have them, it is impossible for devs to really understand the full effect of a card, once it gets in players hands and they start experimenting with it in a deck. Ziggy, imo, was badly designed from the outset, but the combo with Gildor is really what breaks it. The card itself though is working exactly as designed.. so the only way to fix this is to ban it or restrict it, or (in this game anyway) build a encounter card that negates it, though that sucks as then you need to build that encounter card into EVERY pack form now on.\n\n\nThe thing about Ban and Restricted lists is that they are slow to react. You need time to release the card, have everyone play it and really see how it is effecting the meta game. IF they do a ban list it will not be well into, more likely after the full Darrowdelf cycle is out. IF they do it at all and that is a big IF.\n\n\nYou basically have 3 options. Use it, do not use it, or make a house rule to gimp it. They fact that this is not a competitive game gives house rules a lot of power, as the game is about experience not about \"winning\" so to speak. There is no draw back to making your own rules, as you are playing with your mates, so as long as you have fun it doesn’t matter.\n\n\nStill SickBoy has it nailed. The problem with Ziggy, is that it removes an entire major system from the game mechanics and imo, that is no ok. I mean Northern Tracker was bad enough removing the travel phase for many players. Get 2 on the table.. why travel anywhere? Well this is the resource phase.. it is even worse.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=583748","commentId":583748,"userName":"richsabre","timestamp":1327340692,"content":"booored said:\n\n \n\nrichsabre said:\n\n \n\n \n\nwhat so your actually telling me theyll just leave the game in a state where every quest is 100% beatable by just 1 strategy???\n\n \n\n \n\n \n\nThat is exactly what I am saying.\n\n\nWe are not talking about a card that can be adjusted though a Errata, nor are we talking about a rule inconsistency. We are talking about a BAN or a RESTRICTED list.. something his game has yet to start on. All card games have them, it is impossible for devs to really understand the full effect of a card, once it gets in players hands and they start experimenting with it in a deck. Ziggy, imo, was badly designed from the outset, but the combo with Gildor is really what breaks it. The card itself though is working exactly as designed.. so the only way to fix this is to ban it or restrict it, or (in this game anyway) build a encounter card that negates it, though that sucks as then you need to build that encounter card into EVERY pack form now on.\n\n\nThe thing about Ban and Restricted lists is that they are slow to react. You need time to release the card, have everyone play it and really see how it is effecting the meta game. IF they do a ban list it will not be well into, more likely after the full Darrowdelf cycle is out. IF they do it at all and that is a big IF.\n\n\nYou basically have 3 options. Use it, do not use it, or make a house rule to gimp it. They fact that this is not a competitive game gives house rules a lot of power, as the game is about experience not about \"winning\" so to speak. There is no draw back to making your own rules, as you are playing with your mates, so as long as you have fun it doesn’t matter.\n\n\nStill SickBoy has it nailed. The problem with Ziggy, is that it removes an entire major system from the game mechanics and imo, that is no ok. I mean Northern Tracker was bad enough removing the travel phase for many players. Get 2 on the table.. why travel anywhere? Well this is the resource phase.. it is even worse.\n\n \n\n \n\n \n\naye i see your point, i admit im surprised that zigil got through testing so loosely....surely it couldnt take that long to figure it broke? i mean how long it take to make your deck since khazads release? a week?\n\nanyways, given that i have barely any interest in win ratio and competative play, i consider myself unaffected by this point, i play thematically as you well know as if i dont like zigil i wont use it, and the same with any card\n\nso yeah.....i will watch interestedly from a distance as to what happens to zigil miner...oh yeah re. the new news article...it seems FFG are embracing zigil instead of taking actions to stop it.....note their hint.....gildor replaced by a cheaper spirit elf ally....\n\nand sorry spalanzani, back onto your topic we go..........."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59406-what-are-your-tactics-for-tactics/?do=findComment&comment=584124","commentId":584124,"userName":"player1761766","timestamp":1327407702,"content":"Hehe! No problem!\n\nI must admit, I'm not too bothered by this Zigil Miner farrago - I have such consistently bad luck with card drawing that I doubt I could ever make this work. I'd pick the wrong number, probably discard the important cards, and that would be that! I have to admit, though, the thought of having 40 cards in my hand is just too ridiculous to ever want. So I'll continue to have him out there because he's a dwarf, and I'm playing a dwarf deck. I have no interest in trying to smash my way through scenarios with such things!"}]}