{"url":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/","title":"FFG is embracing Zigil instead of taking actions to stop it","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583778","commentId":583778,"userName":"SiCK_Boy","timestamp":1327343668,"content":"I \"stole\" my topic title from richsabre's post in the tactics for Tactics post.\n\nFrom the latest news post on this website, it looks like the designers are not worried at all about Zigil Miner's impact of the game and that he's just a natural evolution. They even hint at more potential with a new Gildor-like ally.\n\nWhat's wrong with this picture?\n\nFrom the decklist they provided, it looks like they only consider Zigil Miner as a combo with Gildor. And I think the main error they may be making is in relying on a single core set as a reference point. Yes, for people owning a single core set, building a fully effective Miner deck is difficult (since most of the 5 cost cards from the Core Set were 1-of).\n\nBut don't they see how abusive it becomes as soon as you make it the focus of a multiplayer strategy?\n\nWhat I find even more disconcerting is how they seem to imply that this kind of jump is just a natural part of the game. We went from an environment where the best acceleration gave you 2 extra resources / turn while being Unique, to one that can give you an average of 3 or more, but in multiple copies. What's the next card going to be? A non-unique Lore ally that lets either one player draw 3 cards or all players draw 2 cards by exhausting? That kind of light-year jump (compared to the current powerhouse of Beravor) is what Zigil Miner is compared to Steward of Gondor (which everyone agreed was a strong card in itself). Are we going to see a major power creep in this game, so soon in its career?\n\nFor a game that's supposed to be designed primarily from a 2-players perspective and that is supposed to eventualy have a competitve scene, I find it shows a surprising lack of insight..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583779","commentId":583779,"userName":"richsabre","timestamp":1327343860,"content":"yes, i did indeed find this a strange thing for them to do, especially the way they hinted at it, as if they were fully aware of the implications of what they are doing- which you know i sort of hope they are, i wonder how much they moniter the forums to use as feedback, seeing as this is the primary area for such activity on deck building etc??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583780","commentId":583780,"userName":"booored","timestamp":1327343962,"content":"Yeah, it is kind of unbelievable. The only thing I am clinging to is the small hint...\n\n“The Zigil Miner deck is a radical new development in The Lord of the Rings: The Card Game, opening up a lot of rich combinations and card interactions, the likes of which we’ll continue to see throughout the Dwarrowdelf cycle of Adventure Packs “\n\nSo, maybe we will see massive card interactions that in fact use 10 or 15 resources to pull off?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583782","commentId":583782,"userName":"richsabre","timestamp":1327344250,"content":"well going back to original points i still believe they are going to have to do something soon, i mean in this cycle\n\nand again yes...i dont have other experience with FFG, but i still find it hard to believe they are that stupid not to have a plan to make this work...perhaps i have too much faith...oh how the plot thickens gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583786","commentId":583786,"userName":"booored","timestamp":1327344558,"content":"richsabre said:\n\nbut i still find it hard to believe they are that stupid not to have a plan to make this work...perhaps i have too much faith\n\n \n\n \n\n \n\n\"Always bet on stupidity\" - Booored\n\nrichsabre said:\n\n \n\ni wonder how much they moniter the forums to use as feedback, seeing as this is the primary area for such activity on deck building etc??\n\n \n\n \n\nThey don't. FFG is famous for have ZERO community participation.. the forums are not even moderated by volunteers.. I could make a thread that is just a bunch of swear words and bump it once a day and it will nvr get noticed.\n\n----EDIT---\n\nIn fact here is a thread were I have basically been doing that for a few months... [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=169&efcid=2&efidt=555302]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583789","commentId":583789,"userName":"richsabre","timestamp":1327344817,"content":"booored said:\n\nrichsabre said:\n\nbut i still find it hard to believe they are that stupid not to have a plan to make this work...perhaps i have too much faith\n\n \n\n \n\n \n\n\"Always bet on stupidity\" - Booored\n\nrichsabre said:\n\n \n\ni wonder how much they moniter the forums to use as feedback, seeing as this is the primary area for such activity on deck building etc??\n\n \n\n \n\nThey don't. FFG is famous for have ZERO community participation.. the forums are not even moderated by volunteers.. I could make a thread that is just a bunch of swear words and bump it once a day and it will nvr get noticed.\n\n----EDIT---\n\nIn fact here is a thread were I have basically been doing that for a few months... [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=169&efcid=2&efidt=555302]\n\n\n\nwell i must admit booored that was both hilarious and an eye opener to me......bad business ethics grrr...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583797","commentId":583797,"userName":"conykchameleon","timestamp":1327345868,"content":"I'm not really sure what you fellows are so worried about. You don't like Zigil Miner?... ... Don't play with him. Problem solved!!!\n\nYou're complaining that any potential competitive scene would be ruined by this card. There's two huge issues with what you're saying:\n\n1. There is no competitive scene, and Fantasy Flight has given no concrete indication that there will be one for the foreseeable future.\n\n2. In any competitive card game, there is always a \"best\" deck. Should we \"fix\" Northern Tracker too? How about Boromir? Where's the line?\n\nAnd actually when you say that FFG is doing \"nothing\" about this, you are completely wrong. In an online interview a month or two ago, Nate French told us about how Fantasy Flight plans to handle the interactions you're complaining about. Here's the link:\n\nhttp://www.stickam.com/viewMedia.do?mId=192245648&pId=78031 [http://www.stickam.com/viewMedia.do?mId=192245648&pId=78031]\n\nWith all due respect ladies and gentlemen, please load your brains before you shoot your mouth."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583802","commentId":583802,"userName":"richsabre","timestamp":1327346661,"content":"conykchameleon said:\n\n \n\nI'm not really sure what you fellows are so worried about. You don't like Zigil Miner?... ... Don't play with him. Problem solved!!!\n\nYou're complaining that any potential competitive scene would be ruined by this card. There's two huge issues with what you're saying:\n\n1. There is no competitive scene, and Fantasy Flight has given no concrete indication that there will be one for the foreseeable future.\n\n2. In any competitive card game, there is always a \"best\" deck. Should we \"fix\" Northern Tracker too? How about Boromir? Where's the line?\n\nAnd actually when you say that FFG is doing \"nothing\" about this, you are completely wrong. In an online interview a month or two ago, Nate French told us about how Fantasy Flight plans to handle the interactions you're complaining about. Here's the link:\n\nhttp://www.stickam.com/viewMedia.do?mId=192245648&pId=78031 [http://www.stickam.com/viewMedia.do?mId=192245648&pId=78031]\n\nWith all due respect ladies and gentlemen, please load your brains before you shoot your mouth.\n\n \n\n \n\n1. ive discussed my opinions of this in length somewhere else, which were actually in disagreement to the above\n\n2. i really couldnt care less about competative play, the less said about it the better, tournaments are for people like glaurung, and they have every right to want them etc, but i play this for the theme\n\n3. above i stated i didnt think that ffg were that stupid not to have something in store to combat all this zigil stuff\n\n4.i dont play zigil miner in the ziggy decks, never have,never will, playing daft decks to win has never interested me\n\nive said this somewhere else, but im gonna sit down and watch all this thing happen from a nice distance, knowing it doesnt have to affect me if i dont want it to"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583806","commentId":583806,"userName":"booored","timestamp":1327346963,"content":"that argument is ****. It is their design decisions that make that cards good or bad... not ours. What we are talking about has nothing to do with the supposed competitive scene... we are talking about cards that change the fundamental functions of the game, in this case removing the need for resources.\n\nThe argument of \"do not like it do not play with it\" has nothing to do with it. I already play with a ban list and a custom rule list for solo and in one of my 2 player groups.. Northern Tracker, Beravor and Ziggy are banned, and also Unexpected Courage is restricted and Protector of Lorian is Unique.\n\nThe point is WHY do we have to make this rules to make the game fun in the first place. I can not even understand how people can not have a problem with Ziggy. I mean it is impossible to loose a game running him. It removes the resource aspect of the game. I mean tragic posted that video on YouTube where in a solo game ON TURN 2, he had 2 northern trackers and Beorn out. How can you say that is not broken?\n\n[ADMIN: Edited for content.]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583816","commentId":583816,"userName":"conykchameleon","timestamp":1327348861,"content":"booored said:\n\n \n\nthat argument is bull. It is their design decisions that make that cards good or bad... not ours. What we are talking about has nothing to do with the supposed competitive scene... we are talking about cards that change the fundamental functions of the game, in this case removing the need for resources.\n\nThe argument of \"do not like it do not play with it\" has nothing to do with it. I already play with a ban list and a custom rule list for solo and in one of my 2 player groups.. Northern Tracker, Beravor and Ziggy are banned, and also Unexpected Courage is restricted and Protector of Lorian is Unique.\n\nThe point is WHY do we have to make this rules to make the game fun in the first place. I can not even understand how people can not have a problem with Ziggy. I mean it is impossible to loose a game running him. It removes the resource aspect of the game. I mean tragic posted that video on YouTube where in a solo game ON TURN 2, he had 2 northern trackers and Beorn out. How can you say that is not broken?\n\n \n\n \n\nSiCK_Boy said:\n\n\nFor a game that's supposed to be designed primarily from a 2-players perspective and that is supposed to eventualy have a competitve scene, I find it shows a surprising lack of insight...\n\n \n\n \n\n \n\nThe OP seemed to be concerned about competitive play.\n\n\"we are talking about cards that change the fundamental functions of the game\" - Every single card in a trading card game changes the fundamental functions of the game. That's the point of trading card games. Zigil Miner allows you to generate a lot more than 1 resource per hero per turn. Beravor allows you to draw a lot more than 1 card per turn. Unexpected Courage allows you to ready outside of the Refresh step. So on and so forth...\n\n\"'do not like it do not play with it' has nothing to do with it...Beravor and Ziggy are banned...\" - you've already said that you don't play with Zigil Miner, so clearly it does have something to do with it.\n\n\"The point it WHY do we have to make this rules to make the game fun in the first place\" - People enjoy this game for different reasons (http://www.fantasyflightgames.com/edge_news.asp?eidn=2296 [http://www.fantasyflightgames.com/edge_news.asp?eidn=2296]). The Lord of the Rings the Card Game caters to a wide variety of people, as really any game does. Everyone makes their own modifications and house rules to get what they're looking for out of the experience. It's part of the hobby.\n\n[ADMIN: Edited for content. Keep this civil. Exclude foul language and attacks on your fellow forum members.]\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583820","commentId":583820,"userName":"booored","timestamp":1327349578,"content":"wow, there are admins on this forum!! awesome.\n\n \n\n \n\nBut yea, I just do not see how anyone can think this is not OP.. like a turn 1 getting 2 northern trackers out? How about questing with one card (map maker) and being able to quest around 16 will per turn, fro a single card? What about removing the entire concept of blocking from the game as you can just sac a hero to an attack and bring it back from the yard with Fate, every turn , hey forget Fate, what about not caring about damage as you can cast Hospitality evey turn? Choices about quests vs block/attack.. who cares.. just cast that untap everything card every turn...\n\n \n\n(even the deck building article is talking about a cycle deck btw)\n\nYou seriously do not think that is OP?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583829","commentId":583829,"userName":"conykchameleon","timestamp":1327350691,"content":"booored said:\n\nwow, there are admins on this forum!! awesome.\n\n \n\n \n\nBut yea, I just do not see how anyone can think this is not OP.. like a turn 1 getting 2 northern trackers out? How about questing with one card (map maker) and being able to quest around 16 will per turn, fro a single card? What about removing the entire concept of blocking from the game as you can just sac a hero to an attack and bring it back from the yard with Fate, every turn , hey forget Fate, what about not caring about damage as you can cast Hospitality evey turn? Choices about quests vs block/attack.. who cares.. just cast that untap everything card every turn...\n\n \n\n(even the deck building article is talking about a cycle deck btw)\n\nYou seriously do not think that is OP?\n\n \n\n\n\nI seriously do not. I've played the deck, it's really effective. It's also really boring. I have yet to play a deck that I thought would auto-win every quest. I'm still waiting for that one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583833","commentId":583833,"userName":"SiCK_Boy","timestamp":1327352082,"content":"FFG is working on a competitive scene. They changed the whole scoring system just for that purpose (because otherwise, why bother with a scoring system in the first place - anyone could have used his own if they wanted). Although I perfectly understand this scene is not for everyone and there are people who enjoy the game for a multitude of reasons, it is a factor that should be given at least some consideration by the designers.\n\n \n\nTHe argument about \"just don't use it\" is pointless. I already know I can choose to ignore it, but we're talking about the game design here. Since we cannot undo Zigil Miner, either the game designers should do it (via a banning or restriction or such other metagame decision) or they have to keep designing future expansions around the very existence of this card. When such a thing happens, you know you're seeing a mistake in design.\n\nI don't think Zigil Miner is fun-breaking. I'm playing it now, will probably keep on playing it for a few more weeks, and for sure the first deck I'll take against any of the upcoming scenario is that one. But to me, the quest for the fabled win-all deck (at least for 2 players) is over. The second deck is not even that important, when you have so many resources being generated (and Boooored hinted quite a few time that my build was suboptimal; I can hardly imagine how it'd be if it was optimal).\n\nWhen you state that every card changes the rules and standards of the game, it's wrong. The standards of the game were established by the Core Set and the rules themselves. From that, we gathered that card draw had a cost (1 resource per card for Lorien Wealth) or was limited to Unique cards (Beravor, Gleowine). This is the standard. Coming up with a non-unique ally letting you draw 4 cards by exhausting would totally break this standard. Not just evolve it to a next step, but jump it a few light years ahead. Other cards additions didn't have this impact. Printing Second Breakfast didn't change the game. Doing the Songs was a change to one of the paradygm of this game; but most people agree it opened possibilities rather than reducing them. Campfire Tales was a nice take on card drawing. I'm sure we'll eventually see another threat reduction card in the same line as The Galadhrim's Greetings.\n\nBut in what way is Zigil Miner opening possibilities? By giving you access to a no brainer win all deck... Is that really what we want, so early in this game's evolution?\n\nAnd if it's because of what Boooored hints at (massive resource use for spectacular effects), that would be worse. Because then, Miner becomes the only option.\n\nMy main fear after that is the upcoming power creep we'll see. We saw it in part with KD: most KD quests were deemed difficult even for people owning all the cards. I'm not complaining here: the fact that they would need to constantly increase difficulty was identified from the start as a weak point of this gaming system. But how fast will it have to increase for the encounter deck to keep pace with players producing so many resources? What are they gonna need to invent the next time to make the game feel somewhat difficult for the Zigil-strategy player?\n\nMaybe I'm overreacting and the designers have a masterplan and they'll surprise me. I'll be the first to congratulate them if they do (just like we saw Glaurung applaude the difficulty level of KD - for a few days at least).\n\nBut I'm afraid they are at risk of creating more mistakes to correct this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583835","commentId":583835,"userName":"booored","timestamp":1327352729,"content":"Your like the more polite coherent version of me.. seriously though i totally agree with everything you just said\n\nSiCK_Boy said:\n\njust like we saw Glaurung applaude the difficulty level of KD - for a few days at least).\n\nthat was a minor miracle hey :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583837","commentId":583837,"userName":"conykchameleon","timestamp":1327353071,"content":"SiCK_Boy said:\n\nFFG is working on a competitive scene. They changed the whole scoring system just for that purpose (because otherwise, why bother with a scoring system in the first place - anyone could have used his own if they wanted). Although I perfectly understand this scene is not for everyone and there are people who enjoy the game for a multitude of reasons, it is a factor that should be given at least some consideration by the designers.\n\n \n\nTHe argument about \"just don't use it\" is pointless. I already know I can choose to ignore it, but we're talking about the game design here. Since we cannot undo Zigil Miner, either the game designers should do it (via a banning or restriction or such other metagame decision) or they have to keep designing future expansions around the very existence of this card. When such a thing happens, you know you're seeing a mistake in design.\n\nI don't think Zigil Miner is fun-breaking. I'm playing it now, will probably keep on playing it for a few more weeks, and for sure the first deck I'll take against any of the upcoming scenario is that one. But to me, the quest for the fabled win-all deck (at least for 2 players) is over. The second deck is not even that important, when you have so many resources being generated (and Boooored hinted quite a few time that my build was suboptimal; I can hardly imagine how it'd be if it was optimal).\n\nWhen you state that every card changes the rules and standards of the game, it's wrong. The standards of the game were established by the Core Set and the rules themselves. From that, we gathered that card draw had a cost (1 resource per card for Lorien Wealth) or was limited to Unique cards (Beravor, Gleowine). This is the standard. Coming up with a non-unique ally letting you draw 4 cards by exhausting would totally break this standard. Not just evolve it to a next step, but jump it a few light years ahead. Other cards additions didn't have this impact. Printing Second Breakfast didn't change the game. Doing the Songs was a change to one of the paradygm of this game; but most people agree it opened possibilities rather than reducing them. Campfire Tales was a nice take on card drawing. I'm sure we'll eventually see another threat reduction card in the same line as The Galadhrim's Greetings.\n\nBut in what way is Zigil Miner opening possibilities? By giving you access to a no brainer win all deck... Is that really what we want, so early in this game's evolution?\n\nAnd if it's because of what Boooored hints at (massive resource use for spectacular effects), that would be worse. Because then, Miner becomes the only option.\n\nMy main fear after that is the upcoming power creep we'll see. We saw it in part with KD: most KD quests were deemed difficult even for people owning all the cards. I'm not complaining here: the fact that they would need to constantly increase difficulty was identified from the start as a weak point of this gaming system. But how fast will it have to increase for the encounter deck to keep pace with players producing so many resources? What are they gonna need to invent the next time to make the game feel somewhat difficult for the Zigil-strategy player?\n\nMaybe I'm overreacting and the designers have a masterplan and they'll surprise me. I'll be the first to congratulate them if they do (just like we saw Glaurung applaude the difficulty level of KD - for a few days at least).\n\nBut I'm afraid they are at risk of creating more mistakes to correct this one.\n\n\n\nFirst things first: Admin, the original language is still visible in my post at 20:06:43, you might want to get rid of that.\n\nSiCK_Boy said:\n\nFFG is working on a competitive scene. They changed the whole scoring system just for that purpose (because otherwise, why bother with a scoring system in the first place - anyone could have used his own if they wanted). Although I perfectly understand this scene is not for everyone and there are people who enjoy the game for a multitude of reasons, it is a factor that should be given at least some consideration by the designers.\n\n \n\nTHe argument about \"just don't use it\" is pointless. I already know I can choose to ignore it, but we're talking about the game design here. Since we cannot undo Zigil Miner, either the game designers should do it (via a banning or restriction or such other metagame decision) or they have to keep designing future expansions around the very existence of this card. When such a thing happens, you know you're seeing a mistake in design.\n\nI don't think Zigil Miner is fun-breaking. I'm playing it now, will probably keep on playing it for a few more weeks, and for sure the first deck I'll take against any of the upcoming scenario is that one. But to me, the quest for the fabled win-all deck (at least for 2 players) is over. The second deck is not even that important, when you have so many resources being generated (and Boooored hinted quite a few time that my build was suboptimal; I can hardly imagine how it'd be if it was optimal).\n\nWhen you state that every card changes the rules and standards of the game, it's wrong. The standards of the game were established by the Core Set and the rules themselves. From that, we gathered that card draw had a cost (1 resource per card for Lorien Wealth) or was limited to Unique cards (Beravor, Gleowine). This is the standard. Coming up with a non-unique ally letting you draw 4 cards by exhausting would totally break this standard. Not just evolve it to a next step, but jump it a few light years ahead. Other cards additions didn't have this impact. Printing Second Breakfast didn't change the game. Doing the Songs was a change to one of the paradygm of this game; but most people agree it opened possibilities rather than reducing them. Campfire Tales was a nice take on card drawing. I'm sure we'll eventually see another threat reduction card in the same line as The Galadhrim's Greetings.\n\nBut in what way is Zigil Miner opening possibilities? By giving you access to a no brainer win all deck... Is that really what we want, so early in this game's evolution?\n\nAnd if it's because of what Boooored hints at (massive resource use for spectacular effects), that would be worse. Because then, Miner becomes the only option.\n\nMy main fear after that is the upcoming power creep we'll see. We saw it in part with KD: most KD quests were deemed difficult even for people owning all the cards. I'm not complaining here: the fact that they would need to constantly increase difficulty was identified from the start as a weak point of this gaming system. But how fast will it have to increase for the encounter deck to keep pace with players producing so many resources? What are they gonna need to invent the next time to make the game feel somewhat difficult for the Zigil-strategy player?\n\nMaybe I'm overreacting and the designers have a masterplan and they'll surprise me. I'll be the first to congratulate them if they do (just like we saw Glaurung applaude the difficulty level of KD - for a few days at least).\n\nBut I'm afraid they are at risk of creating more mistakes to correct this one.\n\n\n\nNow that's a well-crafted post that gets to a real issue. Here's what I'll argue in response though is that by himself, Zigil Miner does not 'break the game'. The 'Ziggy' deck, at least as I understand it, involves putting a whole bunch of 5 cost cards in your deck in order to maximize the combo. At this point, you have built your deck around the Zigil Miner. Now....you're playing the deck:\n\nA) What if you don't draw it?\n\nOkay, you're playing two player and your partner allows you to draw your deck\n\nB) He's got one hit point and has to be exhausted for his ability, which leaves him SO vulnerable to any number of treacheries/effects from the encounter deck. In my experience, the encounter deck has a lot to say about Allies, exhausted characters, and characters with 1 health.\n\nC) We don't know what kind of Quests will be released from this point on. Khazad-dum quests are miles harder than anything we saw in the Core set, and I have no doubt that Dwarrowdelf will bump it up another notch.\n\n \n\nBottom line for me (and I completely respect your guys' opinions, despite what the Admin made my post look like): Is Zigil Miner the most powerful card to date? Probably. Does it create an interaction that is unpleasant to the point where FFG needs to intervene? No."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583856","commentId":583856,"userName":"Narsil0420","timestamp":1327358780,"content":"I am not concerned that Zigil Miner is too powerful. In the time it takes to set it up with Gildor a lot of bad things can happen. Also a deck that takes full advantage of the combo is not very well rounded and not very practical to play, especially in solo play. It seems like a fun little trick that you can enjoy setting up but not \"game breaking.\" I also echo the point that this is not, as yet, a competitive game, I believe most of you alarmists are stuck in your old MTG mentality.\n\nBefore we start freaking out, let's see some data on the success rate of a \"Zigil Miner Deck.\" I want proof that a persons success rate goes way up when they're playing with this deck before we declare it broken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583858","commentId":583858,"userName":"RGun","timestamp":1327359096,"content":"I suspect we may see some very expensive cards coming up in the Darrowdelf cycle that utilize the secrecy mechanic...so either you'll need to keep your threat very low to be able to afford them, or leverage the power of the zigil miner.  Different strategies to gain access to what are probably some very useful (and likely needed) cards.  Might also see some location cards that cause you to lose resources, or make cards more expensive (e.g. if you're traveling way up in the mountains may be harder (i.e. more expensive) to find allies)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583867","commentId":583867,"userName":"ricedwlit","timestamp":1327362929,"content":" I don't know about location cards that make you lose resources, but there's a treachery card in the KD unused encounter set that causes the first player to use three resources from each hero. \n\nOn the whole I'm with others - wait and see.  For instance, with the new changes in scoring, nobody's mentioning the \"lower your threat to 0\" strategy for winning - even though it still works (it's just not score effective).  Let some people try out the \"Ziggy\" deck and see how it does - and how well it scores. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583868","commentId":583868,"userName":"Glaurung","timestamp":1327364421,"content":"Hey Dudes dont think please if they are Designers and working in such a big company like FFG so they cannot make mistake. If you look on the history of this game(im here since may2011) there is a lot of mistake already. The card game text terms not same as other (quite stupid already), Nazgul od Dol-Fuldor get errata after 1 month game was release, Very stupid score system (after update 10 points for 1 round start to be better) why cannot do it from begin???SO it mean they dont test it enough or maybe just was lazy. They are just a people. And in my experience only MTG designers hold the real cool level of proff. At least was like this 10 years before, now i dont know.\n\nCard like Trackers, Will of the West, Beravur( crazy unlimited draw) and now new broken Ziggy. Very true what Boored say: Tracker destroy all idea of the TRAVEL PHASE!!!! But for the novice players he can be a good help. So i think there should be some kind of Restricted list for the Tournament play and for the Experienced players. And they will do it cose community is growing with amount of players and with old players experience grow up too so they must to give them something for challenge otherwise they start to look for this challenge somewhere else.\n\nNightmare mode:  IS suppose to be challenge for expert players but in the end even with correction(FAQ1.0) is still very stupid and no one really play it cose is boring and even more easy then normal game. Again mistake???\n\nThere is also one big problem of this game is scaling. Very difficult to make quest and have the same challenge for different amount of players.You must test to much!!! There is a ton of work!!! So is no wonder they make it with a half power. And why they must work to hard???? The game sales good, there is no other Lotr card game, people will play anyway.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583873","commentId":583873,"userName":"radiskull","timestamp":1327365996,"content":" FFG is actually a fairly small company, employee-wise.  I think they have something like 80 employees TOTAL, and probably only 3-5 working on LoTR, not counting playtesters, which are likely volunteers.  I don't know how that changes things, but I thought I'd throw that out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583924","commentId":583924,"userName":"jhaelen","timestamp":1327376495,"content":"I'm not really worried about cards 'breaking' the game considering its casual, cooperative nature, but I have to agree that the Zigil Miner is a card that doesn't appear to be particularly well-thought-out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583928","commentId":583928,"userName":"starhawk77","timestamp":1327378202,"content":"If and when FFG actually organizes a tournament scene, I wouldn't be surprised to see a short banned/restricted list. Alternately, the proposed format of the tournaments themselves might limit the effectiveness of cards like Zigil Miner. Since tournaments will supposedly feature entirely new scenarios, those encounter decks could feature all kinds of nasty ways to destroy the Miner or otherwise prevent resource acceleration.\n\nUntil then, Zigil Miner is fine. If it creates a negative player experience for you, then try something different. If you enjoy using it despite its supposed \"brokenness,\" then that's perfectly fine. It's your game. \n\nRegarding design negligence, that's just something that happens in card games. Pretty much every great card game has a banned/restricted list or some similar method of removing problematic cards from competitive play. No matter how smart or dumb the designers seem to be, there are always card interactions that seem to escape playtesting. If it becomes a problem, they will ban, errata, or restrict it in the eventual tournament format.\n\nIs it overpowered in a competitive environment? Maybe. I think Miner decks win reliably, but I don't know that their scores exceed those posted by, say, a Rohan deck that just blows through a quest. I'd like to see the Miner deck function in an actual tournament before passing judgment. If Miner turns out to ruin the tourney scene, it will get banned, and life will go on. One way or the other, the game will endure. The sky is not falling (although, if you are playing one of the Khazad-Dum scenarios, you may be at risk of a Cave In)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583937","commentId":583937,"userName":"leptokurt","timestamp":1327381683,"content":"Not sure why everyone thinks that Northern Tracker is game breaking. He's useless against Rhosgobel and RtM, you don't really need him against Carrock or Dead Marshes. He shines against Emyn Muil, ok, and he's a great help against HfG. WIth the new spirit cards added during the Mirkwood cycle, and the new locations that often have 3+ points to explore, he's becoming less useful as he originally was.\n\n \n\nThat's especially true if you stick to play with one coreset only - and I really hope they design the game for those who use one coreset only, cause that's the way it's meant to be. Using one corset even Beravor isn't overpowered, as you have only one UC in your deck. You only have two copies of SoG and GG etc.\n\nGetting yourself an extra advantage by using more than one coreset and then complaining that the game is way too easy I do find hilarious. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583955","commentId":583955,"userName":"SiCK_Boy","timestamp":1327384115,"content":"Ther version I deem \"win all\" is based on 2 player games. I'm not certain how powerful the miner is in solo play since, as it was mentionned, you need a full deck designed around it with mostly 5-cost cards. But if they keep printing those 5 cost cards (especially if they ever release non-unique allies), and one would think we'll see a few more here and there, it could become just as powerful in solo.\n\nSee the Miner + Dwarf God thread for examples of decks that can win consistently against all scenarios.\n\nThe deck doesn't need Gildor at all. He's just an added benefit once you get it in play. And getting one of those 3 miners in your starting hand, when you have a free mulligan plus Bilbo and Beravor (the miner deck should always be first player to benefit from Bilbo on the very first turn), the odds are on your side. If you don't have him, you can also try a quick Gandalf sneaking in to let you draw 3 more.\n\nI just ran through the whole gauntlet and, score wise, I did a better average than what the quest log is showing for the community, but I can't say how reliable that is. It's true that the tournament scoring system may eventualy rule Zigil out as a winning strategy, but I doubt it. The deck runs fast: when you get 20 resources in a couple turns, you play all your hand quickly and you can certainly beat the encounter deck in a minimum of time. The only tournament rule I could see preventing the use of Zigil is if you can't make up your team in advance, but need to pick your deck in advance (because 2 players with the same miner support deck obviously wouldn't be able to win).\n\nBut the comments I'm seeing about potential upcoming stuff (for example, the game centering around either being in secrecy mode or requiring massive resource use) confirms the trend I'm afraid of. If, over the next few AP, the only viable solution is to hand access to massive resources, then it reinforces the feeling that Miner is the only viable strategy. I don't think we'll see it.\n\nAs for the game being designed from a single core set perspective, I admit its probably the way they approach it. Still, it shouldn't prevent them from thinking about it and the possibilities it offers. We've seen enough complain about the cards distribution in the core set to know that many player either own or wished they owned multiple core sets. Simply ignoring this fact is bad design. The game is conceived to be fun with a single core set, which it is, but the rules allow 3 of each player cards; not 3 of each player cards except for those from the core set. If they want to change the rules to that format, they could (I don't think they would by then because of the outcry from those who already own multiple core sets).\n\nFor those who don't believe the decks are that powerful, give it a try if you can. If you've never played with Fortune or Fate or Beorn's Hospitality before (I certainly hadn't done it myself before trying this deck), you cannot see fully the power it represents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=583977","commentId":583977,"userName":"richsabre","timestamp":1327390256,"content":"ffg is obviously interested in this whole topic, i mean ive only ever seen admin come in once, on this thread......coincidence??? i dont think so....especially after booored was poking a bit of fun their way\n\ni STILL think they have a way to solve this....those are my guns and im sticking with it, call me crazy stupid if you want, im used to it lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=584091","commentId":584091,"userName":"booored","timestamp":1327404202,"content":"leptokurt said:\n\n \n\nNot sure why everyone thinks that Northern Tracker is game breaking. He's useless against Rhosgobel and RtM, you don't really need him against Carrock or Dead Marshes. He shines against Emyn Muil, ok, and he's a great help against HfG. WIth the new spirit cards added during the Mirkwood cycle, and the new locations that often have 3+ points to explore, he's becoming less useful as he originally was.\n\n \n\nI do not think people think Tracker is game breaking... though he is powerful. What we are talking about is that Northern Tracker negates an entire phase of the game. The Travel Phase. When you run tracker, you simply never travel anywhere. In a multiplayer game it is not uncommon to get 3, sometimes 4 on the table, and you only really need 2 on the table to make traveling pretty much anywhere unnecessary. The reason some people do not like this is that it is changing the fundamentals of the game, removing and making unnecessary the entire travel phase. The travel phase \"should\" imo, be one of the key decision points in a turn when you make a decision to travel weighing negitive / positive effects vs staging area threat and possibly staging area effects. That decisions is completely removed, thus making the game degrees and degrees easier.\n\nOh course when you can quest for 15 a turn just off a single map maker card.. well in a way that completely destroys the travel phase as well. \"Go Miner!\" :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nstarhawk77 said:\n\n \n\nSince tournaments will supposedly feature entirely new scenarios, those encounter decks could feature all kinds of nasty ways to destroy the Miner or otherwise prevent resource acceleration.\n\n\nI didn't think of that, but I guess that was what Massing was, and it would also give them a new print on demand product each time as well.. this could very well be true. Though the \"supposed\" torny scene is not much of an issue to me personally. Still if this is true they could design spesific quest to ruin common strats, but this might be unfair?\n\n \n\nSiCK_Boy said:\n\nIf you don't have him, you can also try a quick Gandalf sneaking in to let you draw 3 more.\n\n \n\nwow, you know I totally forgot about his 3rd ability. I use him for threat almost exclusively but sometimes use the dmg.. but I have nvr once used his card draw.. and in fact totally forgot about it lol\n\nSiCK_Boy said:\n\n \n\nI just ran through the whole gauntlet and, score wise, I did a better average than what the quest log is showing for the community, but I can't say how reliable that is. It's true that the tournament scoring system may eventualy rule Zigil out as a winning strategy, but I doubt it. The deck runs fast: when you get 20 resources in a couple turns, you play all your hand quickly and you can certainly beat the encounter deck in a minimum of time. The only tournament rule I could see preventing the use of Zigil is if you can't make up your team in advance, but need to pick your deck in advance (because 2 players with the same miner support deck obviously wouldn't be able to win).\n\n \n\nIn 2+ players.. I do not think it is even possible to loose, when you have a full card pool to choose from. I have also been playing it solo and it works fine there as well, I haven't lost a single quest so far, apart from RETURN due to he extremely fast clock it has though a small change to a more rabbit style deck finished that off. I think it was you who said it.. but the \"one deck to rule them all\" search is pretty much over for 2 player, and almost solved for solo. Oh that solo quest includes Dol GolDor, I mean who cares if you only have two heros when you can get Beorn + a tracker out in turn 1 even with 2 heroes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=584137","commentId":584137,"userName":"Glaurung","timestamp":1327408944,"content":"You know what i want to say dudes. I love this disscus...... Cose when i start to talk about problem of the game 4 or 5 months before and pointed some stupid mistakes of designers most of the players has talk: Hey Gaurung you talk to much and game is great, if you dont like just dont play. But now is see more and more players start to see all this problem and wake up more and more...... We like the game we just want to make it better. And is going right way........."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=584189","commentId":584189,"userName":"TragicTheBlathering","timestamp":1327414312,"content":"I agree with comments on Ziggy's power, but what no one has seamed to comment on is that he is super fun to play with... The Ziggy deck is powerful, but fun, and that is what a game is for; to have fun.\n\nYou can custom the game to fit your own challenge level, run a self made ban list or rule thing like booored... but imo... Ziggy is awesome fun and that card and this deck alone has made me replay the entire LoTR game from scratch, going back to quests like Gul DulGor witch I haven't picked up from the original days of core..\n\nZiggy is fun.. so he is awesome... do not like him, do not play with him.\n\nThis is Kent Brockman and that was my 2 cents.,\n \n\nyou guys take it to seriously [http://www1.picturepush.com/photo/a/7414554/640/7414554.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=584192","commentId":584192,"userName":"starhawk77","timestamp":1327414854,"content":"TragicTheBlathering said:\n\nI agree with comments on Ziggy's power, but what no one has seamed to comment on is that he is super fun to play with... The Ziggy deck is powerful, but fun, and that is what a game is for; to have fun.\n\nYou can custom the game to fit your own challenge level, run a self made ban list or rule thing like booored... but imo... Ziggy is awesome fun and that card and this deck alone has made me replay the entire LoTR game from scratch, going back to quests like Gul DulGor witch I haven't picked up from the original days of core..\n\nZiggy is fun.. so he is awesome... do not like him, do not play with him.\n\nThis is Kent Brockman and that was my 2 cents.,\n \n\nyou guys take it to seriously [http://www1.picturepush.com/photo/a/7414554/640/7414554.jpg]\n\n\n\nTotally agree. If you have fun obliterating scenarios with Zigil Miner, then more power to you. I have fun using him, so I play with him. When I no longer enjoy using him, I will stop. The card itself might need to be addressed come tourney time, but we'll cross that bridge when we come to it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=584233","commentId":584233,"userName":"muemakan","timestamp":1327419960,"content":"The possibility of generating an infinite number of resources in just on phase seems a little overpowered, but nobody has to play like that. And I am sure as we eventually see a tournament environment they will address this in some way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=584357","commentId":584357,"userName":"cordeirooo","timestamp":1327437942,"content":"Glaurung said:\n\nYou know what i want to say dudes. I love this disscus...... Cose when i start to talk about problem of the game 4 or 5 months before and pointed some stupid mistakes of designers most of the players has talk: Hey Gaurung you talk to much and game is great, if you dont like just dont play. But now is see more and more players start to see all this problem and wake up more and more...... We like the game we just want to make it better. And is going right way.........\n\n\n\n \n\nThan you so much for your seer visions. You enlighten us all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585518","commentId":585518,"userName":"Iver2","timestamp":1327645472,"content":"leptokurt said:\n\n[....]\n\n That's especially true if you stick to play with one coreset only - and I really hope they design the game for those who use one coreset only, cause that's the way it's meant to be. Using one corset even Beravor isn't overpowered, as you have only one UC in your deck. You only have two copies of SoG and GG etc.\n\nGetting yourself an extra advantage by using more than one coreset and then complaining that the game is way too easy I do find hilarious. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n\n\nI cannot stress how much true that is guys...honestly, I think the FFG did not setup rules to limit for instance UC or SoG to one card per game because they would  not imagine that some people would acctually just buy another one or even two core sets to:\n\n1.break the game\n\n2. have those unique cards 3 times in their deck (maybe there was a REASON behind the fact, that they were included only ONE time in the core set, don't you think?!)\n\nNo offence, but just sell your 10 excess core sets and it will save us all those \"game is too easy...\"  \"Nothern Tracker game breaking...\" discussions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585658","commentId":585658,"userName":"richsabre","timestamp":1327666301,"content":"Iver said:\n\n \n\nleptokurt said:\n\n \n\n[....]\n\n That's especially true if you stick to play with one coreset only - and I really hope they design the game for those who use one coreset only, cause that's the way it's meant to be. Using one corset even Beravor isn't overpowered, as you have only one UC in your deck. You only have two copies of SoG and GG etc.\n\nGetting yourself an extra advantage by using more than one coreset and then complaining that the game is way too easy I do find hilarious. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n \n\nI cannot stress how much true that is guys...honestly, I think the FFG did not setup rules to limit for instance UC or SoG to one card per game because they would  not imagine that some people would acctually just buy another one or even two core sets to:\n\n1.break the game\n\n2. have those unique cards 3 times in their deck (maybe there was a REASON behind the fact, that they were included only ONE time in the core set, don't you think?!)\n\nNo offence, but just sell your 10 excess core sets and it will save us all those \"game is too easy...\"  \"Nothern Tracker game breaking...\" discussions.\n\n \n\n \n\nive long argued against people giving new comers the whole GET A SECOND SET!! NOW!!!!!!! ARGGHGHHGHHGH....etc, as this gives the impression that\n\n1.you need a second set to win, which is false\n\n2.the game has a pay to win aspect which it doesnt\n\nHOWEVER, i do understand the options it opens up, its nice to have 3 copies, i wish i had 3 UCs but the cost and the potential waste of encounter cards just doesnt hold up\n\ni do have to laugh though when i see a post where people who have 3 UCs/ 3 northern trackers say the quests are too easy, and then go and house rule things, i mean if it aint broke dont fix it, and this aint broke, but yeah, i sort of cover my opinions of player competence vs difficulty of quests vs card pool vs past experience in my other debate post"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585707","commentId":585707,"userName":"Rince","timestamp":1327672558,"content":"My fear about this combo is that if it indeed results in a high win-ratio, then the developers might feel to address it with harder quests or, even worse, quests that specifically target this combo. If such \"solution\" should come into existence, it could easily prove game-breaking for those who chose not to play with Ziggy; the whole game balance can quickly go down the toilet. And unfortunately, FFG does not have a great track record at play testing (unfortunately they make a lot of stupid mistakes); so, I sincerely hope that it will never come to that, and this topic is just alarmist! FFG is really great at designing games, but when it comes to production..., well, let's not get into that. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585735","commentId":585735,"userName":"richsabre","timestamp":1327675491,"content":"Rince said:\n\nMy fear about this combo is that if it indeed results in a high win-ratio, then the developers might feel to address it with harder quests or, even worse, quests that specifically target this combo. If such \"solution\" should come into existence, it could easily prove game-breaking for those who chose not to play with Ziggy; the whole game balance can quickly go down the toilet. And unfortunately, FFG does not have a great track record at play testing (unfortunately they make a lot of stupid mistakes); so, I sincerely hope that it will never come to that, and this topic is just alarmist! FFG is really great at designing games, but when it comes to production..., well, let's not get into that. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n\n\nmmmm, would they do that though? create a quest that basically forces you to use a specific deck and thus destroys the whole point of the game-deckbuilding.....yes it would be game breaking but i cant see them doing that....i mean they wouldnt exactly be getting any brownie points would they..more than that it would **** well p*ss alot of people off - me included .well i certainly hope they wouldnt, i havnt used that deck yet and i dont intend to"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585737","commentId":585737,"userName":"cordeirooo","timestamp":1327675829,"content":"Well, the Secrecy thing seems to go that way IF they are not worth their true price (without secrecy reducing cost). \n\nJust hope the 5-Cost cards with secrecy do stuff more impressive than the actual 5-Cost cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585746","commentId":585746,"userName":"richsabre","timestamp":1327676529,"content":"cordeirooo said:\n\n \n\nJust hope the 5-Cost cards with secrecy do stuff more impressive than the actual 5-Cost cards.\n\n\n\ni would hope so"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585765","commentId":585765,"userName":"SiCK_Boy","timestamp":1327678626,"content":"Won't start arguing over the merits (or lack of) of owning multiple core sets. That wasn't the point of this thread and to each his opinion on the topic (but since I'm not going around calling people names or laughing at them for NOT owning multiple Core Sets, I'd appreciate that the same courtesy be applied to those who do own them).\n\nBut the more I've been thinking about the potential abuse of Zigil Miner, the more afraid I am. Honestly, in order to make this an almost auto-win solo, all that's really missing is a good 5-cost non-unique ally. Even a so-so 5-cost non-unique ally would be great. Because right now, the main issue for the Zigil deck (in my 2 players setup) is that it can only play its 3 heroes, 3 Zigil Miner, 1 Gildor Inglorion, 1 Radagast, Gandalf and Landroval. It doesn't contain other allies, so it really counts on the second deck to provide the bulk of the questing power and army. If there were one or two 5-cost allies, it'd become more self-sufficient. Even getting \"better\" 5-cost spells (such as Grim Resolve) will improve the deck.\n\nThat's the main worry I have. I just don't see this deck getting worse except if they start designing quests around it. And if they do, it'll be a sign that there was a design mistake in the first place, but it'll also probably cause unexpected impact on other deck strategies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585773","commentId":585773,"userName":"richsabre","timestamp":1327679615,"content":"SiCK_Boy said:\n\n \n\nif they start designing quests around it. And if they do, it'll be a sign that there was a design mistake in the first place, but it'll also probably cause unexpected impact on other deck strategies.\n\n \n\n \n\ni really hope they dont, it would be unbelievably restrictive, i mean hundreds of cards, and a quest has to revolve around 1? someones not getting something right somewhere\n\n i was really hoping to sit on the side and watch all this zigil stuff from a distance.....annoying"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585777","commentId":585777,"userName":"booored","timestamp":1327679942,"content":"richsabre said:\n\nive long argued against people giving new comers the whole GET A SECOND SET!! NOW!!!!!!! ARGGHGHHGHHGH....etc, as this gives the impression that\n\n1.you need a second set to win, which is false\n\n\nyeah right.. that is why new players like 17th Knight are tearing their hair out on Journey.\n\nSiCK_Boy said:\n\nWon't start arguing over the merits (or lack of) of owning multiple core sets. That wasn't the point of this thread and to each his opinion on the topic (but since I'm not going around calling people names or laughing at them for NOT owning multiple Core Sets, I'd appreciate that the same courtesy be applied to those who do own them).\n\nBut the more I've been thinking about the potential abuse of Zigil Miner, the more afraid I am. Honestly, in order to make this an almost auto-win solo, all that's really missing is a good 5-cost non-unique ally. Even a so-so 5-cost non-unique ally would be great. Because right now, the main issue for the Zigil deck (in my 2 players setup) is that it can only play its 3 heroes, 3 Zigil Miner, 1 Gildor Inglorion, 1 Radagast, Gandalf and Landroval. It doesn't contain other allies, so it really counts on the second deck to provide the bulk of the questing power and army. If there were one or two 5-cost allies, it'd become more self-sufficient. Even getting \"better\" 5-cost spells (such as Grim Resolve) will improve the deck.\n\nThat's the main worry I have. I just don't see this deck getting worse except if they start designing quests around it. And if they do, it'll be a sign that there was a design mistake in the first place, but it'll also probably cause unexpected impact on other deck strategies.\n\n\nWell .. . you have Beorn... a single card that hits for 15... and costs 6. Not exactly a \"bad\" ally.. and with Stand and Fight you can play anything from any graveyard. (at event speed no less)\n\nStill, I think you are right.. I haven't been experimenting with Ziggy for a while now, as I am waiting for my 3 play group to get into it, then I want to try running it.. though it is a support deck still. No question. If they drop some good 5 point allies then it will be crazy.. remember secrecy might mean a lot of high printed cost cards. Then it will get super crazy.\n\nAs for solo play, when I was testing it could thrash everything, even solo massing and Journey, with out any trouble. The only quest solo is sucked at was Return, but that quest IS broken for single player imo anyway. Still in my solo decks I am running a lot of 4 cost allies as well. BeeKeeper is awesome, I've done players were I have cast him and discarded him 3 times in one turn lol... Another great play is that Orc guy that drops 1 dmg on all orc... fantastic for Kaz... just sack him to a monster and pull back at instant speed to add more dmg.\n\nThe ziggy deck needs Stand and Fight and Will of the West to function... it is all about cycling your six 6 cost cards and stand and fights."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585781","commentId":585781,"userName":"richsabre","timestamp":1327680266,"content":"booored said:\n\nrichsabre said:\n\nive long argued against people giving new comers the whole GET A SECOND SET!! NOW!!!!!!! ARGGHGHHGHHGH....etc, as this gives the impression that\n\n \n\n1.you need a second set to win, which is false\n\n \n\nyeah right.. that is why new players like 17th Knight are tearing their hair out on Journey.\n\n\n\nso you saying you need a 2nd copy then??? do you not think that maybe becuase he/she is new? i would like to see someone who can beat journey after just picking up the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585795","commentId":585795,"userName":"cordeirooo","timestamp":1327681098,"content":"richsabre said:\n\nbooored said:\n\n \n\nrichsabre said:\n\nive long argued against people giving new comers the whole GET A SECOND SET!! NOW!!!!!!! ARGGHGHHGHHGH....etc, as this gives the impression that\n\n \n\n1.you need a second set to win, which is false\n\n \n\nyeah right.. that is why new players like 17th Knight are tearing their hair out on Journey.\n\n \n\n \n\nso you saying you need a 2nd copy then??? do you not think that maybe becuase he/she is new? i would like to see someone who can beat journey after just picking up the game\n\n\n\n \n\nI did.\n\nI still do not believe you need another set to play the game. If you want to have a walk in the park, go ahead and buy two or three more; it's all about choice. There is nothing wrong in playing the game with just one core, as much as there is nothing wrong in playing with more than one.\n\n \n\nDoes this discussion really have any merit, btw?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585796","commentId":585796,"userName":"richsabre","timestamp":1327681751,"content":"cordeirooo said:\n\n \n\n\n\n\nDoes this discussion really have any merit, btw?\n\n \n\n \n\nif i do not think something has any merit, i do not post. i have better things to do trust me, if someone says something i disagree with i will post my opinions on it\n\nalso the majority of newcomers could not win journey off the top of their head without trying a few times, im not saying no one can"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585810","commentId":585810,"userName":"cordeirooo","timestamp":1327682677,"content":"richsabre said:\n\ncordeirooo said:\n\n \n\n\n\n\nDoes this discussion really have any merit, btw?\n\n \n\n \n\nif i do not think something has any merit, i do not post. i have better things to do trust me, if someone says something i disagree with i will post my opinions on it\n\nalso the majority of newcomers could not win journey off the top of their head without trying a few times, im not saying no one can\n\n\n\n \n\nActually, I'm talking about the 'you must have x cores to play'.\n\nI still do not believe it has merits. Anyone can play anyway they want, you (or any other) do not have any authority to say how someone must play the game.\n\n \n\nAlso, I'm not telling you not to post, I'm asking a honest question and your answer does not address it. \"I have better things to do, trust me\" isn't enough, you're not infallible and, no, I do not have to trust you.\n\n \n\nAbout the Journey... So what? I know a good bunch of people who did, and another good that don't... What's the point? :S\n(Also, it's good to say that there is a mix of 1, 2 and 3 cores between this both groups of people - another evidence to the meritlessness (I don't believe this word exists, but ok. haha) of the need of more than one core to play)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585835","commentId":585835,"userName":"Bohemond2","timestamp":1327686302,"content":"cordeirooo said:\n\nActually, I'm talking about the 'you must have x cores to play'.\n\n\n\nWho has said this?  You are making up a strawman argument that has completely derailed this thread?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585844","commentId":585844,"userName":"richsabre","timestamp":1327687108,"content":"cordeirooo said:\n\n \n\nrichsabre said:\n\n \n\ncordeirooo said:\n\n \n\n\n\n\nDoes this discussion really have any merit, btw?\n\n \n\n \n\nif i do not think something has any merit, i do not post. i have better things to do trust me, if someone says something i disagree with i will post my opinions on it\n\nalso the majority of newcomers could not win journey off the top of their head without trying a few times, im not saying no one can\n\n \n\n \n\n \n\nActually, I'm talking about the 'you must have x cores to play'.\n\nI still do not believe it has merits. Anyone can play anyway they want, you (or any other) do not have any authority to say how someone must play the game.\n\n \n\nAlso, I'm not telling you not to post, I'm asking a honest question and your answer does not address it. \"I have better things to do, trust me\" isn't enough, you're not infallible and, no, I do not have to trust you.\n\n \n\nAbout the Journey... So what? I know a good bunch of people who did, and another good that don't... What's the point? :S\n(Also, it's good to say that there is a mix of 1, 2 and 3 cores between this both groups of people - another evidence to the meritlessness (I don't believe this word exists, but ok. haha) of the need of more than one core to play).\n\n \n\n \n\n \n\ni believe this has all the merit in the world, given that - and yes i have seen this done- newcomers are given false advice that is completely misleading\n\nimagine youve just bought the game, lost alot like most newcomers do which is just natural progression, then someone pipes up and says- you should really get a second core set....what?? i mean imagine how confused that person will be after looking at the 1-2 player promise on the box. then they find out they need to fork out on another £25\n\nas long as this advice is being given i will go against it, it is what i believe- this is an opinion forum, and without different opinions it would have no point in being here\n\nalso 'trust me' is a phrase....im not sure where you are from but in the western world everyone over 10 knows what it means, addressing it as a direct request is obviously not what you believe it to be and must be a push to get me to argue pointlessly with you -something after this post i am not going to do\n\nlast my reference to rhosogobel is regarding booreds comment about a user who is having trouble with it, and boored implied that he/she is doing so because of a lack of a 2nd core set, something, and this is my 2nd time saying this- is completely false\n\ni am not here to argue with people, i give my opinion, and do so in a respectful manner, so i am not sure why you think i am having a meritless arugment, i am not sure what is happening to this forum, it appears you cannot post something anymore without getting a good flamin'"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585852","commentId":585852,"userName":"cordeirooo","timestamp":1327688213,"content":"Bohemond said:\n\ncordeirooo said:\n\n \n\nActually, I'm talking about the 'you must have x cores to play'.\n\n \n\n \n\nWho has said this?  You are making up a strawman argument that has completely derailed this thread?\n\n\n\n \n\nI have no idea what is a 'strawman argument' and I did not derailed the thread. I do not know if you are able to read any posters above mine, but, this is already at the third page and I wasn't the first one to bring this up. U mad?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585853","commentId":585853,"userName":"booored","timestamp":1327688247,"content":"richsabre said:\n\n \nlast my reference to rhosogobel is regarding booreds comment about a user who is having trouble with it, and boored implied that he/she is doing so because of a lack of a 2nd core set, something, and this is my 2nd time saying this- is completely false\n\n\n\nI'm going to move back to this thread... Good deck for A Journey to Rhosgobel [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=605608]\n\nrichsabre said:\n\ni am not here to argue with people, i give my opinion, and do so in a respectful manner, so i am not sure why you think i am having a meritless arugment, i am not sure what is happening to this forum, it appears you cannot post something anymore without getting a good flamin'\n\n\n\ndo not worry richsabre your one of the best chatters on the forum.. just keep doing what your doing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585857","commentId":585857,"userName":"cordeirooo","timestamp":1327688946,"content":"richsabre said:\n\ncordeirooo said:\n\n \n\nrichsabre said:\n\n \n\ncordeirooo said:\n\n \n\n\n\n\nDoes this discussion really have any merit, btw?\n\n \n\n \n\nif i do not think something has any merit, i do not post. i have better things to do trust me, if someone says something i disagree with i will post my opinions on it\n\nalso the majority of newcomers could not win journey off the top of their head without trying a few times, im not saying no one can\n\n \n\n \n\n \n\nActually, I'm talking about the 'you must have x cores to play'.\n\nI still do not believe it has merits. Anyone can play anyway they want, you (or any other) do not have any authority to say how someone must play the game.\n\n \n\nAlso, I'm not telling you not to post, I'm asking a honest question and your answer does not address it. \"I have better things to do, trust me\" isn't enough, you're not infallible and, no, I do not have to trust you.\n\n \n\nAbout the Journey... So what? I know a good bunch of people who did, and another good that don't... What's the point? :S\n(Also, it's good to say that there is a mix of 1, 2 and 3 cores between this both groups of people - another evidence to the meritlessness (I don't believe this word exists, but ok. haha) of the need of more than one core to play).\n\n \n\n \n\n \n\ni believe this has all the merit in the world, given that - and yes i have seen this done- newcomers are given false advice that is completely misleading\n\nimagine youve just bought the game, lost alot like most newcomers do which is just natural progression, then someone pipes up and says- you should really get a second core set....what?? i mean imagine how confused that person will be after looking at the 1-2 player promise on the box. then they find out they need to fork out on another £25\n\nas long as this advice is being given i will go against it, it is what i believe- this is an opinion forum, and without different opinions it would have no point in being here\n\nalso 'trust me' is a phrase....im not sure where you are from but in the western world everyone over 10 knows what it means, addressing it as a direct request is obviously not what you believe it to be and must be a push to get me to argue pointlessly with you -something after this post i am not going to do\n\nlast my reference to rhosogobel is regarding booreds comment about a user who is having trouble with it, and boored implied that he/she is doing so because of a lack of a 2nd core set, something, and this is my 2nd time saying this- is completely false\n\ni am not here to argue with people, i give my opinion, and do so in a respectful manner, so i am not sure why you think i am having a meritless arugment, i am not sure what is happening to this forum, it appears you cannot post something anymore without getting a good flamin'\n\n\n\nrichsabre said:\n\ncordeirooo said:\n\n \n\nrichsabre said:\n\n \n\ncordeirooo said:\n\n \n\n\n\n\nDoes this discussion really have any merit, btw?\n\n \n\n \n\nif i do not think something has any merit, i do not post. i have better things to do trust me, if someone says something i disagree with i will post my opinions on it\n\nalso the majority of newcomers could not win journey off the top of their head without trying a few times, im not saying no one can\n\n \n\n \n\n \n\nActually, I'm talking about the 'you must have x cores to play'.\n\nI still do not believe it has merits. Anyone can play anyway they want, you (or any other) do not have any authority to say how someone must play the game.\n\n \n\nAlso, I'm not telling you not to post, I'm asking a honest question and your answer does not address it. \"I have better things to do, trust me\" isn't enough, you're not infallible and, no, I do not have to trust you.\n\n \n\nAbout the Journey... So what? I know a good bunch of people who did, and another good that don't... What's the point? :S\n(Also, it's good to say that there is a mix of 1, 2 and 3 cores between this both groups of people - another evidence to the meritlessness (I don't believe this word exists, but ok. haha) of the need of more than one core to play).\n\n \n\n \n\n \n\ni believe this has all the merit in the world, given that - and yes i have seen this done- newcomers are given false advice that is completely misleading\n\nimagine youve just bought the game, lost alot like most newcomers do which is just natural progression, then someone pipes up and says- you should really get a second core set....what?? i mean imagine how confused that person will be after looking at the 1-2 player promise on the box. then they find out they need to fork out on another £25\n\nas long as this advice is being given i will go against it, it is what i believe- this is an opinion forum, and without different opinions it would have no point in being here\n\nalso 'trust me' is a phrase....im not sure where you are from but in the western world everyone over 10 knows what it means, addressing it as a direct request is obviously not what you believe it to be and must be a push to get me to argue pointlessly with you -something after this post i am not going to do\n\nlast my reference to rhosogobel is regarding booreds comment about a user who is having trouble with it, and boored implied that he/she is doing so because of a lack of a 2nd core set, something, and this is my 2nd time saying this- is completely false\n\ni am not here to argue with people, i give my opinion, and do so in a respectful manner, so i am not sure why you think i am having a meritless arugment, i am not sure what is happening to this forum, it appears you cannot post something anymore without getting a good flamin'\n\n\n\n \n\nI'm not sure you are reading what I write, because... Well, we are agreeing, and you keep trying to make me agree with you. What?\n\n \n\nAbout the 'trust me', I do understand what it means, and, the meaning of it is exactly that, 'you do not need proofs, just to take my word for it' and I do not. For a simple reason: We do not know each other. I do respect you though, that's the reason I'm discussing with you.\n\n \n\nAs someone said before, you're posting in a forum, you're going to get replies, whether you like it or not. Again, I am direct when I talk, I do not mean you no harm and really wish you have tons of fun, but I won't talk to you like I do with my gf or my little brother.\n\n \n\nAnd for the last time, I do respect you, no need to hold grudges. I'm saying that this is a pointless argument because there'll be no consensus between the two sides; both have good arguments. It is nice that you stand for your point, this is very good, but I don't believe you should keep arguing for the same reason you don't want to discuss with me.\n\n \n\nSorry if you feel it is flaming, but it is not. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585863","commentId":585863,"userName":"richsabre","timestamp":1327689337,"content":"cordeirooo said:\n\nI'm not sure you are reading what I write, because... Well, we are agreeing, and you keep trying to make me agree with you. What?\n\n \n\nAbout the 'trust me', I do understand what it means, and, the meaning of it is exactly that, 'you do not need proofs, just to take my word for it' and I do not. For a simple reason: We do not know each other. I do respect you though, that's the reason I'm discussing with you.\n\n \n\nAs someone said before, you're posting in a forum, you're going to get replies, whether you like it or not. Again, I am direct when I talk, I do not mean you no harm and really wish you have tons of fun, but I won't talk to you like I do with my gf or my little brother.\n\n \n\nAnd for the last time, I do respect you, no need to hold grudges. I'm saying that this is a pointless argument because there'll be no consensus between the two sides; both have good arguments. It is nice that you stand for your point, this is very good, but I don't believe you should keep arguing for the same reason you don't want to discuss with me.\n\n \n\nSorry if you feel it is flaming, but it is not. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nok, no harm done, its late here and i may have read your post wrong, and if i have then i apologise, but either way i reckon we've burned this one out gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585972","commentId":585972,"userName":"Rince","timestamp":1327715229,"content":"Topic got a little distracted from the main argument, but I too feel like giving my two cents on this multiple core sets issue.\n\nI personally don't have a problem with people purchasing more core sets, I do however have a problem with FFG who made this option viable for these people. By putting useful cards in limited quantities into the core set, they encourage players to buy new ones, ending up with a crapload of less useful--or totally useless--cards. Unlike CCG-s, however, this game does not have an active single-card market. And even if it did, who would want to buy, for instance, the encounter decks of the core set again? So basically the owners of multiple core sets end up paying 40 or 80 bucks for only 4-5 cards. That is not cheap!\n\nWhen I first heard of the LCG format, I too was hopeful that it might be the next evolutionary step after CCGs. But it quickly turned out that if I wanted all the useful(!) cards, I would have to pay a lot more than I pay for my Magic the Gathering cards. Beside LOTR, I am also an active Magic player, yet I never had to spend as much money on cards as on LCGs. Okay, I do keep away from the very expansive singles range (I do not buy singles for 40 bucks), but I never really felt the impact of that. The bulk of the useful Magic cards can be bought for 10-50 cents (1 dollar tops) from online shops, and I am quite successful with them even in organized competitive play. I spend about 20-30 dollars every 3 months (whenever they release a new expansion) and that is that. I am more or less up-to-date, which cannot be said about LOTR or other LCGs.\n\nBottom line, I don't feel that the LCG format in its current form delivers on its promise of being cheap and superior to CCGs. Of course, it would be different if all sets would indeed contain three copies of every card, but FFG cannot dismiss the potential revenue from people who are willing purchase multiple sets. So they they keep doing what they do now, in my opinion, undermining the basic principle of LCGs.\n\nBy the way, I am not complaining, more like thinking in writing. I am quite happy with LOTR so I am also happy to spend money on it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=585987","commentId":585987,"userName":"player1761766","timestamp":1327717725,"content":"I for one would relish the possibility of multiple encounter sets - I've just bought my second core set in order that I might have two of the Mirkwood quests permanently set-up so that I can go to them as and when I feel like it, and thought I'd pop in here before I go off to scour the internet to find someone selling more. So please, if anyone has multiple core sets and is willing to part with the encounter sets, let me know! (Of course, a side benefit is I finally get three copies of some cards, and an extra copy of some others, but that's not the prime motivating factor here for me).\n\nAs to the actual subject of this thread, I have been having some thoughts on this the past day or so that I thought I'd post for everyone's general amusement.\n\nThey way FFG have celebrated the Zigil Miner and the synergies possible has me thinking - hand on a minute, everyone is so quick to assume FFG just \"didn't think this through\", or something, and no-one seems to have thought of it from the other side, that maybe this is precisely what they planned for the card? That they have published a deck-list that embraces the possibilities can be seen as reactionary, I suppose, but I think instead they're just lulling us all into thinking \"oh no, look how ridiculous this game has gotten!\" or whatever the arguments are.\n\nStrikes me they've got some fresh hell in store for Dwarrowdelf, and are currently all laughing at the posts on here as they start to design the third cycle. For one thing, the new Ambush keyword, that discards two attachments every time you flip a card with it on, is only going to be the tip of the iceburg. Arwen has fairly decent stats and benefits for a free ally, essentially, so what's the betting Redhorn Gate will have some crushing penalties to any exhausted allies? She has some good benefits when she exhausts, but only 2HP to gamble with. Something like The Necromancer's Reach, but oh, so worse, and oh, so more frequent. Let's see your Zigil Miner decks thrive when you have to discard from play every exhausted ally, never to be recovered by such trifles as Will of the West!\n\nSomething that always struck me as a solo player is that I had to wait for an adventure pack or two before getting a card that could have really helped me on earlier scenarios. Like having Astonishing Speed in Hills of Emyn Muil, for instance. So maybe the Zigil Miner is merely one of these \"I could have used this card ages ago!\" type of cards, because they know he will very soon be of little use up against the looming might of Caradhas and all that lies beyond.\n\nSuch are my thoughts gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586078","commentId":586078,"userName":"mkultra","timestamp":1327737216,"content":"Rince said:\n\nBut it quickly turned out that if I wanted all the useful(!) cards, I would have to pay a lot more than I pay for my Magic the Gathering cards. Beside LOTR, I am also an active Magic player, yet I never had to spend as much money on cards as on LCGs.\n\nNo offense but I call bull.\n\nEven Richard Garfield would tell you that Magic (and all other CCGs) is a bigger money-sink than any LCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586092","commentId":586092,"userName":"SiCK_Boy","timestamp":1327739465,"content":"Please refrain from turning this thread into a debate about the cost of LCG or the worth of owning multiple Core sets.\n\nSpalanzani: So you are implying there could be a condition in future quests such as \"deal one damage to each ally as it exhausts\" or \"deal 1 damage to each ally exhausted at the end of combat\" or such, on a more frequent basis, that would make abusing the miner too risky?\n\nIt's possible they'll go that way. But if they do, they'll prove my point. If you have a single quest built this way, it's fine (meaning that this quest becomes more \"hero\" oriented; rather than relying on allies, you need to reply on heroes). But if they do a thing like that in multiple quests, on a regular basis, they'll not only attack Miner, but all kind of allies that were specificaly designed as being vulnerable because of their low hit points (Henamarth Riversong, Daughter of the Nimrodel, Silverlode Archer). Basically, it would render ALL 1 hp ally useless (except maybe for Snowbourn Scout).\n\nI don't think it'll become a \"staple\" encounter deck strategy, but it could complicate things a little bit.\n\nAnd let's think further: we're bound to see at some point a card offering damage cancellation (such as the effect of Frodo). It's been missing from the player's arsenal since the beginning of the game. When it does, we're back to square one..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586141","commentId":586141,"userName":"player1761766","timestamp":1327747749,"content":"That's pretty much what I think, yes. As a natural progression, the more allies there are available to be played in the game, I think it's likely there will be more treachery cards that will target allies rather than merely characters. Or perhaps, as the Dwarf subtheme begins to take off, maybe we'll see some more dwarf-hatred to try to balance it, I don't know. Succinctly put, I can't see them doing something to so grossly overbalance the game that has, up to now, proven to be quite balanced as it has progressed, without fighting back, as it were. I think it's quite obvious they're aware of what they've done by producing the Zigil Miner, and cards like Ring Mail will certainly help him in upcoming strategies should we get cards that target allies. Something like the Caradhas quest would also be able to do this quite thematically, too. For example, by not committing willpower to the quest you aren't allowed to take any actions next round (heroes and allies). Or maybe even discarding them - in effect, the mountain has beaten them, and they have been forced to turn back, abandoning your fellowship.\n\nI wouldn't say that producing cards that specifically attack allies is a direct response to the Zigil Miner though. There are other allies in the game that would be equally affected by that, after all. If there's some sort of card that forces you to discard (or deal impossible amounts of damage to) dwarven allies, then I might be a little more convinced.\n\nBut, without being glib about the whole thing, I accept that the company see it as a logical progression of a game they have created, so on the back of that I expect they have something in the works that will build on this, for better or worse.\n\nOh, and the damage-cancellation card is a good idea. The easy way for this would be to have it as \"Limited (only 1 card per deck\" type of thing, as has been done for a good while now in A Game of Thrones. This is something that hasn't really been seen in this game so far, and to tell the truth, I don't know how I'd feel about seeing it come in, being used to it from AGoT..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586144","commentId":586144,"userName":"richsabre","timestamp":1327747918,"content":"spalanzani said:\n\n \n\nThat's pretty much what I think, yes. As a natural progression, the more allies there are available to be played in the game, I think it's likely there will be more treachery cards that will target allies rather than merely characters. Or perhaps, as the Dwarf subtheme begins to take off, maybe we'll see some more dwarf-hatred to try to balance it, I don't know. Succinctly put, I can't see them doing something to so grossly overbalance the game that has, up to now, proven to be quite balanced as it has progressed, without fighting back, as it were. I think it's quite obvious they're aware of what they've done by producing the Zigil Miner, and cards like Ring Mail will certainly help him in upcoming strategies should we get cards that target allies. Something like the Caradhas quest would also be able to do this quite thematically, too. For example, by not committing willpower to the quest you aren't allowed to take any actions next round (heroes and allies). Or maybe even discarding them - in effect, the mountain has beaten them, and they have been forced to turn back, abandoning your fellowship.\n\nI wouldn't say that producing cards that specifically attack allies is a direct response to the Zigil Miner though. There are other allies in the game that would be equally affected by that, after all. If there's some sort of card that forces you to discard (or deal impossible amounts of damage to) dwarven allies, then I might be a little more convinced.\n\nBut, without being glib about the whole thing, I accept that the company see it as a logical progression of a game they have created, so on the back of that I expect they have something in the works that will build on this, for better or worse.\n\n \n\n \n\ni agree with some of those points, i have said from the start of these zigil deck emerging that i believe, and still do, that FFG has something in store for them (and might i add was mocked for proposing such foolerysorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]), i have not decided however if it will make the situation worse or better, and if i will like the outcome, guess ill just have to wait a few weeks for rehorn\n\nalso be assured that FFG are watching this discussion (ive only ever seen admin talk once in about 10 months on here), i think they have a keen interest in player opinions about zigil, and that it was no mistake."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586243","commentId":586243,"userName":"SiCK_Boy","timestamp":1327764033,"content":"Maybe they do, maybe they do... I'm afraid that whatever they come up with won't be enough to stop the miner without being ultra-targetted (ex: deak 1 damage to every spirit dwarf as it exaust; heroes cannot gain resources except during the resource phase) or having a destructive effect on multiple strategies at once (ex: dealing damage to any ally exhausting or using an action).\n\nAnd if they come up with an ultra-targeted response, it will confirm it was a mistake to do the card in the first place. If they just increase the power of the encounter deck, it may be the beginning of a major power creep.\n\nWe'll see... I hope to be able to revisit this thread once in a while as more player cards come up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586257","commentId":586257,"userName":"sensei yaourt","timestamp":1327766955,"content":"OK, first thing first, i own 5 core sets (i'm a collection entheusiast and hate playing with proxies) so i can have multiples decks at once and build every quests without needing to switch cards from one to the other ... and true enough, owning multiple sets make things easier. Putting everything in 3x in core set would have been highly ineffective tho, as it would have made the \"take it and play it\" decks from the core set way less efficient ... and the deal was you could start to play without deckbuilding ...\n\nBut i'll gladly send spare encounters deck if people need them, feel free to mail me.\n\nThat useless piece of trivia out of the way, i'll circle back to the zigil miner ...\n\n \n\nIn every CCG / LCG / TCG / anything else with cards and rules, strong cards are the one enableing you to break the standard rules : counterspells are nice cause they break the rule \"your opponent can play cards\", extra draw break the 1 card (or 2 card) per turn rule, tutor allow you to play cards you didn't draw because you went looking for them in your deck...\n\nThe more you circumvent the standard rulebook lines, the better the card is.\n\nI always thought Stewart of Gondor was a very strong cause it allowed you to produce 300% of the standard ressource production, Zigil miner is even worse, i won't argue with that.\n\nSooo, basically, until they print a card that break the rules even more than zigil miner, some will find it overpowered, some will find it abusive, some will want to ban / restrict / put an errata on it. That's perfectly normal, peoples have been screaming against Force of Will for years now (another MTG reference, sorry, i'm trying to stop, but kind of an addict).\n\n \n\nIs it completely game breaker ? For the time being, yes ... Man, i've spent countless hour trying to build a good 1 player deck and that dwarven rascal scores better than me an enable you to deal with the quests i'm having trouble completing ... me angry ...\n\nThe key word here is \"for the time being\" ... Bunch of you stated it already, but The Valar only know what FFG has in store for us.\n\n \n\nMy concern with some posts is about the part where they'll need to design cards specifically to address the Zigil-gate. That is not true (imho).\n\nThere are 3 types of card in the game (player-wise) : Equipements / Events / Allies.\n\nAllies being, by far (in sheer theory), the most potent of all, cause they enable you to have \"extra heroes\", helping hands to quest, defend, attack, activate abilities and such. So, the encounter deck will always have cards to inder equipments, events and allies ...\n\nAs allies are stronger, it's perfectly sensible (bad guys point of view) that cards to deal with allies are stronger.\n\nPut a treachery card that says \"inclifct 1 damage to every ally in play - this cannot be canceled\" in encounters deck, That will, pretty much (sill imho) solve the Zigil miner problème the mobs are having. Plenty of solutions exist that don't target specifically the miner but that are well designed to maim him. Same thing would be true for any card and any deck. A Location with X threat and HP (sorry, don't know the right names in english) with X equal to the number of characters sharing a keyword in play would pretty much slow the Rohan rider to an stop and still be an inconveignance for most decks.\n\nI don't like the way zigil miner is designed ... Even so i think every sphere need a ressource producing card, this one is just too much, too soon... but well, let's give time to time.\n\n \n\nAs for Zigil miner deck in tournaments ? Well, easy answer, random pairings, fixed deck. If it trully is that much overpowered, most people will come with that kind of deck, having to solve heroes match at the begining of each game so it will give waaaaaaaay more space to creative thinking and \"out of the box\" decks.\n\nIt's one of the reason i don't put every good unique cards in all decks that can use them, in my 3 man (well, 2 man 1 woman but ratlings are all furr, so you can't tell males and females apart) usual game table, we each have 3 to 5 decks, and pick one at random. Try and explain you can't forfeit your Boromir cause he's your lone Tactic heroe when your fellow player think exactly the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586293","commentId":586293,"userName":"richsabre","timestamp":1327771301,"content":"ok forgive my dumbness here, but are we saying that FFG are perhaps going to specifically put into play some sort of encounter card/quest card that stops miner, or are we saying that they are going to create a quest so hard that you have to use zigil, it just wont be really easy?\n\ni hope its the first one that people mean, because isnt the second sort of forcing you to build a deck based around 1 card? not too fun in my opinion. isnt that extremely limiting on a game based around deck building?\n\nas i say, im getting sort of confused at this point so i could be reading this all wrong.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586307","commentId":586307,"userName":"player1761766","timestamp":1327773638,"content":"richsabre said:\n\n \n\nok forgive my dumbness here, but are we saying that FFG are perhaps going to specifically put into play some sort of encounter card/quest card that stops miner, or are we saying that they are going to create a quest so hard that you have to use zigil, it just wont be really easy?\n\ni hope its the first one that people mean, because isnt the second sort of forcing you to build a deck based around 1 card? not too fun in my opinion. isnt that extremely limiting on a game based around deck building?\n\nas i say, im getting sort of confused at this point so i could be reading this all wrong.\n\n \n\n \n\n \n\nFor my part in all this, I'm saying the first one. Though not so far as to actually stop it, more like just to make you think twice about this being The One Deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586308","commentId":586308,"userName":"richsabre","timestamp":1327773829,"content":"spalanzani said:\n\nrichsabre said:\n\n \n\nok forgive my dumbness here, but are we saying that FFG are perhaps going to specifically put into play some sort of encounter card/quest card that stops miner, or are we saying that they are going to create a quest so hard that you have to use zigil, it just wont be really easy?\n\ni hope its the first one that people mean, because isnt the second sort of forcing you to build a deck based around 1 card? not too fun in my opinion. isnt that extremely limiting on a game based around deck building?\n\nas i say, im getting sort of confused at this point so i could be reading this all wrong.\n\n \n\n \n\n \n\nFor my part in all this, I'm saying the first one. Though not so far as to actually stop it, more like just to make you think twice about this being The One Deck.\n\n\n\ni was hoping someone would say that happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586399","commentId":586399,"userName":"SiCK_Boy","timestamp":1327792501,"content":"I also think we're more likely to see that first option, although the way they phrased that Boromir's Guide - Part III comment can make one wonder.\n\nBut even such a card as the one described earlier (1 dmg to all allies, can't be countered) won't put a total stop to miner decks since that deck runs on Stand and Fight. So it'll stall you, maybe slow you a bit, but I think the miner deck would easily come over the top. If such encounter cards were made, it'd be ok... they'd be a bit of an annoyance and maybe they'd be more devastating than I anticipate, but it's fair.\n\nWhat I think they (the designers) may not have foreseen (and/or may not be caring so much about) is the impact of future player cards and how they'll combine with the miner... That deck is bound to become even stronger than it currently is. It's not something we can say of most other decks (okay, maybe Sylvan is bound to become a winning strategy or at least a cool thematic deck, but who anticipates eagle decks to become much better than they currently are?).\n\nThe analogy with MtG is interesting. MtG designers did admit to a number of mistakes over time (Jace the Mind Sculptor being the most recent I can think of). But they have a number of ways to correct them: banned and restricted lists; errata (we've seen some for LoTR already) but, more important, a rotating format. We do not have it yet for LoTR; I don't know if we'll see it 5 years from now or as part of the tournament rules they'll design (and being a Vintage MtG fan, I'm not sure if I want to see a rotation in LoTR). But for now, as was pointed out often before, static quests are bound to become easier over time as players acquire new cards (having tried a few challenges this week-end with \"restricted\" card pools, I realize how quickly that statement can be proved).\n\nIt could be a sound strategy to just keep players buying AP. Or it could be that after a couple cycle, nobody will care about older quests (like, 2 years from now, nobody will wonder if Journey to Rhosgopel is easy or hard because we'll all have gone to the next step).\n\nI do accept this idea that older quests will become easier as time passes. This game is bound to \"suffer\" from some kind of power creep over time. What I fear is that I could take that miner deck (at least for the 2 player variant) and try it against upcoming AP without adding any new player cards and keep on easily winning. That would prove my point about the miner's strength. And if so, the solution from the designer's standpoint would be to either accelerate the power creep so that the encounter deck beats the miner (not something we want, I believe, assuming we're in this for the long run - ket's say at least 5 to 10 cycles of expansions), or design specific encounter cards to limit the miner. If we see this happening, I'd just like it to be accompanied by some form of communique stating: okay, we screwed on the miner, here's our fix for it.\n\nOr maybe they'll just ignore it because a lot of players are in the Bilbo category and won't care so much about playing powerful cards (just like many players are happy with a single Core set and enjoying the game as much as anyone else), but more about playing interesting quests in Tolkien's world."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586409","commentId":586409,"userName":"booored","timestamp":1327795263,"content":"I think your making good points here but I would point something about \"power creep\" and \"quests getting forgotten and not played\" as time goes by.. Like if I buy Mass Effect 3 and then buy a DLC of a new quest.. play that quest.. and then what? It is over.. no one complains about that.. also if you play Skyrim, after 100 hours of playing no one complains about going back to the early quest and being able to kill the monsters with a single swipe of your sword. It is the same thing here. This isn't a dueling game.\n\nMy point is that you are talking about a duel game, witch this is not. The quests, are not \"extensions\" of the old quests. There is no backward compatibility or even allowance in the new quests and player cards for what came before. Each new cycle.. is a new quest. It is designed for the power state of the cards AT THE TIME and is self contained, not caring about the future or past. I see zero problem with this. You can also run restricted rules to bring back the challenge of the old quests.\n\nAs for the mythical \"tournemt\" system.. well the rumor here (and it is a rumor.. but supported from events at GenCon) is that tournament play will be with a brand new encounter deck made just for that event (latter sold as a print on demand.. exactly like Massing) So power creep again, has nothing to do with torny play, in fact when they make those decks that can customize it to the current meta game of the popular decks. So again, this has zero problem imo.\n\nSo basically what I am saying is that power creed, ban lists, restricted lists and rotation have no need to be used in this game at all. As long as they design the quests to take that into account. It is up to the player, to play the game in a way they find entertaining. If you do not like tracker.. do not use it. If you do not like Ziggy, do not use it. UC, Protector.. blah blah blah.\n\nStill there are problems you have touched on that I do agree with. Already you HAVE to buy Khaz to play Darowdelf, as that cycle used encounter cards from Khaz. People talk how Shadows of Mirkwood is also a MUST buy for, among other things, the songs. The LCG is \"supposed\" to be a non-collector orientated format for card games, were you can just pick the packs you need for your deck. That is how it is marketed, to the jaded and broke ccg player anyway. But the cards are spread out so if you wish to play in a competitive environment, you need every pack. This is still better than finding random rares, or Mythics they even have now.. still if you are talking a competitive scene you need to buy every single pack released.\n\nOn top of this, as a new player after you buy CORE, you will have to buy the equivalent to Khaz for what ever the current AP Cycle is. Then if you look at the store and like a Darrowdelf (yay watching in the water.. gotta get me some of that ***** YEAH!) oh wait.. you now need to also buy Khaz.\n\nSo... what I am trying to say here is that even with power creep and w.e there will be key packs that HAVE to be bought, even by new players. It would be those key products that I would design my quests and player cards around, as they HAVE to be bought by everyone. So while Ziggy breaks all of Shadows of Mirkwood, there is no reason that it will break Darowdelf, and future APs as it is in a \"core\" release.. so they can reasonably expect everyone to own it.. (assuming they do worry about this)\n\nAlso what you say about Ziggy is true. As I think he is only going to get better. I also think the eagle deck will be getting better, I have a bet that the darrowdelf packs will have eagles in them (you start on the mountains in the snow according to the images) The elf deck has;t even started yet and the Dwarf deck is guaranteed to get stronger. BUT, only to those that have the old cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586426","commentId":586426,"userName":"Rince","timestamp":1327800428,"content":"SiCK_Boy said:\n\nMaybe they do, maybe they do... I'm afraid that whatever they come up with won't be enough to stop the miner without being ultra-targetted (ex: deak 1 damage to every spirit dwarf as it exaust; heroes cannot gain resources except during the resource phase) or having a destructive effect on multiple strategies at once (ex: dealing damage to any ally exhausting or using an action).\n\nAnd if they come up with an ultra-targeted response, it will confirm it was a mistake to do the card in the first place. If they just increase the power of the encounter deck, it may be the beginning of a major power creep.\n\nWe'll see... I hope to be able to revisit this thread once in a while as more player cards come up.\n\n\n\n \n\nThat is exactly what I am afraid of. One little mistake and the game balance goes down the toilet!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586466","commentId":586466,"userName":"sensei yaourt","timestamp":1327807995,"content":"SiCK_Boy said:\n\nThat deck is bound to become even stronger than it currently is. It's not something we can say of most other decks\n\n\n\nActually, unless killed by specific encounter cards, every deck will become stronger as the card pool gets bigger. Every eagle the print will make the eagle deck more potent (because more options) even if it is only a \"not too bad\" one. And, assuming they stop printing new eagles, tactics even and attachment will still increase it strength. Only when they stop printing : 1) eagles, 2) tactics that can (not at strong, just can be played) be played by eagle deck, 3) attachments that can be played by eagle deck, will the strength of eagles wane.\n\nI won't say that zigil deck will not gain power faster and better, but imho, it's the kind of deck that gain very significant advantage from one card and then have to wait for 5 adventure pack to get another one ... time might prove me wrong tho.\n\n \n\nthat being said,\n\nAs far as history told us, there will be no cycle rotation for LotR LCG, i've been playing Cthulhu LCG since the very release of the game and there is still no cycle rotation ... 6 assylum pack cycles, 2 deluxe expension in ... the LCG format simply does not support that kind of mechanism.\n\nAnother MTG analogy : 1 block (1 edition + 3 extension) provide roughly 775 cards (250 for base + 3x 175)... to have that amount of new cards in Cthulhu we would have to wait for ... (provided they keep the pace of 2 cycles and 1 deluxe expension a year) about 3 years (that is 6 AP cycle with 20 new cards each and 3 deluxe box of 50 cards) ....\n\nIn LotR it would be even slower, as you only get 10 new player cards per AP and, if design stay the same, 13 per DE. I won't do the math but, if there is no cycle rotation start in near future for CoC LCG, i don't foresee one for LotR.\n\n \n\nSo, zigil miner will keep being a problem 3 cycles from now ... but hey, every CCG has this kind of burden ... I've been attending a Legacy MTG tournament few days ago, and about 60% of decks were splashing green just to play Tarmofoyf (oh no, i'm addicted again) and WotC made no move in 5 years to correct what they KNEW was a mistake (one of the designer admited knowing since the card was printed it was 1 mana to cheap).\n\n \n\nImho, you don't need to raise the overall power of new cards (player or quest) to adress a specific card, definitively not in a duel-oriented game (tho ban lists tend to be a more definitive answer) and neither in a cooperative game.\n\nAs a mater of fact, the overall power of new cards will keep increasing steadily for 2 reason 1) new card create new combo, new combo create new power 2) you want your players to be happy so they keep feeding you money and, be honest about it, most of us, at least partialy, love having better decks, stronger cards, more win, less fail and a bigger ... well ... you know what i mean ... card pool.\n\n \n\nTBH, i don't see as much of an increase in difficulty with KD as most people (don't get me wrong, they are harder, just not THAT harder). I don't rely on Test of Will much, so the new tendency to have treachery be uncancellable don't affect me to much. Same thing will be seen with every kind of powerbase, zigil included ... i wouldn't be much surprised if he retired with the next deluxe expension after having mined too deep and too skillfully. After all, the nail that stands out just beg for the hammer to strike.\n\nTrue, we might have to suffer for 6 month of Zigil supremacy, but as i understand it, Darrowdelf was designed at the same time as KD, so if they didn't see the true strength of zigil miner when designing it ... well ... i'm sure they'll do something in the upcomming Battle of Bree (working title) DE (yeah i have some faith in humanity still).\n\n \n\nNow i'm going to scout for a zigil deck list and brace for the next half of the year ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586530","commentId":586530,"userName":"richsabre","timestamp":1327821445,"content":"sensei yaourt said:\n\nNow i'm going to scout for a zigil deck list and brace for the next half of the year ...\n\n\n\nthats my point though, what if you dont want to use him, or at least dont want to create your decks around him? the beauty of this game is its customisation value, with near limitless (well as the card pool grows) variations of decks it will be so anti-creationist (a word or not?) to force players to base decks around 1 card for 6 months....\n\nanyways would you mind explaining cycle rotation to me? im dont really know what that means happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586558","commentId":586558,"userName":"SiCK_Boy","timestamp":1327827040,"content":"In Magic: the Gathering, they come up with 3 to 4 expansions per year. They've been doing this for the past 20 years or so and each expansion is \"limited\", so you can't buy packs after 2 or 3 years, usually.\n\nWhen the game reached a point where new players weren't able to compete with those who had played since the beginning, because the older and more powerful cards weren't available in packs anymore (and singles were costing over 100,00 $), they came up with this concept of \"format\". Basically, they defined multiple formats where each was limiting which expansions you could use.\n\nThe \"standard\" format was defined as using cards from the last 2 years of expansion, approximately. This meant that the \"standard\" for most tournaments was to use only cards that anyone could hope to get in packs.\n\nThis kept on evolving over time with multiple formats being created, each with its \"breaking point\", all the way from Vintage (all cards since the beginning of the game allowed) to Legacy (cards from the beginning of the game, except for uber-powerful and expansive cards) to Extended (cards from the last 6 years or so) to Standard (current pool of buyable expansions).\n\nThe parallel isn't the same with LCG since most expansions are still available (from what I know; I don't play the other LCG). But, as was said, in a PvP format, what matters is that each player has access to the same resources. If a solid deck emerges, counter-strategies will emerge as well. With LoTR, there's no evolution from the encounter deck's perspective: that deck is stuck in time with its meager resources while players keep getting new goodies. Hence my question about whether or not we would see some sort of rotation at one point. This is mostly from a tournament / competitive perspective. We see it already with player-run online tournament: most tournament use restricted pool (single Core set, only cards available at the time the quest was printed, etc.). This could be a solution to prevent Zigil miner from dominating the game in a longer term perspective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586560","commentId":586560,"userName":"SiCK_Boy","timestamp":1327827275,"content":"And it's true that nobody is forced to use the Miner. But if we look at it from a competitive standpoint (which as been my approach since the beginnig of this discussion), the truth is that people will want to play the best deck, period. That means the deck that wins most consistently with the best scores. In theory, if multiple tournaments were run against the same quest, you'd see all players using the same deck over time because there's always a better solution in a game such as LoTR. Yes, there'll always be a luck factor involved, but given time, the player community will find what the best solution is to each challenge and logic would dictate that someone who's goal is to win will play it.\n\n(This is in no way intended to diminish the love that \"Bilbo\" players derive from the game; it's a coop game that has plenty to offer beyond \"winning with the best score\" and the designers have to consider all these things when making new cards)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586562","commentId":586562,"userName":"gone questing","timestamp":1327827369,"content":"This is one of the hardest to follow threads!\nIt would help if some points were new threads and whole slabs of text weren't copied again and again. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nIf Zigil Miner is broken, does it even matter since we're all casual players right now? (As jhaelen said)\nIs Zigil Miner even broken compared to Steward of Gondor, Northern Tracker, etc? (As Glaurung said)\n\n\nI just built and used Zigil Miner in 4-5 games, not seeing him in a three or so turn game (the lowest difficulty Khazad-dum quest).\nI would have lost him in one game if not for another player cancelling a treachery card. I think this is probably the weak point of the card, it will be exhausted in the quest phase, and may make it harder to find another copy of Zigil Miner. Arguably Dwarven Tomb or Gildor could help find another Miner, however flipping cards is still disruptive.\n\nI built my deck with 30 cards with the same cost, out of 50 cards. I did not get any resources 2-3 times out of 20 or so, and probably only used Gildor + Zigil Miner 6-8 times as the Miner + my deck was very consistent and I wanted to use Gildor for other things. I don't feel Zigil Miner needs Gildor, however my deck did have a lot of restrictions forced upon it.\nI played with 30 3 cost cards and didn't feel that I really needed to use the Miner with 4+ cost cards as my hand played out smoothly and I imagine most would have already experienced this with Steward of Gondor already, paying for everything in your hand quicker than you can replenish it.\n\nWhere the Miner probably pulls away from Steward of Gondor in power level, is that in a three sphere deck, you could effectively have Steward on any given character each turn, rather than all the tokens going towards one sphere only.\n\n\nMy $0.02"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586563","commentId":586563,"userName":"Rince","timestamp":1327827408,"content":"richsabre said:\n\n \n\nexplaining cycle rotation to me? im dont really know what that means happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n \n\n \n\nIn Magic the Gathering, each year sees the release of one themed block of cards (which includes 3 expansions) and a yearly core set. The standard format (which is the most widely played format both in casual and organized play) only allows cards from the last 2 blocks (6 expansions) and the latest core set. Therefore, when a new block is released, the available card base shifts from the oldest to the newest block, creating cycles. Basically in MtG, you play with new card every 2 years. But of course, there are other formats that allow players to go back and use much older cards, such as Legacy and Modern."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586566","commentId":586566,"userName":"richsabre","timestamp":1327827835,"content":"i see thanks for the info"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586571","commentId":586571,"userName":"SiCK_Boy","timestamp":1327828590,"content":"gone questing said:\n\nIf Zigil Miner is broken, does it even matter since we're all casual players right now? (As jhaelen said)\nIs Zigil Miner even broken compared to Steward of Gondor, Northern Tracker, etc? (As Glaurung said)\n\n\n\nWe're not all casual players, so yes it does matter. But I understand Casual players don't feel too concerned about this thread and the Miner.\n\nYes, Miner is broken compared to Steward of Gondor. Steward is unique and produces 2 resources a turn. Miner is non-unique and produces double that, easily. As for Tracker, it's a different aspect. I don't think Tracker is broken, althought I admit he's strong and I would never NOT play it. But Miner comes into play on turn one while Tracker needs 4 resources. Also, Tracker helps in one aspect of the game, but Miner helps in ALL aspects since he allows you to play all the other cards you have.\n\ngone questing said:\n\nI just built and used Zigil Miner in 4-5 games, not seeing him in a three or so turn game (the lowest difficulty Khazad-dum quest).\nI would have lost him in one game if not for another player cancelling a treachery card. I think this is probably the weak point of the card, it will be exhausted in the quest phase, and may make it harder to find another copy of Zigil Miner.\n\n\n\nIf you know the encounter deck has cards that can damage exhausted characters and you don't have a mean to counter those, then simply wait to use the Miner during a later phase (such as combat). Yes, it means you won't get that huge first turn resources boost, but after that, it's business as usual and the Miner is safe.\n\ngone questing said:\n\n\nArguably Dwarven Tomb or Gildor could help find another Miner, however flipping cards is still disruptive.\n\n\n\nIf by \"flipping cards\" you mean that putting cards in your discard pile is a \"penalty\", you need to reassess things. With Dwarven Tomb and Stand and Fight, you want to put cards in your discard pile. These cards become \"resources\" you can use as a player, as opposed to cards in your player deck (especialy since we don't have any cheap tutor yet to get our silver bullets). As long as you make sure to keep at least 1 Will of the West or Dwarven Tomb, you'll never \"deck\" yourself out.\n\ngone questing said:\n\n\nI played with 30 3 cost cards and didn't feel that I really needed to use the Miner with 4+ cost cards as my hand played out smoothly and I imagine most would have already experienced this with Steward of Gondor already, paying for everything in your hand quicker than you can replenish it.\n\n\n\nTry the same with 5 cost cards instead. Steward doesn't produce enough resources when you hand is full of 5 cost cards. You need the miner. Also, some of those cards are rarely played, but they do change the game's dynamic once you're used to them (Beorn's Hospitality, Fortune or Fate). And don't forget you can (must) always provide resources to your partner with Parting Gift. Giving a 20 resources boost to your partner means he'll play is whole hand (whether it be full of 1, 2, 3 or 4 cost cards)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586839","commentId":586839,"userName":"gone questing","timestamp":1327873438,"content":"SiCK_Boy said:\n\n \n\n \n\nWe're not all casual players.\n\n\n\n\nI say that because without a competitive scene, there is no metagame on par with other competitive CCGs. In my experience, that is the thing that pushes you that bit further when you're at your perceived max. I used casual only as a lack of a better term... no offense of course.\n\n\nSiCK_Boy said:\n\n \n\nIf by \"flipping cards\" you mean that putting cards in your discard pile is a \"penalty\", you need to reassess things.\n\n\n\n\nWithout those cards in your hand, you are more likely to put them in your discard than draw them, without other card draw. Don't get me wrong, I agree, I play them and they're great, but Zigil Miner alone is not going to find Dwarven Tomb or Stand and Fight for you, quite the opposite... which is what Gildor is for ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n\nSiCK_Boy said:\n\n \n\n \n\nTry the same with 5 cost cards instead.\n\n \n\n\n\nI may. Right now, as in the last 24 hours, I knew Lore had a lot of 3 cost cards, so built for reliability rather than pushing it to the extreme, straight off the bat. I didn't want to need Gildor per se. I didn't always use him when he was available because of this.\n\n\nThe Boromir article contained a 51 card deck using Zigil Miner, with the following stats;\n\nCOST, QUANTITY\n6, 2\n5, 9\n4, 6\n3, 2\n2, 14\n1, 15\nX, 3\n\n(ie. Two cards that cost 6, etc.)\n\nWhat number do you call for Zigil Miner without Gildor around?\n\n\nYou could use the following in a deck, calling 5 for Zigil Miner and you'd have a 24/50 chance which is probably good enough, however, you may have to sacrifice not being able get cards into play without the Miner, and also have to use those cards...\n\nGandalf\nRadagast\nGrim Resolve\nBeorn's Hospitality\nGildor Inglorian\nFate or Fortune\nWe Do Not Sleep\n\n \n\nLandroval\n\n\n\nNo doubt we'll see how Zigil Miner pans out. Without Gildor, a specific deck setup is required, with Gildor, the cost and reliability of finding those cards will probably be enough for me to feel that it is the biggest card in the game (Steward being the previous) but not busted. However, I really hope that we don't get any cards that make Zigil Miner better! :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586917","commentId":586917,"userName":"Bonus Card","timestamp":1327893231,"content":"Everyone is complaining about Zigil Miner. Why? Look where we started. Core level was hard as hell when we just had the core cards. Then moving onto Mirkwood it got easier. Why? Well, thematically Mirkwood Forest is not that bad of a place to journey through, not as bad as Dol Guldur, or even the Mines.\n\nBut why are the Mines so easy, well if you just attempted them without Dwarves they would be somewhat difficult. Again, thematically Dwarves make the Mines easier. Now, back to Dol Guldur, and other somewhat difficult scenarios, well once there is some sort of fellowship, combining the best of the strengths of Men, Dwarves, Hobbits, and Elves makes them easier to accomplish.\n\nI think in due time, you will see a correction of balance, and not because the game is flawed, but because thematically the world of Middle Earth becomes more difficult to face. Some places might be easy to dwarves, but wait until the dwarves have to face a snowy scenario, or maybe wade through waters, thematically these areas would make it impossible for Zigil Miners to mine, and perhaps there will be a reflection of that within the cards.\n\nI agree, that the introduction of Zigil Miners has given us LOTRLCG players a cakewalk for the time being, but I think there is much to anticipate in future sets.\n\nJust be patient!\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=586973","commentId":586973,"userName":"Ninjawa2","timestamp":1327902141,"content":"How about an errata or house rule that said something along the lines of \"this ability can only be used if there is an underground, dark or mountain location in play.\"  That way it fits better flavour-wise and the resource gain is a bonus rather than a guarantee.  It would also mean that future quests would only have to account for the miner's effect if they had these locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587065","commentId":587065,"userName":"guest455987","timestamp":1327915305,"content":"Ninjawa said:\n\nHow about an errata or house rule that said something along the lines of \"this ability can only be used if there is an underground, dark or mountain location in play.\"  That way it fits better flavour-wise and the resource gain is a bonus rather than a guarantee.  It would also mean that future quests would only have to account for the miner's effect if they had these locations.\n\n\n\nI like that a lot. Makes perfect sense, thematically."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587176","commentId":587176,"userName":"richsabre","timestamp":1327927148,"content":"Grudunza said:\n\nNinjawa said:\n\n \n\nHow about an errata or house rule that said something along the lines of \"this ability can only be used if there is an underground, dark or mountain location in play.\"  That way it fits better flavour-wise and the resource gain is a bonus rather than a guarantee.  It would also mean that future quests would only have to account for the miner's effect if they had these locations.\n\n \n\n \n\nI like that a lot. Makes perfect sense, thematically.\n\n\n\n2nded though it wont help on the next cycle as all the locations will be mountain/ underground"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587194","commentId":587194,"userName":"guest455987","timestamp":1327929136,"content":"richsabre said:\n\n2nded though it wont help on the next cycle as all the locations will be mountain/ underground\n\n \n\n \n\nNot necessarily.  There's a chance that more locations in the Dwarrowdelf cycle will not have one of those attributes.  But as long as it's a boon for a shorter term thing during one AP cycle, then that's okay, I think.  To me, the idea of the change is to prevent it from being super overpowered for everything.   You could also nerf it a bit more by saying that it can only be used if the active location is underground, dark or mountain.  Or just limit it to \"mountain,\" as \"underground\" and \"dark\" don't necessarily imply a mining situation.\n\nBut regardless, I think that's a good way to limit the ability in a thematic way, while still having it be very useful for some adventures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587304","commentId":587304,"userName":"player1761766","timestamp":1327937427,"content":"I can't find the actual post now, but sometime this weekend I suggested there may be cards coming up that discard allies, possibly as a way of combatting the Zigil Miner deck - looking at the Dwarrowdelf announcements recently has shown that it looks like this will be the case:\n\nhttp://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/the-long-dark/goblin-warlord.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/the-long-dark/goblin-warlord.png]\n\nThe \"Lost\" keyword seems to be a way around it, though whether it's the way around it, who can say? If \"Lost\" becomes a theme of the game, rather than an adventure-pack-specific keyword, I'd assume that they had a plan for the Zigil Miner all along."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587316","commentId":587316,"userName":"booored","timestamp":1327938216,"content":"spalanzani said:\n\nI can't find the actual post now, but sometime this weekend I suggested there may be cards coming up that discard allies, possibly as a way of combatting the Zigil Miner deck - looking at the Dwarrowdelf announcements recently has shown that it looks like this will be the case:\n\nhttp://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/the-long-dark/goblin-warlord.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/the-long-dark/goblin-warlord.png]\n\nThe \"Lost\" keyword seems to be a way around it, though whether it's the way around it, who can say? If \"Lost\" becomes a theme of the game, rather than an adventure-pack-specific keyword, I'd assume that they had a plan for the Zigil Miner all along.\n\n\n\nthe entire point of the ziggy deck is to cycle cards form the discard pile.. so this in fact helps the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587332","commentId":587332,"userName":"player1761766","timestamp":1327939323,"content":"booored said:\n\nspalanzani said:\n\n \n\nI can't find the actual post now, but sometime this weekend I suggested there may be cards coming up that discard allies, possibly as a way of combatting the Zigil Miner deck - looking at the Dwarrowdelf announcements recently has shown that it looks like this will be the case:\n\nhttp://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/the-long-dark/goblin-warlord.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/the-long-dark/goblin-warlord.png]\n\nThe \"Lost\" keyword seems to be a way around it, though whether it's the way around it, who can say? If \"Lost\" becomes a theme of the game, rather than an adventure-pack-specific keyword, I'd assume that they had a plan for the Zigil Miner all along.\n\n \n\n \n\nthe entire point of the ziggy deck is to cycle cards form the discard pile.. so this in fact helps the deck.\n\n\n\nI must admit, I've not tried it, but I thought the \"entire point\" was to get the resources to play your deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587360","commentId":587360,"userName":"booored","timestamp":1327942251,"content":"yeah.. but the engine that drives it is a cycling engine... so you use Tomb + Stand and Fight to play the high cost creatures from the graveyard that you discard with Ziggy, and then cycle using Will of the West to get your Stand and Fights back in your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587376","commentId":587376,"userName":"cordeirooo","timestamp":1327943396,"content":"If Lost discards allies, it won't be a way around Zigil. You could just discard another ally. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587428","commentId":587428,"userName":"SiCK_Boy","timestamp":1327950335,"content":"I don't care much personnaly if a solution / correction makes sense thematically.\n\nIf they want to go along with an errata, I'd rather have them make one that relies on the player's cards rather than the encounter deck. We do not control the encounter decks and there's no player card I can think of that relies on it for now. We want all player cards to be playable in all scenarios and all decks. I'd rather see something such as: use only once every 2 turns or some kind of clock mecanic dependant on the amount of resources generated, for example. Or even such a blunt restriction as \"miner can't produce more than 3 resources with its ability\" (even if you get a > 3 cost), because really, that's the problem with the miner (the huge amount of resources you get for such a low cost, compared to other acceleration cards such as Steward of Gondor or Horn of Gondor). They could even make him unique; that would limit its usefulnes.\n\nAs for Bonus Card's \"thematic explanation\" on why the world becomes more difficult to face, I don't buy it. The game is bound to become more difficult only in comparison to what it was earlier, and the only reason is simply the amount of player cards available. If the player cards pool was set in stone and they were only doing AP countaining new encounter cards, the power level could remain stable... but with players getting more and more new tools, they have to give new tools to the \"opponent\" as well. So that's why encounters will feel more difficult over time, especially for someone picking up only a Core Set and Kazadh-Dûm, for example. Another reason why the new encounters often feel harder (especially for KD) is just the paradygm change required from players to adjust. This game is so new and still in its infancy; the \"veterans\" amongst us have less than a year of experience to their credit, so we're not always able to \"think outside the box\" when faced with new quests. We repeat patterns because it worked in the previous cycle or quests (ex: while trying the Journey to Rhosgopel this weekend, I came to the realization that The Galadhrim's Greetings wasn't required; neither should Gandalf be used for threat reduction... this is contrary to how I was used to playing against the other scenarios; I needed to adapt). But we'll come to a point where we're better able to adapt and I hope the game's difficulty won't increase over time. Already, we know that by its nature, we're bound to see a power creep. If it's to be combined with a difficulty creep, FFG will end up killing the game... I'm sure they're aware of the risks (doesn't mean they don't make mistake, however)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587644","commentId":587644,"userName":"Bonus Card","timestamp":1327998301,"content":"SiCK_Boy said:\n\nI don't care much personnaly if a solution / correction makes sense thematically.\n\nIf they want to go along with an errata, I'd rather have them make one that relies on the player's cards rather than the encounter deck. We do not control the encounter decks and there's no player card I can think of that relies on it for now. We want all player cards to be playable in all scenarios and all decks. I'd rather see something such as: use only once every 2 turns or some kind of clock mecanic dependant on the amount of resources generated, for example. Or even such a blunt restriction as \"miner can't produce more than 3 resources with its ability\" (even if you get a > 3 cost), because really, that's the problem with the miner (the huge amount of resources you get for such a low cost, compared to other acceleration cards such as Steward of Gondor or Horn of Gondor). They could even make him unique; that would limit its usefulnes.\n\nAs for Bonus Card's \"thematic explanation\" on why the world becomes more difficult to face, I don't buy it. The game is bound to become more difficult only in comparison to what it was earlier, and the only reason is simply the amount of player cards available. If the player cards pool was set in stone and they were only doing AP countaining new encounter cards, the power level could remain stable... but with players getting more and more new tools, they have to give new tools to the \"opponent\" as well. So that's why encounters will feel more difficult over time, especially for someone picking up only a Core Set and Kazadh-Dûm, for example. Another reason why the new encounters often feel harder (especially for KD) is just the paradygm change required from players to adjust. This game is so new and still in its infancy; the \"veterans\" amongst us have less than a year of experience to their credit, so we're not always able to \"think outside the box\" when faced with new quests. We repeat patterns because it worked in the previous cycle or quests (ex: while trying the Journey to Rhosgopel this weekend, I came to the realization that The Galadhrim's Greetings wasn't required; neither should Gandalf be used for threat reduction... this is contrary to how I was used to playing against the other scenarios; I needed to adapt). But we'll come to a point where we're better able to adapt and I hope the game's difficulty won't increase over time. Already, we know that by its nature, we're bound to see a power creep. If it's to be combined with a difficulty creep, FFG will end up killing the game... I'm sure they're aware of the risks (doesn't mean they don't make mistake, however).\n\n\n\nI don't think it will be a difficulty creep exactly. It'll just get harder sometimes and easier sometimes. I think it'll be a natural progression towards more difficult at times. You see cards like \"goblintown scavengers\" what would stop other cards from penalizing costly cards, whether in hand, decks, discard piles or play. And why would this be any different than \"zigil miner\". This set makes gameplay for the good guy side a lot easier for now, but we might just need it for the future.\n\n \n\nJust let him live as he is. If he turns out to be broken in future sets, you can all tell me \"I told you so\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=587889","commentId":587889,"userName":"SiCK_Boy","timestamp":1328029782,"content":"Interesting idea to attack the rest of the deck rather than the miner so as to make him more dangerous to use. Encounter cards forcing you to flip cards from the player deck and having effects based on cost would be a great way to limit a miner strategy, while at the same time opening up plenty of opportunities for deckbuilding around this (or setting combo via Gildor)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589651","commentId":589651,"userName":"SiCK_Boy","timestamp":1328305407,"content":"Looks like this is the way the designers intend to penalize the Zigil deck with the new preview. However, that preview is for the 5th expansion pack in the cycle. Will there be anything in the first 4 to replicate this tendancy?\n\nThe previewed monster does add pressure on the Zigil player, but still, the cards only generate its Attack and Hit Points values. The other 2 values (Threat and Defense) are the critical one. Maybe we'll see another Ancient Nameless Evil Monster working that way, because otherwise, it's still easy enough to ensnare the enemy after having chump-blocked (and then you Fortune of Fate back the dead hero who sacrificed himself to defend against the beast)...\n\nStill, that's a start, but I remain skeptical that all encounter decks will have enough of these type of encounter cards to put a stop or compromise the miner strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589655","commentId":589655,"userName":"booored","timestamp":1328306903,"content":"The new card has nothing to do with it... unless they plan to put a card like it in EVERY SINGLE ap from now on..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589737","commentId":589737,"userName":"Bonus Card","timestamp":1328337844,"content":"SiCK_Boy said:\n\nLooks like this is the way the designers intend to penalize the Zigil deck with the new preview. However, that preview is for the 5th expansion pack in the cycle. Will there be anything in the first 4 to replicate this tendancy?\n\nThe previewed monster does add pressure on the Zigil player, but still, the cards only generate its Attack and Hit Points values. The other 2 values (Threat and Defense) are the critical one. Maybe we'll see another Ancient Nameless Evil Monster working that way, because otherwise, it's still easy enough to ensnare the enemy after having chump-blocked (and then you Fortune of Fate back the dead hero who sacrificed himself to defend against the beast)...\n\nStill, that's a start, but I remain skeptical that all encounter decks will have enough of these type of encounter cards to put a stop or compromise the miner strategy.\n\n\n\n \n\nThe new guy costs 40 in order to engage, just hit him with three Gandalfs or descendants in the staging area.\n\nAlso, that would be insane to have shadow/threat cost of three cards on him, to much of a game changer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589738","commentId":589738,"userName":"Bonus Card","timestamp":1328337880,"content":"SiCK_Boy said:\n\nLooks like this is the way the designers intend to penalize the Zigil deck with the new preview. However, that preview is for the 5th expansion pack in the cycle. Will there be anything in the first 4 to replicate this tendancy?\n\nThe previewed monster does add pressure on the Zigil player, but still, the cards only generate its Attack and Hit Points values. The other 2 values (Threat and Defense) are the critical one. Maybe we'll see another Ancient Nameless Evil Monster working that way, because otherwise, it's still easy enough to ensnare the enemy after having chump-blocked (and then you Fortune of Fate back the dead hero who sacrificed himself to defend against the beast)...\n\nStill, that's a start, but I remain skeptical that all encounter decks will have enough of these type of encounter cards to put a stop or compromise the miner strategy.\n\n\n\n \n\nThe new guy costs 40 in order to engage, just hit him with three Gandalfs or descendants in the staging area.\n\nAlso, that would be insane to have shadow/threat cost of three cards on him, to much of a game changer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589739","commentId":589739,"userName":"Bonus Card","timestamp":1328337903,"content":"SiCK_Boy said:\n\nLooks like this is the way the designers intend to penalize the Zigil deck with the new preview. However, that preview is for the 5th expansion pack in the cycle. Will there be anything in the first 4 to replicate this tendancy?\n\nThe previewed monster does add pressure on the Zigil player, but still, the cards only generate its Attack and Hit Points values. The other 2 values (Threat and Defense) are the critical one. Maybe we'll see another Ancient Nameless Evil Monster working that way, because otherwise, it's still easy enough to ensnare the enemy after having chump-blocked (and then you Fortune of Fate back the dead hero who sacrificed himself to defend against the beast)...\n\nStill, that's a start, but I remain skeptical that all encounter decks will have enough of these type of encounter cards to put a stop or compromise the miner strategy.\n\n\n\n \n\nThe new guy costs 40 in order to engage, just hit him with three Gandalfs or descendants in the staging area.\n\nAlso, that would be insane to have shadow/threat cost of three cards on him, to much of a game changer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589740","commentId":589740,"userName":"Bonus Card","timestamp":1328337904,"content":"SiCK_Boy said:\n\nLooks like this is the way the designers intend to penalize the Zigil deck with the new preview. However, that preview is for the 5th expansion pack in the cycle. Will there be anything in the first 4 to replicate this tendancy?\n\nThe previewed monster does add pressure on the Zigil player, but still, the cards only generate its Attack and Hit Points values. The other 2 values (Threat and Defense) are the critical one. Maybe we'll see another Ancient Nameless Evil Monster working that way, because otherwise, it's still easy enough to ensnare the enemy after having chump-blocked (and then you Fortune of Fate back the dead hero who sacrificed himself to defend against the beast)...\n\nStill, that's a start, but I remain skeptical that all encounter decks will have enough of these type of encounter cards to put a stop or compromise the miner strategy.\n\n\n\n \n\nThe new guy costs 40 in order to engage, just hit him with three Gandalfs or descendants in the staging area.\n\nAlso, that would be insane to have shadow/threat cost of three cards on him, to much of a game changer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589741","commentId":589741,"userName":"Bonus Card","timestamp":1328338265,"content":"SiCK_Boy said:\n\nLooks like this is the way the designers intend to penalize the Zigil deck with the new preview. However, that preview is for the 5th expansion pack in the cycle. Will there be anything in the first 4 to replicate this tendancy?\n\nThe previewed monster does add pressure on the Zigil player, but still, the cards only generate its Attack and Hit Points values. The other 2 values (Threat and Defense) are the critical one. Maybe we'll see another Ancient Nameless Evil Monster working that way, because otherwise, it's still easy enough to ensnare the enemy after having chump-blocked (and then you Fortune of Fate back the dead hero who sacrificed himself to defend against the beast)...\n\nStill, that's a start, but I remain skeptical that all encounter decks will have enough of these type of encounter cards to put a stop or compromise the miner strategy.\n\n\n\n \n\nThe new guy costs 40 in order to engage, just hit him with three Gandalfs or descendants in the staging area.\n\n \n\nAlso, that would be insane to have shadow/threat cost of three cards on him, to much of a game changer.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589742","commentId":589742,"userName":"Bonus Card","timestamp":1328338668,"content":"booored said:\n\nThe new card has nothing to do with it... unless they plan to put a card like it in EVERY SINGLE ap from now on...\n\n\n\n \n\nWell, how about they just make some other great player cards and pump up difficulties of the scenarios in different areas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589766","commentId":589766,"userName":"richsabre","timestamp":1328342164,"content":"Bonus Card said:\n\n \n\nbooored said:\n\n \n\nThe new card has nothing to do with it... unless they plan to put a card like it in EVERY SINGLE ap from now on...\n\n \n\n \n\n \n\nWell, how about they just make some other great player cards and pump up difficulties of the scenarios in different areas.\n\n \n\n \n\nthat would just cause more power creep\n\nps i had to have a laugh at those multiple posts- forum software =fail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=589939","commentId":589939,"userName":"SiCK_Boy","timestamp":1328382295,"content":"Bonus Card said:\n\nAlso, that would be insane to have shadow/threat cost of three cards on him, to much of a game changer.\n\n\nI admit it would be very strong. It wouldn't be so bad if we had access to more player library manipulation (Gildor is pretty much the only thing we have for now). But maybe it would make Radagast's Cunning a card worth playing (just like Journey to Rhosgopel brought Lore of Imladris a second [or should I say first] life)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590218","commentId":590218,"userName":"Stenun","timestamp":1328459541,"content":"I really don't see why people are rejecting the whole \"if you find it too easy, don't use it\" argument; as far as I'm concerned, that's the perfect solution.\n\nIf you're playing a computer game and you find the \"Easy\" difficulty setting too easy, what do you do?  Do you increase it to \"Medium\" or do you sit around calling for \"Easy\" to be changed?\n\nWhy should this game be any different?\n\nIf Zigil Miner makes it too easy for you, don't use it.\n\nSimple.\n\n \n\nBut there will be other players who don't use the card in the exteremely \"broken\" way, and why shouldn't they be allowed to?  This isn't a competitive game, it's co-operative.  I know that's a pretty obvious fact but I do get the distinct impression that not everyone fully appreciates just quite how much that should change your basic approach to this game.  This isn't a game about you trying to beat all other players on an equal playing field; it's a game about loads of different players with loads of different skill levels all playing against the game.  An equal playing field is not needed.  And just because you're good at the game, doesn't mean other people are.  And there's no reason that has to be a problem.  There's no reason to destroy all the powerful player cards because some players find it too easy, the far simpler and more obvious solution is for those players to simply not use the card(s) that make it too easy for them.\n\nWhy is that a problem?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590229","commentId":590229,"userName":"richsabre","timestamp":1328462999,"content":"Stenun said:\n\nI really don't see why people are rejecting the whole \"if you find it too easy, don't use it\" argument; as far as I'm concerned, that's the perfect solution.\n\nIf you're playing a computer game and you find the \"Easy\" difficulty setting too easy, what do you do?  Do you increase it to \"Medium\" or do you sit around calling for \"Easy\" to be changed?\n\nWhy should this game be any different?\n\nIf Zigil Miner makes it too easy for you, don't use it.\n\nSimple.\n\n \n\nBut there will be other players who don't use the card in the exteremely \"broken\" way, and why shouldn't they be allowed to?  This isn't a competitive game, it's co-operative.  I know that's a pretty obvious fact but I do get the distinct impression that not everyone fully appreciates just quite how much that should change your basic approach to this game.  This isn't a game about you trying to beat all other players on an equal playing field; it's a game about loads of different players with loads of different skill levels all playing against the game.  An equal playing field is not needed.  And just because you're good at the game, doesn't mean other people are.  And there's no reason that has to be a problem.  There's no reason to destroy all the powerful player cards because some players find it too easy, the far simpler and more obvious solution is for those players to simply not use the card(s) that make it too easy for them.\n\nWhy is that a problem?\n\n\n\nthis is not the problems as i see it, im a fan of the dont it use thingy, however my worry is how the devs will change the game to keep up with the powerful cards, thus sort of forcing you to use them, getting rid of the opt out tactic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590231","commentId":590231,"userName":"Stenun","timestamp":1328463789,"content":"richsabre said:\n\n \n\nthis is not the problems as i see it, im a fan of the dont it use thingy, however my worry is how the devs will change the game to keep up with the powerful cards, thus sort of forcing you to use them, getting rid of the opt out tactic\n\n\n\nAnd if the game gets harder, then Zigil Miner stops being a problem as all the player cards will soon be at that level - they won't make the game harder just because of one player card and then not bring out any others on the same power level.\n\nSo again, there's no real problem."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590233","commentId":590233,"userName":"richsabre","timestamp":1328464208,"content":"Stenun said:\n\nrichsabre said:\n\n \n\n \n\nthis is not the problems as i see it, im a fan of the dont it use thingy, however my worry is how the devs will change the game to keep up with the powerful cards, thus sort of forcing you to use them, getting rid of the opt out tactic\n\n \n\n \n\nAnd if the game gets harder, then Zigil Miner stops being a problem as all the player cards will soon be at that level - they won't make the game harder just because of one player card and then not bring out any others on the same power level.\n\nSo again, there's no real problem.\n\n\n\napart from the power creep needed to bring the other cards to zigil level"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590234","commentId":590234,"userName":"Stenun","timestamp":1328464390,"content":"richsabre said:\n\n \n\napart from the power creep needed to bring the other cards to zigil level\n\n\n\nWhy should that be a problem?\n\n\"Power creep\" is a problem in competitive games because it means that whoever spends the most money usually wins against the other player.  But this isn't a competitive game.  You don't play against other players.  If scenario 4 from cycle 4 tends out to have a relative DL of 12, then you can bet the player cards will be able to match it.  And why not?  Why is that a problem?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590235","commentId":590235,"userName":"richsabre","timestamp":1328464666,"content":"Stenun said:\n\n \n\nrichsabre said:\n\n \n\n \n\napart from the power creep needed to bring the other cards to zigil level\n\n \n\n \n\nWhy should that be a problem?\n\n\"Power creep\" is a problem in competitive games because it means that whoever spends the most money usually wins against the other player.  But this isn't a competitive game.  You don't play against other players.  If scenario 4 from cycle 4 tends out to have a relative DL of 12, then you can bet the player cards will be able to match it.  And why not?  Why is that a problem?\n\n \n\n \n\ni want to say because it will make previous cards useless as all decks will just use the buffed up versions of them i.e. a new dwarven axe with +4 attack etc.\n\nhowever taking your original point in context i now see what you mean-players arent forced to use that new axe instead of the old one, and id probably do the same being a theme guy, so yeah.....your point is understood :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590236","commentId":590236,"userName":"SiCK_Boy","timestamp":1328464959,"content":"It's been stated numerous times in my posts on this topic that I am concerned about the impact on competitive format (amongst other things). We know there's no such thing right now, but FFG promised to create organized play at some point. They even went so far as to change the scoring system in preparation of this, so you can look at it from the \"casual / no competition\" point of view if you want (and I do admit that in such a perspective, the \"don't use it if you don't like it\" is perfect), but some players also want to look at it from a more competitve perspective.\n\nOnce these tournament rules are known (especialy in a 2-player format), it'll be easier to evaluate the impact of Zigil Miner.\n\nAnd this game has an \"easy\" mode. It includes playing with 30 cards decks and ignoring shadow effect. So the current version is already medium. And we also have a \"hard\" version (the Nightmare mode, which the rules support).\n\nAs for power creep, the issue is not so much with quest # 4 of cycle 4. It's with quest # 3 of cycle 1. If that quest, 4 years from now, becomes so easy that any deck beats it with closed eyes (using the whole card pool available then), then you make a huge part of your game useless (or at least less useful). I think it's better for all quests to remain playable and enjoyable over time, and I do hope that Hill Troll in Journey Along the Anduin will still be a challenge 5 years from now. This is what a major (as opposed to a slowly happening, which seems pretty much inevitable) power creep would do.\n\nBut it's also with quest # 4 from cycle 4. That quest should still be playable and enjoyable with a single core set, one major expansion and that specific adventure's card pool. Because they can't assume everyone will always have all the cards.\n\nIn all honesty, designers have themselves quite a challenge with this format (coop game, static opponent). They're bound to do mistakes (this game is a first of its kind, after all), but I'm sure we all which them to keep on producing the same level of quality in that game (ok, I know Glaurung will pipe in here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ).\n\n[i still think Zigil Miner was a mistake, but I won't ask for their head on a plate just for that. The game remains great fun!]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590237","commentId":590237,"userName":"richsabre","timestamp":1328465254,"content":"SiCK_Boy said:\n\n[i still think Zigil Miner was a mistake, but I won't ask for their head on a plate just for that. The game remains great fun!]\n\n\n\nwell said.....its easy with all this arguing...er discussion gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]...to loose sight of that fact, and i couldnt agree more, its still the most fun you can have with a piece of card"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590239","commentId":590239,"userName":"Stenun","timestamp":1328466794,"content":"SiCK_Boy said:\n\nIt's been stated numerous times in my posts on this topic that I am concerned about the impact on competitive format (amongst other things).\n\nIf the problem is a worry about how this will impact on something that doesn't even exist yet ... then, er ...\n\nIs that really a problem??\n\nSurely \"wait and see\" is the obvious answer?  There's no competitive scene right now so let's just carry on with what we have.  :-)\n\nIf we start worring about what might happen in the future then you're never going to leave your house in the morning for fear of a traffic accident ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59423-ffg-is-embracing-zigil-instead-of-taking-actions-to-stop-it/?do=findComment&comment=590256","commentId":590256,"userName":"SiCK_Boy","timestamp":1328470149,"content":"This forum should be seen as a customer feedback tool from the designer's perspective.\n\nI don't see anything wrong with trying to help them NOT make mistakes in the future.\n\nIt's always easier to prevent such mistakes from happening in the first place rather than correcting it after the fact. Other such examples include the scoring system which had to be wrong from the start since they did change it after less than a year of play. Maybe if they'd asked around about their scoring system, someone would have pointed out that it encouraged \"turtling\" (as for whether that is good or bad, they made their mind on it, but they must have missed some obvious facts in the first place, probably by lack of playtesting).\n\nOther such examples where a bigger / more experienced testing team would probably help them include the language (see the thread about dead heroes), the whole turn sequence and action windows, the wording on Frodo Baggins, the overpower of Zigil Miner, etc."}]}