{"url":"https://community.fantasyflightgames.com/topic/59436-measuring-success/","title":"Measuring Success","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=583889","commentId":583889,"userName":"juicebox","timestamp":1327370009,"content":"There have been pieces of thoughtful discussion on other various threads about this topic, and I thought it might be helpful to start a unique thread to focus discussion around how to measure “success” in LOTR LCG.\n\nOpening caveat: some will say that “success” in this game has nothing to do with winning or loosing – it’s all about having a fun and adventurous time. It’s all about theme. It’s all about story. And that is a very fine way to play. In my opinion, that is also a way of evaluating “success.” It’s just not quantifiable – it’s not measurable. Also, by choice, it ignores FFG’s suggestions for how to score games and track results in the quest log. That’s certainly an option. However, for those of us who wish to honor (or are at least intrigued by) the scoring part of the game design and enjoy attempts at measuring (read as quantifying) “success,” here we go…\n\nFor the sake of this discussion, let’s imagine you decide to take a week and see how successful you can be while playing a given scenario. (Sound familiar? gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]) When playing a given scenario, there may be a variety of ways to measure success. Let’s start by exploring two:\n\n1) Lowest Possible Score – no matter how many games you play of the given scenario, no matter how many you win, no matter how many you loose, the bottom line is… how low can you go?\n\nCommentary: This model encourages tracking and scoring wins. Losses become irrelevant (unless you never win). In its extreme, this model by itself inherently encourages deck building with a biased toward calculating the precise combination of cards needed (both in hand and in the encounter deck) that will mathematically result in the lowest possible score. The odds of achieving this low score could be a million to one, but if you play a million times, by the odds, you will eventually obtain that lowest possible score at least one time.\n\n2) Highest Win Ratio – as you play the scenario, you track your number of wins verses your number of losses. The most successful result would be to go undefeated. The least successful result would be to loose every game. Success would be measured in fractions or percentages.\n\nCommentary: This model encourages tracking every single game played – both wins and losses. In its extreme, scoring wins simply becomes a curiosity. When it comes to deck building, the main point (the primary bias) is to obtain a win and avoid defeat in every single attempt. Scoring the win is an interesting afterthought. Surviving every time (or as many times as possible) is the main goal.\n\nExtended Commentary (about Options 1 and 2): In my opinion, I feel uncomfortable with the extreme forms of either of the above options. In the extreme, Option 1 minimizes losses, and Option 2 minimizes the scoring mechanic. Interestingly, I feel that the current FFG scoring system and quest log places premium on Option 1. In all of the formal instruction from FFG, obtaining the lowest score is what seems prized. Period. Feel whatever you like about it, but there has been no serious FFG directive track your win-loss ratio. That said, I think most of us who have been involved in this conversation are not fully satisfied with either of these options (or with FFG’s seeming bias toward Option 1). I think what we are really after is…\n\n3) Hybrid: Highest Win Ratio + Lowest Possible Score – as you play the scenario you log every single game, tracking your wins, losses, and the scores of your victories.\n\nCommentary: This model values wins, losses, and final scores. However, it also requires combining two separate measuring systems and the formation of a new way of ranking player results that factors in both of the measuring systems. Further, there are options on this variant to value score averages and/or your lowest achieved score. Both are interesting, and in some ways land the discussion right back to a renewed version of the debate between Options 1 and 2 from above. Hmmmmm…\n\nAnd this is where I am left considering. I am hoping that it’s possible to find an elegant way of ranking player results that will factor in both win-loss ratio and final score. I believe it can be done. I would imagine that in the entire history of the world of sport, this kind of problem has been tackled before and met with some reasonable and pleasing result. I’m just not settled on it at the moment, and so I’m hoping that anyone who reads this will be inspired to consider ideas and possibilities and share your thoughts. Perhaps together we can find a more satisfying way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=583935","commentId":583935,"userName":"Rashley","timestamp":1327380540,"content":"No one has been 100% happy with the scoring system, and probably never will be.  I heartily agree that 'success' should be measured by the fun and enjoyment you had playing it.  Losses can also be fun.  One other criteria that can be employed is to see who can build a deck(s) that do best against all the scenarios.  Again you would have to decide what is 'best'.  Probably most % of wins with ties decided on lowest scores for wins.  However, this isn't perfect as the longer/higher difficulty scenarios probably score more points.  A few scenarios are also dependant on getting the right cards at the right time and can sometimes be won very quickly or take a very long time.  It could be argued that a deck that lasts longest under difficult conditions is 'better' than one that wins/loses very quickly.\n\nIt all depends on taste.  I know that many were complaining that the game was getting too easy - nonsense as there are plenty of ways to add difficulty - so prehaps the measure of 'success' could be winning by the narrowest of margins. ie:- the highest score.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=583946","commentId":583946,"userName":"SiCK_Boy","timestamp":1327383198,"content":"I'd measure success first and foremost by the win-loss ratio. To me, that's the main objective when I start a game: to win it. I consider it sorta like a puzzle or any other intellectual challenge.\n\nThe scoring system itself is nice to put a number to it, but I'd rather play a deck that shows consistent win % rather than one that fails 75 % of the time, but obtain a great score on the one time it wins."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=583951","commentId":583951,"userName":"Memetix","timestamp":1327383701,"content":"Great post, I'm in total agreement that a separate thread for this topic makes sense.\n\n\nHaving played in a couple of your tournaments, in order to get the \"best\" score I find myself taking more and more risks, and hence relying more on luck on the turn of the next encounter card. It is an interesting intellectual challenge to design a deck to get the lowest score, but I don't enjoy the games as much and I don't think it improves my overall game play.\n\n\nThis highlights an important point, whatever scoring system is used, players will end up designing decks and using a play style to get the best score in that system. The scoring system essentially defines what constitutes a good deck and a good play style. In my opinion the current scoring system is driving the wrong behaviors.\n\n\nThe original scoring system promoted decks that took control of the board then healed their heroes and reduced their threat before completing the final phase of the quest. This was pretty tough on Tactics decks which struggle to achieve either sub-goal.\n\n\nThe updated scoring system tried to address this by penalizing decks that \"hung around\" to achieve these sub-goals. If you weren't able to improve your final score by more than 10 points a turn, it was now better to complete the quest quickly. On the surface this seems like an improvement, but experience has shown that it instead promotes risk taking.\n\n\nSo what criteria would a good scoring system have?\n\n\n• It would promote player skill (in both deck building and play)\n• It would minimize luck\n• It would be easy to record\n• It would be easy to explain and understand\n\n\nI'm sure there are others ....\n\n\nAnother thing that makes psychological sense is to make a bigger score better, i.e. a system where a score of 50 is better than a score of 40.\nRather than reinvent the wheel, here are some examples of scoring systems from other sports/games that try to address some of the criteria above.\n\n\nReducing the impact of luck.\nIn sports like Ski jumping and Ice skating there are several judges, each give a score independent of the other judges. The best and worst scores are rejected and the others averaged. Converting this to LotR, we could play 5 games, ignore the best score and the worst score and average the remaining 3.\nWhen it comes to a tournament I would imagine that the order of cards in the encounter deck would need to be set the same for all players, somewhat similar to bridge tournaments. Of course there are cards that cause a reshuffle of the encounter deck, but there still needs to be some luck in the game.\n\n\nEase of tracking the score.\nLet’s be honest, even though tracking how many turns you’ve played seems like an easy thing to do, it is also very easy to make a mistake and miss a turn or two. Keeping track of time might be easier and just as effective.\n\n\nPulling it all together.\nYou could set a time limit, say 90 minutes, for a competition round. Play as many games as you like in that time. If you’ve played 5 or more games, ignore the best and the worst scores and average the remaining scores to give your result. If you don’t manage 5 games, you don’t get a score.\nA loss should score 0 points.\nYour score for a game you win should be 75 minus the score worked out using the original scoring system in the rulebook. This ensures a higher score is better. If you want to take time to reduce your threat and heal your characters to get a better score, you can, but you are using up your time!\n\n\nExample\nIf you finish on 42 threat with 2 damage on heroes and 6 victory points your score would have been 38. Your new score is 75-38 = 37 points.\nIf you play 6 games with scores of 37, 0, 40, 32, 60, 0 you would ignore one of the 0’s and the 60 and average the others (37, 0, 40, 32) giving a final score of 27¼"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584017","commentId":584017,"userName":"snaggrriss","timestamp":1327395940,"content":"i agree wih comments on low scores. they involve luck, risk taking and doing it dozens of times. you might have the lowest score in the world, but how many tries did it take you? a few? a hundred?. . my friend and i have a point margin we gauge our decks on.take in account the difficulty of the level, your win/loss ratio to see how successful we were with our decks. if some one could come up with a formula that factored win/loss ratio, score averages and difficulty, you would come up with a satisfactory way to gauge yourselves.\n\nbut bottom line for us --fun. to mix it up and challenge ourselves, we'll randomly choose heroes and build our decks accordingly. we'll play a scenario untill we beat it a couple times. after that it's for challenge and fun, not a lucky high score.\n\nthis is lotr lcg. not chess. billy fisher was the best that ever played. he spent every waking moment studying the game and analyzing it. how much fun do you think he had?  the best chess players usually become paranoid mental cases. some people play to be the best that ever was. others play it for fun. to challenge themselves is sufficient. if you're a mathmatical genius, yeah, you'll probably bore easily with an lcg. you should play chess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584209","commentId":584209,"userName":"RGun","timestamp":1327416596,"content":" I consider win % the best indicator of success.  That being said, if there was a way to assign a \"score\" to a failed game then you could take the average score of all games played against a specific quest as the score.  Would have to come up with some way to assign a fairly high score to a failure - perhaps based on the difficulty level (i.e. a higher difficulty level equates to a higher score for a loss).  The score for losing a scenario needs to be significantly higher than what the score for a good win would generally be (i.e. don't want losses to end up scoring better then wins except in some extreme cases)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584353","commentId":584353,"userName":"player582283","timestamp":1327437507,"content":"#1 metric of success for me - Am I having fun?  I do roughly track Wins and Losses on the different scenarios with different decks though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584388","commentId":584388,"userName":"Zjb12","timestamp":1327442714,"content":"RGun said:\n\n I consider win % the best indicator of success.  That being said, if there was a way to assign a \"score\" to a failed game then you could take the average score of all games played against a specific quest as the score.  Would have to come up with some way to assign a fairly high score to a failure - perhaps based on the difficulty level (i.e. a higher difficulty level equates to a higher score for a loss).  The score for losing a scenario needs to be significantly higher than what the score for a good win would generally be (i.e. don't want losses to end up scoring better then wins except in some extreme cases).\n\n\n\nWhat numer do you think that would be?  If you did say, 25, with a rating 7 quest, a loss would be 175.  Does that seem fair?  I think it could be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584455","commentId":584455,"userName":"RGun","timestamp":1327458178,"content":"Another approach that would include % of wins into the equation would be to use a weighting factoring based on the % of games won.  The formula could be (AVERAGE SCORE OF GAMES WON) * (TOTAL GAMES PLAYED / GAMES WON).  So for example, if you played 5 games and won 3 with scores of 75, 100 and 125 then your net score would be: ((75 + 100 + 125) / 3) * (5 / 3) = 100 * 1.67 = 167.  If you had won all 5 games for a 100% win percentage then the weighting multipler would have been 1 and your net score would be 100.  For a tournament, everyone could be required to play the same number of games - e.g. play a scenario 5 times.  This would avoid someone getting lucky and winning the first 2 games and then stopping.  Pick enough games so that the luck factor of lucky draws from the encounter deck gets nullified to some extent.\n\nYou could also divide by the quest difficulty rating if you wanted to have a comparison between scenarios.  e.g.  ((AVERAGE SCORE OF GAMES WON) * (TOTAL GAMES PLAYED / GAMES WON)) / QUEST DIFFICULTY.  Although ratings don't seem to be an exact science so not sure how useful this would be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584457","commentId":584457,"userName":"leptokurt","timestamp":1327458289,"content":"Both win ratio and scores should be combined to measure a player's success. If you only use the score, then you'll see those rushing games like in the recent tournaments, which is also fun, but doesn't say much about the player's ability and the quality of his deck. If we'd only use the win ratio though we 'would be back at where we started - players satlling their progress deliberatly until they have enough allies and attachments for an easy win. I dislike the latter which is why I prefer the new scoring system which has been a big step into the right direction.\n\n \n\nFor a tournament I could see the following measuring system:\n\nYou play X games and add the points of your wins. Divide the result through the win ratio.\n\n \n\nExample:\n\n \n\nPlayer A plays 10 games. He won 8 of them and scored 100 points in each.\n\n8 x 100 = 800\n\nwin ratio = 0.8\n\n800 / 0.8 = 1000\n\n \n\nPlayer B plays 10 games. He won 5 of them and scored 60 points in each.\n\n6 x 100 = 600\n\nwin ratio = 0.5\n\n600 / 0.5 = 1200\n\n \n\nPlayer C playes 10 games. He won all of them and scored 110 points in each.\n\n10 x 110 = 1100\n\nwin ratio = 1.0\n\n1100 / 1.0 = 1100\n\n \n\nIn the example, player A would win the contest as he had better results on average than player C and was more successful in total than player B. Player B would loose against player C despite having the far better results, because his win ratio sucks.\n\n \n\nEdit: crossposted with RGun who apparently has the same idea happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584571","commentId":584571,"userName":"Memetix","timestamp":1327483555,"content":"There are lots of good ideas so far, I hope we can start to pull some of the better ones together into a coherent scoring system.\n\nI've had a few more thoughts on how to measure success. I started with the question.\n\nIf 2 players compete against the same quest, both play 5 games and both win 5 games, which is the better deck?\n\nWhat if they both play 10 times and win 10 times?\n\nWhat if one of those decks manages to control the threat level, always winning on zero threat. Does that really make it better than the other deck?\n\nIf the zero threat deck wins 9 out of 10 (with zero threat) and the other deck wins 10 out of 10 (with an average final threat level of 45), which deck is better?\n\nOf course, there is no right or wrong answer to these questions. The thing is, asking those questions helped me realise that maybe we don't need to consider threat at all. Maybe all we need to count is the number of VP's acquired and subtract points for each hero that died. Lets say 5 points per hero death. If you fail a quest you are considered to have lost all your heroes. The higher the score, the better. Interestingly this means if you play a 2 hero deck then you only subtract 10 points when you lose which may open up some more options.\n\nPlay 5 games and add up your scores and you have a pretty good measure of how consistent a deck/player is.\n\nThis method has a few key advantages.\n\n 1. It doesn't penalise you for not playing spirit to reduce your threat. Threat still plays an important part of the game (engagement checks/secrecy/losing at 50) but it is not part of your final score\n 2. It doesn't penalise you for not playing lore. You don't need to heal your heroes to increase your score.\n 3. You can play Tactics as its meant to be played, putting damage on Gimli is meant to be a benefit after all.\n 4. It is really simple to track. Add up your VP's at the end of the game and take off 5 for each dead hero. Done\n\nAny thoughts on this idea? Can we really ignore threat and damage and end up with a good measure of success? I think so!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584583","commentId":584583,"userName":"leptokurt","timestamp":1327485156,"content":"Memetix said:\n\nThere are lots of good ideas so far, I hope we can start to pull some of the better ones together into a coherent scoring system.\n\nI've had a few more thoughts on how to measure success. I started with the question.\n\nIf 2 players compete against the same quest, both play 5 games and both win 5 games, which is the better deck?\n\nWhat if they both play 10 times and win 10 times?\n\nWhat if one of those decks manages to control the threat level, always winning on zero threat. Does that really make it better than the other deck?\n\nIf the zero threat deck wins 9 out of 10 (with zero threat) and the other deck wins 10 out of 10 (with an average final threat level of 45), which deck is better?\n\nOf course, there is no right or wrong answer to these questions. The thing is, asking those questions helped me realise that maybe we don't need to consider threat at all. Maybe all we need to count is the number of VP's acquired and subtract points for each hero that died. Lets say 5 points per hero death. If you fail a quest you are considered to have lost all your heroes. The higher the score, the better. Interestingly this means if you play a 2 hero deck then you only subtract 10 points when you lose which may open up some more options.\n\nPlay 5 games and add up your scores and you have a pretty good measure of how consistent a deck/player is.\n\nThis method has a few key advantages.\n\n 1. It doesn't penalise you for not playing spirit to reduce your threat. Threat still plays an important part of the game (engagement checks/secrecy/losing at 50) but it is not part of your final score\n 2. It doesn't penalise you for not playing lore. You don't need to heal your heroes to increase your score.\n 3. You can play Tactics as its meant to be played, putting damage on Gimli is meant to be a benefit after all.\n 4. It is really simple to track. Add up your VP's at the end of the game and take off 5 for each dead hero. Done\n\nAny thoughts on this idea? Can we really ignore threat and damage and end up with a good measure of success? I think so!\n\n\n\n \n\nOkay, this would definitely solve a part of the problem. The other issue, namely the rpoblem of those Speedy Gonzalez rushing decks could be solved by using the win/loss ratio.\n\nPerhaps Zjb could implement both in his next tournament with as many layers participating as possible to get a broad basis of feedback."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584601","commentId":584601,"userName":"Memetix","timestamp":1327487045,"content":"leptokurt said:\n\nOkay, this would definitely solve a part of the problem. The other issue, namely the rpoblem of those Speedy Gonzalez rushing decks could be solved by using the win/loss ratio.\n\n\n\nI think my proposal already accounts for that, not as a direct ratio but by assigning a negative score to losses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584614","commentId":584614,"userName":"leptokurt","timestamp":1327489033,"content":"Memetix said:\n\n \n\nleptokurt said:\n\n \n\nOkay, this would definitely solve a part of the problem. The other issue, namely the rpoblem of those Speedy Gonzalez rushing decks could be solved by using the win/loss ratio.\n\n \n\n \n\nI think my proposal already accounts for that, not as a direct ratio but by assigning a negative score to losses\n\n \n\n \n\nYeah, right. I also think that your idea of rejecting the best and the worst score would make sense. Don't like the thought about a fixed timelimit though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584639","commentId":584639,"userName":"juicebox","timestamp":1327491392,"content":"RGun said:\n\nAnother approach that would include % of wins into the equation would be to use a weighting factoring based on the % of games won.  The formula could be (AVERAGE SCORE OF GAMES WON) * (TOTAL GAMES PLAYED / GAMES WON).  So for example, if you played 5 games and won 3 with scores of 75, 100 and 125 then your net score would be: ((75 + 100 + 125) / 3) * (5 / 3) = 100 * 1.67 = 167.  If you had won all 5 games for a 100% win percentage then the weighting multipler would have been 1 and your net score would be 100.  For a tournament, everyone could be required to play the same number of games - e.g. play a scenario 5 times.  This would avoid someone getting lucky and winning the first 2 games and then stopping.  Pick enough games so that the luck factor of lucky draws from the encounter deck gets nullified to some extent.\n\n\n\nOkay, I really like this!\n\nAnd here's why:\n\n1) It completely respects the FFG scoring system, not altering it in the least. That feels quite important to me, actually.\n\n2) It could work well in a tournament setting in that it offers a straightforward way of valuing both low score and win percentage over a set number of plays.\n\nVery nice RGun! aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]x1,000\n\nleptokurt, your idea is basically the same too, just arranging the formula in a slightly different way. I think I like RGun's arrangement the best because visually it factors the elements of score and ratio in a very clean way... (score)*(ratio) = result\n\nOf course, I'm eager to consider other ideas around this discussion over time too, but for me personally this feels quite satisfying. Satisfying enough to try this out for at least a tournament or two in February and see how it actually plays. gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif] Exciting!!\n\nReally, the only drawback I feel is that it forces the same number of plays for everyone participating in the tournament. Not that huge of a deal, but I'm sure no matter what number is selected, some people will wish for more chances and some will wish for fewer. It limits the flexibility there - but maybe appropriately so.\n\nOther random thought:\n\nI've seen several people make comments (on a variety of threads) that amount to people saying that it does not take skill to build a highly risky speed deck. I disagree with this statement. I think it does take skill. It just takes a very specific kind of skill that also minimizes the value of other possible skills that could be incorporated into game play. It does take smarts to figure out the speediest combo. It's also (in my opinion), over time, less satisfying of a game play experience. But it's not dumb or unskillful. That I feel strongly about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584671","commentId":584671,"userName":"RGun","timestamp":1327494982,"content":"Thanks for the feedback juicebox.  I think it's important to find the right balance between how much lows scores versus win % contribute to the overall net score.  Don't want it weighted too heavily in either direction (i.e. don't want win % to totally dominate so that it almost makes low scores irrelevant).  I didn't have a chance to assess my formula too much to see how much of an influence win % has - after we see some results it could be tweeked sightly to add a modifier multiplied against the win % to increase/decrease the weighting that this has on the overall net score to find the right balance.\n\nI also think in a tournament everyone should have to play the same number of games to minimize the luck factor of someone getting good encounter draws in the first couple of games and then stopping.  However, my formula uses the average score so it doesn't really require everyone to play the same number of games in order to get valid scores for comparison purposes...a variant could be everyone has to play a minimum of x games, but with no cap on max games you play.  This eliminates the case where someone gets 1 good (but lucky) score and then stops."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=584679","commentId":584679,"userName":"juicebox","timestamp":1327496218,"content":"RGun said:\n\nThanks for the feedback juicebox.  I think it's important to find the right balance between how much lows scores versus win % contribute to the overall net score.  Don't want it weighted too heavily in either direction (i.e. don't want win % to totally dominate so that it almost makes low scores irrelevant).  I didn't have a chance to assess my formula too much to see how much of an influence win % has - after we see some results it could be tweeked sightly to add a modifier multiplied against the win % to increase/decrease the weighting that this has on the overall net score to find the right balance.\n\nI also think in a tournament everyone should have to play the same number of games to minimize the luck factor of someone getting good encounter draws in the first couple of games and then stopping.  However, my formula uses the average score so it doesn't really require everyone to play the same number of games in order to get valid scores for comparison purposes...a variant could be everyone has to play a minimum of x games, but with no cap on max games you play.  This eliminates the case where someone gets 1 good (but lucky) score and then stops.\n\n\n\nThat's a nice variant idea. I agree that a minimum number of plays prevents someone from posting one lucky first attempt and stopping. I'll think about this more, and maybe in February I'll run one tournament without the variant and one tournament with the variant, seeking feedback as we go. I may also try and do a poll before the February tournaments to elicit feedback ahead of time.\n\nOh, and I forgot to say another reason why I like your idea:\n\n3) Losses have impact in this system. Losses matter - in life and in games, both."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585138","commentId":585138,"userName":"booored","timestamp":1327583816,"content":"juicebox said:\n\nI've seen several people make comments (on a variety of threads) that amount to people saying that it does not take skill to build a highly risky speed deck. I disagree with this statement. I think it does take skill. It just takes a very specific kind of skill that also minimizes the value of other possible skills that could be incorporated into game play. It does take smarts to figure out the speediest combo. It's also (in my opinion), over time, less satisfying of a game play experience. But it's not dumb or unskillful. That I feel strongly about.\n\n\n\n\nYeah, totally disagree with you there.\n\nThe Rabbit decks might take some skill in building the deck, but not in piloting it. If you make a deck that sees less than 10% of the cards IN the deck, and a similar number for the encounter deck? Where is the skill? Where is the decision making .. there is none.. you are just slamming cards and powering though. You are completely relaying on luck, luck in your starting hand, luck in your encounter draw and luck in your card draw.\n\nIs it a legit tactic? Sure. I think the \"risk\" vs \"reward\" factor in the rules and scoring system is pretty cool. Like you can build and run such risky decks and get awesome scores. That doesn't mean the Rabbit deck is any less luck based and THAT is the crux of it.. luck has nothing to do with skill.\n\nThe great thing about the Rabbit decks is that they are very risky, and it is a big tactical decision to run one in a comp, as you know that MOST times you play it you may loose to a single treachery card or drawing a big monster. So do I think it is a legit deck.. sure I do. Do i think it takes less skill to run one? Yes. Do I think the score system should reflect the losses so Rabbit run decks are not the ONLY legit deck to run? Absolutely\n\nRGun said:\n\nAnother approach that would include % of wins into the equation would be to use a weighting factoring based on the % of games won. The formula could be (AVERAGE SCORE OF GAMES WON) * (TOTAL GAMES PLAYED / GAMES WON). So for example, if you played 5 games and won 3 with scores of 75, 100 and 125 then your net score would be: ((75 + 100 + 125) / 3) * (5 / 3) = 100 * 1.67 = 167. If you had won all 5 games for a 100% win percentage then the weighting multipler would have been 1 and your net score would be 100. For a tournament, everyone could be required to play the same number of games - e.g. play a scenario 5 times. This would avoid someone getting lucky and winning the first 2 games and then stopping. Pick enough games so that the luck factor of lucky draws from the encounter deck gets nullified to some extent.\n\nYou could also divide by the quest difficulty rating if you wanted to have a comparison between scenarios. e.g. ((AVERAGE SCORE OF GAMES WON) * (TOTAL GAMES PLAYED / GAMES WON)) / QUEST DIFFICULTY. Although ratings don't seem to be an exact science so not sure how useful this would be.\n\n\nDude, we are talking about a game that children play. My 9 year old son can not do this math. It is confusing to even adults. I mean look at your instructions!! You are going to introduce a new problem, input error and do not say your not. You have fractions, % calculations, rounding, and averages. .. . . what a mess. You also do not say what you do with your remainders... as it is not 1.67 it is in fact 166.6666666666667, so witch one will people use and even if you did say that you have placed a \"rounding\" factor on top of it...\n\nStill the REAL problem with it, apart form it being so unwieldy, is that your score system encourages conceding. Like why would I play to the end of a match when I can just concede for a score of 0 that has nearly no effect on the final tally. At least not the same effect as limping over the finish with a high score. The ENTIRE point of trying to do this score system is to minimise people grinding at a quest and just playing it a billion times until they get a good score. Your system doesn't really address that, when you can just call concede get a score of zero and have nearly no effect on your final score. In fact your score system encourages conceding, witch was what we are trying to eliminate in the first place.\n\nWe got to just keep this system SIMPLE.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585156","commentId":585156,"userName":"Memetix","timestamp":1327585855,"content":"On the plus side, if we are all playing the same number of games (say 5) then the formula simplifies to\n\n\"Add up all your winning scores, divide by how many games you won then divide by how many games you won again.\"\n\nThat seems pretty simple."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585216","commentId":585216,"userName":"leptokurt","timestamp":1327590640,"content":"booored said:\n\n \n\n \n\nDude, we are talking about a game that children play. My 9 year old son can not do this math. It is confusing to even adults. I mean look at your instructions!! You are going to introduce a new problem, input error and do not say your not. You have fractions, % calculations, rounding, and averages. .. . . what a mess. You also do not say what you do with your remainders... as it is not 1.67 it is in fact 166.6666666666667, so witch one will people use and even if you did say that you have placed a \"rounding\" factor on top of it...\n\nStill the REAL problem with it, apart form it being so unwieldy, is that your score system encourages conceding. Like why would I play to the end of a match when I can just concede for a score of 0 that has nearly no effect on the final tally. At least not the same effect as limping over the finish with a high score. The ENTIRE point of trying to do this score system is to minimise people grinding at a quest and just playing it a billion times until they get a good score. Your system doesn't really address that, when you can just call concede get a score of zero and have nearly no effect on your final score. In fact your score system encourages conceding, witch was what we are trying to eliminate in the first place.\n\nWe got to just keep this system SIMPLE.\n\n \n\n \n\n \n\n \n\n \n\nWe are talking about a game where you have to be a lawyer to understand all the rules and you complain about some simple maths? Using a win/loss ratio without having periods is almost impossible, as a ratio is per definitionem a quotient. If one can make sure that the denomintaor is always a 5 or a 10, this problem could be solved though.\n\n \n\nI know what you want to say about the problem about conceding, but I think that's part of the general scoring system in which an epic fight against a series of mean encounters gives you a lesser score than rushing through some easy encounters. However, as some folks already said: the more you loose, the bigger the impact. Even a good deck and a good player can loose from time to time, if they draw some bad encounters, so I don't consider it a big problem if a single loss has only little influence on the overall result, as it allows you to take at least some risks instead of paying it safe all the time.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585238","commentId":585238,"userName":"booored","timestamp":1327592387,"content":"the point though is that you can concede at anytime.. like say yo play and you are going to win but you do not like your score.. you can just concede and get a better \"meta\" score by calculating zero.\n\n \n\nExample....\n\nUsing the values in the 1st post...\n((75 + 100 + 125) / 3) * (5 / 3) = 166.6666666666667 (1.67)\n\nBUT.. what if I did the same.. but decided to concede two of them at the last minuet... this calculation becomes...\n\n((0 + 100 + 0) / 3) * (5 / 3) = 55.55555555555556 (55.6)\n\nso basically what this score system dose is say... just concede ANYTHING that is not a good score. In fact playing a ton of games at 0 is better than just getting a great score 1st turn. This system encourages conceding even more than the old one.\n\nSo yeah.. this is useless even worse than the original, good idea .. but needs work to iron out these problems\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585241","commentId":585241,"userName":"booored","timestamp":1327592688,"content":"oh wait.. hang on.. I think I have this all backwards.. the calculation would be...\n\n((0 + 0 + 100 + 0 + 0) / 1) * (5 / 1) = 500\n\nHmm.. ok .. I see how this works now... still complex.. but your right it dose work a lot better than I thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585651","commentId":585651,"userName":"HilariousPete","timestamp":1327665836,"content":"Yeah, I'm astonished, too! I thought I could trick the formula somehow. But that's not possible. At least as long as the score you want to take out of calculation is less than the double of the average of your other scores. Basically, this is because we're dividing 2 times through the number of the games won. (The exact value is not 2 but 2.25).\n\nExample1 : 4 games won with score 100, 1 bad game won with 220.\n\nWithout counting the last game as a loss: (100 + 100 + 100 + 100 + 220)/5  * (5/5) = 124. With counting it as a loss: (100 + 100 + 100 + 100 + 0)/4 * (5/4) = 125. So you're better of not counting it as a loss.\n\nBut example 2: 4 games won with 100, but the bad game has been won with 230:\n\nWith the bad game: (100 + 100 + 100 + 100 + 230)/5 * 5/5 = 126. Without the bad game: (100 + 100 + 100 + 100 + 0)/4 * (5/4) = 125. So here it would be better to willingly get all heroes killed and lose the game.\n\nHow often does it happen that you have a bad game that has a score more than 2.25 compared to your other scores? I guess it could be a few times, because of Dead Marshes (consider a game where you have to skim the encounter deck twice for Gollum...)\n\n \n\nWe could even improve the formula if we divided 3 times through the number of the games won. So the new formula would be:\n\n(sum of all scores) * (g * g) / (w * w * w)\n\nwhere w is the number of the games won, and g is the number of all games (won or lost or conceded). The factor needed to take advantage of willingly losing a game is (3g² -3g + 1)/(g² -2g +1). For 5 games, this is 3.8125. Examples like above:\n\nExample 1: 4 games won with 100, 1 bad game with 380.\n\nWith the bad game: (100 + 100 + 100 + 100 + 380) * 5 * 5 / (5 * 5 * 5) = 156. Without the bad game: (100 + 100 + 100 + 100 + 0) * 5 * 5 /(4 * 4 * 4) = 156.25\n\nExample 2: 4 games won with 100, 1 bad game with 390:\n\nWith the bad game: (100 + 100 + 100 + 100 + 390) * 5 * 5 / (5 * 5 * 5) = 158. Without: (100 + 100 + 100 + 100 + 0) * 5 * 5 /(4 * 4 * 4) = 156.25\n\nHow many times do you think it happens that someone loses a game with more than a factor of 3.8 of his points than usual?\n\nAnd what do you think of the new formula in general?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585677","commentId":585677,"userName":"Zjb12","timestamp":1327668586,"content":" So, today I played 5 games of the tournament for this weekend, just to double check how hard it was and if it was winnable.  I went 2-3.  That means the weighted factor is 2.5 times the average score, ouch!  So the quest is winnable, but scores could be high if you lose more games than you win!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585692","commentId":585692,"userName":"booored","timestamp":1327670794,"content":"Pete... go back to your physics thesis!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585702","commentId":585702,"userName":"booored","timestamp":1327671497,"content":"so using the old values form before...  5 games, 3 wins, 2 losses.... so\n\n(sum of all scores) * (g * g) / (w * w * w)\n\n(0 + 0 + 75 + 100 + 125) * (5* 5) / ( 3 * 3 * 3) = 300 * 25 / 27 = 277.7777777777778\n\n?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585805","commentId":585805,"userName":"HilariousPete","timestamp":1327682477,"content":"booored said:\n\nPete... go back to your physics thesis!\n\n\n\nhehe :-)\n\nYes, rounded I also get 278 in that case"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585880","commentId":585880,"userName":"RGun","timestamp":1327693017,"content":"Interesting analysis.  One thing to consider is how much influence win % should have on the final score versus the actual quest scores.  There is no right answer, more a matter of preference, but if you increase the win % rating factor too much than the win % becomes essentially what determines the overall winning score, and the average quest score becomes more of a tie breaker when players have the same win %.  When I came up with the original formula I was looking for something that would be simple and intuitive to the average player (i.e. multiply average score times win %) while factoring win % in a meaningful way into the score calculation.  Your analysis raises an interesting fact in that at some point it becomes better to concede then use the final score, which I intuitively don't like yet I wonder how often someone's scores will vary so significantly that this becomes an issue.  Still, I think it warrants some more thought on if there is a tweak that can be made which fixes this issue, while not giving win % too much weight. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585887","commentId":585887,"userName":"juicebox","timestamp":1327694524,"content":"Hmmmmm... very interesting indeed.\n\nPersonally, my bias is to keep things as \"simple\" as possible.\n\nHowever, if I understand this right, the tension lies between the possibility of there being a certain threshold where a player would decide it is more advantageous to forfeit a game (and take a loss) than see it through to its epic 20+ round conclusion vs the possibility of the system aimed at holding that possibility in check too heavily valuing Win Ratio as compared to Score when it comes to factoring for a final weighted result. Am I following that right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=585919","commentId":585919,"userName":"RGun","timestamp":1327704025,"content":"Yes, correct.  I'm not sure if it is a huge issue if someone is doing so badly on a specific run through compared to their other rounds that they just decide to pack it in rather than finish and count it as a loss.  With current simple approach the win ratio is still fairly heavily weighted so someone with several losses will probably not get a top score anyways.  As well, you have to be doing quite a bit worse than your other scores to even make it worthwile to do this so I don't think it is something that would happen a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586000","commentId":586000,"userName":"HilariousPete","timestamp":1327721473,"content":"RGun said:\n\n \n\nThere is no right answer, more a matter of preference, but if you increase the win % rating factor too much than the win % becomes essentially what determines the overall winning score, and the average quest score becomes more of a tie breaker when players have the same win %. \n\n...\n\nyet I wonder how often someone's scores will vary so significantly that this becomes an issue.  Still, I think it warrants some more thought on if there is a tweak that can be made which fixes this issue, while not giving win % too much weight. \n\n \n\n \n\nThat's absolutely right. If we overdo it (e.g. we would divide 4 times through w, the actual scores will really be only a tie-breaker. We can use the \"put up or shut up Rhosgobel\" thread and Zjb12's current 48-hrs-competition to test our formulas if they \"feel right\" in determining the winner, when there are enough games posted. Say a week or so. And after that, we could do the same with with the Dead Marshes. I think in all the other quests, you usually don't score with 225 instead of 100 (or 381 instead of 100 for my formula). But in the Marshes, this could happen. (We should ban Denethor and Shadows of the Past because players will especially include them to manipulate the encounter deck. And we have to find players who go to the bitter end if Gollum escapes and search the encounter deck for him...)\n\nFor a quick-fix: Good idea, why not count losses and conceded games as fixed 50 pts for solo, 100 pts for 2 player games an so on, in addition to the formula by you, RGun and leptokurt? I calculated it, if A is the average score of the normal games (100 in my previous examples) and B is the score of the bad game, you can take advantage if B > 2.25 * A + 78.125   (that's for 5 games again).\n\nInitial example:\n\n(75 + 100 + 125 + 50 + 50)/3² * 5 = 222.22... (I assumed a solo game and put the 2 last=lost games to 50).\n\nExample so you see the B>2.25A + 78.125 formula works: The limit where it is advantageous to concede a game if the avg score of \"normal\" games is 100 would be 225+78.125 = 303.125:\n\nwithout conceding: (80 + 120 + 80 +120 + 303/5²*5 = 140.6      With conceding: (80 + 120 + 80 + 120 + 50)/4²*5 = 140.625     So if someone wants to take advantage of willingly lose a game and not scoring, this game is \"worth\" a won game of 303 points. Quite ok, I guess. (If he concedes 2 games, then number is even bigger.)\n\n \n\nEDIT: I just noticed the Living Tournament. So we have 3 competitions going on for getting data, great :-D"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586110","commentId":586110,"userName":"plueschi2","timestamp":1327742794,"content":" Hmmm,\n\n \n\nhere is how I would do it: Each player gets scored based on the number of wins he can pull off (out of a fixed number of games for everybody) and then use the sum of scores of all won games as a tiebreaker.\n\n \n\n \n\nThere are a couple of benefits there:\n\n \n\n1. It is simple!\n\n2. Nobody would lose on purpose to game the scoring system.\n\n3. It puts a bigger weight on the win ratio than on the scores, which is the way to go imho. \n\n \n\nThe Cons\n\n \n\n1. it might re-encourage stalling strategies. But I don't find that too bad, because\n\nA) Stalling doesn't auto-win you 5/5.\n\nB) having different strategies available is healthy for the game.\n\nC) Each \"regular\" deck beats a \"stall\" every time when tie for wins, which is also the way to go imho.\n\n \n\nJust my 2 cents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586125","commentId":586125,"userName":"Zjb12","timestamp":1327744988,"content":"plueschi said:\n\n Hmmm,\n\n \n\nhere is how I would do it: Each player gets scored based on the number of wins he can pull off (out of a fixed number of games for everybody) and then use the sum of scores of all won games as a tiebreaker.\n\n \n\n\n\nIt keeps the emphasis on winning and As well as score.  You know several people might go 5/5, then overall score applies.  Makes easier sense.  Losses then penalize you simply by meaning you weren't 100% proficient.  If you went 4/5 then you will be listed accordingly and score the second decider.  This would still discourage rabbit decks that some people get concerned about as low scoring but infrequent in winning.  There could be some stalling, but wanting your score low would still encourage you not to stall too much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586150","commentId":586150,"userName":"RGun","timestamp":1327748778,"content":"Interesting, but I'm not sure I like the idea of # wins completely trumping score.  If I understand what you're proposing, a deck that wins 5/5 but scores an average of 350 per game would rank higher than a deck that wins 4/5 with an average of 50 per game.  Am I interpreting what you proposed correctly?  While I agree win % should have more of a weighting than score, I don't know that it should completely overshadow score with score just used as a tie breaker.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586175","commentId":586175,"userName":"Zjb12","timestamp":1327752205,"content":" Yeah, it seems like a little of this a little of that, depending on what your measuring.  Do you want consistency or low score?  Ideally you want both.  Now, in my tourney this weekend, I only won 2/5 times, so my weighted factor is going to be high, even though my scores are not bad.  However, if someone else goes 4/5 with scores both above and below me, it seems they played better this quest than I did.  But my weighted average will send my basic average score through the roof, from 144 to 360!  Another way of be to post your average score, 144, but also show your win percentage, .400.  Seems to me, that if someone goes .800 and averages 156 they should beat me.  (and would with a weighted average, but with more than one loss, the weighted average really kills you.). \n\nI am also fighting a head cold, so I may just be speaking jibberish!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586180","commentId":586180,"userName":"plueschi2","timestamp":1327752945,"content":"RGun said:\n\nInteresting, but I'm not sure I like the idea of # wins completely trumping score.  If I understand what you're proposing, a deck that wins 5/5 but scores an average of 350 per game would rank higher than a deck that wins 4/5 with an average of 50 per game.  Am I interpreting what you proposed correctly?  While I agree win % should have more of a weighting than score, I don't know that it should completely overshadow score with score just used as a tie breaker.  \n\n\n\nWell, your scenario is entirely within my proposal. In my opinion winning 5/5 with an average score of 350 (or whatever) is a stronger showing than, stomping the encounter deck with \"recklessness\" and winning 4/5 with an average score of 50. But the most important part is that:\n\nIf the deck that went 5/5 was a \"stall\" deck\" and the deck that went 4/5 was a \"regular\" deck, then can you \"improve\" your regular deck by winning 5/5 with an average score of 100? If, yes than you have beaten the \"stall\" deck. And I think allowing your \"strong regular\" deck more room for a higher score, but winning more consistently is pretty reasonable and a worthwhile achievement.  \n\nHope this clarifies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586182","commentId":586182,"userName":"RGun","timestamp":1327753162,"content":"I think you either need to agree win % trumps average score and score is only used as tie breaker when win % is the same, or you need to combine them into an aggregate score (like was done this tournament).  Just posting both is interesting, but then it is open for debate who ranks higher than who.  Although maybe in a forum like this that is a good thing and encourages some interesting debate, however in a tournament where you want a clear winner defined you need a systemic way to rank the players.\n\nEDIT: cross posted with last response - this was in response to zjb's last post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=586184","commentId":586184,"userName":"plueschi2","timestamp":1327753359,"content":"Maybe I can add a little something more to explain why I value # of wins so highly. Lets say you win 4/5, but your loss was due to \"bad luck\", flipping two Attercops on turn 1 and your deck could not handle that. Now given the number of games played, every player is likely to have some bad starts and, if you manage to recover from those -no matter how high your score in the end- than I truly think you should be higher placed than the deck that simply cannot handle those instances and crumbles, even if it means that your other wins have a higher score, too.\n\n \n\nOf course one deck could have a total of 5 easy games, but there is no way around that and it shouldn't matter too much for the enjoyment of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587446","commentId":587446,"userName":"juicebox","timestamp":1327954812,"content":"In the ongoing attempt to considering a fun, reasonable, and balanced approach to \"measuring success\" in this game, I wanted to summarize a few thoughts from other forum threads...\n\nPersonally, I'm considering rolling out a system of Living Tournaments on this forum that will have no set time frame and would allow players to post results from game play that allows comparison that goes beyond what is currently offered in FFG's Quest Log.\n\nBasically, my hope is to frame the way success is measured in those tournaments in a way that values both low score and win ratio for a given deck/player's performance at a given scenario.\n\nAt this point, I would like to use RGun's approach, ranking results by a player's meta score that measures for both game score and win ratio.\n\nMy personal hope and bias is that this can be achieved by measuring a set of 3 games. However, there has been some discussing around whether sets of 4 or 5 games would be better, and I want to test drive these ideas.\n\nMy plan is to offer a few juicebox Tournaments during the month of February that ask for game play reports to come packaged in sets of 3-5 games (depending on the tournament), and I'm hoping lots of people will play and offer feedback around how the play experience was and how balanced the ranking results seem.\n\nThis will be both a practical experiment and should also be a lot of fun.\n\nIf any of you have compelling reasons for measuring success by sets of either 3, 4, or 5 games, feel free to post your thoughts here.\n\nIn my mind, this seems like the primary remaining question before the Living Tournaments can... well, be born. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587458","commentId":587458,"userName":"SiCK_Boy","timestamp":1327957300,"content":"I don't think anyone went so far as to rationalize why 3 or 5 games would be better than any other number of games in measuring success.\n\nI think the 3 and 5 numbers were thrown arbitrarily simply based upon the argument that the more games you play, the less luck becomes a factor in the outcome. By that logic, we should be considering other numbers (why not 10, or 20, or 100) because it's still possible to get lucky 3 or 5 games in a row.\n\nI think the main discussion around 3 vs 5 had mostly to do with the time involved rather than with the \"worth\" of such results in a theoretical exercise to quantify success in this game.\n\nIn order to really determine how many games is enough to represent a valid statistical pool of results, we'd need to really look at how the encounter decks are made, how much cards are seen in a game and other such factors. This is all way beyond my skills.\n\nYour objectives are to have comparable results over a long period of time. I think you should evaluate what you believe the impact will be on the number of participants you'll have depending on the number of games chosen as the reference. If you think you'll get more participants with a 3 games system, this is what you should choose. I think it's better for someone to see his results compared to many other people rather than just a few.\n\nIn fact, your system should allow for an \"infinite\" number of games. You said that you want to see results for a given \"deck/player\". This is what should be evaluated. A single player should be able to submit an infinite number of results for a given deck. If I play 20 games with a deck, your system will give me an averaged score (including factoring for win %). If I play only 5, I should still get a score. You want to set a minimum number of games to reduce the luck factor in the results, but there should be no maximum. After a while, for any scenario, you should be able to see emerge a \"best player & deck\" combination. If you see most top scores are for similar decks, then we'll know that deck is the best for the scenario. If you see multiple players with each a different deck, we'll see all the viable strategies and \"better\" players should emerge.\n\nAs for the actual implementation of such a system, I'm not sure this forum's interface is the best tool for it. Idealy, you'd want a full database containing all the information. This is starting to look like \"organized play\", such as what we have with the DCI in Magic, for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587489","commentId":587489,"userName":"RGun","timestamp":1327961962,"content":"I tend to agree there doesn't need to be a maximum since the formula uses the average which means it is valid to compare scores even if # games isn't the same.  There should be a minimum of at least 3 though so someone doesn't just get lucky after first play and stop - they could get lucky 3 times in a row but that is a lot less likely. \n\nWere you planning to have people post at least 3 with exactly the same deck, and then they are free to try again with a different deck and post again (assuming at least 3 more with the new deck) or were you planning to let them change cards as many times as they like and just keep sendng in new scores (so just one running set of scores per player)?  Restricting to at least 3 with the same deck makes the results more interesting because you can see what the better decks are, otherwise you just see who the better players are but it will be harder to run it this way and keep track of everything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587501","commentId":587501,"userName":"booored","timestamp":1327965771,"content":"juicebox said:\n\nIn the ongoing attempt to considering a fun, reasonable, and balanced approach to \"measuring success\" in this game, I wanted to summarize a few thoughts from other forum threads...\n\nPersonally, I'm considering rolling out a system of Living Tournaments on this forum that will have no set time frame and would allow players to post results from game play that allows comparison that goes beyond what is currently offered in FFG's Quest Log.\n\nBasically, my hope is to frame the way success is measured in those tournaments in a way that values both low score and win ratio for a given deck/player's performance at a given scenario.\n\nAt this point, I would like to use RGun's approach, ranking results by a player's meta score that measures for both game score and win ratio.\n\nMy personal hope and bias is that this can be achieved by measuring a set of 3 games. However, there has been some discussing around whether sets of 4 or 5 games would be better, and I want to test drive these ideas.\n\nMy plan is to offer a few juicebox Tournaments during the month of February that ask for game play reports to come packaged in sets of 3-5 games (depending on the tournament), and I'm hoping lots of people will play and offer feedback around how the play experience was and how balanced the ranking results seem.\n\nThis will be both a practical experiment and should also be a lot of fun.\n\nIf any of you have compelling reasons for measuring success by sets of either 3, 4, or 5 games, feel free to post your thoughts here.\n\nIn my mind, this seems like the primary remaining question before the Living Tournaments can... well, be born. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n\n\n \n\nIf we do this we should do it proper.. maybe make a better version of teh quest log website.... so peopel can enter and view score lists?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587536","commentId":587536,"userName":"juicebox","timestamp":1327975047,"content":"Okay booored, between you and encouragement from TragicTheBlathering, I decided to create an account on CardGameDB to take it for a test drive. No promises, but I'm certainly going to take your recommendations seriously. It does seem well worth exploring that possibility. After all, I have attempted to contact FFG personnel to ask for a sticky thread here on this site, but I have yet to hear anything back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587543","commentId":587543,"userName":"leptokurt","timestamp":1327976872,"content":"SiCK_Boy said:\n\nI don't think anyone went so far as to rationalize why 3 or 5 games would be better than any other number of games in measuring success.\n\nI think the 3 and 5 numbers were thrown arbitrarily simply based upon the argument that the more games you play, the less luck becomes a factor in the outcome. By that logic, we should be considering other numbers (why not 10, or 20, or 100) because it's still possible to get lucky 3 or 5 games in a row.\n\nI think the main discussion around 3 vs 5 had mostly to do with the time involved rather than with the \"worth\" of such results in a theoretical exercise to quantify success in this game.\n\nIn order to really determine how many games is enough to represent a valid statistical pool of results, we'd need to really look at how the encounter decks are made, how much cards are seen in a game and other such factors. This is all way beyond my skills.\n\nYour objectives are to have comparable results over a long period of time. I think you should evaluate what you believe the impact will be on the number of participants you'll have depending on the number of games chosen as the reference. If you think you'll get more participants with a 3 games system, this is what you should choose. I think it's better for someone to see his results compared to many other people rather than just a few.\n\nIn fact, your system should allow for an \"infinite\" number of games. You said that you want to see results for a given \"deck/player\". This is what should be evaluated. A single player should be able to submit an infinite number of results for a given deck. If I play 20 games with a deck, your system will give me an averaged score (including factoring for win %). If I play only 5, I should still get a score. You want to set a minimum number of games to reduce the luck factor in the results, but there should be no maximum. After a while, for any scenario, you should be able to see emerge a \"best player & deck\" combination. If you see most top scores are for similar decks, then we'll know that deck is the best for the scenario. If you see multiple players with each a different deck, we'll see all the viable strategies and \"better\" players should emerge.\n\nAs for the actual implementation of such a system, I'm not sure this forum's interface is the best tool for it. Idealy, you'd want a full database containing all the information. This is starting to look like \"organized play\", such as what we have with the DCI in Magic, for example.\n\n\n\n \n\nBut if someone plays and wins his first three games, he would have to be batshit crazy to play another game, because he would be considered the winner of this tournament no matter what everyone else would do. A certain database is needed to judge players properly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587569","commentId":587569,"userName":"Memetix","timestamp":1327983189,"content":"Some simple maths ...... based on statistical confidence [http://en.wikipedia.org/wiki/Sample_size_determination].\n\nIf we play N games, we can be 95% confident that we are within 100/(square root N) percent of the real score. The real score is the score you would end up with if you played an infinite number of games.\n\nFor 3 games this gives 57%, for 5 games 45%, 100 games 10%.\n\nIn plain English, if we play 3 games and post of a score of 100 we can be 95% sure that the \"real\" score is between 157 and 43. If we play 5 games then we can be 95% sure that the \"real\" score is between 145 and 55.\n\nI'd been voting for 5 games, rather than 3, because I thought that would iron out some of the luck. It turns out when you run the numbers I was wrong, there is still a +/-45% error margin (i.e. 90% of my score) after 5 games. I should have been voting for 100 games!\n\nI don't like these numbers and I'm hoping someone better at maths can point out my errors, but as it stands the conclusion seems to be we will never get a sample size big enough to \"trust\" the results and be able to post a top ten ordered list of players with any confidence.\n\nThe best method may well have been pretty close to the original one, rank results based on the lowest score, not a weighted average.\n\nI think a more accurate measure would be, \"play 3 games and post your second best score\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587593","commentId":587593,"userName":"SiCK_Boy","timestamp":1327988185,"content":"Memetix: these are the kinds of maths I had in mind. I didn't follow that link, but I guess you support my point.\n\nAbout posting your second best score, I don't think that's whisable. We still want to see \"best scores\", even if they're total lucky fluke, because they then become potential goals to aim for.\n\nIf I make a \"hockey\" parallel (I'm Canadian, heh!), nobody expects a player to score 92 goals these days, but Wayne Gretzky did it one in the 80. It took an unbelievable combination of player skill (he was the greatest) and environment (more open play, different goaltender style, etc). Should we just remove this mark from the record books? No, it's still there, as the mystical objective any scorer should dream of attaining. Even if Gretzky had been a fluke and scored only 10 goals a year for the rest of his career, we would still want to know about that record (although in his case, he did maintain a high average anyway)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587685","commentId":587685,"userName":"juicebox","timestamp":1328003156,"content":"Memetix said:\n\nSome simple maths ...... based on statistical confidence [http://en.wikipedia.org/wiki/Sample_size_determination].\n\nIf we play N games, we can be 95% confident that we are within 100/(square root N) percent of the real score. The real score is the score you would end up with if you played an infinite number of games.\n\nFor 3 games this gives 57%, for 5 games 45%, 100 games 10%.\n\nIn plain English, if we play 3 games and post of a score of 100 we can be 95% sure that the \"real\" score is between 157 and 43. If we play 5 games then we can be 95% sure that the \"real\" score is between 145 and 55.\n\nI'd been voting for 5 games, rather than 3, because I thought that would iron out some of the luck. It turns out when you run the numbers I was wrong, there is still a +/-45% error margin (i.e. 90% of my score) after 5 games. I should have been voting for 100 games!\n\nI don't like these numbers and I'm hoping someone better at maths can point out my errors, but as it stands the conclusion seems to be we will never get a sample size big enough to \"trust\" the results and be able to post a top ten ordered list of players with any confidence.\n\nThe best method may well have been pretty close to the original one, rank results based on the lowest score, not a weighted average.\n\nI think a more accurate measure would be, \"play 3 games and post your second best score\".\n\n\n\nSo, what's the difference between playing 1 game and playing 3 games?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587711","commentId":587711,"userName":"Memetix","timestamp":1328007035,"content":"Using the formula, 1 game says the real score is +/- 100% of the one-off score.\n\ni.e. 95% of the time, if you get a score of 100 your real score would be between 0 and 200."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587763","commentId":587763,"userName":"RGun","timestamp":1328013870,"content":"I agree without playing significantly more games the variance can still be fairly large, but I believe one of the goals when this thread started was to penalize players for having decks that are designed to score very low and finish the quest quickly when a specific draw comes up from the encounter deck/player hand, but are not designed to win consistently.  The general consenus from people who have posted seems to be that it is as, if not more important, for a deck to be able to win consistently as well as score low.  Without taking into account win % you don't measure that and have no incentive for people to make sure their deck can not only score well, but also win consistently.  Even if the variance is still high, at least people are forced to create consistent winning decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587965","commentId":587965,"userName":"snaggrriss","timestamp":1328038006,"content":"i think it would be better to make the penalty for rounds 3-5 points. not ten. e.g. i'm on round ten . theres 7-10 victory pnts in play. now, i know a round is 10 pnts, why bother with killing those trolls. we usually go with blind chance  and quest all the characters and hope for the best. all your victory points combined rarely equal 10 points. one game you get a troll and it takes 2-3 rounds to kill him. i only get-what? 4 pnts?! another game i don't draw him or he gets discarded through shadows. i win 3 rounds earlier. 4 versus 30 points. not balanced. 3-5 points per round seems better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=587981","commentId":587981,"userName":"juicebox","timestamp":1328040023,"content":"RGun said:\n\nI agree without playing significantly more games the variance can still be fairly large, but I believe one of the goals when this thread started was to penalize players for having decks that are designed to score very low and finish the quest quickly when a specific draw comes up from the encounter deck/player hand, but are not designed to win consistently.  The general consenus from people who have posted seems to be that it is as, if not more important, for a deck to be able to win consistently as well as score low.  Without taking into account win % you don't measure that and have no incentive for people to make sure their deck can not only score well, but also win consistently.  Even if the variance is still high, at least people are forced to create consistent winning decks.\n\n\n\nAgreed.\n\nAnd from the math that Memetix shared (thanks Memetix), another way to look at this is...\n\n\"Wow, 3 games in a row is a huge improvement in measuring consistency compared to 1 game in a row!\" gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nYes, improvement incrementally goes up from there, the more games that are played, but I also agree with the \"playability\" factor. My imagination says, more people will be inclined to join in the gaming system if asked to play 3 games in a row with the same deck than will join in if asked to play more than that. So, I'm curious to get feedback from participants in February tournaments to see how the feedback matches (or doesn't match) with my imagination.\n\nOn a side note, I'm curious, for those who play a lot of mulit-player, how much does this conversation even have relevance? It seems like it's a lot easier to build a fragile rabbit deck and blow through a bunch of quick losses to achieve that one lucky sensational win in solo play than it is in multiplayer (just for the sheer social dynamic of the experience alone), but I'd be curious to hear what others think about this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=588301","commentId":588301,"userName":"RGun","timestamp":1328098630,"content":"Has anyone submitted something to Fantasy Flight with some requests for enhancements to their Quest Log (and receive any response)?  I really like the idea of these Living Tournaments for each scenario, and think it would be relatively easy for FF to make some updates to their Quest Log to allow tracking of them via that mechanism.  Perhaps they are waiting until they announce the tournament rules (although I know some people are sceptical that this will ever happen)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=589238","commentId":589238,"userName":"Memetix","timestamp":1328241468,"content":"With all the great ideas that have come up for scoring tournaments I've pulled together something that I'd like to propose we run alongside the current RGun weighted scoring system and see how the two systems compare.\n\nFeatures of the \"Hero system\"\n\n * It works if you play 1 game, or multiple games\n * It is really simple to calculate and doesn't involve tracking anything extra during the game\n\nTo calculate your score at the end of a game\n\n * Add up the victory points you collected in the quest\n * If you won, add 40 points and then subtract the threat of each hero you used\n * Subtract the threat of each dead hero. If you failed the quest, assume all your heroes died.\n\nThe bigger the score, the better you did. When playing multiple games, simply add up the scores for each game played. As long as everyone plays the same number of games, the totals can be used to rank players.\n\nThis scoring system is designed to promote\n\n * Deck consistency, bringing your heroes back alive\n * Heroic deeds. Not only did we deliver the message but we killed a Troll!\n * Variety in deck design and play styles. It shows no scoring bias towards decks that manage threat or healing, you can win just as well with a tactics deck as with a spirit/lore deck\n * Winning against the odds, you'll get a better score with lower threat heroes. You'll get an even better score if you can win with 2 heroes\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=589338","commentId":589338,"userName":"Budgernaut","timestamp":1328264139,"content":"Memetix said:\n\nTo calculate your score at the end of a game\n\n * Add up the victory points you collected in the quest\n * If you won, add 40 points and then subtract the threat of each hero you used\n * Subtract the threat of each dead hero. If you failed the quest, assume all your heroes died.\n\n\n\nWait, so whether you lost or won you still subtract the threat of each hero? So if you had Eleanor and she died, but you won in the end, you'd subtract her threat (7) from your final score twice for a total of 14 subtracted from your final score? Is that the idea?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=589521","commentId":589521,"userName":"booored","timestamp":1328286032,"content":"This is getting to complex... I think the original ideas were the best... have a set number of games for each score say 3 or 5. Use the normal score system by FFG, then apply a formula to those scores using wins/fails/total games to get a meta score.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=589593","commentId":589593,"userName":"Memetix","timestamp":1328293736,"content":"Here's an example of the \"Hero System\" scoring\n\nIf it came across as complex that was my fault, it is far easier than the current system becasue it only uses the threat values of the heroes and the Victory points.\n\nYou go on a quest with Dain, Gloin and Berevor (Starting threat 30)\n\nFirst game you win, no one dies but no VPs.\n\nScore = 40 - 10 = 10\n\nSecond game, you win again but Gloin dies however you kill the troll that finished him off.\n\nScore = 4 VPs + (40-10) - 9 (Gloin) = 5\n\nThird game, you lose but kill the hummerhorns and the march adder\n\nScore = 8 VPs - 30 = -22\n\nOverall score for 3 games is 10+5-22 = -7\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59436-measuring-success/?do=findComment&comment=589609","commentId":589609,"userName":"muemakan","timestamp":1328296872,"content":"Memetix said:\n\n \n\nHere's an example of the \"Hero System\" scoring\n\nIf it came across as complex that was my fault, it is far easier than the current system becasue it only uses the threat values of the heroes and the Victory points.\n\nYou go on a quest with Dain, Gloin and Berevor (Starting threat 30)\n\nFirst game you win, no one dies but no VPs.\n\nScore = 40 - 30 = 10\n\nSecond game, you win again but Gloin dies however you kill the troll that finished him off.\n\nScore = 4 VPs + (40-30) - 9 (Gloin) = 5\n\nThird game, you lose but kill the hummerhorns and the march adder\n\nScore = 8 VPs - 30 = -22\n\nOverall score for 3 games is 10+5-22 = -7\n\n \n\n \n\n \n\nI think it won´t work because most of the time the guy who starts with the lowest threat wins."}]}