{"url":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/","title":"Scoring - Can We Have a Third Option","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/?do=findComment&comment=584269","commentId":584269,"userName":"wraith428","timestamp":1327425201,"content":"So I'm starting to have a problem with the new scoring system.\n\n \n\nOriginally the scoring system didn't care how long you took to complete the quest and encourage turtling deck builds where you postpone the quest until you have built up your allies, attachments and resources and then took off full bore and slaughtered the quest... preferably after reducing your threat to next to nothing.\n\n \n\nNow the scoring system increases your score by a large factor every round encouraging rush decks where you do everything you can to complete each leg of the quest as quickly as possible.\n\n \n\nHaving played in a number of the Juicebox online tounaments now which are semicompetative I have to say I'm less than impressed with the scoring system as all that matters for a win is speed.  Speed is key.  How quickly can you complete the quest.  Most everything else is secondary. \n\n \n\nThis puts the Tactics Sphere at a severe disadvantage and looking back at the tournaments you rarely see much in the way of Tactics in the top 10.  It also encourages heavy Spirit Sphere (rohan quest speed plus threat reduction) and Leadership Sphere (resource acceleration, plus sneak attack Gandalf) with the occassional inclusion of the Lore Sphere (card draw or in the case of Rhosgobel, healing.)  Quite honestly I'm starting to find it a little boring. \n\n \n\nI feel like there has to be a middle ground where we can encourage multiple styles of play including rush and stall and beaters and etc.  But I'm not sure what that is.  \n\n \n\nSome Random Ideas\n\n \n\nWhat if the difficulty of the quest was a factor.  Say you take the number of rounds played minus the difficulty of the quest (min of 0) and then multiply the result by 10 to determine your final score.\n\n \n\nWhat if there was a Gandalf Penalty.  Gandalf is a pretty powerful card.  What if every time he shows up to bail your ass out of the fire you take a penalty to your final score? \n\n \n\nWhat if there was a bonus for killing your enemies.  Each enemy slain over the difficulty of the quest equals a bonus to your final score.  (not so sure about this?)\n\n \n\nAre these too much book keeping.  The problem is keeping it fair and elegant.  Anyways wanted to throw my thoughts out there and see what others are thinking of the new scoring system now that we've gotten to see it in action for a while.\n\n \n\nWraith428"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/?do=findComment&comment=584289","commentId":584289,"userName":"Zjb12","timestamp":1327427543,"content":" I have noticed this too, almost to the point where I am so concerned about playing fast, I am not even sure I know what all the new encountere cards are, kuz I just want to get done.  Last week in the 48 hr tournament I held, (aka the bloodbath!) I changed rounds points to 1/2 (5).  To me that seems a little more reasonable.  I am also trying to figure out the threat issues.  I feel like reducing your threat so low doesn't really make sense.  ALmost like it shouldn't be able to go below you initial threat, or a certain other level, like maybe 20.  I am considering not allowing Galadrim's Greetings, Will of the west , and protector of Lorien for these various reasons this weekend, but I have to play the scenario I am going to propose and see if it can be accomplished without them.\n\nI also think a comment that booored made might be something to employ.  How consistently good is your deck?  Can you win 100% of the time with a more consistent deck versus maybe only 50-60% of the time with a speed deck?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/?do=findComment&comment=584302","commentId":584302,"userName":"SiCK_Boy","timestamp":1327428682,"content":"You want to be careful about restrictions on threat reduction. With upcoming \"secrecy\" cards, it looks like getting your threat under 20 will become a viable game plan, so one shouldn't be penalized if his deck is centered around this strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/?do=findComment&comment=584312","commentId":584312,"userName":"booored","timestamp":1327430059,"content":"IMO, the current score system \"almost\" works fine. It rewards risk taking, it rewards knowledge of the quest and it rewards threat management. The problem with it, as people have started to talk about in other threads is that it dose not take into account deck consistency in any way and tactics in a sphere that is almost soly used to ensure consistent decks. There is almost no other use for it. By consistency I mean I how often you win using the deck. The Rabbit run decks can get the best score, and some of the scores people have posted are pretty crazy, but they have a super low win ratio, and take zero skill to pilot.\n\nWhat the scoring system needs is a way to record the losses at a given quest. The only way I can see to do this is to have a best of three, just like a duel game. 3 games minimize luck, and the fact that if you loose 2 out of the three you get no score at all, means you need to build a deck that is consistent. To do this Tactics becomes a much more desired splash or duel/tri colour.\n\nI do like the scoring system as it is.. but the way I run my comps I think works really well...\n\n1) Each Quest in the comp is a best of 3, so two losses at any quest = no score.\n2) Each Lost Quest = +25 top your score. (we run best of 5 for finals).. this used to be +50 and the +25 was a hard number to come by, we are still thinking of making it +15. The idea is that if you loose 1 quest, you do not want people to just quit. The penalty for failing the quest needs to be small enough that a really good score next round will keep you in the comp. For now though we are going with +25 for our testing.\n3) You only pick your best score to submit. So say you played 2 games (you need a minimum of 2 wins to progress) You pick your best score, and that is the only score you use. If you played 3 games, it is your best score +25 for each loss.\n\nThat is it... I think this is a pretty decent way to score the games. You eliminate the \"lets just grind the quest for ever until we get a stupidly low score, even though we are mulligan'n 50 times to get the correct starting hand or failing it 9 times out of 10\" problem. To score well in this game you need a mix of consistency, as well as risk taking, speed and deck piloting. The fact that you would need to win 2 out of 3 is all you need to make Tactics again viable for scoring.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/?do=findComment&comment=584320","commentId":584320,"userName":"muemakan","timestamp":1327431719,"content":"I hate this software......how often in one week can it **** up my posts.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/?do=findComment&comment=584326","commentId":584326,"userName":"muemakan","timestamp":1327432171,"content":" I think they won´t change the system anymore. There won´t be a perfect scoring system. It also depends mainly on the quest. \n\nIn Carrock, questing was no good. In The Seventh Level you need to fight. And in Escape form Dol Guldur you needed both. It´s all very quest depending.\n\nThey could very easily regulate some game mechanics. For instance they could have quest cards which won´t allow threat reduction at a certain point of the game. They could have quests where you get victory points for every slain enemy. Which would make a tactics deck more interesting.\n\nImagine quest cards like: each character counts as having 1 Willpower. I could go on forever. So they have plenty of options if they decide to run tournaments.\n\n \n\n \n\nScoring must kept simple or else nobody wants to do it. I don´t want to sit down and take 10 minutes to figure out my score.\n\n \n\nI think the easiest way would be limiting the games played and take the games you lost into account.\n\n \n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59480-scoring-can-we-have-a-third-option/?do=findComment&comment=584474","commentId":584474,"userName":"Glaurung","timestamp":1327464716,"content":"muemakan said:\n\n \n\n I think they won´t change the system anymore. There won´t be a perfect scoring system. It also depends mainly on the quest. \n\nIn Carrock, questing was no good. In The Seventh Level you need to fight. And in Escape form Dol Guldur you needed both. It´s all very quest depending.\n\nThey could very easily regulate some game mechanics. For instance they could have quest cards which won´t allow threat reduction at a certain point of the game. They could have quests where you get victory points for every slain enemy. Which would make a tactics deck more interesting.\n\nImagine quest cards like: each character counts as having 1 Willpower. I could go on forever. So they have plenty of options if they decide to run tournaments.\n\n \n\n \n\nScoring must kept simple or else nobody wants to do it. I don´t want to sit down and take 10 minutes to figure out my score.\n\n \n\nI think the easiest way would be limiting the games played and take the games you lost into account.\n\n \n\n \n\n \n\n\n\nI think the scoring system its ok. Now  question is: restricted list. Scoring system now remove all this delay and make players value every round of the session. Now no one want to wait and seat to build up they army and remove they threat as low as possible(every round 10 points). So now they should to invent Restricted list and Tournament system. And in my opinion only after all those parts will be release we can really understand how it is. Scoring system, Tournament system and Restricted list. 3 parts in one to understand whole picture."}]}