{"url":"https://community.fantasyflightgames.com/topic/59543-did-i-kill-this-hill-troll-correctly/","title":"Did I kill this Hill Troll correctly?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59543-did-i-kill-this-hill-troll-correctly/?do=findComment&comment=584843","commentId":584843,"userName":"tripecac","timestamp":1327523250,"content":"I'm doing the second quest in the Core set (Journey Along the Anduin), using the starter Leadership deck but with 3 Gandalfs.  The first time I tried this quest, I got slaughtered.  This time, however, I got really lucky (I think) with my first draw, and ended up winning easily.  However, I want to make sure I really did win, and that all hinges on the first turn:\n\nSETUP: I was lucky and started off with both Gandalf and Sneak Attack in my hand.  Staging area had Troll and a 1-threat location.\nRESOURCE: 3 resource tokens, drew a Snowburn Scout.\nPLANNING: Played Snowburn Scout (1 resource) as cannon fodder.\nQUEST: I had Aragorn quest and then ready himself (for 1 resource).  Encounter draw was treachery card which did not apply.\nENGAGE: I engaged the troll.\nDEFEND: I let the troll hit my scout (no shadow effect). Scout died, and I added the leftover damage to my threat.\nATTACK: First I used Sneak Attack to bring out Gandalf... and here's the part I'm wondering about...\n\nAs soon as Gandalf entered play, I used his \"response\" text to 4 damage to the troll.  At that point, the Hill Troll had 5 health left.\n\nThen I had Gandalf (4) and my 3 heroes Aragorn (2), Gloin (2), and Theodred (2) all attack the troll, for a total of 10 attack, minus the troll's 3 defence, for a total of 7 damage, which killed the troll.\n\nThen I used Sneak Attack to return Gandalf to my hand.\n\n------\n\nIs that a correct use of Sneak Attack and Gandalf, or did I mess up somewhere?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59543-did-i-kill-this-hill-troll-correctly/?do=findComment&comment=584844","commentId":584844,"userName":"cordeirooo","timestamp":1327523469,"content":"I cannot see any illegal move here. \n\n \n\nAlthough I should say Théodred should've beeing questing. partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif] [j/k]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59543-did-i-kill-this-hill-troll-correctly/?do=findComment&comment=584846","commentId":584846,"userName":"tripecac","timestamp":1327524003,"content":"Normally I have Theodred questing, but for this turn I wanted to make sure I had enough attack points to kill the Troll.  I was worried that something might exhaust one of my potential attackers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59543-did-i-kill-this-hill-troll-correctly/?do=findComment&comment=584850","commentId":584850,"userName":"cordeirooo","timestamp":1327524404,"content":"I understand, I was just kidding. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAlso, congrats on the win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59543-did-i-kill-this-hill-troll-correctly/?do=findComment&comment=585178","commentId":585178,"userName":"divinityofnumber","timestamp":1327588277,"content":" Try it with just one Gandalf. Believe it or not, it is possible. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI had a hard time finishing that adventure with just the 30 card core set leadership deck. But, after a handfull of losses discovered that it is possible. The key for me was getting lucky enough to have a few treachery cards come off of the top of the deck that did not apply during the early game. If too much sticks to the staging area in that first turn or two, you are pretty screwed. \n\nI have been trying Escape from Dol Guldur solo with the core set leadership deck lately. That does seem rather impossible. But, I am going to keep at it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59543-did-i-kill-this-hill-troll-correctly/?do=findComment&comment=585193","commentId":585193,"userName":"Zjb12","timestamp":1327589661,"content":"cool.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/cool.gif] Tripecac, you forgot one thing---Aragorn and Gloin have to headbutt one another afterwards, otherwise, you did alright!  "}]}