{"url":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/","title":"Anduin with Tactics: Orc Sniper + 2 Banks of the Anduin = trouble","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586240","commentId":586240,"userName":"tripecac","timestamp":1327763570,"content":"I'm trying to beat the Anduin with the starter Tactics deck (with 3 Gandalfs) and am finding it very difficult.  I've now lost 6 times, and have yet to win.\n\nMy last game was the closest.  I got lucky with all 3 Gandalfs appearing relatively early, which helped me knock out the Hill Troll and some other tough enemies.\n\nHowever, things stalled at that point.  I had 42 threat, and drew an Orc Sniper (48 threat, cannot optionally engage).  At first I thought this was great, because Gimli had 2 Citadel Plates and would become a killing machine.  However, I then drew a Banks of the River Anduin, so had 3 threat in the staging, which meant even when I committed all my guys to the quest, I made very little progress.  And the next card on the encounter piled happened to be another Banks (though I didn't know it at first). \n\nThe Banks kept going on the top of the encounter pile, and with no enemies attacking, I was never playing shadow cards, so I couldn't get rid of the Banks.  Even with Beorn out, I could only make measy quest progress, and it all went to the Banks, which kept going to the top of the encounter deck.\n\nSo basically, I was stuck with a sniper in the staging area, plus 2 Banks.  I couldn't get anywhere, and even though Gimli indeed became a killing machine, there was nothing to kill.  With no Gandalfs left, there was no way to damage the Orc Sniper.  I didn't mind the damage he gave Gimli, but his 2 threat significantly impeded my process.\n\nSo turn after turn passed, with my threat inching up, and no progress being made on the main quest.  By the time the Orc Sniper finally engaged, I had threat 48 and, with no Gandalfs left to lower it, had no chance to win.\n\nWhat could I have done different? \n\nHow would you escape this situation, with a core Tactics deck:\n\nSTAGING:\n- Orc Sniper (2 threat, stays in staging until threat is 48)\n- Banks of the Anduin (1 threat, requires 3 progress, returns to top of encounter when done)\n\nENCOUNTER DECK:\n- Banks of the Anduin (on the top)\n\nHEROES:\n- Thalin (1 willpower)\n- Gimli (2 willpower)\n- Legolas (1 willpower)\n\nALLIES:\n- Beorn (1 willpower)\n\nHAND:\n- any core Tactics cards except Ganfalf (already played)\n\nPLAYER DECK:\n- any core Tactics cards except Gandalf\n\n-------------------------------\n\nAre there any cards I could have drawn or played that would have helped? \n\nWould it have made sense to let both Banks stay in the staging area, and let Legolas pick off enemies in order to get progress?  Even with 2 Blades of Gondolin (1 extra progress per kill), I'd be able to make 4 progress on each turn I drew an enemy card  (assuming I only drew enemies and had enough [non-questing] allies to kill them in a single turn).  But that means only having Thalin, Gimli, and Beorn quest (for 4 total), and I'd already have 4 threat in the staging area.  So each enemy would raise my threat, and it would be a race to see if the threat would beat the progress.\n\nGiven that my threat was 42 at this point, was it even possible, given the best possible draws in both the player and encounter decks, to give through those 16 quest points needed for the second quest card?  Legolas could kill 1 enemy per turn, for 4 progress per turn.  However, each of those 4 turns would cost 1 threat, plus the threat of the enemy.  Even assuming I had Beorn out, with 2 Blades of Gondolin attached to Legolas, and both Banks already in the staging area, and have just started the second quest card, I have to draw 2 encounter cards per turn, and most of the time those encounter cards would contribute more threat.  Even in the best case, where the second encounter card is somehow ignorable in terms of threat, I don't see how I can win.  Here is the absolute best case scenerio that I can envision:\n\n1) draw 1-threat enemy (and some treachery card i can ignore), raise threat by 1 to 43\n2) kill enemy with legolas, add 4 progress (total: 4)\n3) end of turn, raise threat by 1 to 44\n\n4) draw 1-threat enemy, threat to 45\n5) kill enemy with legolas, progress to 8\n6) end of turn, threat to 46\n\n7) draw 1-threat enemy, threat to 48\n8) kill enemy [or Orc Sniper now that he's out] with legolas, progress to 12 \n9) end of turn, threat to 49\n\n10a) draw 1-threat enemy, threat to 50 [lose]\n\n----------------------\n\nActually, I thought of a possibility: once the sniper is out, I could travel to one of the Banks, reducing the staging threat by 1.  Since the sniper is no longer there, that only leaves one Banks in the staging area, for a total of 1 threat.  The ending could then look like this:\n\n10b) quest with everyone (1+2+1+1=5), draw 2 negligble treachery cards, progress goes up by 4 [win]\n\nor\n\n10c) quest with everyone except Legolas (1+2+1=4), draw a 1-threat enemy, threat stays same, progress to 14\n11) kill enemy w/ legolas, progress to 18, next quest card\n12) draw 2 non-enemy cards, or kill them this turn [win]\n\nHowever that would only work if I always drew perfectly from the encounter deck: one 1-threat enemy and 1 treachery which I could ignore.  The chances of that would be ???\n\n-----------------------\n\nSo basically, if your core Tactics deck gets \"stuck\" with 2 Banks and a Sniper and a threat of 42 (or higher), with no Gandalfs left, are you pretty much sunk?\n\nOr am I missing something?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586246","commentId":586246,"userName":"cordeirooo","timestamp":1327764533,"content":"You should've engaged the sniper yourself. He was alone. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586314","commentId":586314,"userName":"leptokurt","timestamp":1327774503,"content":"tripecac said:\n\nI'm trying to beat the Anduin with the starter Tactics deck (with 3 Gandalfs)\n\nI stopped reading here.\n\n \n\nNononononononono!\n\n \n\nIf you want some advice - don't use a mono tactics deck. It doesn't create enough WP to get your fellwoship through this quest. You might finish 1B, but 2B with two encounters each turn will kill you. If you want to use the starter decks first, try spirit or leadership. Most experienced players see tactics mainly as a supporting sphere, as it is excellent for fighting, but sucks at questing. Unfortunatly most adventures are about questing, not fighting.\n\n \n\nGood luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586326","commentId":586326,"userName":"tripecac","timestamp":1327776339,"content":"Oh no!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n\"During the encounter phase, players cannot optionally engage Goblin Sniper if there are other enemies in the staging area.\"\n\nI completely missed that key phrase at the end!  So even though he was alone at the start of almost every engagement phase, I never engaged him.\n\nSigh.  Well, this was a big \"doh\" moment for me in my particular game... \n\n...but my original question can be modified slightly:\n\nWhat if you have *TWO* Goblin Snipers in the staging area?\n\nWithout Gandalf, a Tactics deck will never be able to engage the snipers, correct? \n\nSo, every turn you would have at least 4 threat in the staging area.  The Tactics deck doesn't seem to have much (or anything) to boost your willpower or attack those snipers remotely, so you will be stuck with them until your threat reached 48, correct? \n\nAnd then throw a couple of Banks of Anduin at the top of the encounter deck, and it seems like a no-win situation.  If you keep the Banks of the Anduin in the staging area, that's 6 threat in the staging area.  If Legolas does not question, you can at best muster 4 willpower, so you are adding 2 threat per turn plus whatever other encounter cards you draw.  In order to make progress, you have to draw an enemy each turn, so that's at least 1 more threat during the quest phase, for a minimum of 3 threat per quest phase.\n\nIn the best case, Legolas would have 2 Blades of Gondolin, which would give you 4 progress during each combat phase.  So, in order to get all the way through the 16 quest point card you would need to last through 4 combat phases, which means 4 quest phases (3 threat each) and 3 end-of-turn phases (1 threat each).  The total threat needed to get through the card would be 4*3 + 3*1 = 15 threat.  That means you would need at most (49 - 15) = 34 threat when you drew the 2nd Banks of the Anduin. \n\nIs there any other way to escape the 2 snipers, 2 banks situation with a Tactics deck?  Or are you pretty much dead if you happen to draw those cards in that order after having played all your Gandalfs?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586330","commentId":586330,"userName":"cordeirooo","timestamp":1327776899,"content":"If there are two, than neither of them are alone. \n\n \n\nThe tactics sphere has a good answer to those snipers: Quick Strike."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586354","commentId":586354,"userName":"leptokurt","timestamp":1327779995,"content":"cordeirooo said:\n\nIf there are two, than neither of them are alone. \n\n \n\nThe tactics sphere has a good answer to those snipers: Quick Strike.\n\n\n\nThat doesn't work, as the snipers are in the staging area and thus not an eligable target. The only way to get rid of two snipers using the coreset is to use Gandalf or Dunhere\n\n \n\ntripeac, you ask the wrong questions. You should ask yourself: \"Is there a combination of encounter cards that a tactic deck is able to master?\" What is your strategy to beat the Anduin with this sphere btw? By now you must have realized that your deck has a total WP of 5 plus 1 Gandalf, so it's almost impossible to make any progress, if there wasn't legolas' ability. Compare this to the spirit deck: Éowyn alone has 4 WP (+1 with her ability), and you have allies and attachments that have extra WP. That's why you should at some point start to build a dual sphere deck. Take two of your tactic heroes and Éowyn. Add some spirit cards, and you will see that the scenario is easier to master.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586361","commentId":586361,"userName":"cordeirooo","timestamp":1327781785,"content":"leptokurt said:\n\ncordeirooo said:\n\n \n\nIf there are two, than neither of them are alone. \n\n \n\nThe tactics sphere has a good answer to those snipers: Quick Strike.\n\n \n\n \n\nThat doesn't work, as the snipers are in the staging area and thus not an eligable target. The only way to get rid of two snipers using the coreset is to use Gandalf or Dunhere\n\n \n\n \n\n\n\n \n\nThat's partially true. I was wrong about Quick Strike, but you can use Sons of Arnor to engage the goblins, Dúnhere and Gandalf aren't  the only answers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586362","commentId":586362,"userName":"tripecac","timestamp":1327781946,"content":"So, is trying to beat the Anduin quest with the starter Tactics deck fundamentally difficult?\n\nMy approach to learning the game has been to tackle each quest with each starter deck, playing until I win.  I did that for the first quest, so that I could learn the \"feel\" of each sphere.  For the Anduin quest, somehow I managed to win with the Leadership starter deck (thanks to Sneak Attack + Gandalf) but I haven't been able to beat it with Tactics, after 7 attempts.\n\nShort of inventing some house rules or giving up on ever beating the Anduin quest, my options at this point seem to be either:\n\na) keep trying Tactics until I win\nb) skip Tactics for now, and try Spirit and then Lore\nc) forget the starter decks and start building multisphere decks on my own\nd) open some adventure packs in hopes of finding better Tactics cards\ne) start playing 2-player (by myself) instead of solo\n\nOption D (adventure packs) seems a bit like cheating to me, and also spoils the \"surprise\" of opening the Adventure Packs only after I conquer the core quests.\n\nOption E is tempting, since I've read over and over on here that solo is harder then coop.  However, it also seems a bit like \"cheating\", since I will know what is in each player hand, and therefore I will have an advantage over a true coop game.\n\nSo I'd rather just consider options A, B, and C.\n\nI'm sure lots of other people (perhaps everyone) have been at this point, and had to make the decision of whether to keep beating their [starter deck] head against the [Anduin] wall, or whether to give up and go multi-sphere.  This decision point could have happened during the first quest, but for many of us, it happens on the Anduin.  I am curious what other people did at this point... Did you keep thrashing away with the starter decks?  Or did you go multi-sphere as soon as you lost a couple times?  Is there satisfaction in stubbornly persisting with the starter decks until we win, or is that satisfaction made hollow once you realize starter decks are not even \"legal\" decks since they don't have 50 cards?\n\nIt's been suggested that the intention of the Anduin quest is to force players to go multi-sphere, which makes sense from a tutorial perspective.  I just wish the manual spelled out that clearly, saying something like: \"Once you beat the first quest with each sphere's starter deck, it is strongly recommended you build your own multi-sphere decks before attempting any later quests.\"  A recommendation like that within the manual would have (I think) made it easier for me to give up on the starter decks, and would save me a lot of frustration (and bafflement) on the Anduin.  Not that it hasn't been fun.  I don't mind losing, as long as I am learning in the processing, and I wonder if maybe there aren't many lessons left to be learned with Tactics on the Anduin.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586368","commentId":586368,"userName":"Bohemond2","timestamp":1327784168,"content":"cordeirooo said:\n\nThat's partially true. I was wrong about Quick Strike, but you can use Sons of Arnor to engage the goblins, Dúnhere and Gandalf aren't  the only answers.\n\n\n\nPlaying Son of Arnor in a mono tactics deck is a neat trick.\n\nIf we are speaking hypothetically, there are several of ways to kill the Sniper in the staging area (Thalin + Infighting, Longbeard Orcslayer, Descendant of Throndor), but none of them help in this specific situation.\n\nThe correct answer is to start deck building.  Mono-tactics  from core won't get you very far in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586372","commentId":586372,"userName":"tripecac","timestamp":1327785472,"content":"Son of Arnor is Leadership.  How would you play it with a Tactics deck?\n\nInfighting is Lore and Longbeard Orc Slayer is Leadership; how would you play them with Tactics?\n\nDescendent of Thorondor is Hills of Emyn Muil, not core.\n\nSo none of those options help me, which is I think what you were saying...  Basically, unless I branch out from the core Tactics deck, I'm pretty much shackling myself?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586376","commentId":586376,"userName":"Bohemond2","timestamp":1327786692,"content":"The game requires deck building to get past all but the most basic of scenarios.  Starting with the core decks is a great way to learn, but you need to branch out into building your own deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586380","commentId":586380,"userName":"cordeirooo","timestamp":1327787171,"content":"Bohemond said:\n\ncordeirooo said:\n\n \n\nThat's partially true. I was wrong about Quick Strike, but you can use Sons of Arnor to engage the goblins, Dúnhere and Gandalf aren't  the only answers.\n\n \n\n \n\nPlaying Son of Arnor in a mono tactics deck is a neat trick.\n\nIf we are speaking hypothetically, there are several of ways to kill the Sniper in the staging area (Thalin + Infighting, Longbeard Orcslayer, Descendant of Throndor), but none of them help in this specific situation.\n\nThe correct answer is to start deck building.  Mono-tactics  from core won't get you very far in this game.\n\n\n\n \n\nWell, if you could read above my posts (which I believe you can't, because it's the second time this happens), you would see that this is really hypothetical; the other guy suggested only Dúnhere and Gandalf could deal with the Goblin directly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586381","commentId":586381,"userName":"booored","timestamp":1327787185,"content":"tripecac said:\n\nBasically, unless I branch out from the core Tactics deck, I'm pretty much shackling myself?\n\nDeck building is a major \"point\" of this game. You HAVE to deck build to play it, this becomes more and more true as the game gose on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586402","commentId":586402,"userName":"tripecac","timestamp":1327793349,"content":"Sorry, I'm still a newbie, so I take a lot of stuff on here literally (like the card suggestions).  So card suggestions which might be obviously hypothetical to you guys is something I have to look up...\n\nI think the reason I've been trying to stick with single-sphere decks is before I even got the game I was listening to some of the podcasts for it, and one of the guys mentioning trying a particular quest solo with 2 spheres for the first time, and not being able to imagine how it could be won with 3 spheres.  I didn't know what spheres were at the time, but the impression I got was that 1 sphere is easiest [for solo play], 2 is harder, 3 is hardest.  That notion stuck with me once I got the game, so my reasoning was \"if I can't win with 1 sphere, I certainly can't win with 2 spheres\".  But this Anduin scenario is what is getting me to realize that sticking with 1 sphere (particularly, Tactics) isn't necessarily the \"easiest\" option.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586405","commentId":586405,"userName":"booored","timestamp":1327793760,"content":"tactics is arguably the weakest sphere for solo playing... it wasn't untill return to mirkwood was released that it started to get the cards needed to be a \"real\" deck imo. For multiplayer it is great.. but tactics is pretty lame for solo for a long time to come... Try a duel deck.. once you get the packs that have teh songs you can run tri and even quad sphere decks no problem."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586449","commentId":586449,"userName":"leptokurt","timestamp":1327805919,"content":"tripecac said:\n\nSorry, I'm still a newbie, so I take a lot of stuff on here literally (like the card suggestions).  So card suggestions which might be obviously hypothetical to you guys is something I have to look up...\n\nI think the reason I've been trying to stick with single-sphere decks is before I even got the game I was listening to some of the podcasts for it, and one of the guys mentioning trying a particular quest solo with 2 spheres for the first time, and not being able to imagine how it could be won with 3 spheres.  I didn't know what spheres were at the time, but the impression I got was that 1 sphere is easiest [for solo play], 2 is harder, 3 is hardest.  That notion stuck with me once I got the game, so my reasoning was \"if I can't win with 1 sphere, I certainly can't win with 2 spheres\".  But this Anduin scenario is what is getting me to realize that sticking with 1 sphere (particularly, Tactics) isn't necessarily the \"easiest\" option.\n\n \n\n\n\nIt's a bit more complicated to play with more spheres, because you have to start to manage your esources. So far you didn't have to pay any attention about it. Citadel Plate costs 4 resources, I have 4 resources, done. If you add a second sphere, you have one sphere that generates 1 resource each round and the other 2 resources. Citadel Plate costs 4 resources, I have 4 resources, one of them is spirit and 3 are tactics - can't buy Citadel Plate.\n\nWith more spheres it's harder to get the high cost cards. Beorn is a good example. So far you have to wait 2 rounds before you can bring him into play. If you only have 2 tactics heroes, you have to wait 3 rounds, if you have only 1 tactics hero you have to wait 6 rounds.\n\nHowever, two or three spheres give you more flexibitliy, as each sphere has it's own advantages. Tactics is for fighting, Lore is healing and card drawing, Spirit is about WP, threat reduction and deflecting nasty treacheries (also has a low starting threat) and Leadership is resource generation (+ Sneak Attack).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=586943","commentId":586943,"userName":"jhaelen","timestamp":1327896949,"content":"booored said:\n\ntripecac said:\n\nBasically, unless I branch out from the core Tactics deck, I'm pretty much shackling myself?\n\n \n\nDeck building is a major \"point\" of this game. You HAVE to deck build to play it, this becomes more and more true as the game gose on.\n\n\n\nI disagree that deckbuilding is required to enjoy this game unless you are restricting yourself to only ever play it solo.\n\nTrying to beat scenarios solo with a core Tactics deck is an exercise of frustration - even the first core scenario isn't easy to win with that deck!\n\nTrying to beat the third core scenario solo is an exercise in frustration, period.\n\n@tripecac:\n\nImho, playing this game cooperatively (i.e. with at least two players) is a \"major\" point of this game. You can somewhat approximate the experience by playing with two decks solo which is also what I'd recommend you to do if you're intent on trying to win every scenario using the core decks first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59667-anduin-with-tactics-orc-sniper-2-banks-of-the-anduin-trouble/?do=findComment&comment=587348","commentId":587348,"userName":"tripecac","timestamp":1327941184,"content":"I'm kind of stuck playing solo here, unless I use LackeyCCG. \n\nI decided to skip Tactics for a bit and try Spirit.  Threat is no problem now, and I get lots of turns before the Troll comes out, but for some reason or other I end up getting clobbered.  Dunhere has no way to hurt the Troll in the staging area (since the Troll has 3 defense), so I need either tons of allies or good old Gandalf. Sometimes I get lucky with a couple of Gandalfs in a row, and the reshuffle card lets me see him more than 3 times.  However, so far victory has eluded me.  I feel like I'm a lot closer to winning than with the Tactics deck, though... it's just a matter of time!  (I hope)\n\nI won the first quest easily with Spirit and Lore, so I haven't played much with those cards yet.  Forcing each of those spheres to tackle the Anduin alone helps me learn their pros and cons more thoroughly, so that when it's time to build a deck I'll have a better sense of what spheres and cards to use.\n\nSo my plan is to try a couple more times to beat Anduin with Spirit, and then switch Lore.   And then after that I'll build a deck.  Like a real man. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}