{"url":"https://community.fantasyflightgames.com/topic/59790-some-quest-phase-timing-questions/","title":"Some quest phase timing questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59790-some-quest-phase-timing-questions/?do=findComment&comment=587462","commentId":587462,"userName":"Nenya","timestamp":1327957898,"content":"I could not find the answer to these questions on the forum, although I am sure these issues have been covered.  So I beg your indulgence.\n\nI am playing the Passage Through Mirkwood scenario (on VASSAL--very nice for commuters!) solo.\n\nI am questing with Eowyn and Thalin.  Thalin has Unexpected Courage.  Immediately after I commit Thalin to the quest, I exhaust UC and ready Thalin.  But he is still committed to the quest until end of the phase even though he is not exhausted, correct?\n\nI draw Black Forest Bats from the encounter deck.  As they are revealed, Thalin deals one damage to them (they have 2 hit points), and then their \"when revealed\" effect takes place (Each player must choose 1 character currently committed to a quest and remove that character from the quest.). Thalin deals one damage, and then one character is removed from the quest, correct?  At this point, I can remove Thalin from the quest (even though he is not exhausted), and Eowyn can quest on alone, correct?\n\nThanks for your help with this awesome game!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59790-some-quest-phase-timing-questions/?do=findComment&comment=587480","commentId":587480,"userName":"radiskull","timestamp":1327960566,"content":" Yep!  Whether a character is exhausted or not has no bearing on whether or not they are committed to a quest (after you've committed them, obviously).  You played everything there completely correct (and leaving Eowyn as the lone quester was clearly the right choice!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59790-some-quest-phase-timing-questions/?do=findComment&comment=587487","commentId":587487,"userName":"Nenya","timestamp":1327961656,"content":"Thanks for your answer, Radiskull. \n\nI guess this would work well for the Necromancer's Reach also.  Commit to the quest, then use UC to ready, then when Necromancer's Reach is revealed, that hero is not damaged.\n\nIf I keep playing long enough, I guess I will learn the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59790-some-quest-phase-timing-questions/?do=findComment&comment=587505","commentId":587505,"userName":"tripecac","timestamp":1327966092,"content":"If Necromancer's Reach is revealed *before* you un-exhaust Thalin, you don't get a chance to un-exhaust him in order to escape the Necromancer's reach, right?\n\nAnd this is because you cannot react to \"When Revealed\" text unless you have a card which specifically says you can.  Is that correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59790-some-quest-phase-timing-questions/?do=findComment&comment=587509","commentId":587509,"userName":"radiskull","timestamp":1327966381,"content":" tripecac is correct, but you still have the opportunity to use UC to ready Thalin after you commit him to questing and before you begin revealing encounter cards.  It's true that once you start revealing cards, it's too late to use anything that isn't a Response, and only then if the response is appropriate."}]}