{"url":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/","title":"Zjb12 Weekend Tournament #2 for February 3-5, 2012","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=588476","commentId":588476,"userName":"Zjb12","timestamp":1328116400,"content":"Hi!  Welcome to this weekend's Zjb12 Quest #2.  This tournament begins at 12pm (CST/FFG time) Friday, February 3 and runs through Sunday, February 5, 5pm.  (Please do not include scores from times before or after that period.)\n\n \n\nSolo Player Quest: Into the Pit (from the Khazad-Dum expansion)\n\nLimited Hero Pool: The following heroes are available for play in this tournament: any hero with the Dwarf trait; Aragorn; Legolas; Frodo; Boromir.\n\nDeck Pool/Off limit Cards:  Your deck pool may include cards from 1-2 Core Sets, 1 each of the Shadow of Mirkwood APs, 1 Khazad-Dum Expansion. \n\nNOTE: If you are use to playing with cards from more than 2 core sets, you might want to go back and check to make sure which cards had 1, 2, or 3 copies in the core set.  Or check, www.lotrlcg.com   There are no off limit cards as long as they come from this pool.  Again, only 2 core sets.\n\nDeck Size: 50 cards, no more, no less.  No changes in your heros or deck are allowed AT ALL after you start your first game.  In addition to looking for a low score, we are looking for a consistent deck against this scenario using the limited hero pool.\n\nGames:  Everyone is to play five games so we can have a fair comparison of decks and gameplay.\n\nScoring:  Tabulate your score per standard FFG rules and FAQ 10/31/11.  I will be using the scoring idea that is noted in a post by Juicebox called Measuring Success.\n\nHere's an idea of scoring with 5 attempts, L=loss;  90/L/85/79/L/.  Average score: (90+85+79)/3= 254/3 = 84.67\n\nWin ratio: 5/3 = 1.67\n\nWeighted would be 84.67 * 1.67 = 141.40 (rounded to nearest hundredth.)  This seems like a heavy penalty for losses, but the less losses you have, the penalty lessens, and with no losses, your average score is your weighted score.\n\nYou can send in your scores 1 at a time or all together.  I will determine your win ratio factor once I have all your scores and wins and losses. \n\nWhen you post your scores please include: final  threat, damage, dead heros, rounds, and victory points, and heros used, as well as final total.  (When including rounds, give the number of rounds as well as the calculated points).\n\nAt the end of the tournament hours I will post the overall results and placings.  Please post your results to this forum topic.  As scores come in I will try to keep a posted scorecard going!\n\n***[A game attempt is considered an attempt as soon as you draw your initial hand of 6 cards.  You may take 1 mulligan at the beginning of the game for your opening hand as per normal rules.]*** \n\nQuestions?  Please ask!\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=588501","commentId":588501,"userName":"muemakan","timestamp":1328118883,"content":"Zjb12 said:\n\n 1 each of the Shadow of Mirkwood APs, 1 Khazad-Dum Expansion.  \n\n\n\n \n\nWhat does that mean?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=588523","commentId":588523,"userName":"Zjb12","timestamp":1328121477,"content":" Just that you can pull cards from 1 of each, which I suppose is redundant since the player cards are 3 copies each anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589401","commentId":589401,"userName":"Zjb12","timestamp":1328270782,"content":" It's go time!!!  Let's get playing!! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589450","commentId":589450,"userName":"Zjb12","timestamp":1328277107,"content":" Game 1: L.\n\nGame 2: Win.  Heroes: Dain, dwalin, bifur.  Threat: 45; rounds 10 (100); 5 damage; 4 vps, (bridge of khazad-dum, first hall, east gate); score: 146.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589468","commentId":589468,"userName":"Zjb12","timestamp":1328279975,"content":" Smokin' hot: game 3: L.  Game 4: L."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589478","commentId":589478,"userName":"Zjb12","timestamp":1328281394,"content":" Game 5: L.  Okay, so here it is, I used a zigil miner deck.  When it worked, it worked great.  When I failed, it often was that I didn't have a miner in, but it really came down to too many enemies or getting stuck in quest 1b, like on the bridge where you cannot play cards.  If I could have played cards the last game when on the bridge, I would have likely gone on to win.\n\nSo, 1-4 for this tournament."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589860","commentId":589860,"userName":"Narsil0420","timestamp":1328363460,"content":"Zjb12 said:\n\n Game 5: L.  Okay, so here it is, I used a zigil miner deck.  When it worked, it worked great.  When I failed, it often was that I didn't have a miner in, but it really came down to too many enemies or getting stuck in quest 1b, like on the bridge where you cannot play cards.  If I could have played cards the last game when on the bridge, I would have likely gone on to win.\n\n\n\nI have a feeling that this tournament is going to go a long way towards showing people that Zigil Miner definitely DOES NOT guarantee a win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589877","commentId":589877,"userName":"radiskull","timestamp":1328366062,"content":" I had some mild success here - when my deck worked, it worked great (as in game 2).  Otherwise, I just couldn't get allies into play fast enough.  I think that was partially my fault for questing too fast, getting rid of East Gate too fast, or just making poor decisions.  The shadow card that discards a defending character WRECKED me by forcing me to discard Dain in game 3.  Otherwise I just couldn't keep up questing.\n\nZigil Miner was helpful, I usually picked 2 as my number (my curve was 17/21/5/4/3) and was often successful.  However, I did end up discarding both Steward of Gondor and Unexpected Courage with it. (Then I used Will of the West, and Zigil Miner discarded Steward of Gondor and Unexpected Courage! What a jerk!)\n\nI used Narvi's Belt to splash in a Miner of the Iron Hills and two Dwarrowdelf Axes, which were helpful when I got them.  I either drew both Narvi's Belts or neither of them, so that was a bit frustrating.\n\nAncient Mathoms were great here, I just needed slightly more resource acceleration.  Perhaps I should have done Gloin with some healing, but alas, I did not.  Anyway, here are my scores:\n\nHeroes: Aragorn / Dain / Dwalin\n\nGame 1: Win.\n\nThreat 49\nRounds 180\nDamage 5\nVP -4 (East Gate, First Hall, Bridge of Khazad-Dum)\nTotal: 230\n\nGame 2: Win (this was by far my best game.  I got Steward of Gondor early on Dwalin with Narvi's Belt and Unexpected Courage.  Pretty great.)\n\nThreat 21\nRounds 80\nDamage 2\nVP -4 (same)\nTotal: 99\n\nGame 3: lost in round 6 from threat.  Too many locations in the staging area.\nGame 4: got slaughtered - two Goblins that engaged me when revealed; both got Goblin Swordsman as shadow cards.  Couldn't keep up with both questing and fighting.\nGame 5: loss.  Nothing specific, just didn't go well.\n\nSo if I'm interpreting the scoring system properly, my score is (329/2)*(5/2) = 411.25  So pretty bad, but at least it's a score, unlike last time. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589951","commentId":589951,"userName":"SiCK_Boy","timestamp":1328384493,"content":"Woohoo! Finaly a format that allows Zigil Miner to be played! An a chance for him to show his worth in a solo deck.\n\nAnd since my house won't fall down, I gave this one a go earlier today, with great results I think (all the games were very enjoyable; I had only played the quest a couple time before in multiplayer; this tournament gave me a chance to really get a feel for it and it's a nice one, at least on par with Journey Along the Anduin as far as I'm concerned).\n\nResults:\n\nGame # 1 - Win: 27 threat + 0 dead hero + 0 wound - 4 victory points + (11 rounds * 10) = 133\n\nGame # 2 - Win: 34 threat + 0 dead hero + 2 wounds - 4 victory points + (11 rounds * 10) = 142\n\nGame # 3 - Win: 47 threat + 0 dead hero + 3 wounds - 4 victory points + (14 rounds * 10) = 186\n\nGame # 4 - Win: 19 threat + 9 dead hero + 0 wound - 7 victory points + (12 rounds * 10) = 141\n\nGame # 5 - Loss\n\nHere's my decklist:\n\nHero (3)\nBifur (KD) x1\nDwalin (KD) x1\nFrodo Baggins (CatC) x1\n\nAlly (24)\nEscort from Edoras (AJtR) x2\nGandalf (Core) x3\nGildor Inglorion (THoEM) x3\nGleowine (Core) x1\nHenamarth Riversong (Core) x1\nLongbeard Map-Maker (CatC) x3\nMiner of the Iron Hills (Core) x2\nNorthern Tracker (Core) x3\nRivendell Minstrel (THFG) x1\nWest Road Traveller (RtM) x1\nZigil Miner (KD) x3\nDaughter of the Nimrodel (Core) x1\n\nAttachment (11)\nA Burning Brand (CatC) x1\nAncient Mathom (AJtR) x2\nFast Hitch (TDM) x2\nForest Snare (Core) x2\nSelf Preservation (Core) x1\nSong of Kings (THFG) x1\nUnexpected Courage (Core) x2\n\nEvent (15)\nA Test of Will (Core) x2\nDwarven Tomb (Core) x2\nFortune or Fate (Core) x1\nHasty Stroke (Core) x1\nSneak Attack (Core) x3\nStand and Fight (Core) x2\nThe Galadhrim's Greeting (Core) x2\nWill of the West (Core) x2\n\nComments on the deck: I quickly decided on my heroes. I knew I wanted at least 2 Spirit heroes in order to get that turn 1 Miner as often as possible and a Lore one to be able to play some of those 5 cost cards (although I didn't end up playing Beorn's Hospitality, I think Lore was definitively the way to go). I finaly came to a point where the deck would not work and I started cutting all these 5 costs extra. My final list, by cost, was 2-16-12-10-3-7. So I ended up mining for 1 most of the time until Gildor got active. The 2 Will of the West along with 2 Dwarven Tomb were a good mix. I would probably add either an extra Rivendel Minstrell or Song of Kings; I often found myself with an uncastable Sneak Attack. A Burning Brand could be cut. The main issue was that the only hero that can receive it is Bifur, but I never kept him on defense. Even when I got Unexpected Courage, it went more often than not on Dwalin. And I was defending more often with Dwalin and Frodo than with Bifur. I'd also add a 2nd Hasty Stroke instead of one of the Fast Hitch. I decided not to run Protector of Lorien as I didn't have much card draw. I figured my odds of going for a 1 turn massive questing were better with the Longbeard Map-Makers (which I did once of twice, but it was always in a context where the game was won anyway). The lact of a true \"tutor\" in this game remains a problem; I'm sure we'll have one someday, but that single Fortune or Fate would have been required a couple of times... I'd still not try to run a second, as its too situational.\n\nI had initialy considered running Narvi's Belt to splash into Tactics for the Dwarrowdelf Axe, just like Radiskull. But in the end, I wanted more focus in my deck. That's why I also ignored the Dunedain Mark and Warning as well as Steward of Gondor (I think I could have found use for it, in retrospect). But I'm not letting go of Sneak Attack yet; it's just too powerful with Gandalf.\n\nGame # 3 was my most epic, as I started without Dwalin (Crumbling Ruin right at the start and I flipped a Gandalf...). I spent most of the game with only 2 heroes and still survived. I found that Fortune or Fate when there were about 5 cards left in my deck (I was waiting for it before reshuffling). That game really reinforced for me how strong Zigil Miner can be.\n\nGame # 4 saw Dwalin end in the discard pile again. I was about to win (you know those last few turns when you know the encounter deck can't really throw anything at you that will make you lose). I defended against a Patrol Leader, confident in my Daughter of the Nimrodel's ability to put me back to full health, when a shadowy Burning Low changed the plans... I still decided to finish as the 10 points a turn weren't worth waiting to be able to bring the dwarf back from the dead (and I had just reshuffled via Will of the West before Dwalin died).\n\nI though game # 5 would see me pull through against low odds again, but it didn't happen. Dwalin died on turn 1 to a Sudden Pitfall. I never really recovered as, although I had a Miner in play, I couldn't generate enough resource to put allies into play. On turn 7, I quested with Gildor, Frodo and Longbeard Map-Maker, facing a staging area containing First Hall and a Goblin Swordman. I had kept Bifur to defend against the Swordman (at 48 threat, I knew he was coming). The encounter was a Crumbling Ruin that forced me to exhaust Bifur (my only other character, a Zigil Miner, was already exhausted) and he died to a revealed Gleowine (Bifur already had a wound). Then the Swordman engaged and killed Frodo (the 3 attacks were putting me over the 50 threat limit). Still a good game.\n\nThe big star for me was Henamarth Riversong. When he was there, I knew when to use the Torch (I often used it to \"get rid\" of an unwanted treachery) and when to attack the Patrol Leader. Dealing with the locations wasn't a problem as the Northern Trackers showed up and my resource engine was quickly activated once Gildor entered play.\n\nOne thing I came to realize is that you often want your threat to reach over 37 soon in the game so that you can get rid of those Goblin Scout. I often left the staging alone, questing with nobody just to see my threat raise by 5 or 6 so I could get rid of these vermins (and then lowering the threat because of Dwalin's power). Obviously, if you can go under 25, it works just as well, but you don't really want to spend your first few turns casting The Galadhrim's Greetings. I also used Gandalf a few times as a gun rather than reducing my threat when I was starting to see a few enemy cluttering the staging area.\n\nNarsil: You're right that Zigil doesn't \"guarantee\" a win, but don't forget we had a few restrictions here. Only 2 Core sets does make a difference on a miner deck and not being allowed to use Eowyn or Eleanor also changes the dynamic. We were also limited to a fixed 50 cards. Still, I think my adventure proves that Miner is a powerful tool. I hope others will give this a try (not the Miner, but the tournament). I don't know how much the \"format\" dictates the decks, but in my case, I would probably have played something similar anyway (probably with Eowyn instead of Dwalin). I'm curious to see what strategies others will pursue to defeat the mines."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=589969","commentId":589969,"userName":"Zjb12","timestamp":1328388241,"content":" Hey!  Sorry about not getting a half time scorecard out there.  But at this point I think I will wait until tomorrow.  I hate to say it, but I'm not sure if my one win was valid.  I remembered yesterday for the first 1-2 games I played the bridge as you cannot draw cards when it is that you cannot play cards.  So I am going to invalidate my score and put myself down as a goose egg.  Radiskull and sickboy, looks like you guys didn't fare too badly!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590062","commentId":590062,"userName":"leptokurt","timestamp":1328425925,"content":"After some training (only got KD on Friday) and calibrating I entered the challenge with a dwarfen deck and I'm quite happy with my results:\n\n \n\nGame 1: WIN - Threat 41, Damage 3, Fallen 0, Rounds 120, VP 7 = 157\n\nGame 2: WIN - Threat 37, Damage 2, Fallen 0, Rounds 120, VP 7 = 152\n\nGame 3: WIN - Threat 41, Damage 4, Fallen 0, Rounds 100, VP 4 = 141\n\nGame 4: WIN - Threat 38, Damage 5, Fallen 0, Rounds 70, VP 4 = 109\n\nGame 5: WIN - Threat 34, Damage 0, Fallen 0, Rounds 100, VP 4 = 130\n\n \n\nHere's the deck I used (1 core set + all the AP's + KD):\n\n \n\nHeroes: Dwalin, Dáin Ironfoot, Bifur\n\n \n\nNeutral: 5 cards\n\n3x Gandalf\n\n2x Song of Battle\n\n \n\nSpirit: 11 cards\n\n3x Zigil Miner\n\n1x Unexpected Courage\n\n3x Ancient Mathom\n\n2x Galadhrim's Greeting\n\n2x A Test of Will\n\n \n\nLeadership: 11 cards\n\n2x Longbeard Orc Slayer\n\n2x Narvi's Belt\n\n1x Celebrían's Stone\n\n2x Steward of Gondor\n\n2x Durin's Song\n\n2x Sneak Attack\n\n \n\nLore: 12 cards\n\n2x Erebor Hammersmith\n\n2x Miner of the Irion Hills\n\n3x Erebor Record Keeper\n\n2x Burning Brand\n\n3x Ancestral Knowledge\n\n \n\nTactics: 11 cards\n\n3x Dwarven Axe Warrior\n\n3x Gondorian Spearman\n\n1x Dwarven Axe\n\n2x Dwarrowdelf Axe\n\n2x Feint\n\n \n\n \n\nNotes:\n\nThe deck is a true 4 sphere deck. Of course that means that it is essential to get either Narvi's Belt or Song of Battle early in the game, although in game 3 I had my hand full with tactic cards and couldn't play them but still won.\n\nThe main strategy is to get as many dwarves out as possible to create extra WP and to have some additional defenders against the goblins. Burning Brand is a crucial card - once it is attached to Dain, the player is able to treat with the goblin masses. In three games I got Unexpected Courage and attached it to Dain - after this it wasn't hard to get through the remaining rounds.\n\nAncient Knowledge was the last card I put into my deck after i got dealt Dreadful Gap during the setup and was deafeated after 3 rounds by exceeding the 50 threat limit. Burning Brand was also a replacement after Dáin was taken out by Sudden Pitfall's shadow effect.\n\nI love the Record Keeper. He is useful in many ways. I like that you can use him as a backup against Watchful Eyes. Also the combo Record Keeper / Dwalin is very powerful. I sweeped the enemies from the floor in my 5th game during stage 2B with that combo. Bifur's ability ensure that the palyer has enough lore resources.\n\nI have to say that I used Ziggy mostly as quester or as a meat shield. Either I already had enough resources to play my cards or I didn't have any cards to play. It's still nice to have his ability in case you need some urgent extra resources.\n\nGandalf was used half of the time to draw extra cards. In two games he eliminated the Patrol Leader, and the rest of the time he lowered my threat.\n\n \n\nSo what would I change about this deck? First, I would include Henamarth. I had him in my original deck, but he was sacrificed for BB. I somehow didn't think about using him together with Cave Torch which is a great way to benefit from his power. I also would put one additional SoB into the deck. Otherwise I'm satisfied with how the deck runs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590069","commentId":590069,"userName":"Zjb12","timestamp":1328427508,"content":"leptokurt said:\n\nAfter some training (only got KD on Friday) and calibrating I entered the challenge with a dwarfen deck and I'm quite happy with my results:\n\n \n\nGame 1: WIN - Threat 41, Damage 3, Fallen 0, Rounds 120, VP 7 = 157\n\nGame 2: WIN - Threat 37, Damage 2, Fallen 0, Rounds 120, VP 7 = 152\n\nGame 3: WIN - Threat 41, Damage 4, Fallen 0, Rounds 100, VP 4 = 141\n\nGame 4: WIN - Threat 38, Damage 5, Fallen 0, Rounds 70, VP 4 = 109\n\nGame 5: WIN - Threat 34, Damage 0, Fallen 0, Rounds 100, VP 4 = 130\n\n \n\n\n\n \n\nWow!  Good job!  Way to go 5-0!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590163","commentId":590163,"userName":"leptokurt","timestamp":1328447995,"content":"Zjb12 said:\n\n \n\nleptokurt said:\n\n \n\nAfter some training (only got KD on Friday) and calibrating I entered the challenge with a dwarfen deck and I'm quite happy with my results:\n\n \n\nGame 1: WIN - Threat 41, Damage 3, Fallen 0, Rounds 120, VP 7 = 157\n\nGame 2: WIN - Threat 37, Damage 2, Fallen 0, Rounds 120, VP 7 = 152\n\nGame 3: WIN - Threat 41, Damage 4, Fallen 0, Rounds 100, VP 4 = 141\n\nGame 4: WIN - Threat 38, Damage 5, Fallen 0, Rounds 70, VP 4 = 109\n\nGame 5: WIN - Threat 34, Damage 0, Fallen 0, Rounds 100, VP 4 = 130\n\n \n\n \n\n \n\n \n\nWow!  Good job!  Way to go 5-0!\n\n \n\n \n\nI did also win the two games before I started the tournament. I really thought that I owned The Black Pit after this, but then I modified my deck a bit and started a new series. I lost the first four games in a row and won the last with a score of 126.\n\nIn one game Dáin fell into an Unexpected Trap in round 3, in the other game I had 2x Watchful Eyes in rounds 1 and 3, in another I got one enemy after the other (Cave Torch, ouch), I could barely hold my ground and then I drew Patrol Leader...\n\nIn the fourth game I suffered some mean shadow effects (+ 2/3 attack) in a row which killed Dáin in midgame and I had no resources and only few allies out.\n\nThe last game was interesting in so far as I finished the first time stage 2B by questing and not by killing all enemies. I think I had almost a dozen dwarves out there, but the Patrol leader always deflected the damage dealt to him and the others had this nasty shadow effect (no damage can be dealt to the attacker) so despite my dwarven army there was always an enemy remaining."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590179","commentId":590179,"userName":"RGun","timestamp":1328450314,"content":"Hmmm....I'm obviously doing something(s) drastically wrong on this scenario...my win rate has been a horrific 11% playing solo.  I was hoping to give the tournament a shot this weekend (trying with a non ziggy deck) but with a newborn and 2 toddlers in the house it's a challenge finding time over the weekend to fit in much gameplaying.  I'm avoiding reading the deck/strategy posts from the participants this week as I want to figure out how to crack the nut on this one without any assistance (at least I know now there is a consistent winning deck/strategy)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590180","commentId":590180,"userName":"leptokurt","timestamp":1328450828,"content":"RGun said:\n\nHmmm....I'm obviously doing something(s) drastically wrong on this scenario...my win rate has been a horrific 11% playing solo.  I was hoping to give the tournament a shot this weekend (trying with a non ziggy deck) but with a newborn and 2 toddlers in the house it's a challenge finding time over the weekend to fit in much gameplaying.  I'm avoiding reading the deck/strategy posts from the participants this week as I want to figure out how to crack the nut on this one without any assistance (at least I know now there is a consistent winning deck/strategy).\n\n\n\n \n\nGood luck. In the beginning my win ratio was also somewhat between 10-20 percent. IMO deckbuilding is multo importante in this scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590181","commentId":590181,"userName":"RGun","timestamp":1328450966,"content":"Is everyone using 2 core sets?  I've only purchased one - wondering if anyone is consistently winning this scenario solo with just the single core set?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590193","commentId":590193,"userName":"leptokurt","timestamp":1328453635,"content":"RGun said:\n\nIs everyone using 2 core sets?  I've only purchased one - wondering if anyone is consistently winning this scenario solo with just the single core set?\n\n\n\nMe. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590195","commentId":590195,"userName":"Zjb12","timestamp":1328453891,"content":" A big help on this one in addition to the dwarves is if you can get faramir out at some point to help with questing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590245","commentId":590245,"userName":"Zjb12","timestamp":1328467925,"content":" Okay, time is up about 90+ minutes ago.  Sorry, I was away at a Super Bowl party.  Kudos and congrats to those who finished and won.  This is not an easy scenario!\n\n1.  Leptokurt, 157/152/141/109/130.  Dwalin, Dain, Bifur.  5-0.  Weighted average 137.800\n\n2.  Sick_Boy, 133/142/186/141/L.  Dwalin, Frodo, Bifur.  4-1.  Weighted average 188.125\n\n3.  Radiskull, 230/99/L/L/L.  Dwalin, Dain, Aragorn.  2-3.  Weighted average 411.250\n\nGood job guys!  Looks like the common guy here was Dwalin.  I threw my one win out because i think I played cards when I wasn't suppose to, so oh we'll.  If not, I would have been 1-4."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590285","commentId":590285,"userName":"muemakan","timestamp":1328478399,"content":" ****, got the times mixed up. Thought I had around 2 more hours. I am so used to the juicebox tournaments.\n\n \n\nPlayed 2 games while the half time show was on.\n\n \n\nDain, Gloin and Bifur\n\n1.Win: R-10, W-0, TH-48, V-4= 144\n\n2.Win: R-10, W-0, TH-38, V-4= 134\n\n \n\nAll these tournaments nowadays are quite time consuming……\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590328","commentId":590328,"userName":"leptokurt","timestamp":1328491776,"content":"Zjb12 said:\n\n Okay, time is up about 90+ minutes ago.  Sorry, I was away at a Super Bowl party.  Kudos and congrats to those who finished and won.  This is not an easy scenario!\n\n1.  Leptokurt, 157/152/141/109/130.  Dwalin, Dain, Bifur.  5-0.  Weighted average 137.800\n\n2.  Sick_Boy, 133/142/186/141/L.  Dwalin, Frodo, Bifur.  4-1.  Weighted average 188.125\n\n3.  Radiskull, 230/99/L/L/L.  Dwalin, Dain, Aragorn.  2-3.  Weighted average 411.250\n\nGood job guys!  Looks like the common guy here was Dwalin.  I threw my one win out because i think I played cards when I wasn't suppose to, so oh we'll.  If not, I would have been 1-4.\n\n\n\n \n\nThanks. And yep, Dwalin is awesome because of his ability, but Bifur is aso amazing. He and Théodred would be a nice team when you want to play a 3-4 sphere deck, but all those dwarven synergy is really helpful. IWhen I got Steward of Gondor I attached it to Dáin and Bifur stole one resource each round so that both leadership and lore got 2 resources each round. I played this scenario with Thalin, but without Dwalin and the whole spirit sphere first, and lost 80-90 precent of my games. The cornerstone of a dwarven deck still is Dáin who has become my favourite hero by now.\n\n \n\nI have to say that I really love this scenario, I hink it's even better than JdtA (still miss the Hill Troll). The difficulty is not too easy, but doable. Unlike in other scenarios, you don't get an auto win once you survived the first couple of rounds, but this deck tries to kill you until you get the 12th progress token on stage 3B. Thumbs up!\n\nNow I hope that the other two scenarios are as good as ItP.\n\n \n\nI'd really like to hear if someone had success against ItP with one of those legendary Ziggy decks. I still can't imagine that a deck like this would help you much here in this scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59899-zjb12-weekend-tournament-2-for-february-3-5-2012/?do=findComment&comment=590394","commentId":590394,"userName":"Zjb12","timestamp":1328506922,"content":"leptokurt said:\n\nI'd really like to hear if someone had success against ItP with one of those legendary Ziggy decks. I still can't imagine that a deck like this would help you much here in this scenario.\n\n\n\nI was skeptical at first too.  But when I biult my first Zigil Miner deck along the original idea, I did have some wins, though it is not 100% by any means.  Over the weekend though, I did not have any wins.  Not sure if that's because I built it myself and maybe made some changes, or because I only got him a few times, or what.  THere's so much going on in Into the Pit as well, that you really have to be aware of while at the same time so many enemes and locations are dropping down.  It seems a waste to exhaust someone, but if you can hit 4 -5 extra resources with good cards to play in your hand, it can work, but it is a little bit of a gamble."}]}