{"url":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/","title":"Win / Loss Rates","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=589192","commentId":589192,"userName":"tripecac","timestamp":1328228502,"content":"What are people's average win / loss rates for each quest? \n\n(Please specify whether playing solo or coop).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=589253","commentId":589253,"userName":"richsabre","timestamp":1328244324,"content":"tripecac said:\n\n \n\nWhat are people's average win / loss rates for each quest? \n\n(Please specify whether playing solo or coop).\n\n \n\n \n\n \n\ni did a thread the other week about what changes win and loss rates, so you may find that interesting- it will be back a couple of  pages called difference in player opinions, ok so im a soloer- all rates in % won\n\npassage through mirkwood-70- for some reason i find this harder than several later packs- never liked it\n\nanduin- not sure about this one- i lost ALOT when i first got the game-and when i won it i havnt played it since- so it wont be high\n\nguldur-0!!!\n\nhunt for gollum- 60- find it very frustrating, but one of the best quests i think\n\nconflict- same as anduin- i havnt given it much play time compared to others\n\nrhosgobel- 40- not too bad with denethor and drawing plenty of lore of imladris\n\nemyn muil-90- find this far too easy\n\ndead marshes-85- same as above\n\nreturn to mirkwood- 20- when i rush through it with a rohan deck i can do it with alot of luck\n\nkhazad quests-\n\ninto pit-havnt won yet\n\n7th level-30\n\nflight- havnt won yet\n\n \n\ni can probably say with confidence them scores are all below average on here(apart from the 90s)- embarrasingly so- however it must be noted i am a extreme bilbo player type, and often my decks will revolve around theme instead of playability- and i avoid pre made decks (ie zigils) on here as i like to figure things out myself, so i dont really reach for win rates, hence me losing alot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=589268","commentId":589268,"userName":"Ninjawa2","timestamp":1328250007,"content":"I've only been playing a short while (about 6 weeks) but have managed to get a lot of solo games in in that time but don't yet have all the APs.  I alway try to have a good idea about what I'm going to face in the quest and plan appropriately but I do like to try things where I have been sucessful with different decks/heroes. So far:\n\n \n\nPassage through Mirkwood - About 8/10 - I like this one for trying out a deck and it's good that even on the easiest quest you can still get taken down by some nasty effects.\n\nAnduin - About 3/15 or so - Getting better now but it took me lots of trial and error (and luck) to beat it at first.  Really tough start for solo.\n\nDol Guldur - 0/1 - Setup, destroyed early, went on to something more realistic... I'll go back at some point but for now I'm happy doing the other quests.\n\nGollum - 3/5 -  I ran into trouble when I got several turns in a row of all enemies or all locations but overall I think it's pretty balanced.\n\nCarrock - 1/1 - Woohoo 100%.  Only got it last night and suceeded by the skin of my teeth.  I managed to get to the second stage with low threat despite getting Dunhere roasted slowly.  Ended up getting engaged by the last two trolls at once followed by a hill troll the following turn.  Gandalf swooped in to finish off the last troll with me on about 48 threat and down to my two remaining heavily damaged heroes. \n\nRhosgobel - Don't have\n\nEmyn Muil - 7/8 - I actually really like this one.  Pretty easy but can turn on you quickly.  My spectacular loss was a rockslide surging a rockslide killing all my heroes and about 8 allies because I was trying to finish the falls for the win.\n\nDead Marshes - Don't have\n\nReturn - Don't have\n\nInto the Pit - 2/5 - Good mix of enemies and locations.  Can be very tough to get started.\n\n7th Level - about 4/6 or so - I think this is my favourite quest.  Combat galore and not too bad if keep enemy numbers down but with the help of those cave trolls, things can get out of hand fast.\n\nFlight from Moria - 1/2 - Got very lucky when I won but I can see how it will be an absolute nightmare if it got dragged out.\n\n \n\nOverall, I'm quite happy with the difficulty level and will be well pleased if I can keep this 50-60% win rate up (although I doubt it as I'm going try the harder quests more often than passage through mirkwood and emyn muil)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=589299","commentId":589299,"userName":"divinityofnumber","timestamp":1328255646,"content":" I have Khazad-Dum, but have not yet added any cards to the core set decks, or tried its quests. I am having fun trying to see just how far I can get with the core set decks. \n\nWith the core set decks, this has been my luck so far. \n\nLeadership:\n\nPassage Through Mirkwood: I can consistently triumph, but with varying degrees of success. Sometimes a shadow card on an undefended attack will just wreck me, or too many brutal treachery cards while questing. I would say that I get a 60-70% win ratio here, though.\n\nJourney Down the Anduin: This is tough. It all depends on getting a great start. If too much sticks to the staging area in the first turn or two, I am screwed. I pray for a couple of non-relevant treachery cards, etc. \n\nEscape from Dol Guldur: Seems impossible. I have tried it at least 10-15 times. Losing one of my heros, which means only getting two resources per turn, plus the added difficulty, is just too much. I will keep trying though!\n\n \n\nLore:\n\nPassage: I have no trouble keeping my heroes alive and free of damage, but if too many locations end up in the staging area, I have a hard time questing against it. Starting with a relatively high threat level is what hurts me here. I usually hit threat and lose, although I am in perfect health. I would say my win rate is about 30%.\n\nJourney: Very difficult.  I have only losses here. \n\nEscape: Have not even tried. \n\n \n\nSpirit:\n\nPassage: I have no problem questing like a boss, but running out of bodies to throw in front of enemies is what hurts me. If I get some ally cards when drawing, I can kick some major ass here. But, if I keep getting events and attachments, the enemies build up, and the low HP of the heroes gets to be a huge problem. I would say I am about 50% with this. \n\nJourney: Super difficult. Only losses. \n\nEscape: Have not even tried. \n\n \n\nTactics:\n\nPassage: Pretty easy, although questing gets to be a huge pain in the a$$ if too many high-threat lands stick to the staging area. This is essentially the exact opposite problem that the Spirit deck has. \n\nJourney: Have to have a lucky start. I usually lose.\n\nEscape: Brutal defeat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=590242","commentId":590242,"userName":"tripecac","timestamp":1328467403,"content":"Thanks for the stats!\n\nI've played maybe 25 games so far, and my win rates seems to be:\n\n1) Passage Through Mirkwood: 5/10\n\n2) Anduin: 3/15\n\n \n\nI've just started building my own decks, so hopefully over time my win rates will improve.  However, it helps to know what you guys are getting, so that I can know what to expect in terms of a goal rate.  There doesn't seem to be such a thing as a \"perfect\" LotR LCG deck (and gameplay)!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=590252","commentId":590252,"userName":"richsabre","timestamp":1328469265,"content":"tripecac said:\n\nThanks for the stats!\n\nI've played maybe 25 games so far, and my win rates seems to be:\n\n1) Passage Through Mirkwood: 5/10\n\n2) Anduin: 3/15\n\n \n\nI've just started building my own decks, so hopefully over time my win rates will improve.  However, it helps to know what you guys are getting, so that I can know what to expect in terms of a goal rate.  There doesn't seem to be such a thing as a \"perfect\" LotR LCG deck (and gameplay)!\n\n\n\ni think its worth noting that your win rates can change due to  number of factors- it may go up as you improve and your card pool increases, and then again it may go down due to you trying harder quests\n\nand no- the beauty of this game is that there really isnt a best of anything"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=590317","commentId":590317,"userName":"Narsil0420","timestamp":1328486663,"content":"Good post!\n\nI actually keep track of all my scores on a spreadsheet on google docs. I really wish the Quest Log on here kept track of your failures and showed your overall win/loss ratio, but instead I do it myself. I like seeing my success ratio and then using that to create my custom dificulty rating for each scenario. I'll just post my solo scores.\n\n \n\n                     Number of Plays   /    Success %\n\n \n\nMirkwood -                  23                  65%\nAnduin -                       28                  32%\nHunt for Gollum -       21                  71%\nHills of Emyn Muil -   10                   60%\nDead Marshes -         6                   100%\nRhosgobel -               16                   25%\nCarrock -                      17                  35%\nReturn to Mirkwood -  4                    0\nDol Guldur -                 6                     0\nOsgiliath -                    8                     25%\nInto the Pit -                 6                     50%\n7th Level -                    6                     50%\nFlight from Moria -      7                     57%\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=590319","commentId":590319,"userName":"tripecac","timestamp":1328487060,"content":"What are your coop scores?  I'm curious how different they are from solo.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=590389","commentId":590389,"userName":"Eryx_UK","timestamp":1328506087,"content":"These ratings are based on solo play. I rarely play 2 player but when I do you can effectively halve my percentages for victory on most quests.\n\n \n\nMirkwood - 80%. Easy but I find almost impossible with a pure tactics deck.\nAnduin - 40%. Really need to build around the mission. \nHunt for Gollum - 60%. Not that difficult in solo mode.\nHills of Emyn Muil - 100%. If you can't do this in solo mode there is something wrong.\nDead Marshes - N/A. Haven't played in solo yet.\nRhosgobel - 90%. Very easy.\nCarrock - 10%. This is a very hard quest and you need to build a tight deck around it. \nReturn to Mirkwood - N/A. Haven't played in solo yet.\nDol Guldur - 1%. Far too hard. Took me around 70 games to finally do it and it was only through sheer luck that I did.\nOsgiliath - 100%. Played once in solo mode and iced it first time. Haven't tried it solo since.\nInto the Pit - N/A. Haven't played in solo yet.\n7th Level - N/A. Haven't played in solo yet.\nFlight from Moria - N/A. Haven't played in solo yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=590570","commentId":590570,"userName":"Dam the Man","timestamp":1328538456,"content":"Apart from a few plays of Passage Through Mirkwood with one deck, mine are 2-player/deck results:\n\nPassage Through Mirkwood: Too lazy to check for actual stats, but guessing around 75%+ win record\n\nJourney Down the Anduin: 3-4 (win-loss)\n\nEscape from Dol Guldur: 1-5 (and it really, really, REALLY should've been 2-4, but I had a brainfart of epic proportions in one game, although both decks drawing one of their Gandalfs as Orc Guard during 3B certainly didn't help enfadado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/enfadado.gif], Nazzie ended on 8 dmg llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif] )\n\nHunt for Gollum: 4-2 (with at least one real narrow as hell win)\n\nConflict at the Carrock: 7-0 (total joke quest at diff 7 at times easier than Passage)\n\nJourney to Rhosgobel: 3-3\n\nEmyn Muil: 5-1\n\nDead Marshes: 6-0\n\nReturn to Mirkwood: 1-5 (constantly drawing 3 total of Hill Troll + Attercop during first two turns didn't help, threat from Gollum wasn't really an issue, everyone was dead around turn 4)\n\nMassing at Osgiliath: 0-1\n\nInto the Pit: 1-1 (working through this one at the moment)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59978-win-loss-rates/?do=findComment&comment=594012","commentId":594012,"userName":"tripecac","timestamp":1329182638,"content":"I love reading these stats!\n\nSo far it looks like Dol Guldur is the worst (hardest, most frustrating) quest to try solo.\n\nI look forward to trying the Adventure Packs but am wondering it it's worth playing Dol Guldur roulette a few dozen times in hope for a lucky victory.\n\n "}]}