{"url":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/","title":"Destroyed vs Discarded ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589313","commentId":589313,"userName":"Captain Poe","timestamp":1328259024,"content":"I was playing solo with the eagles last night (a lot of really cool combos there) and noticed that one of them stated that \"After an ally is destroyed, exhaust 1 Eagle character to move that ally from the discard pile to its owner's hand.\" What exactly is \"Destroyed\"? Does destroyed mean that the card has specifically been sent to the discard pile due to damage or an effect that specifically \"destroys\" the card? If the card is simply discarded, for example, Escort from Edoras states \" After resolving a quest to which Escort from Edoras was commited, discard Escort from Edoras from play. \"... Is he \"destroyed\" in this process? And thus, eligible for the effect of this eagle?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589363","commentId":589363,"userName":"Captain Poe","timestamp":1328267536,"content":"I see a lot of views and no answers. Am I over thinking this? Is destroyed = to discarded? I'm just not sure if destroyed has a definition or something i'm missing. I can't find that destroyed has a definition. No reference to this in the faq. I tried google searching, but have no luck there either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589393","commentId":589393,"userName":"Valyrian Steel","timestamp":1328270082,"content":" From my read of the rulebook, destroyed is an effect synonymous with the character losing all of it's hit points. A destroyed character is then discarded. However, other effects that remove a character from play would not be considered to have been destroyed, merely discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589429","commentId":589429,"userName":"richsabre","timestamp":1328274237,"content":"Captain Poe said:\n\nI see a lot of views and no answers. Am I over thinking this? Is destroyed = to discarded? I'm just not sure if destroyed has a definition or something i'm missing. I can't find that destroyed has a definition. No reference to this in the faq. I tried google searching, but have no luck there either.\n\n\n\nlook at the song of the fallen thread on here- it may help -it doesnt directly answer this though\n\ni guess looking at it this way- if a character is killed it is obviously destroyed.  if a character is discarded by you to trigger an effect you could still see it as destroyed- perhaps a self sacrifice on the part of the character such as boromirs action- which nate confirmed is death when you trigger it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589518","commentId":589518,"userName":"booored","timestamp":1328285817,"content":"This was discussed at length when the game 1st came out... basically LoTR has many instances were it uses different terms for the exact same thing and it is super confusing to new players... DISCARD means entering the graveyard.... form your hand, or play. Destroy means entering the graveyard from play.\n\nUpshot .. it is lame and confusing.. but these terms basically mean the same thing.. the card enters the yard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589529","commentId":589529,"userName":"starhawk77","timestamp":1328286759,"content":"Page 18 of the rule book discusses enemy attacks, noting that characters can be \"destroyed\" by damage. The example on the same page (and its accompanying diagram on p. 19) show the Silverlode Archer being \"destroyed\" when its health is reduced to 0. On pages 20 and 21, the combat examples also describe Dol Guldur Orcs as \"destroyed\" (and discarded from play) when their health is reduced to 0.\n\nI think the textual evidence indicates that \"destroyed\" is distinct from \"discarded.\" All \"destroyed\" cards are discarded from play, but not all \"discarded\" cards are destroyed. As I see it, To the Eyrie cannot save a Westfold Horse-Breaker, a Winged Guardian, or any other card that is \"discarded\" rather than actually killed by an enemy.\n\nNote that, by my interpretation, characters discarded through shadow effects like those on Sudden Pitfall and Undisturbed Bones can NOT be recurred using To the Eyrie. On the other hand, we know that this game hasn't always exhibited the most consistent wording, so it's possible the intent was for those abilities to functionally \"destroy\" characters.\n\n  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589553","commentId":589553,"userName":"booored","timestamp":1328288367,"content":"Yes it is a different state of how a card leaves play.. but what I mean is that they both end up in the discard pile and once there they are now the same thing. There is no difference between a destroyed and a discarded card once it is in the discard pile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/59988-destroyed-vs-discarded/?do=findComment&comment=589563","commentId":589563,"userName":"radiskull","timestamp":1328289732,"content":" I'm with Starhawk and Valyrian Steel on this one.  I think, for example, that if you used Boromir's ability, he would NOT be eligible to be rescued by Wilyador, for example.  I agree that discarded characters and destroyed characters both hit the discard pile, but if an effect requires a character to be destroyed, then that requires them to either a) take damage equal to their hit points, or (b) get hit with an effect that \"destroys\" them.\n\n \n\nThe fact that a \"discarded\" hero counts as a dead hero at the end of the game doesn't mean that he was \"destroyed\"."}]}