{"url":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/","title":"YAOT - Yet another online tournament","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589811","commentId":589811,"userName":"plueschi2","timestamp":1328354002,"content":" Howdy Forum,\n\n \n\nthere are clearly not enough tournaments out there :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nno, seriously, all that talk about scoring single games, scoring multiple games and creating different \"tournaments\" has started me thinking. Since most of the tournaments out there didn't appeal to 100% to me, I was wondering what was (subconsciously) missing and what I would do different. And without further ado, here are my thoughts. Let me know, what you think and if we find enough players to participate, I'd give it a try:\n\n \n\nYet another online tournament\n\n \n\nSynopsis\n\nYou \"register\" for the YAOT as a single participant, but the games are actually played as 2P games. For each game you will be paired with a different player from the tournament each round against a different quest each round.\n\n \n\n \n\n1. Upon registering you submit a decklist somewhere (maybe to me via PM?), but no heroes yet.\n\n2. Then you will be paired with a random partner for round 1 (as will be everybody else).\n\n3. All groups of 2 players will play one game against the same quest in round 1.\n\n4. Before starting the quest you have to negotiate with your partner which heroes you both use, since the unique rule applies (no double Eowyns and such).\n\n5. Then you play a \"regular\" 2P game and record your score according to the latest FAQ upon winning the quest (losing should also be noted of course).\n\n \n\nThen you enter round two and repeat the points from 2. to 5. with a new partner and a different quest.\n\n \n\nThe winner of a whole jar of virtual cookies will be the player that could win the most number of games, using the scores of won games as tie-breakes.\n\n \n\nThe games could be played one game per week via LackeyCCG and be coordinated here in the Forum, so everybody would have to be able to coordinate one game with a fellow forum member (maybe too complicated?)\n\nHere's what I like about all that:\n\n1. Meeting new people is fun ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n2. You have to build decks that are good generalists and not tailored to a certain quest and can do well with different playing partners and starting heroes.\n\n3. Even more interesting deck building decisions (do I use 3 copies of Steward of Gondor and get matched with somebody, who also has 3?)\n\n4. Rules mistakes will be smaller since you have a 2nd player that might spot that mistake of yours and vice versa\n\n \n\nSo, now I need your help. Does that sound interesting? Or Crap? Let me know and maybe we can get some good games that way.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589849","commentId":589849,"userName":"booored","timestamp":1328361563,"content":"meeting new players is a great idea.. I think it would be cool to make a rule no voice coms :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] That can in a way semi-reinforce the no table talk rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589871","commentId":589871,"userName":"plueschi2","timestamp":1328364769,"content":"booored said:\n\nmeeting new players is a great idea.. I think it would be cool to make a rule no voice coms :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] That can in a way semi-reinforce the no table talk rule.\n\n\n\nHaha, good catch. i didn't even think about voice coms. Personally though I think if everybody can agree on some table talk rules, then we are not likely to see \"cheating\" since you have someone else with you.\n\nThats what I have in mind for table \"chat\": You can talk freely about everything that is in play or in discard piles. And to get some cooperation going, you are allowed to ask questions beginning with \"Can you help me with (insert stuff here)?\"\n\nSo for example:\n\nnot good: Do you have a Feint for the Hill Troll?\n\ngood: Can you help me with the Hill Troll? (since this allows for Feint, Forest Snare, Hasty Stroke, etc.)\n\nnot good: If you got Parting Gifts, then play it and give me three resources on Frodo.\n\ngood: Can you help me get more Spirit resources?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589881","commentId":589881,"userName":"booored","timestamp":1328366474,"content":"I REALLY like the idea of having another player as I think a lot of these comps have invalid scores.. maybe i just suck at the game (witch i doubt) but some of the comments I read about easy of play and 100% win ratios with super low scores.. I simply do not believe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589906","commentId":589906,"userName":"plueschi2","timestamp":1328372731,"content":"booored said:\n\nI REALLY like the idea of having another player as I think a lot of these comps have invalid scores.. maybe i just suck at the game (witch i doubt) but some of the comments I read about easy of play and 100% win ratios with super low scores.. I simply do not believe.\n\n\n\nSo can I count you as potential player 1 then?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589953","commentId":589953,"userName":"SiCK_Boy","timestamp":1328385467,"content":"I doubt I would join, barring exceptional circumstances. The major advantage of the \"solo\" tournaments is that you can play them at your own rythm. Having to coordinate with someone else could become difficult at times with the family. Also, I never used the LackeyCCG program, so I don't know how much of an impediment it would be.\n\nAlso, I'm not certain about not knowing the quests in advance since the TO will know them. If he plays (or tells his friends), it would put him (or them) at a serious advantage. I understand we're talking more about a casual style tournament here, but still...\n\nAnother aspect I'm not too convinced about is changing partners each round. This could lead to all kind of sheanigans in terms of standings or people screwing other's game to advance themselves or a friend.\n\nI may sound negative, but I do hope enough people will take you up on your offer as I'm curious to see the \"tournament dynamic\" such an event would generate. Having been a judge at MtG for a while, where we face collusion cases on a regular basis in PTQ and similar tournaments, I often look for the hole in such tournament organizations. But your suggestion could generate interesting \"data\" on how organized play could / should be if / when FFG finaly reveals it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589955","commentId":589955,"userName":"booored","timestamp":1328385976,"content":"organising a time to play isn't that hard.. I mean.. when you organise with a mate to go to the cinema and grab a beer, you organise a time.. and you meet up.. how it online any different?\n\nI have a 3 player LackeyCCG Game once a week.. with a German, Me (Aussie) and another Aussie in a different state all different time zone...\n\nAlso I agree, you should maybe have the same team member for the duration of the comp. Chances are pretty low that both players would be cheating scumbags.. so I do not think swapping people constantly to assure fair play really matters... Also means they can share deck ideas and tune their decks and stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589960","commentId":589960,"userName":"SiCK_Boy","timestamp":1328386515,"content":"Organizing time with your friends is relatively easy. Organizing time with a complete stranger that may live in a different time zone and may or may not have a baby at home requiring care and time \"off the table\" once in a while (something, again, which is easier to do with friends eating chips and chatting around your kitchen table while they wait for you to return rather than with someone anxiously awaiting your return while sitting at his computer...)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589974","commentId":589974,"userName":"booored","timestamp":1328390692,"content":"yeah i can not see the difference.. in fact playing online is more casual as you can go do w/e and the other person can surf the net chat on forums msg mates... so there is nvr any rush to get back to the table. As for organising a time.. same thing.. they go, well i am free this date and this time. you go how about this.. ok.. mark it in calendar and your good to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589993","commentId":589993,"userName":"plueschi2","timestamp":1328399498,"content":"SiCK_Boy said:\n\nI doubt I would join, barring exceptional circumstances. The major advantage of the \"solo\" tournaments is that you can play them at your own rythm. Having to coordinate with someone else could become difficult at times with the family. Also, I never used the LackeyCCG program, so I don't know how much of an impediment it would be.\n\n\n\nWhile having to coordinate with others might be bothersome, I don't see a way around that (that I prefer) and I think the hurdle ain't too big.\n\nLackeyCCG is a fine program, not too complicated and I could teach others how to use it, if there is need.\n\nSiCK_Boy said:\n\nAlso, I'm not certain about not knowing the quests in advance since the TO will know them. If he plays (or tells his friends), it would put him (or them) at a serious advantage. I understand we're talking more about a casual style tournament here, but still...\n\n\n\nFirst of all: Really?\n\nBut there is an easy solution to that. I can ask a non-participant to randomize the quest for me, or I could use the diceroll function of the BGG-Boards to ensure both randomness and not knowing ahead of time.\n\nSiCK_Boy said:\n\nAnother aspect I'm not too convinced about is changing partners each round. This could lead to all kind of sheanigans in terms of standings or people screwing other's game to advance themselves or a friend.\n\n\n\nAgain: Really?\n\nHow can you screw somebody to advance yourself? The both of you will get the same score at the end of the quest, so losing on purpose harms you, too.\n\nAnd I cannot even image how somebody would try to screw a game in order to advance a friend. For a virtual jar of cookies? I mean, they do be pretty delicious, but I don't see it.\n\nSiCK_Boy said:\n\nI may sound negative, but I do hope enough people will take you up on your offer as I'm curious to see the \"tournament dynamic\" such an event would generate. Having been a judge at MtG for a while, where we face collusion cases on a regular basis in PTQ and similar tournaments, I often look for the hole in such tournament organizations. But your suggestion could generate interesting \"data\" on how organized play could / should be if / when FFG finaly reveals it.\n\n\n\nNo worries mate. I don't expect everybody to be enthusiastic about my suggestions and I'm not going to criticize people for having a different opinion than me. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=589997","commentId":589997,"userName":"plueschi2","timestamp":1328400184,"content":"booored said:\n\nAlso I agree, you should maybe have the same team member for the duration of the comp. Chances are pretty low that both players would be cheating scumbags.. so I do not think swapping people constantly to assure fair play really matters... Also means they can share deck ideas and tune their decks and stuff.\n\n\n\nPersonally to me, swapping teammates is not about cheating control, it is about having more fun and a different twist to deckbuilding, for example:\n\nPeople over here are pretty concerned about Zigil Miner decks being too strong and while it is possible to pull off a 1P Zigil deck, the consensus seems to be (I haven't rad everything about that, I admit) that having a 2P Zigil strategy is more reliable. Now what do you do? Bring the resource deck to the tournament and hope your partner can capitalize on that? What if he has another Zigil deck? Do you bring the other part of that 2P strategy? But what if you end up with not enough resources for your cards, because your partner is not bringing a Zigil miner?\n\nYou get my point?\n\nThe thing here is, that I hope these circumstances will lead deckbuilding back from the extremes to the more general kind of decks, that aim to do well on a lot of occasions. Hope this makes sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=590077","commentId":590077,"userName":"SiCK_Boy","timestamp":1328429371,"content":"About how you could \"screw\" your partner to advanced yourself, it will depend on how you do these pairings. In MtG tournaments, except in the first round where all pairings are random, you get people paired against opponents with similar records. The objective is that, at the end (let's say Round # 6), you'll haxe X people 6-0, so many 5-1, more at 4-2, etc. The pairing system creates a kind of pyramidal results that lead to a single elimination cut-off point.\n\nNow, you didn't mention anything about single elimination cutoff, but even in a fully swiss-style tournament, the issue could appear at some point. For example, we play 5 rounds. I win my first 4 rounds. In round 5, I get paired with a guy who's 0-4. If his friend is also a 4-0 playing in a different match, that person could have strong incentive in NOT helping me win my 5th round (and the fact that he's 0-4 indicates he's probably not too good either, but that's beside the point).\n\nI admit this doesn't really matter in a cookie-jar grand prize casual tournament, but I'm seeing it from a \"people want to win\" perspective that I've seen in multiple tournaments before (including \"prerelease\" that are supposedly casual as well).\n\nThe idea of using a random method in a \"lottery\" style that everyone can assist to is nice to determine the quest. It may even add a bit of hype at the begining of an event.\n\nAs for imposing random partners, you are right that it forces \"generic\" deckbuilding, but I think it goes against the idea of a team/cooperative game. That cooperative aspect should be a part of the whole gaming experience, starting at deckbuilding and going all the way to the end of the game itself. With your rule, you're cutting a major part of it. Designing two complementary decks is much different than designing a single deck that you know will play in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=590104","commentId":590104,"userName":"plueschi2","timestamp":1328436033,"content":"SiCK_Boy said:\n\nAbout how you could \"screw\" your partner to advanced yourself, it will depend on how you do these pairings. In MtG tournaments, except in the first round where all pairings are random, you get people paired against opponents with similar records. The objective is that, at the end (let's say Round # 6), you'll haxe X people 6-0, so many 5-1, more at 4-2, etc. The pairing system creates a kind of pyramidal results that lead to a single elimination cut-off point.\n\nNow, you didn't mention anything about single elimination cutoff, but even in a fully swiss-style tournament, the issue could appear at some point. For example, we play 5 rounds. I win my first 4 rounds. In round 5, I get paired with a guy who's 0-4. If his friend is also a 4-0 playing in a different match, that person could have strong incentive in NOT helping me win my 5th round (and the fact that he's 0-4 indicates he's probably not too good either, but that's beside the point).\n\nI admit this doesn't really matter in a cookie-jar grand prize casual tournament, but I'm seeing it from a \"people want to win\" perspective that I've seen in multiple tournaments before (including \"prerelease\" that are supposedly casual as well).\n\n\n\nI get your point and agree on a general view, but I disagree about the incentive part in this kind of tournament. I think that you (if I may say so, no offense meant), coming from a competitive background in MTG, are biased towards expecting the worst in people when it comes to tournaments. And while I agree here, too, in a general sense, I just don't see this community going that far. There might be issues once \"real\" tournaments are starting, but I strongly suspect that this kind of behavior is unlikely given the circumstances at present.\n\nIf worst comes to worst, we could do the following: People play their games as described, but the scores get sent to me only and not posted anywhere. I could then creates a tournament ranking where people are anonymous while the tournament is still in progress and reveal the winner at the end. That way this cheating friend of yours will not know, that he is currently playing someone who stands 4-0. But that would be an absolute last measure, i don't think those are needed.\n\nIf that friend of yours still insists on participating and screwing ALL the games, so that his friend has a higher chance of winning, then I think we truly have a rare breed of Troll there, not only being wiling to cheat without knowing whether his actions have the desired effect or not and having so much spare time inn his life as to actually go on that endeavor...\n\nSiCK_Boy said:\n\nThe idea of using a random method in a \"lottery\" style that everyone can assist to is nice to determine the quest. It may even add a bit of hype at the begining of an event.\n\n\n\nThats actually a nice idea. So you are basically saying: \"Those quests are in the lottery pool. I will draw one randomly and publicly at this and that time. You have one week after that to participate.\" Sounds like fun.\n\nSiCK_Boy said:\n\nAs for imposing random partners, you are right that it forces \"generic\" deckbuilding, but I think it goes against the idea of a team/cooperative game. That cooperative aspect should be a part of the whole gaming experience, starting at deckbuilding and going all the way to the end of the game itself. With your rule, you're cutting a major part of it. Designing two complementary decks is much different than designing a single deck that you know will play in multiplayer.\n\n\n\nPersonally, i don't see that as a problem. I agree that deckbuilding is part of the fun and building two synchronized decks is a different kind of \"task\", but building a deck that can do equally well with different kind of players and against different kind of quests is also \"different\" and not \"less\" than the other IMO. Think about the possible questions that can arise, like: Lets say Eowyn will be a strong showing and Rohan decks are considered to be \"the best\" (just for the sake of the example) decks around, so you expect to see many Spirit/Leadership decks. Now do you also play one since you consider it to be the strongest deck or do you build a Lore/Tactics deck since you predict to see many of those and want to complement them as good as possible. Or do you do something entirely different? Or this: The strongest cards in the game are often unique, so you might want to include many of them. But what if your partner runs them, too? You get stuck with dead cards more often. I see Celebrians Stone in most all Leadership decks around here, but under those tournament parameters, it might be better to not include it.\n\nAnd I disagree about that my suggestion goes against the cooperative aspect. To me cooperating with any kind of partner is very -well- cooperative. On the other hand, two complementing decks might just be created by one player and he might even \"encourage\" his partner what to do. Looking back over the forums I reckon that you started the threat about FFG embracing Zigil Miner instead of stopping it. How would you feel, if all the top placements in such a tournament were accomplished by a Ziggy + other duo? It looks like you would not like it and neither do I, but I might got you wrong on that one, I am not sure. Given my current tournament ideas, a Ziggy deck would be much riskier to play (I think).\n\nHope that clarifies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=590352","commentId":590352,"userName":"Memetix","timestamp":1328497700,"content":"There are some good ideas here and some niggles that will need ironing out.\n\nWhen building a deck (for solo play) you know what your resource requirements are going to be, how much questing power your deck/heroes have and which unique cards are going to be in play.\n\nIf I am playing leadership, with Steward of Gondor in the deck, I design the deck, knowing which hero(sphere)  I will play the SoG on and can therefore increase the average cost of the cards in the deck for that sphere.\n\nIn 2 player games, a big factor in the success of the deck pair is how well they work together. If both decks are built assuming they will get a SoG into play then 1 of them is going to struggle. If someone is playing a zigil/miner deck using Gildor and the other deck also uses Gildor the pairing will have problems. Both decks could be built around Gloin, using healing to generate extra resources. This would be a nightmare for the player who doesn't get to play Gloin.\n\nPossible options to address these issues included\n\n * Allow players to negotiate before playing about the heroes and cards used. Then design decks and submit them for this quest.\n * Insist players submit 2 decks at the start of the tournament. They then negotiate with their partner before playing as to which ones they will use.\n\n \n\nAlternatively, you take out all deck building and simply assign a pair of decks for each round. The pairing plays the quest twice, swapping decks after the first game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=590581","commentId":590581,"userName":"Budgernaut","timestamp":1328539190,"content":" Something that hasn't been mentioned yet is the card pool. I see complaints about Zigil Minner, but he can't even be played on LackeyCCG, can he? Aren't the virtual packs only released up to Conflict at the Carrock or Journey to Rhosgobel? I use Vassal and it's only up to CatC. Until the game dies, the online scene will constantly be behind the current card pool and this will potentially radically change the deck options. What if I only had the Core Set and the Khazad-dum expansion? This virtual tournament would only let me use my Core Set cards. Okay, this isn't really that big of a deal. I just wanted to point it out.\n\nI think the whole idea is quite interesting. I'm torn between the opinions of SiCK_Boy and Booored. On the one hand, it's inconvenient to have to set up a time to play with a complete stranger when you have a family to take care of (and my few games are constantly interrupted as I attend to various family needs) but on the other hand, it is a whole lot more convenient than a set game night at a hobby shop that happens for 4 hours every week or every month. You know what I mean? But seeing as how I was pumped for playing more first solo competition this weekend and couldn't even find the time to do it, there's no way in Mustafar that this tournament would work for me. It's not fair to your paired partner if something comes up and you can't play after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=590897","commentId":590897,"userName":"plueschi2","timestamp":1328584508,"content":"Memetix said:\n\nThere are some good ideas here and some niggles that will need ironing out.\n\nWhen building a deck (for solo play) you know what your resource requirements are going to be, how much questing power your deck/heroes have and which unique cards are going to be in play.\n\n\n\nI totally understand your point. I myself am a very \"planning ahead\" guy and try to build my decks thoroughly. But all those things are not needed to make it a fun game. Uncertainty and facing tough decisions is what makes the game fun IMHO. And while I still think that the above points are not eliminated in such a tournament, I have to make one plea: Middle Earth is a very perilous and harsh place, so take a step out of your comfort zone and embrace the challenge, instead of shying away from it. Move out of the Shire and face a dangerous adventure. I know you can do it.\n\nMemetix said:\n\nIf I am playing leadership, with Steward of Gondor in the deck, I design the deck, knowing which hero(sphere)  I will play the SoG on and can therefore increase the average cost of the cards in the deck for that sphere.\n\n\n\nAgain, I see you point, but I don't think this is a serious detriment. You cannot auto-assign SoG in you head to a certain sphere. So in order to get the resource distribution you want, cards with resource \"flexibility\" might see more play, like Songs, Parting Gifts or Bifur, etc.\n\nMemetix said:\n\nIn 2 player games, a big factor in the success of the deck pair is how well they work together. If both decks are built assuming they will get a SoG into play then 1 of them is going to struggle. If someone is playing a zigil/miner deck using Gildor and the other deck also uses Gildor the pairing will have problems. Both decks could be built around Gloin, using healing to generate extra resources. This would be a nightmare for the player who doesn't get to play Gloin.\n\n\n\nWorking well together doesn't stop with the deckbuilding aspect... just saying.\n\nI hope you don't mind, if I pick up your Gloin example to show you my thinking about \"flexible\" deckbuilding. So lets say two players get paired together that both rely heavily on Gloin to generate resources. They have both included plenty of healing and some other usual suspects to make Gloin a safe recipient for damage. Now one player though thought ahead and included 3x Parting Gifts while the other didn't. Now during hero selection a strong point can be made, that this player will be using Gloin because of Parting Gifts. But this is not about one player \"winning\" and getting his desired hero, it is about the options that it opens up for both. Since both players have loaded their decks with healing effects Gloin will be able to take that much more damage, thus generating more resources overall. Now thanks to Parting Gifts the resources can be shared and the other player \"without\" Gloin will get a big resource boost from this, which might be not as big as having Gloin for himself, but still much higher than his regular income. Depending on how much safe damage you can take, it will be like both players having 80-100% of Gloin. So by thinking about a possible pairing with another Gloin player, that one player was able to adapt his deck and profit from it.\n\nHope this makes sense.\n\nMemetix said:\n\nPossible options to address these issues included\n\n * Allow players to negotiate before playing about the heroes and cards used. Then design decks and submit them for this quest.\n * Insist players submit 2 decks at the start of the tournament. They then negotiate with their partner before playing as to which ones they will use.\n\n\n\n \n\nThe first point is implemented as of now, but just instead of before the tournament, people can choose different heroes before each quest. I consider the heroes to be some sort of sideboard (so to speak). Imagine the following: You have one designated \"slot\" for a tactics hero in your deck and usually pick Boromir. But when playing against CatC you might take Gimli with you. JtR? Pick Legolas. Return to Mirkwood? Might like Thalin best. And so on. This should give players a little bit of safety net, without being too silver bulletish.\n\nAnd I thought about your 2nd point in the beginning too, but I don't like it anymore. It will promote a dominant 2P strategy like it would, when people bring two synchronized decks (lets just call this dominant strategy Ziggy - I just made the name up xD ). So you bring one Ziggy and one \"regular\" deck, now the only real decision will be which player plays Ziggy and which player his \"other\" deck. Doesn't sound too much like fun to me.\n\nMemetix said:\n\nAlternatively, you take out all deck building and simply assign a pair of decks for each round. The pairing plays the quest twice, swapping decks after the first game.\n\n\n\nThis might certainly be possible, but honestly it sounds like even less fun, at least to me. Especially with the \"need to play 2 games per game\" thing.\n\nCheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=590906","commentId":590906,"userName":"plueschi2","timestamp":1328585598,"content":"Budgernaut said:\n\n Something that hasn't been mentioned yet is the card pool. I see complaints about Zigil Minner, but he can't even be played on LackeyCCG, can he? Aren't the virtual packs only released up to Conflict at the Carrock or Journey to Rhosgobel? I use Vassal and it's only up to CatC. Until the game dies, the online scene will constantly be behind the current card pool and this will potentially radically change the deck options. What if I only had the Core Set and the Khazad-dum expansion? This virtual tournament would only let me use my Core Set cards. Okay, this isn't really that big of a deal. I just wanted to point it out.\n\n\n\nWell, the arrival of the Zigil miner is delayed by 6 month, yes. But I rather think about a structure that works now and in the future, instead of having to redo tournament rules every time the meta shifts. Hope this makes sense.\n\nBudgernaut said:\n\nI think the whole idea is quite interesting. I'm torn between the opinions of SiCK_Boy and Booored. On the one hand, it's inconvenient to have to set up a time to play with a complete stranger when you have a family to take care of (and my few games are constantly interrupted as I attend to various family needs) but on the other hand, it is a whole lot more convenient than a set game night at a hobby shop that happens for 4 hours every week or every month. You know what I mean? But seeing as how I was pumped for playing more first solo competition this weekend and couldn't even find the time to do it, there's no way in Mustafar that this tournament would work for me. It's not fair to your paired partner if something comes up and you can't play after all.\n\n\n\nThere are two things that crossed my mind here:\n\n1. Lackey allows for saving games, so you could play in chunks of 20 minutes, if you communicate that with your playing partner.\n\n2. The case of drop outs might indeed be a problem. We could either allow players more time to play a quest or I as TO could fill in the seat every time one player drops. When two players drop, then the two other players can play together instead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=590937","commentId":590937,"userName":"booored","timestamp":1328590796,"content":"lackey saves teh game every time you press the new turn button... . ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60028-yaot-yet-another-online-tournament/?do=findComment&comment=592700","commentId":592700,"userName":"plueschi2","timestamp":1328876532,"content":" bump\n\n \n\nSo are some people interested in such a tournament?"}]}