{"url":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/","title":"Ideas for next weekend&#039;s Zjb12 Tournament","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590271","commentId":590271,"userName":"Zjb12","timestamp":1328473215,"content":" Okay, soliciting ideas for next weekends tournament.  \n\nI do have one myself based on an idea Leptokurt had mentioned that we haven't tried yet.  It would be to try and attain the highest score by killing enemies and exploring locations.  Points would be based upon the enemies Threat, attack, defense, and hit points along with any victory points if they had them.  I.e., king spider, 2 threat, 3 attack, 1 defense, 3 hit points=9.  Hummerhorns: 1 threat, 2 attack, 0 defense, 3 hit points, 5 victory points=11.  Locations would be threat, plus required progress tokens, and any victory points.  Great forest web: 2 threat, 2 tokens needed=4.\n\n Other thoughts with this: rounds kept track of, but no points.  Your game is over and points calculated when you hit a threat of 60 or all Heros die.  I am picking a threat of 60 to encourage more expensive heroes possibly being used.  Damage and dead hero points do not count against you either.  This is straight up, who can score the more points.  But, also, no Beravor, no galadrim's greetings, no will of the west.  Other possibilities for exclusion: northern tracker, Lorien guide, snowbound scout. But otherwise a 50-60 card deck.\n\nEncounter deck I am toying with: the one we haven't used yet in khazad-dum, (the one with the uruks); the barad-dur from the core set minus the key, torch, map and tower gate locations, but with the nazgul shuffled into the deck; mix those two and add::::::::::::::conflict at the Carrock.  No quest cards.  Shuffle the decks all together and put the Carrock in as the active location.  Then when you start, reveal two encounter cards during set-up.  Now go do some hunting!!!\n\nThoughts?  Am I crazy?  No I haven't tried it yet, but I will if I decide to do it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590332","commentId":590332,"userName":"leptokurt","timestamp":1328492237,"content":"Of course I am biased, but I'd really like to try this out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590453","commentId":590453,"userName":"radiskull","timestamp":1328520534,"content":"Why so much hate on the location-progess-token-putting folks?  Doesn't the Longbeard Orc Slayer do the same thing, scorewise, in this format?  If you ban Beravor, why not ban Bilbo?\n\nI do understand the reasoning behind these decisions; I'm just asking because I want to raise the issue - how much of the banning is there to simply force players to play the game in the way you envision them playing it?\n\nGranted, this is a special format, and I do see how the Galadhrim/Will of the West decktype could break it.  Might I suggest a restricted list, similar to what FFG does in their other LCGs?  The idea is that from the cards on the list, you may choose ONE to use in your deck. (you can use as many copies as you would normally be allowed.)\n\nSo perhaps the restricted list for this tournament would look like:\nBeravor\nNorthern Tracker\nThe Galadhrim's Greeting\nWill of the West\n\nOr something like that - no Galadhrim/Will combos, but you could use one or the other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590473","commentId":590473,"userName":"Zjb12","timestamp":1328524211,"content":"@Radiskull---exactly!  I am listing those cards as a concern that I don't want the game broken by someone sitting there and using Galadrim's Greetings and WIll of the West (with or without Beravor) and just going for broke because they never get to the threat limit when the game finishes.  (Although, this encounter deck will be no piece of cake, that's for sure!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590509","commentId":590509,"userName":"booored","timestamp":1328530378,"content":"Just for once I would like something non restricted were we can use our entire card pool"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590520","commentId":590520,"userName":"radiskull","timestamp":1328531597,"content":"I'm with you, booored.  I'm pretty opposed to most unoffical house rules / bannings / card changes on principle (although I do like the weighted scoring system).  My thought is that if people want to run Beravor + UCx3 and draw their whole deck, that's fine.\n\nI realize that this probably will lead to a single decktype dominating the metagame, which is when FFG should step in and issue an official fix via errata or their own restricted list.\n\nI don't mind the restrictions made for thematic reasons, but I also don't agree with Glaurung's suggestions re: the current allowable card pool.\n\nObviously there are people who disagree with me, and that's fine.  But that's my 2 cents, in any case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590536","commentId":590536,"userName":"Zjb12","timestamp":1328534012,"content":"Radiskull, booored, what would you do for this scenario then when you know their are people who will run a beravor, galadrims greetings, will of the west deck to keep cycling their threat low until they can score as much as possible?  I don't really care about the fact that someone can sit there and keep their threat down to zero or whatever, I want to see them do some good fighting and compete with one another on that.  Thoughts? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590558","commentId":590558,"userName":"radiskull","timestamp":1328537526,"content":"I think what you've done for this particular scenario is fine, since you're trying to do something that is not just \"do the quest and see how well you can do it\".  In general, though, I think if you need to restrict a particular decktype, I'd recommend a restricted list.  Saying that you can have one of these X cards, but not more, goes a long way to breaking abusive combos.\n\nI'm not saying you should change your tournament; I think it's a neat idea.  I just wanted to get my point of view out there to act as a counterweight to Glaurung's (and others) \"OMG everything's broken ban it\" attitude.  (And Glaurung, I'm not picking on you specifically, it's just that yours is the name I associate with those ideas most strongly - I respect your opinions and your presence in these forums, even if I don't always agree with you happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590569","commentId":590569,"userName":"leptokurt","timestamp":1328538418,"content":"If you ban Beravor to let her do the household over 100 years of fighting for gender equality have been for nothing.\n\n \n\nI'm not a big fan of banning cards either, the idea of restricting those sounds interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=590624","commentId":590624,"userName":"Budgernaut","timestamp":1328542462,"content":" What about a 1 point bonus for each restricted card NOT used in your deck? Probably not worth the extra point . . ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=591333","commentId":591333,"userName":"Zjb12","timestamp":1328635305,"content":" Alright!  Thanks for the feedback guys.  Maybe I can try and play though this tonight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=591383","commentId":591383,"userName":"Zjb12","timestamp":1328643320,"content":" So I tried it tonight.  Everything I said above but only one encounter card at the beginning.  I played with a high threat trio of glorfindel, Gimli, Aragorn.  I lost by treating out.  This mixture of encounter cards is pretty tough even without pulling any trolls or the nazgul!  I only killed four baddies for 44 points, 2 mountain wargs, and two black uruks.  There is definitely a different feel to it.  Oh, I did also have snowbound scouts in my deck.  I had no spirit cards at all.  So, it's playable, but I want to try it some more.  Started out with way too high a threat!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=591394","commentId":591394,"userName":"Zjb12","timestamp":1328645058,"content":" Okay, so second game, I actually gave up because I was blowing out the deck.  Switched Heros to bifur, Gimli, imrahil.  Think we will need to start with two cards at the beginning from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=591404","commentId":591404,"userName":"Zjb12","timestamp":1328646754,"content":" Think 2 encounter cards at the beginning is the way to go, though it makes it tougher.  Lost game 3 by dead Heros.  Game 4 got to 60 and hadn't scored much.  But so much depends upon encounter deck draw and allies in hand.  Also, I am not sure this is the perfect deck.  But when I only drew one, that one game I got bored.  So I think this is the way to go.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60069-ideas-for-next-weekends-zjb12-tournament/?do=findComment&comment=591413","commentId":591413,"userName":"Zjb12","timestamp":1328648370,"content":" One other thought---what about rookie, intermediate, and pro level?"}]}