{"url":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/","title":"Which spheres work well together?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590243","commentId":590243,"userName":"tripecac","timestamp":1328467751,"content":"I've just started building my first 2-sphere decks, and arbitrarily picked Leadership and Spirit.  I guess I'm doing okay, but what I wonder if if there are known \"good\" and \"bad\" combinations of spheres. \n\nFor example, it seems to be common knowledge that Tactics is pretty awful by itself.   Which of the other 3 spheres is most likely to \"help\" it? \n\nIs the effectiveness of certain spheres (and sphere pairings) scenario-dependent?  Or are there good general combos?\n\nAlso, do the new player cards in the adventure packs radically alter the spheres' strengths, or do they simply add more variety?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590246","commentId":590246,"userName":"Stenun","timestamp":1328468099,"content":"All of them work well together, to be honest.  And, unless your playing Solo, all of them work well by themselves.\n\nMy pure Tactics deck is often used with a friend's pure Spirit deck.  He goes questing, I go killing.  So I wouldn't say there was a \"bad\" spehere in any way unless you're looking for a Solo deck.  And if that's the case, you need to combine spheres no matter what."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590249","commentId":590249,"userName":"richsabre","timestamp":1328468636,"content":"tripecac said:\n\n \n\nI've just started building my first 2-sphere decks, and arbitrarily picked Leadership and Spirit.  I guess I'm doing okay, but what I wonder if if there are known \"good\" and \"bad\" combinations of spheres. \n\nFor example, it seems to be common knowledge that Tactics is pretty awful by itself.   Which of the other 3 spheres is most likely to \"help\" it? \n\nIs the effectiveness of certain spheres (and sphere pairings) scenario-dependent?  Or are there good general combos?\n\nAlso, do the new player cards in the adventure packs radically alter the spheres' strengths, or do they simply add more variety?\n\n \n\n \n\ndepends on what you want.....i prefer lore/spirit as i like to take enemys down by other means apart from fighting them,\n\njust look at what each one has to offer i.e.\n\nspirit- questing, treachery prevention\n\nlore- healing card draw and encounter deck peeking\n\ntactics-fighting defending\n\nleadership- all round and buffing up stats\n\n \n\nso if you take that as a start point just buil your deck around that\n\nand yes i would say ad packs do change it- especially tactics and spirit- tactics get eagles which are great and spirit get rohan which are also great\n\nwhen building decks its best to think around what the quest is asking of you- is it full of bad locations? treachery cards? nasty enemies?\n\nthen take the spheres and the best bits listed above and sort of cross reference them and youve got your match\n\nwell thats how i do it, i usually do double spheres, but i guess the priciples the same\n\nalso your choice can depend on your hero choice- so do you really need denethor in a quest- like rhosgobel? if so then youve got your lore sphere, then you may think, oh dunhere looks good for this as there are alot of high engagement value enemies which i dont want lingering in the staging area- so then you have spirit- your 2nd sphere- and do the same for your 3rd\n\nof course it gets a bit more complex with song cards as you can mix and match- but these points are a good start"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590260","commentId":590260,"userName":"SiCK_Boy","timestamp":1328470708,"content":"I don't think there are any sphere that work best together in a generic / default sense. Too many factors influence the way spheres work together.\n\nAs for AP, I think their main influence is on Lore. Lore becomes very strong once you have Rivendell Minstrel as it gives you access to all Songs cards.\n\nI think your best shot is to consider your overall aim. If you don't know yet what your playstyle is (I'm pretty much a Spirit / Lore player), then you can look at it from your hero's perspective (just decide which heroes you want to play and build your deck around them). Looking at it from the scenario's perspective (you'll want Lore if playing Journey to Rhosgopel) can also work, as pointed out earlier.\n\nOverall, I see Leadership as mostly a support sphere (that is, a lot of cards you can splash, but I'd never play 2 leadership heroes, for example). Spirit would also be a splash if it wasn't for Northern Tracker (you need heavy spirit resource production to play him, and he's always good against all scenarios); unless you aim to play Rohan (which is spirit intensive by nature). Tactics can make a great deck on its own in multiplayer; otherwise, it's rarely worth splashing it (yes, Tactics is good at fighting, but all spheres are able to up to a point; Tactics doesn't have anything unique, as opposed to Lore with healing or Spirit with Treachery cancelation, for example)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590276","commentId":590276,"userName":"tripecac","timestamp":1328474244,"content":"I'm playing solo.\n\nRight now I am finding Anduin very hard with Tactics+Lore and am wondering if it's not a good combo.\n\nAre most of the later quests this painful?\n\nShould I consider forgetting pure solo and start playing with 2 decks?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590283","commentId":590283,"userName":"muemakan","timestamp":1328477608,"content":" Love leadership/lore, like spirit/tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590320","commentId":590320,"userName":"plueschi2","timestamp":1328488061,"content":"muemakan said:\n\n Love leadership/lore\n\n\n\nThis.\n\nI have to agree though, that no certain combination is better than any other. But, Leadership plus Lore is the most beginner friendly in my opinion as you have access to the two strongest aspects of the game: Resource generation and card draw. Overall I find Leadership/Lore to be a very reliable combination, usually not the fastest deck around, but can deal with any situation and keeps staying in the game (thx to healing)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590322","commentId":590322,"userName":"tripecac","timestamp":1328488753,"content":"I've been playing with Leadership/Spirit, and I was hoping to get Tactics/Lore working so that I could have 2 \"working\" decks to play with.\n\nIf I switch to Leadership/Lore, then the other deck would be Tactics/Spirit.  Is that a decent combo, or is it not beginner-friendly?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590327","commentId":590327,"userName":"plueschi2","timestamp":1328491775,"content":" Spirit/Tactics is less beginner friendly in my opinion.  The point being exactly the same as with Leadership/Lore, just opposite: You have no noticeable resource acceleration and pretty limited card draw. This means two things: You have to be that much more strict with deckbuilding, so that you don't end up with cards that you cannot pay for and the cards in your hand better be the right ones for the given situation.\n\nThis is not saying however that a Spirit/Tactics deck is weak, far from it, they have pretty powerful and \"focused\" cards. For example it has been noted on several threads that Leadership allies are somewhat pricey for what they do. This gets offset by the fact, that they have the best resource acceleration in the game so it evens out.\n\nIf you want to build a Spirit/tactics deck, I'd say try to fill in these gaps as much as possible, eg bring Horn of Gondor and Radagast (with some Eagles and probably the Riddermarks Finest) and definitely take 3x Ancient Mathom and if you decided to go the eagle route then also 3x The Eagles are coming. Bring 3x A Test of Will since you cannot heal or get rid of Caught in a Web an the like. And I'd probably take Boromir any day in that constellation, just saying :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590355","commentId":590355,"userName":"richsabre","timestamp":1328498409,"content":"tripecac said:\n\nI'm playing solo.\n\nRight now I am finding Anduin very hard with Tactics+Lore and am wondering if it's not a good combo.\n\nAre most of the later quests this painful?\n\nShould I consider forgetting pure solo and start playing with 2 decks?\n\n\n\nkeep at it man, anduin is hard even compared to much later quests, there are at least 2 easier than it, if not 3 or 4 in my opinion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590412","commentId":590412,"userName":"ZillaGod","timestamp":1328511596,"content":" I'm having the exact same issues, thanks everyone for your input. I'm going to give it another try right now!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=590858","commentId":590858,"userName":"tripecac","timestamp":1328576557,"content":"I just tried Anduin with a Leadership/Lore deck and won pretty easily. Of course, I know there's a big element of luck, and that if/when I try it again, I'll probably lose 5 times in a row. However, it felt good to get all those resources and cards, and made the Gandalf/Sneak Attack combo feel a lot less miraculous! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nNot sure if it's worth trying Tactics/Spirit against Anduin next... I suppose the threat reduction can help offset the wimpy questing, but I'm worried that it will just be frustrating/depressing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=591180","commentId":591180,"userName":"Budgernaut","timestamp":1328618708,"content":"tripecac said:\n\nI just tried Anduin with a Leadership/Lore deck and won pretty easily. Of course, I know there's a big element of luck, and that if/when I try it again, I'll probably lose 5 times in a row. However, it felt good to get all those resources and cards, and made the Gandalf/Sneak Attack combo feel a lot less miraculous! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nNot sure if it's worth trying Tactics/Spirit against Anduin next... I suppose the threat reduction can help offset the wimpy questing, but I'm worried that it will just be frustrating/depressing!\n\n\n\nThe only time I've won Anduin solo so far is with Spirit/Tactics. It took me three tries to get it right. The main idea was pumpingup Dûnhere's attack with Tactics attachments and keep threat low to prevent engagement of enemies. I'd say give it a try! Of course, there are other Spirit/Tactics combos that don't rely on Dûnhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=591263","commentId":591263,"userName":"tripecac","timestamp":1328626607,"content":"Awesome idea!  I'll give that a try today..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=592385","commentId":592385,"userName":"tripecac","timestamp":1328822382,"content":"I just finally beat Anduin with Spirit/Tactics.  After about 10 tries.  What a great finally to finally get it under control.\n\nThe hero combo which did it for me was Eowyn, Dunhere, and Legolas.  Dunhere got a +1 attack, which helped him whittle away at the troll and everything else.  And I got a couple of gandalfs and one of those threat reduction cards pretty early on.  By the time my threat finally hit 30 I had a ton of allies out, so I was able to keep the second stage under control.  Legolas was key to keep the progress flowing.\n\nGreat feeling to finally be done!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=592415","commentId":592415,"userName":"Budgernaut","timestamp":1328827337,"content":"Congratulations! I'm glad you were able to pull off a win. I didn't realize how finicky a 50-card Spirit/Tactics deck from just 1 Core Set could be. I played 6 games today with a Spirit/Tactics deck against Anduin. I used Thalin instead of Legolas. I only won one of the games which gives me a 2/9 win percentage for that deck on that quest. I'm thinking it's time I buy some new cards or rethink my strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=592766","commentId":592766,"userName":"tripecac","timestamp":1328883616,"content":"I tried a few different hero combinations before finally winning with Eowyn, Dunhere, and Legolas.\n\nEowyn is pretty much a no-brainer, so I kept her at all times.\n\nI found Gimli to be useful against the trolls only when with the +4 armor.  But that didn't happen very often,   And IMO his ability to (usually) survive one troll attack plus his attack strength bonuses... just weren't worth the extra threat.\n\nDunhere was great, because he could quickly kill snipers and other low-defense attackers in the staging area.  This was key to keeping the staging threat down during the long Anduin chase.  Lego was key to quickly progressing through locations.  And he had a good attack strength.\n\nAnd of course there were the allies.  Northern trackers were awesome.  Great for defending against normal enemies, and great at knocking out locations in the staging area.  I had 2 of them in play when I won, which definitely helped!\n\nI found that using 2 spirit and 1 tactics hero worked best.  Aside from allies, there's only a couple tactics cards that really help improve chances, but there's *lots* of spirit cards which help out. \n\nI think one thing that would be a big help is 2 core sets.  I really wish I had 3 of all the cards I found useful.  Then I'd get rid of some of the borderline cards.\n\nHaven't cracked the adventure packs yet... Maybe some of those cards will help as well. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=592816","commentId":592816,"userName":"richsabre","timestamp":1328891992,"content":"tripecac said:\n\nHaven't cracked the adventure packs yet... Maybe some of those cards will help as well. \n\n\n\ni find most of the adventure packs quests easier than anduin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60064-which-spheres-work-well-together/?do=findComment&comment=593023","commentId":593023,"userName":"divinityofnumber","timestamp":1328967549,"content":" I really enjoy a Spirit/Tactics combination. \n\nIf you get unexpected courage on Gimli, and have a couple of trackers in play, you can quest like a boss and kill just about anything relatively easily. Plus, you can also attack things that are in the staging area, and get some damage on them before letting Legolas and Gimli at them. \n\nI had played Escape from Dol Guldur many times, and was crushed with all of the other combinations of decks. Spirit and Tactics seems like an awesome combination!\n\nI finally beat Escape from Dol Guldur for the first time last night, using the 30 card core set Spirit and Tactics decks. It felt awesome. "}]}