{"url":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/","title":"RETURN TO MIRKWOOD SOLO!!!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590780","commentId":590780,"userName":"MarioelKamui","timestamp":1328558785,"content":"I play a couple of games and I lost badly...4 threath every turn!!! anyone can past this quest solo?? with wich deck??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590839","commentId":590839,"userName":"booored","timestamp":1328569995,"content":"this quest is retarded.... most lily the worst quest in existence for solo players, Even Escape is a cake walk compared to this. This quest is by far teh worst designed quest yet released from FFG.\n\nThe only way to beat this quest is to make a Rabbit Run Deck. Rabbit decks are heavy spirit decks running the Rohan tribe and your aim is to quest as fast as possible and just hope that you do not draw an encounter card that screws you. It works.. sometimes.. but you are not even playing the game.. you could basically just shuffle and draw 15 encounter cards.. if they are benine.. you win.. if not you loose.. as playing this deck is justy like that. Your ownly hope is to quest at a super speed and just hope that nothing bad is revealed form the encounter deck,\n\nAbsolutely rubbish quest and if not for the player cards that are very powerful in the pack it would be the only quest I would recommend no one buy. The quest plays much better in 2 player.. but this quest is the proof that solo play is a far second consideration during the design process.\n\nSome common house rules that make this quets MUCH more fun.,..\n\nChange teh Gollum Card effect to increase only 2 instead of 3 (try 1 if you stll think it is crazy) and that location that lowers threat.. have it effect the 1st player when it is a solo game.\n\nStill this quest is just crap... do not bother.. it might be playable when the card pool is much larger and power creep has made it easier.. untill then.. I would just ignore it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590860","commentId":590860,"userName":"player582283","timestamp":1328577371,"content":"With all due respect to Booored, his opinion is not necessarily widespread.  See the following link for some fairly interesting thoughts on the SoM quests, including RtM by several folks\n\n \n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=589676&efpag=0#591909 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=589676&efpag=0#591909]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590868","commentId":590868,"userName":"booored","timestamp":1328578894,"content":"Woz said:\n\nWith all due respect to Booored, his opinion is not necessarily widespread.  See the following link for some fairly interesting thoughts on the SoM quests, including RtM by several folks\n\n \n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=589676&efpag=0#591909 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=589676&efpag=0#591909]\n\n\n\nrubbish... what deck did you use , and will it win say once in 3 games regularly?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590872","commentId":590872,"userName":"guciomir","timestamp":1328579504,"content":"Boored is wrong and probably can't beat the quest solo. Well, he found a strategy of rushing and not thinking, but this is like a coin flip and does not give you much fun.\n\nTry decks which can progress fast and pack a lot of threat reduction plus some reveal counters to mitigate those +8 threat cards. Do not go full speed and add some attacking power, so the deck will also hold its own vs other quests and so you can kill those damned attercops. I am running Eowyn - Theodred - Legolas with 2 greetings, 3 gandalfs and 2 sneak attacks. Great thing about Legolas is that he can really accelerate you. My victory rate after 35+ games is around 33%, so I would say it is pretty solid. (as a comparison, in dol guldur I achieve victory rate just around 10%).\n\nAnd before anyone starts talking how attercops are broken... No they are not. Given the choice, I would ALWAYS choose to encounter and kill attercop with my deck instead of meeting deadly troll"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590874","commentId":590874,"userName":"booored","timestamp":1328580357,"content":"show us your deck then.... ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590882","commentId":590882,"userName":"plueschi2","timestamp":1328581946,"content":"booored said:\n\nshow us your deck then.... .\n\n\n\nI dont have a decklist available, but in juicys tournament I played a \"mono\" Lore deck with Beravor, Bilbo and Denethor, splashing all other spheres. This was basically a stall deck combined with the Beravor shenanigans, drawing and recycling your whole deck. Once you get more than one Gandalf per round, even 4 threat per turn cannot bring you to 50 threat. One key card (aside from the usual, like SoG and UC) is Common Cause, use it with Bilbo on Beravor for more draw in the beginning and with Bilbo on Denethor after you start recycling your deck for easy Encounter deck scouting. Oh and Shadows of the past works also well there.\n\nDidn't feel too hard, but I cannot provide a serious win percentage as my score with this deck is simply 1 out of 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590887","commentId":590887,"userName":"booored","timestamp":1328582761,"content":"exactly.. it is the win % that is important. Anyone can build a deck and win in a lucky draw... but that is the point.. it is all about teh encouner draw.. ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590889","commentId":590889,"userName":"plueschi2","timestamp":1328583106,"content":"booored said:\n\nexactly.. it is the win % that is important. Anyone can build a deck and win in a lucky draw... but that is the point.. it is all about teh encouner draw.. .\n\n\n\nGuess thats the point of my deck, unless you start with a double Attercopp (which probably ruins every deck), Denethor can manipulate the \"luck of the draw\".\n\nWould you believe me, if I posted a decklist and play 3 (or 5 or whatever) games? Or would you assume, that I missed some rules? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590902","commentId":590902,"userName":"leptokurt","timestamp":1328585188,"content":"RtM is certainly the hardest solo quest (I  consider EfDG as a multi player quest). Booored has a point as this quest is badly designed. It's full of excitement, but one is not able to enjoy it because you have to hurry through the scenario. If they had just lowered the amount of threat points that are added to the guarding player in solo mode, RtM would be awesome. That's why I'm adding only 2 points each round as a house rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590931","commentId":590931,"userName":"booored","timestamp":1328590081,"content":"Yes i would add me you i did... .. meet me online.. we can play in lackeyccg.. if you can win 3 out of 5 games I'll buy you the 1st pack of the next cycle, only using cards from SOM"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590933","commentId":590933,"userName":"plueschi2","timestamp":1328590251,"content":"booored said:\n\nYes i would add me you i did... .. meet me online.. we can play in lackeyccg.. if you can win 3 out of 5 games I'll buy you the 1st pack of the next cycle, only using cards from SOM\n\n\n\nthats a kind offer and Id like to give it  a shot, but we'll have to wait 3 more month until RtM is released in Lackey."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590934","commentId":590934,"userName":"booored","timestamp":1328590514,"content":"I'll talk to Tragic, I know he has a full version as he posted that ziggy thing.. we can get him to host it as well, that way we can have a 3rd party judge it and record your utter fail for everyone to see... assuming he would be into it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590949","commentId":590949,"userName":"plueschi2","timestamp":1328593785,"content":"booored said:\n\nand record your utter fail for everyone to see\n\n\nhaha, nice attitude you got there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590954","commentId":590954,"userName":"richsabre","timestamp":1328595003,"content":"MarioelKamui said:\n\nI play a couple of games and I lost badly...4 threath every turn!!! anyone can past this quest solo?? with wich deck??\n\n\n\nim not joining in with the arguing but ill just say i have beat it, but my way is certainly not consistent and far from it- basically single sphere spirit- almost all rohan cards - the decks super fast and relys flying through the quest cards unhindered in about 5 turns before your threat maxes\n\n \n\na load of crap and not fun?\n\n \n\nwell try it. i find being chased on my heels sort of fun- not what id want by any means in other quests, but for a one off fun. also if you just want a 1 time win to say youve done it, then it may be worth trying"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=590967","commentId":590967,"userName":"Eryx_UK","timestamp":1328597681,"content":"Played this quest for the first time last night. I can get to the last stage of the quest easily but then everything falls apart  on that last one and that is with a Rohan rush deck. After four attempts I gave up for the evening."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=591045","commentId":591045,"userName":"goblin981","timestamp":1328607258,"content":" I just played it for the first time and got slaughtered.  It seems like you need to quest heavy and still bring out a decent army before you're not able to.  Eleanor is a must, to deal with all the treacheries.\n\nI'm going to redesign my deck for this quest, any tips?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=591085","commentId":591085,"userName":"leptokurt","timestamp":1328611092,"content":"goblin981 said:\n\n I just played it for the first time and got slaughtered.  It seems like you need to quest heavy and still bring out a decent army before you're not able to.  Eleanor is a must, to deal with all the treacheries.\n\nI'm going to redesign my deck for this quest, any tips?\n\n\n\n \n\nI played with Eleanor, Dáin and Glóin and had some success (40-50 % win ratio). Denethor is a good alternative to Eleanor, I guess it depends on the sphere you want to have early access to. Parting Gifts is a card that's worth gold when you have two leadership heroes and Steward of Gondor as you can shift tons of resources to Eleanor/Denethor, there are some low cost leadership allies who also have willpower, you have the Snowbourn armada as meat shields, Sneak/Gandalf,Celebrían's Stome (which can be played in round 1 already) and so on. Escort from Edoras can be played early to trigger the effect of Strength of Will. Dáin is your guarding your rear against attacking enemies. Give him some Dúnedain Warnings, and he can even stop Attercop, Attercop for a while. Give him Unexpected Courage and he becomes a monster."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=591121","commentId":591121,"userName":"gatharion","timestamp":1328614275,"content":" I don't think that this is the most interesting Quest for Solo play. A lot of the cards and player choices simply don't matter when only one player can guard Gollum. \n\nIt can definitely be a hard quest. A Hilltroll on my first turn and a Hilltroll during the last stage defeated me during my first two plays, but a solid questing deck can handle this quest. Not always though, luck plays a factor, but that's how games like this work; if there wasn't a chance of losing, then there wouldn't be much point in playing.\n\nJourney to Rhosgobel gave me a lot more difficulty. \n\n \n\nPersonally, I think Quests should have different ratings based on the number of players. Journey down the Anduin and Escape from Dol Goldur are extremely tough in solo play, but get much easier as you add more players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=591170","commentId":591170,"userName":"Berdfre","timestamp":1328617924,"content":"Bought this exap. along with core set this past Saturday. Have enjoyed playing it alot.Have't got to play return to Mirkwood quest yet most likely me and\n\nmy son will play tonight. I will post up what happens tomorrow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=591380","commentId":591380,"userName":"player582283","timestamp":1328642795,"content":"booored said:\n\nrubbish... what deck did you use , and will it win say once in 3 games regularly?\n\n\n\nThanks for your response Booored.  I posted an earlier iteration of the deck before in the the forums - ironically a thread you actively participated in!  See page 2.\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efpag=1&efid=201&efcid=4&efidt=578274 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efpag=1&efid=201&efcid=4&efidt=578274]\n\nThe deck evolved a little since then but just a few tweaks.  I'll post the updates later - gotta run to a gaming night...to play LotR.  Actually I'm hitting right at about 30% win rate.  I've played RTM a little more than a dozen times and won 4 or 5 times. \n\nOne important note...I think you are missing my point.  Regardless of my win rate, I had fun for most of those games.  I think RtM is fun..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=591546","commentId":591546,"userName":"plueschi2","timestamp":1328683580,"content":" @booored: Whats your name in LackeyCCG?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=591658","commentId":591658,"userName":"Berdfre","timestamp":1328699955,"content":"Well tried  this quest last night got hammered. **** luck of the draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60106-return-to-mirkwood-solo/?do=findComment&comment=592821","commentId":592821,"userName":"player1761766","timestamp":1328892766,"content":"Wow, there was some serious hate in this thread!\n\nI have never completed this one (I refuse to think of it as \"winning\" or \"losing\"), but it's one of my favourite scenarios in the game so far. Probably says a lot about me..."}]}