{"url":"https://community.fantasyflightgames.com/topic/60111-new-player-question/","title":"New player question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=590819","commentId":590819,"userName":"player2052423","timestamp":1328566889,"content":"Can you play this game solo?  If so, is the game difficult to learn?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=590838","commentId":590838,"userName":"guest455987","timestamp":1328569641,"content":"Yes, definitely.  You can play solo either with one deck, or controlling 2 decks as if playing with 2 players.  It's a great solo game, IMO.  It's not that difficult at all to learn.  I recommend watching the FFG tutorial  videos."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=590841","commentId":590841,"userName":"booored","timestamp":1328570336,"content":"yes, the game plays very well solo. The game can be very hard solo, as it is designed for 2 players, and some quest are just ridiculously hard solo.. even so.. the solo version of the game is very good and for the most part extremely fun. There is also a solitaire version were you play exactly like a 2 player game but control both decks yoursople do this as it allows you to play solo but you do not have the scaling problems of the \"real\" solo game.. either way you do it.. the game is very good for solo playing.\n\nYes. the game is difficult to learn.. not to pick up.. but the complex interactions of the rules trick even \"veterans'.. I have been on this forum form b4 it launched and have yet to see a single player EVER not get things totally wrong now and then.. That includes Grudunza above me.. So while the game is easy to pick up, you wil find that as you play it may take a long time b4 you are comfortable enough to say you are playing correctly, and the you will most lily see a new thing that invalidates all your scores.\n\nEither or, this doesn't effect your enjoyment... so have a go at it.. one thing though. . this is a deck building game... that is the main focus of the game.. if you do not like deck building then do not get this game.,\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=590960","commentId":590960,"userName":"richsabre","timestamp":1328595978,"content":"Moses2813 said:\n\nCan you play this game solo?  If so, is the game difficult to learn?\n\n\n\nheres my 5p\n\n \n\nyes you can play this solo, completely and utterly solo without any modifications of house rules to the game- you do not need to buy anything but the core set and all expansions are also again completely solo, though some are harder then others\n\n \n\nnow to the second part.....yes, i would say it is difficult to learn, but i would say it was harder for guys like me and boored and the rest of the people who were here when the game got released and when there wasnt any rules clafications or faqs!! now newcomers have a tonne of resources to help them get started. there are around 100 pages on here- most of them rules questions, there is an updated official faq, there is an unnofficial faq for questions dealing with new cards, and lastly you can contact the game designer nate to ask extra hard questions.\n\n \n\nonce you get the turn phases in your head its not too bad though. also timing of card effects is the hardest thing\n\n \n\nother than that, go for it! its an extremely fun game solo, and very addictive\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=591174","commentId":591174,"userName":"player2052423","timestamp":1328618254,"content":"booored said:\n\nEither or, this doesn't effect your enjoyment... so have a go at it.. one thing though. . this is a deck building game... that is the main focus of the game.. if you do not like deck building then do not get this game.,\n\nCan you elaborate on the \"deck building game\" ?  Do you mean as in Dominion?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=591206","commentId":591206,"userName":"radiskull","timestamp":1328621450,"content":"No, your deck will not change in the course of a single game.  \"Deck building\" here is similar to the CCG concept of \"build the best deck you can, given the cards you have\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=591234","commentId":591234,"userName":"player2052423","timestamp":1328624113,"content":"One final question,\n\nWhen I demoed the game at GenCon last year, one area that players did not like was the lack of main characters in the starter game.  Is there certain expansion packs that have the main characters from the books/movies that may be more enjoyable if I try to get someone else to give the game a try?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60111-new-player-question/?do=findComment&comment=591247","commentId":591247,"userName":"starhawk77","timestamp":1328625022,"content":"Moses2813 said:\n\nOne final question,\n\nWhen I demoed the game at GenCon last year, one area that players did not like was the lack of main characters in the starter game.  Is there certain expansion packs that have the main characters from the books/movies that may be more enjoyable if I try to get someone else to give the game a try?\n\n\n\nIf you're going for familiar characters, the Core Set has Aragorn, Eowyn, Gimli, and Legolas (along with Gandalf and Faramir as allies). The Hunt for Gollum has Bilbo, Conflict at the Carrock comes with Frodo, and The Dead Marshes includes Boromir. "}]}