{"url":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/","title":"Additional tournament idea for this weekend","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=591415","commentId":591415,"userName":"Zjb12","timestamp":1328648598,"content":" What if, with all the talk about limiting and restricting cards, we rethought this and considered different difficulties in terms of the player decks.  Rookie: can choose from all cards and heroes for a quest; intermediate: can choose from most cards and heroes, but certain ones would be limited or disallowed for this quest; pro: certain cards off limits and limited to 1 each of any card in the player deck!!!  (yes, a deck of 50 totally different cards!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=591459","commentId":591459,"userName":"Glaurung","timestamp":1328658569,"content":"Zjb12 said:\n\n What if, with all the talk about limiting and restricting cards, we rethought this and considered different difficulties in terms of the player decks.  Rookie: can choose from all cards and heroes for a quest; intermediate: can choose from most cards and heroes, but certain ones would be limited or disallowed for this quest; pro: certain cards off limits and limited to 1 each of any card in the player deck!!!  (yes, a deck of 50 totally different cards!)\n\n\n\nNow is sound interesting! Maybe i will also participate if you make ban and restricted list......"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=591529","commentId":591529,"userName":"SiCK_Boy","timestamp":1328679020,"content":"I don't think the tournaments generate enough participations yet to justify such categories. In the long run, it could be an idea, but I'm not totally sold... most players will probably NOT want to be considered rookies anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=591597","commentId":591597,"userName":"Zjb12","timestamp":1328692546,"content":"SiCK_Boy said:\n\nI don't think the tournaments generate enough participations yet to justify such categories. In the long run, it could be an idea, but I'm not totally sold... most players will probably NOT want to be considered rookies anyway.\n\n\n\nI agree that most of the current tournament players would not even be rookies!  But, I wonder about those who are new to the game if they'd be up for it.  I just got the game in November but my learning curve was vastly sped up when I started playing tournaments with you guys because I learned so much.  I wondere if some people might be scared to play in a tournament or think we are all like ultra-competitive.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=591752","commentId":591752,"userName":"Memetix","timestamp":1328714748,"content":"I think this idea has merit going forward but right now it seems it is better to get more people involved.\n\nThere are more tournaments than time! Often an event will get less than 5 people entering so maybe events that have fewer constraints (i.e. only require 1 core set) and run for at least 1 week will get more entrants.\n\nThere is no reason participants couldn't apply the deck constraints themselves. i.e. when posting a score they could say if the deck was designed\n\n * Unrestricted (3 x core + all APs)\n * Core (1 x core + all APs)\n * Restricted (using a tournament specific restricted list)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=592113","commentId":592113,"userName":"Budgernaut","timestamp":1328788760,"content":" I would have NO shame in calling myself a Rookie. Of course, I only have 1 Core Set at the moment. I agree with the sentiments above that it's hard for new players to get involved with tournaments, mostly because of time. I've tried participating in one or two tournaments so far (and I'm limited in what I can participate in because of the scenarios I own) but each time I've tried, I lost every game and never had a score to post. I would have needed more time to alter my deck and try again.\n\nBy the way, that recent two-hero Passage through Mirkwood tournament was brutal!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=592315","commentId":592315,"userName":"Zjb12","timestamp":1328812842,"content":"Budgernaut said:\n\nBy the way, that recent two-hero Passage through Mirkwood tournament was brutal!\n\n\n\nyes it was!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60165-additional-tournament-idea-for-this-weekend/?do=findComment&comment=592318","commentId":592318,"userName":"juicebox","timestamp":1328813140,"content":"Personally, I don't find it helpful to categorize these options in terms of \"level\" of play. I just see them as different - each one challenging in it's own way. And I do think that variety is nice - it makes life spicy. That said, I would probably shy away from using language like \"Rookie\" or \"Pro.\" It's probably more a matter of taste than experience.\n\nAlso, I agree that something like this may be more meaningful a bit further down the road. Especially once these forums are given some categories (yes, I'm thinking optimistically here).\n\nAnother question Zjb12, have you considered creating a \"meta\" ranking system for your tournaments like I've been doing (juicebox Hall of Fame)? I think it adds another level of fun to the whole mix. Our tournaments have different feels to them anyway, and it would kind of be like in tennis where there is Wimbledon, The French Open, The Australian Open, etc... each tournament happens on a different surface, has it's own traditions, etc... and different styles of tournaments appeal to different player's strengths. Anyway, no pressure - but it could be fun. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"}]}