{"url":"https://community.fantasyflightgames.com/topic/60180-attention-all-players-if-there-were-varying-levels-of-tournaments-regular-pro-extreme-would-you-play/","title":"****attention: all players:  if there were varying levels of tournaments, (regular, pro, extreme) would you play?****","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60180-attention-all-players-if-there-were-varying-levels-of-tournaments-regular-pro-extreme-would-you-play/?do=findComment&comment=591603","commentId":591603,"userName":"Zjb12","timestamp":1328692951,"content":" I ask this wondering if there might be some players interested in playing in a tournament but might have some concerns because they are new to the game or not as competitive as others.  In addition, there are others who want more of a challenge and think certain cards should be limited or restricted.  So, thoughts?\n\nRegular: in a tournament this would mean all Heros and all current cards are usable.\n\nPro: certain Heros and cards might be off limits, or restricted in some way.\n\nExtreme: limited hero pool and only 1 copy of each card in your deck.  (meaning a 50 card deck would have 50 different cards.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60180-attention-all-players-if-there-were-varying-levels-of-tournaments-regular-pro-extreme-would-you-play/?do=findComment&comment=591661","commentId":591661,"userName":"Budgernaut","timestamp":1328700607,"content":" I would only be interested in playing regular games. I don't want to pay for cards and then not be allowed to use them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60180-attention-all-players-if-there-were-varying-levels-of-tournaments-regular-pro-extreme-would-you-play/?do=findComment&comment=591741","commentId":591741,"userName":"richsabre","timestamp":1328712650,"content":"im not a tourn. player (dont worry im not here to troll lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]) but i wanted to post about in your other thread where *cant remember who now* said that not enough players compete to justify different levels of difficulty\n\ni think its worth pointing out that this will change if tournaments gets its own catagory- which hopefully should happen with our support- i reckon that even new players if they see a tournaments page will start to compete- so yeah, i reckon if large competative scene is what you want- that may start to happen after it gets its own place :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}