{"url":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/","title":"Zjb12 Weekend Tournament for February 10-12, 2012","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=591765","commentId":591765,"userName":"Zjb12","timestamp":1328717235,"content":"Hi!  Welcome to this weekend's Zjb12 Tournament.  This tournament begins at 12pm (CST/FFG time) Friday, February 10 and runs through 5pm, Sunday, February 12.  (Please do not include scores from times before or after that period.)\n\n \n\nSolo Player Quest: A Hunting We Will Go!!!  (This is an original idea sparked from Leptokurt’s thought on playing a game where we seek to have a high score.)\n\nEncounter Deck:  From Khazad-Dum, the Misty Mountain encounter set.  This is the one with the pic of the mountain on it and that is not used in any of the 3 scenarios within Khazad-Dum.  It has the Black Uruks in it.  Combine this with the Escape from Dol Guldur set, but remove from Escape from Dol Guldur the following cards: Shadow Key, Dungeon Torch, Gandalf’s Map and the 2 Tower Gate Locations.  Shuffle the Nazgul into the deck and use like any other enemy.  While the first forced effect will not apply for this game, the second one on the Nazgul of Dol Guldur still does.  Then, add in Conflict at the Carrock, shuffling in all 4 trolls and 2 copies of Sacked!  Do not use any quest cards from either Escape from Dol Guldur or Conflict at the Carrock.\n\n*******(There has been a change to the Set-up as of 10am FFG/CST Friday 2/10/12)**********      Set-up: Put the Carrock in as the active location.  Then reveal the top 1 card from the encounter deck.  (There will be no quest card on the table, unless you care to use the one that Memetix nicely created for us!!!)\n\nYour goal is to score the highest point total you can either before losing all three heroes or threating out at 60.  Points are scored by killing enemies and exploring locations. \n\nEnemy points are the combination of threat, attack, defense, hit points, and any victory points.  Example, Black Uruk: 2 threat, 3 attack, 3 defense, 2 hit points, 0 victory points = 10.\n\nLocation points are the combination of threat, progress tokens needed to explore it, and any victory points.  Example, The Carrock: 2 threat, 6 tokens needed, 0 victory points = 8.\n\nScoring will be your total from all enemies killed and locations explored.  Please keep track of rounds, however there will be no round points, damage points, or dead hero points calculated against your score.  Threat will also not count against you but must be tracked as normal for the game either ends when all three of your heroes die or your threat hits 60.\n\n*****Please don't forget!!!!  After you defeat an enemy or explore a location to set it aside just as you would in a normal game with an enemy or location that has victory points.  But only do this for defeated enemies and explored locations, not for shadow cards!!!!*******\n\nDeck Parameters: 1-3 Coresets + all Shadows of Mirkwood APs and the Khazad-Dum Expansion.  Deck Size: 50-60 cards.\n\nCards not allowed for this tournament: Beravor, Will of the West, Galadrim’s Greetings and Northern Tracker. \n\nFor this quest, you can attempt it as many times as you want during the weekend tournament time frame, but you may only hold 1 position overall in the final standings.\n\nPlease post your results to this forum topic.  When you post your scores please include: Heros; score based solely on the points earned through killing enemies and exploring locations; whether or not your threated out or all heroes died; how many rounds it took.  Highest score wins.  If possible, please also include the enemies killed and locations explored if possible. \n\nQuestions?  Please ask!\n \n\n1. Memetix, 318, Glorfindel, Denethor, Eleanor, Finishing Threat 46\n\n1. SiCK_Boy, 318, Bifur, Dain Ironfoot, Dwalin, Finishing Threat 38, 60 Rounds\n\n3. Muemakan, 290, Dain Ironfoot, Gloin, Bifur, Finishing Threat 54, 49 Rounds \n\n4. Leptokurt, 285, Dwalin, Dain Ironfoot, Bifur, Finishing Threat 60\n\n5. Zjb12,  112, Bifur, Thalin, Gimli, Finishing Threat 60"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592201","commentId":592201,"userName":"muemakan","timestamp":1328798862,"content":" Should we remove enemies and locations from the game once we finished them ( like cards with victory points ) or do we have to write down every card once its completed/ defeated???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592245","commentId":592245,"userName":"Zjb12","timestamp":1328802540,"content":" @muemakan---yes, I meant to put that, good catch.  Please REMOVE locations and enemies after you defeat/explore them.  This will mean the deck should gradually get smaller the longer your game is able to go on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592341","commentId":592341,"userName":"Memetix","timestamp":1328816094,"content":"Here's a quest card [http://www.blackmoor.org.uk/Death-or-Victory.jpg] for the tournament ....\n\nQuest [http://www.blackmoor.org.uk/Death-or-Victory.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592397","commentId":592397,"userName":"Zjb12","timestamp":1328823657,"content":" Cool Memetix!!!!   (they also need to remove the two tower gate locations.  I removed those because they have those weird Orc guards and I didn't want it being confusing.). I like the card, can that be printed out on card stock and will it be playing card size?  Thanks!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592458","commentId":592458,"userName":"Memetix","timestamp":1328839689,"content":"The quest card is now updated to include the rules for theTower Gate locations.\n\nIt is created using HilariousPete's LotR plugin for Strange Eons and yes, it will print at the correct size. I use 280mg photo paper."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592489","commentId":592489,"userName":"Memetix","timestamp":1328847862,"content":"I've just given this a go and I want to request a change before the competition starts. As it stands it is just too hard.\n\nWith Carrock as the active location and then revealing the top 2 cards during setup and then another encounter card after questing on the first turn, you have 4 (or more - many have surge) encounter cards in play on turn 1. I've just tried 6 times and resigned at the end of turn 2 on every game There is no way I could cope with either the number of locations or the deadliness of the enemies.\n\nI suspect this needs some more play testing before finalising the setup instructions.\n\nGiven that you cannot affect the Carrock with player cards you have to quest to get enough progress on it before you can travel to another location. These other locations build up far too quickly in the staging area and before you know it there is more threat there than you can ever quest past.\n\nPossible options are\n\n 1. Start with the Carrock - reveal 1 card (this may still be too hard)\n 2. Start with the Carrock - reveal no more cards\n 3. Don't start with the Carrock in play (or in the encounter deck) - reveal 2 cards at the start (still hard and luck dependant)\n 4. Don't start with the Carrock in play (or in the encounter deck) - reveal 1 card\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592588","commentId":592588,"userName":"Zjb12","timestamp":1328866393,"content":" @memetix:  okay, let's do just one card.  If you reprint your quest card, I will make an announcement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592590","commentId":592590,"userName":"Zjb12","timestamp":1328866474,"content":" Based on memetix's comments and my own play, please amend the set-up instructions to putting the Carrock in as the active location and then revealing just 1 card from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592605","commentId":592605,"userName":"Zjb12","timestamp":1328868026,"content":"Zjb12 said:\n\n Based on memetix's comments and my own play, please amend the set-up instructions to putting the Carrock in as the active location and then revealing just 1 card from the encounter deck.\n\n\n\nThis change has been made and noted above in the set-up instructions!  Happy Hunting---Look for a new card from Memetix about this change as well!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592721","commentId":592721,"userName":"Memetix","timestamp":1328879399,"content":"Zjb12 said:\n\nZjb12 said:\n\n \n\n Based on memetix's comments and my own play, please amend the set-up instructions to putting the Carrock in as the active location and then revealing just 1 card from the encounter deck.\n\n \n\n \n\nThis change has been made and noted above in the set-up instructions!  Happy Hunting---Look for a new card from Memetix about this change as well!!!\n\n\n\nQuest card updated - good luck everyone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592754","commentId":592754,"userName":"Zjb12","timestamp":1328881998,"content":"Memetix said:\n\nZjb12 said:\n\n \n\nZjb12 said:\n\n \n\n Based on memetix's comments and my own play, please amend the set-up instructions to putting the Carrock in as the active location and then revealing just 1 card from the encounter deck.\n\n \n\n \n\nThis change has been made and noted above in the set-up instructions!  Happy Hunting---Look for a new card from Memetix about this change as well!!!\n\n \n\n \n\nQuest card updated - good luck everyone.\n\n\n\nThanks!  Looks great!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592774","commentId":592774,"userName":"Zjb12","timestamp":1328885296,"content":" First score:  112.  Heros were bifur, Thalin, (who got sacked and roasted early on, so I had only two Heros for much of the game), Gimli.  18 rounds.  Points were from: Stuart & Morris, 18 each; black Uruk, 10; 2x mtn wargs @12 each; muck adder, 7; 2x cavern guardian @7 each; turbulent waters, 5; river langflood, 5; oak-wood groove, 3; the Carrock, 8."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592818","commentId":592818,"userName":"Zjb12","timestamp":1328892091,"content":"Card looks pretty good printed out Memetix, can't wait until I have card stock to make it official!!!  Thanks again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592826","commentId":592826,"userName":"Memetix","timestamp":1328893788,"content":"I played 2 tough games, getting low scores (zero points and 18 points), then I got a good one.\n\nWhat a mammoth game, 2 and a half hours, 51 turns with Gandalf showing up 7 times (2 sneak attacks and 3 Born Aloft plus 2 normal castings) and an Elfhelm to keep the treat under control (max was 48, finished on 46).\n\nI ran through the encounter deck 3 times, on the last pass there were just 2 locations left and LOTS of treachery cards. Denethor had unexpected courage and with Eleanor's help I was able to avoid the nastier ones.\n\nI got all 318 points using Glorfindel, Denethor and Eleanor (1xCore + APs)\n\nP.S. If you find a good source of card stock, let me know. I use double sided matt photo paper but its not quite right. I need a good satin finish and slightly thicker paper."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592833","commentId":592833,"userName":"Zjb12","timestamp":1328894658,"content":" @Memetix---wow!  Incredible!  I will have to ban gandalf and elf helm next time!!!  aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592840","commentId":592840,"userName":"Zjb12","timestamp":1328896143,"content":"Scores at the top now, finally figured out this editing thing---gotta do it from the PC not the iPad!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592902","commentId":592902,"userName":"SiCK_Boy","timestamp":1328906246,"content":"I thought this would be an interesting challenge, giving us the chance to try out the new encounter set from KD.\n\nHowever, it quickly became boring. Once your army is out, there isn't much the encounter deck can do. I think it would have been better to either increase the number of encounter cards revealed after a certain number of turn (for example, reveal 2 cards per turn after 10 turns, 3 cards after 20 turns, etc.) or find some other mechanic to make this feel more like an impending doom clock-style thing. Another option could have been to include even more encounter sets (such as the Wilderlands or the basic Orcs ones). The current set of encounter was lacking on treachery dealing direct damage. The only thing that could kill characters once you had your defense set up with healing was a lucky Muck Adder or Roasted Slowly.\n\nI went through the whole deck, so I guess I scored the maximum number of points (didn't count, but there are only treachery left in the encounter deck). However, it took me longer than Memetix. I did it in 60 turns. I paid for not having Denethor since I had to cycle twice to get the last 4 or 5 enemies / locations.\n\nI even realized afterward I had left 3 Sacked! in the deck instead of 2, but I still managed to dodge the Roasted Slowly with A Test of Will (kept it just for the occasion) and killing a Troll here and there.\n\nResults:\n\n318 points in 60 rounds with final threat of 38, no dead hero and no wound on any hero\n\nDecklist:\n\nHero (3)\nBifur (KD) x1\nDain Ironfoot (RtM) x1\nDwalin (KD) x1\n\nAlly (21)\nBrok Ironfist (Core) x1\nDaughter of the Nimrodel (Core) x1\nElfhelm (TDM) x1\nErebor Hammersmith (Core) x2\nErebor Record Keeper (KD) x2\nFaramir (Core) x2\nGandalf (Core) x3\nGildor Inglorion (THoEM) x1\nGleowine (Core) x1\nHenamarth Riversong (Core) x2\nLongbeard Orc Slayer (Core) x1\nMiner of the Iron Hills (Core) x2\nZigil Miner (KD) x2\n\nAttachment (19)\nBorn Aloft (CatC) x3\nDunedain Mark (THfG) x2\nDunedain Warning (CatC) x2\nForest Snare (Core) x2\nNarvi's Belt (KD) x2\nSelf Preservation (Core) x2\nSteward of Gondor (Core) x3\nUnexpected Courage (Core) x3\n\nEvent (10)\nA Test of Will (Core) x3\nGrim Resolve (Core) x2\nHasty Stroke (Core) x2\nSneak Attack (Core) x3\n\nThe real challenge is really in clearing the Carrock and surviving the first couple of turns. Once your engine is started, nothing will stop you. And you don't really have to worry about using card draw since you'll have time to go through your deck. I would strongly recommend using Denethor (with 3 Unexpected Courage if possible); I don't think Eleanor is needed absolutely since most treacheries aren't that harmfull. As for the rest, it's all about getting your ally army out. The Nazgul can be dangerous as he can kill characters directly and letting enemies accumulate could lead to trouble (I guess hitting 2 trolls in the first 2 turns would be a problem), but once you're able to deal with a card each turn, you're safe. Once also need to watch for these Black Uruks. But after a while, I simply stopped questing with heroes anyway.\n\nI'd remove the 2 Grim Resolve for 2 Dwarven Tomb. A 3rd Erebor Hammersmith would be welcome (instead of a Record Keeper, maybe) as they allow you to bring back Born Aloft and play more Gandalf.\n\nAnyway, thanks for idea Zjb! It was nice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592946","commentId":592946,"userName":"Zjb12","timestamp":1328913316,"content":"  @sick_boy: hey!  Wow!  You guys are good.  Maybe we should have left the original set-up at pulling two encounter cards to make it start out harder.  Boy, it seems like I make them either too hard or too easy!  I'll get it right one of these days!  I enjoyed using more tactics cards then I have in quite a while with my dwarf Heros.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592964","commentId":592964,"userName":"radiskull","timestamp":1328917428,"content":" Easy with the banhammer please, that's all I ask. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  If you don't want a threat reduction deck, then just say that you cannot lower your threat through card effects.\n\nI know it's exaggerating, but I half-expect to see a tournament where the parameters are \"you must use this deck.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=592998","commentId":592998,"userName":"Zjb12","timestamp":1328959517,"content":"radiskull said:\n\n Easy with the banhammer please, that's all I ask. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  If you don't want a threat reduction deck, then just say that you cannot lower your threat through card effects.\n\nI know it's exaggerating, but I half-expect to see a tournament where the parameters are \"you must use this deck.\"\n\n\n\nI know!  I know!  :>)  It's just trying to find that balance between wanting new players to feel they can compete without others of us just romping through the deck.  I really thought this would be harder for some then it was, but wow!  Two people have already cleared the deck!  I like running these tournaments and can come up with all kinds of ideas, but time is precious with a full-time job and 5 kids, plus in the spring we put on a huge charity event with another couple.  So, I am trying my best!  Have to cook up a good idea for next weekend, maybe something with Khazad-Dum.  Give me some thoughts Radiskull!  You know this game a lot better than I do!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593006","commentId":593006,"userName":"leptokurt","timestamp":1328961420,"content":"Just finished Juicy's tournament and will try this one this evening or tomorrow. Perhaps I'm going to include the Sick's suggestions to pimp the dissiculty level."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593034","commentId":593034,"userName":"Chac2","timestamp":1328969548,"content":"Hi,\n\n\nThe idea was to build a dwarf themed deck with 3 Unexpected Courage, so Dwalin, boosted by Dain’s special ability, can quest and attack.\n\nDwalin’s capacity to reduce threat when he destroy an orc was very helpful during the game, so was Gandalf of course. Remember to « cover » your « Unexpected Courage » with a « Dunedain Mark » so if you reveal a « Black Uruks » you can discard the « Dunedain Mark » and save your « Unexpected Courage ». When you have enough allies on the table, you can use « Brok Ironfist », Some « Dunedain Watcher » and some « Guard of the Citadel » (or other allies of your choice) for questing instead of Dwalin, leaving Dwalin up for the fight if he lost his \"Unexpected Courage\".\n\n\nEarly in the game, the deck is very dependant of the draw of the encounter deck, but when you have scored « The Carrock » and when you have clean the staging area, the rest of the game is easy. Just play your allies and kill/explore anything, use « A Test of Will » to counter « Roasted Slowly » until you can kill a troll to discard « Sacked » and have a « Hasty Stroke » ready if the « Nazgul of Dol Guldur » got à shadow card.\n\n\nThanks to Grimbeorn the Old that helped me so muck to fight the trolls !\n\n\nThe final score depend exclusively of « how many orcs have been killed by Dwalin » during the game to reduce your threat.\n\n\nI have scored a 333 in 48 rounds and a 414 in 61 rounds !\n\n\nHere is the detail of my best score :\n\n\nHeroes\n\nDain Ironfoot\nGloin\nDwalin\n\nLeadership (35)\n\n3 Snowbourn Scout\n3 Guard of the Citadel\n3 Son of Arnor\n3 Silverlode Archer\n3 Longbeard Orc Slayer\n2 Brok Ironfist\n3 Dunedain Watcher\n3 Dunedain Mark\n3 Steward of Gondor\n3 Sneak Attack\n3 Valiant Sacrifice\n3 Durin’s Song\n\nNeutral (3)\n\n3 Gandalf\n\nSpirit (12)\n\n3 Unexpected Courage\n3 Ancient Mathom\n3 A Test of Will\n3 Hasty Stroke\n\n\nNumber of rounds : 61\nFinal threat : 60\nDead heroes : none\nVictory points\n\n\nBee Pasture (3 pts) x 6 = 18\nBlack Uruks (10 pts) x 7 = 70\nCavern Guardian (7 pts) x 2 = 14\nDungeon Jailor (16 pts) x 2 = 32\nEndless Caverns (4 pts) x 2 = 8\nKnees of the Mountain (5 pts) x 1 = 5\nLouis (18 pts) x 1 = 18\nMorris (18 pts) x 1 = 18\nMountain Warg (12 pts) x 4 = 48\nMuck Adder (7 pts) x 4 = 28\nNazgul of Dol Guldur (21 pts) x 2 = 42\nOak-Wood Grove (3 pts) x 4 = 12\nRiver langflood (5 pts) x 4 = 20\nRupert (18 pts) x 1 = 18\nStuart (18 pts) x 2 = 36\nThe Carrock (8 pts) x 1 = 8\nTurbulent waters (5 pts) x 3 = 15\nWarg Lair (4 pts) x 1 = 4\n\n\nTotal = 414\n\n\nI agree with SICK_Boy on the fact that, when your army of allies is installed on the table, the game become boring !\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593058","commentId":593058,"userName":"muemakan","timestamp":1328973917,"content":" Hm interesting, I get 320 points as the maximum score......."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593072","commentId":593072,"userName":"muemakan","timestamp":1328977896,"content":" Points 290\n\nAs I didn´t play with spirit I had no chance of canceling Roasted Slowly and it was the last card in the encounter deck. What a pity, I had only 2 enemies left in the encounter discard pile which had only 10 cards in it. And I had still 6 more rounds to go.\n\n \n\nThreat: 54, Rounds: 49, scored everything except a Troll and one of these wargs.\n\nUsed my dwarf deck for it. Dain, Gloin and Bifur.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593075","commentId":593075,"userName":"Chac2","timestamp":1328978027,"content":"Hum,\n\nI just realized this :\n\n*****Please don't forget!!!! After you defeat an enemy or explore a location to set it aside just as you would in a normal game with an enemy or location that has victory points. But only do this for defeated enemies and explored locations, not for shadow cards!!!!*******\n\nI have just discarded ennemies and locations and reshuffle the deck till i hit 60 threat or all my heroes were dead.... so don't count my score for the tournament.\n\n \n\nI'm so sorry"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593281","commentId":593281,"userName":"leptokurt","timestamp":1329024697,"content":"If 320 is the max score I got 285 points. Heroes were Dwalin, Dáin and Bifur. I had to finish because I hit the 60 point threat limit.\n\n \n\nSetup card was the Warg Lair which already cost me some threat in the beginning and Dáin almost got killed (took me four rounds to kill that beast). These monsters promise to be a lot of fun in future games. Certainly a card that might smash a spirit centered deck and which makes the tactics sphere more valuable. Like!\n\n \n\nDespite having an unlucky card draw (first Gandalf in round 15, Grimbeorn out after defateating three of the trolls) I finally managed to get the encounter deck under control. Like others said, from that point on it was a walk in the park, and onlythe Sacked! cards threatened my company. Thanks to muemakan's hint about the Roasted! problem I always kept one enemy engaged so that I could get rid of those treacheries as shadow cards.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593302","commentId":593302,"userName":"Zjb12","timestamp":1329031780,"content":"Hey!  Sorry for my absence, I will try to get scores updated this afternoon.  Our internet was out a good chunk of yesterday afternoon and evening.  Max Points as I can tell are 318 as Memetix and SiCK_Boy both achieved. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593304","commentId":593304,"userName":"Zjb12","timestamp":1329032396,"content":"Scores updated.  Lots of Dwarf heros!\n\nSo, if I could compose an encounter deck/quest that made it a little harder as it went on, would you like playing this type of idea again?  What was good, what was bad?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593327","commentId":593327,"userName":"muemakan","timestamp":1329036801,"content":" I counted twice and get 320. Where could I added those 2 points....\n\nDid make an exel sheet to count it.\n\n\n\n  cost quantity     Misty Mountains       warg 12 3   36 waters 5 2   10 knees 5 1   5 lair 4 2   8 uruk 10 4   40         0 Dol Guldur       0 jailor 16 2   32 undead 7 2   14 location 4 2   8 nazgul 21 1   21         0 Carrock       0 Carrock 8 1   8 langflood 5 4   20 beepatures 3 3   9 oakwood 3 3   9 trolls 18 4   72 adder 7 4   28                           Total: 320\n\nIt was an interesting experience. It got boring after the first few rounds when you sat up your army. And it took quite some time. So playing more then one or two games is quite time consuming.\n\nMaybe give us more time to play such long ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593350","commentId":593350,"userName":"leptokurt","timestamp":1329043812,"content":"Zjb12 said:\n\n \n\nScores updated.  Lots of Dwarf heros!\n\nSo, if I could compose an encounter deck/quest that made it a little harder as it went on, would you like playing this type of idea again?  What was good, what was bad?\n\n \n\n \n\n \n\n \n\n \n\nInteresting. I'll give it another try, but will tweak the rules slightly:\n\n \n\n\"Everytime when there is no location or enemy in the staging area, a treachery cards gets the 'surge' trait.\"\n\n\"Grimbeorn is on a holiday, so he won't be part of the encounter deck.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593360","commentId":593360,"userName":"radiskull","timestamp":1329046683,"content":"Zjb12 said:\n\nradiskull said:\n\n \n\n Easy with the banhammer please, that's all I ask. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  If you don't want a threat reduction deck, then just say that you cannot lower your threat through card effects.\n\nI know it's exaggerating, but I half-expect to see a tournament where the parameters are \"you must use this deck.\"\n\n \n\n \n\nI know!  I know!  :>)  It's just trying to find that balance between wanting new players to feel they can compete without others of us just romping through the deck.  I really thought this would be harder for some then it was, but wow!  Two people have already cleared the deck!  I like running these tournaments and can come up with all kinds of ideas, but time is precious with a full-time job and 5 kids, plus in the spring we put on a huge charity event with another couple.  So, I am trying my best!  Have to cook up a good idea for next weekend, maybe something with Khazad-Dum.  Give me some thoughts Radiskull!  You know this game a lot better than I do!\n\n\n\nI sadly don't have enough experience with KD to offer any good suggestions there, but if you're worried about \"game-breaking\" combos, I think the best response to that is a restricted list (NOT a ban list).  The way FFG does it is of the cards on the restricted list, you may choose one to use in your decks.  You may use the maximum legal number of copies of that card, but you can't use any other restricted cards.  Just off the top of my head, I'd say that list looks like: {Beravor, Will of the West, The Galadhrim's Greeting, Protector of Lorien.}  You want to draw your whole deck with Beravor?  Fine, but no massive threat reduction or discard recursion.  You want the threat reduction of the Galadhrim's Greeting?  That's fine, but you'll have to Dwarven Tomb them if you want to play more than 3.\n\nSomething along those lines seems reasonable to me.  I'm just very reluctant to give in to the groupthink that \"oh hey, this card is good, let's make sure no one can use it ever.\"\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593431","commentId":593431,"userName":"leptokurt","timestamp":1329057695,"content":"If you want some ideas, Zjb, I've got one (but it's not about KD):\n\n \n\nScenario: Return to Mirkwood\n\n- rounds (and possibly threat or damage) aren't counted for your score\n\n- the scoring system is like in this game, but the game is played as usual (the encounter cards go back into the encounter discard pile)\n\n- the players can use the second threat marker to count their scored points\n\n- for every scored card (enemy or location) a player may reduce his threat by one point or alternatively\n\n- the max threat limit is 60 instead of 50\n\n \n\nThe threat reducement would help to make this scenario less frustrating and more enjoyable not only for beginners, because usually  just when things get interesting and the **** hits the fan you're running out of threat and the game is over. The scoring system rewards you for slaying enemies like Attercop, Attercop.\n\n \n\nAnother idea which could be combined with this is that after every try in a series of 3 the player has to change one of his heroes, so that in game 3 only one of his initial heroes remains. Without being allowed to change his deck, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593479","commentId":593479,"userName":"Zjb12","timestamp":1329066304,"content":"leptokurt said:\n\nZjb12 said:\n\n \n\nScores updated.  Lots of Dwarf heros!\n\nSo, if I could compose an encounter deck/quest that made it a little harder as it went on, would you like playing this type of idea again?  What was good, what was bad?\n\n \n\n \n\n \n\n \n\n \n\nInteresting. I'll give it another try, but will tweak the rules slightly:\n\n \n\n\"Everytime when there is no location or enemy in the staging area, a treachery cards gets the 'surge' trait.\"\n\n\"Grimbeorn is on a holiday, so he won't be part of the encounter deck.\"\n\n\n\nI never even used grimbeorn and I barely drew a gandalf, but then I had low score too!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60191-zjb12-weekend-tournament-for-february-10-12-2012/?do=findComment&comment=593481","commentId":593481,"userName":"Zjb12","timestamp":1329066504,"content":" And time!  Thanks everyone for playing and for your ideas about next week, ban/unrestricted lists, etc.  I will another thread out there too for more ideas.  I think this was a fun one, but maybe needs a little tweaking.  IT was neat to get a taste of what might be coming with the uruks and mtn wargs---(whom I detest as much as \"regular\" wargs.). Congrats to Memetix and SiCK_Boy for a first place tie by points!  Thanks to Memetix for creating a quest card for us!"}]}