{"url":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/","title":"Trouble at Dol Guldur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592006","commentId":592006,"userName":"Ted Sandyman","timestamp":1328774163,"content":"Hello there, i am a newbie to the Lord of the Rings LCG and would be grateful for any advice. I have been playing solo with the core set now for 6 weeks and totally love the game. I have managed to complete the Passage Through Mirkwood and Journeyed Down the Anduin (having been defeated so many times ive lost count, but enjoyed every minute of the challenge). But for the last fortnight i cannot get a foothold in the Escape from Dol Guldur. Should i get some expansion packs to widen my choice of ally, attachment, events etc or is it possible to defeat this quest with just the core pack? I always take Eowyn, Aragorn and Denethor, turn over Denethor as my prisoner but i cant seem to generate enough resources as im always blocking early on with a cheap ally.  Any advice would be appreciated and please excuse my naiavity. Thanks Ted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592021","commentId":592021,"userName":"scottindeed","timestamp":1328776948,"content":"Hi there and welcome.\n\nEscape from Dol Goldur is unfortunately next to impossible with a solo deck.  The game seems a lot more balanced for two players.  Personally when I play solo, it is always with two decks running at the same time.  Even then Dol Goldur is still very hard!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592028","commentId":592028,"userName":"Ted Sandyman","timestamp":1328778146,"content":"Thanks for the welcome and the advice. I had an idea it may be difficult to complete but thought there may be someway through it. I will definately give it a go now in two player mode. Would you suggest single sphere heros with each player or really take some time working out two mixed sphere decks?  By the way, would it be looked at as unfair if i did buy some expansion packs and use those cards with this Dol Guldur quest ? Thanks again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592031","commentId":592031,"userName":"hendersondayton","timestamp":1328778456,"content":"Ted Sandyman said:\n\n By the way, would it be looked at as unfair if i did buy some expansion packs and use those cards with this Dol Guldur quest ? Thanks again.\n\n\n\nby no means would this EVER be considered unfair. This is what everyone does! buy away my friend!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592053","commentId":592053,"userName":"Ted Sandyman","timestamp":1328780994,"content":"Oh ok, thats good to know. Im afraid im one of these blokes who cant cheat in the slightest or \"innocently\" ignore a card effect ! Ive read a few quotes in this forum on the Dol Guldor quest so im learning all the time. I will give it a dozen more goes solo just to satisfy myself that its too tough before i go 2 player. It took me 25 attempts Journeying down the Anduin before i got there! Thanks for the tip."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592080","commentId":592080,"userName":"richsabre","timestamp":1328785355,"content":"Ted Sandyman said:\n\nOh ok, thats good to know. Im afraid im one of these blokes who cant cheat in the slightest or \"innocently\" ignore a card effect ! Ive read a few quotes in this forum on the Dol Guldor quest so im learning all the time. I will give it a dozen more goes solo just to satisfy myself that its too tough before i go 2 player. It took me 25 attempts Journeying down the Anduin before i got there! Thanks for the tip.\n\n\n\ni would say your in the majority with the first point, most people wont cheat or change the game rules\n\nalso stick with solo play till you get some more packs- the difficulty scaling sorts itself out by hunt for gollum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592101","commentId":592101,"userName":"Budgernaut","timestamp":1328787523,"content":"Ted Sandyman said:\n\n I always take Eowyn, Aragorn and Denethor, turn over Denethor as my prisoner but i cant seem to generate enough resources as im always blocking early on with a cheap ally.\n\n\n\nI'm in the same boat you are. I tried playing with all four decks last night and had a blast until I realized that the restriction of one ally per round exists in the first stage as well. I thought it was only in the second stage. I had 9 allies out on turn 4 so I decided to just scrap the whole game.\n\nBut on a related note about rules, what do you mean by always turning over Denethor? The rules say that you must randomly select a hero, so I was wondering if you just randomly pick and concede if it's not Denethor, or is that a rule you may be missing? Just wanted to point that out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592132","commentId":592132,"userName":"muemakan","timestamp":1328790987,"content":"Nice Avatar !!\n\nDol Guldur can be a pain in the ass."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=592608","commentId":592608,"userName":"Ted Sandyman","timestamp":1328868240,"content":"Yeh thanks budgernaut, seems to be an oversight on my part. Dont know why i didnt pick up on the \"randomly select a hero\" bit. I think my excitement at completing the Journey Down the Anduin got in the way of reading the Dol Guldur quest properly. Thanks for the advice richsabre, i will get some more packs and keep giving Dol Guldur a go in solo. Its just the resource excelleration i need to work on in the early rounds, well, thats my novices plan anyway! Cheers again guys for the advice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593026","commentId":593026,"userName":"divinityofnumber","timestamp":1328967786,"content":" Dol Guldur is next to impossible solo with a 30 card core set deck. \n\nI have tried so many times I cannot even count. I still keep trying. But, for me it has always been a crushing defeat. \n\nIf you use two decks, try Tactics and Spirit, they make a great combo against it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593060","commentId":593060,"userName":"Ted Sandyman","timestamp":1328974854,"content":"Yeh i will keep trying too but its just the hero imprisonment, isnt it, that makes it so hard to gain any kind of hold on this quest. Thanks for the advice on the Tactic/Spirit approach. I enjoy the challenge anyway as its a tough game but you kind of know you could defeat it if the cards come out ok. Thats what gives me the buzz about this game, 20 losses followed by a victory! cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593164","commentId":593164,"userName":"tripecac","timestamp":1328993110,"content":"I just tried it solo with a single Tactics/Spirit deck and got defeated on the second turn.\n\nWhat seems hard is that you start with 2 heroes, but with 3 cards in the staging area.  For me, 1 was a  treachery (caught in a web) and the other 2 were enemies.  Since I only had 2 heroes, I didn't bother to quest, but instead defended with both, hoping to survive long enough to get some allies out.  Unfortunately, the next encounter card was another enemy.\n\nHow are you supposed to get anywhere solo if you start against 2 enemies?  Do you just keep mulliganning until you end with with 3 non-applicable treacheries or low-threat locations?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593229","commentId":593229,"userName":"Dam the Man","timestamp":1329012830,"content":"tripecac said:\n\nHow are you supposed to get anywhere solo if you start against 2 enemies?\n\nGets even better if you start with 2x King Spider or 1x KS and draw that other one. Now both your remaining heroes are exhausted to boot and unless you got your hand on some low cost allies, could be facing two undefended attacks right away. Triple Treachery start apart from Caught in a Web is pretty much ideal here (3x Necromancer's Reach anyone?)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593264","commentId":593264,"userName":"Ted Sandyman","timestamp":1329020029,"content":"Yeh i managed to last a few turns last night. I flopped out a Gondorian Spearman to block and cause a damage but without many resources you cant play many cards in your hand. I ended up getting slaughtered but i still say there will be the odd time that the encounter deck falls ok, allowing us to build up a bit of resource to whack the decisive cards into play. I will keep trying and let anyone know if i get anywhere!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593362","commentId":593362,"userName":"divinityofnumber","timestamp":1329046992,"content":" Spirit and Tactics (two player) works well, hoping that certain heroes do not get taken prisoner, of course. \n\nThis is why the Spirit/Tactics combination has worked so well for me:\n\n \n\n1) Legolas and Gimli can do some serious damage.\n\n2) Eowyn quests excellently, and if you get one or two Northern Trackers in play, locations start disappearing very quickly. \n\n3) Stand and Fight can bring back Gandalf a few times, which helps immensely. \n\n4) Unexpected Courage on Gimli is awesome; he can block and also attack. Get the Plate on him also and he is kicking some serious ass here. \n\n5) Spirit helps keep the threat down as well, which leads to more flexibility; it is nice to take on enemies at your own pace, rather than having them all descending on you due to your high threat level. \n\n \n\nObviously sometimes you will just get bad draws, or one of the essential heroes will be taken prisoner, and you will get crushed. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593378","commentId":593378,"userName":"Ted Sandyman","timestamp":1329048444,"content":"Thats great advice, thanks very much. I have noted the tips so will be giving it a go in 2 player mode this evening. It would be interesting to know though if anyone has defeated Dol Guldor in one player mode and how they achieved it. When i get the expansion decks through ive ordered i may stand a better chance but at the moment im just playing with the core deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593380","commentId":593380,"userName":"muemakan","timestamp":1329048777,"content":"divinityofnumber said:\n\n Spirit and Tactics (two player) works well, hoping that certain heroes do not get taken prisoner, of course. \n\nThis is why the Spirit/Tactics combination has worked so well for me:\n\n \n\n1) Legolas and Gimli can do some serious damage.\n\n2) Eowyn quests excellently, and if you get one or two Northern Trackers in play, locations start disappearing very quickly. \n\n3) Stand and Fight can bring back Gandalf a few times, which helps immensely. \n\n4) Unexpected Courage on Gimli is awesome; he can block and also attack. Get the Plate on him also and he is kicking some serious ass here. \n\n5) Spirit helps keep the threat down as well, which leads to more flexibility; it is nice to take on enemies at your own pace, rather than having them all descending on you due to your high threat level. \n\n \n\nObviously sometimes you will just get bad draws, or one of the essential heroes will be taken prisoner, and you will get crushed. \n\n\n\nEverything but Stand and Fight is right. No Gandalf with it. Sorry"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593480","commentId":593480,"userName":"Trantor3","timestamp":1329066500,"content":"I once defeated it with an insane amount of luck playing solo. I used one Core Set and cards from the first three adventure packs (Hunt for Gollum, Conflict at the Carrock and Journey to Rhosgobel). Heroes were Eowyn, Frodo and Imrahil. Frodo was the one that was caught (more or less a prerequisite), and I managed to put Steward of Gondor on Eowyn on turn 2.\nCards like Westfold Horse-Breaker, The Riddermark's Finest (if you also use Hills of Emyn Muil) and Escort from Edoras can be used to use Imrahil for more than one thing during a turn.\nStill, you need an amazing amount of luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593708","commentId":593708,"userName":"divinityofnumber","timestamp":1329121384,"content":"Why no Stand and FIght with Gandalf? As long as there is not another Gandalf in play already, can we not bring him back with Stand and Fight?\n\nstand-and-fight.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/khazad-dum/stand-and-fight.png]gandalf.jpg?w=500 [http://littlemetaldog.files.wordpress.com/2011/04/gandalf.jpg?w=500]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593712","commentId":593712,"userName":"scottindeed","timestamp":1329122308,"content":"I think Gandalf with Stand and Fight is in the FAQ.  Gandalf does not belong to ANY sphere and so cannot be used with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=593715","commentId":593715,"userName":"divinityofnumber","timestamp":1329122957,"content":" Right you are. It says in the FAQ/Errata that Stand and Fight cannot be used with Neutral cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=594806","commentId":594806,"userName":"tripecac","timestamp":1329340992,"content":"I just managed to beat Dol Guldur, on my 3rd attempt.\n\nThe first attempt was a solo deck.  Not even close.\n\nThe second was 2 decks, and I got pretty close, but didn't understand when to bring the Nazgul out, so kinda messed up the end.\n\nThe third time went smoothly.  I got lots of allies out, one with lots of healing and one with lots of ranged.  Denethor and Berevor took hits, Daughter of Nimrodel healed them, Legolas and the ranged allies attacked from other deck.\n\nIf a Northern Rangers knocks out a Mountains of Mirkwood while it's still in the staging area, the Mountains are considered \"explored\", and therefore their effect triggers (pick a card from the top 5)?\n\nAlso, I read that attachments can be played on other players' characters.  Can healers (like Daughter of the Nimrodel) heal characters belonging to other players?  In general, can actions affect other players' allies just as easily as your own?  Ditto for the shadow cards attached to enemies engaged with the other players..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=594844","commentId":594844,"userName":"Angus Lee","timestamp":1329352558,"content":"tripecac said:\n\nI just managed to beat Dol Guldur, on my 3rd attempt.\n\n\n\nCongratulations!\n\n tripecac said:\n\nThe first attempt was a solo deck.  Not even close.\n\nThe second was 2 decks, and I got pretty close, but didn't understand when to bring the Nazgul out, so kinda messed up the end.\n\nThe third time went smoothly.  I got lots of allies out, one with lots of healing and one with lots of ranged.  Denethor and Berevor took hits, Daughter of Nimrodel healed them, Legolas and the ranged allies attacked from other deck.\n\n\n\nHope you have observed the quest special rule about playing one ally per turn.\n\n \n\ntripecac said:\n\nIf a Northern Rangers knocks out a Mountains of Mirkwood while it's still in the staging area, the Mountains are considered \"explored\", and therefore their effect triggers (pick a card from the top 5)?\n\n\n\nYes\n\n \n\ntripecac said:\n\nAlso, I read that attachments can be played on other players' characters.  Can healers (like Daughter of the Nimrodel) heal characters belonging to other players?  In general, can actions affect other players' allies just as easily as your own?  Ditto for the shadow cards attached to enemies engaged with the other players...\n\n\n\nYes, in general, actions can affect other players' allies. Shadow effects usually would specify target (e.g. first player, or player with highest threat, etc.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60219-trouble-at-dol-guldur/?do=findComment&comment=595090","commentId":595090,"userName":"tripecac","timestamp":1329401606,"content":">> Hope you have observed the quest special rule about playing one ally per turn.\n\nYes, each turn I played only one ally total (despite 2 decks).\n\n \n\nAs for the shadow cards, I was wondering if we can cancel shadow cards played on enemies engaged with other players."}]}