{"url":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/","title":"3-4 players and what to buy exactly","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593181","commentId":593181,"userName":"ajzero3","timestamp":1328998236,"content":"I want to play 3-4 players so I buy 2 core sets. Got that.\n\nIf I start adding adventure packs do I need to buy 2 of the same adventure packs to go along with my 2 core sets to play 3-4 players? or can I use 1 adventure pack to play with 2 core sets in order to play 3-4 players? I hope that makes sense.\n\nAlso, with the Khazad-dûm Expansion, do I need to buy 2 of these expansions to go along with my 2 core sets to play 3-4 players or can I just use 1 expansion?\n\n\nThanks\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593324","commentId":593324,"userName":"Rapier1","timestamp":1329036625,"content":" You don't need two core sets to play with 3-4 people.\n\nThe advantage of buying more than one copy of any of the sets is that you'll get more than 3 of each card - that means that more than one deck can have access to the new cards.\n\nAs usual more sets lets you have more cards and more options.\n\n \n\nIn terms of playing vs the game (the monster cards/quest cards) you never need more than one set of those so you don't need extra core sets or extra expansion sets,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593367","commentId":593367,"userName":"gatharion","timestamp":1329047590,"content":" I play three and four person games just fine with a single core set and one of each adventure pack.\n\nAlready having two core sets, you're ahead of the game and should have plenty of deck building options if you only get one of each expansion pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593417","commentId":593417,"userName":"Morbid666","timestamp":1329056156,"content":"2 core sets is fine. Only need 1 each of the Adventure packs and only 1 Khazad-Dum expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593475","commentId":593475,"userName":"ajzero3","timestamp":1329065766,"content":" Thanks for all of the help.  I just came to the conclusion to buy them all!  Love this game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593477","commentId":593477,"userName":"Trantor3","timestamp":1329065947,"content":"If you haven't bought anything already, stick to one Core Set for the start and see if you like the game. It's perfectly playable for 3 or 4 players. Adding a second or even a third Core Set will allow you to do more deckbuilding (or ANY deckbuilding really).\nOne of each of the expansions (adventure packs or Khazad Dum) is enough as you get 3 copies of each player card in them. It may still be useful to buy a second one, as you then can distribute 6 copies of a player card among several decks (you may not use more than 3 copies in a single deck). But it's certainly not necessary."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593543","commentId":593543,"userName":"Budgernaut","timestamp":1329081129,"content":" It depends on the personalities of your play group. I usually play solo, so one core set is fine, but the few times I played with four players, I really wished I had a second core set for the threat tracker. Sure, you can keep track of threat on paper, but I think the threat trackers are pretty nifty and would definitely buy a 2nd core set if I played with 3 or 4 players consistently, especially since you can get the core set for $25 or so online."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593592","commentId":593592,"userName":"booored","timestamp":1329099701,"content":"get 2 copies of core + mirkwood cycle at a minimum... personally I think you need 3 copies and Khaz and the mirkwood cycle pack srt (sop everything to date) do not listen to this people trying to say you only need 1 copies of core. they are full of ****.. . sure you CAN use 1 copy of core.. but hey you could also use a 486 computer instead of a modern system. .the point is that while it is possible to play with 1 copies of core your deck building options will be so limited that you will be missing out on most of the game, as in deck building. Your friends will not be able to field decks of strength and with out the mirkwood packs you will not have key sphere cards like the egals cards in return, the spirit questing cards, the songs and other stuff needed for fun strong decks. You HAVE to get Khaz to play the coming cycle, but Mirkwood and the copies of core will give you a LOT of entertainment.. so I would start there. Once you play for a bit, if you feel like more options and more fun, get the 3rd copy of core.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593774","commentId":593774,"userName":"Budgernaut","timestamp":1329137027,"content":"booored said:\n\nget 2 copies of core + mirkwood cycle at a minimum... personally I think you need 3 copies and Khaz and the mirkwood cycle pack srt (sop everything to date) do not listen to this people trying to say you only need 1 copies of core. they are full of ****.. . sure you CAN use 1 copy of core.. but hey you could also use a 486 computer instead of a modern system. .the point is that while it is possible to play with 1 copies of core your deck building options will be so limited that you will be missing out on most of the game, as in deck building. Your friends will not be able to field decks of strength and with out the mirkwood packs you will not have key sphere cards like the egals cards in return, the spirit questing cards, the songs and other stuff needed for fun strong decks. You HAVE to get Khaz to play the coming cycle, but Mirkwood and the copies of core will give you a LOT of entertainment.. so I would start there. Once you play for a bit, if you feel like more options and more fun, get the 3rd copy of core.\n \n\n\n\nI found playing with 4 players and a single core set was still extremely exciting and entertaining. Many players feel so overwhelmed by the game that it takes them some time before they even feel comfortable with deck-building. If someone is planning on purchasing all the Adventure Packs anyway, I think that eliminates the necessity of a second core set for the purpose of deck-building. But I do advocate a second core set. It will open a lot of possibilities for your group. With 4 players, even the encounter cards don't have to be wasted, you could try competing with two teams of two at the same time with the second set of encounter cards, for instance. I do think Booored is right that 2 core sets is advantageous and I would wait on Khazad-dum until you've got your fill of Shadows of Mirkwood, but I strongly disagree with his assertment that people who say that one core set is all you need are full of ****."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60356-3-4-players-and-what-to-buy-exactly/?do=findComment&comment=593873","commentId":593873,"userName":"501stBattalion","timestamp":1329149938,"content":"I think one core set should be enough for a standard game.  But its nice to have options with 2 core sets."}]}