{"url":"https://community.fantasyflightgames.com/topic/60384-ideas-for-next-weekends-zjb12-tournament-and-more-discussion-on-creating-a-restricted-list-vs-banning-cards/","title":"Ideas for next weekends Zjb12 Tournament and more discussion on creating a restricted list vs banning cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60384-ideas-for-next-weekends-zjb12-tournament-and-more-discussion-on-creating-a-restricted-list-vs-banning-cards/?do=findComment&comment=593483","commentId":593483,"userName":"Zjb12","timestamp":1329066691,"content":" So, give me input and ideas, suggestions fr next weekends tournament.  Also, as opposed to banning cards, it's been suggested certain cards could be on a restricted list where you can choose 1 of the cards from among the list to use, but not all.  thoughts?  Our internet is not working at home right now, so I MIT not respond again until the morning---but get going on the discussion and ideas anyway!  Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60384-ideas-for-next-weekends-zjb12-tournament-and-more-discussion-on-creating-a-restricted-list-vs-banning-cards/?do=findComment&comment=593521","commentId":593521,"userName":"Memetix","timestamp":1329071842,"content":"Since Juicebox is running tournaments that tend to use a standard scenario, with a specified card set and no banned or restricted lists I think you should aim for something a bit different to give players more choice.\n\nI enjoyed the challenge of building a deck based around the banned list and custom scenario you created. If you'd chosen to use a restricted list instead, that would have been equally. fun. For me, the enjoyment comes from trying something a bit different and  building a deck within the given parameters.\n\nSome ideas going forwards (these have already been mentioned)\n\n 1. Try out different scoring systems\n 2. Try out some of the custom made quests\n 3. Try using a restricted list of cards\n 4. Try using a banned list\n 5. Try using house rules (i.e. Berevor's ability can only be used once per turn, Zigil miner gives 1 resource if you guess correctly, ....)\n\nGet feedback after each event to find out what people liked and what they didn't.\n\nI think it is important to create a tournament that is easy to enter and is fun to play, regardless of your level of expertise or card pool. If it gets people playing and discussing their games then it has been a success at some level.\n\nSo here's my feedback ...\n\n * I liked the fact the scoring system didn't use threat or damage. I don't like the behaviours scoring systems that use these 2 numbers drive.\n * I liked building a deck to beat the \"whole\" of the encounter deck.\n * I enjoyed trying out the new Misty Mountains encounter set.\n * I thought the difficulty level wasn't quite right (the first version was too hard, and the second version was a bit boring once your deck got going). Most quests ramp up the difficulty throughout the game and this quest failed to do that.\n\nAs for next week, I think my Four Seasons [http://www.blackmoor.org.uk/lotr.htm] quest (shameless plug) would make a good challenge. There are 2 versions, one uses the Rhosgobel AP, the other just the core set. The Rhosgobel version is a more interesting quest but obviously not everyone has access to it. You could have 2 league tables, 1 for the players using the Rhosgobel set, and 1 using the core set. You only need to print off 1 A4 sheet (Fronts.jpg) and none of the new cards are shuffled into the encounter deck making it easily accessible to all players. I'm not convinced this quest needs a banned or restricted list. If it turns out all the top scores are achieved using a similar deck then we'll have learnt something useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60384-ideas-for-next-weekends-zjb12-tournament-and-more-discussion-on-creating-a-restricted-list-vs-banning-cards/?do=findComment&comment=593601","commentId":593601,"userName":"booored","timestamp":1329100760,"content":"are yoyu posting these at BGG?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60384-ideas-for-next-weekends-zjb12-tournament-and-more-discussion-on-creating-a-restricted-list-vs-banning-cards/?do=findComment&comment=593619","commentId":593619,"userName":"Memetix","timestamp":1329103695,"content":"booored said:\n\nare yoyu posting these at BGG?\n\n\n\nYes - when I released them I posted on BGG. Most people submit new quests into the Files section but since I'm hosting them on my own website, I posted a link to them in the variants forums (core and Rhosgobel) and they are listed in the master thread listing all custom quests (which I can never find so I can't send a link) where you can rank quests."}]}