{"url":"https://community.fantasyflightgames.com/topic/60432-return-to-mirkwood-bad-start/","title":"Return to Mirkwood -- Bad Start","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60432-return-to-mirkwood-bad-start/?do=findComment&comment=593919","commentId":593919,"userName":"Nenya","timestamp":1329158494,"content":"I sat down to play Return to Mirkwood this evening after assembling a Rohan deck.  The card I drew from the encounter deck during set up was Attercop, Attercop.  Then the card I drew during the first questing phase was -- you guessed it -- Attercop, Attercop.  And don't think I didn't shuffle the encounter deck carefully and thoroughly -- I did!  I gave up before I got started, it was definitely a time to reshuffle and start over!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60432-return-to-mirkwood-bad-start/?do=findComment&comment=593923","commentId":593923,"userName":"richsabre","timestamp":1329159504,"content":"haha yeah i have about the same luck- i won this with a rohan deck- though it is heavily dependant on lack of enemies- drawing attercop just takes the **** :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60432-return-to-mirkwood-bad-start/?do=findComment&comment=593928","commentId":593928,"userName":"starhawk77","timestamp":1329160689,"content":"Yeah, just about every scenario has a few encounter card sequences that are really hard to overcome, especially if they turn up early. Journey to Rhosgobel is notorious for its devastating strings of treachery cards. Return to Mirkwood is especially challenging for a solo player, since you have to deal with the Attercops, Gollum's Bites. etc., while raising your threat by a minimum of four every round. I think the Rohan deck is pretty well-suited to race through the scenario (equipped with some threat reduction), but things can get pretty hairy if you run into the Attercops and/or the Hill Trolls."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60432-return-to-mirkwood-bad-start/?do=findComment&comment=593981","commentId":593981,"userName":"gatharion","timestamp":1329175140,"content":" The last time I played, I drew \"Gollum's Bite\" as my first card. I just called it an insta lose, reshuffled and drew again."}]}