{"url":"https://community.fantasyflightgames.com/topic/60499-if-a-monster-cannot-attack/","title":"If a monster cannot attack....","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60499-if-a-monster-cannot-attack/?do=findComment&comment=594637","commentId":594637,"userName":"dcdennis","timestamp":1329313080,"content":" ....does their shadow card get resolved? To me it looks like the shadow resolution occurs during combat, and if there is no combat with that monster then its shadow card should fizzle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60499-if-a-monster-cannot-attack/?do=findComment&comment=594641","commentId":594641,"userName":"richsabre","timestamp":1329313736,"content":"dh098017 said:\n\n \n\n ....does their shadow card get resolved? To me it looks like the shadow resolution occurs during combat, and if there is no combat with that monster then its shadow card should fizzle.\n\n \n\n \n\nno it isnt - so if an enemy  is forest snared for example, it gets a shadow card but it is discarded without action from it, you still give enemies shadow cards as shadow cards stay for the duration of the attack, so if an effect made you discard said forest snare, then you would have to act upon the shadow card when it was the enemies turn to attack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60499-if-a-monster-cannot-attack/?do=findComment&comment=594642","commentId":594642,"userName":"ichaos1985","timestamp":1329313844,"content":" You're correct. You deal a shadow card to every enemy. When shadow cards are resolved, you simply discard those on the creatures that cannot attack. \n\nHowever, as someone pointed out already somewhere in this forum, if a shadow card causes you to discard an attachment (for instance Forest Snare), the shadow card on that enemy is resolved as soon as it's its turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60499-if-a-monster-cannot-attack/?do=findComment&comment=594645","commentId":594645,"userName":"dcdennis","timestamp":1329314181,"content":" If another monster's shadow card removes that snare, will the previously snared enemy now attack this round? or does he have to wait til next rounf?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60499-if-a-monster-cannot-attack/?do=findComment&comment=594646","commentId":594646,"userName":"richsabre","timestamp":1329314388,"content":"dh098017 said:\n\n \n\n If another monster's shadow card removes that snare, will the previously snared enemy now attack this round? or does he have to wait til next rounf?\n\n \n\n \n\nyes it will, to quote an excellent rule helper here radiskull-\n\nThe rules state you need to choose an enemy to attack. The FAQ says that the word \"cannot\" is absolute. Ergo, the Snared enemy can't be chosen to \"not attack\". You need to choose each enemy that's capable of attacking and then pass to the next player. If, as a result of those attacks, the Forest Snare is discarded, then that enemy is going to get its shot as well.\n\n \n\nthere was a thread on this recently titled forest snare which goes over all this, therefore you chose attacking enemies 1st, before going to snared enemy to discard it, so if one of the previous enemies detatches the snare- the previously snared enemy wil attack this round"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60499-if-a-monster-cannot-attack/?do=findComment&comment=594673","commentId":594673,"userName":"leptokurt","timestamp":1329316529,"content":"richsabre is right. Only when you have a multiplayer game it might happen that the enemy still won't attack. Say player 1 is the starting player and resolves his attacks. One enemy is forest snared and cannot attack. Then it's player 2's turn, and he draws a shadow card that forces him to discard one of his attachments. As Forest Snare has been playeed by him and it is furthermore his only attachment in play, he has to discard it. However, the trapped enemy is not able to attack this round, because player 1 has already finished his combat phase (but it will attack next round). This is some event that is very unlikely to happen though."}]}