{"url":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/","title":"Zjb12 Extended Weekend Tournament for February 16-20, 2012","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=594755","commentId":594755,"userName":"Zjb12","timestamp":1329328537,"content":"Hi!  Welcome to this weekend's Zjb12 Tournament.  This tournament begins at 12pm (CST/FFG time) Thursday, February 16 and runs through 5pm, Monday, February 20.  (Please do not include scores from times before or after that period.)\n\n Solo Player 3 part-Quest: Khazad-Dum Nightmare Scenario  [because this is a longer game, I have extended the length of the tournament to start on Thursday at 12 noon, CST/FFG time and go until Monday, 5pm CST/FFG time.]\n\nAs simple as it sounds.  Get your heros and deck together and take on all three scenarios from Khazad-Dum in a row.  Start with Into the Pit, upon a winning completion of that continue onto The Seventh Level and upon a winning completion there, finish with Flight from Moria.  To get a winning score, you must make it through all three scenarios with no changes in heros or decks between the scenarios.\n\nHeros:  You may use any of the heros from the Core Set, Mirkwood APs or Khazad-Dum expansion.  There are two alterations however: \n1) Beravor:  add this text to the Action: Limit once per round. \n2) Any Tactics heros enter scenarios at -2 points to their printed threat cost.   (Legolas, Thalin, 9-2=7; Brand, 10-2=8; Gimli, Boromir, 11-2=9).\n\nDeck: Your deck must be 50 cards minimum and no more than 60 cards maximum.  All cards from up to 3 Core Sets, all Mirkwood APs and Khazad-Dum are legal for this tournament. \n\nIn Between Scenarios: You are to reset as if starting a new scenario with this exception:  Any heros that died during the last scenario stay dead.  The only way they may be resurrected is through cards like Landroval, (which you may use 1x per scenario following the card instructions of course) or Fortune or Fate.  If you lose a hero in one scenario but draw Fortune or Fate in another scenario, you are allowed to pay and use it to bring that hero back in the 2nd or 3rd scenario.\n\nFor this quest, you can attempt it as many times as you want during the weekend tournament time frame, but you may only hold 1 position overall in the final standings.\n\nPlease post your results to this forum topic.  When you post your scores please include: Heros; score for each of the three scenarios including threat, damage, dead heros, rounds, and victory points. \n\nQuestions?  Please ask!\n \n1.  Muemakan, Boromir, Eowyn, Theodred, 222.\n\n2. SiCK_Boy, Beravor, Eowyn, Theodred, 368.\n\n3. Narsil0420, Thalin, Dain Ironfoot, Dwalin, 420."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=594759","commentId":594759,"userName":"SiCK_Boy","timestamp":1329329047,"content":"Please clarify whether the official Nightmare rules applie or if you want us to use a variant of your own.\n\nAll the explanations about dead heroes and the comment on \"reseting between scenario\" have me wondering.\n\nSpecifically, what about the official Nightmare rule of not removing any damage token from your heroes and of reseting your threat if you had it lowered below its starting value. Also, in the official rules, you don't reshuffle your discard pile, but any card you had \"in play\" (allies, attachment) or in your hand gets reshuffled at the start of each new scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=594762","commentId":594762,"userName":"Zjb12","timestamp":1329329465,"content":"SiCK_Boy said:\n\nPlease clarify whether the official Nightmare rules applie or if you want us to use a variant of your own.\n\nAll the explanations about dead heroes and the comment on \"reseting between scenario\" have me wondering.\n\nSpecifically, what about the official Nightmare rule of not removing any damage token from your heroes and of reseting your threat if you had it lowered below its starting value. Also, in the official rules, you don't reshuffle your discard pile, but any card you had \"in play\" (allies, attachment) or in your hand gets reshuffled at the start of each new scenario.\n\n\n\n \n\nHey!  No problem.  When you are setting up for the next scenario, wipe the slate clean.  Reset to your starting threat, clear off all damage, and reshuffle all of your player deck back together from cards on the table, attached to heros, in your hand, and in your discard pile, or set aside through player effects.  The only thing that does not reset as I noted above is a dead hero.  Don't forget if you used tactics heros to use their threat -2 as noted above also."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=595119","commentId":595119,"userName":"Zjb12","timestamp":1329408325,"content":" Hey!  Go time was 4 hours ago---note the longer tournament dates!!!  Enjoy!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=595544","commentId":595544,"userName":"Narsil0420","timestamp":1329507561,"content":"Oh man, I just had an epic finale to this one! I was at 49 threat on Flight from Moria and Dwalin brought me back from the brink!\n\nI played with Thalin, Dain, and Dwalin. I thought it was kind of interesting using a tactics hero as my primary quester and a Spirit hero as my primary attacker! ha ha! It ended up being a pretty balanced deck i feel. I had 59 cards in my deck, including even some Lore allies which I could play thanks to Narvi's Belt. I also felt really good about my Seventh Level game, I made it through pretty quick and I had Thalin + Gondorian Spearman skewering those Orcs and Dwalin keeping my threat nice and low.\n\nOk here's my scores:\n\nInto the Pit:  11 Turns / 45 Threat / 1 Damage / 4 Victory Points = 152 Final Score\n\nThe Seventh Level:  8 Turns / 27 Threat / 4 Damage / 0 VP = 111 Final Score\n\nFlight from Moria: 12 Turns / 46 Threat / 2 Damage / 11 Victory Points = 157 Final Score\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=595545","commentId":595545,"userName":"muemakan","timestamp":1329508071,"content":"This probably will be my only entry for this weekend.\n\nHeroes: Boromir, Eowyn and Theodred ....... used the deck I build for the juicebox tournament.\n(3 Cores, all APs and Khazad)\n\nQuest 1: Rounds-5, Threat-38, Wounds-4, Victory-7..........85\n(Dreadful Gap with only 4 progress points......man when was the last time this card was so easy....)\n\nQuest 2: Rounds-4, Threat-23, Wounds-0, Victory-0..........63\n(thank you D. of Thorondor)\n\nQuest 3: Rounds-4, Threat-36, Wounds-1, Victory-3..........74         EDIT: Forget that the tools have a refresh action.\n(got the tools and had Boromir..........quick win)                                            So I needed to add 11 more points.\n\nTotal: 222\n\n \n\nNow, I am off to bed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=595559","commentId":595559,"userName":"SiCK_Boy","timestamp":1329512089,"content":"Just gave it a go, also using the same deck I used in Juicebox's tournament (minus 2 Song of Wisdom, plus 1 Gleowine and 1 Rivendell Minstrel). I figured even with the restriction on Beravor, the deck would still perform well.\n\nIt didn't. I kept having trouble finding my Unexpected Courage (I played 2 of them in all 3 games).\n\nIt was my first time playing Flight from Moria solo. A Chieftain of the Pit right at the start had me forced to use Sneak Attack with a Miners of the Iron Hills just so I wouldn't lose a hero on turn 1... evidently, guess who showed up next turn: the old Greybeard! I had to cycle through the whole quest deck once (Escape from Darkness was the first card on top, and when I got to Blocked by Shadow, I knew (from Henamarth Riversong) that the top card was a Cave In, so no luck there.\n\nThe last turn was so frustrating... It deserves to be told. I had Eowyn with Protector of Lorien, no wound. Beravor had 1 wound and the Abandoned Tools (plus a bunch of other irrelevant attachments). Theodred had died earlier when a Undisturbed Bones revealed as a shadow card forced me to discard an ally and let an undefended Goblin Spearman get through... My army included Henamarth Riversong, a Rivendell Minstrell, a Daughter of the Nimrodel and a Northern Tracker. I was engaged with a Great Cave-Troll and that same Goblin Spearman who had killed Theodred. The staging area included The Nameless Foe (7 points in my Victory display) and The Mountains' Roots and I knew the top card of the encounter deck was A Foe Beyond. I was at 42 threat, had no card in hand, plenty of resources on both my heros (so I could play any drawn card; Beravor had the Song of Kings) and there were 3 progress on Escape from Darkness. All I needed was to hold on for 1 turn.\n\nI drew... Protector of Lorien. Totally useless... I quested with the Tracker (to clear the Mountains Roots) and the Minstrell. 3 threat vs a 7 threat Nameless Foe had my threat increase to 46. Eowyn died to the revealed A Foe Beyond. I went to fight and defended the troll with the Daughter. Shadow card was Goblin Spearman; no big deal and the Daughter died... all that was left was defending against the Spearman with Henamarth... guess what the shadow card was? Another Undisturbed Bones. No more defender, have to assign 4 damage to a hero... too bad, Beravor died clutching that pick-axe while seeing a little ray of light from that wall he had toiled so long to break... **** you, Goblin Spearman!\n\nResults:\n\nInto the Pit - Win: 38 threat + 0 dead hero + 2 wounds - 4 victory points + (8 rounds * 10) = 116\n\nThe Seventh Level - Win: 32 threat + 0 dead hero + 0 wound - 0 victory point + (8 rounds * 10) = 112\n\nFlight from Moria - Loss\n\nI'll certainly give this one another try with the same deck. I'll also probably try it with an all Tactics deck (using Gimli, Brand and Legolas... must maximize the amount of questing power to pass the first quest, otherwise I'd have used Boromir instead of Brand), just to be in the spirit of the challenge Zjb has given us.\n\nBy the way, Muamakan, what does it change that the Tools have a Refresh Action if you have them on Boromir? You can still use Boromir's action to refresh, even during the Refresh phase, no? Or am I missing something here?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=595579","commentId":595579,"userName":"muemakan","timestamp":1329516215,"content":"SiCK_Boy said:\n\nBy the way, Muamakan, what does it change that the Tools have a Refresh Action if you have them on Boromir? You can still use Boromir's action to refresh, even during the Refresh phase, no? Or am I missing something here?\n\n\n\nAction window is after you add one more round and raise your threat. Forget that at first. So my first entry before I edited it had 11 less points.\n\nHm, now I am still not in bed......"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=596136","commentId":596136,"userName":"Zjb12","timestamp":1329672034,"content":"Don't forget!  One more whole day left!!! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=596137","commentId":596137,"userName":"SiCK_Boy","timestamp":1329672251,"content":"After 5 loss, I finaly managed to score a win, although it wasn't my best result...\n\nInto the Pit - Win: 26 threat + 0 dead hero + 3 wounds - 4 victory points + (5 rounds * 10) = 75\n\nThe Seventh Level - Win: 31 threat + 0 dead hero + 0 wound - 2 victory points + (17 rounds * 10) = 199\n\nFlight from Moria - Win: 25 threat + 0 dead hero + 5 wounds - 6 victory points + (7 rounds * 10) = 94\n\nToo bad I spent so much time on quest # 2. I kept drawing enemy after enemy and it took me forever to get some fighting power in the form of Unexpected Courage and Northern Tracker (plus my last Gandalf to deal with a Troll).\n\nFor the first time against Flight from Moria, I drew the quest where you must reveal the top card and I knew it was not a treachery. After that, it was easy enough to complete.\n\nOverall, I must say they proved more of a challenge than I expected and I'm not sure I'll want to try such a tournament where you have to restart from the beginning to get any kind of score. They invented save points in video games to prevent exactly this kind of frustration. I think in the future, if you want to make a multi-quest event, you should make it so that each one is played independantly (rather than in a \"nightmare-style\" format). I'll reserve the Nightmare format for my own personal games when I'm really looking out for a challenge.\n\nStill, it gave me a change to familiarize myself with all the KD quests. I'll go back to playing some Mirkwood stuff now... enough of these orcs and goblins! Bring me some trolls at the Carrock or swarms and bats in Rhosgopel!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=596655","commentId":596655,"userName":"Zjb12","timestamp":1329763309,"content":"Done!  Thanks guys for playing!  A tough one!  I didn't even get a chance to give it a go...oh well!  Congrats Muemakan on another win!  SiCK_Boy, I wasn't sure which heros you used on your attempt where you won, but let me know and I can edit this. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=596672","commentId":596672,"userName":"SiCK_Boy","timestamp":1329766843,"content":"Theodred, Eowyn and Beravor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60515-zjb12-extended-weekend-tournament-for-february-16-20-2012/?do=findComment&comment=597082","commentId":597082,"userName":"Zjb12","timestamp":1329837809,"content":"SiCK_Boy said:\n\nTheodred, Eowyn and Beravor.\n\n\n\nThanks!"}]}