{"url":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/","title":"Buried Alive - a new quest using encounter cards from Khazad Dum","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=594718","commentId":594718,"userName":"Memetix","timestamp":1329321322,"content":"My new quest is now available for download [http://www.blackmoor.org.uk/lotr.htm].\n\nBuried Alive - Difficulty Level 6\n\nChieftain Nor of the Longbeard Clan sends word that his home in the shadow of Caradhras is beseiged by orcs. You must face the perils of the Misty Mountains and find a way to destroy the orc army in order to liberate the Dwarves.\nWhen all seems lost, help comes from an unexpected direction but your heroes must first divide in order to turn the treacherous conditions to your advantage.\n\nBuried Alive [http://www.blackmoor.org.uk/Buried%20Alive.jpg]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=594751","commentId":594751,"userName":"cordeirooo","timestamp":1329328286,"content":"Heey, nice to see that you're still active.\n\n \n\nI played your first two quests and must say THEY ARE HARD and LOADS OF FUN. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\nUnfortunately, I'll not play this version so soon. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nI liked the Objective a lot, and probably will 'stole' this idea.\n\n \n\nAlso, if you allow me to criticize: Nor seems very powerful, way along the top. How he done in playtesting? Is he design solely with solo in mind?\n\n \n\nCheers, and keep up the good work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=594856","commentId":594856,"userName":"Memetix","timestamp":1329356433,"content":"I'm glad you enjoyed the first 2 quests, I think this one is my best to date.\n\nI'm always happy to get feedback, producing a new quest is a lot of work and requires a lot of play testing and several iterations of the cards in an attempt to make the quest interesting and challenging. Feedback from players is always welcome and helps me design better quests in the future.\n\nTo answer your question, Nor is designed for this quest and not for general use.\n\nI really wanted to find a way for the players to play some of the quest with just two heroes. In solo play testing, I found that Nor needed a way to help the players use any card in their deck, i.e. he needed to be able to produce resources for any sphere. The mechanic I came up with means Nor has a weaker version of Narvi's Belt built in. This seemed to work well and fitted the theme, but he was always low on resources. I tried giving him extra resources when he killed orcs but this didn't happen often enough so I ended up with the current version. I think of him as running around and organising his people in order to get the extra 2 resources. The way the scenario plays, he will usually get to use that ability on the first turn, which means he get help out on the first turn against the Giant Cave Troll. Once you've given the scenario a go, you'll understand just how much you'll appreciate that! The encounter cards are very challenging, be warned this can be a tough test and seems to get harder with more players. You get a real sense of achievement at the end and really feel as if you have climbed a mountain. \n\nI will think about added a new location card for stage 3B, something like \"Longbeard Clan\".\n\nWhile Longbeard Clan is in the staging area Nor gains \"Action: Exhaust Nor to place 2 resources tokens on Nor\"\n\nThen I can remove that ability from his card and he would then be more balanced for general use. What do you think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=594972","commentId":594972,"userName":"cordeirooo","timestamp":1329384480,"content":"Yes, I just downloaded the new image.\n\n \n\nThe cave idea was really cool. Although, IMMO I wouldn't put a Victory trait on it because it's easy to overcome and it doesn't make you pay for not getting rid of it. In my pov, the Victory trait is slapped on cards that graduate over time (Chieftain Ufthak, Gladden Fields, Hill Troll), cards that MUST NOT be reshuffled once the encounter deck runs out (those are usually Victory 1), or cards that are extremely dangerous (Hummerhorns comes to mind). The way I see, Longbeard Cavern does not fit any of those parameters, maybe tangentially the must-not-reshuffle, but even then, it has 1 point higher.\n\nAgain, that's my opinion, I just started in the world of customizing LotR cards, take it with a grain of salt!\n\n \n\nCheers. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n \n\n* Oh, just to be clear, I said I won't play this scenario because I do not own Khazad-dum yet. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\nAs soon as I get my hands on it, this will probably be one of the first scenarios I play!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=595035","commentId":595035,"userName":"Memetix","timestamp":1329391576,"content":" You got it - it falls into the \"must not be reshuffled\" camp. Since I was giving it a victory score (as you suggested it was 1 to start with) I realised that the whole point of the quest was to save the Dwarves at the camp, so why not reward players for actually exploring the location.\n\nI look forward to seeing your work in the future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=595339","commentId":595339,"userName":"cordeirooo","timestamp":1329473352,"content":"Thanks, I post some stuff in this forum, but the core is always here [http://www.cardgamedb.com/forums/index.php?/forum/18-lotr-lcg-general-discussion/]. \n\n \n\nI only fully-tested two scenarios so far, but have at least 9 more currently being tested and started the new cycle a few weeks ago."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=595550","commentId":595550,"userName":"Angus Lee","timestamp":1329508780,"content":"I noticed that there is a difference in the 1B card in this new edition and that in the old one.  Originally it told the players to reveal 1 encounter card per player but now it just reveals 1 encounter card.  Why change the design?  Generally, the quest scales better with a variable setup according to the number of players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=595583","commentId":595583,"userName":"booored","timestamp":1329518306,"content":"Make sure you post these at BoardGameGeeks as well, as you will get a LOT of people there trying them out as that site has a really developed scene of user created content for these games... (were did you think the PSD templates HilariousPete used to make the Strange Eons Plugin.. in fact... were did you think the Strange Eons plugin came form?)\n\nAnyway, also the file section there is well developed so you can store the quest on the website itself ensuring that for all time it will be available to he public.\n\nLord of the Rings File Section @ BGG [http://boardgamegeek.com/files/thing/77423]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=595612","commentId":595612,"userName":"Memetix","timestamp":1329528358,"content":"@Angus - In play testing I found that the 2 player experience was way tougher than solo. Lots of encounter cards from Khazad Dum already scale with the number of players. The new version seemed to give a better game.\n\n@Booored - Thanks - I posted on BGG at the same time as here in the Khazad Dum variants section."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60511-buried-alive-a-new-quest-using-encounter-cards-from-khazad-dum/?do=findComment&comment=595741","commentId":595741,"userName":"booored","timestamp":1329571365,"content":"oh neat.. for some reason i havn't even thought to try file sections for the expacs! lol"}]}