{"url":"https://community.fantasyflightgames.com/topic/60660-which-ap/","title":"Which AP?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596041","commentId":596041,"userName":"Ted Sandyman","timestamp":1329654616,"content":"Will be buying my first two Adventure Packs this evening so would like advice on which one to get. I have only got the core set at the mo, loving all three scenarios. I can complete the Passage thru Mirkwood most times while Journeying Down the Anduin is an absolute beauty with just a 20% success rate but each time i play this scenario it always goes to the wire. Escaping from Dol Guldur is a total failure each time as im just experimenting solo for now. Anyway, some advice on which AP to purchase would be gratefully received as i dont think im ready yet for a Level 7 pack  but feel a Level 1 or 4 would suit me. Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596058","commentId":596058,"userName":"booored","timestamp":1329658135,"content":"I would recommend HUNT FOR GOLLUM as it has the Minstrel cards in it. These are key cards. 3 for 2 will + a song fetch for leadership (comes in that pack as well) really is a great way to make 2 sphere + a splash with out having 3 spheres of heroes. Then Conflict at the Carrock... I know these are the 1st 2 sets but conflict has Mapmaker and Frodo and burning brand.. all fantastic cards.\n\nAlso, Hunt and Carrock are considered by many (including me) to be the best quests in Mirkwood Cycle as well.\n\nIf you are planning to get them all, then I would just get them in order... if you plan on playing Darowdelf you HAVE to buy Khaz, as those APs require it, and if you have Khaz you will need Return to Mirkwood as Dain (the dwarf god) Ironfoot is a must have. Though that quest is terrible for solo players\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596065","commentId":596065,"userName":"gatharion","timestamp":1329659140,"content":" Hunt for Gollum is level 4, but way easier than Journey Along the Anduin (at least in solo play)\n\n \n\nConflict at the Carrock is level 7, but with careful deck construction and strategy can be pretty easy (or so I've been told, I usually get the stuffing beat out of me)\n\n \n\nJourney to Rhosgobel is level 6, but it's very tough. It also has a much more different feel than most other quests as it's not about questing real fast or beating up a particular enemy; instead it provides another objective that requires one to rethink a lot of their strategy.\n\n \n\nHills of Emyn Muil is level 4. It's generally considered a very dull quest (just explore a bunch of locations). A Leadership or Tactics deck will probably find it a bit challenging, but it's laughably easy with a Spirit deck.\n\n \n\nThe Dead Marshes is level 5. It frustrates some because there's no condition for Gollum ending up in your discard pile, but it's a very solid quest and probably the one that I would most strongly recommend for something that offered a bit of challenge without feeling overwhelmingly difficult.\n\nReturn to Mirkwood is level 7. I think this one is generally easier than the other level sevens, I've found that, barring a some unfortunate card draws, a solid questing deck can often plow through it. Very dependent on how lucky you are in your card draws off the encounter deck and if you're able to manage your Threat.\n\n \n\nAs for the player cards, I don't have a lot to say. As soon as I get them they tend to go in my general card pool and I don't pay much mind to which AP they came from. Also, there are sort of running themes through the APs that feed into one another. Like I know the Return to Mirkwood AP included the Support of the Eagles attachment and the Eagles of the Misty Mountains ally, which are both excellent, but a large part of what makes them excellent is the other Eagle cards like Winged Guardian and Vassal of the Windlord that were in earlier packs.\n\nI like all of the various Heroes that have been introduced and they can all fit various roles pretty nicely. Prince Imrahil is a favorite to include in either an Eagle deck or a Rohan deck. Lots of people like Boromir (although his high starting threat and threat raising power means I often shy away) and he's in the Dead Marshes. If you like Dwarves, then Dain Ironfoot from Return to Mirkwood is a must; he makes every other dwarf character (Hero or Ally) better.\n\n \n\nIf you're getting two packs, I guess I would suggest Journey to Rhosgobel and the Dead Marshes.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596073","commentId":596073,"userName":"richsabre","timestamp":1329661367,"content":"ill put another vote for HFG- its the beginning so if you decide in the end you want to do it storyline wise then you're ok- it also is fun, a good level for solo, and has some geat cards, you also know that it was designed to be won with just your current card pool and the pack contents"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596105","commentId":596105,"userName":"muemakan","timestamp":1329667542,"content":" HfG an Carrock!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596229","commentId":596229,"userName":"Ted Sandyman","timestamp":1329702153,"content":"Well thats given me a lot to think about! Thank you all for your knowledge, advice and spending the time to give my query some thought. I like the idea of playing the scenarios in a kind of order so will look to that route i think. Thanks again. Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596472","commentId":596472,"userName":"divinityofnumber","timestamp":1329743512,"content":" I would say to progress in the order that they were released. \n\nI play them in the order that they were released, and only add cards to my deck(s) from the sets that I am on. For example, I just recently beat Escape from Dol Guldur (in a two player game), so I allowed myself to move on to Hunt for Gollum and incorporate those cards into my decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596477","commentId":596477,"userName":"richsabre","timestamp":1329744251,"content":"divinityofnumber said:\n\n I would say to progress in the order that they were released. \n\nI play them in the order that they were released, and only add cards to my deck(s) from the sets that I am on. For example, I just recently beat Escape from Dol Guldur (in a two player game), so I allowed myself to move on to Hunt for Gollum and incorporate those cards into my decks. \n\n\n\nthat is a way i know alot of people like\n\nthat way you sort of experience the game from the start, as those who bought it last year did"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596745","commentId":596745,"userName":"Budgernaut","timestamp":1329781545,"content":" That's what I'm doing . . . sort of. I bought all 6 SoM APs last week and I'm playing through them in order, but I'm not playing restricted. I bought all them player cards and by golly I'm gonna use 'em all!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60660-which-ap/?do=findComment&comment=596752","commentId":596752,"userName":"booored","timestamp":1329783719,"content":"in Return to Mirkwood almost every player card is super cool as well... the quest is retardedly lame though."}]}