{"url":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/","title":"I always feel starved for something....","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596468","commentId":596468,"userName":"dcdennis","timestamp":1329743067,"content":"  i always feel like i am short of soemthing in this game so far. having to commit for quest, and commit for defense, i always feel too short of either chars or resources. i wish attacking the monster came first so you could have a chance to kill them before they attack. solo is very hard. still havent been able to get past the first step of quest 2. am i doing it right that if your initial reveal isnt the hill troll you have to deal with 3 encounter cards on your first turn? 1 for the random, 1 hill troll and 1 for the first questing phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596474","commentId":596474,"userName":"ragnarhedin","timestamp":1329743935,"content":"Yup, since the odds of the Hill Troll coming out in the first draw are very low, you're probably dealing with 3 cards during initial quest phase.  But your threat should be low enough that the troll stays in the staging area  (with only 1 threat), and hopefully one of the other cards is a location you can travel to.\n\n \n\nGood luck with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596475","commentId":596475,"userName":"richsabre","timestamp":1329744045,"content":" yes, it is,\n\ntry and get your set up hand good- remember mulligans\n\nalso use everything to your advantage if possible\n\nso think what is the most desperate need, getting rid of an enemy, or powering through questing- this will change per round, and sometimes sacrifces have to be made to succeed, so if you can risk losing the questing phase and gain threat, then use that turn to clear the staging areas of enemies\n\nor if you can risk getting a hit point on a hero, and you want to commit alot of your strength to finish off a location then do so.....i guess my point is its all about looking at your current situation, denethor is key for this strategy as you arent really risking anything when you know whats coming\n\nalso dont concentrate on really powerful cards all the time, theres some great enemy fodder out there for 1 cost, and some have good effects before they get wiped out\n\nalso with deck peeking, when you have the choice of taking a treachery or a enemy, take the treachery unless its really bad.....treachery cards are discarded but an enemy stays there till you do something about it\n\nfinally its all practice........give it time, everyone who solos in this game has had the same situation, finding it hard to handle everything at once"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596486","commentId":596486,"userName":"dcdennis","timestamp":1329744988,"content":" what is the mulligan rule? i dont recall reading that. same as agot? or more similar to magic?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596491","commentId":596491,"userName":"richsabre","timestamp":1329745187,"content":"dh098017 said:\n\n \n\n what is the mulligan rule? i dont recall reading that. same as agot? or more similar to magic?\n\n \n\n \n\nif you dont like your opening draw hand you can take another go at drawing 6 different ones, but have to accept the 2nd try\n\ni dont know if its similar to those as i dont play any other"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596505","commentId":596505,"userName":"dcdennis","timestamp":1329746493,"content":" ok ya that is agot mulligan style. magic is you can mulligan as many times as you want, but each time you take 1 less card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596542","commentId":596542,"userName":"Budgernaut","timestamp":1329751680,"content":"I guess I've been pretty lucky because usually I reveal a Treachery card as my first card and it doesn't apply to me at that point (ex. deal dmg if threat over 35, or remove a character from the current quest, etc.). That means I just have the hill troll and one other card in the staging area. In fact, I don't recall ever having 3 enemies in the staging area on the first round. It must just be my luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596548","commentId":596548,"userName":"player1761766","timestamp":1329752224,"content":"richsabre said:\n\nalso use everything to your advantage if possible\n\nso think what is the most desperate need, getting rid of an enemy, or powering through questing- this will change per round, and sometimes sacrifces have to be made to succeed, so if you can risk losing the questing phase and gain threat, then use that turn to clear the staging areas of enemies\n\n\n\nI must admit, this is something I don't like doing - \"I've just got my fellowship together, I can't go throwing the weak ones at these beasties! Protect the weak, etc!\" Hopefully we'll see some quite good card effects when allies leave play, like some of the Chaos beasts from the Warhammer game, dealing damage to everything in the staging area or somesuch... Are there any of those at the minute? I can't think off the top of my head...\n\nrichsabre said:\n\nfinally its all practice........give it time, everyone who solos in this game has had the same situation, finding it hard to handle everything at once\n\n\n\nOh yes, this is far too true! I remember my first Conflict at the Carrock - had a staging area full of nastiness and I was one hero down before the fourth round had begun. There was no way I was going to win that game. And I didn't!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596611","commentId":596611,"userName":"richsabre","timestamp":1329758885,"content":"spalanzani said:\n\nrichsabre said:\n\n \n\nfinally its all practice........give it time, everyone who solos in this game has had the same situation, finding it hard to handle everything at once\n\n \n\n \n\nOh yes, this is far too true! I remember my first Conflict at the Carrock - had a staging area full of nastiness and I was one hero down before the fourth round had begun. There was no way I was going to win that game. And I didn't!\n\n\n\nmy first go at C@C was embarrasing-its a good job i play solo\n\ni didnt really think what the quest was all about so i just went in, flew through the 1st quest card and then though oh S***.....theres 4 trolls there....oh dear........"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60709-i-always-feel-starved-for-something/?do=findComment&comment=596730","commentId":596730,"userName":"GrandSpleen","timestamp":1329778536,"content":"I have yet to beat Anduin solo (partly from lack of trying).  I had a really solid game going this evening, 2 gandalfs in my hand and a sneak attack by the 2nd or 3rd round.  Played Gandalf and damaged the troll (=4), then engaged it with the intent to do 1 point of damage (=5) and kill it with a sneak attack Gandalf (=9) in the following round.  Gandalf defends against the troll's attack, then lo and behold the shadow card that comes up is Pursued By Shadow.  Gandalf being my only ally in play, this removes him and renders the attack undefended.   Result is one dead hero and a game that is downhill from there... beat the troll but couldn't even finish the first stage.\n\nThat encounter deck can be mean!  There is a lot of strategy in winning, but you can't always defeat lady luck.\n\nGS"}]}