{"url":"https://community.fantasyflightgames.com/topic/60828-solo-questing/","title":"Solo Questing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60828-solo-questing/?do=findComment&comment=597471","commentId":597471,"userName":"Deor2","timestamp":1329913273,"content":" Hello everyone,\n\n    Well i just bought the game a  week ago and am already in love with it. I have been doing the quests with a buddy of mine and am going through all three of the core quests before I move on to deck building. The main reason I bought the game is two fold. One I love love love Lord of the Rings and all things Tolkien. And second, I was wanting a game I can play solo. There are far to many times when I am the lone gamer and want to be able to game. So my question is this: What advice do you guys have for the solo quester? I see alot of talk about 2-4 players but not alot of talk on solo play. Any advice would be great. Thanks for the view. now off the Aduin river to battle a hill troll..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60828-solo-questing/?do=findComment&comment=597499","commentId":597499,"userName":"muemakan","timestamp":1329916733,"content":"Deor said:\n\n \n\n Hello everyone,\n\n    Well i just bought the game a  week ago and am already in love with it. I have been doing the quests with a buddy of mine and am going through all three of the core quests before I move on to deck building. The main reason I bought the game is two fold. One I love love love Lord of the Rings and all things Tolkien. And second, I was wanting a game I can play solo. There are far to many times when I am the lone gamer and want to be able to game. So my question is this: What advice do you guys have for the solo quester? I see alot of talk about 2-4 players but not alot of talk on solo play. Any advice would be great. Thanks for the view. now off the Aduin river to battle a hill troll...\n\n \n\n \n\nI think the best way is to just start playing. \nLore has got deck manipulation cards like Denethor and Hememath Riversong, which let you look at the encounter deck.\nIn solo play this is quite useful. \n\nFor future posts I would recommend the new forum categories we have since monday. ( there quite new) \nI guess your post would fit into the \"strategy and deck-building\" category. Also you´ll find quite useful links in the rules section which may help with\nfuture questions and so on.\n\ncheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60828-solo-questing/?do=findComment&comment=597506","commentId":597506,"userName":"richsabre","timestamp":1329917727,"content":"Deor said:\n\n \n\n Hello everyone,\n\n    Well i just bought the game a  week ago and am already in love with it. I have been doing the quests with a buddy of mine and am going through all three of the core quests before I move on to deck building. The main reason I bought the game is two fold. One I love love love Lord of the Rings and all things Tolkien. And second, I was wanting a game I can play solo. There are far to many times when I am the lone gamer and want to be able to game. So my question is this: What advice do you guys have for the solo quester? I see alot of talk about 2-4 players but not alot of talk on solo play. Any advice would be great. Thanks for the view. now off the Aduin river to battle a hill troll...\n\n \n\n \n\nhello and welcome\n\ni play purely solo so may be able to help you\n\nsolo playing relies heavily on managing your heros and allies and using them for the right things- who do you want questing? defending? attacking? you need to look at your current situation and make a strategic descision on what to do- youll become better at this over time, especially if you have experience in other games like this\n\nthere are a few cards that are a huge help until you get properly aquianted with them all\n\n \n\nEowyn- great for questing- her 4 willpower with a chance to buff it up to 5 is a greaat help, as she can often quest on her own freeing up other characters\n\nUnxpected courage- this allows you to ready a hero after they do something, so they can in 1 round quest then ready to attack or defend\n\nDunhere-he is a good fighter, and can attack enemies in the staging area to prevent a build up\n\nDenethor- allowing you to look at the top card of the encounter deck and change it can be invaluable at certain quests, stick unexpected courage on him and he's even better\n\nHenemarth Riversong- sort of like a cheap version of denethor only you can move the card you look at\n\nAragorn- he can ready after questing\n\nThalin- deals damage to enemies revelaed while he is questing- they get the damage BEFORE they surge so this is great for eastern crows\n\n \n\nfinally get onto multi sphere deck building as quick as you can :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60828-solo-questing/?do=findComment&comment=597509","commentId":597509,"userName":"hildargo","timestamp":1329917924,"content":"First off, good luck with Journey down the Anduin. That quest is a pain, but super fun. There are a couple of things that I like to think about when building a solo deck. How am I going to pay for my cards? How am I going to manage my threat/quest successfully? How am I going to defeat/evade enemies/the encounter deck? How am I going to get to the cards that I want/need to play? A solo deck needs to be able to perform well in all of these facets, in my opinion. Right now, I am playing a heavily themed dwarf deck with Dain Ironfoot, Gloin and Bifur. I use the Leadership sphere for resource generation (Steward of Gondor and Gloin), I use Tactics for attachments used in combat, and I use Lore for questing and card generation (Longbeard Map Maker, Gleowine). With just the core set you are definitely limited with mixing spheres, but I would recommend taking a look at the cards and see what you think would work well together and just experiment, and don't get discouraged. Hopefully this helped out a bit. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60828-solo-questing/?do=findComment&comment=597696","commentId":597696,"userName":"Flydragon","timestamp":1329947902,"content":"Great suggestions there!\n\nIf you are having budget, I will suggest the adventure packs for more scenarios and of course, more cards to deck-build as well.\n\nIMO its worth the investment. Oh and you wont need to buy multiple packs. Its all fixed cards(unlike other card games where booster packs are random)!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60828-solo-questing/?do=findComment&comment=597795","commentId":597795,"userName":"Serazu","timestamp":1329975272,"content":"Play Spirit, ideally as your main sphere. It's the best sphere in the game for solo play by far. I personally own the Core Set, the Hunt for Gollum and the Conflict at the Carrock and I 've made a Spirit / Lore / splash of Leadership deck with Eowyn / Frodo Baggins / Beravor, which absolutely destroys the second adventure in the CS and the two aforementioned adventure packs. Strangely, the first adventure of the Core Set is more challenging for my deck than the three I 've already mentioned, probably because I 'm not strong in military till I have all the pieces of the device running - well, one cannot have anything, I guess. I 've yet to try Dol Guldur, which everyone considers nigh on impossible in solo (at least, before Zigil Miners came out)."}]}