{"url":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/","title":"Playing with 3 or 4 players","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=597606","commentId":597606,"userName":"Bomb","timestamp":1329929614,"content":"Just making sure on this.  Is the only difference between the number of players in games that are played the number of cards revealed during the Quest phase?  I know that you reveal one card per player in the Quest phase, but wasn't sure if anything was different for 3 and 4 player games.\n\nAre there any other rule changes to try and balance difficulty when playing with 3 and 4 players?\n\nAlso, what is the purpose of buying a 2nd Core Set when you don't change the contents of encounter decks?  I know more Hero cards become available, but you could play 3 or 4 player with at least the starter decks.\n\nLol just making sure I am understanding everything for instances we may play 3 or 4 player games.\n\n\nThanks guys!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=597611","commentId":597611,"userName":"richsabre","timestamp":1329930088,"content":"well, there are many encounter cards that do x where x is the number of players in the game, so this is another way that it balances things out\n\ni dont play multiplayer so cant help you much more, but alot of players buy a 2nd set to get 3 copies of every cards such as unexpected courage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=597710","commentId":597710,"userName":"starhawk77","timestamp":1329953050,"content":"Along with the extra encounter cards revealed during each staging step, there is also the matter of the \"first player\" designation. In a two-player game, this mechanic is pretty easy to keep track of; you will always be either the first or last player (you will always be both in a one-player game).\n\nTechnically, though, the first player token passes clockwise at the end of each game round. With so many participants, this can easily get lost in the shuffle. Make sure you keep tabs on who is the first and who is the last player, since many game effects target one or the other.\n\nAs to the question of multiple Core Sets, those purchases are almost universally made in order to acquire full play sets of every player card. The extra encounter cards are useless unless you find some creative application for them. Additionally, if multiple people in your group want to use the same sphere, a single Core Set may not suffice. So, if you feel like you need three copies of every player card, or if your group is large enough to require sphere duplication, you may want to invest in more Core Sets. Otherwise, one will do just fine. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=597833","commentId":597833,"userName":"Bomb","timestamp":1329988427,"content":"Thank you very much for the confirmation.\n\nI had taught 3 of my friends how to play just using 3 starter decks and the Quest \"All Return to Mirkwood\".  They breezed through it.  I know it's the easiest quest, but I wasn't sure if that had anything to do with it being 3 player or not.  That quest appeared to be quite a bit more challenging 2 player so I figured the difficulty of quests goes down a little the more players there are.\n\nThanks to both of you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=597845","commentId":597845,"userName":"Trantor3","timestamp":1329989981,"content":"Actually, the official reason for needing two Core Sets for 3 or 4 players are the threat trackers. Nothing that pen and paper couldn't handle...\n\nIn general, most quests get easier the more players are involved. This is especially true for Escape from Dol Guldur, which is nigh-impossible solo and rather easy for 4 players. The game balance seems best with 2 players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=599059","commentId":599059,"userName":"Laraek","timestamp":1330266917,"content":"Silly me.  I have been shuffling together two sets of encounter cards from two core games to make the quest deck for a 4-player game.  Now I know better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=630674","commentId":630674,"userName":"ssaavedraudec2","timestamp":1336939855,"content":"Hi.\n\n \n\nWith my 10 minutes search i cant find an answer….\n\n \n\n \n\nCan two player use the same hero?\n\n \n\nAnd only to know…. Can 1 player use 2 heroes with the same name?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60843-playing-with-3-or-4-players/?do=findComment&comment=630680","commentId":630680,"userName":"muemakan","timestamp":1336941284,"content":" page 8. Unique cards."}]}