{"url":"https://community.fantasyflightgames.com/topic/60931-3rd-core-quest-minutia-help/","title":"3rd Core Quest minutia help.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60931-3rd-core-quest-minutia-help/?do=findComment&comment=598101","commentId":598101,"userName":"dcdennis","timestamp":1330034285,"content":" Good evening,\n\nFinally beat the 2nd core quest tonight and moved on to the 3rd one for the first time. Having never seen obvjectives before we were a bit baffled at the lack of rules details provided on these cards in the given rule books.\n\nCan someone point me to a place where I can read more about how to handle these? Some of the questions we had are: 1) Can the locations and enemies that are 'guarding' an objective engage and be engaged as any other normal encounter card would? If a guard is cleared, does the next encounter card attach as a new guard or is it only that first time that a guard is attached? \n\nInfo along these lines would be really great. Looking fwd to having as much fun trying this quest as we did with quest 2 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I want to beat all the quests in order without reading about them ahead of time so that I am always surprised. That's why I didn't know anything about objectives until now. Thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60931-3rd-core-quest-minutia-help/?do=findComment&comment=598109","commentId":598109,"userName":"Mattr0polis","timestamp":1330037021,"content":"Yeah, the rules have that tiny section on Objectives on page 7 and then there's more info under the 'Guarded' section on page 24. Other than that, what an objective card does varies per quest and the extra instructions are on the objective cards themselves, the quest cards and sometimes other encounter cards like enemies.\n\n1. Yes. You engage and explore these 'guarding' enemies and locations as normal. Once the guarding card is killed or explored nothing else picks up the objective. It just sits in the staging area until you then do what's written on the objective card, which in the Dol Guldur quest's case, you can raise your threat as an action to claim these objectives once they are free of guards and you will need them attached to get through a couple of the quest stages.\n\nHope that helps! Good luck with Dol Guldur, it's a tough one! ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60931-3rd-core-quest-minutia-help/?do=findComment&comment=598287","commentId":598287,"userName":"richsabre","timestamp":1330075154,"content":"i know objective card confused the hell out of me at first\n\ninstead of repeating what mattropolis said, ill just say listen to ^"}]}