{"url":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/","title":"Table Talk: How far do you push the envelop?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598294","commentId":598294,"userName":"dcdennis","timestamp":1330076617,"content":" Subject says it all. During your cooperative games, how close to the edge of breaking the table talk rule do you get? I like to be as strict as possible but sometimes stuff does slip out. The official rule says you cannot speak the card title or read the text allowed off cards in your hand, or of cards that you have seen but others have not. There are several ways to stay within this framework while still making it very clear what you have at your disposal. \n\nQuestion 1: If you have Hasty Stroke in you hand, and you say: \"Don't worry about the Shadow cards this round, I can cancel at least one.\", would you consider that to be breaking the letter and/or spirit of the Table Talk rule? You aren't reading directly aloud from the card, but you are paraphrasing it in such a way that there can be no doubt what you are referring to.\n\nQuestion 2: If you use Henemarth Riversong to look at the top card of the encounter deck during the quest phase, then tell your partner how much total threat you are currently facing including the cards in the staging area and the top card, would you consider that breaking the table talk rule? You aren't directly tell them what that cards threat is, but with the info you are giving a 2nd grader could deduce the answer.\n\nLet's hear some opinions! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598320","commentId":598320,"userName":"Mattr0polis","timestamp":1330080280,"content":"We stay closer to your first example and will say stuff like \"Don't worry about the Shadow card, I have a way to deal with it.\" or \"I suggest saving a resource for a Test of Will, if you have one. We might need it this turn.\"\n\nYour second example seems a bit more shaky for our group, in that saying the exact threat needed kind of is directly letting the other player(s) know information about a hidden card. However, we will say things like \"Ok, you should be fine questing with just those two characters. I suggest saving that third character now that I have seen the top Encounter card.\"\n\nThere definitely are many ways to technically get around the table talk rules if you so desire, so really I think it just comes down to what each group wants out of the game, thinks is fun, etc.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598372","commentId":598372,"userName":"Budgernaut","timestamp":1330087806,"content":" That's a really neat topic. I ran into this when I first go the game. We played a couple of games, working up through the starting scenarios. We were on Escape from Dol Guldur and I was running the Leadership starter. I tried to suggest in a very speculative and non-assertive tone that maybe we should commit all our characters to the quest that round. Immediately the three other players said, \"You've got Grim Resolve, great!\" I felt like I had cheated, but I tried so hard not to let slip what I was actually planning.\n\nSince then, I haven't had a chance to play anything but solo so I don't have much more to say about how far I would push things."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598398","commentId":598398,"userName":"dcdennis","timestamp":1330090600,"content":" \"I'm not saying one way or another, but if you are able to give me one more resource, I might be able to introduce you to my pointy hatted, white bearded friend. I can't tell you what his name is, so if you prefer I could DRAW you THREE pictures instead.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598403","commentId":598403,"userName":"Budgernaut","timestamp":1330091291,"content":"dh098017 said:\n\n \"I'm not saying one way or another, but if you are able to give me one more resource, I might be able to introduce you to my pointy hatted, white bearded friend. I can't tell you what his name is, so if you prefer I could DRAW you THREE pictures instead.\"\n\n\n\nYeah, that's definitely pushing the envelope. (But still pretty funny. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]) At that point you might as well play with open hands. [Actually I did that once. It was the only game I ever played with my wife and I just played with open hands so I could guide her with her decisions and show her what my options were and why I chose what I did. At the end of it all she said, \"There's no way I could have figured out how to play that game from the rule book.\"]\n\nBut I digress. I think the simple way to avoid problems like the one above is to adjust the table talk rules to say that you can only discuss cards that are in play or in discard piles. Even then it gets hairy when two teammates want Theodred's resources and they each want to justify it, but at least it puts you one step farther from being able to refer to that pointy-hatted, white-bearded helper you'd like to play.\n\nOf course, such a rule would be a house rule and most people, myself included, seem to try to avoid house rules. I'm just thinking this may have been a better way to set up table talk rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598465","commentId":598465,"userName":"starhawk77","timestamp":1330099752,"content":"Some of the table talk issues have a lot to do with a limited card pool. If you are playing Spirit and say, \"Don't worry--I can cancel a shadow effect,\" you're essentially admitting that you have a copy of Hasty Stroke (since it's currently the only Spirit card that cancels shadow effects). Once we get more cards that perform similar functions, it will be much easier to respect the printed table talk rules; that same \"Don't worry\" could mean you have Hasty Stroke, Unreleased Card X, Unreleased Card Y, etc. Right now, though, it's practically impossible to develop a collective strategy without implicitly describing certain cards in your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598518","commentId":598518,"userName":"booored","timestamp":1330111990,"content":"This is a very interesting topic. I LOVE the table talk rule.. in fact I think it is one of the best game designs in the entire game.\n\nWhen you play a co-op game, especially if you are playing with a \"pro\" player, one player ends up running the game. Even in games were there are a lot of people who are experienced a more forceful player will end up directing much of the game.\n\nOne of the great problems for people coming to this game from a CCG perspective is that the encounter deck can not surprise you really, not in the same way a player you are facing can pull off some awesome combo. This entire feeling of the card game is gone, making LoTR rather flat experience for many experienced players. The table talk rule brings that right back. You suddenly have to have confidence in your partner to make correct decisions, at the moment of death he comes in and saves the day etc etc.. everything about this rule is awesome.\n\nI really think strict table talk rules greatly improves the fun and excitement of this game as well as giving a real feeling of cooperation, your game partners suddenly become independent players that save your butt and do amazing things, instead of just basically being a robotic control for a 2nd or 3rd deck.\n\nI play with 3 different groups and also play solo now and then. I have a regular 3 player game and 2 2 player games. We only adhere to the table talk rule in 2 of those groups.\n\nAs for the rules, we feel that the manual is to lenient. Our main rule is that you can not say ANYTHING about ANYTHING in your hand. You can only talk about things on the table itself. here is a short summery of the rules we use.\n\n1) - No talking of any card that is not directly on the table. No nick names, alternative names, quoting cards cost, takeable about effect... nothing.. if it is in your hand, you can not talk about it in ANY way.\n\nExamples of talk NOT acceptable. \"Look, do not worry about that locations threat, we will not be counting it\" / \"It is cool, engage that guy, he will not be attacking you this turn\" / \"Well I can drop your threat by 6 soon anyway\" / \"I have a 4 cost card that will sort that guy out!'\n\netc etc.. I think you get the point.. NOTHING, as in not trying to cheat it and get around it using some kind of lawyer like talk... .. you just are NOT able to talk about cards not on the table in anyway.\n\n2) - A card is \"on the table\" at the point of casting. So if you play a attachment like say unexpected courage, the decision for the target is soly on the play tat cast it. you can not place it on the table, then go.. OK.. who wants this.. you need to play it directly on the card.. same for event effects.\n\n3) - All scrying functions are 100% private. Denathor, or the quest effects in Hunt for gollum... these are not group decisions and can not be discussed.\n\n4) - Deck reveals are only to the play with the effect, so when searching for a song for example the other players can not see your cards.\n\n5) - if a table talk rule is broken the card in question is instantly discarded.\n\nThese are the main rules I can think of right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598552","commentId":598552,"userName":"dcdennis","timestamp":1330125795,"content":" I must say, this sounds about as much fun as a scrotal rash.\n\n \n\nHere is the counter point, This is how we play.\n\n \n\nFirst we make a trip to the liquor store. On the way back we stop at the pho noodle house to get in the right mindset. 15 beers later we have just enough energy to buttsects a hill troll before passing out on the kitchen floor, arms reach of the fridge.\n\n \n\nSlightly different mentality, but I bet your ass doesn't hurt when you wake up the next morning after all YOUR games!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=598563","commentId":598563,"userName":"starhawk77","timestamp":1330132332,"content":"booored said:\n\nOne of the great problems for people coming to this game from a CCG perspective is that the encounter deck can not surprise you really, not in the same way a player you are facing can pull off some awesome combo. This entire feeling of the card game is gone, making LoTR rather flat experience for many experienced players. The table talk rule brings that right back. You suddenly have to have confidence in your partner to make correct decisions, at the moment of death he comes in and saves the day etc etc.. everything about this rule is awesome.\n\n\n\nI think this is a very good point. It's also a large part of why I think the game is so much better with two or more players than as a solo experience. If you abide by the table talk rules, the game develops a wonderful sense of tension and risk as you debate just how much you can rely on the other players. In a solo game, that terrific dynamic is lost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=600058","commentId":600058,"userName":"Rashley","timestamp":1330449573,"content":"I agree with all those above that say it is a matter of taste for your own 'fun' level.  You will find the better players or stronger willed ones dominating newer or weaker willed players if 'table talk' gets too intense.  I made a comment way way back when tthe game first announced that \"Why have individual hands of cards if the game is fully cooperative?\"  Now I know.  On the whole, I think the more you allow 'discussion', the easier the game becomes.  Imagine a game where no discussion or talk was allowed!  Yes, a bit boring, but having to make individual decisions that affect the whole group without any knowledge of what the other players could do, is a big strain.  Think about the scenario where the party as a whole can only PLAY one ally.  Turn order would be crucial.  There seems to be a lot of discussions about wether the game is getting 'too easy' or multi-play is much easier than solo etc.  Maybe the designers left the 'table talk' issue vague to allow the players to adjust their play accordingly.  There we are, right back to where we started.  Do what YOU like!  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=600245","commentId":600245,"userName":"BiJay","timestamp":1330493181,"content":"I don't care about that rule. For me sharing informations is a big part of a cooperative game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=600290","commentId":600290,"userName":"dcdennis","timestamp":1330507048,"content":" ya those pesky rules. i dont like the shadows rule so i dont follow that one either. also, in a 4 player game we only deal 1 encounter card per turn cuz that rule doesn't make sense. we also play attachments during combat phase and add 2 resources per hero each turn. RULES!??? PPFFT! Who needs em!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=600302","commentId":600302,"userName":"BiJay","timestamp":1330509529,"content":"It seems like you're not taking me seriously. In my opinion it's no difference between saying exactly which card I have or describing it because in the end my partner will have the same information, except the second choice makes it harder for new players. For me discussing the next move is quite important in a cooperative game and it feels more practicable to say exactly which cards I have at my disposal than to think how I can describe it without breaking the table talk rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=600347","commentId":600347,"userName":"dcdennis","timestamp":1330516514,"content":" I understand you just fine. What I am pointing out is that the table talk rule is no different than the shadow card rule, and if you are going to break one, why not break them all? The rules aren't in categories of 'you have to follow these' and 'these are less important and optional rules'. Of course moves are easier to plan out when you know exactly what your partner has, that is the WHOLE POINT of the table talk rule. And no, saying that you can handle the top card of the encounter deck does not reveal what is in your hand. Maybe I have a cancel, maybe I have gandalf, you don't know. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=600492","commentId":600492,"userName":"BiJay","timestamp":1330533004,"content":"Why should I break all rules? As I stated the table talk rule doesn't matter that much because you can just describe it (\"the old man with the staff is coming\" or whatever) and that's because how loosy it is written in the rules. And as I don't see the fun in thinking of how to describe it I just ignore this rule. For me it makes the game better. Ignoring the shadow effect rule wouldn't make the game better at all because it is a fundamental rule. So both rules are not the same at all.\n\nChanging the initial rules is nothing special and happens quite often in other games, e.g. in tournaments or by house rules. In my opinion it makes the game better for me and my partner (and I don't mean easier but less annoying)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=601323","commentId":601323,"userName":"player1572433","timestamp":1330695607,"content":" Me any my friends try not to break it unless we are about to be wiped out, in which case we say things like \"I can make that guy not attack this turn\" or \"Ok, let those 3 come to me and I'll take care of everyone thus round.\" etc. It's not as fun to play when everyone knows what everyone else is hold."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=601479","commentId":601479,"userName":"booored","timestamp":1330731625,"content":"BiJay said:\n\nWhy should I break all rules? As I stated the table talk rule doesn't matter that much because you can just describe it (\"the old man with the staff is coming\" or whatever) and that's because how loosy it is written in the rules. And as I don't see the fun in thinking of how to describe it I just ignore this rule. For me it makes the game better. Ignoring the shadow effect rule wouldn't make the game better at all because it is a fundamental rule. So both rules are not the same at all.\n\nThat is why we house rule that you can not say anything at all about cards not on the table. This really increases the skill level of teh players and makes you feel that it si truly co-operative. There is plenty of talk and planing on the table, but in teh end you are relying on your partner to make the correct calls.. This makes is feel more co-op to me.. plus it is way more exciting and fun to play,.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=601590","commentId":601590,"userName":"qwertyuiop","timestamp":1330762496,"content":"I haven't found a reason to engage in table talk that risks crossing a line. The person I play with keeps tabs on what my cards in play can do, and I do the same. We monitor the number of cards in each other's hands. The only time discussion really comes into play is for choosing optional engagements and deciding if and where to travel.  But, I only play solo or with one other player. Three and four player games don't interest me since I haven't played a scenario that demands many players.  \n\n Actively trying to bend table talk rules by giving not so subtle clues as to what is in a player's hand is a scrub move. The game already provides training wheels in the scenario, Passage Through Mirkwood. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=602290","commentId":602290,"userName":"dcdennis","timestamp":1330944560,"content":" You don't even discuss who you are committing to a quest? To me that is the most important decision each round and requires heavy discussion. And since it only involves cards on the table there are no rules to break."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=603154","commentId":603154,"userName":"Prof_werewolf","timestamp":1331115999,"content":"When I first did an introductory teaching game with a friend of mine, we did plenty of talking. This just seemed basic, as he was used to the CoC gameplay and some of the LOTR rules were a little confusing to him at first. After that, we pretty much kept the table talk down to a minimum. Really, I think it's just a matter of the group and what they want to get out of the game. I've seen groups chatter on about different strategies and I've seen groups pretty much keep quiet throughout the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=603311","commentId":603311,"userName":"qwertyuiop","timestamp":1331140448,"content":"dh098017 said:\n\n You don't even discuss who you are committing to a quest? To me that is the most important decision each round and requires heavy discussion. And since it only involves cards on the table there are no rules to break.\n\n\n\nI agree that it's probably the most important decision each round, and it probably warrants discussion, but the people in my playgroup don't do it.  And since the information is public, I can't really fault anyone who wants to discuss it. I dunno, it just adds to the challenge, and in some instances creates a challenge. It helps us learn to read our teammates, who in front of another board will be an opponent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=603387","commentId":603387,"userName":"Budgernaut","timestamp":1331157444,"content":" Last night I played the new Asia expansion to Ticket to Ride. It has rules for team play so my wife and I played against another couple. One of the rules in there was that you can talk about anything except strategy. So you couldn't tell your partner to build here, or play that card, or to try and get the longest route. It was quite intense and the entire time I was thinking about the table talk rule for this game. I think the table talk rule really needs to scale with player experience. Less experienced players will have all sorts of rules questions (if you don't believe me see the unofficial FAQ) and often resolving those issues will mean you know what's in their hand when you really shouldn't. But I would hold experienced players to a much higher standard. My wife and I were really familiar with Ticket to Ride so we were able to do alright without discussion. Now I'm excited to try that kind of strict table talk rule with an experienced LotR player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=603632","commentId":603632,"userName":"The_Fallen_Arises","timestamp":1331205873,"content":" Excellent thread !\n\nI would say I usually skim the line, and I sometimes cross it.  Anything hinting at what you can do (without naming the card or saying specifically what you can do) is fair game...such as : «don't worry too much about the staging step» or «I'll take care of the monsters I have what I need».\n\nAs another forumite said, the pool of card is limited so right now people guess easily which card a player might have in his hand, but eventually this kind of subtle hint won't be too revealing as the card pool grows.\n\nI admit I need to repress a bad habit I got : paying for an attachement, showing it then hesitating (hence starting a debate on which character should get it). It's also hard to resist the urge to say too much about a card seen thanks to an ability like Denethor's.\n\nOverall though, I'd say talking about strategy, conferring on which heroes should go questing before committing everyone or talking about who should engage which monster is legit enough. This game can be ruthless, so players need all the help they can get.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=603785","commentId":603785,"userName":"ragnarhedin","timestamp":1331233448,"content":"My roommate and I do a fair amount of table talk by this thread's standards.  I view the cooperative nature of the game as including strategizing how to best deal with a difficult quest. Generally we don't talk about what cards we have in our hands, but do indicate when shadow cards or treachery won't be an issue. \n\nI don't consider discussing who is going questing as table talk, that's just playing the game.  If I had to sit silently during the game I would go crazy; the game can be so brutal that it would mean dozens of frustrated failures while hoping to get lucky draws."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60977-table-talk-how-far-do-you-push-the-envelop/?do=findComment&comment=603844","commentId":603844,"userName":"booored","timestamp":1331257276,"content":"There is no \"correct\" way... it is just something to do to make the game more fun. I think playing in silence is going to far.. that wouldn't be fun for me, but I also think that not talking in anyway about your hand (like the rules I posted b4) makes the game way way way more fun. It is like all about having a good game experience.\n\nThe \"muddy\" part of this is when people talk about the fictional \"tournament scene\" as this rule will need to be solidified and worse worked out how to be enforced."}]}