{"url":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/","title":"has anyone experimented with different variants for single player?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598339","commentId":598339,"userName":"Howlix","timestamp":1330083672,"content":"Topic\n\nSince some of the quests seem to me to be far too difficult for a single player to tackle on their own has anyone experimented with a variant to help accomplish these quests.  Obviously it would be just for fun as you couldn't score it officially.  I'm thinking maybe adding more heros and increasing the threat cap but I don't know.  I also don't know anything about the cards past the core set at this point so it may be possible to tackle these quests with cards I don't yet have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598343","commentId":598343,"userName":"dcdennis","timestamp":1330084092,"content":" Playing with just the core is very restrictive. Each sphere only has 11-13 unique cards. Once you get the x-pac and some of the adventure packs I bet you'll change you mind. Tough? Yes. But oh so satisfying when you win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598355","commentId":598355,"userName":"richsabre","timestamp":1330085873,"content":"note: this is meant to sound like im being a d**k.....i play solo, and have done since just the core cards were available, so should know how hard it can be at times but...\n\n my advice, stick with it, you're are obviously new, ALL players find this solo hard at the start, and i mean everyone. you get better with\n\n1.practice practice practice\n\n2.better card pool\n\n3.strategy and tips found on here-----infact if you head over to the strategy subforum, i have started 2 threads of the two core sets quests, anduin and dol guldur, and have collected a list of tips from other players\n\n4.different quests are easier than others solo\n\nlastly i wouldnt ever recommend messing this up with variants- its a living card game, if you make your own rules- how do you know that some new official keyword or rule wont completely mess it up in the future? then youll be stuck not being able to play a game youve invested in, as you havnt learnt the 'official'rules for solo. in thise upcoming cycle we already have at least 3 new keywords, and 1 of them is quite major.\n\nalso dont let anyone tell you, you need multiple core sets to win- you dont, thats not opinion, thats fact\n\nstick with it\n\nask questions\n\nlose alot until you get your first win\n\nand it will be all the more sweet\n\n i promise you, you will get that 'breakthrough' where it all makes sense, and you can win certain quests with your eyes closed\n\nif all else fails and you really dont like this i know several players play with 2 decks and play the '2nd' players, this is about the safest you can get with house ruling\n\nsomeone will probably start arguing against this but oh well, its just my opinion :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598362","commentId":598362,"userName":"Budgernaut","timestamp":1330086718,"content":" The simplest variant is to ignore rules. I'm not advocating that you ignore rules intentionally, but I've found that there are many times when I'm excited about beating a scenario only to learn that I wouldn't have won if I had remembered \"that one rule\" that I forgot about. When I play again I can remember to enforce that rule, which makes it harder, but I understand the scenario better which makes it a little easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598365","commentId":598365,"userName":"richsabre","timestamp":1330086972,"content":"Budgernaut said:\n\n \n\n The simplest variant is to ignore rules. I'm not advocating that you ignore rules intentionally, but I've found that there are many times when I'm excited about beating a scenario only to learn that I wouldn't have won if I had remembered \"that one rule\" that I forgot about. When I play again I can remember to enforce that rule, which makes it harder, but I understand the scenario better which makes it a little easier.\n\n \n\n \n\nwish i had £1 for everyime thats happened gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif].....well id have about a fiver....but you get my point haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598381","commentId":598381,"userName":"Bomb","timestamp":1330089234,"content":"I was playing Journey to Anduin solo and started to forget to reveal an additional card when I reached 2B.  I was doing so well before I forgot to do that and it just shot all my confidence knowing I had played 2-3 rounds incorrectly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598402","commentId":598402,"userName":"Memetix","timestamp":1330091181,"content":"I'd recommend the variant mentioned in the rules where you don't deal shadow cards to attacking enemies. Its a food way to learn the game and then go back to the core rules when your playing skill has increased."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598512","commentId":598512,"userName":"booored","timestamp":1330109938,"content":"Memetix said:\n\nI'd recommend the variant mentioned in the rules where you don't deal shadow cards to attacking enemies. Its a food way to learn the game and then go back to the core rules when your playing skill has increased.\n\n\n\nNo do not do this, not only dose it completely remove a entire mechanic from the game but it also makes a large number of player cards useless so if you ever wish to move to \"real\" rules your decks will be useless.\n\nThe best idea, imo, is to modify it by a quest by quest bases. Some common ones are\n\nReturn to Mirkwood: Gollum only adds 1 or 2 extar threat a turn instead of 3, and that location that drops threat affects you are well.\n\naJTR - Wyndaldor only gains 1 wound a turn, and/or starts with no wounds/1wound.\n\nEscape from Gol Dol Gur - Player chooses hero to be captured, instead of random.\n\nMassing - Randomly reveal chose 2 scouts to start instead of three and/or remove 1 set of scouts form the deck.\n\nI think the Return and aJTR rules are really good and greatly improve the solo game experience. Especially in return. That quest is so lame. Escape is much much easier now after Ziggy, and is really not a problem for solo players anymore, so this variant is not really needed anymore.. but worth a try if you are having trouble.\n\nMassing one I have nvr used, this quest shouldn't be impossible.\n\nJust remember that this game is designed for deck building, so if you are trying to play with a single copy of core the game will be super hard... you simply do not have the cards top really cpo[e with what the encounter deck brings you.\n\nStill these variants are worth trying if you need help, the main thing is that they do not alter anything about the core game mechanics or change anything to do with how you build and create decks for that scenario, so you can seamlessly transition into \"real\" games.\n\nThe best variants of course are the ones you make up yourself. Just play they game get a feel for what YOU feel unfair and change it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598516","commentId":598516,"userName":"cordeirooo","timestamp":1330111413,"content":"I played both 5-Heroes and Expanded Keywords, and can say that both are awesome to play when you want to try something new.\nOther idea is simple to play scenarios that you didn't played with other decks, like, if you were successful in Anduin with a Spirit/Tactics deck, try now a different one; say tactics/lore, leadership/lore, spirit/leadership or even a tri-sphere.\n\n \n\nIf you're eager to play something different and already played all official quests, you can always try custom-made.\nWhile I do make some custom-scenarios, you should try ninjadorg's and Memetix's first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598520","commentId":598520,"userName":"booored","timestamp":1330112054,"content":"you play with 5 heroes?!!!! wtf.. do you EVER loose? Still this is kinda the point... it is not a compeditive game.. so do w/e you like to have fun.. even somthign as crazy as playign 5 heroes or not uising shadow cards. if you are having fun.. then awesome.. and you can always goto official rules latter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598529","commentId":598529,"userName":"cordeirooo","timestamp":1330116009,"content":"booored said:\n\n \n\nyou play with 5 heroes?!!!! wtf.. do you EVER loose? Still this is kinda the point... it is not a compeditive game.. so do w/e you like to have fun.. even somthign as crazy as playign 5 heroes or not uising shadow cards. if you are having fun.. then awesome.. and you can always goto official rules latter.\n\n \n\n \n\n \n 5-Heroes is a variant for single play (oh look! Isn't the title of this thread something like this?) posted on BGG where you play only one deck with 5 heroes instead of two decks (and thus, 6 total heroes). It is fun, you should try.\n\n \n\nAnd... well, yes, I do lose sometimes and I do not play that variant with frequency."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598537","commentId":598537,"userName":"Howlix","timestamp":1330119236,"content":"I suppose this thread was brought on by some threads that I had skimmed over in other places which had pretty much stated any quests above level 4 were nigh impossible solo.  Gears started turning and I thought about adding an extra hero or increasing the threat cap to compensate slightly for not having a second player to learn the game with.  Looking at it now through some [spectacles of experience +1]  I can see that the answer is multi-sphere decks and new cards from expansions.  I'm not sure at this point if I will allow myself to buy any expansions until I've actually worked out a way to beat all three core scenarios with the included cards.  At any rate it's the challenge I'm giving myself so we will see what I can do with it this weekend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598561","commentId":598561,"userName":"booored","timestamp":1330131873,"content":"Howlix said:\n\nI suppose this thread was brought on by some threads that I had skimmed over in other places which had pretty much stated any quests above level 4 were nigh impossible solo. \n\n\n\nthat is complete rubbish. Though it is getting harder and harder to tell as people have very different card pools now.. like someone might be going AHHH Gul Dol-Gor is so hard and your like /.. w/e it is so not anymore... and then you find out they are trying with a single copy of core... in witch case it IS impossible.\n\nEvery quest is beatable, most with little problem, even using teh restricted card pools. Exceptions are Return, Escape and Journey. Though with decent card pools these are getting easier and easier. Everything else is not a problem. The Khaz quests are cool as they are really fun solo and not very hard, though I have a full set of cards to play with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598611","commentId":598611,"userName":"richsabre","timestamp":1330154051,"content":"booored said:\n\nHowlix said:\n\n \n\nI suppose this thread was brought on by some threads that I had skimmed over in other places which had pretty much stated any quests above level 4 were nigh impossible solo. \n\n \n\n \n\nthat is complete rubbish. Though it is getting harder and harder to tell as people have very different card pools now.. like someone might be going AHHH Gul Dol-Gor is so hard and your like /.. w/e it is so not anymore... and then you find out they are trying with a single copy of core... in witch case it IS impossible.\n\nEvery quest is beatable, most with little problem, even using teh restricted card pools. Exceptions are Return, Escape and Journey. Though with decent card pools these are getting easier and easier. Everything else is not a problem. The Khaz quests are cool as they are really fun solo and not very hard, though I have a full set of cards to play with.\n\n\n\nyes agreed, this is why is go to great lengths to tell new comers to the game to stick with solo for a while before they start toying with it- there are alot of misleading threads out there that have been posted by people who were new or just a bit confused on how to play the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/60981-has-anyone-experimented-with-different-variants-for-single-player/?do=findComment&comment=598704","commentId":598704,"userName":"Glaurung","timestamp":1330175102,"content":"House rules is up to you but i think we must trust designers and help them with our experience to make game better.\n\nAnyway game now better then before. For me game now is quite good for solo play.\n\nIn my opinion 2 players game is still to easy for players who have already good experience with game( i play right from the start). For example my friend and me play every sunday 2 players game. So we never make decks working together in combination. We just play each his own solo deck in coop game. And we lose very rare! Maybe from 10 game we lose 2( we play only scenarios with difficult level 6 or more including Osgiliath). So if we make 2 good decks combine together i  pretty sure we will lose 1 game from 20. So this is quite boring no? And there is no option to make game level more difficult without start to change the rules....And this is a biggest problem of this game! I dont wont for example limit my self with the card pool or with heroes choice and limit my deck (less then 3 copies of the powerful cards) I want to have good challenge for my current strong deck and my friend deck. But for now is impossible!!!\n\nI really hope situation with 2 players game will change and experienced players will also get challenge!\n\n "}]}