{"url":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/","title":"Progress Tokens and Locations","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=598840","commentId":598840,"userName":"Irongut","timestamp":1330220598,"content":"Sorry if this is a noob questions, but I couldn't find my answer in the rulebook, forums, or FAQ.  I'm sure I missed it, but hope someone could still help me out.\n\nMy question is once I've put enough progress tokens to complete exploration of a current location, do the progress tokens on that location card get returned to the bank or do the progress tokens move over to the quest card?\n\nI feel like I'm doing something wrong.  It seems progress tokens are so hard to get, that to just toss them is too painful.  The don't seem to say anything other than extra tokens can be placed on the quest card.  That implies to me that the progress tokens on the current location are lost once the tokens add up to the needed amount.  But I could be wrong.\n\nAny help is much appreciated!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=598846","commentId":598846,"userName":"starhawk77","timestamp":1330221903,"content":"Once the active location has as many progress tokens as it has quest points, it is immediately discarded from play (see p. 15 of the rule book). Extra progress tokens spill over to the active quest card, but all the rest are returned to the token bank.\n\nExample: Old Forest Road is the active location, with 1 progress token already on it. You quest successfully with enough willpower to place 4 progress tokens on the current quest. 2 of those will go towards exploring Old Forest Road. Since it now has 3 progress tokens (equal to its quest point value), Old Forest Road is explored and immediately discarded. Any progress tokens on Old Forest Road are returned to the token bank. Then, the remaining 2 progress tokens from the earlier quest resolution can be placed on the current quest card.\n\nIn short, the progress tokens used to explore active locations do NOT carry over to the quest card; only excess tokens do so.\n\nAlso note that this only holds true for active locations. If you explore a location in the staging area by adding progress tokens in excess of that location's quest point value, the extra tokens don't go on the quest card. Instead, all of the tokens simply return to the token bank."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=599032","commentId":599032,"userName":"Irongut","timestamp":1330263907,"content":"Thank you for the reply and clarification.  So I played the rule correctly, which is good.  I was just hoping for an easy out! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif] \n\nI didn't realize that I could put progress tokens on locations in the staging area.  I assume that is a strategy for handling locations that have bad effects when they become active locations.  I also assume that once a location this the staging area has its quest points total met then it can be sent to the discard pile.\n\nThanks again for the help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=599040","commentId":599040,"userName":"richsabre","timestamp":1330264235,"content":"Irongut said:\n\nThank you for the reply and clarification.  So I played the rule correctly, which is good.  I was just hoping for an easy out! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif] \n\nI didn't realize that I could put progress tokens on locations in the staging area.  I assume that is a strategy for handling locations that have bad effects when they become active locations.  I also assume that once a location this the staging area has its quest points total met then it can be sent to the discard pile.\n\nThanks again for the help.\n\n\n\nyes, northern tracker for instance places a token on each one in the staging area- once they have the required amount on them they are immeditly discarded"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=599245","commentId":599245,"userName":"booored","timestamp":1330316133,"content":"There is some rule confusion here that is understandable as in classic LoTR style they have completely ****** up the wording. For example.. the key phrase \"current quest\" means both the QUEST and the Current Location, but the location takes precedence over the quest card. While when you break it down it makes sense but it is not intuitive as there is a big massive QUEST you are trying to be with a QUEST card... I can nto think of the cards right now but there are some that do effect the quest card only even if there is a location in play.... really lame.\n\nStill most cards like GUIDER and TRACKER will say active location or staging area. so they are not confusing. You can add tokens to any location if you have a card that lets you... in the Official FAQ the position on clearing these tokens is affirmed.. as soon as the location card has the correct number of tokens it is discarded at response speed.. as in immediately. So for example, northern tracker can clear a location as he quests but before the threat is calculated, for as soon as the card taps locations can be removed. This same effect is on quest cards, as soon as the card is cleared the flip or win the game.. it is a instant thing,, you need to be careful with this as flipping a quest card to the next stage can sometimes have a weird effect that is alll calculated at the point of placing the tokens.\n\nThe last thing about quest tokens is that if you clear a active location and have left over tokens they go on the quest, but if you clear a quest and have left over tokens they are discarded. Oh and one more thing, if the quest card is not flipped after you get the correct amount of tokens cause of some card effect, you still add tokens during quest phase, even idf it is past the required number.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=599726","commentId":599726,"userName":"scottindeed","timestamp":1330400352,"content":"I think the general rule is any effect that puts progress tokens onto a Quest Card, first goes to the Active Location.  Any effect that takes progress tokens off of the current Quest Card (such as Misty Mountain Goblins), takes them straight from the Quest Card and not the Active Location.\n\nA useful exception to the Progress Tokens spilling over onto the next Quest Card is Legolas with Blade of Gondolin.  As each effect is a response you can trigger one of the responses after the current Quest card is discarded.\n\ne.g.  Legolas with Blade of Gondolin destroys an enemy.  The current Quest Card only needs one more point of progress before it is defeated.  Legolas triggers the Blade of Gondolin effect first, placing a progress token on the current Quest Card and then discards that Quest Card.  The next Quest Card is revealed and any instructions followed.  Legolas can then trigger his own ability to place two tokens on the new Quest Card.\n\nI managed to completely bypass one of the stages of Return To Mirkwood using the above combo. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=599894","commentId":599894,"userName":"riconos","timestamp":1330428585,"content":" i also have a question regarding an issue i have encountered.\n\ni was playing a game with the tactics deck and cam up across the following scenario. i was having an active location where i have traveled and for the following 3 turns i revealed from the encountered deck only location cards. my characters are having only 3 willpower and the locations have a threat of 7 which is pretty high. in this situation it is also imposible for me to finish the game. is there a special rule that you can place progress tokens on the location without overcomming the threat of the staging area which in this case is allmost impossible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=599901","commentId":599901,"userName":"richsabre","timestamp":1330429414,"content":"riconos said:\n\n i also have a question regarding an issue i have encountered.\n\ni was playing a game with the tactics deck and cam up across the following scenario. i was having an active location where i have traveled and for the following 3 turns i revealed from the encountered deck only location cards. my characters are having only 3 willpower and the locations have a threat of 7 which is pretty high. in this situation it is also imposible for me to finish the game. is there a special rule that you can place progress tokens on the location without overcomming the threat of the staging area which in this case is allmost impossible.\n\n\n\nmmmmm thats a tough one, there are some cards however that can help, Ride to ruin places 3 progress token on a location after discarding a rohan ally, the riddermarks finest places 2 progress tokens on a location after you discard it- so there are some, those two by the way are in emyn muil pack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=600021","commentId":600021,"userName":"booored","timestamp":1330442836,"content":"scottindeed said:\n\nA useful exception to the Progress Tokens spilling over onto the next Quest Card is Legolas with Blade of Gondolin. As each effect is a response you can trigger one of the responses after the current Quest card is discarded.\n\ne.g. Legolas with Blade of Gondolin destroys an enemy. The current Quest Card only needs one more point of progress before it is defeated. Legolas triggers the Blade of Gondolin effect first, placing a progress token on the current Quest Card and then discards that Quest Card. The next Quest Card is revealed and any instructions followed. Legolas can then trigger his own ability to place two tokens on the new Quest Card.\n\n\n\nI am not 100% sure I agree with this. I can see what you are saying here, but the \"cost\" of the blade (as in killing the mob) is instant.. so you have to trigger both blades at the exact same time, there is no time for staggering. Remember there is no stack.. so triggering one after the other doesn't place them in a stacking order like many other ccgs. So the cost of the killed monster occurs, you then choose to active the blades... all at response speed.. all at the very exact same time.. meaning the progress token are all placed in one go, exactly the same way they are during questing.\n\nSo yeah, I can see what you are saying but I am pretty sure that this is incorrect and that you can not use blade in this manner you are talking about.\n\n \n\nriconos said:\n\n i also have a question regarding an issue i have encountered.\n\ni was playing a game with the tactics deck and cam up across the following scenario. i was having an active location where i have traveled and for the following 3 turns i revealed from the encountered deck only location cards. my characters are having only 3 willpower and the locations have a threat of 7 which is pretty high. in this situation it is also imposible for me to finish the game. is there a special rule that you can place progress tokens on the location without overcomming the threat of the staging area which in this case is allmost impossible.\n\n\n\nThere is Lorin Guide it places tokens on the active location I think this card is often under valued. Also so dose the blades and legolas we are talking about as well. This might be a good choice for you as tactics is a weak questing sphere, but the blades and legolas adding 4 tokens a kill can make tactics a very powerful quester, especially when you are under the weather and can not get your will high, as it will place tokens regardless...\n\nAlso as rich said there are a number of ways to place tokens with events. All of these are pretty good, there is even a new one in khaz that places a whopping 4 tokens ... pretty crazy.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=600032","commentId":600032,"userName":"Budgernaut","timestamp":1330445361,"content":"booored said:\n\nscottindeed said:\n\nA useful exception to the Progress Tokens spilling over onto the next Quest Card is Legolas with Blade of Gondolin. As each effect is a response you can trigger one of the responses after the current Quest card is discarded.\n\n \n\ne.g. Legolas with Blade of Gondolin destroys an enemy. The current Quest Card only needs one more point of progress before it is defeated. Legolas triggers the Blade of Gondolin effect first, placing a progress token on the current Quest Card and then discards that Quest Card. The next Quest Card is revealed and any instructions followed. Legolas can then trigger his own ability to place two tokens on the new Quest Card.\n\n \n\n \n\nI am not 100% sure I agree with this. I can see what you are saying here, but the \"cost\" of the blade (as in killing the mob) is instant.. so you have to trigger both blades at the exact same time, there is no time for staggering. Remember there is no stack.. so triggering one after the other doesn't place them in a stacking order like many other ccgs. So the cost of the killed monster occurs, you then choose to active the blades... all at response speed.. all at the very exact same time.. meaning the progress token are all placed in one go, exactly the same way they are during questing.\n\nSo yeah, I can see what you are saying but I am pretty sure that this is incorrect and that you can not use blade in this manner you are talking about.\n\n\n\nSorry to be the bearer of bad news, Booored, but I believe the above interpretation came strait from the FAQ:\n\nQ. If Legolas has a Blade of Gondolin (CORE 39) and\ndestroys an enemy, can he trigger his response, finish\noff a quest card, and still place progress tokens on the\nnext quest with the Blade of Gondolin's response?\nA: Yes. Quest cards are immediately replaced as\nsoon as players place enough progress on them,\nand this replacement does not interrupt the current\nround sequence. If the current quest card only needs\n1 progress on it, then a player could also trigger\nthe Blade's effect first, and then Legolas' in order to\nmaximize the number of progress tokens placed. (There\nis no carry-over progress from an effect)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=600129","commentId":600129,"userName":"radiskull","timestamp":1330460881,"content":"In MtG, if you want to play a few things in response to a particular thing happening, you tend to play them all at once, and the stack sorts them out.\n\nIn these LGCs, if you want to play a few things, you must play one, resolve it completely, then play the next, resolve it, etc.  It's never possible to trigger two things \"at the same time\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=600438","commentId":600438,"userName":"booored","timestamp":1330526037,"content":"hmmm I find this extremely bad form. In every other situation if you place a handful of tokens they all hit the table at the same time, spilling over from location to quest, but not quest to quest.. yet in this one single case we have an exception.\n\nradiskull said:\n\nIn MtG, if you want to play a few things in response to a particular thing happening, you tend to play them all at once, and the stack sorts them out.\n\nIn these LGCs, if you want to play a few things, you must play one, resolve it completely, then play the next, resolve it, etc.  It's never possible to trigger two things \"at the same time\".\n\n\n\nhmm.. i see .. this marked this strange situation kinda make more sence... I have always played that effects that \"stack\" like in MTG simply occur at the same instant in time with no precedence over each other. Choosing the order makes no difference, they all resolve at the very same instant of time. I think you are right here...\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=600471","commentId":600471,"userName":"radiskull","timestamp":1330530353,"content":" If you place a handful of tokens from the same effect they hit the table at the same time (same with damage).  If multiple effects place tokens, they go off one at a time.\n\nTo get all computer-sciency, this game has something more akin to a queue than a stack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=600555","commentId":600555,"userName":"booored","timestamp":1330545352,"content":"yeah, but you are amusing that there is a \"que\" as you call it. I think the rules seam pretty clear that forced effects happen instantly all at the same time. there is no order, the blades \"should\" both trigger at the same time, putting counters in your hand at the same time.. not one after the other. Like obviously this is mute as Nate has said otherwise in the faq.. but it is IN the faq for a reason.. it is complexity counter intuitive to every other situation in the game.. witch is a really lame way of doing things.\n\nI mean it is not like this game isn't easy enough, and the more I read the forms the more I find that it is way way way WAY easier than I thought. This \"que\" as you call it makes so many cards suddenly ubr powerful"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61036-progress-tokens-and-locations/?do=findComment&comment=603131","commentId":603131,"userName":"Bomb","timestamp":1331111902,"content":"The difference is, the Blade of Gondolin are responses, which are optional.  While you are choosing to trigger Responses immediately after their condition is met, you don't resolve them all at the same time. \n\nSo, you trigger one Blade of Gondolin to place 1 progress token on the location/quest.  It must resolve completely before you choose to trigger the next Blade of Gondolin.  You don't choose to trigger all responses at once, and I don't think that makes much sense either.\n\nForced is not optional and I am not certain as to when two Forced effects would occur at the same time off the top of my head anyway."}]}