{"url":"https://community.fantasyflightgames.com/topic/61086-custom-quest-phase/","title":"Custom Quest Phase","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61086-custom-quest-phase/?do=findComment&comment=599309","commentId":599309,"userName":"Saramund","timestamp":1330328586,"content":"Hi,\nI and my friends felt the need to apply some changes to the rules.\nWe would like to share our testing results with the community.\nWe feel these customizations help improving the player's experience. Our goal was both to avoid the feeling that the bad luck was the only reason of our defeats and not to change the difficulty and the balance of the game.\n\nDuring the quest phase, if you draw a Treachery card already drawn before (and not cancelled) in the same quest phase, that card ability will not be applied but it takes Surge (i.e. just discard it and draw another).\nThis applies to Treachery cards with the same title name.\n\nIf you draw a Location card already in play you'll put it under the former. No traits or ability are doubled. Just Threat and Progress tokens needed.\n- if the Location is the Active Location, it will automatically add its progress token requisites to the former card.\n- if the Location is in the Stage area, it will add its Threat and Progress tokens needed.\nWhen the party travels to such a location, all Location cards move together, and the progress tokens needed are added.\n \n\nIn this way, we have achieved that:\n- when you travel to a location, all the same locations are travelled (we think it thematically makes more sense)\n- when you travel to multiple cards you decrease the threat very quick, but it takes longer to explore the active location\n- when you redraw a Treachery already played in the same quest, you get the chance to increase the threat instead, but you don't feel frustrated if you have just handled a treachery and see you need to face the same again.\n\nI hope we can get your feedback.\n\nThank you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61086-custom-quest-phase/?do=findComment&comment=599330","commentId":599330,"userName":"dcdennis","timestamp":1330331578,"content":" Gunna be brutally honest here so I apologize for that that in advance :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nReading the above sounds like you all got sick of losing, so you found a way to win without feeling like you were cheating, but that's pretty much what you're doing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61086-custom-quest-phase/?do=findComment&comment=599335","commentId":599335,"userName":"Saramund","timestamp":1330332337,"content":"that's not a problem.\n\nthank you!\n\nWe knew people would have seen things we didn't meant to get. But we like to get different point of views.\n\nBTW, we still lose and still wins without much difference till now (the encounter deck just reshuffle more), but we feel the encounter cards fits better in the play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61086-custom-quest-phase/?do=findComment&comment=599421","commentId":599421,"userName":"richsabre","timestamp":1330346502,"content":"despite me being a rule pureist (ignorant snob- whatever you want to call me lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]) i will say that its all about fun, so if it works for you then fine, however take note that the rules are ever being added to in this living card game, so what you come up with now, may be void a couple of cycles down the line\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61086-custom-quest-phase/?do=findComment&comment=599552","commentId":599552,"userName":"Budgernaut","timestamp":1330361845,"content":" How many people are you playing with? Unless you've got 3 or 4 players, it seems highly unlikely that you'd reveal the same Treachery card twice in the same phase. If you're playing with 3 or 4 people, it seems to me that you should have some flexibility in dealing with the encounters and it shouldn't be as hard as solo play. That's just my opinion.\n\nYour location idea is really neat. I like how it makes thematic sense. However, I don't think I'd ever play it because the threat build up from multiple locations can be a key obstacle of the game, in my opinion. I think the rule really does make things easier by 1) quickly reducing threat as you mentioned, especially when the revealed location is the same as the active location, and 2) prevents you from having to complete the travel effect if the active location is the same as the revealed location. Additionally, for later scenarios, like A Journey to Rhosgobel, if you pile up a bunch of Forest Grove, you're rule will remove them all but only allow you to draw one Athelas. That could be very problematic in that scenario. Not doubling the effects on the cards could be a punishment sometimes in addition to being a boon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61086-custom-quest-phase/?do=findComment&comment=599869","commentId":599869,"userName":"Saramund","timestamp":1330427138,"content":" thank you all!\n\n \n\nYes we typically play in 3-4.\n\nAnd yes, I think you are right: our changes generates more changes whenever you fit them in a specific quest."}]}