{"url":"https://community.fantasyflightgames.com/topic/61081-elfhelm/","title":"Elfhelm ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61081-elfhelm/?do=findComment&comment=599265","commentId":599265,"userName":"PESKPESK","timestamp":1330320639,"content":" \n\nElfhelm\nType: Ally Sphere: Spirit\nCost: 4\nWillpower: 1 Attack: 2 Defense: 2 Hit Points: 3\nRohan. Warrior.\nWhile Elfhelm is ready, he gains: \"Response: After your threat is raised as the result of questing unsuccessfully, or by an encounter or quest card effect, reduce your threat by 1.\"\n\n\nThe key here is what is a encounter?  Does the thread reduction kick in during the below?\n\n\n1) A Treachery card like A Frightened Beast?\n2) A Enemy like Hill Troll?\n3) A Enemy like Marsh Adder?\n4) A Location like First Hall?\n5) An Objective like Gandalf's Map?\n\n \n\nA Frightened Beast\nType: Treachery\nEncounter Set: Conflict at the Carrock\nWhen Revealed: Each player raises his threat by the total Threat of all cards in the staging area. Any player may choose to discard from play 1 Creature ally card he controls to cancel this effect.\n\nHill Troll\nType: Enemy\nEncounter Set: Wilderlands\nThreshold: 30\nThreat: 1 Attack: 6 Defense: 3 Hit Points: 9\nTroll.\nExcess combat damage dealt by Hill Troll (damage that is dealt beyond the remaining hit points of the character damaged by its attack) must be assigned as an increase to your threat.\n \n\nMarsh Adder\nType: Enemy\nEncounter Set: Wilderlands\nThreshold: 40\nThreat: 3 Attack: 4 Defense: 1 Hit Points: 7\nCreature.\nForced: Each time Marsh Adder attacks you, raise your threat by 1.\nVictory 3.\n\nFirst Hall\nType: Location\nEncounter Set: Into the Pit\nThreat: 2 Points: 2\nUnderground.\nTravel: Each player must raise his threat by 3 to travel here.\nForced: After First Hall leaves play as an explored location, add Bridge of Khazad-dum to the staging area.\n\nGandalf's Map\nType: Objective\nEncounter Set: Escape from Dol Guldur\nItem.\nGuarded. Restricted.\nAction: Raise your threat by 2 to claim this objective when it is free of encounters. When claimed, attach Gandalf's Map to a hero you control. (Counts as an attachment. If detached, return Gandalf's Map to the staging area.)\nAttached hero cannot attack or defend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61081-elfhelm/?do=findComment&comment=599269","commentId":599269,"userName":"richsabre","timestamp":1330321568,"content":"im pretty sure its all of them, encounter cards=treachery/enemy/location AND objective as per nates ruling\n\nthe only thing elfhelm cant use is refresh threat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61081-elfhelm/?do=findComment&comment=599271","commentId":599271,"userName":"starhawk77","timestamp":1330322260,"content":"richsabre said:\n\n \n\nim pretty sure its all of them, encounter cards=treachery/enemy/location AND objective as per nates ruling\n\nthe only thing elfhelm cant stop is refresh threat\n\n \n\n \n\nI agree, but I'd also point out Elfhelm can NOT reduce threat gained from effects like Boromir's. All of the above examples are encounter card effects, even those that are triggered by player actions (e.g. Gandalf's Map). Basically, if the threat gain occurs due to text on an enemy, location, treachery, or objective, Elfhelm's response can be triggered. Also note that Elfhelm will reduce threat gained from cards with the doomed keyword.\n\nAlong with the scenarios mentioned by the OP, Elfhelm essentially neutralizes Zigil Mineshaft. You take an action and trigger the Mineshaft's ability, raising your threat by 1 to put a progress token on the location. Then, Elfhelm's response reduces your threat by 1. Who needs Northern Tracker!gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] \n\nUltimately, I think Elfhelm is an under-appreciated card with quite a bit of utility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61081-elfhelm/?do=findComment&comment=599346","commentId":599346,"userName":"BiJay","timestamp":1330335108,"content":"An encounter is a card with the Sauron's eye on the back."}]}