{"url":"https://community.fantasyflightgames.com/topic/61314-playing-0-cost-cards-in-different-decks/","title":"Playing 0 cost cards in different decks?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61314-playing-0-cost-cards-in-different-decks/?do=findComment&comment=601319","commentId":601319,"userName":"player1572433","timestamp":1330695478,"content":" Ok, so say I have (for the sake that I just got that expansion in front of me) Brand son of Bain and I'm playing tactics with 2 other tactic heroes. \n\nI am wondering if I can play a 0 cost card from Leadership/Lore/Spirit without the matching hero type. Can I do this? I don't see why I can't since I do not need any resources to play the card I should be able to play it without any problems, right? \n\n \n\nLooking at it another way I suppose, if I have Radaghast out in a spirit deck and I play Meneldor's flight, (Cost 0 EVENT) is that a legal play? I assumed so till a friend told me he didn't think it was legal, which I don't understand why it wouldn't be as Radaghast can pay for beasts that are Tactic type without having a tactic hero out.\n\n \n\nThanks for any help in advance, I'm going to read the rulebook again to see if I missed something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61314-playing-0-cost-cards-in-different-decks/?do=findComment&comment=601332","commentId":601332,"userName":"richsabre","timestamp":1330696689,"content":"no you cannot, even though they are free you need either a hero of that sphere, or a hero with a song attatchment( or something like it)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61314-playing-0-cost-cards-in-different-decks/?do=findComment&comment=601335","commentId":601335,"userName":"radiskull","timestamp":1330697077,"content":"Additionally, Radagast can only pay for Creature cards, and Meneldor's Flight is not one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61314-playing-0-cost-cards-in-different-decks/?do=findComment&comment=601356","commentId":601356,"userName":"player1572433","timestamp":1330698853,"content":" Yes Rad, I understand that, was just giving an example.\n\n \n\nI swear this game has some of the dumbest rules I've ever seen for no real reason sometimes..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61314-playing-0-cost-cards-in-different-decks/?do=findComment&comment=601359","commentId":601359,"userName":"richsabre","timestamp":1330699045,"content":"if you oculd use 0 cost cards in any sphere, their power would fly up as theyd all be so much more useful, i.e. using rumour from the earth (lore) in any other sphere. that card is really useful as it is, however it requires lore.....lore's 'thing' is deck peeking, so it would be very very powerful, and a little wierd, to have that card available in a tactics deck for example\n\nsuch cards would be 1.neutral anyways and 2. probably too powerful to be free\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61314-playing-0-cost-cards-in-different-decks/?do=findComment&comment=601401","commentId":601401,"userName":"starhawk77","timestamp":1330708602,"content":"Just to wrap this up, here is the relevant rules text (from p. 12 of the rule book):\n\n\"Cards with a cost of zero do not require a resource to be spent in order to pay their cost, but they do require at least one hero under that player's control to have a resource icon that matches the card's sphere.\"\n\nSo, if you want to play a card like Meneldor's Flight, you need a hero with a Tactics icon. As rich mentioned, it's an important balancing mechanic. "}]}