{"url":"https://community.fantasyflightgames.com/topic/61355-two-questions-one-about-gollums-bite-and-one-about-the-riddermarks-finest/","title":"Two questions:  one about Gollum&#039;s Bite, and one about the Riddermark&#039;s Finest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61355-two-questions-one-about-gollums-bite-and-one-about-the-riddermarks-finest/?do=findComment&comment=601674","commentId":601674,"userName":"Nenya","timestamp":1330777566,"content":"1.  Gollum's Bite (Treachery.  When Revealed:  Deal 4 damage to a hero controlled by the player guarding Gollum.  That player must choose a new player to guard Gollum, if able.)  We are playing a 2 player game, Return to Mirkwood. We are on Quest card 2B  (The player guarding Gollum cannot commit characters to this quest . . .) The player not quarding Gollum commits characters to the quest.  Then Gollum's Bite is revealed from the encounter deck.  A hero of the player guarding Gollum takes 4 damage (Glorfindel in this case), and  gives Gollum to the other (the questing) player.  Do the characters which this player had previously committed to the quest remain committed (and exhausted)? And in the quest resolution, are their willplower values still counted?  If not, we quest unsuccessfully,  Gollum escapes and we lose!\n\n2.  If there are no location cards in play, can one use the action of The Riddermar's Finest (Exhaust and discard The Riddermark's Finest to place 2 progress tokens on any location) on the quest card?  In other words, is the quest card a location?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61355-two-questions-one-about-gollums-bite-and-one-about-the-riddermarks-finest/?do=findComment&comment=601685","commentId":601685,"userName":"radiskull","timestamp":1330779247,"content":" 1. The other player had previously committed characters before Gollum showed up, so they would remain committed.  \n\n2. The quest card is not a location.  Riddermark will not work if there is not a location in play."}]}