{"url":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/","title":"How do you store your cards?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601806","commentId":601806,"userName":"GrandSpleen","timestamp":1330810396,"content":"The topic says it all.  I'm not thinking about sleeves, really, but how do you keep all the cards together in the box?  I just keep them in two piles: player cards and encounter cards (including quests).  At first I was using the small ziplock bags that come with the core set.  But once you buy even one adventure pack, you end up with more cards than will fit in there.  I've currently just rubber-banded them together, which seems fine if this were an ordinary deck of playing cards.  But I'm interested in preserving these over years, and the rubber band seems like it will eat into the sides of the cards.  Anyone have more experience with this than myself?\n\nThanks for replies!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601809","commentId":601809,"userName":"booored","timestamp":1330811074,"content":"See this thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=589211]\n\n \n\nI have been using home made tuckboxes for LoTR and dividers for CoC... i am nto 100% happy with either arrangement though they are a ton better then loose... I think the best solution is to pony up for the UltraPro card binders.... Here is a pic from that dudes ebay [http://www.ebay.com/itm/251009286591?ssPageName=STRK:MESELX:IT&_trksid=p3984.m1555.l2649]notice.\n\n \n\nBinders [http://www3.picturepush.com/photo/a/7713291/img/7713291.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601819","commentId":601819,"userName":"GrandSpleen","timestamp":1330813611,"content":"Thanks for the picture.  Are those stacks of cards, or is there one sleeve for one card?  In other words, when you want to play, do you need to take the cards out of the binder one by one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601822","commentId":601822,"userName":"booored","timestamp":1330814409,"content":"I am not sure I havn't got them but I would assume they are unsleeved and 3 per sections."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601832","commentId":601832,"userName":"xbluejayx","timestamp":1330824668,"content":" I use plastic zipper lunch bags to bundle/divide cards up by group symbol.  I also punch holes in the bags to provide better030312231210.jpg [http://imageshack.us/photo/my-images/24/030312231210.jpg/] ventilation. Also, I use the Keep it Dry moisture absorbing packs to keep mold away from my cards.  I live in a humid climate.  I had have my fair share of mold damage to games I once loved.  I change the Keep It Dry pack once every 3 months or so, or when needed.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601833","commentId":601833,"userName":"xbluejayx","timestamp":1330825217,"content":"xbluejayx said:\n\n I use plastic zipper lunch bags to bundle/divide cards up by group symbol.  I also punch holes in the bags to provide better030312231210.jpg [http://imageshack.us/photo/my-images/24/030312231210.jpg/] ventilation. Also, I use the Keep it Dry moisture absorbing packs to keep mold away from my cards.  I live in a humid climate.  I had have my fair share of mold damage to games I once loved.  I change the Keep It Dry pack once every 3 months or so, or when needed.  \n\n\n\n \n\nForgot to add that I store the core set cards and the expasnion cards in their retail box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601877","commentId":601877,"userName":"Sprenger","timestamp":1330844587,"content":"I turned the card board insert upside down in the core box. It can fit all your decks, encounter cards and all 6 adventure packs (including their boxes. I use Kazzad Dum to store my tokens and KD encounter cards. Though I am not sure what I going to do with the new adventure packs. I was kinda hoping Kazzad dum was going to be the same size as the core. I will post a picture of my storage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601935","commentId":601935,"userName":"Faradey","timestamp":1330857099,"content":"I flipped the insert of the Core set upside down and folded a couple of the little flaps away from the 2 big slots that will hold the cards, for a little extra room, as I sleeved all of my cards.\n\nI then cut a wide slot into the raised center part (using the holes on either side of the LotR logo as a guide, just cut from hole to hole). I store the extra cards from my second Core set, all of the rules/ads from the APs, all 4 threat trackers, the 2 'First Player' tokens and all of the progress/damage/resource tokens (those are in the plastic bags that held the threat tracker connectors and/or cards). That center slot holds all of that stuff perfectly.\n\nOn one side I have all of the quest/encounter cards divided into sections by quest/box. All core set quests and encounter cards, divider, AP, divider, AP, divider, AP, divider, AP, divider, AP, divider, AP, divider, Massing at Osgiliath, divider, KD. All of those cards fit in that one side. For dividers, I simply used the cardboard pieces that came with each AP (just had to trim about 1/4 inch off each).\n\nThe other side I have divided by heroes/sphere. Leadership heroes and cards, divider, Lore heroes and cards, divider, Spirit heroes and cards, divider, Tactics heroes and cards, divider, Neutral cards.\n\nI don't have a camera to take a pic of it, but I think you get the idea. Everything fits beautifully this way. I don't have the newest AP yet and I'm sure I'll need more room, so I may just use my second Core box and do the same process for the next cycle(s)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=601987","commentId":601987,"userName":"GrandSpleen","timestamp":1330871278,"content":"I am impressed with all the ingenuity around here!  I have to say, I was expected some kind of uniformity in responses, but it seems like everyone has their own unique way of storing things.  Thanks for the replies, and keep 'em coming if you've got something to add!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=602202","commentId":602202,"userName":"player1041350","timestamp":1330928154,"content":" I saw a box on Gameboardgeek that someone had done and copied that.  It stores all my adventure decks in it, then I store all my characters in the Kazad Dum box \n\nIf you want to have a look, I've uploaded it to flickr [http://www.flickr.com/photos/wheelz24/6742852403/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61377-how-do-you-store-your-cards/?do=findComment&comment=604114","commentId":604114,"userName":"qwertyuiop","timestamp":1331313253,"content":" I removed the insert from one of my core sets and use the whole box...mostly.  I sleeve the encounter decks from the APs(I like the Ultra Pro clear sleeves)  and place them back in the original packaging, then place the packs in my core set box.  I bagged the tokens, and have my player cards in the remaining space.  There's still a lot of room inside. I may turn to the binder method for player cards, but I intend to keep my encounter decks tucked in the AP boxes so I don't have to hunt down stray cards all the time. I'd say after 3 full AP cycles, at least one core set box should be full. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]   \n\nI may sleeve my decks in Star Wars LCG sleeves for now... just because."}]}