{"url":"https://community.fantasyflightgames.com/topic/61375-arghh-need-help-with-this-please/","title":"arghh need help with this please","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61375-arghh-need-help-with-this-please/?do=findComment&comment=601799","commentId":601799,"userName":"richsabre","timestamp":1330807477,"content":"after going back to replaying dead marshes, i find out ive been playing the **** thing wrong, i was assuming that if you didnt commit to an escape check and the cards dealt had no escape value, then it was fine, but no, they have a value of 0, you have a value of 0, so its a tie and you fail the test. dont know why i didnt figure that..........enfadado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/enfadado.gif]......my one hate about this game, finding out youve played something wrong months after youve played it\n\nanyways that isnt what im here for\n\n-i know actions can be taken after commiting characters to an escape check, but can they be taken whilst commiting them?  i feel this is an obvious answer but seeing my last mistake i dont want to assume.\n\nmy question comes from the fact that after 2b is won, and you have a final escape check, is there time to play ever vigilant event card to ready a character to take the test?\n\nthanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61375-arghh-need-help-with-this-please/?do=findComment&comment=601807","commentId":601807,"userName":"booored","timestamp":1330810405,"content":"This is a pretty good question, but I am going to have to say that YES there is an action window you can exploit.\n\nThere is a documented and well understood action phase as the end of the questing phase after the card reveals from the encounter deck, but before the threat / will calculation. This is your window to untap characters for the final escape test.\n\nAs soon as you calculate the threat and will from the questing phase and place tokens, the quest is INSTANTLY \"defeated\" as per the official faq on how quests are priority events that always occurs the instant the conditions on the quest card card are met. So they happen above ALL other game events. This means the \"forced\" effect of 2b occurs at the very instant that you place the tokens.\n\nNow there is some argument as to if there is a action window during the escape test itself, after the escape test starts, but before you tap your characters. As there IS such a window during the questing phase itself, of course this isn't a questing phase... .\n\nAnyway we play that there isn't such a window. The escape test seams to us to be kind of like a treachery that forces you to tap to cancel. So it occurs, and then you need to do your thing to stop it, and all other events that are similar in the game have no action window. Also on top of this. it makes more thematic sense to us.. the party is doing their thing, and then he tries to escape, and they have to grab him really quickly, as in have people prepared for him to escape, as in people guarding him... as in being untapped and ready, when he tries to escape.\n\nStill, it don't matter what side of the fence you fall on in this case, as there is a UNDENIABLE action window after the questing phase when the encounter cards are finished being revealed, but before the calculation of will and threat to place the tokens.\n\nSo use that windows and your good to play with both \"sets\" of players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61375-arghh-need-help-with-this-please/?do=findComment&comment=601821","commentId":601821,"userName":"starhawk77","timestamp":1330814016,"content":"Yeah, booored is right in this instance. Whether or not escape tests allow actions before characters are committed, there is DEFINITELY a chance to play actions after encounter cards are revealed. If, after staging, you realize that you will be placing enough progress tokens to defeat Stage 2B, simply play your readying effects at that time.\n\nAs to the more general question of actions during escape tests, the rules sheet in the AP seems pretty clear. When an escape test is called for, actions can be taken AFTER characters are committed to the test. There is no mention of actions allowed before characters are committed or after cards are revealed for the escape test. \n\nSo, when the escape test is triggered, there is NO chance to take actions before characters are committed. However, there are plenty of other action windows that often allow you to play around this restriction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61375-arghh-need-help-with-this-please/?do=findComment&comment=601894","commentId":601894,"userName":"richsabre","timestamp":1330847572,"content":"got it, thanks both"}]}