{"url":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/","title":"First Solo Play Unsuccessful - Did I miss something?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602010","commentId":602010,"userName":"redspook","timestamp":1330876241,"content":"Tried my first play of the game today (solo) with the intro run from the core set with the Tactics base deck.  Took all three Heroes in and fairly rapidly found myself completely stymied.  Traveled to on location with 3 Threat Strength but due to Enemy cards couldn't get any progress on it.  When I finally quit, completely confounded, I had 2 locations on the staging area worth 4 Threat Strength and 2 Enemies coming at me (1 being the big bad Spider with 9 Health).  Having only 3 4 Total Wisdom among my Heroes, I couldn't see any way to get any progress at all and was being hammered by the Enemies whilst trying.  This felt very much like a very immediate impossible situation...did I do something wrong?  Is it really that easy to so quickly end up in a place you can only lose?  What did I miss?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602018","commentId":602018,"userName":"richsabre","timestamp":1330877540,"content":"what you did wrong=played core set tactics\n\nthis is a really bad sphere to play by itself, and still is even with all the current packs (though its getting better)\n\nmy advice is play any but tactics, or even better try a multi sphere deck\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602033","commentId":602033,"userName":"redspook","timestamp":1330880418,"content":"So noted.  What would have a multi-sphere done for me?  Better Hero selection?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602045","commentId":602045,"userName":"richsabre","timestamp":1330884728,"content":"i play purely solo in this game and if there is one big challenge it is getting your heros to do everything in a round- ie a balancing act.\n\nwith tactics it has a huge weakness as you found out of having very little willpower. its basis is in defending and attacking....... so having a multi sphere deck, which becomes ever more necesary as you move through the quests, means that you have more options opened up on how to do that 'balancing act'\n\nsay you took a deck with the spheres tactics and spirit.\n\nyou could have eowyn (spirit) dunhere (spirit) and thalin (tactics) as heros\n\nyou could then use eowyns 4 willpower (with a possible boost of +1) to quest just by herself. this then frees up your other two heros and whatever allies you may have to do the defending and attacking. so thalin could be defending, and dunhere could attack, or visa versa.\n\nnot only hero selection but player card selection. in a pure tactics deck you have no willpower buffs, no healing cards, no treachery prevention, no threat reduction, its just bascially cards that buff attack, defence, hitpoints, or deals damage to enemies. so this is a very limiting deck, with little to offer to a solo player.\n\nwith the tactics/spirit deck i mentioned you could have a deck that had both attack/defence buffs and also willpower buffs, treachery prevention, and threat reduction (all of which are spirits 'thing')\n\nso in that deck you can quest and attack well, and youre also covered for them nasty treachery cards that deal damage to your characters etc\n\nyou could use these 'pairings' of spheres if you want to use just 2 spheres, or if you wanted more from your deck, you could have a three sphere deck. so in the tactics/spirit you could add lore. this then gives you cards to heal heros, and also many card draw options, which can be used in a combo with Protector of Lorien  (lore) to give you limitless willpower buffs (as long as you have cards to discard), and you can see that you may not even need eowyn any more and can free up her hero space for someone more round usefull\n\nin every deck sphere depending try to include these 'must have' cards\n\nGandalfs x 3\n\nSpirit:\n\nunexpected courage\n\ntest of will\n\nhasty stroke\n\nnorthern tracker\n\nlore:\n\nhenemarth riversong\n\nprotetcor of lorien\n\ngleowine\n\nforest snare\n\ntactics:\n\ngondorian spearman (i think hes called that. havnt got them to hand)\n\ncitidel plate armour\n\nLeadership:\n\nsteward of gondor\n\ncelebrians stone"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602211","commentId":602211,"userName":"cuber3","timestamp":1330929846,"content":" I have just played my very first solo game myself, and failed just as miserably.\nI too chose the tactics sphere, which at first seemed pretty good since you can make a little progress on your quests by defeating enemies with legolas.\nHowever, I found myself stuck in the same pattern: Quest with Gimli and Thalin, keep Legolas to defeat enemies and progress the quest.\nI had little problems with enemies, instead I was quickly swamped with locations in my staging area, the threat just kept piling on and I was unable to make any progress. To make matters worse I didn't get any enemy encounters for a few rounds, so I couldn't make any progress by defeating them with Legolas either (which was equipped with the Blade of Gondolin by now so I could add 3 progress tokens in total). Then I drew a treachery that added 1 threat to each location and enemy in the staging area, got hit with 9 threat at once and quickly lost the game.\n\nI'm going to try another sphere for my next attempt, and after getting some more experience with the game, attempt a multi-sphere deck, as suggested here.\nAny suggestions on how to avoid getting swamped with locations in the staging area? The only card I know everyone suggests is the Northern Tracker. Any others that can be helpful?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602227","commentId":602227,"userName":"richsabre","timestamp":1330932841,"content":"lorien guide does a similar thing to northern tracker but isnt anywhere near as powerful....there are many cards in the shadows of mirkwood cycle packs that really help out here, ie. events that place x amount of progress tokens\n\nbest thing to do is have plenty of questing power and travel and explore before they get too many"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602626","commentId":602626,"userName":"booored","timestamp":1330993344,"content":"richsabre said:\n\nlorien guide does a similar thing to northern tracker but isnt anywhere near as powerful....there are many cards in the shadows of mirkwood cycle packs that really help out here, ie. events that place x amount of progress tokens\n\nbest thing to do is have plenty of questing power and travel and explore before they get too many\n\n\n\n \n\nI think the guide is a very under rated card. I'm not saying it is more powerful than tracker of course.. but I think it is looked down on and compared unfairly to tracker. At 3(Spirit) is a a much easier card to cast and can fit into a splash deck very well. I'm not convinced in its use in solo, but in a multilayer game were your often holding 3x Test of will in every deck often at least 1 of these decks is only running a splash this card can in fact be a real gold mine. Defiantly worth giving this guy a try in your decks.. I think he could be a underrated star"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602679","commentId":602679,"userName":"starhawk77","timestamp":1331008121,"content":"I always encourage new players to start with the pre-constructed Leadership deck. I think it's the most well-rounded deck out of the box, able to handle both questing and fighting pretty effectively. As a result, it gives inexperienced gamers the best chance to explore mechanics and strategies without getting swamped by locations or overwhelmed by enemies.\n\nStart with Leadership, then experiment with the other spheres once you have a firm understanding of how this game is played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602728","commentId":602728,"userName":"richsabre","timestamp":1331018328,"content":"yes, thats good advice starhawk as aragorn can be played, with his readying ability it will be much easier to learn the game with him readying"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602776","commentId":602776,"userName":"armakis","timestamp":1331028144,"content":"The more you play, the more you win\n\nSolo is very difficult at the beginning, specially with mono-colors\n\nI can recommand you a spirit/command which is a very good color mix !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=602795","commentId":602795,"userName":"501stBattalion","timestamp":1331031341,"content":"Had the same issues with playing with the tactics deck.  Thanks for the suggestions, I will try another sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61406-first-solo-play-unsuccessful-did-i-miss-something/?do=findComment&comment=603138","commentId":603138,"userName":"Prof_werewolf","timestamp":1331113010,"content":"I didn't actually win a solo game until very recently. As others have noted, the expansions are key. For me at least, solo play (even while failing) was a great way to learn the game and to get more aquainted with the flow of the turns. Mix up your decks and see what happens. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}