{"url":"https://community.fantasyflightgames.com/topic/61444-questions-about-dunhere-and-lorien-guide/","title":"Questions about Dunhere and Lorien Guide","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61444-questions-about-dunhere-and-lorien-guide/?do=findComment&comment=602268","commentId":602268,"userName":"cuber3","timestamp":1330942212,"content":" I was just playing the sphere deck of the core set for the first time, and I have a few questions:\n\nDunhere:\n\n\"Dunhere can attack enemies in the staging area when he attacks alone. When doing so, he gets +1 attack.\"\n\nWhen dealing this damage, do you still need to take into account the enemy's defense?\nI'm thinking yes, but on the other hand don't enemies have to be engaged to be able to defend?\n\n\"After Lorien Guide commits to a quest, place 1 progress token on the active location.\"\n\nThis seems obvious, but I figured I'd ask anyway just to make sure: If there is no location being explored, can you place the progress token on the active quest? Say I have 2 Lorien Guides active, and commit both to the current quest. There is an active location that needs just one more progress token to be explored. Can I discard the active location and place the other progress token on the active quest? I'm just a little confused because it explicitly says \"location\"..\n\nThe rest of the spirit player cards are clear enough for me, so if anyone could answer these questions that'd be nice :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61444-questions-about-dunhere-and-lorien-guide/?do=findComment&comment=602280","commentId":602280,"userName":"radiskull","timestamp":1330943584,"content":"Re: Dunhere - the only thing about Dunhere that is different is the location of the enemy.  The enemy will still count its defense as normal.\n\nRe: Lorien Guide - quest cards are not locations.  If a card lets you put tokens on a location, you need to have a location to put tokens on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61444-questions-about-dunhere-and-lorien-guide/?do=findComment&comment=602297","commentId":602297,"userName":"cuber3","timestamp":1330945373,"content":"radiskull said:\n\nRe: Dunhere - the only thing about Dunhere that is different is the location of the enemy.  The enemy will still count its defense as normal.\n\nRe: Lorien Guide - quest cards are not locations.  If a card lets you put tokens on a location, you need to have a location to put tokens on.\n\n\n\nThanks for the answers. I'll take that into account next time I play :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61444-questions-about-dunhere-and-lorien-guide/?do=findComment&comment=602313","commentId":602313,"userName":"Azharh","timestamp":1330947668,"content":" General memento :\n\n'Putting token on active location' => Active location only. If none, then no token. If token left, surplus lost.\n\n'Putting token on quest' => Active location buffering, ie you need to use token to discard the active location first. Surplus can be placed on quest afterward.\n\n'Removing token from active location' => Removing from active location only. If you cannot remove the amount asked, just remove all token from active location.\n\n'Removing token from quest' => Removing from quest only, even if there is an active location with token on it. If you cannot remove the amount asked, just remove all token from quest.\n\nSurplus token are lost if you place more than required to complete a quest step.\n\n \n\nHope this will help (and forvige my english -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]\")"}]}