{"url":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/","title":"Stand Together, when would you use it?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604151","commentId":604151,"userName":"Arathorn299","timestamp":1331325543,"content":"A card for \"0\" cost that lets me do a mechanic I can already do?  Or does it mean I can team block any number of enemies for any player? or just mine?\n\nAlso, can Legolas participate in an attack with Dunhere when he targets an enemy in the staging area with his ability?\n\nGuess you can't optionally \"drop\" objective cards back to the staging area?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604156","commentId":604156,"userName":"richsabre","timestamp":1331328186,"content":"1.you can use it so that instead of defending an attack with 1 character as per rules- you can declare any number of eligble characters to defend - note the damage has to go on just one of the defending characters - you cant split them\n\n2.dunheres ability only works when he attacks alone\n\n3.i dont think so"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604241","commentId":604241,"userName":"Arathorn299","timestamp":1331365779,"content":"Ok, so again, this card allows you to do a mechanic you can already do, which is block an enemy.  If I have 2 enemies engaging me I can exhaust 2 of my characters to block, with or without using this card.  This card also seems confusing the way it is written, kinda like Yoda talking with double wording lol.\n\nDoes anyone else have any insight on the \"Stand Together\" card uses?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604243","commentId":604243,"userName":"richsabre","timestamp":1331365979,"content":"Arathorn299 said:\n\n \n\nOk, so again, this card allows you to do a mechanic you can already do, which is block an enemy.  If I have 2 enemies engaging me I can exhaust 2 of my characters to block, with or without using this card.  This card also seems confusing the way it is written, kinda like Yoda talking with double wording lol.\n\nDoes anyone else have any insight on the \"Stand Together\" card uses?\n\n \n\n \n\nNo-This is What It Does- you cannot block ONE attack with MULTIPLE characters- this card however allows you to do this for 1 phase\n\nit doesnt affect the ability to exhasut  single characters to defend single attacks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604248","commentId":604248,"userName":"booored","timestamp":1331366756,"content":"Arathorn299 said:\n\nOk, so again, this card allows you to do a mechanic you can already do, which is block an enemy.  If I have 2 enemies engaging me I can exhaust 2 of my characters to block, with or without using this card.  This card also seems confusing the way it is written, kinda like Yoda talking with double wording lol.\n\nDoes anyone else have any insight on the \"Stand Together\" card uses?\n\n\n\nnarr, a lot of MTG players stumble around on this when they first start.\n\nYou can only pick a single card to block any given attack.\n\nThere is also no negative blocking like the way mtg has. So if your blocker is destroyed or goes back into your hand after the block is declared it is as if the block is undefended (and that means the total attack power gets placed as dmg on a single hero you control)\n\nThere is also no stack and no \"instants\" all cards can only be played during the windows that allow them, as in action phases.. apart form \"response\" cards that require a specific game start b4 you can trigger / cast.\n\nWhat this card you are asking about dose is allow you to choice more than one card to block at the same time. As the dmg has to go on a single card, technically you are declaring a blocker, then exhausting a another card to add its defence icons to your blockers. This (but worded better) would have been the way this card should have been written.\n\nAll in all it is not that good of a card.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604250","commentId":604250,"userName":"richsabre","timestamp":1331367033,"content":"booored said:\n\nAll in all it is not that good of a card.\n\n \n\nagreed, there will almost always be a better thing for your other characters to do ie defend other attacsk/attack back/already be exhasuted --unless the staging area is really quiet- its more of a luxury card for a very specific scenario"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604268","commentId":604268,"userName":"The_Fallen_Arises","timestamp":1331371811,"content":" Speaking of stand together....do you guys use it ? Me I barely put it in my Tactics decks...I'd rather not exhaust two characters and spend one card to block one attacker. Better to sacrifice a meat shield or cancel it with Feint. I wouldn't go as far as to say it's a total waste of space in a deck but...I rarely used it when iut was in my hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604281","commentId":604281,"userName":"radiskull","timestamp":1331374593,"content":" I agree with booored here - it's really not that great.  I personally have never used it.  Perhaps it will have better synergy with other cards in the future, although I can't really imagine what that would be.  Maybe if you've got 3 Gondorian Spearmen on the table or something..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604306","commentId":604306,"userName":"leptokurt","timestamp":1331383343,"content":"It helps to reduce the additional threat by the Hill Troll or the additional damage by the Cave Troll. Also, if you have only two heroes ready in combat and you face an enemy that would defeat both of them if they'd defend alone, you certainly will thank your mom for putting this card into your bag between all those cookies. These are of course situations that the average player doesn't face that often, so it is a fairly useless card indeed. Ok, it costs nothing, but if you can have a better card..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604315","commentId":604315,"userName":"Budgernaut","timestamp":1331386306,"content":"radiskull said:\n\nI agree with booored here - it's really not that great. I personally have never used it. Perhaps it will have better synergy with other cards in the future, although I can't really imagine what that would be. Maybe if you've got 3 Gondorian Spearmen on the table or something...\n\n\n\nI love this idea! It would be awfully hard to pull off, but if it ever happened, I would never forget it. Seriously, this would eliminate many of the pesky enemies like Dol Guldur Orcs because each one is a defender and each would do 1 damage to the attacking enemy. Interestingly, this tactic wouldn't work if the card were worded the way booored prefered, because then only one Gondorian Spearman would be defending, but it would have 3 defense instead of 1. From that perspective, I like the way it's worded. I think I'm gonna try experimenting with this card more as a result of this thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604849","commentId":604849,"userName":"Arathorn299","timestamp":1331568664,"content":"Are you sure about the Legolas/Dunhere combo idea?\n\nIf one player is only committing Dunhere to attack, alone, and then the other player declares Legolas participating in the attack, why could'nt this work?\n\nOr maybe as soon as Legolas starts slinging arrows down range, Dunhere just decides, \"hey, I'm not heading in there\" lol.\n\nAny other theories on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604851","commentId":604851,"userName":"Arathorn299","timestamp":1331568727,"content":"Or maybe that would atleast allow Legolas's attack to resolve on an enemy in the staging area..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604852","commentId":604852,"userName":"richsabre","timestamp":1331568912,"content":"dunhere text-\n\nDunhere can target enemies in the staging area when he attacks alone. When doing so, he gets +1 attack\n\n \n\nits always alone- played this for a year and never seen it ruled otherwise\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604864","commentId":604864,"userName":"lleimmoen","timestamp":1331570688,"content":"Yeah, I too find Stand Together not very useful. It is kinda neat to use it in combo with Gondorian Spearman (+ any other character) so that he might survive and be used again... but that is rather rare, I feel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604878","commentId":604878,"userName":"Budgernaut","timestamp":1331572807,"content":" Yeah, the Gondorian Spearman idea seemed awesome to me until I tried to build a deck incorporating that combo. I didn't realize that Stand Together was only 1x from the Core, so I only have one copy of it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604896","commentId":604896,"userName":"lleimmoen","timestamp":1331575645,"content":"I think it is a great example of something that on paper looks great but stumbles in practice. Similar thing was me to combo the Spearman with Swift Strike, seemed so neat but did not get much play in fact."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=604967","commentId":604967,"userName":"Bohemond2","timestamp":1331590507,"content":"When I need a coaster for a drink."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=605028","commentId":605028,"userName":"Spirit Juggler","timestamp":1331609080,"content":"It'll go nicely as the card in the front of their new storage boxes :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=625236","commentId":625236,"userName":"ArturiStellare","timestamp":1335983526,"content":"STAND TOGHETER original intention:\n\nfor me the original intention of game designer was to permit to defend from all the enemy multiple times with the same characters. Infact there is only  one card of stand together so it must be very powerfull as Unexpected Courage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=625241","commentId":625241,"userName":"ArturiStellare","timestamp":1335984004,"content":" to defend from all the enemies multiple times with the same characters. So for example use gimli + legolas to defend from 1 goblind and after 1  orc and after one troll and so on.   ….only one card in the core set means big power of this card, and so this card must be interpret in this way for me. Some official response about this from FFG ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=625249","commentId":625249,"userName":"radiskull","timestamp":1335985221,"content":" Some official response that says that the card works in a way contrary to its text?  I doubt it.\n\nStand Together works as it says it does - instead of exhausting one character to defend against a single enemy, you can exhaust any number of characters to defend against a single enemy.  Then you can do the same with the other enemies attacking you.\n\nNow, we have just seen an ally that does not exhaust to defend, and so the presence of cards like that makes this card better, but it doesn't work in the way you've suggested by any stretch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61647-stand-together-when-would-you-use-it/?do=findComment&comment=625373","commentId":625373,"userName":"Doom1502","timestamp":1336019804,"content":"I used this card when I was learning how to play the game and fought a fierce fight with the HIll Troll so I could defend with Denethor and somebody else and nobody died. It's not so attractive anymore since you want to finish the game quickly now with the new scoring system."}]}