{"url":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/","title":"The Road to Rivendell Release Date","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604499","commentId":604499,"userName":"Chris51261","timestamp":1331478039,"content":"Hey everybody, I was just wondering if there was any information as to the release date to The Road to Rivendell. Is it likely to still be sometime this month? I know a lot is just speculation, but I was just trying to fish for some info."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604501","commentId":604501,"userName":"richsabre","timestamp":1331478662,"content":"doubt it- most places still dont have redhorn (i dont at least) and as we all know FFG release dates are to be taken with a pinch of salt\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604505","commentId":604505,"userName":"Chris51261","timestamp":1331478969,"content":"Oh. FFG tries to release one a month though, right? Redhorn came out in February, and Amazon had it to me by the 29th. I realize FFG is already a late on all their packs, so yeah, nothing set in stone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604506","commentId":604506,"userName":"richsabre","timestamp":1331479193,"content":"well yes i guess the monthly thing was the initial thing they had going, and maybe now we're in another cycle it will be more regular, but since about dead marshes it hasnt be monthly otherwise khazad would have came out in december, then rehorn in jan, then road to rivendell last month.....my store gave these months on pre order, however as we know they fell down the drain at christmas....\n\nWE CAN HOPE THOUGH :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604507","commentId":604507,"userName":"Chris51261","timestamp":1331479730,"content":"Ahh, I gotcha. I didn't actually know that, I've only been playing since about the beginning of January or so, so I only know of Kaz and Redhorn coming out (January and February, respectively). Thanks for the info though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604508","commentId":604508,"userName":"richsabre","timestamp":1331479792,"content":"no problem!........................................."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604523","commentId":604523,"userName":"lleimmoen","timestamp":1331484465,"content":"I wish they at least fed us with more previews as they used to when they are being late all the time. And with previews that show a new card every now and then. I hope they really show Elladan soon as Elrohir seems quite lost without him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604524","commentId":604524,"userName":"Chris51261","timestamp":1331485823,"content":"Too true. Elrohir feels like a new hero that you can't really even use, as Elladan isn't out yet. They have the previews out for the next entire cycle, so you'd imagine they have the ACs ready to go. Doesn't seem unrealistic to expect one a month. Oh well, as long as they keep putting out such an entertaining product, I'll keep waiting and hoping!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604565","commentId":604565,"userName":"soullos","timestamp":1331500401,"content":"Based on FFG's upcoming page, the pack isn't even done printing. Once that is done and it gets on the boat, it will take 4-6 weeks ship overseas. And then you have to add another week once FFG starts to ship the pack from its warehouses to the various vendors. So, I'm guessing early-mid April."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604583","commentId":604583,"userName":"Bohemond2","timestamp":1331505441,"content":"I wouldn't trust the upcoming page in this case.  For the last block, it was of no use for determining release time, so I doubt it will be any better this time around.  Unless I am mistaken, they print the whole block at the same time, so it is at least passed the printers at this point,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604591","commentId":604591,"userName":"Chris51261","timestamp":1331510153,"content":" Yeah, I noticed with Redhorn they didn't even make an announcement that it had been released until I had already received it in the mail. I guess I was just wondering if people had heard anything that sounded hopeful as to the release date being soon. The end of March sounds like the most optimistic scenario I suppose. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604599","commentId":604599,"userName":"player582283","timestamp":1331514267,"content":"I expect that we'll see it end of March.  Once Hunt for Gollum was released (and it was delayed a month or two), the Shadows of Mirkwood APs came out monthly.  I'm guessing they print and ship the full cycle and then FFG releases it out regularly monthly.  We might see a longer delay after a big box expansion like KD because there are 3 scenarios or the logistics (2 printing and shipments).  Of course, my view is based on limited experience and conjecture..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604618","commentId":604618,"userName":"Robert McMutton","timestamp":1331522539,"content":"In Spain, it is selled by Edge Entertainment, and they state in their website that Road to Rivendell is to be released on March 23th, just with Redhorn Gate (that we don't have yet). They are quite right with the dates once they give one.\n\nMaybe it could help.\n\nGreetings.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604628","commentId":604628,"userName":"muemakan","timestamp":1331527173,"content":"I think it was somebody from the german publisher that told me the whole cycle is printed at once. So the infos about being on the boat and all that are useless. So this would mean they have all the packs already lying around somewhere.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604639","commentId":604639,"userName":"Chris51261","timestamp":1331529625,"content":" I guess when it comes right down to it I'll end up doing what I did with Redhorn and just buy it on Amazon as soon as I can, I had really good results with that. It makes sense that after the first big box expansion they'd be able to get the ball rolling again with more monthly releases. I'd wager a bet they do in fact have a lot of the work done already, I wouldn't think they're announcing too many things and then trying to finish up the game afterwards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61685-the-road-to-rivendell-release-date/?do=findComment&comment=604970","commentId":604970,"userName":"Bohemond2","timestamp":1331591763,"content":"In case you missed it on the front page, Road to Rivendell should be out at the end of next week. Don't trust the 'upcoming' page."}]}