{"url":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/","title":"Thalin and the Crows...Infinite loop ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605139","commentId":605139,"userName":"The_Fallen_Arises","timestamp":1331632147,"content":" I know it is a very specific case, but it's been bugging me for a while...\n\nSuppose I'm running a Solo Quest which includes Eastern Crows (Reach of Sauron). According to Thalin's ability and the official errata, he inflicts 1 damage on enemies revealed from the Encounter Deck while he's committed to the quest, and the damage is applied before keywords and effects on the Encounter card.\n\nEastern Crows specifies in its Forced Effect that it is reshuffled into the Encounter deck once defeated. Each and every time it is revealed, Thalin kills it and makes it go back inside the deck. \n\nWhat happens if there are no monsters in the staging area, and the only two cards remaining in the Encounter Deck are two Eastern Crows ? Even with two players, we will never be able to get rid of them, yet they will never affect us.\n\nSo in short, the Encounter Deck would never reset ?\n\nAlso, another question :\n\nIf Eastern Crows is the last card, and Thalin kills it while I quest, do I still ''reshuffle'' it into the Encounter deck even if there is no Encounter deck to shuffle it back into ? Or do I put it in the discard pile ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605158","commentId":605158,"userName":"radiskull","timestamp":1331634298,"content":" I think in that very specific set of circumstances (Thalin with 2 Crows in the deck and nothing else in the deck, no monsters) the encounter deck will indeed be rather boring.\n\nIn the instance where the Crows are the last card in the deck, the rules state that you reshuffle the encounter deck whenever the deck is empty,  so I would say you deal the Crows out, reshuffle the deck (since it's now empty), Thalin kills the Crows, then the Crows get shuffled into the now-full encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605176","commentId":605176,"userName":"The_Fallen_Arises","timestamp":1331635657,"content":" Makes sense...thanks radiskull !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605178","commentId":605178,"userName":"guest479094","timestamp":1331636049,"content":" To clarify, the rules say that if the deck is ever empty *during the questing phase* to reshuffle. You do not reshuffle if it empties during another phase. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605204","commentId":605204,"userName":"radiskull","timestamp":1331641241,"content":" You're absolutely right - I meant to type that, and then I forgot. :-P"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605439","commentId":605439,"userName":"guest479094","timestamp":1331696018,"content":" Therefore, assuming the deck was emptied at some time other than the questing phase, it seems that the Crows would simply be put back into the encounter deck even though it might be empty. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605479","commentId":605479,"userName":"The_Fallen_Arises","timestamp":1331709036,"content":" But what if there is no deck left for it to go back to ? I still find it odd that you would reshuffle something into nothing..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605509","commentId":605509,"userName":"richsabre","timestamp":1331714743,"content":"yeah its a bit strange- but really before anymore cards are ever going to be drawn i..e the staging step of the next round, its going to have a reshuffle anyways at the start of the quest phase"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61771-thalin-and-the-crowsinfinite-loop/?do=findComment&comment=605832","commentId":605832,"userName":"guest479094","timestamp":1331772609,"content":" No stranger than waiting till the players draw pile is empty and using Will of the West. "}]}