{"url":"https://community.fantasyflightgames.com/topic/61806-riddermarks-finest/","title":"Riddermark&#039;s Finest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61806-riddermarks-finest/?do=findComment&comment=605409","commentId":605409,"userName":"dcdennis","timestamp":1331683893,"content":" If you use this on the Active Location, should any excess progress be moved to the Quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61806-riddermarks-finest/?do=findComment&comment=605410","commentId":605410,"userName":"radiskull","timestamp":1331684819,"content":" Nope.  The quest card isn't a location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61806-riddermarks-finest/?do=findComment&comment=605486","commentId":605486,"userName":"leptokurt","timestamp":1331710706,"content":"Agreed. The card text is very clear about this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61806-riddermarks-finest/?do=findComment&comment=605507","commentId":605507,"userName":"Bomb","timestamp":1331714328,"content":"leptokurt said:\n\nAgreed. The card text is very clear about this.\n\n\n\nHe was asking on my behalf because while I agree on what the card text says, by default, this statement from the core rules sticks out:\n\n\"Note that if there is an active\nlocation (see page 15), progress tokens are placed on\nthat location until it is explored, and the remainder are\nthen placed on the current quest.\"\n\nThat above statement can be argued to support excess progress added from Riddermark's Finest(or other abilities that add 2 or more progress) if you use it to explore the active location.  However, considering that statement is located under the quest phase, it may be out of context without the rest of the paragraph it is from.  It is still worth the clarity because we were trying to develop a strategy in how to handle the our last chance in beating the Journey to Rhosgobal quest(Wilyador had 19 health and we needed to find a way to get the remaining Athelas objective cards).  We finished the game assuming it did not carry over because this way even if that was wrong, we could at least make up for it with extra will power etc.\n\nThe above core rule statement is the only reason I initially thought Legolas' ability also allowed his excess added progress to carry over to the quest card even though the statement is located only under the Quest Phase section.\n\nSo for future reference(to myself and anyone else who needs clarity), the only time you can put carry over progress on a Quest card is when the ability or the game rule specifically states you are to put it on the Quest card.  If the ability or game rule states it is to be put on the Active Location or a Location of your choice, it does not carry over on to the Quest card if that progress is used to explore the Active Location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61806-riddermarks-finest/?do=findComment&comment=605570","commentId":605570,"userName":"radiskull","timestamp":1331725859,"content":"Bomb said:\n\nSo for future reference(to myself and anyone else who needs clarity), the only time you can put carry over progress on a Quest card is when the ability or the game rule specifically states you are to put it on the Quest card.  If the ability or game rule states it is to be put on the Active Location or a Location of your choice, it does not carry over on to the Quest card if that progress is used to explore the Active Location.\n\n\n\n \n\nThis is entirely correct.  Also note that if an effect removes tokens from a location or quest card, it will always remove tokens from the thing it says, and not any other card. (There's no \"reverse overflow\" in the game.)"}]}