{"url":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/","title":"Wolf Rider shadow effect","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/?do=findComment&comment=605806","commentId":605806,"userName":"guest479094","timestamp":1331766175,"content":" Wolf Rider comes up as a shadow card. Am I correct in thinking that this attack resolves immediately with no action window?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/?do=findComment&comment=605808","commentId":605808,"userName":"starhawk77","timestamp":1331767175,"content":"No, you can still play actions.\n\nThe Wolf Rider attack resolves just like a normal enemy attack, except it triggers immediately when Wolf Rider is revealed as a shadow card. So, you can take actions after declaring a defender, after revealing the new shadow card dealt to Wolf Rider, etc. Nate French just clarified that enemy attacks are always resolved according to the framework described on p.18 of the rule book (http://boardgamegeek.com/thread/777895/what-constitutes-an-attack [http://boardgamegeek.com/thread/777895/what-constitutes-an-attack]). Wolf Rider just \"forces\" you to choose it as the attacking enemy for purposes of step 1.\n\nAfter resolving the Wolf Rider attack, continue resolving the original enemy attack that triggered Wolf Rider as a shadow effect.\n\nHope that answers your question.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/?do=findComment&comment=605813","commentId":605813,"userName":"guest479094","timestamp":1331768034,"content":" It does answer my question but raises another one. Gimli has Unexpected Courage attached and was declared the defender for the attack in which Wolf Rider shadow came up. If I exhaust Unexpected Courage to ready Gimli, may I then declare him as defender against Wolf Rider even though the attack he was already defending against is not resolved?  If so, when I resolve the original attack is Gimli still considered the defender for that attack as well?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/?do=findComment&comment=606040","commentId":606040,"userName":"Budgernaut","timestamp":1331817749,"content":" Ooo, good question. Considering that when Aragorn readies after committing to a quest, he is still committed to the quest, I'd say your Gimli gets to defend against both attacks. If Wolf Rider some how kills him, then the original enemy's attack would be undefended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/?do=findComment&comment=606049","commentId":606049,"userName":"Bomb","timestamp":1331818689,"content":"That's what I see as well.  I would treat the results of the Wolf Rider attack like the result of any other shadow effect.  If the shadow effect removes the character from play, the attack becomes undefended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/?do=findComment&comment=606542","commentId":606542,"userName":"starhawk77","timestamp":1331944506,"content":"Yeah, the rule book entry on choosing defenders (p. 18) requires only that the selected character be ready. Barring an official ruling to the contrary, I see no reason why the same character could not defend both attacks. Then again, Nate's recent decision regarding attacks made outside the combat phase suggests that some portions of the Core Set book are similar to the Pirate's Code: more like \"guidelines\" than actual rules..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61863-wolf-rider-shadow-effect/?do=findComment&comment=606653","commentId":606653,"userName":"The_Fallen_Arises","timestamp":1331981064,"content":" Indeed....however, all the debate around Wild Bear also stems from an ambiguous preview and from a new keyword. But I agree...it seems the rules were not the bedrock we thought it was, contrary to other CCGs...it has gone to the point where a reprint of the rulebook might be in order. Afterall, when I started playing, I was already a CCG player so I took the initiative of reading the FAQs and asking questions about specific timing issues. This is not, however's, everyone's reflex."}]}