{"url":"https://community.fantasyflightgames.com/topic/61895-song-of-kings-sphere-of-influence-and-explanation-of-play/","title":"Song of Kings sphere of influence and explanation of play.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61895-song-of-kings-sphere-of-influence-and-explanation-of-play/?do=findComment&comment=606075","commentId":606075,"userName":"terry2k2","timestamp":1331821927,"content":"Song of kings has not a sphere of influence icon. Can I play it with any deck, on any hero? Once it has not an icon with the sphere of influence I can pay with any resource belonging to a hero of any trait?\n\nPlayability - When I put it into play, I atach this to a hero belonging to the sphere of Lore, Spirit or Tactics and after that in the resource phase this hero produce 1 resource of its sphere and another 1 resource of Leadership sphere? Thanks in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61895-song-of-kings-sphere-of-influence-and-explanation-of-play/?do=findComment&comment=606092","commentId":606092,"userName":"The_Fallen_Arises","timestamp":1331823760,"content":" Song of Kings is a neutral card. Therefore, like Gandalf, you can use ressources from any Sphere to pay for it and attach it to a hero.\n\nHowever, the song only adds a ressource icon. It does not enable you to gain an additional ressource. It only means that you can spend ressources for cards belonging both to the hero's sphere and the sphere of the song.\n\nEffectively, if you played Song of Kings on a Lore Hero, all it means is that now this hero can use his ressources for both spheres. You can also play cards with a cost of 0 from the Leadership sphere.\n\nThe main use of the Songs is to play multi-Sphere decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61895-song-of-kings-sphere-of-influence-and-explanation-of-play/?do=findComment&comment=606133","commentId":606133,"userName":"terry2k2","timestamp":1331831619,"content":"Super cool. I didn't get it in the first. Thanks a lot.\n\nGreetings. Terry"}]}