{"url":"https://community.fantasyflightgames.com/topic/61947-do-you-think-there-will-be-a-special-post-there-and-back-again-delux-expansion-when-the-movie-comes-out/","title":"Do you think there will be a special &quot;post &#039;There and Back Again&#039;&quot; delux expansion when the movie comes out?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61947-do-you-think-there-will-be-a-special-post-there-and-back-again-delux-expansion-when-the-movie-comes-out/?do=findComment&comment=606511","commentId":606511,"userName":"twm47099","timestamp":1331930948,"content":"I think a pre-111th Birthday group of adventures with a younger ring bearing Bilbo (sneaky, burglar, slightly twisted ethics) and the 'unsavory' characters he disapeared with, could be a lot of fun -- all original adventures, but requiring a different group of characters (at least human ones).\n\nTom\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61947-do-you-think-there-will-be-a-special-post-there-and-back-again-delux-expansion-when-the-movie-comes-out/?do=findComment&comment=606573","commentId":606573,"userName":"lleimmoen","timestamp":1331957291,"content":"Could be cool but would require all new sets of cards, or at least a list of those which are not allowed, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61947-do-you-think-there-will-be-a-special-post-there-and-back-again-delux-expansion-when-the-movie-comes-out/?do=findComment&comment=606604","commentId":606604,"userName":"richsabre","timestamp":1331968525,"content":"dont see it happening, i dont really see how it could be that different- i mean we can go to dale and erebor, and rivendell we're going to, and weve been to mirkwood an the carrock- so the places arent a problem- and ffg dont release quests directly related to the books, as they make their own up, so its not as if we'll get a bunch of quests that follow the hobbit storyline. nah, it wont happen, the nearest theyll get is taking us on quests to the areas on the hobbit we havent yet been to.\n\nbesides nothing would annoy me more if ffg started taking cues from new line cinema- theyll be plety of companies jumping upon the peter jackson money wagon, and i hope these dont follow suit (if i sound bitter from them making a film of the hobbit then thats exactly what it is---but im not getting into that again, as it never ends well on a forum)"}]}