{"url":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/","title":"Reprinting / Updating the rulebook itself ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=606655","commentId":606655,"userName":"The_Fallen_Arises","timestamp":1331981578,"content":" Hey everyone !\n\nWith all the errata, the FAQ elements and the rulings that were made, some which somewhat contradict or re-interpret the rules as they were laid out in the rulebook, do you think new reprints of the Core set should include a revised rulebook ? A revised rulebook that could be made available online in a pdf to replace the current one ?\n\nQuoted from the official answer regarding Wild Bear and Ambush :\n\n''\n\nThe main reason that Shadow cards are dealt at the beginning of the combat phase is that they serve as a convenient means of portraying which enemies have yet to act when combat is being resolved. (If an enemy has a face down shadow card, it still needs to resolve its attack.) Of course, this breaks down when the encounter deck empties mid shadow phase, but in most cases it serves its purpose, particularly early in most players' games, when they are still learning the basic mechanics -- it amounts to one less \"memory issue\" and stumbling point in those early experiences.\n\n \n\n''\n\nIf the rules as they were written were laid out more as a learning tool and less as a reference for timing issues and rules conundrums, then it seems we would need an updated rulebook as the game becomes more complex, especially with all those new keywords and mechanics being developped.\n\nWhat say you ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=606661","commentId":606661,"userName":"richsabre","timestamp":1331982187,"content":"yes it would be nice to have everything in one place wouldnt it? i mean a start to finish, properly correct rule set......especially for those new to the game, i mean how many times has someone asked 'does crows surge after thalin??'  if they were already in the rulebook then they wouldnt have to"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=606676","commentId":606676,"userName":"The_Fallen_Arises","timestamp":1331983594,"content":" Indeed, not only that but also a proper presentation of the phases of the game and of things like Shadow Card timing and Action Windows...in short a rulebook that's more ''rules'' oriented and less ''teaching the game'' oriented. Otherwise, I think it will become harder and harder to invoke the rules as they were written if they can change or be re-interpreted everytime a new keyword comes out.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=607091","commentId":607091,"userName":"booored","timestamp":1332093603,"content":"never going to happen. This is why the FAQ system exists. So there are no version republications. Also they can just update the faq and there is no multibul version all over the place. At the moment people discuss rules from 2 sources, imagine if there was like 10... would be a total mess.\n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=607094","commentId":607094,"userName":"richsabre","timestamp":1332093968,"content":"in that case i wish they would update the **** faq more"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=607156","commentId":607156,"userName":"The_Fallen_Arises","timestamp":1332110976,"content":" Yeah, I see where you guys are coming from, and I know the FAQ is more practical. Still, seeing how it seems they intended to write rules differently, but did otherwise to make the game easier to learn, I simply wonder what an updated rulebook would be like...It would sure be clearer. Most timing issues have been the object of rulings, but are not always discussed in the official errata FAQ.\n\nBesides, a lot of CCGs reprint and modify the original rulebook in between new expansions editions. Granted, they are included in each and every starter, and the release schedule of most CCGs is way busier, but still. If it's available as a pdf...why not ? If the original rulebook is flawed, are we going to keep it for the sake of simplicity ?\n\nSimply re-formulating some sections might solve or clarify a lot of timing issues. Or you know, as richsabre said, they ought to update it more ! :-p"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=607400","commentId":607400,"userName":"Mattr0polis","timestamp":1332160469,"content":"Yeah, I'm really hoping we see an advanced or updated rulebook soon. It only makes sense. People have a LOT of complaints about the current rules, the current turn sequence chart, etc. Fix it all, include more complete descriptions and breakdowns, and put it in the next big box or on the website as a new PDF.\n\nAnd is anyone else just real purplexed by the Wild Bear ruling? That ruling just made no sense and raises many other questions, and could have been easily avoided with like one extra line of text on Wild Bear. It also doesn't help that Nate French basically invalidated the whole rulebook by saying some of these \"rules\" are only there for convenience or for less stumbling points while learning. I mean, if we can't look to the rules for concrete answers, then where can we look?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=607484","commentId":607484,"userName":"booored","timestamp":1332174326,"content":"FFG hasn't done this b4... coc, aGOT, warhammer.. all have the same rule book.. regardless of the FAQ now being longer than the original book... I will be SHOCKED if this ever happens... may as well stop thinking about.. even if it dose it will not be for years.\n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61963-reprinting-updating-the-rulebook-itself/?do=findComment&comment=607508","commentId":607508,"userName":"SiCK_Boy","timestamp":1332176417,"content":" I agree with Booored that it probably won't happen. I recently bought the Core sets for AGoT, CoC and W:I. All 3 rulebooks still refer to expansion packs being 40 cards and available monthly., even if they've switched to the standard 60 cards for all games for a while.\n\nHowever, I do not know if the other games have seen such major changes to their rules as what we saw with LotR (scoring system, ruling on Stand and Fight, etc.)."}]}