{"url":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/","title":"Lord of the Rings games","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=606997","commentId":606997,"userName":"Mighty Jim 83","timestamp":1332076110,"content":" What other Lord of the Rings games do people play besides this? which ones do folk recommend?\n\nI'm looking around for some other options, and wanted to know what people thought about teh relative merits of others games out there based in Middle Earth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607008","commentId":607008,"userName":"richsabre","timestamp":1332078825,"content":"dont know if you meant this but i play the online game- its FREE!! and its great- well pretty good, they havnt done a bad job with the lore of middle earth-- and i take alot of pleasing that way (the later content look not too good that way), but its good to roleplay on- problem is it needs a computer- and i can really hate computers at times\n\ni also have the card game (reiner knizia (spelling?) its ok for solo now and again but i find it a bit tedious\n\nmy selection is extremely limited as i only ever play solo not living near any other people\n\nnot that im bothered- i havnt alot of money so i can barely keep up with this one, but i love this game above all else"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607039","commentId":607039,"userName":"Morbid666","timestamp":1332085479,"content":"I also would recommend LOTRO, been playing it for almost 4 yrs. now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607068","commentId":607068,"userName":"Dam the Man","timestamp":1332089265,"content":"Currently? None. However, my all-time M-E game list would be:\n\n#1: Middle-Earth CCG (best M-E game and best CCG to boot)\n\n#2: Middle-Earth Quest (very close second; where's my expansion FFG enfadado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/enfadado.gif] !)\n\n#3: Lord of the Rings (the Knizia boardgame, co-op game as well)\n\n#4: LotR LCG\n\n#5: Hobbit (the newer one)\n\nLotR: Confrontation and War of the Ring make up the rest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607090","commentId":607090,"userName":"booored","timestamp":1332093383,"content":"The Lord of the Rings ga,me FFG publish is very cool [http://www.fantasyflightgames.com/edge_minisite.asp?eidm=58&enmi=Lord%20of%20the%20Rings:%20The%20Board%20Game], and co-op but also there is a PvP expansion. The expansions are a bit hard to get now but I think bookdepositary has them, I got mine from ebay.\n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607331","commentId":607331,"userName":"gatharion","timestamp":1332150676,"content":" This past year was a banner year for LotR games for me.\n\n \n\nI have:\n\nThe Lord of the Rings board game (the co-op game published by Fantasy Flight. It's hard, but good; once you beat it though it's less tempting to replay.))\n\nThe Confrontation board game (also good, but so competitive that my wife is less likely to play it with me)\n\nThe Hobbit board game (Not the one the recently came out with. It's okay, but kinda simplistic.)\n\nThe Lord of the Rings Tradeable Minis Game (a collectible minis game, it was good, but never caught on)\n\nLord of the Rings Heroclix (it came out in December, I run monthly tournaments. It's main flaw is a lack of characters)\n\nLord of the Rings Online (okay I suppose, I got tired of it pretty quickly)\n\nAragorn's Quest (a fun Wii game)\n\nThe One Ring (a pen-and-paper rpg, I plan on starting a campaign next month)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607375","commentId":607375,"userName":"Dam the Man","timestamp":1332157326,"content":"gatharion said:\n\nThe Lord of the Rings board game (the co-op game published by Fantasy Flight. It's hard, but good; once you beat it though it's less tempting to replay.))\n\nPartially agree. Luckily, there are three expansions for it which add replayability. And some combos are just plain nasty from the start, took me forever to beat base + Battlefields with 2 hobbits, Sauron at 15 sonrojado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sonrojado.gif] .\n\ngatharion said:\n\nLord of the Rings Heroclix (it came out in December, I run monthly tournaments. It's main flaw is a lack of characters)\n\nI would've listed main flaw as having Sauron as fig."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607485","commentId":607485,"userName":"booored","timestamp":1332174531,"content":"gatharion said:\n\nThe Lord of the Rings board game (the co-op game published by Fantasy Flight. It's hard, but good; once you beat it though it's less tempting to replay.))\n\n\n\nThis hits the table pretty regularly with my play group. It is fun, the kids can play as the rules are not complex, it is challenging .. it is a reprint of an older game b4 FFG got their hands on it so it lacks some of the more advanced board game systems to ensure very different game play experiences by modifying the setup.. still FFG released some really good expansions that were not in the original and they really add to it. all in all a really great game imo\n\n \n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607707","commentId":607707,"userName":"jhaelen","timestamp":1332212057,"content":"Mighty Jim said:\n\n What other Lord of the Rings games do people play besides this? which ones do folk recommend?\n\n\n\nI've played the Knizia Board game a lot when it was first published. Particularly with the first expansion (Foes & Allies, IIRC) it's a lot of fun. I never tried the Sauron expansion, and the Battlefields expansion was pretty bad since it detracted from the main gameplay.\n\nI also enjoy playing Middle-Earth Quest a lot (it's the game Beravor, Eleanor, and Thalin originate from), although the game isn't perfectly balanced."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=607853","commentId":607853,"userName":"gokubb","timestamp":1332239586,"content":" The old Middle Earth CCG from Iron Crown was phenomenal. Very true to the subject matter and included the Hobbit and the LotR books. Cards are getting increasingly hard to come by, but you can still find good deals on earlier sets. The FFG LCG is fun, but nothing compared to the original."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=608309","commentId":608309,"userName":"Svenn","timestamp":1332317567,"content":"The new Hobbit board game is fun. It's fairly simple, but I enjoy it.\n\nI really want to play The War of the Ring. I hear it is awesome but I haven't had a chance to play it yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=608490","commentId":608490,"userName":"Budgernaut","timestamp":1332340189,"content":" I've had my eye on The Lord of The Rings board game ever since I saw it at Target a few weeks ago. It looks really interesting and easier to get guests to play compared to a deck-building game. I'm glad to hear that other people really like it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=609255","commentId":609255,"userName":"Mighty Jim 83","timestamp":1332477041,"content":" I've got FFG's LCG and the Board game (the old edition, but I think it's basically the same as the FFG version)\n\n \n\nI'm tempted by Middle Earth Quest, but it looks pretty epic in length: not sure how much table time it'd actually see. Already have Game of Thrones board game competing for most of the very long game sessions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=609284","commentId":609284,"userName":"Dam the Man","timestamp":1332484746,"content":"Actually the old version is better than the FFG Silverline edition of LotR, IF you're planning on getting the expansions. Silverline version changed the card backs.\n\nI'm on the very fast end of the playing scale, but MEQ averages about 75-90 min 2-player (running 1 or 2 heroes). First game or two does take longer, but going past 2 hours shouldn't be happening if you know the rules well enough to begin with. Like Arkham Horror, MEQ is \"follow the phases\" game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/61998-lord-of-the-rings-games/?do=findComment&comment=609294","commentId":609294,"userName":"richsabre","timestamp":1332486289,"content":"yeah i have the old version too, only cost about £6 on ebay"}]}