{"url":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/","title":"Flight from Moria","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607425","commentId":607425,"userName":"dcdennis","timestamp":1332163112,"content":" How do you know which step2 to go to? Is it random? I admit I haven't actually attempted the quest yet, only looked at the quest cards, so if the encounter cards tell you what to do then I guess this is a dumb question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607448","commentId":607448,"userName":"starhawk77","timestamp":1332168558,"content":"When you prepare the quest deck, you will shuffle all the Stage 2 cards together. Generally, you will proceed through them in a sequential order, but many encounter/quest card effects will reshuffle the deck or make certain quest cards active. I'd encourage you to read the K-D insert before you play, since it explains things pretty clearly.\n\nThree key things to remember: you do not flip the Stage 2 cards from side A to side B until the beginning of the staging step. This means that, after you complete a quest card, you do NOT immediately reveal the next card. You only do so after you have committed characters in the next quest phase. Also, most of the quest cards have victory point values, so you will be adding them to your victory display after progressing through them. Lastly, be sure to read and understand the rules on bypassing quest cards. That's all I'll say. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607464","commentId":607464,"userName":"richsabre","timestamp":1332170922,"content":"yeah you need to go VERY slowly on the first time through...theres alot to play wrong, and ive found that ive got half way through and not done part of it right\n\ngenereally what youre trying to achieve is get the pick axe and get to the 'way out' card as quick as possible so you dont end up with too many victory points\n\nremember you can skip the quest cards at some point"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607465","commentId":607465,"userName":"Dam the Man","timestamp":1332171248,"content":"My first two plays have only reinforced my initial thoughts on this scenario, turkey-shoot. First game, Blocked By Shadow was the first 2B and despite one party getting eliminated due to a Treachery, it actually made it easier to get nine progress. Won turn 4 or maybe 5. Second game, setup throws 2x Great Cave-Troll, then continues with Hasty Council for 2 extra VP that you don't want but that you can't avoid either. Blocked by Shadow was one of the two options, but having scouted the encounter deck and knowing a Treachery was on top so knew not to chance it (not with eight threat already out in the staging area, eight threat that weren't leaving anytime soon)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607504","commentId":607504,"userName":"rmpower2006","timestamp":1332175935,"content":"I would greatly appreciate if someone could clarify that the place where all cards with the rule 'VICTORY' end up upon completion is called the victory display, including both quest and encounter cards.\n\nThe reason I want to check is that I have found that I am getting some very high values for the nameless fear very early into the quest. Case in point, I completed 2 quest parts which brough him to X=4 then killed the the great troll which made X=7 and was forced to complete dreadful gap due to the card text making X=10. Thus I had 10 threat on the nameless fear and still had all locations and enemies that added to this during each staging step. Many turns I found I was needing 16+ quest value minimum to get a single progression token on the quest or active location. This prompted me to wonder if it is only the quest cards victory points that add to nameless fear?\n\nIf someone could clarify this point that would help alot! =)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607513","commentId":607513,"userName":"richsabre","timestamp":1332176885,"content":"nope anything with victory x goes to victory display and adds to the balrogs power"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607515","commentId":607515,"userName":"rmpower2006","timestamp":1332177419,"content":"Ah ok thanks for the very speedy response - in the middle of my first attempt at this one and wanted to make sure I was doing it right before going on!!happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nCan get right back and continue it now and attempt to salvage the mess i'm in!! *sob* this does not bode well for my team of brave adventurers who I fear are about to die horribly in the next ten minutes!\n\nTime for a deck rethink!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607520","commentId":607520,"userName":"richsabre","timestamp":1332178099,"content":"my heart goes out to you :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62047-flight-from-moria/?do=findComment&comment=607586","commentId":607586,"userName":"starhawk77","timestamp":1332185202,"content":"Yeah, I find that it's usually better to quest judiciously and NOT complete quest cards in this scenario (choosing to bypass them at the end of the combat phase). Otherwise, The Nameless Fear gets obnoxiously large pretty quickly."}]}