{"url":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/","title":"to other pure solo players/ FFG designers...PLEASE read this","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608546","commentId":608546,"userName":"richsabre","timestamp":1332346822,"content":"i have contacted ffg regarding the fact that the first two packs now have yielded 3 useless cards for solo play\n\nrenewed friendship- which is a shame as the art is amazing\n\n\nsong of earendil\n\nrohan ally (ok not useless but pretty close, obviously wont find use in a solo deck)\n\nand possibly the new dunedain ranger card- i didnt see any reason for its cost but the fact it has both ranged and sentinel traits??\n\nall useless- these can all go along with wandering took, the sentinel attatchements, Brand, gildors council and several others i cant think of\n\nwith only 9 cards in a new pack it is really irritating when i can barely afford the new cards that i get yet more drinks coasters to look at\n\ni appreciate this is 1-2 player game but if you're gonna hold to that why release these useless cards for the 1 player\n\n-i do not want to play with 2 decks\n\ni was really looking forward to the song attatchement till i read it- this is especially annoying as something as 'open ended' as a song atttchement can be pretty much made to do whatever the designers want, and its a missed opportunity in my books\n\ncan we please in future either have 1. a couple of pure solo cards (not sure how theyd work- im sure there could be some)  or 2. cards that are playable by all players\n\nbefore you start telling me to chill and be more reasonable, i dont have alot of money (not your problem i know) but i have spent god knows how long saving for a pack and it irritates me that 2/9 of it are useless\n\ni dont mind pure multi-player cards as long as ffg dont forget some people dont want to play 2 player\n\nthanks\n\nPS. i will post their reply here"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608548","commentId":608548,"userName":"Robert McMutton","timestamp":1332347224,"content":"Amen to that. I'm with you. Also a solo player, and it's a bit annoying. I think there should not be so difficult to have al alternative text in the card, saying that in case of 1 player, the effect is xxxx for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608549","commentId":608549,"userName":"richsabre","timestamp":1332347284,"content":"agreed robert...................im a really patient man, but this is gettting me worked up....argh need a drink..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608559","commentId":608559,"userName":"monkeyrama","timestamp":1332348049,"content":"Can't deny I'm rather bummed out to see the new cards not being that useful solo. It seems they're starting to get the hang of cards balancing for different player numbers in the encounter decks, so it would be very nice to see that work also for the player decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608562","commentId":608562,"userName":"richsabre","timestamp":1332348133,"content":"i wonder if they have done some sort of research and found out that very little numbers play solo? thats the vibe i get if im being honest- sorta feel left out\n\n-not that im ever gonna stop giving them my money- **** you ffg for making such a great game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608612","commentId":608612,"userName":"richsabre","timestamp":1332353465,"content":"on a side note how long does it generally take ffg to respond?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608671","commentId":608671,"userName":"dcdennis","timestamp":1332361293,"content":"While I agree with you somewhat, if you need to \"save up\" to buy a $12 pack of cards you might have bigger problems to worry about than this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608684","commentId":608684,"userName":"richsabre","timestamp":1332362426,"content":"dcdennis said:\n\n \n\nWhile I agree with you somewhat, if you need to \"save up\" to buy a $12 pack of cards you might have bigger problems to worry about than this.\n\n \n\n \n\nyes i do, though i hardly see that as forum appropriate and none of your business\n\n----ive had to come back to this....seriously man?? what the hell goes through your mind when you post something like that? would you like to know my bank balance? my health status? anything else?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608686","commentId":608686,"userName":"dcdennis","timestamp":1332362725,"content":"you lobbed that softball buddy, can't expect someone not to hit it out of the park."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608687","commentId":608687,"userName":"richsabre","timestamp":1332362787,"content":"the reason i said it was that it was core to people understanding why im making a fuss over 2 cards. it was not an invite to troll"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608689","commentId":608689,"userName":"Mattr0polis","timestamp":1332363440,"content":"I like ya, richsabre, but I have to respectfully disagree with you on this. \n\nWith this being the first real cooperative customizable card game, they would really be missing out by not taking full advantage of new concepts that can exist in this system. What you are asking is for every card to only effect the controlling player, basically just be like every card in every other card game ever made, of which there really is only so much they can do, and which we've all seen numerous times. Cards that can synergize with teammates can do all kinds of new, refreshing tricks or even just let us build decks in different ways that even heavy card gamers, like myself, haven't been able to do before.\n\nI don't think there is a lack of solo players like you mentioned, but I would say there has to be at least as many groups, like mine, that play mainly two or more players. I don't think it's too much to put up with for some cards to be better with multiplayer.\n\nThat being said, they've shown a willingness to make some of those cards have some purpose to solo players, like the 'ranged' thing. Maybe they could do more of that in the future.\n\nAnd I also wouldn't be opposed to a few cards that were only for solo play, or worded in a way that it was mainly useful for solo play but also possible to use multiplayer, if even only barely. Like of the top of my head, some really powerful events with wording like \"If there is 3 or less Heroes in play, do X\". That would be good for solo and would be a big help for the people saying solo is a lot tougher and also enticing for some 2-player games to try the less Heroes builds they keep trying to push on us, and could even be possible if just a bunch of heroes/players died. Something like that. Mainly, we just have to give them some time to figure out what all is possible in this system, both multiplayer and solo.\n\nI mean, I do see where you're coming from, but a request for no more of these fun, unique card concepts is maybe a bit much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608699","commentId":608699,"userName":"player582283","timestamp":1332365040,"content":"Rich,\n\nI play about 75% solo and always with a single deck so I can relate.  I will admit grinding my teeth a little with the Dundeain buffs for sentinel and ranged back in SoM when I was desperately looking for quality purple allies not named Faramir!  However, my advice to you is to take a few deep breaths and roll with the punches here.  It's a fun game solo, and that's what counts!  Also, they've built in relevance for ranged in solo - encounter cards that can only be dealt with through ranged and player cards that key off of it.  I'm hoping that we'll get a player card that readies a sentinel after defending or heals them or buffs their D (whatever) that makes the trait relevant in solo.  I know that does not help with some of the allies, events and things like Bard's ability, but there's always cards that won't see the light of day for some players.\n\nI think you're British...where's the legendary Stiff upper lip? (jesting, don't be offended!)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608711","commentId":608711,"userName":"booored","timestamp":1332366044,"content":"The game is designed for co-op, and can be played solo. This is the way of things and how it has been form the start.\n\nThere are so many things in this game that point to that above just the individual cards.. scaling balance.. everything.. this is a 2 player game. This is the game your buying... get used to it. I hope they nvr listen to this thread and sacrifice the games ability to be a co-op game for solo players. I think that if anything they should add MORE co-op only cards, as it is only now that co-op decks are starting to get the tools to be truly interdependent, as until recently they were basically just solo decks that people played on either side of the table. This has made co-op measurably more fun. This is a LCG, if you do not like the player card pool, do not buy the pack, the entire point of a LCG is that you can pick and choose the packs you want, no one is forcing you to buy every single pack that is released.\n\n \n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608718","commentId":608718,"userName":"richsabre","timestamp":1332366641,"content":"Woz said:\n\nI think you're British...where's the legendary Stiff upper lip? (jesting, don't be offended!)\n\n \n\n\n\nyou forget our ability to complain though :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nto those who say it is a co-operative game is say it is a solo game- there is nowhere on the box that says '2 player with the chance to solo' and if indeed as booored says- many things point to it being primarily a co-op then it is a false advertisement to not state this before you commit, may sound a bit of an over reaction but its what i believe\n\nit says 1-2 players, therefore it should be a 50/50 thing\n\nsomeone proposed multiple wordings that way everyone wins, i like the idea of that\n\nfor those who are worried im out there to try and change the way ffg make their game im not- what...you think theyd do it even if i tried? this isnt the catagories petition\n\nanyways my point is a point in iteself - a customer's opinion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608720","commentId":608720,"userName":"Keggy","timestamp":1332367308,"content":"I'm actually gonna have to agree with booored a bit.  The game plays 1-4 people, but it's obvious that 2+ players is where the game's focus is at.  It seems like they designed a cooperative game and realized it could be played solo, so they slapped it on the box.  I expect there will occasionally be some solo-oriented cards, but I wouldn't get my hopes up; while a solo-oriented card would be great for you, it is a dead card for people who play in two, three, and four player games.  Secrecy might turn out to be decent for solo decks, but I don't know if I would be comfortable playing a game where there are only 2 heroes on the table."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608726","commentId":608726,"userName":"Bohemond2","timestamp":1332368004,"content":"We already have cards and mechanics that work far better for solo play than for cooperative play, scrying being chief among them.  So, solo play is getting attention.\n\nTheir needs to be cards that focus on cooperative play for that area of the game to flourish, as boored explained.  It would be difficult to design interesting mechanics that worked exclusively for single player, and didn't feel like simply an attempt to make solo players feel better about themselves.  The multiplayer cards add exciting elements to the game and a new range of interactions.  Its hard to see how a solo-only card would do the same thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608730","commentId":608730,"userName":"booored","timestamp":1332368859,"content":"Bohemond said:\n\nWe already have cards and mechanics that work far better for solo play than for cooperative play, scrying being chief among them.  So, solo play is getting attention.\n\n\n\nthis is a good point as well.\n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608754","commentId":608754,"userName":"Trantor3","timestamp":1332379066,"content":"Bohemond said:\n\nWe already have cards and mechanics that work far better for solo play than for cooperative play, scrying being chief among them.  So, solo play is getting attention.\n\nThis. There will always be cards that are way better in solo games than in coop, and there will always be cards that work better in coop games. I don't see a lot of difference between a card that doesn't work in solo games and a card that's so bad you never want to play it anyway.\n\nSo no, I don't mind this one bit, as long as there is something for everybody in a new pack - and I'm certain that will never change.\n\nAlso, I'm way more interested in the new scenarios than in the new player cards when buying a pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608757","commentId":608757,"userName":"Robert McMutton","timestamp":1332379928,"content":"I think rich is saying (and I agree) something like the following: It's completely understable and desirable that FFg design cards that exploits interactions between players and enhance the co-op aspect of the game (i'm mostly a solo player, and I think it's amazing that the game is cooperative). But, I think that it is possible to compatibilize this with some alternative use for the same card in the case of solo playing.\n\nAnd I offer an example:\n\nThe new Rider of the Mark, is an ally with a mechanic designed for co-op, which playing solo makes him barely useful. Ok, what I say is that they could add (add, not replace) to his text something like: Action: If there is only one player in the game, spend 1 Spirit resource to discard a shadow card dealt to an enemy you are engaged with (limit once per round). So, you have a card designed for co-op interaction AND useful for solo play. Usually it could be possible to find both uses for a card, and not be exclusive. Of course the mechanics will make the card better for one or the other, but at least, it could be used by everyone.\n\n \n\nGreetings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608789","commentId":608789,"userName":"jhaelen","timestamp":1332387942,"content":"Robert McMutton said:\n\nBut, I think that it is possible to compatibilize this with some alternative use for the same card in the case of solo playing.\n\n[...]\n\nOk, what I say is that they could add (add, not replace) to his text something like: Action: If there is only one player in the game, spend 1 Spirit resource to discard a shadow card dealt to an enemy you are engaged with (limit once per round).\n\n\n\nI don't think 'compatibilize' is a word gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nI think adding single-player specific rules to cards would be a very bad idea. If anything we need _less_ text on those cards, not more. _I have trouble reading some of the cards as it is. Putting even more text on the cards will reduce the font to become completely unreadable.\n\nAs booored correctly pointed out this is a cooperative game that also can be played solo. So it makes sense to release lots of cards that have a cooperative aspect. I'd actually like to see _more_ of them.\n\nSolo players are still free to use two decks at the same time (which is what I do when I'm playing solo). There's no need to add anything to the game that specifically caters to solo players, particularly since I'm quite sure they're the (somewhat vocal) minority."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608802","commentId":608802,"userName":"richsabre","timestamp":1332390482,"content":"jhaelen said:\n\n \n\nThere's no need to add anything to the game that specifically caters to solo players, particularly since I'm quite sure they're the (somewhat vocal) minority.\n\n \n\n \n\nthere.....that right there.\n\nminority\n\ntaking that fact i can see 2 things\n\n1.that im never going to get any support in this so im going  to let it lie- there is little use in arguing when neither side will back down\n\n2.people are correct in that ffgs loyalties lie in the more numerous of the player types- that being non solo- there fore there is little hope of change\n\ni will just say one final word however (please do not mistake all this for anger or hatred again ffg- it is purely concern that a game that i love very much will lose its shine for solo play- one of the main reasons for it success in my opinion- i mean how many new players come here and state that was what drew them in?)\n\n \n\nMy problem isnt that ffg are including co-op cards- which yeah is great, something for everyone right? But no, ffg arent doing this. What they are doing is excluding certain players, instead of including others. This is the difference between a nice balanced product which has something for everyone, and just plain forgetting about a big part of your audience (ok big is an exagerration)\n\n \n\ni would love to see- just once even- a pure solo card. (and i dont mean a card which is more useful to solo, but till works both ways) and then see what non solo players think of it\n\ni find it disturbing that dwarrowdelf cycle has started this way.....it gives me little hope for the future. there has been a growing doubt in my mind for several months now that ffg are going to almost completely forsake the solo aspect of this game. if ffg keep doing this what eventually will happen is that the solo players they drew in at the start are going to start leaving and stop paying for new packs. players are just going to look on cardgamedb for the spoilers- see that yet again a third of the player cards are useless, and not buy it.\n\nboooored said if you dont like the content dont buy- true- but this is terrible way to do business. ive opened these threads before to no avail, however many more people have agreed with me this time compared to last time, so it shows that yes, solo players are getting a little fed up\n\ni think even those solo players who can 'bite thier lip' will tire of it\n\nbesides as a customer i shouldnt have to sit here and bit my lip- i am paying good money and ending up with things that are useless\n\ni will say it again- i dont want to play with 2 decks- yet again something that is never once stated solo players really should be doing\n\nim no longer even bothered about pure solo cards....i would just like ffg to put even just a tiny bit more thought and throw it the solo way\n\nif ffg do indeed see this as a coop game primarily -which is obviously correct- then they need to do something\n\nmake it clearer on the core set\n\nthey also need to starting thinking more about solo in general- i mean return to mirkwood??? seriously??? that entire pack was anti-solo\n\n Lastly- starhawk said in another of my threads that the song attatchment has the biggest impact out of the pack- well theres another of my points right there- if you're a solo player, that imapct is just a waste- all the exitment is gone becuase you know its just a useless piece of card...here's another point- there's hardly any threat reduction cards in the game right now - and now multiplayer has one that solo doest\n\n..its all about balance- at right now the balance is way off\n\nthere......end of....you can all stop grilling me....i will let this one go so it doesnt spoil my enjoyment, and so that i dont end up falling out with people i really like, however i will still post ffg's response, if its worth posting. still now answer however\n\nrich\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608829","commentId":608829,"userName":"booored","timestamp":1332396932,"content":"rich.,.. like.. what are you talking about??.. \"ffg are going to almost completely forsake the solo aspect of this game.\".... solo plays great, it is a testament to the design that solo is even playable let alone fun.\n\nI mean you are playing solo, and your enjoying it.. I just do not understand what you are complaining about. They are doign exactly what they told us.. they are making a awesome co-op game that can be played solitaire. The fact that to MAKE a co-op game there needs to be machanices designed for co-op doesn't make the solo game any less fun...\n\nLike your enjoying the game still aren't you? I heard you say in a few threads how much you loved the darrowdelf quests, if you are enjoying teh game and playing the quests solo.. then what is the problem ?...\n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608846","commentId":608846,"userName":"richsabre","timestamp":1332399096,"content":"indeed i am enjoying it, and yes thats what its all about, but for me at least, its also about value for money, and im concerned that the balance is off\n\nnow if in the other dwarrowdelf packs we dont see anymore (or at least only a few) of the multiplayer exclusive cards then im fine, problem gone, balance restored. but it really looks like it going to keep going the way it is- more and more useless solo cards.\n\ntake for instance as i said the song card. solo players are now 1 excellent (and possibly core in threat reduction) card down, especially seeing as there are very little threat reduction. its worse when it really wouldnt have taken all that much to incorporate a different text (no not added- different) to make it usable by both...just a song card that all players can use\n\nthis is exactly my point- solo play is awesome, really it is, and i will continue playing it as much as ever- i just was then infact, however i cannot help but get a little irritated when there are several amazing cards coming out that have no use in any solo decks. its concerning especially given that in the past ffg have designed entire packs that have taken the solo element and flushed it down the crapper. i mean take return to mirkwood.....i can honestly say with confidence that there cannot have been anyone on that team that designed it that thought about solo play. every encounter card worked with 2+ players. the threat gain alone made that quest into the most luck based quest for solo so far.\n\nlook, i dont want to take away from everyone's amazing coop-utilising new cards, but i do want to see some sort of proof that the desingers are at least once in a while sitting round their tables and saying 'now what can we do for the solo player?'\n\ni mean yeah you could say that all the 'ready x characters' are the solo proof right there, well maybe....but they are very broadly useful cards that are always going to find a place in everyone's decks\n\nmy final and main point is that they are a clever bunch, and im sure that they could find a way to make all cards playable by all players, i mean isnt that the designers job? making these exclusive cards cannot be under the excuse of not being able to do it any other way, it has to be by choice....and it is that that concerns me\n\nbut...and the end of it all, supply and demand, if youve got more co-op than solo then youre gonna swing that way, always. im really not asking that much here. just 1 little card that whispers hey solo player, look at me, ive been lovingly created just for you.......just like all those multiplayer cards\n\n \n\n-im not asking they stop doing something, im asking that they start doing something"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608897","commentId":608897,"userName":"Bohemond2","timestamp":1332406655,"content":"First of all, Song of Earendil isn't threat reduction; its threat transfer (just like Wandering Took).  Threat transfer is a mechanic that can not be implemented for solo play, but adds a wonderful dynamic to the game.  Threat reduction is another mechanic that is far more useful in solo play than multiplayer, because their is a huge advantage to having all players under the engagement level of monsters.\n\nWhat your asking for is the inclusion of cards that co-op players can't use to make yourself feel better.  That's foolish, especially when you have cards that are geared for solo play.\n\nAs an example, take Denethor.  Denethor is built for solo play; even if that isn't explictly stated.  If you designed Denethor to have equal impact in solo play or co-op, his power would look like this.\n\n\"Action: Exhaust Denethor to look at the top X cards of the encounter deck, where X is the number of players. You may move one card to the bottom of the deck.  Shuffle the remaining cards and place them on top of the deck.\"\n\nBut he doesn't do that, nor should he.  The scrying mechanic would be too powerful if you ported it over to co-op play, just as certain co-op mechanics do not transfer well to the solo game.  You have solo cards, and FFG shouldn't have to narrow the design scope of the game to improve player psychology."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=608984","commentId":608984,"userName":"wraith428","timestamp":1332416985,"content":"richsabre said:\n\nindeed i am enjoying it, and yes thats what its all about, but for me at least, its also about value for money, and im concerned that the balance is off\n\n\n\n \n\nOk I don't have my pack yet but according to the first post 2 of the 9 player cards are for co-op.  This seems to forget the 10th player card which is the hero.  So 2 out of 10 player cards are not usable in solo?  Does this not mean that 80% of the player cards are usable solo???\n\n \n\nWhat more do you want.  100% solo usable cards!!!  There has to be something for co-op in this game. \n\n \n\nBeing a 75% solo to 25% co-op player (who really likes co-op and wished he could get more people to play more often) the mix works for me.\n\n \n\nTo Rich... are you not a fan of the co-op version or just don't have anyone locally interested.  I've really come to enjoy co-op because your deck can be more focused on one or two jobs and well designed co-op decks can set up awesome combo's between each other.  If you ever want to play co-op online drop me a line.  I'd love to show you how fun it can be.\n\n \n\nWraith428 "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609037","commentId":609037,"userName":"Budgernaut","timestamp":1332423975,"content":" As primarily a solo player, I can see where richsabre is coming from. For someone that plays primarily co-op, there's nothing stopping them from playing a solo game every now and then to utilize cards like Denethor. For someone in richsabre's situation, there isn't an option to play cooperatively every once in a while (barring online play). Sure, he could play two decks, but I agree that two decks is too unwieldy and being able to peer into both hands gives you an effective starting hand of 14 that feels way too unbalanced. Playing two hands makes me feel like I'm cheating. So my point is that the co-op player has a few cards that he can still use, even if they are primarily solo. The only option for a solo player to use co-op cards is to find another player (not always possible) or play two decks.\n\nI guess the final option is to make your own rules for co-op cards in solo play, but that makes it harder to share experiences and relate to other players and is generally frowned upon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609059","commentId":609059,"userName":"richsabre","timestamp":1332427655,"content":"hi all- its your friendly neighbourhood complainer again :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nok firstly the co -op thing- i dont have anything against it, i live in a very sparsely populated area, and several hundred miles away from the nearest game store....so unless sheep are going to grow opposeable thumbs then that aint happening....also i just dont want to....call me insocialable if you want, but my game time is me time. my time to get absorbed in middle earth and let my mind wander away......so thank you for your offer of co-op play, maybe in the future....\n\n \n\nat the chance of sounding like a complete idiot i wil admit that some of the more constructive responses have indeed help me see the counter argument....i appreciate where you are all coming from......i really do\n\n \n\nbut (yep there's always a but) my point still remains. to wraith---i see your point, however when you say that i want 100% of card solo, well......100% of all cards are co-op playable.....so yeah, in my books its not asking the world, just a level playing field.\n\n \n\nbohemond- im am neither foolish nor interesting in player pyschology, if i wanted to make myself feel better id go and buy a puppy. there are many instances in life where it is reasonable to ask for a product to be inclusive of everyone....and as stated above i dont particularly (or at all) want pure solo cards anymore- im just asking for all cards to be playable by all....i mean you're the expert---would that be unrealistic from a design point of view? (thats a genuine question, not a snide remark)\n\n \n\nanyways, as stated the sheer weight of opposing player opinions i will fight this no more....i was raising the point on the forum to see what the forum's reaction was.....if i just wanted to grill ffg i would have sent them my forum message- this i did not, i merely sent them an inquisitive message\n\n \n\nanways\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609066","commentId":609066,"userName":"HilariousPete","timestamp":1332428760,"content":"Very interesting topic in this thread! I also thought about usability of cards regarding solo/co-op aspect, and were a little bit disappointed at first, like you. But after a while, my opinion changed. I agree with Bohemond. Some cards don't explicitly state that they're better for solo, but they are.\n\nHe already noted Denethor. It's the same with Henamarth. Knowing 100% what will be coming from the encounter deck is much much better than knowing 33% in a 3 player game. In addition, you're not allowed to talk about non-revealed cards in the encounter deck, so Needful to Know is another example where a solo player benefits more than co-op players. (Hey, that's a Dwarrowdelf card! gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif])\n\nThen there's Bilbo. I find him great in Solo games (every round 2 cards drawn, that's great), but in a 4 player game, his ability will make you benefit only each 4th turn, and his stats only add up to 6, but he costs 9. He's merely worth his Hobbit trait (Fast Hitch...), my brother even refuses to play with him in our 2 player games.\n\nSome cards like Steward of Gondor are very powerful, but unique. This usually leads to only 1 player having 3 copies of SoG in his deck, and only 1 player having 3 copies of Horn of Gondor in his deck (let's assume he bought 3 core sets). So unique cards generally are \"restriced co-op use\" cards. And there's quite a bunch of unique cards. If in a 4 player game 1 player plays Gandalf for 5, then another player having Sneak Attack + G in his hand is blocked. Or there will be only 1 Radagast, even if 2 players would like to have an Eagles-centered deck.\n\nOr take Ever Onward. In a co-op game, this card is expensive (3 res) for negating a (probably only small) threat increment of only 1 player. In solo game, if you have this card, you can quest with absolutely nobody and kill a lot of enemies you're currently fighting. This can be pretty handy. It's the same with Thicket of Spears (although I've got to admit that it's pretty hard to pay it solo, because every hero needs to have a Tactics icon).\n\nSo don't be too disappointed, FFG is also doing something for solo gamers happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif] (Although scaling really could be improved - yes I'm looking at you, RtM...)\n\n \n\nRegards,\n\nPete"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609069","commentId":609069,"userName":"richsabre","timestamp":1332429114,"content":"thanks for your reply pete...yes those reasons are the reasons i have 'yielded' in a way, there are indeed cards that i didnt think about at first (**** your haste richsabre!), however i am putting this thread on the back burner for a few packs to see what fruits they bring in player cards\n\nif things get better/worse for these exclusive cards then i will re-think my opinion on the matter\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609076","commentId":609076,"userName":"player1761766","timestamp":1332430173,"content":"I'm also a solo-exclusive player, and I also agree with the original points that there are increasing numbers of cards that cannot be played in a 1 player game, which is a worry. I suppose at the minute I'm lucky in that I can afford to buy these adventure packs at will, but it does rankle that there are more and more co-op only cards being included in these packs. Redhorn Gate had one, Road to Rivendell has two, so are we expecting Shadow and Flame to have six? While it's true that nobody is holding a gun to anyone's head to buy these things, it would be nice to see a better balance. Denethor has been mentioned as being a highly valuable solo card, but is he precluded absolutely from being used in a co-op game? No, of course not. The point is, it doesn't work both ways, and it can irritate some people.\n\nPete, I take your point about Radagast, but Gandalf's text means it isn't long until the second player can bring him out. And I presume, when playing co-operatively, you'd choose different spheres, so the other unique guys won't pose a problem. Whether a card is better in solo or not is slightly off the mark, I think, though. It's not a matter of having a card that is better in solo or better in co-op, it's about cards that are impossible to play solo. Whether having other cards that work better in a solo game makes up for this or not, I don't think so, because these cards that work better in solo can be used in co-op. The cards that work in co-op like these controversial spirit ones cannot be used in solo. That is the contentious issue, to me.\n\nIt's been said before, many times, that this is a 2-player game that, as luck would have it, can also be played solo effectively. I'm starting to look at it that I'm lucky that it can, because it's a truly great game. There are other great games that I have that require another person, and so require a level of organisation that I'm just too lazy to effect, so at least I have this one that I can take off the shelf whenever the fancy takes me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609085","commentId":609085,"userName":"richsabre","timestamp":1332431557,"content":"yes, agreed spalanzani, though you must be brave to side with me- prepare to have your head bitten off"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609089","commentId":609089,"userName":"Eric W","timestamp":1332432122,"content":"Think of how I feel?  I play mostly a dwarf deck that is tactics heavy with some leadership.  You're complaining that 1 card was worthless for you.  I had about 70% of the cards being worthless for me!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609090","commentId":609090,"userName":"player1761766","timestamp":1332432483,"content":"richsabre said:\n\nyes, agreed spalanzani, though you must be brave to side with me- prepare to have your head bitten off\n\n\n\nWe shall see! gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\nDon't forget to post the FFG reply (if you get one - I sent them an email about the SW LCG in September and it took about five weeks for them to basically tell me nothing...)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609092","commentId":609092,"userName":"richsabre","timestamp":1332433020,"content":"ok thanks for the info....thats err promising haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609095","commentId":609095,"userName":"twm47099","timestamp":1332433644,"content":"I am just very happy that FFG makes a number of their games very suitable for solitaire play rather than just having solitaire introductory scenarios.\n\nI'm also exclusively a solo player.  I'm still learning the play of this game and still working through the Core quests with each pre-made sphere using only the core cards.  But at my level, I have found use for the 'useless' cards like Wandering Took.  There is a need (at least with the core decks) to have some \"Startrek red shirts\" - someone has to die.  WT makes a nice sacrificial defender.  As I start building my own multi sphere decks, I expect that he and some other cards will make nice book-marks (or coasters).\n\nI also expect that as I get more experience, I may house rule some of the more interesting multi-player only cards to adapt their mult player role to solitaire.\n\nTom\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609098","commentId":609098,"userName":"richsabre","timestamp":1332433811,"content":"twm47099 said:\n\nother cards will make nice book-marks\n\n \n\n\n\ncheers tom! i atually like that idea, perfect for my tolkien collection"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609111","commentId":609111,"userName":"twm47099","timestamp":1332434998,"content":"richsabre said:\n\ntwm47099 said:\n\n \n\nother cards will make nice book-marks\n\n \n\n \n\n \n\ncheers tom! i atually like that idea, perfect for my tolkien collection\n\n\n\nThat's what my son did with his Middle Earth (ICE) CCC otherwise useless commons.\n\nTom\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609113","commentId":609113,"userName":"Valyrian Steel","timestamp":1332435112,"content":"richsabre said:\n\n \n\nbut (yep there's always a but)\n\n \n\n \n\nNed Stark always said that anything before the word \"but\" doesn't really count demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609120","commentId":609120,"userName":"richsabre","timestamp":1332436265,"content":"Valyrian Steel said:\n\n \n\n \n\nbut (yep there's always a but)\n\nrichsabre said:\n\n \n\n \n\nNed Stark always said that anything before the word \"but\" doesn't really count demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\n \n\n \n\nahhh you may be correct there haha :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609121","commentId":609121,"userName":"richsabre","timestamp":1332436299,"content":"woah crazy forum set out....anyone else getting half a screen?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609122","commentId":609122,"userName":"Valyrian Steel","timestamp":1332436424,"content":" Yeah, my weird quote box combined with your quote of that seemed to break the thread haha. Not sure how mine came out that way either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609126","commentId":609126,"userName":"richsabre","timestamp":1332436730,"content":"/whispers - i think we may have broke the forum sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609173","commentId":609173,"userName":"Narsil0420","timestamp":1332449195,"content":"You know, I'm actually more concerned about the opposite happening, that people will only focus on the solo ability of this game and not care enough about multiplayer. I won't speak for the europeans and other nationalities but here in the US, our culture is so individualistic. There's enough people sitting by themselves watching TV, using their ipoods, playing WOW, etc. and not interacting with people. What happened to getting out and being social! This is what's great about boardgames in general, you get to interact with people face to face! I think it's great that FFG emphasize the multiplayer aspect of the game over the solo, maybe that will encourage some of you to stop only playing solo and find a friend to play with.\n\nBesides, joining together as a team is what LOTR and Tolkien are ALL ABOUT!!! He would be proud to have a game that rewards us for working with others to overcome evil! What your complaining about is directly against the spirit of Lord of the Rings and I can't support that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609199","commentId":609199,"userName":"Budgernaut","timestamp":1332455522,"content":"Narsil0420 said:\n\n \n\nBesides, joining together as a team is what LOTR and Tolkien are ALL ABOUT!!! He would be proud to have a game that rewards us for working with others to overcome evil! What your complaining about is directly against the spirit of Lord of the Rings and I can't support that.\n\n \n\n \n\nI think that's a little unfair to say, especially since richsabre has agreed with previous points and said he would be fine with cards that are designed to be used in both without excluding either group. He and other solo players are not (anymore) asking for cards to be made that can only be used solo, just that cards can be used by all players. I agree that fellowship and cooperation against evil is a large theme in Tolkien's works, but I don't think this is a thematic discussion. This is about someone paying for cards they can't use. And with a fixed distribution method, he can't even sell them. I agree that these new cards are an awesome way for cooperative players to start seeing interactions between decks, but when it comes down to it, a portion of their consumer base is being alienated by the card design. Maybe not everyone can be pleased, but that doesn't mean that those who aren't can't complain about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609213","commentId":609213,"userName":"The_Fallen_Arises","timestamp":1332461678,"content":" Interesting topic...I haven't been around for too long but I'd like to share my point of view on the matter.\n\nFirst off, sorry rich if you feel like your head is in danger of being bitten off...You are an enthusiastic poster, and obviously passionnate about this game, and thus, the last thing I want to see is a fellow forumite feeling ostracized.\n\nHowever, I feel that many legitimate arguments have been made on the other side of the fence, and I tend to lean more on the multiplayer side. Usually, CCG expansions are way more massive than LCG ones...with many, many playable cards for all factions and flavours. Personally, I tend to see the whole cycle as one big expansion, because frankly,10 new player cards per expansion ? That's not much...but at the same time they are fixed and the need for new Encounter deck content is really important because the game depends on it to stay alive and keep growing. I think we ought to wait and see the end of the cycle before we determine that solo play has been gimped, however legitimate the feeling is. 10 different player cards (hero included) is a small sample...60 new cards will be more like it.\n\nLike Narsil0420, I also had the odd feeling that Solo play was more prevalent than Coop. I do not know if it is true...maybe it comes from the many posts on the forum that concern Solo play. It always left me with the feeling that Solo was for the ''hardcore' who want to excel at deckbuilding and that multiplayer was not exciting or challenging enough. There even was a thread complaning that the game was too hard, and that solo was nigh-impossible. In that thread, I posted that different players want different things, and that Solo play attracts players who are looking for a bigger challenge. Maybe I am wrong (Rhosgobel with 4 players ? Good luck cancelling all the treacheries...)...but I never felt like Solo players were left in the dust.\n\nIn closing, I love this game, and I especially love multiplayer since I can specialize my deck and really feel like I'm collaborating with my friends (instead of simply winning at their expense). Therefore, I would not really be in favor of exclusively Solo cards (as it has been said, some cardsalready do that without advertising it). Besides, on the 60 cards that will compose the whole cycle, I believe the vast majority will be quite usable (and useful) to the solo player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609215","commentId":609215,"userName":"HilariousPete","timestamp":1332462622,"content":"spalanzani said:\n\nIt's not a matter of having a card that is better in solo or better in co-op, it's about cards that are impossible to play solo. Whether having other cards that work better in a solo game makes up for this or not, I don't think so, because these cards that work better in solo can be used in co-op. The cards that work in co-op like these controversial spirit ones cannot be used in solo. That is the contentious issue, to me.\n\n\n\nThat's true, but there's nothing anyone can change about it. If designers create a card having a solo player in mind, the mechanic of that card's effect requires only 1 player, and therefore will be playable in multiplayer games, too. (As long as the designers don't add \"Only play this card if there's only 1 player in the game\" or something like that. But that would be excluding the card from multiplayer games without any reason...) If the designers have a card in mind which works for only 2 or more players (threat transfer e.g.), that mechanic just can't work with only 1 player.\n\nSure, you could add an alternative text to make such a card usable in solo play, too. But jhaelen already stated that the textbox is insufficient for that, or we need magnification glasses gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nSo I guess the situation won't change much in future.\n\nspalanzani said:\n\nit's a truly great game\n\n\n\nYes that's truehappy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif] Can't wait until I find some time to try the new hero from Road to Rivendell, or open the Massing at Osgiliath pack waiting for me on my desk...\n\n \n\nGreetings,\n\nPete"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609250","commentId":609250,"userName":"richsabre","timestamp":1332474184,"content":"Narsil0420 said:\n\n \n\nYou know, I'm actually more concerned about the opposite happening, that people will only focus on the solo ability of this game and not care enough about multiplayer. I won't speak for the europeans and other nationalities but here in the US, our culture is so individualistic. There's enough people sitting by themselves watching TV, using their ipoods, playing WOW, etc. and not interacting with people. What happened to getting out and being social! This is what's great about boardgames in general, you get to interact with people face to face! I think it's great that FFG emphasize the multiplayer aspect of the game over the solo, maybe that will encourage some of you to stop only playing solo and find a friend to play with.\n\nBesides, joining together as a team is what LOTR and Tolkien are ALL ABOUT!!! He would be proud to have a game that rewards us for working with others to overcome evil! What your complaining about is directly against the spirit of Lord of the Rings and I can't support that.\n\n \n\n \n\ni have already adressed this- i live in the middle of nowhere- i play the game to get away from people- please dont state that im going against the spirit of tolkien-if anyone is tolkien obsessed on here it is me. i have read much on tolkiens personal level though his notes and letters and he was much more interested in other facts than 'social inclusion'  his works came about through a love of mythology and language, and adventure. i get immersed in all 3 of those playing solo, so no, i dont think tolkien would chide me for not playing co op.\n\nit is wrong for you to assume everyone has the methods/means to go out and find play teams. not everyone lives a well populated/ well facilitated area. not everyone has transport. not everyone wants to.\n\ni do not sit at home on my pc all day. i do not sit and watch tv all day. there is nothing on the box that states 1-2 players but you really should be being more social you know"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609260","commentId":609260,"userName":"Mighty Jim 83","timestamp":1332477546,"content":" I think most of the arguments for/against the different card distributiions have been covered already, so I won't re-hash those.\n\n \n\nJust as a point on whether co-op/solo play predominates, the quest log shows a heavy bias in favour of solo play. Due to the lower scores which generally follow from playing 1 or 2 player games, this can lead to the odd situation I've had, of a better than average score for each of the 4 numbers of player games, but a wore overall average as a result of playing a lot of 3 and 4 player!\n\nObviously, the quest log isn't a definitive record of what people play, but it's the best guide we have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609285","commentId":609285,"userName":"Dam the Man","timestamp":1332484856,"content":"richsabre said:\n\ni have already adressed this- i live in the middle of nowhere-\n\nAre you referring to your local area or the UK demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609287","commentId":609287,"userName":"richsabre","timestamp":1332485663,"content":"Dam said:\n\nrichsabre said:\n\ni have already adressed this- i live in the middle of nowhere-\n\n \n\nAre you referring to your local area or the UK demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] ?\n\n\n\nhaha both! which is worse! where i live there's only one road- out of it -quickly if you have sense demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609297","commentId":609297,"userName":"Dam the Man","timestamp":1332486660,"content":"Sounds like Innsmouth gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609316","commentId":609316,"userName":"muemakan","timestamp":1332489865,"content":" Sounds like home."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609345","commentId":609345,"userName":"radiskull","timestamp":1332496412,"content":"richsabre said:\n\nthere is nothing on the box that states 1-2 players but you really should be being more social you know\n\n\n\n \n\nI think it would be hilarious if this started appearing on game boxes. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609381","commentId":609381,"userName":"richsabre","timestamp":1332502628,"content":"radiskull said:\n\nrichsabre said:\n\n \n\nthere is nothing on the box that states 1-2 players but you really should be being more social you know\n\n \n\n \n\n \n\nI think it would be hilarious if this started appearing on game boxes. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\npetition! lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609542","commentId":609542,"userName":"DurinIII","timestamp":1332527270,"content":"I agree Rich. Completely. This game should not be trying to juggle two clearly different playing styles in the same packs.  Either pick one or the other, or distribute the cards better. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609706","commentId":609706,"userName":"Ted Sandyman","timestamp":1332586284,"content":"Try not to let it get under your skin rich. You sound like a decent bloke with a love of all things tolkien. Just think, a couple of years ago none of us knew about this game and never expected anything as wonderful as this to appear. I, like you, only want to play solo. Its what i want and i love it. There will obviously be packs over the next few years with cards that favour multi player games but hey, so what? There is a lot of rubbish happening in the world at the moment so put it in perspective, keep smiling and keep writing your excellent pieces. Its not worth getting upset about. Cheers mate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609711","commentId":609711,"userName":"richsabre","timestamp":1332588040,"content":"true true ted...good advice :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609717","commentId":609717,"userName":"Ted Sandyman","timestamp":1332589453,"content":"I had to laugh though rich, it sounds spooky where you live!! Got home from work at 2 and have been messing about in the hills of emyn muil all afternoon. One of my favourite adventures! Is there anything in the pipelines about a full hobbit history? A lot of people would be interested to know that sam ended up with frodo after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609724","commentId":609724,"userName":"richsabre","timestamp":1332591364,"content":"haha i was being rather harsh-it is very beautiful- just dont feed the cows after dark demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\nemyn is fun, i dont hate it like some people, the artwork is worth it alone.\n\n...yeah a hobbit history....i like that idea....ill start scribbling happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609739","commentId":609739,"userName":"Ted Sandyman","timestamp":1332597689,"content":"Yeh i agree the lake district is amazing, i stopped off in barrow on furness a few years back on my way to my aunties in dumfries. Wish i had more than a day there. Yep i like taking my time throughout the adventures, i suppose thats why i like emyn muil as there isnt much fighting so im not rushing to do battle every turn. I may be in the minority but i love travelling to places rather than scrapping with orcs!! Thats part of the beauty for me, travelling to a location then looking it up in all my books to find out as much info i can about that location. I wonder if any one else does that or do they just play the game and get on with it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609743","commentId":609743,"userName":"richsabre","timestamp":1332598735,"content":"no i do that too...to the point i almost roleplay this game- i mean i stick to the rules and everything- put when i play there's always i narrative going on in my head. thouhgh its always hard trying to figure this one out--\n\n\"so our three dwarfs are currently hacking their way through orcs in moria, then suddenly bifur is made steward of gondor......oh and wait...is that gildor coming round that dark corner....oh hey dude, wht brings you here? oh im just wandering about you know, usual stuff.\"\n\ngran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609745","commentId":609745,"userName":"Ted Sandyman","timestamp":1332601400,"content":"Weird innit? I put myself in their place and actually try and live that adventure. Weirdo alert!!! I know im way behind you as ive only been \"adventuring\" for about 4 months. Ive only got the core set and the 6 adventure packs but im taking my time enjoying each quest, while experimenting with different heroes. Ive got to give respect though to the artwork as it is amazing!! I have had a personal vision in my head of each character and place since i read the trilogy 25 years ago and i have to admit that most of the artwork has now changed my mind as to how a lot of the characters and places in the books actually look. Thats testimony to the competency of the artists involved with this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609755","commentId":609755,"userName":"richsabre","timestamp":1332604468,"content":"ha...we shall be wierdos together then :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nthe artwork is one of the, if not the best part of the game......ive said this before, but i really want them to release an art book of it all when we have a few more packs out....or sell prints via the artists so i can fill my house with them all!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609824","commentId":609824,"userName":"Ezel","timestamp":1332631147,"content":"I'm, so far (which isn't very long actually since I bought this game less than a week ago) a solo only player and I agree with the sentiment of the OP of this thread. That is: FFG printed 1-2 players on the box and they should at least try to stick to that.\n\nGoing back to before the release I guess what a lot of us thought was that 1-2 players meant that \"Of course there will be cards HEAVILY slanted towards co-op, I won't expect to find all cards helpful as a Solo-player! And equally of course there will be cards that are HEAVILY slanted towards solo and won't be nearly as good when co-op:ing\".\n\nNow, so far it seems this doesn't seem to have paned out that way. And it's a shame. I really think that FFG should be careful not to scare away the solo players. They chose THIS game over a gazillion others just BECAUSE it has 1-2 players printed on the box, and it would be fair to cater a bit to them too.\n\nOf course I have no statistics of this, but it wouldn't surprise me if a solo player spends just about as much money on the game as 2 close friends (think siblings)do if they play together all the time. They could easily just buy one of each Expansion and split the cards between their favorite spheres, thus negating the need to buy 2 of each expansion. The quest and encounter cards they absolutely only need one set of.\n\nNow, how should FFG cater more to the solo-crowd without angering the co-op crowd (and thus making all of us angry instead of just half of us ;-) ) ?\n\nI've actually read through the whole thread and one of the best posts was already on the first page (I've bolded the constructive part):\n\nMattr0polis said:\n\nAnd I also wouldn't be opposed to a few cards that were only for solo play, or worded in a way that it was mainly useful for solo play but also possible to use multiplayer, if even only barely. Like of the top of my head, some really powerful events with wording like \"If there is 3 or less Heroes in play, do X\". That would be good for solo and would be a big help for the people saying solo is a lot tougher and also enticing for some 2-player games to try the less Heroes builds they keep trying to push on us, and could even be possible if just a bunch of heroes/players died. Something like that. Mainly, we just have to give them some time to figure out what all is possible in this system, both multiplayer and solo.\n\nThis is absolutely a good idea and is close to what I myself felt when I first read about the Ranged and Sentinel abilities. I was then hoping to read about some ability that suited solo-play but it didn't show up. :-/ The above suggestion could make an awesome Ability, actually the name Sentinel would suit this better in a way since it means 'A soldier or guard whose job is to stand and keep watch.', in other words not someone who runs around all over the place defending OTHER players characters ;-)\n\nNow, to quote another post in the thread\n\nBohemond said:\n\nFirst of all, Song of Earendil isn't threat reduction; its threat transfer (just like Wandering Took). Threat transfer is a mechanic that can not be implemented for solo play, but adds a wonderful dynamic to the game.\n\nThat's correct. Transfer (threat, resource, damage, whatever) is useless for solo, but the cards that implement it could be written to actually be solo-heavy instead than totally useless for solo! For example a damage transfer card could look something like this:\n\n\"Remove 1 damage on one of the Heroes you control and deal 1 damage to one the Heroes another player control\".\n\nSee? Not useless for co-op play if one player has a Hero close to death and another player has a Hero in great health. Even better for solo players since it actually reduces the damage over all!\n\nI bet others can come up with more examples, and I BET the designers can and already have come up with some great examples. Now we are just waiting to see them in print so we solo players won't all have to migrate to this instead :-) :\n\nhttp://www.boardgamegeek.com/boardgame/42142/doctor-who-solitaire-story-game [http://www.boardgamegeek.com/boardgame/42142/doctor-who-solitaire-story-game]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609825","commentId":609825,"userName":"Ezel","timestamp":1332631430,"content":"Ok, bolding in quotes can't be done, smilies don't convert to the graphics kind and posts can't be edited.\nThis combined with the strange strange way to handle paste (cut oddly enough uses the standard procedure) really makes me wish for some man hours being thrown at fixing the forum code!\n(Now, stop cluttering down the thread with off topic)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609836","commentId":609836,"userName":"Bonus Card","timestamp":1332636166,"content":"I am a group player, (my wife and I), however, I do get the occasional solo game in when she is busy and I am not. These \"group\" cards like wandering took and Brand also tick me off when I am working on a new deck build.\n\nHowever, I actually have been looking at some of the arguments that have been posted in the forums on tournament play and I think this appearance of many new \"group play\" cards could be in response to preparing for tourney play atmosphere.\n\n \n\nOf course in tournaments there are \"solo games\" and \"group games\", I know that there are some people that are fine with just playing this game solo, but I would figure that more than half of the people that are super interested in being first to buy the next new expansion are also the same people that are interested in seeing a good tourney format for this game.\n\n \n\nTherefore, I say, I will grumble with the rest of us when there is a new card that I do not use as much as the rest, but I will wait patiently and in anticipation of the day that it is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609948","commentId":609948,"userName":"twm47099","timestamp":1332679307,"content":"For solo-exclusive players, how do you feel about home-ruling the cards that are not suitable for solo play?  I've started doing that with some cards to make them more thematic.  For example, while Eowyn and Bilbo have their uses, they just don't do much for me re the flavor of the game.\n\nOn cardboard of the games, in the custom card gallery there are fan designed cards for Eowyn and Bilbo (pre birthday party) that I feel are much more thematic, although Eowyn needs a penalty cost for when she eliminates a Nazgul (if Eowyn's attack reduces the Nazgul HP to 0, the Nazgul is removed from play, and Eowyn (and the hobbit, if any) cannot be readied until...(some difficult healing steps or something) --kill a Nazgul at the cost of 1 or 2 heros (my version allows one hobbit to attack with Eowyn using her special ability).  Could this be a game breaker? Sure in a Nazgul scenario, but I think it helps as a story.  And since that fan card has reduced the \"will\" strength of Eowyn significantly, she doesn't become super woman, and tradeoffs still have to be made.\n\nhttp://cardboardoftherings.com/2012/03/19/e22-theyre-taking-the-hobbits-to-isengard-what-did-you-say-the-hobbits-the-hobbits-the-hobbits-to-isengard-to-isengard/ [http://cardboardoftherings.com/2012/03/19/e22-theyre-taking-the-hobbits-to-isengard-what-did-you-say-the-hobbits-the-hobbits-the-hobbits-to-isengard-to-isengard/]\n\nEowyn [https://farm8.staticflickr.com/7026/6523554267_0ff03fa755_z.jpg] [http://www.flickr.com/photos/70427156@N08/6523554267/]\n\nBilbo Revised - Joe L entry [https://farm8.staticflickr.com/7017/6523553639_53dc1e885e_z.jpg] [http://www.flickr.com/photos/70427156@N08/6523553639/]\n\nIf there is an otherwise appealing multi-player only card, house rule it to what you would feel is in keeping with the theme.  On the other hand since player decks are usually limited to around 50 cards, we should expect that there will be a lot of chaff or cards that excell in certain scenarios, but are useless - cannon fodder at best - in others.\n\nOf course it's a cost to buy cards that aren't useful, but I wrestling now with if I should buy some packs that only interest me for one or 2 player cards (like Dain) and some of the Songs.  At least if I do, I know I will get the cards I want in the packs I buy.\n\ntom"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609960","commentId":609960,"userName":"richsabre","timestamp":1332681879,"content":"other solo players are free to do as they wish, but for me house ruling is a big no no- im only in for the official product- even if that means loosing out\n\n- i dunno- it just plays havoc with my ocd nature to not play things correctly as they were deisgned- thats why it really annoys me when i find ive been playing certain card wrong\n\nalso house ruling is playing with fire in my opinion- it will just confuse things later on as new ruling are brought out- and it doesnt take much to confuse me in the first place lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=609994","commentId":609994,"userName":"Bohemond2","timestamp":1332690268,"content":"twm47099 said:\n\n \n\nOn cardboard of the games, in the custom card gallery there are fan designed cards for Eowyn and Bilbo (pre birthday party) that I feel are much more thematic, although Eowyn needs a penalty cost for when she eliminates a Nazgul (if Eowyn's attack reduces the Nazgul HP to 0, the Nazgul is removed from play, and Eowyn (and the hobbit, if any) cannot be readied until...(some difficult healing steps or something) --kill a Nazgul at the cost of 1 or 2 heros (my version allows one hobbit to attack with Eowyn using her special ability).  Could this be a game breaker? Sure in a Nazgul scenario, but I think it helps as a story.  And since that fan card has reduced the \"will\" strength of Eowyn significantly, she doesn't become super woman, and tradeoffs still have to be made.\n\n\n\nThe would be wary of using the fan designed Eowyn.  From a quick glance, she looks hideously broken (and it had nothing to do with the Nazghul ability).  She has two jaw-droppings powers; give her one but not both.  On top of that, her powers should be lowered so they are at least in the ball park of other heroes.  Her ability to to reduce cost of rohan cards is stupidly powerful.  At the very least, you need to reduce it to once per turn.  The counter attack power is good enough on its own, you don't need to add two attack.\n\nThis version of Eowyn may not have high will, but it makes her more of a super woman than the exsisting card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=610257","commentId":610257,"userName":"twm47099","timestamp":1332763518,"content":"Bohemond said:\n\ntwm47099 said:\n\n \n\n \n\nOn cardboard of the games, in the custom card gallery there are fan designed cards for Eowyn and Bilbo (pre birthday party) that I feel are much more thematic, although Eowyn needs a penalty cost for when she eliminates a Nazgul (if Eowyn's attack reduces the Nazgul HP to 0, the Nazgul is removed from play, and Eowyn (and the hobbit, if any) cannot be readied until...(some difficult healing steps or something) --kill a Nazgul at the cost of 1 or 2 heros (my version allows one hobbit to attack with Eowyn using her special ability).  Could this be a game breaker? Sure in a Nazgul scenario, but I think it helps as a story.  And since that fan card has reduced the \"will\" strength of Eowyn significantly, she doesn't become super woman, and tradeoffs still have to be made.\n\n \n\n \n\nThe would be wary of using the fan designed Eowyn.  From a quick glance, she looks hideously broken (and it had nothing to do with the Nazghul ability).  She has two jaw-droppings powers; give her one but not both.  On top of that, her powers should be lowered so they are at least in the ball park of other heroes.  Her ability to to reduce cost of rohan cards is stupidly powerful. \n\n[/Quote]\n\nI agree, and its not very thematic - I don't recall in the book her rallying the troops.\n\n> At the very least, you need to reduce it to once per turn.  The counter attack power is good enough on its own, you don't need to add two attack.\n> \n> \n> \n> I think that was added to help with the Nazgul power, but I agree - too high, too often.\n> \n> I'm still trying to come up with the penalty part of her Nazgul power.  The witch king moves back to the staging area before being attacked unless threat is raised.  And it would take two or three attacks to defeat it.  So that's a general penalty.  But I'm trying it with adding 1 hit to Eowyn (and a hobbit if any) for each attack (she has 3 hit points), so 3 attacks would kill her without an intermediate healing.  And then if she does succeed in eliminating the WK she (and the hobbit) cannot be readied until...maybe adding the Athelas card(s) to the Encounter deck and requiring that one hero apply it to Eowyn.  The advantage is that this effectively takes 1 or 2 heros out of action until the 3rd (or second) exhausts to apply the Altheas (after it comes up in the deck).  So quite a tradeoff for eliminating a Nazgul.  Disadvantage - it's getting more and more complicated bringing in encounter cards from other packs and more changes to how cards work.  Not sure if this will be worth the effort, but that is one nice thing about solo.\n> \n> Tom\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=610258","commentId":610258,"userName":"twm47099","timestamp":1332763557,"content":"Bohemond said:\n\ntwm47099 said:\n\n \n\n \n\nOn cardboard of the games, in the custom card gallery there are fan designed cards for Eowyn and Bilbo (pre birthday party) that I feel are much more thematic, although Eowyn needs a penalty cost for when she eliminates a Nazgul (if Eowyn's attack reduces the Nazgul HP to 0, the Nazgul is removed from play, and Eowyn (and the hobbit, if any) cannot be readied until...(some difficult healing steps or something) --kill a Nazgul at the cost of 1 or 2 heros (my version allows one hobbit to attack with Eowyn using her special ability).  Could this be a game breaker? Sure in a Nazgul scenario, but I think it helps as a story.  And since that fan card has reduced the \"will\" strength of Eowyn significantly, she doesn't become super woman, and tradeoffs still have to be made.\n\n \n\n \n\nThe would be wary of using the fan designed Eowyn.  From a quick glance, she looks hideously broken (and it had nothing to do with the Nazghul ability).  She has two jaw-droppings powers; give her one but not both.  On top of that, her powers should be lowered so they are at least in the ball park of other heroes.  Her ability to to reduce cost of rohan cards is stupidly powerful.  At the very least, you need to reduce it to once per turn.  The counter attack power is good enough on its own, you don't need to add two attack.\n\nThis version of Eowyn may not have high will, but it makes her more of a super woman than the exsisting card.\n\n\n\nBohemond said:\n\ntwm47099 said:\n\n \n\n \n\nOn cardboard of the games, in the custom card gallery there are fan designed cards for Eowyn and Bilbo (pre birthday party) that I feel are much more thematic, although Eowyn needs a penalty cost for when she eliminates a Nazgul (if Eowyn's attack reduces the Nazgul HP to 0, the Nazgul is removed from play, and Eowyn (and the hobbit, if any) cannot be readied until...(some difficult healing steps or something) --kill a Nazgul at the cost of 1 or 2 heros (my version allows one hobbit to attack with Eowyn using her special ability).  Could this be a game breaker? Sure in a Nazgul scenario, but I think it helps as a story.  And since that fan card has reduced the \"will\" strength of Eowyn significantly, she doesn't become super woman, and tradeoffs still have to be made.\n\n \n\n \n\nThe would be wary of using the fan designed Eowyn.  From a quick glance, she looks hideously broken (and it had nothing to do with the Nazghul ability).  She has two jaw-droppings powers; give her one but not both.  On top of that, her powers should be lowered so they are at least in the ball park of other heroes.  Her ability to to reduce cost of rohan cards is stupidly powerful. \n\n[/Quote]\n\nI agree, and its not very thematic - I don't recall in the book her rallying the troops.\n\n> At the very least, you need to reduce it to once per turn.  The counter attack power is good enough on its own, you don't need to add two attack.\n> \n> \n> \n> I think that was added to help with the Nazgul power, but I agree - too high, too often.\n> \n> I'm still trying to come up with the penalty part of her Nazgul power.  The witch king moves back to the staging area before being attacked unless threat is raised.  And it would take two or three attacks to defeat it.  So that's a general penalty.  But I'm trying it with adding 1 hit to Eowyn (and a hobbit if any) for each attack (she has 3 hit points), so 3 attacks would kill her without an intermediate healing.  And then if she does succeed in eliminating the WK she (and the hobbit) cannot be readied until...maybe adding the Athelas card(s) to the Encounter deck and requiring that one hero apply it to Eowyn.  The advantage is that this effectively takes 1 or 2 heros out of action until the 3rd (or second) exhausts to apply the Altheas (after it comes up in the deck).  So quite a tradeoff for eliminating a Nazgul.  Disadvantage - it's getting more and more complicated bringing in encounter cards from other packs and more changes to how cards work.  Not sure if this will be worth the effort, but that is one nice thing about solo.\n> \n> Tom\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62159-to-other-pure-solo-players-ffg-designersplease-read-this/?do=findComment&comment=610504","commentId":610504,"userName":"booored","timestamp":1332810225,"content":"I'm a big fan of custom quest, and have about 20 or so printed out and ready to play.. many of them are as good and a few better than the official ones.. .but custom player cards are a big no no for me... they are always wicked broken.\n\nthere is an old saying \"Never let a player design a card\" this has come about from a lot of CCGs get players who win world championships or some special event to design a card.. they have always sucked and been banned or restricted.\n\nAll the player cards I have seen in custom decks have had the same problem. The best thing I have seen is objective cards, I thik thsi ia a good way to add special effects into your custom quest with out making a player card that upsets teh entire balance of teh game for other scenarios.\n\nI just think ... custom quest == ok.. custom player cards !ok\n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"}]}