{"url":"https://community.fantasyflightgames.com/topic/62185-ranged-attacks/","title":"Ranged attacks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62185-ranged-attacks/?do=findComment&comment=608771","commentId":608771,"userName":"Sprenger","timestamp":1332384186,"content":"After giving it some though I think I might need a ruling on how ranged characters can help other player's character attack an enemy they already attack this round. I have provided below the actual rules for Ranged and Attacks so let me know if I am in the green or not.\n\nSo I was doing the Witch King quest the other day and well I'll just give you the turn by turn break down\n\nStarting with Player Attack phase\n\nSpirit passes -\n\nTactics -\nDeclared Boromir (+3 AS)  and Gimili (+7 AS +1 autodamage) as attackers against the Witch King\nThey deal (7+3-6=4 +1) 5 damage to the Witch King\nRaise threat by 1 to Ready Boromir\n\nLore - \nErebor Record keeper - Pay 1 Lore resource and exhaust to Ready Gimili\n\nLeadership-\nDeclare ranged attack with Silverlore Archer against the Witch King\n\n***************************************************************\n*********Pausing Right Here********************************\n\nIn my game Gimili and Boromir joined the Archers attack based on the Witch King being assigned to the Tactics player. This allowed for the Witch King to be dropped in one round. I would like to think that is how it can be done however I not sure if the Tactics player can declare attackers without the Keyword ranged when it is not their active attack phase.\n\n***EDIT***\nIt seems like the Tactics heroes would have to have the keyword Ranged to join in this attack. Which begs the question how does one simply attack the same dude twice in the same round?\n\n \n\n(1.11) Limitations on Attacks\nWhen a player is the active attacker during the combat\nphase, the game rules grant him the option to declare\n1 attack against each enemy with which he is engaged.\nIf, through card effects such as ranged, a player is able\nto declare attacks against enemies with which he is\nnot engaged, he is still only permitted a single attack\nagainst each of these enemies.\nCharacters are not limited as to how many times they\ncan participate in attacks against the same enemy,\nprovided each attack can be legally declared, and the\ncharacter is ready and eligible to be declared as an\nattacker.\n\n \n\nRanged\nA character with the ranged keyword can be declared\nby its controller as an attacker against enemies that are\nengaged with other players. A character can declare\nranged attacks against these targets while its owner is\ndeclaring attacks, or it can participate in attacks that are\ndeclared by other players. In either case, the character\nmust exhaust and meet any other requirements\nnecessary to make the attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62185-ranged-attacks/?do=findComment&comment=608785","commentId":608785,"userName":"Dam the Man","timestamp":1332386174,"content":"Sprenger said:\n\n***EDIT***\n\nIt seems like the Tactics heroes would have to have the keyword Ranged to join in this attack. Which begs the question how does one simply attack the same dude twice in the same round?\n\nEven if Boro and Gimli had Ranged, they couldn't join in on an attack against the WK, because (from the rules you quote below):\n\n\"A character with the ranged keyword can be declared\nby its controller as an attacker against enemies that are\nengaged with other players.\"\n\nand WK is engaged with the Tactics player.\n\nAs to why Ranged can effectively make two attacks (providing you can ready them), it is again stated in the bits you quoted. Players can only make one attack per turn against an enemy, but characters can chip in for more attacks if able. Ranged participating in an attack isn't making an attack in itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62185-ranged-attacks/?do=findComment&comment=608808","commentId":608808,"userName":"starhawk77","timestamp":1332393057,"content":"I agree with Dam. IF the Witch-King were engaged with, say, the Lore player, and IF Boromir/Gimli managed to acquire the ranged keyword (through Dunedain Cache), they would be able to:\n\n1. Make a declared ranged attack during the Tactics player's attack step (using the keyword to attack an enemy engaged with another player).\n\nand\n\n2. After readying via card effects, participate in an attack declared by another player during a subsequent portion of the combat phase. \n\nAs Dam pointed out, you can only DECLARE one attack against each enemy per combat phase, but ranged characters can PARTICIPATE in multiple attacks against the same enemy.\n\nBased on the situation presented, though, Boromir and Gimli wouldn't be able to attack the WK twice. However, the Silverlode Archer could, provided its controller found some way to ready it between attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62185-ranged-attacks/?do=findComment&comment=608831","commentId":608831,"userName":"booored","timestamp":1332397273,"content":"The simple rule is this...\n\n * Any character can only attack the same enemy once per round\n\nThat is it... no matter what tricks you have, keywords, untap effects.. w/e... there is a hard rule that (for now) there is no way to get around, and this limits any one character from attacking the same enemy twice... end of story. You can untap and attack as many enemies as you like.. but not the same enemies twice.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62185-ranged-attacks/?do=findComment&comment=608849","commentId":608849,"userName":"guest479094","timestamp":1332399498,"content":"Step 1 of Attacking Enemies is \"Declare target of attack, and declare attackers\". The difference is in what a player can do (declare an enemy as target of an attack only once on their turn) and what a character can do (be declared as attacker in any number of attacks on any enemy, even the same one).  This lets a ranged character participate in a second attack (or third or fourth) on the same enemy as long as each attack is being declared by a different player and the character is ready *before* that enemy is declared as a target.\n\nSo, in a 4 player game, if each player had a ranged character, it is possible for the same enemy to be attacked 4 times (once per each player) with every ranged character being declared as attackers each time...assuming they had some way to be readied each time. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62185-ranged-attacks/?do=findComment&comment=608854","commentId":608854,"userName":"guest479094","timestamp":1332400075,"content":"booored said:\n\nThe simple rule is this...\n\n * Any character can only attack the same enemy once per round\n\nThat is it... no matter what tricks you have, keywords, untap effects.. w/e... there is a hard rule that (for now) there is no way to get around, and this limits any one character from attacking the same enemy twice... end of story. You can untap and attack as many enemies as you like.. but not the same enemies twice.\n\n \n\n\n\nThis an incorrect statement of the rule. Instead, the rule says that a *player* can declare an attack against an enemy once per round. The FAQ clarifies that this applies only to declaring targets of attacks but does not restrict *characters* from being declared as attackers against the same enemies multiple times in a round. "}]}