{"url":"https://community.fantasyflightgames.com/topic/62225-bombur/","title":"Bombur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609232","commentId":609232,"userName":"muemakan","timestamp":1332471005,"content":" Anyone liking Bombur?\n\n \n\n--Bombur (Lore)\n\nType: Ally\nTraits: Dwarf.\nCost: 3\n0 Willpower\n0 Attack\n1 Defense\n3 Health\n\nAction: Exhaust Bombur to choose a location. That location gets -1 (Threat) until the end of the phase. (That location does not contribute its (Threat) instead if it is an Underground location.)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609241","commentId":609241,"userName":"Dam the Man","timestamp":1332473591,"content":"Not getting in the game for me. Heh, auto-dead at Redhorn Gate 3B, even without Caradhras."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609242","commentId":609242,"userName":"lleimmoen","timestamp":1332473704,"content":"Very disapointing. Not bad Underground but I prefer playing above ground so I will sadly leave this guy home eating pies, well that might not be sad afterall."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609245","commentId":609245,"userName":"richsabre","timestamp":1332473778,"content":"hahaha...yeah they could have made some funny actions with bombur- whats the artwork like?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609246","commentId":609246,"userName":"lleimmoen","timestamp":1332473893,"content":"Thinking about the card, I really think they did a bad job here. Why are these his stats? I would like something similar to his brother just not for questing (as I find his Willpower of 0 logical) but fighting, like play him for 1 resource in a Combat phase, return him when he kills (or something), and his Attack would need to be at least 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609258","commentId":609258,"userName":"starhawk77","timestamp":1332477490,"content":"Totally disagree with the above. He's a stud. Think about how many Underground locations there are in K-D (and, most likely, the next several APs). Now think about how many of those have threat values in the 3-5 range. There are quite a few.\n\nIf one such location is in play, Bombur is effectively an ally with 3-5 willpower. That's not good--that's fantastic. Just ignore the Zigil Mineshaft/Darkened Hallway and use Bombur to negate its threat every round. Worst comes to worst, he's a meat shield who'll likely be able to tank at least two attacks. Of course he's terrible in The Redhorn Gate (and probably not worth using through most of the Shadows of Mirkwood cycle), but he'll rock in K-D and probably most of the Dwarrowdelf cycle. I think he's being severely underestimated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609269","commentId":609269,"userName":"Eric W","timestamp":1332479973,"content":"And a year from now when they stop making underground locations he'll suck again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609271","commentId":609271,"userName":"richsabre","timestamp":1332480349,"content":"Eric W said:\n\n \n\nAnd a year from now when they stop making underground locations he'll suck again.\n\n \n\n \n\nthis is an interesting point- i mean theres ancestral knowlege which main use is for this cycle and a few others that dont come to mind yet, but bomburs the only ally working this way at the moment i think\n\ni think he'll still have a use, but it will be very reduced\n\nalso i think a year is pushing it- dwarrowdelf will end about august -ish time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609280","commentId":609280,"userName":"muemakan","timestamp":1332483514,"content":" I like the art. But I think they should have gone with -2 for his ability. This would make him more useful if you stay above ground. \n\nMost dwarf decks have got Dain, so he could just quest instead of using his ability. \n\n \n\nWell I guess there point is: because he is so fat he would block small tunnels in those underground locations, so no enemy could come through and therefore no threat......\n\n \n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609290","commentId":609290,"userName":"richsabre","timestamp":1332485770,"content":"haha i can see that poor bugger getting some greif before this cycle's out"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609331","commentId":609331,"userName":"gatharion","timestamp":1332493927,"content":" I would have liked to see a higher defense or something.\n\nThe ability is useful, in some quests, but it makes him a one-trick pony and a tad pricey."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609354","commentId":609354,"userName":"Doom1502","timestamp":1332498217,"content":"I guess it depends on the upcoming Moria-Quests how much play Bombur will see. I like it that he made it into the game, but I tend to agree with you, muemakan, with -2 would have been far better (or a reduced cost)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609370","commentId":609370,"userName":"Dam the Man","timestamp":1332500444,"content":"gatharion said:\n\nThe ability is useful, in some quests, but it makes him a one-trick pony and a tad pricey.\n\n\n\nThis. Bombur is yet another 3-cost Lore ally and he has quite a bit of competition in that cost-range. I think I'd rather toss out Longbeard Map-Maker this turn and use the extra resources turn following to quest for more. Clearing locations > keeping them in play, even at 0 threat (although only Orc Horse-Thieves from Emyn Muil get boosted by locations so far, have there been others?). Silvan Tracker, Silvan Scout, Ravenhill Scout at least. Not saying Bombur would've been more desirable as Leadership ally for example (although LS is still quite short on allies), but in Lore he has a ton of competition, even one of his own race (for theme deckers)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609382","commentId":609382,"userName":"richsabre","timestamp":1332502740,"content":"i will look forward to the day that longbeard gets beaten in dwarf questing power- its gonna take a **** good ally to do that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609424","commentId":609424,"userName":"starhawk77","timestamp":1332509429,"content":"Eric W said:\n\nAnd a year from now when they stop making underground locations he'll suck again.\n\n\n\nMaybe. But if a card is pretty useful for a full year in an LCG format, that's nothing to sniff at. Look, I'm not saying he's the next Steward of Gondor or anything of that caliber. He's too scenario-specific to be a total game-changer. In fact, I probably wouldn't run more than one copy of him, since I agree that Longbeard Map-Maker will be more useful in a wider variety of situations. Still, if you do happen to be playing a scenario with plenty of Underground locations, Bombur is worth his (considerable) weight in gold.\n\nAlso, Moria is hardly the only part of Middle-earth that could produce Underground location cards. The Barrow-Downs, the Paths of the Dead, etc. So, I wouldn't be so quick to assume he'll only have value within this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609428","commentId":609428,"userName":"Dam the Man","timestamp":1332510153,"content":"starhawk77 said:\n\nthe Paths of the Dead, etc.\n\nWill they make it \"one of the heroes must be Aragorn\" or throw him in as an ally?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609436","commentId":609436,"userName":"richsabre","timestamp":1332511967,"content":"or some sort of objective card.........."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609455","commentId":609455,"userName":"Bomb","timestamp":1332514008,"content":"There are currently several cards that are have specific uses in only a few quests.  I think having the same player deck for all quests would be boring.\n\nIf I am against underground locations, then maybe I will use this character.  The question is, how is he different than an ally with 1, 2, or 3 willpower? Most Underground locations have that threat, right?\n\nThe best part about his ability is that you can use it after you commit characters and reveal encounter cards... so you can help determine your own progress on that quest phase based on what comes out.\n\nIf not locations come out though, he is a worthless piece of ****, and that's where a Willpower character will help you more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=609992","commentId":609992,"userName":"lleimmoen","timestamp":1332689971,"content":"I too would not have found him over-powered if he could decrease the threat of a location by 2 (if not Underground). Then he would be tempting inclusion as it would become a nice way to control progress after staging... I really cannot think he could be considered too strong then though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=610391","commentId":610391,"userName":"Shelfwear","timestamp":1332780704,"content":"Why he does cost 3? Neither his stats nor his ability justifies this cost (plus he is unique). And concerning his ability when playing a scenario with underground locations: I want questing power, having quest progress and getting rid of locations and not keep their threat low and let them pile up in the staging area... Even with Dain in play Bombur is mediocre.\n\nThe only credit I give the game designers is that they captured perfectly the feel for the fat loser among Thorin's company who does nothing than getting the others in trouble..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=610571","commentId":610571,"userName":"lleimmoen","timestamp":1332826883,"content":"I know inter-sphere comparisons are awkward but it is hard not to compare Bombur with Arwen. Are his stats and ability really worth the cost increase, I wonder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=610714","commentId":610714,"userName":"ragnarhedin","timestamp":1332854881,"content":"If he is negating 3, 4, or even 5 threat from an underground location, he's completely worth it.  So a situational card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62225-bombur/?do=findComment&comment=610774","commentId":610774,"userName":"gatharion","timestamp":1332865112,"content":" I'd rather just play Secret Path for one cost and then deal with the location in another way.\n\nLike I said, if he had one more defense then I'd like him.\n\nLocations clogging your staging  area? Yay he's useful! Enemies clogging your staging area? one higher defense would mean he could hold hold off most enemies for awhile. Really he's just too situational for me to like him."}]}