{"url":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/","title":"Watcher in the Water","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610073","commentId":610073,"userName":"Chris51261","timestamp":1332715553,"content":" Is anybody else especially excited for the next adventure pack? I mean, obviously when a new adventure pack is coming out everyone gets anxious for it, but for whatever reason I'm really looking forward to this one. The Watcher was one of my favorite monsters in the Lord of the Rings universe, and I can't wait to see him (or at least his tentacles) in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610092","commentId":610092,"userName":"starhawk77","timestamp":1332721295,"content":"Yeah, I'm pretty stoked for this pack. The Watcher is awesome, and I'll be interested to see how FFG represents it. We've already seen the \"Wrapped\" treachery--will there be tentacle enemies as well? Also, I believe the Doors of Durin will be in this AP, and I'm really excited to see how that effect actually plays. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610135","commentId":610135,"userName":"richsabre","timestamp":1332739159,"content":"yeah im looking forward to that one, in fact im looking forward to every pack- they just seem to be getting better\n\nive always loved the art of the doors- especially given that theyre all based on tolkien's sketches"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610146","commentId":610146,"userName":"lleimmoen","timestamp":1332739966,"content":"Me too. And I know not everyone around is fan of the movies but seeing the door \"come alive\" there was a big treat for me.\n\nI hope to see a preview today or soon, with a player card or two perhaps, that'd be nice..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610149","commentId":610149,"userName":"richsabre","timestamp":1332740401,"content":"yeah we should see a preview today as everythings up to date at the moment"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610288","commentId":610288,"userName":"player1761766","timestamp":1332768833,"content":"Definitely looking forward to this one! Perhaps not as much as #5, with all the Nameless Things and stuff going on, but I'm like starhawk77, I'm really intrigued as to how they're going to represent this beastie!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610389","commentId":610389,"userName":"Ezel","timestamp":1332780169,"content":"First preview is out:\n\nwww.fantasyflightgames.com/edge_news.asp [http://www.fantasyflightgames.com/edge_news.asp?eidn=3171]?eidn=3171"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610407","commentId":610407,"userName":"Chris51261","timestamp":1332782364,"content":" Lol, and as if I needed another reason, Arwen is one of the best allies to date!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610409","commentId":610409,"userName":"richsabre","timestamp":1332783009,"content":"if arwen looks like that can you imagine what luthien would look like-----yeah imagine that one lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610539","commentId":610539,"userName":"hildargo","timestamp":1332818266,"content":"I would buy this adventure pack if it were just the two cards that were previewed. Arwen is pretty ridiculous at a cost of 2, and Elrond's Council is pretty sweet as well. If you play Spirit and these cards aren't in your deck, you are crazy. The one thing that did make me scratch my head though was FFG suggesting to play Elrohir without Elladan. Any thoughts on that strategy? For one, I don't understand why you would play one without the other, and two, they seem to be the cornerstones of a tank deck, not a secrecy deck. In my opinion, our Noldor heroes are not well suited for secrecy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610549","commentId":610549,"userName":"lleimmoen","timestamp":1332819974,"content":"Totally, the brothers are not for secrecy as I thought they would be. The one thing though, you need not play them in one deck in a coop, but even then they will probably lose some of their potential.\n\nI think (and very much hope) we shall see another Noldor hero in the cycle. And that likely to be of the Spirit sphere. Maybe Elrond will show up at the end of it but perhaps there will be one already in this pack, as there was a hint to see the hero in the third preview. I am bound to think the hero should combo with these two previewed cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610552","commentId":610552,"userName":"Drengi","timestamp":1332820365,"content":"Well in secrecy I guess running just 2 heroes is a benefit as it keeps your threat low.\n\n \n\n If running 2 heroes you need someone (or 2 people) who can have more than 1 action a turn... Elladan and Elrohir can both do this, as can Aragorn and Boromir (even Imrahil). In the case of the first 3 it costs resources, but the secrecy mechanic lowers the cost of everything meaning you can aford to take these actions.\n\n Characters like Boromir and Frodo would, I think, be even more beneficial as you dont even have to pay resources to ready... although you do take a threat hit with both of them making it even harder to keep under 20!\n\n \n\n Personally I think one of the keys to secrecy will be the Spirit Dwarf Hero (Dwalin??). His lowering your threat by 2 for an orc kill will be nice. Get unexpected courage on him and he can either kill 2 orcs a turn or block and attack each turn. Even get the dwarf ally who can stand your dwarf heroes up for 1 resource and your laughing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610555","commentId":610555,"userName":"hildargo","timestamp":1332821315,"content":"Dwalin with the Erebor Record Keeper would be a nice threat reduction, orc killing machine. There are ways to get your threat below 20 with 3 heroes, especially if you are playing Spirit. If you are playing a deck with all 3 Rohan heroes, your starting threat will be 25. By turn two or three, depending on card draw and resources, you could potentially have your threat at 20 or below. Also, running two heroes just seems like suicide to me. There are plenty of enemies with engagement cost less than 20, and if you have some undefended attacks paired with some key shadow cards, you wave bye bye to half of your heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610562","commentId":610562,"userName":"lleimmoen","timestamp":1332823995,"content":"You can have your threat under 20 on round 1 with the Rohan deck. And the only card you need for that is the Galadhrim's Greeting. You get two resources at the start, making the third with Theodred.\n\nAlternatively, it get even easier with Frodo. He can use the Good Meal to play the events cheaper.\n\nBut to include the Noldor strategy (and Elrond's Counsel) you make do better to have a different deck entirely, I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610732","commentId":610732,"userName":"player1761766","timestamp":1332858536,"content":"On the subject of heroes, then, who do you reckon is next? I'm presuming it'll be a Lore dwarf, though I have no real solid ground for this theory, besides the fact that we've had two elves for Leadership and Tactics. Spirit and Lore are also lagging behind the other two for dwarf heroes. Hardly the best basis for a theory, but still! As to who it could be, of course, I have no clue.\n\nI'd like to see Elrond as a neutral ally in a similar mould to Gandalf. Something along the lines of allowing you to look at the top 5 cards of the encounter deck, and discard up to as many as there are players in the game. But then you have to discard him at the end of the round. Or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610746","commentId":610746,"userName":"richsabre","timestamp":1332859982,"content":"the problem with that is that in a solo game he d do no more than out of the wild- but i like your thinking\n\ni reckon it will be a completely random one like sam- i mean they did it with imrahil and brand"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610750","commentId":610750,"userName":"lleimmoen","timestamp":1332860535,"content":"I hope and believe it is not another Dwarf. We have got 6 Dwarven heroes already. If they bring another or two, how long will it take for other nations to catch up? I know Hobbits will never match that up but Silvan, Noldor, Gondor and Rohan should eventually. They play no smaller part in the universe I feel.\n\nFrom the clue in the preview it would be fair to assume it is going to be yet another Noldor to combo with the cards previewed yesterday. But I have a hunch three in a row might be too much (unfortunately). The major trait that is lacking most at the moment is Silvan obviously. And the thing is there are quite a few to choose from there, where the Dwarves are beginning to run out. We can expect all 7 remaining companions of Thorin, 5 of which have already showed up. So if another Dwarf is to show up (as either hero or ally) it may well be Dori or Nori."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610757","commentId":610757,"userName":"muemakan","timestamp":1332861815,"content":"lleimmoen said:\n\n \n\nI hope and believe it is not another Dwarf. We have got 6 Dwarven heroes already. If they bring another or two, how long will it take for other nations to catch up? I know Hobbits will never match that up but Silvan, Noldor, Gondor and Rohan should eventually. They play no smaller part in the universe I feel.\n\nFrom the clue in the preview it would be fair to assume it is going to be yet another Noldor to combo with the cards previewed yesterday. But I have a hunch three in a row might be too much (unfortunately). The major trait that is lacking most at the moment is Silvan obviously. And the thing is there are quite a few to choose from there, where the Dwarves are beginning to run out. We can expect all 7 remaining companions of Thorin, 5 of which have already showed up. So if another Dwarf is to show up (as either hero or ally) it may well be Dori or Nori.\n\n \n\n \n\n \n\nOnly Dori and Nori are left. The others are dead. Maybe they will be the last two dwarf heroes to give every sphere 2 dwarves. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610762","commentId":610762,"userName":"lleimmoen","timestamp":1332863044,"content":"Yeah, that's what I meant, they are the only ones left. Likely we shall see them before this cycle is over, not sure whether they be allies or heroes though. They could round it up for 8 but as I said, it would take a few cycles for others to catch up. On the other hand, they are probably planning on that and I hope so.\n\nAs Rich said though, I think it may be someone random. Randomness is usually the way of the world."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610778","commentId":610778,"userName":"richsabre","timestamp":1332865525,"content":"random indeed - the next pack hero will be ---- odo proudfoot (PROUDFEET dammit!!!) haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610825","commentId":610825,"userName":"qwertyuiop","timestamp":1332882646,"content":"muemakan said:\n\nOnly Dori and Nori are left. The others are dead. Maybe they will be the last two dwarf heroes to give every sphere 2 dwarves. \n\n\n\nThere's still that Thorin floating around. Maybe we get a Hobbit deluxe expansion in time for the movie in December..marketing being what it is.  I don't know just HOW timeline strict this game really is. Isn't Eowyn a child during this time period?  I think the big question is whether the hero is Spirit or Lore, and if it's Spirit..could we see a Rohan hero? Or maybe another MEQ hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610862","commentId":610862,"userName":"lleimmoen","timestamp":1332898761,"content":"Yes, we have got 3 out of 5 MEQ heroes in the core set. It would suggest we see the other two. Totally sidenoting this: I bought MEQ some three years ago, I really liked some of the components and was intrigued by the complexity but the game took so long to set up (and clear up afterwards) that we have only played it once. This card game is like the exact opposite although the cards are now all over the flat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610875","commentId":610875,"userName":"Doom1502","timestamp":1332902148,"content":"Hm, interesting. If I have no pre-built deck from my last game the Card Game takes me longer to set up.. (but I played MEQ many, many times lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610889","commentId":610889,"userName":"lleimmoen","timestamp":1332908948,"content":"That is interesting indeed. Did you build folders for all those little tokens and many different sets of cards? Not that the game would be tempting enough for me to come back to it now (that I am engaged to this one). In similar fashion, I would need to build a proper box for this one but I guess I spent all the time given to the game by deckbuilding - but it is more stimulating than tiring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610891","commentId":610891,"userName":"Doom1502","timestamp":1332910181,"content":"I didn't build folders, I use some plastic bags so I don't have to sort out any tokens and rubber bands to hold the cards together and additionally a little plastic box for the miniatures and characters. So the longest task is basically to shuffle all the cards. Maybe you will come back to it sometimes later gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610937","commentId":610937,"userName":"lleimmoen","timestamp":1332922490,"content":"Maybe. If I do, I will definitely have to organize. As I said, I really found the game interesting, the different colours for instance were really exciting. Unlike the grey figures though, two of which came already broken. Anyway, thanks for the tip and enjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610962","commentId":610962,"userName":"Sprenger","timestamp":1332926242,"content":"I don't know alot of the characters in LOTR but I think it would be cool to finally get a Wizard hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=610966","commentId":610966,"userName":"Sprenger","timestamp":1332926403,"content":"Like the Blue Wizards\n\n \n\nThe Blue Wizards (or the Ithryn Luin) were two notoriously mysterious characters of Middle-earth. They were only hinted at in The Lord of the Rings, where Saruman says there are five Wizards. However, other writings of Tolkien have more to say. In a writing found in Unfinished Tales (p. 393), Tolkien writes that the two Wizards were sent to the East. Their names in Valinor were Alatar and Pallando, and they are Maiar of the Vala Oromë.\n\n \n\nIn a letter, Tolkien says that the two wizards went into the East, and likely failed their mission, perhaps having started magical cults. However, all of this changes in a text written in the last year or two of Tolkien's life (published in HoME 12). An alternate set of names are given - Morinehtar and Rómestámo (or Rome(n)star), Darkness-slayer and East-helper. It is not clear whether these names were intended to be replacements for Alatar and Pallando or whether they were a second set of names (for instance, their names used in Middle-earth). They are said to have arrived not in the Third Age, but in the Second, around the year SA 1600, the time of the Forging of the One Ring. Their mission though is still to the east, to weaken the forces of Sauron. And it is here said that the Wizards far from failed; rather, they had a pivotal role in the victories of the West at the end of both the Second and the Third Ages. At the same time, Tolkien considered the possibility that Glorfindel may in fact have come back to Endor (Middle-earth) around the same time as the Blue Wizards, perhaps even along with them.\n\nLike most names in Tolkien's works, the names of the Blue Wizards are significant. The name Romestamo means East-helper, coming from the Quenya word romen, meaning uprising, sunrise, east. Here, Rómestámo incorporates not only his relation to the East of Middle-earth, but also his mission there: to encourage uprising and rebellion against Sauron. Similarly, Pallando may include the Quenyan palan meaning far and wide.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=611023","commentId":611023,"userName":"richsabre","timestamp":1332937548,"content":"blue wizards would be nice, though i dont think we'll see them yet....they have zero basis in the events of middle earth, looking at the material so far ffg have no interest in the history drafts or letters, as they have enough work cut out with the conventional characters\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62320-watcher-in-the-water/?do=findComment&comment=614452","commentId":614452,"userName":"player1761766","timestamp":1333718184,"content":"richsabre said:\n\nblue wizards would be nice, though i dont think we'll see them yet....they have zero basis in the events of middle earth, looking at the material so far ffg have no interest in the history drafts or letters, as they have enough work cut out with the conventional characters\n\n \n\n\n\nAgreed. It would be nice to see some of the more exotic locations in middle earth (Haradhrim! Please!), but there's still so much to be exploited yet I wouldn't've thought they'd get over there for a while yet. If we ever do, maybe in three or four years' time, I'd imagine they'd turn up as allies of some sort.\n\nThis talk of wizards puts me back in mind of that now ancient debate on how, if at all, Saruman will feature in this game lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\nI still think it'll be a dwarf we're in for next, though going off the Mirkwood cycle, the first two packs have connected-heroes, followed by a completely random element, so we may hear the pitter-patter of proud feet after all..."}]}