{"url":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/","title":"Rules can be clearer.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610366","commentId":610366,"userName":"Ken on Cape","timestamp":1332777738,"content":"I posted this over on BBG. I wanted to get FFG thoughts:\n\nI feel some of the wording on cards conflict with the rules. FFG needs to be clearer. For example:\n\nRulebook says if there is an active location, you put progress tokens on location instead.\n\nRulebook also says wording on the cards supercide anything in the rulebook.\n\nLegolas card says you put progress tokens on quest card for killed enemy. It says quest card, not location.\n\nBut I also read the offical ruling is if there is a loction active when Legolas's ability resolves, it goes on the location.\n\nCan anyone else see how this can be confusing?\n\nI can see how both ways can work.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610374","commentId":610374,"userName":"Bomb","timestamp":1332778293,"content":"The rule book also says that progress that is meant to be placed directly on the quest card is instead placed on the active location.  Not sure if that helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610379","commentId":610379,"userName":"richsabre","timestamp":1332778906,"content":"the problem with a rule book is that it needs to be both clear and short(ish).\n\nits a hard job to get this mix correct- i dont think they have done bad and yet it could be lot better.\n\ngenerally im glad for the faq and forum....the box should come with a copy of the faq and a link here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610419","commentId":610419,"userName":"booored","timestamp":1332785031,"content":"FFG is infamous for having terrible rules and overly thick faqs. This is a common thing in almost all their products, if you go to BGG and find the \"why do peopel hate FFG\" thread you will see example after examples cited, though of course people still love the company as the games are good, though they require a lot of custom rules and / faqs / community assumptions.\n\nThis game is particularly bad, especially as card game fans have a certain amount of \"rules lawyer\" inside them and come form other games that are duel environments and expect rock clad iron wording so there is zero ambiguity.\n\nIn short, yes everyone agrees with you. The game is worth trying to wade though it though.\n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610421","commentId":610421,"userName":"richsabre","timestamp":1332785328,"content":"booored said:\n\n the \"why do peopel hate FFG\" thread \n\n\n\nha! does this really exist?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610433","commentId":610433,"userName":"SiCK_Boy","timestamp":1332787557,"content":"An easy solution to the rule quoted by the OP would have been to define an expression such as \"scoring progress\". The rules could state that scoring progress means putting progress tokens on the current quest or, in the case where there is an active location, on the active location. Then they could have worded Legolas's ability to say you can \"score 2 progress\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610452","commentId":610452,"userName":"guest479094","timestamp":1332796130,"content":" They haven't done bad...in fact, for FF it's pretty darn good :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\nHowever, if they are to stay in the card game business, they need to do better. Mostly it's little stuff, but in games like this, the little stuff matters and a bunch of little problems can be cumulative in effect. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610455","commentId":610455,"userName":"guest479094","timestamp":1332796894,"content":" As to the problem of the OP, I mostly disagree. I think that sort of confusion stems from a misunderstanding of what it means that a card text supersedes the rules. Supersession occurs only if the text *contradicts* the rules. So the rules say that whenever tokens would be placed on a quest they instead go to the active location. Since the Legolas text does not contradict this rule (ie it doesn't say to ignore the active location) the rule is still active. One might argue that such a system is overly complex, but it's not really unclear. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=610498","commentId":610498,"userName":"booored","timestamp":1332809419,"content":"Anodos said:\n\n \n\n They haven't done bad...in fact, for FF it's pretty darn good :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\nsad but true :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] heh heh\n\nI think it is just people coming from competitive CCGs are used to much more rock solid wording. There are conventions in CCGs that span the games that assist in making the rules easier to digest, this game also breaks from some of these long held traditions, and this adds to confusion as well.\n\n \n\n7775589.png [http://www1.picturepush.com/photo/a/7775589/img/7775589.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=611384","commentId":611384,"userName":"Thia Halmades","timestamp":1333012317,"content":"Amusingly, this is the very first rule I got wrong. I agree with Sickboy, that a re-naming and clarification of the mechanic would have made it easier to digest -- Legolas awards two progress tokens. Solved. Where are we progressing right now? This quest. SWEET. I also agree with the team in general; the game is inherently complex and it does things in different ways than we're accustomed from other CCGs.\n\nFar from the worst RAW I've seen, but not quite as concise as Death Angel. Then again, Death Angel is a comparatively less complex game. ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62352-rules-can-be-clearer/?do=findComment&comment=611473","commentId":611473,"userName":"The_Fallen_Arises","timestamp":1333027078,"content":"I started a thread a while back calling for an updated rulebook...It would definately be a wise decision. So much has changed, and so many timing questions have been asked and answered with sometimes contradictions as a result. At least, I wish FFG would give us an updated FAQ since it's been a while..."}]}