{"url":"https://community.fantasyflightgames.com/topic/62598-new-to-game-thematic-question/","title":"New to Game - Thematic Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62598-new-to-game-thematic-question/?do=findComment&comment=612620","commentId":612620,"userName":"PorthmeusGames","timestamp":1333370391,"content":"I just picked up the game after hemming and hawing for months. I'm a huge Tolkien fan and I was really impressed with the art and the idea of exploring the world in a way not covered so much by Tolkien's books.\n\nMy question may be nit-picky and I openly acknowledge it, but where is all of this supposed to be happening?\n\nIf the rules say heroes must be committed to quests and are thereby exhausted, I assume they are the ones going on the quest to deliver Thranduil's message to Galadriel. But then, when they are attacked from the staging area, the ones going on the quest are the ones who can't defend or attack???\n\nOnly the heroes and allies who did not go on the quest (or are subsequently readied - I get that part) can defend and attack? I'm not seeing how this makes thematic sense. I get how it affects the rules - that only those committed to the quest do battle with its threat level. But then only those who are not committed to the quest are available for combat...\n\nAm I missing something? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62598-new-to-game-thematic-question/?do=findComment&comment=612624","commentId":612624,"userName":"richsabre","timestamp":1333370673,"content":"well it depends on how you see it....at the end of it, the game has to function a certain way, im theme obsessed, so i sort of see it differently....ill have a think about this one :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\ni think they all GO along, but some are focused on the journey, ie quest and some a focused on protection and fighting"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62598-new-to-game-thematic-question/?do=findComment&comment=612631","commentId":612631,"userName":"Budgernaut","timestamp":1333371446,"content":" I think it depends on what you think questing is. The way I see it, the scenario is a quest, but the quest phase is different. So all your characters (allies and heroes) are on the quest as part of a fellowship, but they have a particular goal as per the scenario setup. The ones who quest during the quest phase are busy trying to make sure the quest progresses and abstractly accomplish the scenario goals, so they can't be bothered by attacking and defending. But I still think all the characters are present together; the questers aren't leaving anyone behind, they're just busy, usually making sure the fellowship knows where they are going (especially with active locations). If they were leaving the others behind, it wouldn't make sense that an undefended attack can damage Eowyn after she's quested."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62598-new-to-game-thematic-question/?do=findComment&comment=612700","commentId":612700,"userName":"PorthmeusGames","timestamp":1333382167,"content":"These explanations make sense as a justification. Maybe Aragorn is off searching for a trail while Gloin is guarding their campsite when the giant spider attacks... You could justify readying Aragorn saying he had a premonition or saw sign of the attackers heading toward the camp and rushes back to help... Although, his then rushing off again while engaged with an opponent only to come rushing back again stretches credulity...\n\n \n\nAs a game designer myself, I do understand the need for mechanics to work. As a player and fan of thematic games, it seems like a stretch. Too late now, of course, I just wondered what others thought and how they justify it, if they bother.\n\n \n\nSeems like a fun game and I'm still working on the nuances of the rules to noodle out the game.\n\n "}]}