{"url":"https://community.fantasyflightgames.com/topic/62591-mountain-warg/","title":"Mountain Warg","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62591-mountain-warg/?do=findComment&comment=612570","commentId":612570,"userName":"Rashley","timestamp":1333362873,"content":"Other enemies have the same ability which returns it to the staging area after it attacks, if it is dealt a shadow card with no effect.  I never had a problem with this and returned the enemy if its shadow card section was blank.  However, I was attempting the latest quest and  someone said that a shadow card might not be blank, but still have 'no effect'.  I got Black Uruks as a shadow, which only has an effect if the attack is undefended.  Normally I would not return the Wargs, but strictly speaking, this shadow card did have 'no effect'.  What is the official ruling of 'shadow card with no effect'?  This may have come up much earlier, long before Mountain Warg came into being, but since I thought I had no problem, I never checked. \n\nHopefully it is only shadow cards with no shadow section that count as that is the simplest solution.  The other opens the proverbial 'Can of Worms'.  Eg:- A shadow card may add to the attack of the enemy, but if the defender has enough defence, it wont 'effect' the game, only the Warg.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62591-mountain-warg/?do=findComment&comment=612579","commentId":612579,"userName":"Bomb","timestamp":1333364107,"content":"Just because a Shadow card has a shadow effect that has no effect on you, does not mean it had no shadow effect.  A Shadow effect has the text \"Shadow:\" in bold that precedes the text of the effect.  If you find a way to cancel it, it has no effect on you as well, but it was still a Shadow effect.  It can trigger and tries to do something to you, but the effect does not always resolve completely or successfully."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62591-mountain-warg/?do=findComment&comment=612619","commentId":612619,"userName":"starhawk77","timestamp":1333370166,"content":"Yeah, Bomb is right. If the revealed card has that little shadow icon, it has a shadow effect. Even if it doesn't affect you, it still counts for purposes of cards like the Mountain Warg."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62591-mountain-warg/?do=findComment&comment=612633","commentId":612633,"userName":"Rashley","timestamp":1333372032,"content":"Thanks chaps!  I thought I was correct and now have something to show the doubter.  Cheers!"}]}