{"url":"https://community.fantasyflightgames.com/topic/62655-new-player-questions-about-solo-play/","title":"New Player -- Question(s) About Solo Play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62655-new-player-questions-about-solo-play/?do=findComment&comment=613133","commentId":613133,"userName":"Thalin","timestamp":1333475136,"content":"Hi all.  I am a new player.  I was wondering if there are any tips or changes anyone makes when playing solo to make the game a little more manageable?  For instance, some event cards allow actions to affect/help another player.  What are the roles of these cards ir playing solo?  Should they be removed from the deck?  Can they be applied to your own heroes if playing solo?\n\nThanks for any info. I am new to these types of games, but I think I've stepped into a whole world of geeky cool!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62655-new-player-questions-about-solo-play/?do=findComment&comment=613136","commentId":613136,"userName":"richsabre","timestamp":1333476159,"content":"hello thalin, fancy meeting you here :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nanyways i play pure solo and just play the game straight from the rules (well sometimes i mess up....haha) but many players play 2 decks, and play the other person\n\nalso some people house rule, but id recommend thinking long before taking that route\n\nalso its worth noting the game gets easier with practice, extreme loss rates are something every beginner experieces with this game\n\n the event cards that only effect two players are just that, and have no use solo\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62655-new-player-questions-about-solo-play/?do=findComment&comment=613139","commentId":613139,"userName":"SiCK_Boy","timestamp":1333476559,"content":"Some cards are effectively just plain useless in a solo game and should be removed (Renewed Friendship and Song of Earendil, for example). RichSabre complained about this a lot over the last few weeks (since the latest AP, Road to Rivendell, was put on sale).\n\nOther cards can only be partialy used. For example, Wandering Took can't switch controller in a solo game, but it's still a nice ally for its cost, just for its basic stats.\n\nOther abilities like Sentinel or Ranged are also useless, although certain scenario do allow you to use Ranged for specific effects (especialy the Journey to Rhosgopel scenario as well as an enemy in the KD expansion that you can attack in staging area with a ranged character).\n\nOtherwise, solo play is the same as multiplayer. Your resources (in the generic sense) are more limited. However, certain abilities become much stronger, especialy the \"peeking\" power of Denethor and Hemanarth Riversong. By looking at the top card of the encounter deck, you know exactly what you'll face the next turn and you can better plan your questing. In a 2 player game, you only know 50 % of what's coming at you (since the encounter deck will reveal 2 cards per turn).\n\nIf you do find solo play too difficult, you can always try playing multi-handed. You just play with 2 decks (or more), but control all of them. It's not exactly the same as playing a real multiplayer game (you're missing on the social aspect and are not, technicaly, respecting the spirit of the table talk rule; it's also easier to make strategies when you are alone with yourself), but it can be enjoyable, especialy if you're having trouble with a scenario like Escape from Dol Guldur (almost impossible solo)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62655-new-player-questions-about-solo-play/?do=findComment&comment=613190","commentId":613190,"userName":"Thalin","timestamp":1333488924,"content":"Thanks for the help.  I'll keep battling!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62655-new-player-questions-about-solo-play/?do=findComment&comment=613211","commentId":613211,"userName":"Bohemond2","timestamp":1333492147,"content":"You may already know this, but if you want to play solo you need to get into deck building.  Don't just use the starters, or take a starter deck and tinker with it slightly.   Throw out the starter deck.  Start building you own deck and be willing to use heroes and cards from multiple spheres. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62655-new-player-questions-about-solo-play/?do=findComment&comment=615876","commentId":615876,"userName":"Thalin","timestamp":1334068859,"content":"Thanks. I posted a question under Deck Building to address this.  Any help is much appreciated."}]}