{"url":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/","title":"Top news or a just a hoax?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613273","commentId":613273,"userName":"muemakan","timestamp":1333508531,"content":" I just read this preview article on the german publisher site. \n\nhttp://www.heidelbaer.de/einzelansicht-spiel/spiel/der_herr_der_ringe_lcg_khazad_dum_erweiterung-1/ [http://www.heidelbaer.de/einzelansicht-spiel/spiel/der_herr_der_ringe_lcg_khazad_dum_erweiterung-1/]\n\nIf it turns out to be true, why haven´t we heard from FFG?? \n\n \n\nThe Hobbit - Over Hill and Under Hill Expansion\nThe Lord of the Rings – The Hobbit: Over Hill and Under Hill contains three new scenarios that follow the adventures recorded in The Hobbit, the classic novel by J.R.R. Tolkien. Setting off from the Shire, Bilbo Baggins, Thorin Oakenshield,?and the company of Dwarves are pitted against Trolls, Goblins, and the riddling creature known as Gollum. In addition to these immersive scenarios, Over Hill and Under Hill also includes new heroes, treasures, and a variety of player cards that increase the customization options of the game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613290","commentId":613290,"userName":"richsabre","timestamp":1333513938,"content":"i wont hold my breath.....................seems a little far fetched\n\nsaying that when i properly wake up i may be a little more excited\n\nps the link isnt really showing anything on the site"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613294","commentId":613294,"userName":"Shiv@n","timestamp":1333514960,"content":"The link worked earlier but don't work anymore, the article has been removed..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613295","commentId":613295,"userName":"richsabre","timestamp":1333515517,"content":"ohhh perhaps some trurth may be in it- dont be surprised if this is removed too - of course it could be april fools..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613306","commentId":613306,"userName":"muemakan","timestamp":1333518908,"content":"Taking down the article so quickly could prove the point of an mistake by the publisher....\n\n\n\n Found another site mentioning it.\n\nhttp://modern-myths.com/2012/03/14/gama-the-first-24-hours/ [http://modern-myths.com/2012/03/14/gama-the-first-24-hours/]\n \nI would except this to come out in december......would be on schedule for a deluxe expansion.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613310","commentId":613310,"userName":"BiJay","timestamp":1333520440,"content":"Seems like they released the news too early. When they realized it they did put it back. Seems legit, so say hooray for more hobbits. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613327","commentId":613327,"userName":"richsabre","timestamp":1333523963,"content":"very good....so weve got this cycle, then another, then that one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613332","commentId":613332,"userName":"The_Fallen_Arises","timestamp":1333526251,"content":" Hobbits galore !\n\nThis would be one sweet deal indeed...hobbit specific card are awesome, but the pool of hobbit heroes and especially allies is kinda small (no pun intended). At last, we will witness the might of an all-hobbit fellowship ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613334","commentId":613334,"userName":"richsabre","timestamp":1333526632,"content":"im looking forward to fatty"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613368","commentId":613368,"userName":"Bohemond2","timestamp":1333531827,"content":"Why are we thinking December?  There will have to be another big-box expansion in mid summer?  I would wager that this is it.  I know the folks who run modern myths (who posted the second link), so I will ask them where they got their info."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613377","commentId":613377,"userName":"Mattr0polis","timestamp":1333533874,"content":"This would be hecka awesome if true! Can't wait.\n\n \n\nI would also guess, if this is true, that this would be the next deluxe box expansion, after the Dwarrowdelf cycle is complete."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613392","commentId":613392,"userName":"AngryMojo","timestamp":1333536834,"content":"Not only hobbits but dwarf heroes as well.  I understand most of the party is already present in one form or another, but I wouldn't mind seeing a hero version of every dwarf that went on that treasure hunt.  Maybe even more Gandalf?  Smaug as a monster?  More men of Dale?  Fillibustering trolls until the sun comes up?\n\n \n\nWhere can I sign up?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613399","commentId":613399,"userName":"muemakan","timestamp":1333537605,"content":"If the preview is correct, they must have got a license for the hobbit. Also, it would make much more sense to release the deluxe in december when the film comes out. So there should be another deluxe before that.\n\nI could even imagine this to be an additional deluxe expansion.....\n\n \n\n \n\n....also includes new heroes, treasures.....\n\nCould this mean a new kind of game mechanic or card type???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613452","commentId":613452,"userName":"Khaden","timestamp":1333543180,"content":"muemakan said:\n\nIf the preview is correct, they must have got a license for the hobbit. Also, it would make much more sense to release the deluxe in december when the film comes out. So there should be another deluxe before that.\n\nI could even imagine this to be an additional deluxe expansion.....\n\n \n\n \n\n....also includes new heroes, treasures.....\n\nCould this mean a new kind of game mechanic or card type???\n\n\n\nI think their license already covered The Hobbit, what with a few of the character's that were really only from that book and not in the trilogy (most of the cards related to Beorn and I know there are a couple of others but I am drawing a complete blank at the moment). \n\nAlso I could have sworn I read an article somewhere on the Fantasy Flight website stating that their license covered it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613493","commentId":613493,"userName":"timbolton","timestamp":1333547078,"content":"\"© 2011 Fantasy Flight Publishing, Inc., all rights reserved. No part of this product may be reproduced without specific permission. Middle-earth, The Hobbit, The Lord of the Rings, and the characters, items, events and places therein are trademarks or registered trademarks of The Saul Zaentz Company d/b/a Middle-earth Enterprisesand are used, under license, by Fantasy Flight Games. Fantasy Flight Games, Fantasy Flight Supply, and the FFG logo are trademarks of Fantasy Flight Publishing, Inc. All Rights Reserved to their respective owners.\" (my bold)\n\n- I would say the license covers the Hobbit gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] (though the fact we have characters from it in the game already would suggest they do)\n\nFantastic news if it's real, that would really be a great end to the year!\n\nThe alleged title of the gameset is the title for Chapter 4 of the Hobbit too, nice touch cool.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/cool.gif]\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613516","commentId":613516,"userName":"Budgernaut","timestamp":1333549987,"content":" This would be really neat! I'm reading The Hobbit again right now (it's been about 5 years). I've been amazed at how much stuff from the Shadows of Mirkwood cycle really came from The Hobbit. From that perspective, do you think they could do a whole cycle based on The Hobbit? And I thought the time-frame was limited to after the Hobbit, so seeing Smaug would be improbable. But I see no reason why they couldn't have us attack one of Smaug's relatives. that could be cool.\n\nAs far as the timing goes, it seems like this would have to be the next deluxe expansion or the it wouldn't come out until next year, right? I mean, in April we should get part 3 of Dwarrodelf, then May, June, July for the rest. I assume there will be a month or two break after that, but even if there isn't, you'd see an expansion in August, followed by September, October, November -- and then we'd be in the middle of a cycle in December, and I doubt they'd interrupt it with this expansion. I'm thinking this one will come out in September and they'll keep the APs focused on the Hobbit to build momentum before the movie and still have new products after the movie."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613575","commentId":613575,"userName":"starhawk77","timestamp":1333558370,"content":"It'd be interesting, but it wouldn't fit the current timeline of the game's story (insofar as one exists). Characters like Thorin are already long dead by the time \"our heroes\" chase down Gollum, enter Khazad-Dum, etc. Personally, I could care less about the FFG story--I mean, we're basically a bunch of glorified errand boys at this point--but it would present a narrative challenge for Nate and Lukas. Perhaps they could cast each of the Hobbit scenarios as tales recounted by Bilbo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613590","commentId":613590,"userName":"qwertyuiop","timestamp":1333560122,"content":"richsabre said:\n\nim looking forward to fatty\n\n\n\nAren't we all, in one way or another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613591","commentId":613591,"userName":"muemakan","timestamp":1333560338,"content":" Sorry for the confusion, I know they can use characters from The Hobbit but I thought it was stated they can only cover the time between the books.\n\nAnd for their timeline:\n\nAs I understand it, they plan to release 12 APs and 2 Deluxe expansions each year ( more or less )\n\nThey are still a little behind. It seems Dwarrodwelf should finish around june and the next cycle starts around july.\n\nBut as they receive the whole cycle as once from china they can adjust the time between each AP of the same cycle quite good.\n\nI still think we will see the elves in june and the hobbits in december.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613594","commentId":613594,"userName":"juicebox","timestamp":1333560660,"content":"To release a \"The Hobbit\" themed expansion in December would be a perfect move from a marketing standpoint, as part one of the film will be coming out then as well. (Oh, geez! I'm so excited for that!!)\n\nmuemakan, I hope you're right though, because I would love to see more Elves in between."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613620","commentId":613620,"userName":"Bohemond2","timestamp":1333564325,"content":"It just seems a little odd that they would announce a december expansion to distributers before they announce a summer expansion. the box set after next will be on stores in time for the holiday season."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613690","commentId":613690,"userName":"twm47099","timestamp":1333574323,"content":"I wonder if it will just be a delux expansion or a hybrid to bring in new customers attracted by the movie.  I would think that there will be some repeats of characters, but maybe as new cards?  If a hybrid, it could be tricky for FFG to please both new blood and the current players.\n\nI would like to see some pre-Party Bilbo adventures.  He has the right amount of sneaky adventurer in him to be interesting.\n\ntom\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613715","commentId":613715,"userName":"Dwnhmcntryboy","timestamp":1333579336,"content":"twm47099 said:\n\nI would like to see some pre-Party Bilbo adventures.  He has the right amount of sneaky adventurer in him to be interesting.\n\ntom\n\n \n\n \n\nTHIS!!! This is good stuff here. After all it was made a point that \"the Baggins's have always been troublemakers.\" It stands to reason that both Bilbo and Frodo have been in  a few \"adventures\" until their EPIC adventures.\n\nOne of my guys at the store SAID this box is supposed  to be as big as the Core Adventure set for precisely the same reasons mentioned above that I will not reiterate here.\n\nUnfortunately he  has a bad habit of hearing what they want to hear and spreading it as Canon. He was supported in the fact that FFG did spill the beans about the said set and it will indeed be Hobbit focused.\n\nI personally assume that means you will be able to build better Hobbit decks like Kazad-Dum did for Dwarves and will be about the same size. Not in fact that you will be able to play through the story of The Hobbit. Others have  attempted to kill Smaug so I would assume we will see him in much the same role as we see the Balrog currently. In essence a force to be survived rather than defeated.\n\nJust my thoughts and musing and lending another source that has heard this rumor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613740","commentId":613740,"userName":"Budgernaut","timestamp":1333585752,"content":"Dwnhmcntryboy said:\n\n Others have  attempted to kill Smaug so I would assume we will see him in much the same role as we see the Balrog currently. In essence a force to be survived rather than defeated.\n\n\n\nSay, that's not a bad idea!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613782","commentId":613782,"userName":"jhaelen","timestamp":1333595895,"content":"Looks like an April's Fool article to me..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=613853","commentId":613853,"userName":"guciomir","timestamp":1333606308,"content":"April's Fool article?\n\n2 different sources were telling that same Hobbit expansion is coming (same advertising text, same name). One of them appeared in April I believe, but the second was presented in mid March. Furthermore, when the web site was presented on this forum, it was quickly shut down. Plus, the article was not funny, nothing to laugh about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614122","commentId":614122,"userName":"SiCK_Boy","timestamp":1333645750,"content":"Maybe it'll be a \"separate\" game, but compatible. Like: The Hobbit LCG, using the same mechanics (or similar mechanics).\n\nI find it weird that they'd detract from their established timeline so soon when they've barely scratched the surface of things, but I do see the point for them to try and capitalize on the movie's release."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614159","commentId":614159,"userName":"Bullroarer Took","timestamp":1333650973,"content":" When I read the original post my first impression was that it is an expansion for Knizia's \"Lord of the Ring's\" board game.  After a second reading and some thought I still feel that way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614165","commentId":614165,"userName":"Bohemond2","timestamp":1333651924,"content":"Bullroarer Took said:\n\n When I read the original post my first impression was that it is an expansion for Knizia's \"Lord of the Ring's\" board game.  After a second reading and some thought I still feel that way.\n\n\n\n\"With the Hobbit movie on the horizon, FFG is releasing The Hobbit: Over Hill and Under Hill, an expansion to the Lord of the Rings Living Card Game.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614177","commentId":614177,"userName":"richsabre","timestamp":1333653205,"content":"Dwnhmcntryboy said:\n\n \n\ntwm47099 said:\n\n \n\nI would like to see some pre-Party Bilbo adventures.  He has the right amount of sneaky adventurer in him to be interesting.\n\ntom\n\n \n\n \n\n \n\nTHIS!!! This is good stuff here. After all it was made a point that \"the Baggins's have always been troublemakers.\" It stands to reason that both Bilbo and Frodo have been in  a few \"adventures\" until their EPIC adventures.\n\n \n\n \n\nits stated in the hobbit that bilbo was a 'sensible' hobbit before the hobbit adventure-which bascially means he ate, smoked and slept, frodo was different of course, but i hope they dont have bilbo flying about having adventures before the hobbit events, not that i can see how theyd accomplish this\n\nps. it is of course obvious why ffg are releasing it at the time they are....i have already said my opinions on this which are (in typical me fashion) not generally looked upon as wise, so i will not repeat them here....however i will say that i hope ffg continue on with their original take on middle earth and its inhabitants and continue to release card art that is classy and (with a few expections) not reliant on ripping on peter jacksons view on things....this has always been my downright absolute favourite things about this game- it does its own thing\n\nit is good for the game that ffg can use the popularity that the books will once again gain due to the films, however i hope they use it as a stepping off point, and leave the film there\n\nso yeah- really exited about this- and i have HIGH expectations.....\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614179","commentId":614179,"userName":"booored","timestamp":1333653642,"content":"What dose it matter? The entire LCG timeline is a mess anyway.. with no continuity or relation to the \"real\" story timeline.\n\nI see no reason for them not to include the hobbit film stuff.. it is not like it affects ANYTHING in the game as it is.. as there IS no time line in this game. We have characters from all over the place as well as completely FFG original made up characters that fit in no where already.. so who cares if they have charicters form the hobbit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614180","commentId":614180,"userName":"Bullroarer Took","timestamp":1333653720,"content":"Bohemond said:\n\nBullroarer Took said:\n\n \n\n When I read the original post my first impression was that it is an expansion for Knizia's \"Lord of the Ring's\" board game.  After a second reading and some thought I still feel that way.\n\n \n\n \n\n\"With the Hobbit movie on the horizon, FFG is releasing The Hobbit: Over Hill and Under Hill, an expansion to the Lord of the Rings Living Card Game.\"\n\n\n\nBohemond said:\n\nBullroarer Took said:\n\n \n\n When I read the original post my first impression was that it is an expansion for Knizia's \"Lord of the Ring's\" board game.  After a second reading and some thought I still feel that way.\n\n \n\n \n\n\"With the Hobbit movie on the horizon, FFG is releasing The Hobbit: Over Hill and Under Hill, an expansion to the Lord of the Rings Living Card Game.\"\n\n\n\nAh.  That wasn't in the original post and I hadn't tried the gama link.  I'm all for it either way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614212","commentId":614212,"userName":"Mattr0polis","timestamp":1333665106,"content":"booored said:\n\nWhat dose it matter? The entire LCG timeline is a mess anyway.. with no continuity or relation to the \"real\" story timeline.\n\nI see no reason for them not to include the hobbit film stuff.. it is not like it affects ANYTHING in the game as it is.. as there IS no time line in this game. We have characters from all over the place as well as completely FFG original made up characters that fit in no where already.. so who cares if they have charicters form the hobbit?\n\n\n\nThis. I agree with Booored.\n\nThe whole game is already giant \"what if?\" scenarios set in Middle Earth. I can have Gandalf or Bilbo or others show up where they never were in the stories. Or team-up characters with others they never met. Or even have characters die that never did. And use items and weapons they never did. Or have Bilbo get captured by the Nazgul at Dol Guldur...\n\nThis reminds me of when I used to play Star Wars CCG and certain people would complain that you could have Obi-Wan Kenobi on Cloud City or Leia fighting the Emperor on Hoth or something. They're just a card games.\n\nSo I say give us The Hobbit cards and quests and we'll run through them with whatever characters we want, just like we're already doing, and it'll be fun to see iconic people, items, places, enemies, etc.\n\n \n\nAnd what does it matter if it fits into the game's \"timeline\" if it is it's own deluxe set 'quest cycle'?\n\nFor example, I've always seen the quests as cycles like this:\n\n-Core Set quest cycle\n\n-Mirkwood cycle\n\n-Khazad-Dum cycle\n\n-Dwarrowdelf cycle\n\n-Massing at Osigiliath bonus quest\n\nand only very loosely tied together. So The Hobbit ones would be it's own new prequel cycle that you don't have to complete in the same cycle if it really bothers you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614314","commentId":614314,"userName":"player1761766","timestamp":1333692681,"content":"I actually find myself quite apathetic about the idea of a hobbit expansion. I suppose I've been expecting the Dwarrowdelf cycle to be concluded by an Elf deluxe expansion, largely because it started with a Dwarf deluxe, and it seems the entire cycle is concentrating on dwarfs and elves (this makes sense to me!) While I suppose it could be said to make good business sense to release a hobbit expansion to coincide with a hobbit movie, they've never tried to associate this game with anything other than Tolkien's written words, so why start now? I can't imagine they'd give us a new Bilbo in the likeness of Martin Freeman, so I imagine that, should this come to pass, people would be upset by thinking they were buying a movie tie-in product and end up with no cards that are in any way reminiscent of the movie they've just seen.\n\nThere is the fact that people will see the film, think \"that was good - where can I get more Middle Earth goodness?\" and start investigating other stuff, in the course of which they'll find this game. But that doesn't need the expansion to be released to coincide with the movie, just for it to be out there and available, so it could come at any point. So if this hobbit expansion is actually true, I would suspect it more likely to come out within close proximity to the end of the Dwarrowdelf cycle, not five or six months after it. And the modern myths article, under the FFG news, mentions X-Wing as being expected for release without the Star Wars LCG - X-Wing is expected this summer, but the LCG not until xmas, so why mention one December release without another when they had the opportunity? As for deluxe expansions coming only at the end of cycles, the Lannister deluxe for A Game of Thrones did come out between packs four and five of the Time of Trials cycle.\n\nAs Khazad-dum was announced roughly two months after Return to Mirkwood, and Shadow and Flame was only announced in early March, I'm guessing we'll have another month to wait until we get any official news on exactly what the next deluxe expansion will involve.\n\nSuch are my rambling, garbled thoughts gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614317","commentId":614317,"userName":"booored","timestamp":1333694039,"content":"I see what your saying here, but I think there is some really good stuff in the hobbit that would be cool in the game. Smog, obviously would be awesome. The city, the caves, the river, the Goblins, Spiders.. just a ton of really cool stuff here that can be used. Also I love the way we are invested in the dwarfs in that story and the elves are basically bad guys. I dunno, I think a hobbit expansion would be nothing but good.\n\nOtherwise my vote is for a gondor expansion set around the white tower. I would like to see more focus on the humans. We have dwarfs covered for a while and I am not a fan of elves at all and the less of them I see the better. I think it also makes thematic sense they are sparse as they are a rare race.. basically an endangered species. It is cool that there are some rare and powerful allies that are elves, and not armies of the fuckers all over the place. It has always been my hope that they use elves sparingly but that they have great effects.\n\nThe other expansion I really want to see is something about undead. There is the undead army that is in the war of t6he ring but that place is a \"real\" palce in the stories and I think there could be some awesome stuff ... I would love to run some undead in my decks.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614323","commentId":614323,"userName":"player1761766","timestamp":1333695887,"content":"Oh yeah, I wouldn't want to have Elrond or Galadriel running around with awesome powerful effects that make the game superfluous. I've always hoped, if either of them does make an appearance, it'd be as an ally like Gandalf, and you have to discard them from play once they use their effects.\n\nGondor would be really good, yeah. I'd like to see them develop the theme along the same way as Rohan has been done. I'd like to see more Dunedain too, if that could be done. Are there lots of Dunedain? Hm. Sounds like I'm basically asking for anything other than hobbits, really..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614332","commentId":614332,"userName":"richsabre","timestamp":1333697236,"content":"the point you made above spalazani pretty much agreed with what i was saying earlier- i want the expansion, as long as they keep to what theyve been doing - ie their own thing, and for them most certainly not to take tips from the films\n\nits ok becasue they wont, it would look daft if they broke their style half way through.....so i can imagine it is as you say- merely a jumping off point for people who see the films and want more\n\ntheres plenty of stuff they could bring out, plenty of other races and peoples, but i was sort of looking forward to a shire expansion where we focus on the hobbits and the shire area- and i didnt particualrly want it to be the 'the hobbit' centered, rather more 'the shire' centered so we can visit places that we see in the fellowship that arent on the way for thorins company, or even better visits places on the shire map that are never really talked about\n\nor have i missed the point here? is the expansion just going to be exactly that?...ie a shire expansion that just happens to come out the same time as the film? or is it going to focus on the hobbit?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614345","commentId":614345,"userName":"lleimmoen","timestamp":1333699981,"content":"But Khazad was announced right after Rhosgobel (the third expansion of Mirkwood) hit the stores, so in that logic, we could see announcement for the next deluxe soon. I have a hunch that next week we shall see the third part of the Watcher previews, the week later the Watcher could sell, and the week later yet, we might hear what the next deluxe is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614351","commentId":614351,"userName":"Robert McMutton","timestamp":1333702234,"content":" wWell, I see some logic in the line they are following... you know, start in the  mirkwood, following Rhovanion and back to mirkwood, going on to moria, and its surroundings, and back again. I see that a good choice now would be to explore Eriador, not sure if could do for a deluxe exp. or maybe two... one for the shire and a cycle around including adventures for bree, fornost, amon sul, barrow downs, rhudaur and ending in Tharbad, for example. Then, they could move on to Gondor. At least I would love that :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n(what a hell is writing with the mobile phone)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614436","commentId":614436,"userName":"player1761766","timestamp":1333715384,"content":"richsabre said:\n\n \n\nthe point you made above spalazani pretty much agreed with what i was saying earlier- i want the expansion, as long as they keep to what theyve been doing - ie their own thing, and for them most certainly not to take tips from the films\n\nits ok becasue they wont, it would look daft if they broke their style half way through.....so i can imagine it is as you say- merely a jumping off point for people who see the films and want more\n\ntheres plenty of stuff they could bring out, plenty of other races and peoples, but i was sort of looking forward to a shire expansion where we focus on the hobbits and the shire area- and i didnt particualrly want it to be the 'the hobbit' centered, rather more 'the shire' centered so we can visit places that we see in the fellowship that arent on the way for thorins company, or even better visits places on the shire map that are never really talked about\n\nor have i missed the point here? is the expansion just going to be exactly that?...ie a shire expansion that just happens to come out the same time as the film? or is it going to focus on the hobbit?\n\n \n\n \n\n \n\nI think I missed out a page in reading through this thread, so I missed you there rich! Yes, I agree totally!\n\nFrom that modern myths article, it calls it The Hobbit: Over Hill and Under Hill, so I presume it is aimed more at the book than the race. But then, where did they get this information from? Does anyone actually know? All this seems to be, to me, is an internet rumour going nuts here.\n\n> But Khazad was announced right after Rhosgobel (the third expansion of Mirkwood) hit the stores, so in that logic, we could see announcement for the next deluxe soon. I have a hunch that next week we shall see the third part of the Watcher previews, the week later the Watcher could sell, and the week later yet, we might hear what the next deluxe is.\n> \n>  \n\nI sure hope that is the case! I don't think I could wait another month for more news! Does anyone know if FFG are open over Easter for us to be expecting a Monday preview? I was sort of expecting we'd have part three in this series on the Watcher we've been having to surface on Monday, then the announcement that it's on sale to come either at the end of that week or the following Monday, if it wasn't in the body of that third article anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614450","commentId":614450,"userName":"Bohemond2","timestamp":1333717843,"content":"spalanzani said:\n\nFrom that modern myths article, it calls it The Hobbit: Over Hill and Under Hill, so I presume it is aimed more at the book than the race. But then, where did they get this information from? Does anyone actually know? All this seems to be, to me, is an internet rumour going nuts here.\n\n\n\nThe Modern Myths page is a report from the Games Manufacturing Association trade show.  Fantasy Flight hosted an number of events in which the showcased up coming products for retailers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614455","commentId":614455,"userName":"player1761766","timestamp":1333718361,"content":"Bohemond said:\n\nspalanzani said:\n\n \n\nFrom that modern myths article, it calls it The Hobbit: Over Hill and Under Hill, so I presume it is aimed more at the book than the race. But then, where did they get this information from? Does anyone actually know? All this seems to be, to me, is an internet rumour going nuts here.\n\n \n\n \n\nThe Modern Myths page is a report from the Games Manufacturing Association trade show.  Fantasy Flight hosted an number of events in which the showcased up coming products for retailers.\n\n\n\nExcellent - thanks for that! I feel at least a little more inclined to believe it now, anyway!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614471","commentId":614471,"userName":"timbolton","timestamp":1333721657,"content":"Mattr0polis said:\n\nbooored said:\n\n \n\nWhat dose it matter? The entire LCG timeline is a mess anyway.. with no continuity or relation to the \"real\" story timeline.\n\nI see no reason for them not to include the hobbit film stuff.. it is not like it affects ANYTHING in the game as it is.. as there IS no time line in this game. We have characters from all over the place as well as completely FFG original made up characters that fit in no where already.. so who cares if they have charicters form the hobbit?\n\n \n\n \n\nThis. I agree with Booored.\n\nThe whole game is already giant \"what if?\" scenarios set in Middle Earth. I can have Gandalf or Bilbo or others show up where they never were in the stories. Or team-up characters with others they never met. Or even have characters die that never did. And use items and weapons they never did. Or have Bilbo get captured by the Nazgul at Dol Guldur...\n\n\n\n \n\nI'm not likely to find my original post from around the time we were given an idea about story behind the Mirkwood adventure packs (aka ages ago) but back then I did show how the story of the Mirkwood cycle was VERY much founded in \"official\" Middle-Earth lore - in Aragorn's quest to capture Gollum. And that cycle does follow the route Aragorn took. So I would have to say it's wrong to claim \"no continuity\" for at least the first cycle. As for the Darrowdelf cycle, yes, there was no \"historical\" quest into Moria before Gandalf to find out what happened to Balin and co. But I have no problem with that and I don't see the mess. And yes, you can have characters/items/etc in places they never were - but that's the whole point of a card game vs a roleplaying game (sticking to canon - since rpgs can go off kilter too).\n\nI've found the relevant blog for Modern Myths give a report from the GAMA con, specifically -\n\n\"Fantasy Flight Games\n\n¦With the Hobbit movie on the horizon, FFG is releasing The Hobbit: Over Hill and Under Hill, an expansion to the Lord of the Rings Living Card Game.\"\n\nYou can read it here - http://modern-myths.com/2012/03/14/gama-the-first-24-hours/ [http://modern-myths.com/2012/03/14/gama-the-first-24-hours/]\n\nI don't see why Modern Myths would make it up and also why no one knew of this before - the blog post is dated \"March 14, 2012\"\n\nOh, of side-interest on Modern Myth's blog is info about the \"Lord of the Rings: Nazgul\" expansion to the Wizkids including the following -\n\n¦Speaking of Lord of the Rings, WizKids is releasing Nazgul, a semi-cooperative game where players take the role of the Ring Wraiths in trying to stop the Fellowship from destroying the One Ring.\n\n¦Lots of HeroClix news!  We’ll be seeing new sets based on the New52 Justice Leagues (Including JLDark and International), the Batman movie, the Avengers movie, the Hobbit movie and DC and Marvel 10th Anniversary sets.\n\nFrom - http://modern-myths.com/2012/03/15/gama-new-games/ [http://modern-myths.com/2012/03/15/gama-new-games/]\n\nNow Wizkids have the movie license, not the books, whereas FFG have the books license. I prefer FFG stuff and more so because there is no \"collectible\" element to the stuff they make - as in rares - and some of the Wizkid rares were going for £25+ for single character figures - crazy really.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=614723","commentId":614723,"userName":"Mattr0polis","timestamp":1333792977,"content":"timbolton said:\n\nbut back then I did show how the story of the Mirkwood cycle was VERY much founded in \"official\" Middle-Earth lore - in Aragorn's quest to capture Gollum. And that cycle does follow the route Aragorn took. So I would have to say it's wrong to claim \"no continuity\" for at least the first cycle. As for the Darrowdelf cycle, yes, there was no \"historical\" quest into Moria before Gandalf to find out what happened to Balin and co. But I have no problem with that and I don't see the mess. And yes, you can have characters/items/etc in places they never were - but that's the whole point of a card game vs a roleplaying game (sticking to canon - since rpgs can go off kilter too). \n\n\n\nOh, I definitely agree with you that they are basing the quests on some continuity and that makes it pretty cool. I wasn't claiming there is no basis in continuity for the quests or cards they make, sorry if that was confusing, I was claiming that there is no basis in continuity really just in the way we can choose to *play* the game, and that I don't think the deluxe boxes would be forced to stick to any strict timeline or whatnot.\n\nBut you have it right. There really is no problem or mess, and it'd be pretty fun if we got this. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=615137","commentId":615137,"userName":"Mighty Jim 83","timestamp":1333906698,"content":"based on past form, if there is a hobbity deluxe expansion, it'll be announced for \"fourth quarter 2012\" and only appear in about Feb 2013 when most of the Hobbit-film-hype has died down..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62666-top-news-or-a-just-a-hoax/?do=findComment&comment=615218","commentId":615218,"userName":"timbolton","timestamp":1333932042,"content":"Mighty Jim said:\n\nbased on past form, if there is a hobbity deluxe expansion, it'll be announced for \"fourth quarter 2012\" and only appear in about Feb 2013 when most of the Hobbit-film-hype has died down...\n\n\n\nI am guessing you know the second part to the Hobbit (this one titled \"There and Back Again\") is due to be released Dec 2013 - so the game being released in the middle of two film releases will probably ideal for FFG - it'll be mid-hype after what should be a great first part, making people want more not less gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nBut yep, in the gaming industry I don't expect perfect release dates - The One Ring rpg is a slow mover, but when books come out, they are really enjoyable. Same in the comic industry, game industry, etc - expect delays hehe!"}]}