{"url":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/","title":"20 Heroes In (Introduction and Tactics)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=613847","commentId":613847,"userName":"lleimmoen","timestamp":1333605554,"content":"Hello All,\n\nI am going to do this little series on Heroes of the game. I will concentrate on the 20 that have arrived before the Redhorn Gate since I feel the Dwarrodelf cycle and the secrecy may introduce new strategies that I do not wish to interfere with just yet. The content is highly subjective, of course, though I state it (for journalistic reasons) as if it were facts. It is no work of wonder, just a few thoughts, and it bears neither the beauty of the Tolkien's universe nor many universal truths. I hope though that some few of you may still enjoy reading it, and perhaps novices can find a bit of advice for their future games in those lines. Finally, I apologize for the linguistic aspect of the forthcoming text, as English is not my native tongue.\n\nBoromir\n\nBoromir is a possible (and even probable) “day-saver” in enemy-heavy quests. The ability to ready indefinitely (despite the cost) is just so useful in so many different situations. And every boost seems to pay off a little (or more) extra with Boromir than others – at least in terms of Combat. Take Blade Mastery, for instance. That card may not seem potent enough even though that one additional point of attack or defence is often a difference between destroying an enemy and losing a character. With Boromir, Blade Mastery feels like an obvious inclusion in the deck as he can make use of both of its powers at the same time. In Massing at Osgiliath where a Wolf of Mordor (or more depending on the number of players) likely attacks you on the first round, having Boromir boosted by Blade Mastery can mean successfully defending and destroying several of these fierce enemies.\n\nNaturally, Boromir fits well in a deck with Spirit. Any threat reduction may quickly become huge fighting potential. The Gondor trait has been very little developed so far but For Gondor! is another combat combo that Boromir takes extra care of. Stand Together and Gondorian Spearman fall into this category as well. The Spearman is very useful on its own but when you can easily pair him up with the Gondor’s Finest, the chance of using his smart ability again steeply rises.\n\nWith more cards coming in, it seems Boromir can be only getting stronger, even though there may still be games (and quests) in which he will not fulfil his potentials, especially those with lots of questing (and/or little fighting) needed.\n\nLegolas\n\nThis Silvan killer does what no other Tactics character; it makes progress whilst destroying enemies. The ranged keyword makes it easier to achieve in a multiplayer game – where the chance of having someone to kill increases as well. The under 10 threat puts Legolas within the cheaper heroes, opening up useful combinations such as one with Dúnhere who craves for the Tactics sphere. Quick Strike is a natural combo for Legolas as getting rid of an enemy (together with its potential shadow effect) before it strikes and a location before it takes its toll feels extra satisfying.\n\nSame as Gondorians, the Elves have been also rather neglected thus far (20 heroes in: Core, Mirkwood, Khazad-dûm) but new combos are on the horizon and Rivendell Blade will make Legolas even stronger warrior.\n\nThe downside with Legolas can be his inability to do anything else but attack. It would certainly feel overpowered if he could but the fact remains, the Prince of Woodland Realm will not help you much unless you find him an enemy to take down, even though his 4 hit points allow for taking an undefended attack and there already are some of his kin who heal very effectively.\n\nGimli\n\nEvery opinion is bound to be biased; there is always more than just one view at things. And as Gimli’s potential to become super strong in terms of attack is doubtless, his actual prowess in the game are very dependent. First, the shorter the game is, the lesser is the chance of Gimli reaching his potential. The Core set offered somewhat easy ways of getting hurt: usually by questing whilst revealing either Dol Guldur Orcs or Necromancer’s Reach. And Gimli is the best Tactics “quester” in the game thus far: willpower equal to Brand, hit points exceeding by two – thus less vulnerable. However, there are now many scenarios where getting hit seems not as obvious; and getting hit in “just” the right way becomes more tricky.\n\nThe attachment for Gimli is Citadel Plate (however against the logic or even theme – he can bear two of those by the way but only one pair of Boots from Erebor – go figure!). It strengthens the fact that making Gimli strong takes time and resources. Unlike Boromir who can clear enemies in a fury on round one, Gimli has to remain steadfast and bide his time to strike an ultra heavy blow. This ability though can feel a bit less important now as the game develops; in its beginnings dealing with a Hill Troll was a huge struggle that often required more than one turn to perform. With the card pool expanding, felling big foes is more of a daily bread even without heavily (and slowly) pumped-up Gimli.\n\nThe plus side is the Dwarven trait. Dáin will get his credit later but the difference between the attack of 2 and 3 on round 1 is substantial. Unlike keeping Dáin ready throughout the Quest phase (where he duly takes a back seat with overseeing eye), keeping him ready till the attack is less obvious since he is arguably the best defender in the game. Also, the sphere combo with Tactics is less prominent at the moment as both Spirit and especially Lore have established the Dwarven Strategy much deeper.\n\nThalin\n\nAs Gimli may be losing a bit of spotlight with new peers taking precedence, Thalin could be the Dwarf to steal a bit of fame himself. The sphere is the same but the utility much different. Thalin benefits more from Dáin’s appearance for the reasons given above; he also fits a role that is rare in the Tactics sphere, he contributes to questing whilst hurting foes who may come. And the obvious combos for Thalin are coming with vengeance: first we had Gondorian Spearman – yes, one and one is two (bravo) but two were often too little to kill an enemy before it attacks; with Khazad-dûm this is more often than not untrue. But for those more sturdy monsters, there are plenty new ways to strike them prior their turn. Beorning Beekeeper is more of a multiplayer character: more players mean larger staging areas, more targets to hit at once. Descendant of Thorondor can take on two enemies (dealing two damage each), which with Thalin means constant death for the majority of those. Yet, the list goes further, again there is the threat of 9 – not too high for the Dúnhere strategy – but now even more potent as Dúnhere has less work to do himself. And if all that was not enough, Road to Rivendell brings a brand (himself capitally coming soon) new tool for clearing the staging area: Hail of Stones can take down a big one, and it needs a character less to do so – thanks to Thalin.\n\nBrand\n\nSolo players are not happy with this one. Unlike Legolas who is also ranged with the same attack strength (for one less point of threat), Brand will not help in solo play by adding progress tokens. He will help tremendously in multiplayer though. Pair it wisely and you can have Brand on one side and Dáin with Beravor on the other. Dáin defends well as said, Beravor has used her ability (or done other things) to exhaust but Brand finishes the enemy and she becomes ready again. Beravor with Unexpected Courage is rightly considered among the strongest combos in the game, now Brand can often do the same trick and ease the world of the servants of Sauron in the meantime.\n\nIf Gondor, Silvan or Noldor have only got a few cards thus far, Dale got no support whatsoever. It is highly unlikely it ever will get as much as the others but when it does, it may well be very strong (to balance things out) and very fit for the King Brand son of Bain son of Bard who fell the great dragon Smaug the Magnificent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=613861","commentId":613861,"userName":"richsabre","timestamp":1333608162,"content":"excellent  read thanks for doing this, i think it is good for newcomers to the game (to get an early grasp on ther heros) or for less strategically minded 'veterens' like me, who may not have thought all of the heros through fully.\n\ni have to say i like brand...i was obviously dissapointed with his non solo ability, which is a shame as his stats make him one of the most nicely round heros in the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=613876","commentId":613876,"userName":"lleimmoen","timestamp":1333609885,"content":"Thank you Richard. Your kind words feel all the more like a compliment knowing what great things you've done with your series."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=613939","commentId":613939,"userName":"Captain Poe","timestamp":1333617909,"content":"Good reviews, and some great tips (Dunhere + Thalin never occurred to me, but thats a solid combo).  Keep writing :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=613944","commentId":613944,"userName":"lleimmoen","timestamp":1333618325,"content":"Thanks. I will. There are three Spheres left afterall (and perhaps more to write about later).\n\nAs for Thalin, before Dain I have rarely considered him myself. Now that he can quest for 2 makes a huge difference (at least on my calculator).\n\nAnd yes, Brand is a very nicely skilled hero. Too bad for solo players that he then has no ability. Would it be too strong if he readied a character even if he destroyed an enemy engaged with his controller?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=613966","commentId":613966,"userName":"richsabre","timestamp":1333621853,"content":"given brands status and the power of his dwarf equivalent dain, i do not think he would be over powered if his ability stretched to that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=613977","commentId":613977,"userName":"lleimmoen","timestamp":1333623182,"content":"Exactly. I have never tried any house-rules in this game (despite frequently using them in dis-balanced games such as the War of the RIng) but extending Brand's ability for solo should not be a breach. It would seem as an easy fix (and you still won't get to use his ranged keyword anyway - unless for rare occasions)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614044","commentId":614044,"userName":"The_Fallen_Arises","timestamp":1333633141,"content":" Yes it is a great article, kudos ! One can truly feel the love you have for the game :-)\n\nThat being said, I mostly agree with what has been said, especially about Legolas (he's good, but also a one-trick pony). However, I will somewhat disagree with Gimli. Granted, he can be slow to pump if you want to control how much damage he takes, but if you're a gambling man, getting him hurt is no problem, especially if you have Spirit along to minimize the effect of bad surprises. My friend always plays Tactics when we quest together, an he nearly always plays Gimli. Usually, when an enemy attack him, especially a small one with only 2 atk or lower, he simply takes the enemy undefended, puts the damage on Gimli, and finishes the monster off.\n\nThat, and if you play with Gimli and Frodo together, you can make sure that an undefended attack will simply mean a big threat increase instead of the death of a hero. In that regard, pumping up Gimli is really easy...and I'm not even beginning to get into cards like Khazad ! Khazad !, Durin's Song or Dwarrowdelf axe, or even Unseen Strike early in the game. Gimli + unexpected courage is also quite good IMO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614052","commentId":614052,"userName":"Robert McMutton","timestamp":1333634889,"content":"OMG, how much to read after a couple of days off. Ok, first of all, great thread, congratulations. I love what you are doing here. In fact, after reading this, I'm going to give Tactics a try, a sphere I rarely use, because a play solo.\n\nAbout Boromir, I have never used him, but now I see that a dual sphere deck with two heros of Spirit and Boromir could function for solo. Maybe I'll try later this evening.\n\nAnd about Brand, I also don't use home rules, but what you say up there would be a way to use him a little, because just now, my Brand is covered by dust.\n\nLooking forward to read your review for the other spheres heros."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614061","commentId":614061,"userName":"lleimmoen","timestamp":1333635926,"content":"Thanks guys. Much appreciated.\n\nAs for Gimli, I feel like I was perhaps concentrating too much on the \"negative\" side and not praising enough his strength. I am trying to be fair but it will always be subjective (as I said) and based also on a player style, I play a lot (like every second or third day for this past year) and I have played Gimli but perhaps not as much as others after a while. The combo with Frodo is spot on, and it is actually what I write in the Leadership article: there it is the Gloin/Frodo combination. I could/should have mentioned it here, too. There is just so much and thus easy to miss something. I could write more but I did not want to make it too long so that people would struggle to read through (and they might even as it is).\n\nI actually have a question to all of you kind readers, what do you think would be a good interval between the posts? Once a week or a little less? If this still goes well after the heroes, I might move to allies but I do not want to jump ahead of myself. Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614068","commentId":614068,"userName":"Captain Poe","timestamp":1333637638,"content":"lleimmoen said:\n\nThanks. I will. There are three Spheres left afterall (and perhaps more to write about later).\n\nAs for Thalin, before Dain I have rarely considered him myself. Now that he can quest for 2 makes a huge difference (at least on my calculator).\n\nAnd yes, Brand is a very nicely skilled hero. Too bad for solo players that he then has no ability. Would it be too strong if he readied a character even if he destroyed an enemy engaged with his controller?\n\n\n\n \n\nI only play solo, so its really hard to make Dain work well.  For example. A team like Dain + Thalin + Dunhere looks good on paper, but is hard to use. In this squad, you can't quest with Dain, or Thalin loses his +1. You wouldn't want to quest with Dunhere because he is going to be doing some attacking. What you're left with is only questing with Thalin, and a 2 willpower just doesn't get you far. You become very ally dependent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614076","commentId":614076,"userName":"lleimmoen","timestamp":1333638489,"content":"Yes, Dain is mighty but his might rises with the number of players, solo you are limited in choosing his companions, and Lore and/or Spirit suit him better than Tactics to combo with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614077","commentId":614077,"userName":"Captain Poe","timestamp":1333638921,"content":"lleimmoen said:\n\n \n\nYes, Dain is mighty but his might rises with the number of players, solo you are limited in choosing his companions, and Lore and/or Spirit suit him better than Tactics to combo with.\n\n \n\n \n\nYeah. The only time i've ever completed a quest with him was using Dain, Thalin, and Bifur. Bifur and Thalin quested (5 combined will power), and Dain hung back with allies to attack/block as needed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614105","commentId":614105,"userName":"lleimmoen","timestamp":1333642678,"content":"That is a good line-up. As for others, Dain goes well with Gloin and Bifur - even though you have two Leadership and one Lore hero, you can effectively send one resource to Bifur each round, plus you can pepper this with songs. Dain, Bifur, Dwalin may also work in quests filled with orcs. Finally, it does not have to be all Dwarven heroes, it may be good enough with two and more allies, such as Dain, Bifur, Beravor - that one proves especially nice for a multiplayer with Brand (and perhaps Gloin and Thalin) in the other deck - but it should work to some extent in solo play as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614170","commentId":614170,"userName":"richsabre","timestamp":1333652640,"content":"lleimmoen said:\n\n \n\nI actually have a question to all of you kind readers, what do you think would be a good interval between the posts? Once a week or a little less? If this still goes well after the heroes, I might move to allies but I do not want to jump ahead of myself. Cheers.\n\n \n\n \n\ni thought a while about that for my series- i guess weekly's good....maybe even more often? after looking carefully at the way this forum works- ive found that it goes through periods of quietness, and then periods of high amounts of posts, sort of depending on whats going on in the world of the game....i mean its having quite alot of posts due to the hobbit news leak\n\nthough ive found that threads are spending more time at the top which is good for me and you :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614243","commentId":614243,"userName":"Cotillion37","timestamp":1333675675,"content":"Captain Poe said:\n\nGood reviews, and some great tips (Dunhere + Thalin never occurred to me, but thats a solid combo).  Keep writing :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nIt's a pretty good combo! For juicebox's Journey Down the Anduin tournament, my heroes ended up being Eowyn, Dunhere and Thalin. I won all three games pretty handily with them, it's definitely a pretty sweet combo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614247","commentId":614247,"userName":"lleimmoen","timestamp":1333679403,"content":"...and Dúnhere is especially strong in Anduin 2b.\n\nOk, I will see about the frequency, I expect to post Leadership on Easter Monday."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=614811","commentId":614811,"userName":"lleimmoen","timestamp":1333815567,"content":"Part II (Leadership) is up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=714079","commentId":714079,"userName":"sammann11","timestamp":1351023415,"content":"Thanks for writing that post, it was great!\n\nI am a new player and found a lot of what you wrote very helpful - I'm so new that some was still a bit over my head ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI agree with an earlier poster about Gimli, let an attack go undefended, then trun around and smash 'em!!! \n\n For Journey down the Anduin I use Gimli to defend against that darn troll, then the next turn and hit him with 6!\n\nAgain, great read. I will read the other 3 articles soon. This is another prime example of how great these forums are. I got into Warhammer: Invasion before this game, and while I probably do like it a little more - sorry all ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] - the forum over there can't hold a candle to this LOTR LCG game one. Don't get me wrong, there are some very helpful guys over there. But it does just not get the traffic that these LOTR forums seem to get. The fact that this game can be done solo, obviously, helps keep posting levels up I suppose.\n\nAnyaways, thanks! Oh…and I would have NEVER known English was not your first language. That post was more claerly written than a lot fo posts written by those of use that claim English as our native language! Well done!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62719-20-heroes-in-introduction-and-tactics/?do=findComment&comment=714204","commentId":714204,"userName":"lleimmoen","timestamp":1351050867,"content":"sammann11 said:\n\nThanks for writing that post, it was great!\n\nI am a new player and found a lot of what you wrote very helpful - I'm so new that some was still a bit over my head ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI agree with an earlier poster about Gimli, let an attack go undefended, then trun around and smash 'em!!! \n\n For Journey down the Anduin I use Gimli to defend against that darn troll, then the next turn and hit him with 6!\n\nAgain, great read. I will read the other 3 articles soon. This is another prime example of how great these forums are. I got into Warhammer: Invasion before this game, and while I probably do like it a little more - sorry all ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] - the forum over there can't hold a candle to this LOTR LCG game one. Don't get me wrong, there are some very helpful guys over there. But it does just not get the traffic that these LOTR forums seem to get. The fact that this game can be done solo, obviously, helps keep posting levels up I suppose.\n\nAnyaways, thanks! Oh…and I would have NEVER known English was not your first language. That post was more claerly written than a lot fo posts written by those of use that claim English as our native language! Well done!\n\n\n\n \n\nThanks a lot!\n\nAnd if you have any question, ask away, there are indeed quite a few people around willing to give advice. Playing the game frequently over the past 18 months does leave a trace.\n\nSome of the ideas in the post are a bit dated due to errata, growing card pool, new obstacles, and new experience too. I hope to do a follow up, maybe after Against the Shadow cycle, as I feel it will shed yet a completely new light on the game."}]}