{"url":"https://community.fantasyflightgames.com/topic/62782-control-of-player-attachments-born-aloft/","title":"Control of player attachments: Born Aloft","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62782-control-of-player-attachments-born-aloft/?do=findComment&comment=614405","commentId":614405,"userName":"GrandSpleen","timestamp":1333710409,"content":"The unofficial FAQ states: \"You control any attachments on characters you control regardless of who played the card (unless it came from the encounter deck).\"\n\nIs that correct?  So, if I play Born Aloft on another player's Gandalf, the other player gains control of Born Aloft.  And when discarded, Born Aloft goes into that other player's discard pile. \n\nDoes anyone know where the unofficial FAQ got this?  I don't see a citation and can't find mention in the rulebook/official FAQ.  I had previously been playing different.  I was assuming that the player who plays an attachment retains control of that attachment, regardless of which player's character gets it.  That means if I played Born Aloft on a neighbor's Gandalf, I would have to choose when to discard Born aloft, and once discarded, it will go into my discard pile and not my neighbor's.  This has implications for the use of a card like the Ereborn Hammersmith.\n\nNow, the text of Born Aloft says: \"Action: Discard Born Aloft from play to return attached ally to its owner's hand.\"  If the unofficial FAQ is accurate, the player who is controlling Born Aloft will always be in control (i.e., be \"the owner\") of the ally it is attached to.  So this card COULD simply say \"return attached ally to YOUR hand\").  Instead, the card says \"its owner's hand,\" which suggests to me that there could be a difference between the controller of Born Aloft and the controller (owner) of the ally it is attached to.  And this supports my interpretation: you retain control of attachments that you play, regardless of who controls the ally that they are played on.\n\nIs there an official ruling on this?\n\nAlso, what would happen if you put Born Aloft on an encounter deck ally like Grimbeorn?  When Grimbeorn is paid for, he \"joins\" a player as an ally and (as I understand it) is not \"owned\" by that player.  If you attach Born Aloft and discard it, Grimbeorn can't return to a \"hand\" because the encounter deck has no hand.  And he can't \"return\" to a player hand because he was never there to begin with.  Help!\n\n \n\nThanks!\nGS"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62782-control-of-player-attachments-born-aloft/?do=findComment&comment=614446","commentId":614446,"userName":"radiskull","timestamp":1333716998,"content":"Cards that leave play always go to their owner's hand/deck/discard pile.  So if you play Born Aloft on another player's Gandalf, they choose when to use it.  Gandalf would go into their hand, but Born Aloft would go into your discard pile.  The reason Born Aloft uses the text \"its owner's hand\" is because characters can change control.\n\nImagine you played Born Aloft on your friend's Wandering Took.  Then, your friend uses the Took's ability to give you control of him.  Now, you control BOTH Wandering Took AND Born Aloft.  If you use Born Aloft (which you can, since you now control the attachment), then Born Aloft goes to your discard pile, and Wandering Took goes to your friend's hand, since he owns the card.\n\nControl can change.  Ownership cannot.  The justification for the control of character = control of attachment comes straight from the rulebook, page 25:\n\n\"Players always assume control of attachments that\nhave been played on their characters. If control of\nthat character changes, so does the control of any\nattachments on that character.\"\n\nFinally, your Grimbeorn question: The rulesheet from Conflict at the Carrock states that if Grimbeorn leaves play for any reason, he goes to the encounter discard pile.  Since putting a card back into your hand counts as that card \"leaving play\", Born Aloft on Grimbeorn will just put him in the discard pile (which makes playing the attachment on him kind of silly)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62782-control-of-player-attachments-born-aloft/?do=findComment&comment=614540","commentId":614540,"userName":"GrandSpleen","timestamp":1333738226,"content":"Ah, great. Thank you for the very clear explanation.  It was all there in front of me, I was just looking in the wrong places!  I was also erroneously thinking that \"control\" of a card = \"ownership\" of a card.  Thanks again for clearing that up!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62782-control-of-player-attachments-born-aloft/?do=findComment&comment=615008","commentId":615008,"userName":"booored","timestamp":1333873701,"content":"radiskull said:\n\nControl can change.  Ownership cannot. \n\n\n\n+this.\n\nI like this wording. very neat."}]}