{"url":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/","title":"Reshuffle of Encounter deck!?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/?do=findComment&comment=614476","commentId":614476,"userName":"Glaurung","timestamp":1333722265,"content":"I play this game quite a long time(from the begin) almost 1 year. And is not my first card game.This is my third Lotr card game.\n\nI love the game play every day if possible and build up many decks and really play a deep........ But i still dont understand couple of things in this game rules:\n\n I still dont understand why we can reshuffle encounter deck only in quest phase??? Why we just cannot reshuffle it every time time when card there is finish regarding the phase?  Maybe some one know why?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/?do=findComment&comment=614490","commentId":614490,"userName":"Nerdmeister","timestamp":1333726320,"content":"Always been playing with shuffling the encounter deck when it runs out of cards myself. Where did you read that it can only be in the quest phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/?do=findComment&comment=614502","commentId":614502,"userName":"radiskull","timestamp":1333727726,"content":" The rules (as written) are pretty clear about it.  I'm not sure of the justification for the rule, but it's definitely part of the game's rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/?do=findComment&comment=615225","commentId":615225,"userName":"Glaurung","timestamp":1333934076,"content":"Yes sure, rules is very clear about. But what a point of this??? I mean why we must to wait until quest phase to reshuffle??? Why we cannot just reshuffle it whne the cards finish....... there is so many small points what you need to remember for nothing......And on the point when you have few cards in encounter deck\n\nyou can build up your strategy: quest and fight(no shadow card) and get sometimes really big advantage at this moment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/?do=findComment&comment=615246","commentId":615246,"userName":"player1761766","timestamp":1333945284,"content":"Well, the quest phase is when you go searching for new devilry and such, so that's when you find out what you're facing. If it runs out of cards when you're doling out shadow cards, then it is merely a sign that some enemies are exactly what they appear to be, and you have nothing more to fear from them. That's what I would say, anyway!\n\nHappy Birthday, by the way happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/?do=findComment&comment=615294","commentId":615294,"userName":"Angus Lee","timestamp":1333957891,"content":"And Happy Birthday to you, spalanzani, too!\n\nThis kind of design decision is probably made due to game balance reason, though in this particular case, without extensive playtest statistics, I don't know if it is so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62788-reshuffle-of-encounter-deck/?do=findComment&comment=615361","commentId":615361,"userName":"radiskull","timestamp":1333969029,"content":" It's possible that people would make decisions on whom to defend with, or whether to let an attack go undefended, based on whether the really nasty shadow effects in the encounter deck have passed or not.  If you could reshuffle the discards into the encounter deck mid-Combat phase, then those calculations go out the window.\n\nI don't know why that design decision was made, but those types of considerations may be part of it."}]}