{"url":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/","title":"Prince Imrahil sleeping on the job","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=614499","commentId":614499,"userName":"Nerdmeister","timestamp":1333727239,"content":"This is a question specifically pertaining the hero card \"Prince Imrahil\" and the shadow effect on the treachery card \"sleeping sentry\".\n\nPrince Imrahil has the ability to unexhaust every time a character leaves play and the shadow effect reads: \"Defending player must discard all exhausted characters he controls\"\n\nNow since all these characters would be discarded from play by the same effect (also leading to the attack being undefended, but that´s another matter), I would assume the first player would be allowed to determine the order in which this happen (keeping in line the FAQ on simultanious effects timing). Thus it could be determined in which order the characters leave play. If so then when the first character leaves play, Prince Imrahil would be allowed to unexhaust.\n\nThe question now is: Should Prince Imrahil in this case still be discarded?\n\n1) Yes, since he was exhausted at the time the shadow card was revealed. The fact that he is no longer exhausted doesn´t change that.\n\n2) No, he is no longer exhausted and thus avoid the original shadow card effect\n\nAny and all thoughts are welcome"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=614501","commentId":614501,"userName":"radiskull","timestamp":1333727681,"content":" All the characters would be discarded from play, including Imrahil.  Imrahil's response doesn't prevent him from being discarded by the effect, because the effect doesn't go \"back in time\" to prevent anything.  It's not a \"cancel\" type effect, so he'd be discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=614571","commentId":614571,"userName":"GrandSpleen","timestamp":1333747239,"content":"Yeah, I would think you can't interrupt an effect halfway through its resolution in order to trigger a response. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=614587","commentId":614587,"userName":"qwertyuiop","timestamp":1333753014,"content":"radiskull said:\n\n All the characters would be discarded from play, including Imrahil.  Imrahil's response doesn't prevent him from being discarded by the effect, because the effect doesn't go \"back in time\" to prevent anything.  It's not a \"cancel\" type effect, so he'd be discarded.\n\n\n\nCan you not choose the order in which characters are discarded regardless of whether it's a global or targeted effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=614629","commentId":614629,"userName":"laiyna","timestamp":1333766474,"content":"even if you choose, the effect was there when he was exhaust, so still discarded. All characters are discarded at the same time and not in a serie :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=614912","commentId":614912,"userName":"radiskull","timestamp":1333842773,"content":" I'm not saying that LoTR's timing structure is the same as AGoT's, but here's how it would work there:\n\nAll characters would be classified as \"moribund\", that is, heading to the discard pile.\nThen Imrahil's response would trigger, readying him.\nThen all the moribund characters would hit the discard pile.  So Imrahil would be ready when he hit the discard pile, but he'd still hit it.\n\nLoTR may well be different, but nothing prevents Imrahil from heading the discard pile once the card effect sends him there, even if he readies himself on the way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=615685","commentId":615685,"userName":"jhaelen","timestamp":1334023172,"content":"radiskull said:\n\nAll characters would be classified as \"moribund\", that is, heading to the discard pile.\n\nCurrently, the concept of 'moribund' is unique to AgoT.\n\nIn CoC, all characters would be gone since it's a single effect that has to be resolved fully before another effect can be triggered (unless it's a 'Disrupt')."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=615717","commentId":615717,"userName":"starhawk77","timestamp":1334031940,"content":"Yep, Imrahil's fate is sealed as soon as that shadow effect resolves. Once the shadow card is flipped, all of the exhausted targets are \"locked in,\" so to speak. Feel free to trigger a \"pride ready\" on the Prince's way out, but it won't save him. \n\nSo, may your Strokes be Hasty and your Watchers ever Dunedain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=615785","commentId":615785,"userName":"radiskull","timestamp":1334052917,"content":"jhaelen said:\n\n\nCurrently, the concept of 'moribund' is unique to AgoT.\n\n \n\nIn CoC, all characters would be gone since it's a single effect that has to be resolved fully before another effect can be triggered (unless it's a 'Disrupt').\n\nThanks for that - it's good to see the various little differences between the LCGs, and I'm not a CoC expert.  Moribund complicates matters a great deal, and so it's probably unlikely that we'll see it in LoTR (it didn't show up until the game was at least 5 years old anyway).  I think based on certain rulings we've already seen, LoTR is probably more similar to CoC in its timing structure.\n\nIn any rules interpretation, though, Imrahil is toast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62791-prince-imrahil-sleeping-on-the-job/?do=findComment&comment=615841","commentId":615841,"userName":"Golden_Nightingale","timestamp":1334061140,"content":"Prince Imrahil settles in for a quick night's sleep with his fellow adventurers as they press ever onward in their quest. But alas, the sentry standing guard has fallen asleep and neglected their duty to defend the fellowship. Many are slain as the enemy slips past the perimeter of the camp. Imrahil awakens to see the enemy swinging their weapon towards his head...."}]}