{"url":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/","title":"Landrovals ability","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614542","commentId":614542,"userName":"chainsaw_ash","timestamp":1333738580,"content":"How does  Landroval's ability work?\n\nCan it return a hero from the discard pile or does it have tobe used the moment a hero is killed?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614575","commentId":614575,"userName":"GrandSpleen","timestamp":1333747840,"content":"The ability is a \"response,\" meaning it has to be triggered immediately at the time of the qualifying event, or not at all.  So it has to be done right after the hero is killed.\n\nAlso, as a side point, the card uses the language \"destroyed.\"  if I understand this correctly, that means that the hero must leave play as a result of damage tokens being placed on it.  You could not trigger Landroval's ability off of cards that cause a hero to leave play without causing damage (like the shadow effect on \"sleeping sentry\")."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614577","commentId":614577,"userName":"chainsaw_ash","timestamp":1333748021,"content":"thanks for the quick response.\n\nI"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614578","commentId":614578,"userName":"GrandSpleen","timestamp":1333748388,"content":"Actually, now that I think about it, I'm not sure that is correct about \"destroyed.\"  Maybe it isn't used so technically?  The manual states that player elimination occurs when a) a player's threat reaches 50 or b) when all of a player's heroes are destroyed (pg. 4) -- or when all of a player's heroes are killed (pg. 22).  We can either assume killed/destroyed/discarded are all synonyms for heroes leaving play, or we have to allow that a player is not eliminated when a card like \"sleeping sentry\" causes all of a player's heroes to be discarded!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614823","commentId":614823,"userName":"booored","timestamp":1333817201,"content":"it will trigger any time a hero is placed in the discard pile... regardless of how. Destroyed isn't a keyword.. just means discarded (witch in this game means entering the discard pile)\n\nSome notes.. is that his ability is once per game, not per copy of the card. As well as included all players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614899","commentId":614899,"userName":"GrandSpleen","timestamp":1333839840,"content":"Gotcha... incidentally, after reading the card's text, I understood this to mean that Landroval's ability may be used a total of one times per game, not once per player.  The unofficial FAQ says \"Limit is once per game, per player.\"   I think this is bad wording -- grammatically this means each PLAYER may use the ability once per GAME (for a total of 4 times in a 4 player game).  That's wrong, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614985","commentId":614985,"userName":"Dam the Man","timestamp":1333866468,"content":"booored said:\n\nit will trigger any time a hero is placed in the discard pile... regardless of how. Destroyed isn't a keyword.. just means discarded (witch in this game means entering the discard pile)\n\n\n\nNice try, but too bad there's an official reply that bunks this:\n\nwww.boardgamegeek.com/article/7608788#7608788 [http://www.boardgamegeek.com/article/7608788#7608788]\n\nKey part being:\n\n\"Defeated and destroyed both refer to a character or enemy receiving damage that reduces its hit points to zero, and then being placed in the appropriate discard pile.\n\nSome card effects will directly remove characters/enemies from play, either discarding them, returning them to hand or deck, an potentially removing them from the game. These effects are not considered to defeat or destroy the target, they act directly on it, moving it to the new out of play state.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=614995","commentId":614995,"userName":"booored","timestamp":1333870920,"content":"um... I have a email directly form Nate on this... Posted at CardGameDB [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications-updated-27012012/page__view__findpost__p__4141]\n\n \n\nQ: - Landroval's ability, is it limited once a game per player? Or is it limited to once a game per-card? As in if you run 3 cards, can you use that ability 3 times, one for each card.\nAlso, if 2 players use Landroval, then can both players can activate their Landroval cards separately? I know you can only have 1 on the table at a time, but dose the \"once per game\" thing cover ALL players or only the player that controls the card. Lastly, we know that going into your hand dose not reset the \"once per game\" rule, but dose playing the card form your gravyard also not reset the ability? Thanks as always for giving us a defiant answer.\n\nA: - Limits are player specific, each player can reach the limit.\n\n\"Per game\" limits are not card specific, they refer to any copy of the effect under that player's control. If you have reached the \"per game\" limit, you cannot trigger that effect again, with another copy of the card in your deck, a copy of the card you gained control of from another player, or from the same card that has left play and re-entered the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=615002","commentId":615002,"userName":"Dam the Man","timestamp":1333872327,"content":"If you care to note, my quote (of yours) had nothing to do with how many times you can use the Response. It was a rebuttal to the nonsense of being able to use Landy regardless of how the hero enters the discard pile, which the ruling from Nate specifically mentions, only works for actual destroyed heroes, not ones that just get discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=615006","commentId":615006,"userName":"booored","timestamp":1333873542,"content":"lol.. I was talking to GrandSpleen mate.. I very rarely read your posts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=615019","commentId":615019,"userName":"GrandSpleen","timestamp":1333879383,"content":"OK, so it sounds like Landroval's ability can be used once per player.\n\nBut I am now more interested in the destroyed vs. discarded thing... because if a hero can be discarded without being destroyed, the wording of elimination rules suggests that a player who has lost all of his heroes due to \"discard\" or \"remove\" effects is NOT eliminated.  e.g. Sleeping Sentry's shadow effect.\n\nSee reply 3, this thread, for quotations from the manual.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=615707","commentId":615707,"userName":"starhawk77","timestamp":1334029849,"content":"GrandSpleen said:\n\n \n\nOK, so it sounds like Landroval's ability can be used once per player.\n\nBut I am now more interested in the destroyed vs. discarded thing... because if a hero can be discarded without being destroyed, the wording of elimination rules suggests that a player who has lost all of his heroes due to \"discard\" or \"remove\" effects is NOT eliminated.  e.g. Sleeping Sentry's shadow effect.\n\nSee reply 3, this thread, for quotations from the manual..\n\n \n\n \n\nI'm usually an advocate for strict interpretations of rules text, and you are right that such a reading would suggest a player would not be eliminated until all of his or her heroes were actually destroyed by damage. However, Nate recently issued a ruling concerning captured heroes in Escape from Dol Guldur; specifically, a player is eliminated from the game if he or she only controls the \"prisoner\" (javascript:void(0);/*1334046664234*/ [http://boardgamegeek.com/article/8720523#8720523]). Now, in this situation, a player's heroes have not all been \"killed\" or \"destroyed,\" yet he/she is nevertheless out of the game. \n\nElimination, then, would seem to hinge on hero control rather than the precise method of a hero's untimely departure. It seems clear that the intent is for player elimination to occur whenever a player does not control one or more heroes (in the EfDG example, the facedown \"prisoner\" is not considered a controlled hero). It's possible that the Dol Guldur ruling was scenario-specific, but Nate indicated nothing to that effect. \n\nYour reading of the rules is technically correct, but there is compelling evidence that the rule book definition itself is inaccurate or incomplete. Basically, Nate's ruling suggests that if you lose all your heroes--to death, removal, discard, or capture--you are eliminated. Again, there's a chance that these parameters only apply in EfDG, but it seems unlikely that such a basic principle would produce one ruling in one scenario and different rulings in other quests. I really hope we get an FAQ update in the near future that will clarify some of this terminology. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62797-landrovals-ability/?do=findComment&comment=615735","commentId":615735,"userName":"GrandSpleen","timestamp":1334043477,"content":"Agreed.  The wording of the elimination rules seems like an oversight more than an intentional use of language.  Thanks for the example to put things into perspective."}]}