{"url":"https://community.fantasyflightgames.com/topic/62965-question-on-card-sneak-attack/","title":"Question on card, Sneak Attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62965-question-on-card-sneak-attack/?do=findComment&comment=616120","commentId":616120,"userName":"PipMasta","timestamp":1334114455,"content":"The card states, \"Put 1 ally card into play from your hand. At the end of the phase, if that ally is still in play, return it to your hand.\"\n\nThe cost of the card is only 1. Now, can I pay the 1 resource and put any Ally of any cost into play for free? Or do I still need to also pay the resource for the cost of the Ally?\n\nAlso, maybe I'm not doing it right, but this seems useless since this is an action card and actions are always after important events so putting this out, the Ally won't be around too long in the phase to make any difference?\n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62965-question-on-card-sneak-attack/?do=findComment&comment=616131","commentId":616131,"userName":"muemakan","timestamp":1334116291,"content":" Costs only 1. Use it with Gandalf for instance.\n\nYou can play events anytime in a phase. You just cannot play it in the middle of a specific step of a phase. So you can play it anytime in the combat phase for instance but you can only play it before you engage an enemy or after. You can play it before you reveal encounter cards or after. But you cannot play an event between revealing encounter cards for instance.So in a two player card you cannot reveal one card, than play an event and then reveal the next card.\n\nOnly responses can interrupt the small steps of a phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62965-question-on-card-sneak-attack/?do=findComment&comment=616144","commentId":616144,"userName":"starhawk77","timestamp":1334120084,"content":"Just as an addendum to muemakan's response, you should take a look at the timing chart at the end of the rule book. Actions (including events that have the Action: trigger) can generally be played at any point during any of the steps highlighted in green. There are some more detailed breakdowns (particularly during the combat phase), but there are usually plenty of opportunities to Sneak Attack an ally into play and use the character effectively. \n\nAnd no, Sneak Attack doesn't require you to pay the ally's full cost--just the one resource for the event. Gandalf is the best choice for the card (since you get to use his powerful response effect), but it also works well with powerful characters like Beorn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62965-question-on-card-sneak-attack/?do=findComment&comment=616349","commentId":616349,"userName":"PipMasta","timestamp":1334149789,"content":"Thanks guys.\n\ngran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"}]}