{"url":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/","title":"The Hobbit - Over Hill and Under Hill","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616284","commentId":616284,"userName":"Bomb","timestamp":1334143487,"content":"http://www.fantasyflightgames.com/edge_news.asp?eidn=3199 [http://www.fantasyflightgames.com/edge_news.asp?eidn=3199]\n\nNew deluxe expansion is now officially announced.\n\nBilbo Baggins is a new hero, can be played as a free and 4th hero, and introduces a new sphere of influence: The Baggins Sphere.\n\nVery, very interesting direction!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616291","commentId":616291,"userName":"richsabre","timestamp":1334144186,"content":"mmmmmm......dont know what to think really. exited doesnt quite get there...intrigued would be a better word. to be honest ive felt a bit 'meh' about this whole thing since the news leak, and thats a VERY strange thing coming from me given how much i love the hobbit\n\nim a bit confused- is a proper expansion or what?\n\ni like the treasure thing- will that be a one off card type unique to this expansion?\n\ncan we use the player cards in our usual decks?\n\ncan someone please make me more exited for this"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616314","commentId":616314,"userName":"Svenn","timestamp":1334146719,"content":"This is intriguing. I'm curious if this Bilbo who is a Hero but not one of your three heroes will be the only way to get Baggins resources or if we'll get regular heroes as well. If there are no regular heroes then any Baggins cards are basically useless outside of those scenarios, and lack of player cards is already my biggest complaint.\n\nAlso, I'm not sure what I think of the treasure cards. While I am usually a big fan of \"unlocking\" stuff, I don't know that this will work well. You now have to track which scenarios you've beaten and the treasure you gained from them before you can use them in your deck? Are they part of the encounter deck or the player deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616323","commentId":616323,"userName":"Bomb","timestamp":1334147689,"content":"Well this is far from release, so I'm sure we'll get additional announcements that will explain some of the new stuff. \n\nBilbo will be allowed to be used in current scenarios.  In fact, he can help facilitate the Secrecy keyword with his 0 threat.  He's a risk since him being killed ends the game, but just the same..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616325","commentId":616325,"userName":"player1761766","timestamp":1334147715,"content":"Well I thought this is just lovely! While I'm not entirely sure about whether or not I'm thrilled about it, I do think that anything to do with this card game has the ability to excite me beyond what is decent. The idea of it being a \"saga expansion\" makes me feel it'll be special, and the idea of it being the first half in a two-part (?)deluxe expansion set seems even more so. I presume there will be no second cycle of adventure packs coming out this year, anyway.\n\nThe treasure thing is interesting, though I'm also a bit confused by how they work - sounds like they're turned up from the encounter deck, though orcrist was free and unguarded, so presumably you can gain immediate possession of them? Hm. Makes me wonder what fresh hell they have in store for us.\n\nThere's not a tremendous amount to go on, but I am more excited about this now than I was last week!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616327","commentId":616327,"userName":"Rince","timestamp":1334147945,"content":"I don't quite know what to think of this \"expansion\" yet. Kind of a strange direction..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616331","commentId":616331,"userName":"Narsil0420","timestamp":1334148182,"content":"Magali Villeneueve's dominating as usual! ha ha!\n\nMake sure to also check out the About page on the expansions seperate website. It has some pictures of other player cards and encounter cards!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616332","commentId":616332,"userName":"Shiv@n","timestamp":1334148274,"content":"Did you read the \"about\" page on the minisite ?\n\nhttp://fantasyflightgames.com/edge_npm_sec.asp?eidm=136&esem=1 [http://fantasyflightgames.com/edge_npm_sec.asp?eidm=136&esem=1]\n\nSome cards and a few more infos..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616334","commentId":616334,"userName":"Budgernaut","timestamp":1334148533,"content":" Definitely an interesting direction. So now there's a distinction between \"Deluxe Expansion\" and \"Saga Expansion?\" I think the new Saga Expansion is a neat idea. If they keep going with these, I think we'll see scenarios for a bunch of the scenes in the novels. I, too, am worried about the number of player cards. I hope there are non-Baggins heroes and such to incorporate into other decks.\n\nAs for the treasures, I'm totally confused. If they're in the encounter deck and you find them during one game, do you just leave them out in future games? Or do you have to find it again each time you play. That really wasn't clear to me. I'm excited to learn more, even though this wasn't at all the kind of expansion I was expecting. Still, having just finished the Hobbit in the past week, I am super excited to try this set out.\n\nEDIT: So it looks like we will get a bunch of normal cards as well. That makes me a lot more excited about this expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616339","commentId":616339,"userName":"Mighty Jim 83","timestamp":1334148905,"content":" Bit of an odd one this\n\na Bilbo who doesn't look like he's just escaped from the 70s has to be a good thing, but otherwise, I'm a bit uncertain.\n\nno indication yet how many card there will be  - 150ish? seems to be the standard. Probably lots for the encounter decks, it'll be interesting to see how much if any of it is useable in conjunction with the other cards and quests we already have.\n\nAs I say I can't really make my mind up about this- I kind of hope it works, and inspires them to produce a Silmarillion Saga expansion -that said, I don't want things like this to take too much attention away from boosting the pool of regular cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616342","commentId":616342,"userName":"yohko2","timestamp":1334149306,"content":"Here is my money...\n\nSo now, where is my ''The Hobbit - Over Hill and Under Hill'' expansion box ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616350","commentId":616350,"userName":"richsabre","timestamp":1334149808,"content":"ok ive gotta say this- it is so annoying that they are splitting it into 2 - nowhere is the book split into two, unlike the trilogy-which is long and could be justifyed with the amount of material...... it is purely copying and jumping on the money wagon of the films- ive said this from the start and ill repeat it- i love the fact that we see new material but FFG come on -do your own thing....\n\nim a long way from bought on this idea\n\nbring on the hate..............demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616363","commentId":616363,"userName":"Budgernaut","timestamp":1334150829,"content":"richsabre said:\n\nok ive gotta say this- it is so annoying that they are splitting it into 2 - nowhere is the book split into two, unlike the trilogy-which is long and could be justifyed with the amount of material...... it is purely copying and jumping on the money wagon of the films- ive said this from the start and ill repeat it- i love the fact that we see new material but FFG come on -do your own thing....\n\nim a long way from bought on this idea\n\nbring on the hate..............demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\n\n\nWell, a lot really happens in The Hobbit. More than one expansion could cover, I'd say. But trying to split it into 3 could be stretching it, not because the source material is in short supply, but because it could bore the customer base. Two expansions is nice because we get to experience more scenarios from the book, but can look forward to other expansions besides a whole year of The Hobbit. I think two Saga Expansions is a good a balance in that regard.\n\nNow, let's look at The Hobbit. If you were making scenarios, how many scenarios would you make? Assuming 3 scenarios, per expansion, how many expansions is that? You have to keep in mind how much depth to put in each scene. Is the troll part a whole scenario, or just one stage? How about Mirkwood? Do you have a separate scenario for the Elven King's palace and for the spiders? Or do you have stage 1 looking for the Elves, stage 2 defeating the spiders, and stage 3 escaping the elven palace? I'll think about this myself and get back with an answer on how I would split it up. I'd be interested to see if most people would try to do 1, 2, or 3 expansions to cover the story of The Hobbit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616366","commentId":616366,"userName":"richsabre","timestamp":1334151320,"content":"yes, true i guess....im sorry im depseratly trying to find love for this sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616370","commentId":616370,"userName":"Bomb","timestamp":1334151568,"content":"I like that this is not 1 expansion.  The idea that we'll get more cards is invigorating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616377","commentId":616377,"userName":"Titan","timestamp":1334152406,"content":"Hmmm, wonder if we would have seen something like this so soon, if the movie was not being released in the near future.\n\nSo, this saga expansion will come in place of the regular boxed set and cycle? Or is it in addition to, with another to come down the line? \nAre the player cards legal with the regular set cards? Obviously, they wil be compatible.\nThe treasure cards look like they will come off the encounter deck or perhaps off play and once you have taken possession of them, you can put include them in your decks permanently, but as befits treasures, there will only be one of them, since they should be exceedingly rare.\n\nSounds intriguing, though I would hope that they aren't going to replace a whole regular cycle to do this.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616381","commentId":616381,"userName":"Khaden","timestamp":1334152833,"content":"VERY excited about this \"saga expansion\".  Glad to see that the game designers aren't afraid to continue to shake things up a bit (I think the treasures are a great idea, and if you don't like how they have to be \"unlocked\" just use them from the get go!). \n\nI also really like the distinction of \"saga expansion\" as well.  I'm imagining there will be fewer of these than normal expansions because there is a finite amount of book material to cover with scenarios but they make for an exciting change of pace.\n\nPretty stoked!gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616393","commentId":616393,"userName":"Mattr0polis","timestamp":1334154027,"content":"I'm very excited about this as well.\n\nI love the normal cards that are coming out and can't wait for more of them, but special \"saga\" deluxe expansions based on the books is a great idea and a great way to get us cards from stuff that doesn't fit *exactly* into the current timeframe.\n\nThe books are why we are all LotR fans in the first place, so characters, scenarios and things right out of those is awesome. Looking forward to more of these maybe down the road based on other main books and even the Silmarillion, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616400","commentId":616400,"userName":"richsabre","timestamp":1334154622,"content":"Budgernaut said:\n\nrichsabre said:\n\n \n\nok ive gotta say this- it is so annoying that they are splitting it into 2 - nowhere is the book split into two, unlike the trilogy-which is long and could be justifyed with the amount of material...... it is purely copying and jumping on the money wagon of the films- ive said this from the start and ill repeat it- i love the fact that we see new material but FFG come on -do your own thing....\n\nim a long way from bought on this idea\n\nbring on the hate..............demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif]\n\n \n\n \n\nWell, a lot really happens in The Hobbit. More than one expansion could cover, I'd say. But trying to split it into 3 could be stretching it, not because the source material is in short supply, but because it could bore the customer base. Two expansions is nice because we get to experience more scenarios from the book, but can look forward to other expansions besides a whole year of The Hobbit. I think two Saga Expansions is a good a balance in that regard.\n\nNow, let's look at The Hobbit. If you were making scenarios, how many scenarios would you make? Assuming 3 scenarios, per expansion, how many expansions is that? You have to keep in mind how much depth to put in each scene. Is the troll part a whole scenario, or just one stage? How about Mirkwood? Do you have a separate scenario for the Elven King's palace and for the spiders? Or do you have stage 1 looking for the Elves, stage 2 defeating the spiders, and stage 3 escaping the elven palace? I'll think about this myself and get back with an answer on how I would split it up. I'd be interested to see if most people would try to do 1, 2, or 3 expansions to cover the story of The Hobbit.\n\n\n\ni know ive already quoted this but ive just remembered what i meant to say.....id therefore do not 1 2 3 but a whole cycle, properly just like the others.....no change of system, yes put the new mechanics in just like all the other times, but keep the system the same, instead of mindless newline cinema copying"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616403","commentId":616403,"userName":"timbolton","timestamp":1334155068,"content":"I guess the best way to look at it is this way -\n\n\nNot to belittle the effort involved (because it was a big deal when other’s failed the task), but If Aragorn's quest to hunt down Gollum is fine to fit into one main set along with six adventure packs then an adventure the size of the one from \"The Hobbit\", i guess you could fit it into at least two of these special packs, if not more. And two sets is great especially if they are out before the first film, as they seem to plan.\n\n\nOk, let's not mince words here (and this isn't a go at anyone in particular, just some thoughts on negative comments over this) - yes, FFG are going to try to cash in the kudos, interest and love/joy that will be out there when the Hobbit movie arrives. And you know what, GOOD ON THEM. It's a business as well as something they enjoy. Who wouldn't do the same? And you know what's more - they have so far produced quality goods for this line, I am loving what they have done, and I ain't gonna start moaning because they are doing something to boost interest in what I think is a great game. Same goes for Cubicle 7 who produce the rpg, which by the way is set in the Wilderland right now - great idea, because in December 2012 people will be really interested in that region, all of a sudden. I hope LOTRO has a peek that way next year too.\n \n\nThe converted have been sat here wanting more Hobbit stuff, LOTR gets most of the attention. About time I say.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616405","commentId":616405,"userName":"Mattr0polis","timestamp":1334155340,"content":"Well said, Timbolton."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616408","commentId":616408,"userName":"Titan","timestamp":1334155731,"content":"In re-reading the article and thinking about it a bit more, I think I can answer some of my own questions. There won't be enough player cards here to make proper decks, therefore regular cards will have to be mixed in. Also, it very much sounds like this will be a boxed set with a second boxed set coming later, no cycle to be made out of it. \n\nFinally, I wonder if we will see a Gandalf hero card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616409","commentId":616409,"userName":"Thorongil","timestamp":1334155880,"content":"However we get treasure cards, that Orcrist is pretty cool. 0-cost, for 2 attack, and \"Response: After attached hero destroys an Orc enemy, add 1 resource to that hero's resource pool.\"\n\n-Awesome!\n\nAnd the Burglar Baggins card is a pretty cool idea. Notice the new sphere? \"Action: Bilbo Baggins gets +2 willpower, +2 attack, and +2 defense until the end of the phase. (You may spend a [bilbo] resource from Bilbo Baggins' resource pool to play this card even if you do not control Bilbo Baggins.\" Maybe not the most interesting card, but you can spend someone else's resources!\n\nI'm curious about that Tactics card with Gandalf wielding Glamdring. Definitely close to orcs, too... because it's glowing. happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nAltogether, I figure that no matter how you \"unlock\" treasures or use the new sphere, the cool thing is we're going to have scenarios from The Hobbit. Hard to complain, there. And I'm curious how that Stone-giant figures into everything...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616411","commentId":616411,"userName":"Mattr0polis","timestamp":1334155937,"content":"Titan said:\n\n Finally, I wonder if we will see a Gandalf hero card?\n\n \n\n \n\n \n\nFrom a themey standpoint I kind of hope not. Gandalf left the party just to show up in the nick of time even more in The Hobbit than he did in The Lord of the Rings, lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616429","commentId":616429,"userName":"Yenninho","timestamp":1334158330,"content":"I am especially curious about the 5 ( 4 with Bilbo ) new heroes. Any thoughts? Maybe FFG will use the dwarves from the first 'fellowship' we haven't already seen . Fili, Kili, Thorin, Oin, Ori, Nori?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616432","commentId":616432,"userName":"muemakan","timestamp":1334158560,"content":" So I guess the two sets will be stand alone \"deluxe expansions\" which will come out in addition to the regular APs and deluxe expansions.\n\n \n\nSo there is still the chance of an elf cycle after this one…….. I hope.\n\n \n\nAlso it sounds like the treasures can only be used in the Hobbit adventures:\n\nStill, treasures do more than bolster heroes; they establish continuity in a campaign that unites all three scenarios from The Hobbit: Over Hill and Under Hill, meaning the scenarios become something greater than the sum of their parts. They combine for a grand adventure!\n\n \n\n5 heroes will probably mean that we get 1 of each sphere and Bilbo.\n\nAlso I guess we won't see the baggins sphere in our normal APs.\n\n \n\nI think we will see encounters form the core set again…….Or they have to put more cards into the box. But I think it is the same price as the normal deluxe expansions so the reuse of core set cards seems likely.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616460","commentId":616460,"userName":"Budgernaut","timestamp":1334161181,"content":"Yenninho said:\n\n \n\nI am especially curious about the 5 ( 4 with Bilbo ) new heroes. Any thoughts? Maybe FFG will use the dwarves from the first 'fellowship' we haven't already seen . Fili, Kili, Thorin, Oin, Ori, Nori?\n\n \n\n \n\nAnd Dori appears to be an ally, if you go to the website for \"The Hobbit: Over Hill and Under Hill\" and click on \"About [http://fantasyflightgames.com/edge_npm_sec.asp?eidm=136&esem=1].\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616462","commentId":616462,"userName":"DurinIII","timestamp":1334161757,"content":"I am way excited. The art keeps getting better and better, and the \"Hobbitesque\" direction is amazing. One happy customer here! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616468","commentId":616468,"userName":"Mattr0polis","timestamp":1334163232,"content":"muemakan said:\n\n  Also it sounds like the treasures can only be used in the Hobbit adventures:\n\nStill, treasures do more than bolster heroes; they establish continuity in a campaign that unites all three scenarios from The Hobbit: Over Hill and Under Hill, meaning the scenarios become something greater than the sum of their parts. They combine for a grand adventure! \n\nI think we will see encounters form the core set again…….Or they have to put more cards into the box. But I think it is the same price as the normal deluxe expansions so the reuse of core set cards seems likely.\n\n \n\n\n\nYeah, I was thinking about this as well. I think it'd be cool to add a few more cards to the existing core set encounter sets and then re-use some of those. They could even add a few treasures to those sets or something.\n\nThe only minor problem with this, is that thematically speaking, Bilbo and the Dwarves don't go thru Mirkwood until about the second half of their journey, and they definitely don't go to Dul Guldur. Though I guess some Anduin River stuff would be semi-okay. I guess adding some of the encounter sets to some new ones would make them fit okay though since its just a lot of goblins, wargs and trolls anyway though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616478","commentId":616478,"userName":"qwertyuiop","timestamp":1334164636,"content":"Mighty Jim said:\n\n Bit of an odd one this\n\na Bilbo who doesn't look like he's just escaped from the 70s has to be a good thing, but otherwise, I'm a bit uncertain.\n\nno indication yet how many card there will be  - 150ish? seems to be the standard. Probably lots for the encounter decks, it'll be interesting to see how much if any of it is useable in conjunction with the other cards and quests we already have.\n\nAs I say I can't really make my mind up about this- I kind of hope it works, and inspires them to produce a Silmarillion Saga expansion -that said, I don't want things like this to take too much attention away from boosting the pool of regular cards.\n\n\n\n70's Baggins is smooth. I'm guessing the player cards will be interchangeable. The treasure looks to be scenario specific(maybe rules to pad  other encounter decks with treasure?) and I'm guessing the Baggins Sphere resource can be used to pay for anything...or will be limited to paying costs to stave off scenario specific encounters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616482","commentId":616482,"userName":"HilariousPete","timestamp":1334165161,"content":"Wow, I'm pretty excited about the new expansion. Being able to play the adventures of the main books is great, and FFG's decision to clearly separate between a \"usual\" expansion and a \"saga\" expension is also good.\n\nGiven the limited amount of potential heroes in the main books, I feared a primitive recycling of heroes (e.g. \"Aragorn or leader in the dark\" = Aragorn just as a spirit hero with some stats changed...). But the new Bilbo Baggins features a complete new idea. And giving players Bilbo as a special (zero-cost) hero is also good, since he will be necessary thematically in most (all?) of the quests.\n\nAnd I'm especially excited for the new encounter cards in wilderness (and not underground or in dungeons), like the rock-throwing giant or the High Pass!happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif] Can't wait for this expansion to be available. Thx to Shiv@n and Budgernaut for the link to the \"about\" page, I would have missed that page."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616491","commentId":616491,"userName":"Shelfwear","timestamp":1334166574,"content":"Mattr0polis said:\n\nand they definitely don't go to Dul Guldur.\n\nMaybe not the Dwarfs but Gandalf goes to Dol Guldur and raids the fortress with the help of the Elves after he leaves Thorin's Company & Bilbo temporarily. Even though this is not mentioned in \"The Hobbit\" book, it happens as Tolkien wrote later and the occurences will most probably be part of the film as the trailer suggests.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616528","commentId":616528,"userName":"DurinIII","timestamp":1334174888,"content":"Curious what you others think about this. Doesn't it seem a bit early in this game to introduce an entirely new spin (as in the case with the newly spoiled Bilbo card)? Please don't misunderstand me however,I have every intention of buying this new set; though I would rather just have more cards that can work off of the core set and adventure packs. Are the cards in this special hobbit set able to mix with the current card pool without problems?\n\n \n\nthanks,\n\nJoseph "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616533","commentId":616533,"userName":"soullos","timestamp":1334175944,"content":"I'm just glad that we're getting 5 heroes in this expansion instead of the paltry two in the previous one. I do like the idea behind the treasure cards. I know someone made a houserule to include rewards for beating scenarios in succession using the Dunedain attachments, so it's cool to see something similar to that in the rules. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616534","commentId":616534,"userName":"richsabre","timestamp":1334175961,"content":"yeah thats what i want to know- have i missed a block of text somewhere? can you use the bilbo sphere cards in other decks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616538","commentId":616538,"userName":"peterstepon","timestamp":1334176699,"content":" I have a load of questions about this expansion, just off the top of my head\n\n1/ Can you use the same heroes that you use in the regular game?  Most obvious, can I use two Bilbo baggins heroes (in some weird, Dr. Who time warp event?).  I have not read the Hobbit in a long time but would some of the characters not even been born yet?   I know Legolas is about 3,000 years old, but was Aragorn even alive then.  Forgive me, my Ring lore is a bit rusty?\n\n2/  The box looks all happy and warm smles and hobbit goodiness, does that mean that the scenarios are going to be easy?  The difficulty of the original boxed set I am sure made many players (myself included) scream and howl like the protagonists in an H.P. Lovecraft story.  I just looked at the advertisements and thought that it would be a few difficulty 1, 2 or 3 scenarios.\n\n3/  What new rules will be included.  I always wonder if expansions like this are designed to correct all the design flaws of the original game and have a 2.0 set.\n\n \n\nAnyways, those are the questions I am screaming out now.  Any insight would be most welcome.  Any speculation would also be welcome. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616541","commentId":616541,"userName":"Hastur360","timestamp":1334176965,"content":"I think the Baggins Sphere cards will be playable in decks outside of the Hobbit. I am sure we may get a new version of Frodo, and don't forget Bilbo is part Took so whenever we get Pipin he will probably be Baggins sphere (Who knows maybe Lobelia Sackville-Baggins might make an appearance). I am sure there will also be an attachment ala Resourceful or a Song that will allow the use of the Baggins sphere as well. As far as the five new heroes I am going to go with Thorin (Leadership), Gwahir or Beorn (Tactics), Balin (Spirit),  Ori or Nori (Lore), and of course Bilbo (Baggins Sphere.)\n\nI am very excited about the idea of the Saga Expansions as this can lead to an actual telling of the Lord of the Rings and possibly the Silmarillion and who knows Children of Hurin or Unifinished Tales/History of Middle-Earth stuff.\n\nTreasure cards sound like a cool mechanic and finally help scenarios lend themselves to a campaign mode. Especially if Saga Expansion scenarios are designed with a better flow and faster pace to them to get more scenarios in at one sitting of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616590","commentId":616590,"userName":"radiskull","timestamp":1334185603,"content":" You definitely wouldn't be able to use two Bilbos.  The card is unique, so only one in play at a time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616602","commentId":616602,"userName":"booored","timestamp":1334188122,"content":"radiskull said:\n\n \n\n You definitely wouldn't be able to use two Bilbos.  The card is unique, so only one in play at a time.\n\n \n\n \n\n+1\n\nmost card games are unique by card \"name\".. the way to look at it is that it isn't teh \"card\" that is unique but the name of the card.. so if they have the same name, even if they have different \"titles\" you can not use that card twice.\n\nHere is an example from CoC (who nate is a designer of as well, these games share much)\n\nmed_gallery_38_166703.jpg [http://www.cardgamedb.com/forums/uploads/1283062288/med_gallery_38_166703.jpg]med_gallery_63_52622.jpg [http://www.cardgamedb.com/forums/uploads/1289446223/med_gallery_63_52622.jpg]\n\nPS - check out the power creep on this card lol :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616608","commentId":616608,"userName":"Chris51261","timestamp":1334189033,"content":" Arwen is the first example of this that will be released with the next adventure pack. You won't be able to use the spirit ally Arwen with the quest objective Arwen for the two scenarios that she is  in. Arwen can't escort Arwen, lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616610","commentId":616610,"userName":"radiskull","timestamp":1334189158,"content":" Now THAT's power creep. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616616","commentId":616616,"userName":"booored","timestamp":1334190962,"content":"radiskull said:\n\n Now THAT's power creep. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nhehe :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616653","commentId":616653,"userName":"Mighty Jim 83","timestamp":1334202877,"content":" Aragorn would have been alive at the time of the Hobbit, although only about ten years old - I think the Hobbit is about 2941, and Aragorn was born 2931.\n\nThat said, Bilbo's Birthday party, (when the LCG notionally starts) is 3001, at which point Eowyn was 6, and she seems to manage fine being a hero. - She was only 26 at the time of the War of the Ring, as good as she was, Miranda Otto was about 10 years older than Eowyn was supposed to be...\n\nTo steal a phrase from Doctor Who, I think they've decided that it's all just \"wibbly-wobbly-timey-wimey\" rather than going for any clear chronology.\n\n \n\nRe: Shub-Niggurath - ridiculous power creep (and very annoying as I only have the Core set version)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616683","commentId":616683,"userName":"lleimmoen","timestamp":1334207507,"content":"Guys, how can you play that other game? I for one could not stand looking at the ugly pics?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616710","commentId":616710,"userName":"lleimmoen","timestamp":1334214004,"content":"... i know it is not much to the topic, and it is meant partly as a jest, those pics though they really gave me an unsettling feeling, i had to go calm myself watching some middle-earth artwork afterwards... cheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616716","commentId":616716,"userName":"richsabre","timestamp":1334214906,"content":"Hastur360 said:\n\nI think the Baggins Sphere cards will be playable in decks outside of the Hobbit. I am sure we may get a new version of Frodo, and don't forget Bilbo is part Took so whenever we get Pipin he will probably be Baggins sphere (Who knows maybe Lobelia Sackville-Baggins might make an appearance). I am sure there will also be an attachment ala Resourceful or a Song that will allow the use of the Baggins sphere as well. As far as the five new heroes I am going to go with Thorin (Leadership), Gwahir or Beorn (Tactics), Balin (Spirit),  Ori or Nori (Lore), and of course Bilbo (Baggins Sphere.)\n\nI am very excited about the idea of the Saga Expansions as this can lead to an actual telling of the Lord of the Rings and possibly the Silmarillion and who knows Children of Hurin or Unifinished Tales/History of Middle-Earth stuff.\n\nTreasure cards sound like a cool mechanic and finally help scenarios lend themselves to a campaign mode. Especially if Saga Expansion scenarios are designed with a better flow and faster pace to them to get more scenarios in at one sitting of the game.\n\n\n\nhistory material wont be in given they are draft material and analysis, UT probably the same, i think given this news then silmariliion has a higher chance of being done, though i still heavily doubt that, silmarillion rights are tougher to aquire\n\nchildren of hurin is just an extended version of  a part of the silmarillion so i doubt we shall get both"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616751","commentId":616751,"userName":"scottindeed","timestamp":1334220827,"content":" I am really excited for this.  My only complaint is that stuff comes out for this game faster than I can keep up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616753","commentId":616753,"userName":"richsabre","timestamp":1334221278,"content":"scottindeed said:\n\n I am really excited for this.  My only complaint is that stuff comes out for this game faster than I can keep up.\n\n\n\nha...i agree with you on that one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616812","commentId":616812,"userName":"Budgernaut","timestamp":1334229871,"content":"lleimmoen said:\n\n... i know it is not much to the topic, and it is meant partly as a jest, those pics though they really gave me an unsettling feeling, i had to go calm myself watching some middle-earth artwork afterwards... cheers\n\n\n\nYou're not the only one. It didn't bother me too much when I first saw those posted (though I definitely wasn't expecting it) but I ended up having a nightmare about Shub-Niggurath last night from those pictures . . . creepy stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616892","commentId":616892,"userName":"player1761766","timestamp":1334240763,"content":"I can't help feeling a tiny bit cynical now, as it was pointed out on here whether they would have produced this expansion so soon if the movie wasn't due out. But then, I've felt cynical when I read the Khazad-dum announcement, and I very quickly got over that. So I'm sure it won't be anything that'll stop my enjoyment of this!\n\nI am beginning to look upon it more as a game-within-a-game, so that while it is most likely possible to use the cards elsewhere, from what I've seen so far it looks so highly thematic to The Hobbit that I'd probably want to keep it a little bit special, and not go including Baggins cards in every deck I make. Although that may just be because I'm slightly confused about that... But it looks excellent, and I'll definitely be snapping it up, cynicism or no!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616893","commentId":616893,"userName":"xibxang","timestamp":1334240820,"content":" Is anyone else thinking that this new sphere is a nod to solo players?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616894","commentId":616894,"userName":"richsabre","timestamp":1334241051,"content":"xibxang said:\n\n Is anyone else thinking that this new sphere is a nod to solo players?\n\n\n\nis this new sphere going to be included in packs after the expansions? ie wil you have to own this expansion to buy later packs to get full use of the baggins sphere"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616902","commentId":616902,"userName":"xibxang","timestamp":1334241579,"content":"richsabre said:\n\nis this new sphere going to be included in packs after the expansions? ie wil you have to own this expansion to buy later packs to get full use of the baggins sphere\n\nWell, I'm no expert but I would guess that spreading this new sphere over the next cycle of APs after the two expansions would make good business sense as it would give many players a very valid reason to buy into a third cycle. Besides, the concept of stealth's being drip-fed to us over the current cycle. There's no reason why the four-member-party concept won't be doled out in the next.\n\nJust my opinion, though. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616906","commentId":616906,"userName":"richsabre","timestamp":1334242122,"content":"right, not sure what to think of that...on one hand its no different to you having to own khazad to play the dwarrowdelf cycle for instance, however the expansions are rather different to deluxe packs- not sure how its going to play out"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616908","commentId":616908,"userName":"BiJay","timestamp":1334242912,"content":"As they didn't mention anything about a corresponding cycle and it seems like everything will be covered by the expansions story-wise I very much doubt there will be more cards of that sphere outside of those expansions. It wouldn't fit thematically."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616914","commentId":616914,"userName":"scottindeed","timestamp":1334243723,"content":" I am thinking that the Baggins sphere will be restricted to the Hobbit scenarios and not mix in generally outside of this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616921","commentId":616921,"userName":"Mattr0polis","timestamp":1334245176,"content":"I'm also guessing that Bilbo and the Bilbo Sphere won't be added to outside of these two Deluxe Expansions. Mainly due to the wording in the preview:\n\n\"Throughout the scenarios of The Hobbit: Over Hill and Under Hill, Bilbo Baggins joins the first player as a free hero.\"\n\nSo it sounds like the new Bilbo himself is just a special character for use with these quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616929","commentId":616929,"userName":"Sprenger","timestamp":1334247010,"content":"I don't think we will see very many heroes for this new sphere because it seems like it was intended for the Saga expansions. However I don't see a reason why we couldn't use this Bilbo in previous/future expansions. He is a 0 threat character but if he is killed it is all over for your group. He is a high risk/high reward character.  I wouldn't be surpised to see them make a rule where players can only have 1 baggins hero in play.\n\nI don't think we will ever see a complete deck for this sphere because just from the cards previewed (which is only one) it only applied to Bilbo.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=616960","commentId":616960,"userName":"Budgernaut","timestamp":1334251212,"content":"I'm betting they gave this a lot of forethought and decided on making the new Baggins sphere to be used in Saga Expansions because it applies equally well to Bilbo in The Hobbit as it does to Frodo in The Lord of the Rings. But it seems to me that Baggins sphere cards will be used only in Saga quests and not in the normal expansions and adventure packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617017","commentId":617017,"userName":"Mattr0polis","timestamp":1334264434,"content":"Budgernaut said:\n\nI'm betting they gave this a lot of forethought and decided on making the new Baggins sphere to be used in Saga Expansions because it applies equally well to Bilbo in The Hobbit as it does to Frodo in The Lord of the Rings. But it seems to me that Baggins sphere cards will be used only in Saga quests and not in the normal expansions and adventure packs.\n\n\n\nI agree he's probably made mainly for these quests, but what's cool is that nowhere on his card does he say he *can't* be used out of there. But we just don't know yet.\n\nI'm kind of hoping you can use him in normal decks against other Quests though. The negatives of doing so are that he's weak, you instantly lose if he dies, his resources have limited use without a Song or something, he bounces between players (could be good or bad) and there will probably be a very limited amount of cards for his sphere. But the benefits are the sweet 0 threat that could really make Secrecy cards outstanding and that his sphere cards will probably be very good and can be played by any players.\n\nSeems like it'd be fun to try but again we'll just have to wait and see the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617021","commentId":617021,"userName":"starhawk77","timestamp":1334265010,"content":"I doubt we'll see Baggins sphere cards used in APs or other scenarios, especially because this \"saga\" expansion clearly exists outside the mainstream continuity FFG has established for this game. I'll be really interested to see how--or if--they reconcile this expansion with the rest of the card pool. I mean, I like Thorin Oakenshield as much as the next guy, but won't it be weird to have him show up on the Road to Rivendell given the fact that he's...dead? \n\nI have a feeling these scenarios will be cast as several of Bilbo's tales, and that there will be some limitations on which Core Set/Adventure Pack cards can be used in conjunction with the cards in the saga expansion. Either that or FFG just stops worrying about any sort of continuity."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617036","commentId":617036,"userName":"Mattr0polis","timestamp":1334266954,"content":"starhawk77 said:\n\n \n\nand that there will be some limitations on which Core Set/Adventure Pack cards can be used in conjunction with the cards in the saga expansion. Either that or FFG just stops worrying about any sort of continuity.\n\n \n\n \n\nI don't think they'd do that. It would add unnecessary busyness to the game. And like has already been discussed in other threads there is already very little continuity, like how Eowyn was like 6 years old or how you can take Eagles inside Khazad-Dum.\n\nThey'll probably just let us continue to build however we want and if it bothers you that a certain character wasn't around then you personally can just decide to not use them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617091","commentId":617091,"userName":"starhawk77","timestamp":1334283371,"content":"Mattr0polis said:\n\nThey'll probably just let us continue to build however we want and if it bothers you that a certain character wasn't around then you personally can just decide to not use them.\n\n \n\n \n\nThat would certainly be the simplest approach. Personally, I could care less about the \"story,\" but FFG seems committed to maintaining at least a semblance of a cohesive narrative. Eowyn doesn't make much sense in that regard, but dead dwarves would be even more difficult to explain. Still, trying to artificially limit hero selection in future scenarios could turn into a massive headache, so you're probably right to think they just won't worry about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617107","commentId":617107,"userName":"jhaelen","timestamp":1334287155,"content":"Mattr0polis said:\n\n \n\nI agree he's probably made mainly for these quests, but what's cool is that nowhere on his card does he say he *can't* be used out of there. But we just don't know yet.\n\n\n\nYep. However, the preview indicates you can use him as a fourth hero, and that's not something that's mentioned on the card, so you won't be able to use him like that outside of the saga context. If you wanted to use him, he'd have to be one of your regular (up to) three heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617135","commentId":617135,"userName":"OnkelZorni","timestamp":1334293632,"content":"I'm quite sure we will see a little booklet. And in this booklett we will find some rules, saying that Bilbo and his Baggins sphere can only be used in the saga-scenarios (and maybe later in the LOTR-Saga, if these will ever be published).\n\nI really like the idea of treasure cards and i hope the campaign-feeling will be much better than it's yet.\n\nFFG, I'm waiting, hurry to publish! Now! Yesterday! no matter when but asap! gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617178","commentId":617178,"userName":"Titan","timestamp":1334306247,"content":"I have seen games before where characters that could never possibly meet each other, i. e. characters from the\"past' and the \"present\", can be included in the same deck. Realistically, I have a hard time believing that cards from this expansion could not be used in the regular sets. I can see Bilbo and his sphere as an exception to that and maybe the treasures, but the regular heroes and other player cards should be playable. Otherwise, you have a bunch of player cards that are only useful in a handful of scenarios and that does not serve to advance the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617179","commentId":617179,"userName":"Bomb","timestamp":1334306574,"content":"I am not reading anything that implies he can only be used in these expansions.  After all, the Treasure cards are not explained enough and imply replayability for not discovering them all in one scenario.  The way I am reading it, you earn the ability to include these Treasures in your deck, but am not sure if that is for deck building or if it is shuffled in once you find them in the scenario.  It would seem silly if these Treasures were shuffled in to your deck only during that scenario because you may never draw them.  I could be wrong on my interpretation.\n\nThe first player controls him, so in multiplayer, it is entirely possible to have a 4th hero because of that.  Perhaps he can only be 1 of the 3 heroes for Player A, but because of his passive ability, when Player B gets control of him, he must be his 4th hero while Player A only has 2 Heroes remaining.\n\nMore likely than not, without additional Baggins sphere heroes, Player B won't have Baggins cards to spend his resources on, so when Player A gets him back, he'll have the extra resource that was gained while Player B was the first player.\n\nI think this is one way to encourage the ability to use Secrecy and perhaps we'll see some other gimmicky heroes with really low threat.  This could be a better hero in Solo play because you never have to share him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617184","commentId":617184,"userName":"Bomb","timestamp":1334307204,"content":"Titan said:\n\nI have seen games before where characters that could never possibly meet each other, i. e. characters from the\"past' and the \"present\", can be included in the same deck. Realistically, I have a hard time believing that cards from this expansion could not be used in the regular sets. I can see Bilbo and his sphere as an exception to that and maybe the treasures, but the regular heroes and other player cards should be playable. Otherwise, you have a bunch of player cards that are only useful in a handful of scenarios and that does not serve to advance the game. \n\n\n\nThematically there is plenty that is not necessarily accurate in the game already.  Combining past and present heroes may not make much sense because of the timeline, but for a game and to encourage dynamic deck building options(and to increase replayability due to keeping it interesting) I'm all for it to add to the fun.  To enjoy the game, I do not need everything to make sense storywise or themewise unless they started introducing aliens and spaceships etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617187","commentId":617187,"userName":"Captain Poe","timestamp":1334307676,"content":"I for one am extremely excited.  The hobbit is not only my favorite piece of work by Tolkien, but my favorite book of all time.\n\nBilbo looks underwhelming at first, but I bet there are a lot of really good Baggins spheres cards that really let him shine. After all, he was underwhelming at first, but then always found a way to save the day in the end.\n\nAs for the issue of conflicting timelines and dead dwarf heroes? I say \"meh, who cares?\". Listen, we already have a game that allows a Bilbo to go on an adventure with Boromir and Glorfindel to raid the orcs of moria or run around osgiliath. The timeline and canon of tolkiens world is obviously not the main objective of this game. Its to create new stories, much in the sense that an RPG does. I don't understand the point of allowing certain things to slide and not others. After all, if we really want to keep this true to tolkiens work, we might as well burn our cards and just read lord of the rings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617237","commentId":617237,"userName":"peterstepon","timestamp":1334314617,"content":"They also said that this was a Saga expansion.  Does that imply that future sets might have stories from the Samarillion or other eras?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617243","commentId":617243,"userName":"Mattr0polis","timestamp":1334315879,"content":"peterstepon said:\n\nThey also said that this was a Saga expansion.  Does that imply that future sets might have stories from the Samarillion or other eras?\n\n\n\nThat's what a lot of us are hoping. Like the normal monthly Adventure Packs and Deluxe expansions can continue the current 'in-between' timeframe and then FFG occasionally throw out a new 'Saga' box based on the Lord of the Rings trilogy, Silmarillion, etc.\n\nI'd be 100% perfectly fine with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617277","commentId":617277,"userName":"Svenn","timestamp":1334319328,"content":"Bomb said:\n\nI am not reading anything that implies he can only be used in these expansions.  After all, the Treasure cards are not explained enough and imply replayability for not discovering them all in one scenario.  The way I am reading it, you earn the ability to include these Treasures in your deck, but am not sure if that is for deck building or if it is shuffled in once you find them in the scenario.  It would seem silly if these Treasures were shuffled in to your deck only during that scenario because you may never draw them.  I could be wrong on my interpretation.\n\nThey couldn't be shuffled in from the encounter deck, that's for sure. They have different backs.\n\nI could see a few options:\n\n1) Completing certain objectives \"unlocks\" these cards for use in player decks for future scenarios. There is nothing stopping players from simply including them in their decks though. Perhaps you are supposed to play through all 3 quests in a row, and after each quest you add some treasures to your deck as you complete the next quests so they build up.\n\n2) They are part of the encounter deck, but get used immediately somehow (similar to how objectives already work).\n\n3) They are a third random deck (player deck, encounter deck, treasure deck) and certain cards tell the player to draw cards from the treasure deck.\n\nI'm betting on number 1. I'm guessing it's more of a thematic thing and there will be nothing stopping players from just including these in any deck from the start. I'm also curious as to how they would expect you to track all the treasures you've unlocked so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617306","commentId":617306,"userName":"Mattr0polis","timestamp":1334322345,"content":"Svenn said:\n\n \n\nThey couldn't be shuffled in from the encounter deck, that's for sure. They have different backs.\n\n\n\nJust curious, where did it say the Treasures have different backs?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617311","commentId":617311,"userName":"Khaden","timestamp":1334323267,"content":"Mattr0polis said:\n\nSvenn said:\n\n \n\n \n\nThey couldn't be shuffled in from the encounter deck, that's for sure. They have different backs.\n\n \n\n \n\nJust curious, where did it say the Treasures have different backs?\n\n\n\nI would assume they have player card backs because the article implies that you can use the treasure cards in your deck once they're \"unlocked\" so if that's the case they couldn't be put into the encounter deck.  But that's still a bit of speculation at this point obviously"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617324","commentId":617324,"userName":"Robert McMutton","timestamp":1334324818,"content":"Khaden said:\n\nMattr0polis said:\n\n \n\nSvenn said:\n\n \n\n \n\nThey couldn't be shuffled in from the encounter deck, that's for sure. They have different backs.\n\n \n\n \n\nJust curious, where did it say the Treasures have different backs?\n\n \n\n \n\nI would assume they have player card backs because the article implies that you can use the treasure cards in your deck once they're \"unlocked\" so if that's the case they couldn't be put into the encounter deck.  But that's still a bit of speculation at this point obviously\n\n\n\nMy bet is that the treasures will be like objective cards, with encounter backs, and shuffled in the encounter deck, but they will act as attachment cards, so that when you reveal it from the encounter deck, you let them revealed until you can pay its costs, and attach them to a hero. Once you made that, you can let them be attached to that hero at the end of the quest, and to attempt the following quest (or repeat the current one in order to search for more treasures) with the same heros and deck. So, they will never be shuffled in the player deck.\n\nJust my thoughts. Greetings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617350","commentId":617350,"userName":"Glaurung","timestamp":1334330000,"content":"Robert McMutton said:\n\nKhaden said:\n\n \n\nMattr0polis said:\n\n \n\nSvenn said:\n\n \n\n \n\nThey couldn't be shuffled in from the encounter deck, that's for sure. They have different backs.\n\n \n\n \n\nJust curious, where did it say the Treasures have different backs?\n\n \n\n \n\nI would assume they have player card backs because the article implies that you can use the treasure cards in your deck once they're \"unlocked\" so if that's the case they couldn't be put into the encounter deck.  But that's still a bit of speculation at this point obviously\n\n \n\n \n\nMy bet is that the treasures will be like objective cards, with encounter backs, and shuffled in the encounter deck, but they will act as attachment cards, so that when you reveal it from the encounter deck, you let them revealed until you can pay its costs, and attach them to a hero. Once you made that, you can let them be attached to that hero at the end of the quest, and to attempt the following quest (or repeat the current one in order to search for more treasures) with the same heros and deck. So, they will never be shuffled in the player deck.\n\nJust my thoughts. Greetings.\n\n\n\nSounds real!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617417","commentId":617417,"userName":"DurinIII","timestamp":1334347557,"content":" Yeah Robert; I agree with you there about that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617468","commentId":617468,"userName":"BiJay","timestamp":1334368377,"content":"I think those treasure cards will be like those victory points. So instead of saying Victory n (with n being a number) it says Victory X (with X being a card name). So once you defeat that card you get that treasure. I'm still unsure if you just immediately shuffle that card into your deck or if you claim the right to be able to include them in your deck in future scenarios. For me it seems the first case is a little bit more likely as that one treasure card which got spoiled is quite powerful for it's cost, so I doubt you can use it during normal deck building even after you claimed the treasure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617696","commentId":617696,"userName":"player585877","timestamp":1334439049,"content":" It could be that treasures are just like objectives, with an encounter deck card.   But there might be duplicate treasure cards with player deck baks that can be switched and shuffled into the deck.   Or they might be have player card backs, but set aside out of play and then be unlocked through an encounter card effect.  Then they might get shuffled into the player deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=617988","commentId":617988,"userName":"Mattr0polis","timestamp":1334516498,"content":" That's a cool idea, juanma. I'll love any kind of system where we can use the treasures in different Quest cycles as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=618012","commentId":618012,"userName":"DurinIII","timestamp":1334524927,"content":"That is a cool idea. Go Hobbit!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=618261","commentId":618261,"userName":"Dwnhmcntryboy","timestamp":1334581677,"content":" FFG does say:\n\nTreasures are new player cards that represent some of the rarest and most valuable items your characters can find while adventuring in Middle-earth. But players can’t include these valuable items in their decks right away. Instead, in order to use treasure cards, players must first locate them during a scenario. Only then do they “unlock” the ability to use these famous and powerful cards in later scenarios.\n\nThey could have different backs all together. You just get to attach them for free during setup at the beginning of the next scenario. So the backing of the cards is really a moot point.\n\nAlso seems like the Saga editions are just like someone said earlier,\" a game within a game.\"  You get board of the normal game and decide one weekened you and your friends will play Saga Edition. Which is cool because more than a few of us have already been trying to play the game chronologically. FFG has beat the players to making an alternate format to the game and I think it is brilliant!\n\nI, personally, am hoping that we get 2 Deluxe and 2 Saga Editions each year."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=618268","commentId":618268,"userName":"Budgernaut","timestamp":1334582412,"content":"Dwnhmcntryboy said:\n\n FFG does say:\n\nTreasures are new player cards that represent some of the rarest and most valuable items your characters can find while adventuring in Middle-earth. But players can’t include these valuable items in their decks right away. Instead, in order to use treasure cards, players must first locate them during a scenario. Only then do they “unlock” the ability to use these famous and powerful cards in later scenarios.\n\nThey could have different backs all together. You just get to attach them for free during setup at the beginning of the next scenario. So the backing of the cards is really a moot point.\n\nAlso seems like the Saga editions are just like someone said earlier,\" a game within a game.\"  You get board of the normal game and decide one weekened you and your friends will play Saga Edition. Which is cool because more than a few of us have already been trying to play the game chronologically. FFG has beat the players to making an alternate format to the game and I think it is brilliant!\n\nI, personally, am hoping that we get 2 Deluxe and 2 Saga Editions each year.\n\n\n\nYour first line there mentions that \"Treasures are new player cards.\" That seals it to me. If they are player cards, they must have player backs. What if it gets discarded from your hero and sent to the discard pile. If you use Will of the West to shuffle it into your deck, it will have to have the same back as other player cards, unless there is a rule that discarded treasure cards are removed from play.\n\nBut I must say I'd be disappointed if there were two copies of each treasure, one with each type of back to it. That would be a waste of card space in the expansion, in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=618382","commentId":618382,"userName":"Dwnhmcntryboy","timestamp":1334595302,"content":"Budgernaut said:\n\n \n\nDwnhmcntryboy said:\n\n \n\n FFG does say:\n\nTreasures are new player cards that represent some of the rarest and most valuable items your characters can find while adventuring in Middle-earth. But players can’t include these valuable items in their decks right away. Instead, in order to use treasure cards, players must first locate them during a scenario. Only then do they “unlock” the ability to use these famous and powerful cards in later scenarios.\n\nThey could have different backs all together. You just get to attach them for free during setup at the beginning of the next scenario. So the backing of the cards is really a moot point.\n\nAlso seems like the Saga editions are just like someone said earlier,\" a game within a game.\"  You get board of the normal game and decide one weekened you and your friends will play Saga Edition. Which is cool because more than a few of us have already been trying to play the game chronologically. FFG has beat the players to making an alternate format to the game and I think it is brilliant!\n\nI, personally, am hoping that we get 2 Deluxe and 2 Saga Editions each year.\n\n \n\n \n\nYour first line there mentions that \"Treasures are new player cards.\" That seals it to me. If they are player cards, they must have player backs. What if it gets discarded from your hero and sent to the discard pile. If you use Will of the West to shuffle it into your deck, it will have to have the same back as other player cards, unless there is a rule that discarded treasure cards are removed from play.\n\nBut I must say I'd be disappointed if there were two copies of each treasure, one with each type of back to it. That would be a waste of card space in the expansion, in my opinion.\n\n \n\n \n\nGood point. The developers are always trying to push something innovative to the universe though. Those innovations are what I am concerned with. NOT the backs of the decks, albeit a minor part of the innovation. \n\nMy point being How is THOU going to change the game or game state?\n\n\nMaybe we get Istari resources in the next arc ?For that Matter maybe this is a playtest of sorts for race specific resources i.e. Rohan, Dunedain and so on.\n\nCould treasures be a new way to introduce player prizes for tournaments? Win/participate in a tournament: Get a Registered prize that you get to play with in subsequent tournaments.\n\nThe same goes for the Bilbo Card. Could be a new way to get exclusive Characters that support your favorite race? For all purposes we could see an scenario where all the races are actually fighting Sauron at some point. Each player would need to represent the Race with Epic Heroes, which this version of Bilbo is. The possibilities, just from this expansion alone, open so much up for speculation.\n\nOver all I think this is a positive move for FFG"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619342","commentId":619342,"userName":"Budgernaut","timestamp":1334762274,"content":" So only 5 Baggins sphere cards and they can only be used in the two The Hobbit expansions. Seems fair to me. I wonder if they'll try out treasures in other Saga packs only or expand that to some of the regular cycles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619440","commentId":619440,"userName":"Cotillion37","timestamp":1334776390,"content":"Dwnhmcntryboy said:\n\nI, personally, am hoping that we get 2 Deluxe and 2 Saga Editions each year.\n\n\n\nI hope so too...but I'm pretty sure my wallet is going to hate me if that ends up being the case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619441","commentId":619441,"userName":"richsabre","timestamp":1334776516,"content":"oooh cant see that happening- the main expansion bulk is the deluxe and cycles, the sagas are specials - well thats the way i see it\n\nid be surprised if we got 2 of each- then again im surprised at this whole thing anyways"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619530","commentId":619530,"userName":"RGun","timestamp":1334800136,"content":"This Hobbit saga expansion caught me by surprise - I was expecting the next deluxe expansion to be hobbit themed given the movie coming out but didn't see the whole saga thing coming.  After thinking about it I really like it.  For me, having interesting new scenarios and new game mechanics is much more interesting to me then new player cards.  Given it is a cooperative game the main way to keep it fresh is with new scenarios and new game mechanics as a fixed encounter deck can't develop new strategies to keep you interested in playing the way a human opponent can.  The challenge with a living card game is every new game mechanic you introduce makes the game more complex and then you have to take it into consideration when designing new scenarios - especially challenging in a cooperative game like this where a scenario has to play well with all sorts of combinations of player cards.  The partially self contained sagas are a way to introduce some interesting new game mechanics in a one-off and not need to worry about them staying with the game as it expands.  I think this allows the designers to introduce some more interesting mechanics and that makes for more enjoyable and challenging scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619713","commentId":619713,"userName":"Budgernaut","timestamp":1334836402,"content":"RGun said:\n\nThis Hobbit saga expansion caught me by surprise - I was expecting the next deluxe expansion to be hobbit themed given the movie coming out but didn't see the whole saga thing coming.  After thinking about it I really like it.  For me, having interesting new scenarios and new game mechanics is much more interesting to me then new player cards.  Given it is a cooperative game the main way to keep it fresh is with new scenarios and new game mechanics as a fixed encounter deck can't develop new strategies to keep you interested in playing the way a human opponent can.  The challenge with a living card game is every new game mechanic you introduce makes the game more complex and then you have to take it into consideration when designing new scenarios - especially challenging in a cooperative game like this where a scenario has to play well with all sorts of combinations of player cards.  The partially self contained sagas are a way to introduce some interesting new game mechanics in a one-off and not need to worry about them staying with the game as it expands.  I think this allows the designers to introduce some more interesting mechanics and that makes for more enjoyable and challenging scenarios.\n\n\n\nThat is a very well-thought conclusion. I like your thinking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619732","commentId":619732,"userName":"player585877","timestamp":1334842230,"content":"RGun said:\n\nThis Hobbit saga expansion caught me by surprise - I was expecting the next deluxe expansion to be hobbit themed given the movie coming out but didn't see the whole saga thing coming.  After thinking about it I really like it.  For me, having interesting new scenarios and new game mechanics is much more interesting to me then new player cards.  Given it is a cooperative game the main way to keep it fresh is with new scenarios and new game mechanics as a fixed encounter deck can't develop new strategies to keep you interested in playing the way a human opponent can.  The challenge with a living card game is every new game mechanic you introduce makes the game more complex and then you have to take it into consideration when designing new scenarios - especially challenging in a cooperative game like this where a scenario has to play well with all sorts of combinations of player cards.  The partially self contained sagas are a way to introduce some interesting new game mechanics in a one-off and not need to worry about them staying with the game as it expands.  I think this allows the designers to introduce some more interesting mechanics and that makes for more enjoyable and challenging scenarios.\n\n\n\n \n\nI couldn't say it better. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619757","commentId":619757,"userName":"Hannibal_pjv","timestamp":1334848368,"content":"Well so there will be total 6 scenarios...\n\n \n\nhmm... What could they be?\n\nscenario 1 unexpected party and trolls (to the Rivendel)\n\nscenario 2 Goblin town (riddles in the dark)\n\nscenario 3 When you excape trolls you meet the wolfs\n\n \n\nscenario 4 Mirkwood and Halls of Elven king\n\nscanario 5 The Smaug!\n\nscenario 6 Battle of 5 armies\n\n \n\nWell maybe not, but this is my ques :-)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619804","commentId":619804,"userName":"richsabre","timestamp":1334857904,"content":"that probably wont be far wrong\n\ni wonder how they make the the trolls different from carrock- i feel as if theyve sort of exhausted the whole 'sacked' thing with that quest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619905","commentId":619905,"userName":"Cotillion37","timestamp":1334877790,"content":"richsabre said:\n\nthat probably wont be far wrong\n\ni wonder how they make the the trolls different from carrock- i feel as if theyve sort of exhausted the whole 'sacked' thing with that quest\n\n\n\n \n\nMaybe make it so that you have to survive a certain number of turns against the trolls until the sun comes up and they turn to stone?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=619958","commentId":619958,"userName":"lleimmoen","timestamp":1334890410,"content":"Many good points above and yonder. I too wondered how the Trolls be different, the survival till sunrise makes a lot of sense, I hope there won't be a chance of killing them otherwise although that may feel strange when your party includes the likes of Boromir, Gimli or Legolas. For thematic reasons, will they advise upon not bringing the Rohan forces here? They may even enforce that but making the quests not friendly for more vulnerable characters; neither seems likely though - and everyone has a choice of making the scenarios the way they like.\n\nI also believe the Journey up to Rivendell should be quest 1. Over Hill and Under Hill quest 2, actually. And the rest until Beorn quest 3. Then the whole Mirkwood business might be part 4, Smaug 5, the Battle 6. Cannot see it done differently now but I have been wrong before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=620010","commentId":620010,"userName":"richsabre","timestamp":1334905641,"content":"ok these are the main bits of the book in my opinion. theyre basically same as hannibal\n\n-nothing of danger happens until the trollshaws- so i reckon that will be 1st\n\n-then the high pass/goblin town\n\n-out of the frying pan- wargs and eagles\n\n \n\n-mirkwood/ barrel escape (again how they gonna keep this fresh?)\n\n-sneaking into smaugs lair/attack of lake town\n\n-battle of 5 armies\n\n \n\nits hard to put the masterpiece into just 6 bits but i reckon those above will be the basis for the quests\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=620133","commentId":620133,"userName":"Budgernaut","timestamp":1334922532,"content":"Cotillion37 said:\n\nrichsabre said:\n\n \n\nthat probably wont be far wrong\n\ni wonder how they make the the trolls different from carrock- i feel as if theyve sort of exhausted the whole 'sacked' thing with that quest\n\n \n\n \n\n \n\nMaybe make it so that you have to survive a certain number of turns against the trolls until the sun comes up and they turn to stone?\n\n\n\nI imagine that some of the active locations in that scenario will allow us to use Baggins resources specifically to deal with the trolls in some way. That will make it at least a little different from Carrock. The rising sun is also a good idea. Maybe you have to accumulate so many Baggins resources on the active location in order for the sun to come up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/62978-the-hobbit-over-hill-and-under-hill/?do=findComment&comment=620268","commentId":620268,"userName":"Dwnhmcntryboy","timestamp":1334937875,"content":"RGun said:\n\nThis Hobbit saga expansion caught me by surprise - I was expecting the next deluxe expansion to be hobbit themed given the movie coming out but didn't see the whole saga thing coming.  After thinking about it I really like it.  For me, having interesting new scenarios and new game mechanics is much more interesting to me then new player cards.  Given it is a cooperative game the main way to keep it fresh is with new scenarios and new game mechanics as a fixed encounter deck can't develop new strategies to keep you interested in playing the way a human opponent can.  The challenge with a living card game is every new game mechanic you introduce makes the game more complex and then you have to take it into consideration when designing new scenarios - especially challenging in a cooperative game like this where a scenario has to play well with all sorts of combinations of player cards.  The partially self contained sagas are a way to introduce some interesting new game mechanics in a one-off and not need to worry about them staying with the game as it expands.  I think this allows the designers to introduce some more interesting mechanics and that makes for more enjoyable and challenging scenarios.\n\n\n\n \n\nI disagree to a point. So far each AP has done exactly what you said. The only over arcing change that has been introduced is Secrecy. Otherwise each AP has introduced its own self contained challenge that the designers can expand upon or leave by the way side.  Saga Edition does not give us anything really new that we have not experienced before. We have a New Hero that changes controllers like Certain objectives and collects resources like a Hero would but with Radagast's restrictions. I am not disregarding the coolness of Sagas as a whole.  Love the concept. It is just not doing anything more or less than what has been done so far by its smaller cousins."}]}