{"url":"https://community.fantasyflightgames.com/topic/63041-pathless-country/","title":"pathless country","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63041-pathless-country/?do=findComment&comment=616947","commentId":616947,"userName":"richsabre","timestamp":1334249648,"content":"i feel as if this has already been asked, but as google didnt bring anything up...\n\n \n\nwhats the deal with this one? as soon as i place at least 1 token take one off.....so if i place 5 on, 4 goes on? 7, and 6 would go on? and so on\n\nthanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63041-pathless-country/?do=findComment&comment=616978","commentId":616978,"userName":"Sprenger","timestamp":1334253720,"content":"It forces players to Travel there or else it takes twice as long to clear it out of the staging area. It is a clever trick that adds just another thing the players have to think about when deciding where to travel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63041-pathless-country/?do=findComment&comment=617008","commentId":617008,"userName":"ragnarhedin","timestamp":1334260141,"content":"Exactly.  As it's a pathless country, the Northern Tracker is useless there, he has nothing to seek out or follow.  I like it as a small extra wrinkle in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63041-pathless-country/?do=findComment&comment=617013","commentId":617013,"userName":"starhawk77","timestamp":1334263110,"content":"richsabre said:\n\nwhats the deal with this one? as soon as i place at least 1 token take one off.....so if i place 5 on, 4 goes on? 7, and 6 would go on? and so on\n\n\n\nYes and no. The forced effect triggers after progress tokens are placed, and a location is explored if it EVER has as many progress tokens as it has quest points (see p. 15 of the rules). So, say Pathless Country is the active location and has zero progress tokens on it. If you add one or two progress, the forced effect will trigger and remove one of those tokens. However, if you manage to place five progress tokens, the location will immediately be explored before the forced effect can kick in. \n\nAssuming the location starts with zero progress, then, placing four tokens will net three, placing three will net two, etc. But placing five will net five, NOT four. Anytime the fifth progress token is placed on the card, it will leave play before the forced effect triggers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63041-pathless-country/?do=findComment&comment=617152","commentId":617152,"userName":"richsabre","timestamp":1334299219,"content":"cool cheers guys- didnt realise the thematic genius of this card til now"}]}