{"url":"https://community.fantasyflightgames.com/topic/63122-unexpected-courage-question/","title":"&quot;Unexpected courage&quot; question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63122-unexpected-courage-question/?do=findComment&comment=617724","commentId":617724,"userName":"C4libr3","timestamp":1334448880,"content":" Please, i'm need a help.\n\n A hero atached with \"unexpected courage\" can't atack twice or, defend and atack, in same combat fase, because the action window open\n\nbefore a enemies atack and again only after a player resolve all atacks against his enemies. This is right? If yes a played wrong all my games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63122-unexpected-courage-question/?do=findComment&comment=617729","commentId":617729,"userName":"Angus Lee","timestamp":1334450153,"content":"Actually, the whole combat phase, except the \"Deal 1 shadow card to each enemy\" phase, are in green in the Turn Sequence chart in the rulebook (P.30 - 31), meaning that \"Any player can take actions generally, or between the game steps stated in the rules\".  So you can take player actions in between the various combat steps.  Therefore, you can use Unexpected Courage to ready a hero to, say, defend and then attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63122-unexpected-courage-question/?do=findComment&comment=617837","commentId":617837,"userName":"C4libr3","timestamp":1334480305,"content":" Thanks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63122-unexpected-courage-question/?do=findComment&comment=618256","commentId":618256,"userName":"Rashley","timestamp":1334581243,"content":"Don't forget that you can also 'attack', then 'ready', then 'attack' again as well.  However, the rules specifically state that a character cannot 'attack' the same enemy card twice in the same phase.  Yes, 'Unexpected Courage' is one of the best attachments in the game.  Shame there was only 1 in the Core Set.  You have to beg, borrow or steal extras unless you can afford a big games budget.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63122-unexpected-courage-question/?do=findComment&comment=618264","commentId":618264,"userName":"Budgernaut","timestamp":1334581890,"content":" A nit-picky clarification, but an important one: each player may attack an enemy with which he is engaged only once each round.\n\nNot only does this mean Gimli can't attack the Hill Troll twice, but two Mirkwood Runners also can't attack the Hill Troll separately in the same round, dealing 4 damage. They'd have to attack together for 1 damage or only one would attack for two damage (since they bypass defense when attacking alone)."}]}