{"url":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/","title":"&quot;Unexpected courage&quot; question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=617723","commentId":617723,"userName":"C4libr3","timestamp":1334448875,"content":" Please, i'm need a help.\n\n A hero atached with \"unexpected courage\" can't atack twice or, defend and atack, in same combat fase, because the action window open\n\nbefore a enemies atack and again only after a player resolve all atacks against his enemies. This is right? If yes a played wrong all my games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=618917","commentId":618917,"userName":"guest479094","timestamp":1334692756,"content":"There is an action window after *each step* of each combat resolution. So you can defend or attack with a character, then after it is resolved, use Unexpected Courage to ready the character and defend or attack later in the same combat phase.\n\nFor that matter, you could exhaust a character to defend/attack and, since doing so constitutes a seperate step in defense/attacking you could immediately ready them. They would still be committed to whatever attack of defense they are currently part of - readying them does not change this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=620593","commentId":620593,"userName":"Schmiegel","timestamp":1335048890,"content":" I'm certainly no expert, but that's not the way I've been playing it. Referencing page 31 of the rules manual, I see an action window after dealing 1 shadow card to each enemy and then no further action windows until the very final step of the combat phase. Those action windows are marked clearly. In the rules manual that I have, there are no other action windows indicated between the defending and attacking steps of combat...\n\nSo I'm confused as to why you think there are action windows between each step of a combat resolution. Was that in a FAQ or answered by the game designer somewhere other than in the main rules manual? If not, I don't see how you are drawing your conclusion in this way...\n\nI would like to be wrong. For example, a card such as \"Blade Mastery\" seems devalued if there are no action steps between every step of combat resolution. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=620603","commentId":620603,"userName":"Chris51261","timestamp":1335055591,"content":" I'm looking for the ruling on where it says in between every opponent attacking there is an action window, and I'll let you guys know if I come across it. I am however 90% sure that there is. Certain cards wouldn't make a lot of sense if there weren't (Boromir, Unexpected Courage)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=620605","commentId":620605,"userName":"Chris51261","timestamp":1335055885,"content":"Found it. Page 20 of the rulebook.\n\n\"To resolve an attack against an enemy, a player follows these 3 steps, in order. Players may play event cards and take actions at the end of each step.\n\n1. Declare target of attack, and declare attackers.\n2. Determine attack strength.\n3. Determine combat damage.\"\n\nThese are the steps for a single enemy. So you resolve your attack on the first enemy, declaring the target, declaring and exhausting your attackers, determine your combat damage and deal it, and then you can use an action, like on Unexpected Courage, at the end of that step before you start on the next enemy to ready that hero. This allow that same hero to defend or attack or whatever twice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=620610","commentId":620610,"userName":"Schmiegel","timestamp":1335058833,"content":" That certainly works for me. Thank you, Chris. I was confused by the presentation of the action windows on the chart on page 31, in the combat phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=620733","commentId":620733,"userName":"Chris51261","timestamp":1335092558,"content":" I read somewhere here on the forums that the chart on page 31 is a good guidelines, but it is missing a few small steps. Anyway, enjoy playing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=620850","commentId":620850,"userName":"Angus Lee","timestamp":1335127841,"content":"On page 30 the action boxes in the chart are represented by red boxes and green boxes.  There are legends to the meaning of the color: no actions are allowed (but responses may be played when situation is applicable) in the red boxes, but player actions can generally be taken in the green boxes; the defense and attack parts in the combat phases are in green, so actions can be taken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63121-unexpected-courage-question/?do=findComment&comment=623321","commentId":623321,"userName":"dougtempel","timestamp":1335636794,"content":"Chris51261 said:\n\n \n\nFound it. Page 20 of the rulebook.\n\n\"To resolve an attack against an enemy, a player follows these 3 steps, in order. Players may play event cards and take actions at the end of each step.\n\n1. Declare target of attack, and declare attackers.\n2. Determine attack strength.\n3. Determine combat damage.\"\n\nThese are the steps for a single enemy. So you resolve your attack on the first enemy, declaring the target, declaring and exhausting your attackers, determine your combat damage and deal it, and then you can use an action, like on Unexpected Courage, at the end of that step before you start on the next enemy to ready that hero. This allow that same hero to defend or attack or whatever twice.\n\n \n\n \n\nAlso on on p. 18 of the rulebook: \"When resolving enemy attacks, the players follow these 4 steps, in order. Players may play event cards and take actions at the end of each step.\"\n\nThe steps are 1) Choose an enemy.  2) Declare defender.  3) Resolve shadow effect.  4) Determine combat damage.\n\nThe chart on p. 31 omits some of the details during the combat phase."}]}