{"url":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/","title":"Pippin, Merry and Sam","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=617920","commentId":617920,"userName":"peterstepon","timestamp":1334499993,"content":"Gents,\n\nI was wondering when we were going to see Pippin, Merry, and Sam as heroes in the game (unless they have been released and I just missed it).  I figure that these three guys are probably the most iconic characters in the movies and we have not seen a peep regarding them. I myself would be interested in having an all hobbit deck backed by hobbit themed allies and tricks to take down the dark lord.\n\n \n\nAny ideas when or if we are going to see these three guys. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=617931","commentId":617931,"userName":"richsabre","timestamp":1334502283,"content":"simple answer is they havnt been released yet and no one really knows.....could be anytime"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=617960","commentId":617960,"userName":"Mattr0polis","timestamp":1334508377,"content":"Well, my first impression after the preview of the new Hobbit Saga Expansion would be to say that maybe they would save them for if they do a 'Saga Expansion' for the Lord of the Rings books and the actual quests the Fellowship went on.\n\nBut then again, we already had a Bilbo before The Hobbit expansion, so maybe we'll see them at some point before then as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=617961","commentId":617961,"userName":"richsabre","timestamp":1334508918,"content":"well we had two main hobbits in mirkwood cycle, so maybe 2 of the remaining 4 packs of dwarrowdelf will hold two of them?\n\nheros are sometimes randomly put out with this game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=617973","commentId":617973,"userName":"peterstepon","timestamp":1334511493,"content":"Mattr0polis said:\n\nWell, my first impression after the preview of the new Hobbit Saga Expansion would be to say that maybe they would save them for if they do a 'Saga Expansion' for the Lord of the Rings books and the actual quests the Fellowship went on.\n\nBut then again, we already had a Bilbo before The Hobbit expansion, so maybe we'll see them at some point before then as well.\n\n\n\nI got the impression the Hobbit Saga Expansion would be when Bilbo was younger.  I reckon that Frodo, Sam, Pippin, and Merry were really little at that time or were not even born.  Still, I got the impression that Frodo was about 40 when Fellowship of the Rings came out which is probably Hobbit for 19"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=617989","commentId":617989,"userName":"richsabre","timestamp":1334516509,"content":"despite the films showing otherwise- there was a big age gap between frodo and merry/pippin, the latter were just adults so no they were not born at the time of the hobbit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=618198","commentId":618198,"userName":"Scoob4","timestamp":1334571905,"content":"richsabre said:\n\ndespite the films showing otherwise- there was a big age gap between frodo and merry/pippin, the latter were just adults so no they were not born at the time of the hobbit\n\n\n\nI hesitate to step in here, Rich, because you clearly know so much about Tolkien's world, but I think the way you chose to phrase this is a bit misleading. Recall that Frodo is only celebrating coming of age (33 for Hobbits) at the 111th birthday party of Bilbo, and that Bilbo was 50 when the Hobbit started. Merry and Pippin are described as in their tweens (twenties), so at most there's a 13 year age difference between Frodo and Merry/Pippin. There's a bigger gap between the events of The Hobbit and Frodo's birth (by a 3 to 1 margin) than between Frodo's birth and the birth of Merry/Pippin. So it's not just the latter two that were not born at the time of The Hobbit, but all 4 (including Sam) of the Hobbits that were in the Fellowship."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63144-pippin-merry-and-sam/?do=findComment&comment=618203","commentId":618203,"userName":"richsabre","timestamp":1334572577,"content":"yes i agree that probably was a bit misleading the way i worded it....i was stating the age gap was large relative to what the films portrayed, as i think Wood, Astin,Boyd and the other guy that escapes me, were all around the same age......and also relative to how old frodo was, ie if he were 70 and they were 13yrs as you say younger - then the difference isnt noticable, however with them just maturing then i think the age gap is important, epsecially in the leadership the sought from frodo, being an elder\n\n and yes it goes without saying that none of them were around during the hobbit events"}]}