{"url":"https://community.fantasyflightgames.com/topic/63146-quick-strike/","title":"Quick Strike","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63146-quick-strike/?do=findComment&comment=617953","commentId":617953,"userName":"silverhand77","timestamp":1334507360,"content":"Hey everyone,\n\n \n\nI was playing a two player game last night and a situation came up that I wasn't sure about. so I thought I'd post it and see what others thought.\n\nHere is what happened:\n\n \n\nMy friend was being attacked by an enemy and it would have been fine if not for the shadow card, the shadow card increased the enemy's attack strength enough to kill my friend's hero. I was playing a tactics/spirit deck and I had quick strike in play and an available tactics resource. I wanted to play it on my Gimli who was strong enough to kill the enemy before damage would have been dealt. Gimli didn't not have ranged. So after some discussion we decided that I can't play quick strike becuase the target was inelligible due to the fact that Gimli wasn't ranged.\n\nI'm still not convinced we played this right - it just seems that quick strike is fairly weak if we did. I'd love to hear what you all have to say about it. and also what the common conception of an eligible enemy is.\n\n \n\nCheers :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63146-quick-strike/?do=findComment&comment=617965","commentId":617965,"userName":"GrandSpleen","timestamp":1334510133,"content":"Sounds like you played it right -- \"eligible enemy\" means any enemy that you would normally be able to declare an attack against if you were attacking at the usual time.  Gimli doesn't have ranged, so enemies that are engaged with another player are not eligible for his attack.\n\nActually, I'm curious about the use of Quick Strike to cancel damage after a shadow effect has been resolved.  Is that legal?  My gut says no.  Normal steps go like this:\n\n1) Decide which enemy is going to attack.\n\n2) Declare defender\n\n3) Reveal shadow card and resolve effect.\n\n4) Apply damage\n\n \n\nYou're using Quick Strike after step 3, before step 4.  That's certainly valid and the enemy would now be killed.  But the attack has already been dealt, and killing the enemy would not negate step (4): apply damage, would it?  You'd have to use quick strike before step (1) in order to avoid the attack.  In other words, killing the enemy at that point does not \"undo\" steps (1) through (3).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63146-quick-strike/?do=findComment&comment=617966","commentId":617966,"userName":"starhawk77","timestamp":1334510234,"content":"You played that situation correctly. The Quick Strike attack must be declared against an \"eligible\" target. Enemies engaged with other players are not \"eligible\" targets for your characters unless those characters possess the ranged keyword. So, unfortunately, Gimli wouldn't be able to save your partner. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63146-quick-strike/?do=findComment&comment=617972","commentId":617972,"userName":"starhawk77","timestamp":1334511482,"content":"GrandSpleen said:\n\nYou're using Quick Strike after step 3, before step 4.  That's certainly valid and the enemy would now be killed.  But the attack has already been dealt, and killing the enemy would not negate step (4): apply damage, would it?  \n\n \n\nSure it would. In step 4, determining combat damage is done by subtracting the defense strength of the defending character from the attack strength of the attacking enemy (p. 18 of the rules). If there is no attacking enemy, there is no attack strength to consider. As another example, consider Ranger of Osgiliath's shadow effect (\"Deal 2 damage to attacking enemy.\"). If the attacking enemy is killed off by that shadow effect, it won't do any damage to the defender.\n\nBasically, if an attacking character/enemy leaves play before damage is actually calculated during the last part of an attack step, it won't contribute its attack strength. Nate clarified this with respect to player attacks (javascript:void(0);/*1334529431228*/ [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications-updated-27012012/])."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63146-quick-strike/?do=findComment&comment=617997","commentId":617997,"userName":"GrandSpleen","timestamp":1334518666,"content":"Great, I like it when things make sense. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Now, if only pulling a defending character out play counted as a \"dodge\" instead of an \"axe swings wide and sticks Aragorn in the head!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/63146-quick-strike/?do=findComment&comment=618080","commentId":618080,"userName":"silverhand77","timestamp":1334547479,"content":"Thanks for your answers guys,\n\n \n\nso just to clarify, If, for example, Dunedain Cache had previously been played on Gimli thereby giving him ranged, I would  have been able to attack and kill the enemy before damage resolved?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63146-quick-strike/?do=findComment&comment=618085","commentId":618085,"userName":"starhawk77","timestamp":1334548913,"content":"silverhand77 said:\n\nThanks for your answers guys,\n\n \n\nso just to clarify, If, for example, Dunedain Cache had previously been played on Gimli thereby giving him ranged, I would  have been able to attack and kill the enemy before damage resolved?\n\n\n\nYep. The enemy engaged with your partner would then be a legal target for Gimli to attack."}]}