{"url":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/","title":"Branching Paths + Cavern Torch","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/?do=findComment&comment=618064","commentId":618064,"userName":"leptokurt","timestamp":1334543340,"content":"Two questions. This is what happened:\n\n1)I had Branching Paths in the staging area, and only card from the encounter card was left. I knew it was Zigil Mineshaft, so I uesed Cavern Torch to explore Branching Paths. I did that during the combat phase. Now the emocunter deck was empty, but according to Branching Path's card text I had to replace it with the top card of the encounter deck. Did I play it right when I placed no new card as there was no  card available?\n\n2) What happens if the encounter deck is empty and you want to use Cavern Torch? Is it possible, or do you have to wait until the encounter deck is reshuffled? I played it like I was not able to use Cavern Torch in that situation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/?do=findComment&comment=618072","commentId":618072,"userName":"starhawk77","timestamp":1334545954,"content":"leptokurt said:\n\n \n\nTwo questions. This is what happened:\n\n1)I had Branching Paths in the staging area, and only card from the encounter card was left. I knew it was Zigil Mineshaft, so I uesed Cavern Torch to explore Branching Paths. I did that during the combat phase. Now the emocunter deck was empty, but according to Branching Path's card text I had to replace it with the top card of the encounter deck. Did I play it right when I placed no new card as there was no  card available?\n\n2) What happens if the encounter deck is empty and you want to use Cavern Torch? Is it possible, or do you have to wait until the encounter deck is reshuffled? I played it like I was not able to use Cavern Torch in that situation.\n\n \n\n \n\n1. Sounds right. The encounter deck is only restocked during the quest phase. If there's no top card of the encounter deck, you can't replace Branching Paths.\n\n2. Here I disagree with your interpretation. Discarding the encounter card is a result of the Cave Torch's effect, not a prerequisite. In other words, you do not discard the top card TO exhaust Cave Torch; you exhaust the Cave Torch, and then the forced effect applies. In order for the effect to kick in, then, you must have already chosen to activate the Cave Torch. There's no way the discard clause could be a limiting restriction. So, it seems to me that you can still use the Torch even if the encounter deck is empty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/?do=findComment&comment=618074","commentId":618074,"userName":"Rashley","timestamp":1334546306,"content":"I would say that in all cases except Shadow Cards (specifically mentioned in the rules) you reshuffle the encounter discards to form a new deck as soon as you have to play/replace/look at etc., the next encounter card.  This seems the obvious and simplest solution and should cover all situations except when covered by specific rules or card effects that state something to the contrary.  Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/?do=findComment&comment=618097","commentId":618097,"userName":"Glaurung","timestamp":1334551246,"content":"As i say before in my topic the rules reshuffle encounter deck only in quest phase quite stupid cose now we have so many questions about different situations.\n\nIf rules was: reshuffle encounter discard pile into encounter deck when encounter deck is empty in any phase.So simple no problem no question.\n\nThis Nate French really sometimes too complicated for nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/?do=findComment&comment=618197","commentId":618197,"userName":"radiskull","timestamp":1334571833,"content":" You only reshuffle the encounter deck when it is empty during the Quest Phase. There aren't piles of exceptions here making life more complicated - if you're instructed to reveal a card from the encounter deck and there isn't one, and it isn't the quest phase, then you don't have to.\n\nIt doesn't matter if you think the rule is stupid; that's the rule.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/?do=findComment&comment=618305","commentId":618305,"userName":"leptokurt","timestamp":1334586921,"content":"I too think the rule is somehwat stupid. I bet most of the players who are not visiting game forums like this are not aware that it even exists. Thanks anyway for answering this one!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63155-branching-paths-cavern-torch/?do=findComment&comment=618936","commentId":618936,"userName":"gatharion","timestamp":1334697186,"content":"I don't think it's a \"stupid\" rule, but it's not a very intuitive one. I never realized it until it was pointed out in another thread."}]}