{"url":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/","title":"Question about using card effects...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/?do=findComment&comment=619423","commentId":619423,"userName":"imweezle","timestamp":1334774827,"content":"Hello everyone,\n\n \n\nFirst off, let me say that I am very new to the game, and have played about 4 - 5 games all in all. Each time I play though, the same question keeps coming up, and I thought here would be a good place to ask it.\n\n \n\nRegarding the effects of a card, how many times can you use the effect?\n\n \n\nLet me explain: The Aragorn hero card states that after you commit him to a quest, you may pay one resource token to ready him. I like this effect a lot. However, is this an effect you can activate only once per game, or once per turn. Sticking with the same deck, Theodred's card says that when he commits to a quest, you may grant one character an additional resource token. Is this an effec that can be triggered once per turn, or only once per game?\n\n \n\nLast example, Glorfindel from the green deck states that he can pay resource tokens to heal another hero. Is this an effect that can be used one per turn, or per game.\n\n \n\nAll in all, I'd like to know if there is a surefire way to know whether an effect can be triggered multiple times, or only once. My question also applies to any Encounter deck effects as well.\n\n \n\nThanks for the help!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/?do=findComment&comment=619437","commentId":619437,"userName":"richsabre","timestamp":1334776055,"content":"actions depend on what type they are\n\naction: can be used as long as the text after action can be carried out - ie protector of lorien- discard a card to gain +1 willpower or +1 defense- so as long as you have a card to discard you can keep doing this (in the appropriate action window of course)\n\nresponse action: can only be done in response to the text- to use your example, everytime after aragorn commits to a quest you can spend a resource to ready...this can be done everytime he commits- however given that a character can only commit to a quest once per round this is effectively a once per round action, however say if the action was 'after X is declared as defender spend a resource to ready' then this could be done more than once per turn\n\nLimited actions: can only be done in the limited amount stated- ie the new aragorn card is a once per game action, frodos action is once per turn- glorfindel says limit oncer per turn- so therefore you can only do this once per turn AND if you have the resource\n\n \n\nencounter deck effects work completely differently however, and are usually dependant on what the card text says- usually it will state the WHAT and the WHO- ie deal 1 damage to a questing character- this means you deal 1 damage to a character who is commited a quest- then the card is fullfilled and discarded"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/?do=findComment&comment=619439","commentId":619439,"userName":"Cotillion37","timestamp":1334776163,"content":"Those effects are once per turn. From my understanding, the effects that can only be used once per game actually have \"This effect may only be used once per game\" written on the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/?do=findComment&comment=619533","commentId":619533,"userName":"muemakan","timestamp":1334800688,"content":" Frodo has a \"once per phase\" ability. Which is quite unusual and I don´t think there is any other card with a once per phase ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/?do=findComment&comment=619589","commentId":619589,"userName":"DurinIII","timestamp":1334817029,"content":"Hmmmm; where on Frodo's card is he limited to once per phase?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/?do=findComment&comment=619597","commentId":619597,"userName":"Dam the Man","timestamp":1334817962,"content":"DurinIII said:\n\nHmmmm; where on Frodo's card is he limited to once per phase?  \n\n\n\nlotrlcg.com/cardFocus.php [http://lotrlcg.com/cardFocus.php?Title=Frodo%20Baggins]\n\nRight there in the text?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63309-question-about-using-card-effects/?do=findComment&comment=619640","commentId":619640,"userName":"Mighty Jim 83","timestamp":1334828919,"content":" to look at the specific examples the OP gave - Glorfindels card says on it \"Once per round.\"\n\nAragorn and Theodred are both once per round, due to timing - you commit characters to the quest, then take actions, so you could do this every turn (if you have both heroes, they effectively both quest, and Aragorn can ready for free) but you can't 2re-commit Aragorn in order to count his willpower a second time, as that would break the laws of time..."}]}