{"url":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/","title":"Community Forum and Customer Support Reminder","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/?do=findComment&comment=619820","commentId":619820,"userName":"SiCK_Boy","timestamp":1334862264,"content":"When I came to FFG's website today, I was welcomed with this message\n\nCommunity Forum and Customer Support Reminder\nWelcome to the Fantasy Flight Games website.\n\nWe would like to remind you that the Fantasy Flight Games community forums have been created as a meeting point for fans of the games we publish, a place where they can exchange ideas and opinions about these games and meet other people that share the same hobby. It is not intended to be a way to contact FFG directly, nor to ask for rules clarification or support.\n\nPlease visit the FFG Customer Service page to send us all your rules questions or contact customer support. To prevent useful rules clarifications from being buried in a forum thread, we will post our responses to frequently asked questions on the Support page for each game.\n\nThank you, and pleasant posting!\n \n\nI then had to check a box saying \"I accept\".\n\nWas I specificaly targeted by this message because I posted in this sub-forum?\n\nIs it a generic message you get once in a while?\n\nWhy did they create a Rules sub-forum where no official answer is ever provided if users are not supposed to ask and/or reply to rules question in the first place? (such a sub-forum exists also for the other LCGs)\n\nThey say \"we will post our responses to frequently asked questions on the Support page for each game\"... am I supposed to understand that updating a FAQ once every 6 months is their way of providing rules clarification?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/?do=findComment&comment=619842","commentId":619842,"userName":"Angus Lee","timestamp":1334866895,"content":"I also got this message, so you're definitely not alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/?do=findComment&comment=619870","commentId":619870,"userName":"radiskull","timestamp":1334870651,"content":" I'm pretty sure all forum users got this message.  I'm not sure what prompted it.  But I'm sure the \"OMG FFG DIDN'T RESPOND TO MY FORUM POST\" drama that I've seen in several of the game forums over the past few months didn't help (looking at you, Descent and Battlelore)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/?do=findComment&comment=619871","commentId":619871,"userName":"starhawk77","timestamp":1334870838,"content":"Yep, I think it was just a general reminder for the entire message board community. No idea what prompted it, though. Perhaps someone on one of the other game pages decided to unleash a vitriolic rant against FFG. Who knows?\n\nAt any rate, I'm sure there's no reason for any member of the LotR group to be concerned. We're usually pretty civil around here happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/?do=findComment&comment=619904","commentId":619904,"userName":"Cotillion37","timestamp":1334877538,"content":"starhawk77 said:\n\nYep, I think it was just a general reminder for the entire message board community. No idea what prompted it, though. Perhaps someone on one of the other game pages decided to unleash a vitriolic rant against FFG. Who knows?\n\nAt any rate, I'm sure there's no reason for any member of the LotR group to be concerned. We're usually pretty civil around here happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n\n\nYour mother dresses you funny and you can't read good. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nJust kidding."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/?do=findComment&comment=619975","commentId":619975,"userName":"starhawk77","timestamp":1334894871,"content":"Cotillion37 said:\n\nYour mother dresses you funny and you can't read good. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\n \n\nFor your information, all of my friends think my propeller beanie is the bomb gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63349-community-forum-and-customer-support-reminder/?do=findComment&comment=620324","commentId":620324,"userName":"silverhand77","timestamp":1334951291,"content":"I too had the same message pop up.\n\nNow I'm sure you all agree that at least with our game, there are and have been a number of differing opinions on the way the rules are to be interpreted. Personally, I'm grateful that we can contact Nate and his team to get clarification but I think we do need to be able to get each other's insights as well. Some of the questions can be easily answered purely because someone else knows where to find the answers in the rules & FAQ. But furthermore, I believe it allows FFG to become aware of any confusion that might arise and therefore gives them the opportunity not only to explain the ruling but learn what sort of wordings to use on future cards etc to avoid future confusion."}]}