{"url":"https://community.fantasyflightgames.com/topic/63410-first-player-elimination/","title":"First player elimination","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63410-first-player-elimination/?do=findComment&comment=620363","commentId":620363,"userName":"GrandSpleen","timestamp":1334963324,"content":"Hi all,\n\nIf the first player is eliminated, does the first player token ransfer to the next player with it, or is there effectively no \"first player\" until the next round?  I am wondering whether any cards targeting the first player would have no effect (like the 'when revealed' effect on Dol Guldur orcs) if the first player has just been eliminated prior to revealing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63410-first-player-elimination/?do=findComment&comment=620458","commentId":620458,"userName":"radiskull","timestamp":1335002968,"content":" That's a good question.  My guess would be that there would temporarily be no first player, but that is a pure guess.  We don't really have any rules help for that one.\n\nI'd send it to Nate and see what he says."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63410-first-player-elimination/?do=findComment&comment=622364","commentId":622364,"userName":"GrandSpleen","timestamp":1335462784,"content":"I sent this question to support but I haven't heard anything back yet.  It's only been 4 business days, but I'm curious -- can one typically expect a reply?  What's the turn-around on them?\n\nI sent my question using the support page here: http://www.fantasyflightgames.com/edge_faq.asp [http://www.fantasyflightgames.com/edge_faq.asp] . . . I realize that Nate is the lead designer, but is that what is typically meant by 'ask Nate?'  Or are people actually PM'ing messages to the guy?  And if so how'd you get his account name :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIn the meantime, since the rules are silent on this point, I will continue to play as if the first player token passes only during the refresh phase.  That seems to be the more rules-conservative way of doing things, rather than venturing that the token ought to move to the next player in line.\n\nSo, if the first player is eliminated during a turn, he/she is still considered the first player but simply cannot take any action on account of all of their cards having been removed from the game.  Luckily, this is not a scenario that comes up too often for us!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63410-first-player-elimination/?do=findComment&comment=622484","commentId":622484,"userName":"radiskull","timestamp":1335481539,"content":" Yeah, that's the link we mean.  We say \"ask Nate\" because he's usually the one to reply.  Turnaround time can be between 0 and 5 days, and some questions do not get an answer at all.  (This is because perhaps the design team is discussing what the answer *should* be, so they can include it in an upcoming FAQ, and do not wish to email people information that may be changed in a month or two.)\n\nI think your ruling is reasonable, and I could just as easily see it going the other way.  I suppose we shall find out!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63410-first-player-elimination/?do=findComment&comment=622945","commentId":622945,"userName":"Budgernaut","timestamp":1335550711,"content":" Yeah, my question about Ancient Mathom on one of the Emyn Muil unique locations never got answered. I just imagined that Nate and the design team were laughing at me for asking such a stupid question. But then, the FAQ seems to reiterate some points that were quite straightforward, so maybe it will get FAQ'ed, even if it isn't technically a \"frequently\" asked question."}]}