{"url":"https://community.fantasyflightgames.com/topic/63450-healing-how-does-it-resolve/","title":"Healing: how does it resolve?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63450-healing-how-does-it-resolve/?do=findComment&comment=620658","commentId":620658,"userName":"shadowleaper","timestamp":1335072714,"content":"If I take huge damage beyond a hero's HP and I play Lore of Imladris to heal it all, does this work and heal the hero to full HP?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63450-healing-how-does-it-resolve/?do=findComment&comment=620671","commentId":620671,"userName":"starhawk77","timestamp":1335076155,"content":"No. Action cards like Lore of Imladris can only be played during designated action windows (see the timing chart at the end of the rules). Characters are destroyed immediately whenever they take damage equal to their health, without any opportunity for players to play actions; you would need some kind of response effect to cancel damage (e.g. Frodo Baggins' ability). \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63450-healing-how-does-it-resolve/?do=findComment&comment=620692","commentId":620692,"userName":"shadowleaper","timestamp":1335084085,"content":"In the rulebook the entire combat phase allows for actions to be played at anytime.\n\nI'm assuming what you mean is that damage cannot be responded to at the same time it's dealt?  Or rather characters are removed FIRST if they receive a fatal dose of damage tokens?\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63450-healing-how-does-it-resolve/?do=findComment&comment=620761","commentId":620761,"userName":"radiskull","timestamp":1335098729,"content":" That's correct.  The only thing that can \"go back in time\" and prevent something from happening are those Response effects that use the word \"cancel\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63450-healing-how-does-it-resolve/?do=findComment&comment=620854","commentId":620854,"userName":"Angus Lee","timestamp":1335128666,"content":"radiskull said:\n\n That's correct.  The only thing that can \"go back in time\" and prevent something from happening are those Response effects that use the word \"cancel\".\n\n\n\nRadiskull's wording is a lot clearer than those in the rulebook, and it definitely should be placed in the FAQ!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63450-healing-how-does-it-resolve/?do=findComment&comment=623315","commentId":623315,"userName":"dougtempel","timestamp":1335635811,"content":"shadowleaper said:\n\n \n\nIn the rulebook the entire combat phase allows for actions to be played at anytime.\n\n \n\n \n\nI can understand your confusion from the chart on p. 31, but this is not true.  I recently had this cleared up for me on the BGG forums.\n\nOn p. 18 of the rulebook: \"When resolving enemy attacks, the players follow these 4 steps, in order. Players may play event cards and take actions at the end of each step.\"\n\nOn p. 20 of the rulebook: \"To resolve an attack against an enemy, a player follows these 3 steps, in order. Players may play event cards and take actions at the end of each step.\"  Thus, you can generally take actions during the combat phase, but only during the action windows at the end of each step (or sub-step, as the case may be) during the phase.\n\nFurther down on p. 18 is a direct answer to your original question: \"The remaining value is the amount of damage that must immediately be dealt to the defending character, possibly destroying that character.\"  The only thing that will prevent the loss of your hero is a Response card effect on a card that's already in play."}]}