{"url":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/","title":"20 Heroes In (Lore)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=620922","commentId":620922,"userName":"lleimmoen","timestamp":1335148208,"content":"Bilbo\n\nThe main Hobbit protagonist is portrayed in an interesting fashion in the game, perhaps as an older and less active individual compared to his days of the Journey with Thorin & Co. His ability is very passive, so his perhaps most significant part is played whilst doing nothing, simply by drawing an extra card (for the first player) each round. This ability is undoubtedly strong, though perhaps more pronounced in solo play.\n\nIt is certainly not easy to find a proper role for Bilbo Baggins to play otherwise. Both his questing and attacking prowess are minimal. His defence is better but two hit points make his blocking risky. The game allows for many ways to remedy this, however. One obvious card for making Bilbo a better defender is A Burning Brand, this Lore sphere attachment cancelling all shadow effects coming toward the attached hero is a safe bet for Bilbo. Still, it only works against weaker enemies unless Bilbo’s defence is further enhanced. Protector of Lórien makes things much brighter; it can make Bilbo a constant quality defender and a questing one-hit-wonder, usually when closing out the game. This combo is interesting in that aspect that it goes both ways, Bilbo is good in pulling cards which are then used for the attachment to make him more useful.\n\nStill, quite unlike in his adventures where he was able to fight great forest spiders, free his friends from captivity, stand a test of wits and will with the Dragon himself, or seal a deal to prevent a conflict between free peoples, Bilbo is not an obvious answer to many problems the game imposes on the players. His threat is a lot higher than his stats would sum up, which may cause problems early in the game before Bilbo is ready for trouble. So it is important to choose the right combination of companions. Denethor can help a big deal, predicting the outcome of the encounter deck so that Bilbo can be helpful in just the right way. This further advises for a solo game experience with the Hobbit.\n\nBifur\n\nCompared to Bilbo, one of his less famed companions from their great quest has 1 point greater willpower, 1 more hit point and 2 less threat cost. Statistically, Bifur is much more efficient than Bilbo. His ability is also very passive, completely dependent on other heroes to function. It is less potent in solo play. Still it can be used to good effect in multi-sphere deck: Gildor Inglorion, for instance, one of the (if not the) strongest allies in the game, can be often played a round earlier than normally, resulting in usually decisive shift of chance.\n\nBifur is great in questing, again all the more powerful with Dáin in play. 3-willpower for 7-threat cost is a great ratio. And with new ways of getting Dwarves ready (Lure of Moria, Erebor Record-keeper) Bifur can still become a valuable defender later in that same round.\n\nBeravor\n\nThis Dúnedain Ranger is so far the most significant supply of cards. The ability to draw 2 cards per round will not only give players greater range to operate with but can also feed strategies based on Protector of Lórien. To make things better still (and thus complicate them a little) Beravor is also an all around skilled hero, good in questing, attack or defence, all that whilst not being fragile. Combined with her ability, Beravor often finds more use in combat rather than questing: she can fight when necessary or be left to use her ability if not.\n\nDue to her many a skill, the most valuable attachment for Beravor is Unexpected Courage. Making pretty much every hero stronger (despite it usually being a waste for heroes such as Éowyn or Bilbo), encouraged Beravor can easily become a force hard to be stopped. And even threat her cost is only slightly on the expensive side.\n\nDenethor\n\nPerhaps the most tragic Steward of Gondor is an example of a hero that is much more efficient in solo play. To predict the outcome of the staging with deadly efficiency will largely ease the decision-making which is otherwise puzzling players when committing characters to the quest is due. But it is generally better to save Denethor’s ability for after questing. That way he will be ready to save the day in combat where he is one of the best defenders in the game. The same hesitant strategy applies to the Elven ally that cooperates so well with the Gondorian ruler, the very versatile and cheap in cost, Henamarth Riversong.\n\nThe usual suspects are A Burning Brand for defence, as with Bilbo, but unlike Bilbo Denethor’s base defence is good enough for a majority of enemies, plus he has got one extra hit point cushion compared to the old Hobbit. And as with Beravor, Unexpected Courage will make Denethor a super force. While Beravor can find some rivals among the company (especially in a multiplayer mode) for the precious attachment – Dúnhere, Legolas, Brand, Aragorn (especially the upcoming Strider version) can all be good candidates – with a smaller party Denethor should be the one encouraged so he can use his ability more than once (if required) or hand his sword in combat.\n\nFor so much of his prowess, Denethor is also a very threat-cheap hero. And thus the only shortcomings of this interesting character can be found in multiplayer games where the prediction becomes much less accurate with every player.\n\nGlorfindel\n\nIt is with this great Elf that the conclusion of the series lies. May that be a pardon for a slightly different entry. Games based on books have more than one difficulty. They have to both function as a game and portray their inspiration in a satisfactory manner. It is no easy matter with Tolkien characters, some of which were simply exceptionally powerful. One of those is Glorfindel, an ancient Noldo who gave his life in defeating a Balrog and saving (among others) Eärendil Elrond’s father who was in turn responsible for the downfall of Morgoth to whom Sauron was a lieutenant. Two ages later, returning to Middle-earth from the Halls of Mandos, Glorfindel played again a major role in the fate of Middle-earth when he (among other things) saved Frodo and his companions from the Black Riders on their flight to Rivendell, being able on more than one occasion to drive off several of the Nazgûl Sauron’s deadliest servants.\n\nSo it is not hard to see the difficulty in designing such a mighty character. The game has its tool for such complication though, the greater the sum of the stats is the greater the threat cost (with some noted exceptions). Among the known heroes, Glorfindel has the second greatest willpower, shared greatest attack (among five others), as he has the most hit points (together with four others). Yet, unlike Boromir, Aragorn or Imrahil, he is naturally unable to use more of his stats in one round. He can at least use his ability (spend one resource to heal one damage on any character) simultaneously with questing or fighting but the ability is (shockingly, given the source material) surely among the weakest in the game. Healing was more prominent aspect in early stages of the existence of the game (and is still in some strategies or quests – for which Glorfindel’s ability is still very feeble) but is now slowly becoming obsolete whilst the importance of cancelling encounter and shadow effects steeply rises. That said, the card is certainly not useless, despite the high threat, Glorfindel’s questing shall be helpful especially in the beginning of the game and the occasional healing might still save a character from dying.\n\nStill, as for a just representation of this major character from the beloved story, one can only hope (and it shouldn’t be a fool’s hope) that Glorfindel will find a new way into the game, as his character has into the great mind of the Professor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=620955","commentId":620955,"userName":"Robert McMutton","timestamp":1335158351,"content":"Great work, man. You did it. A sensational reviews series of the heros of the game. I can't help but agree with you in most you have said of this Lore heros. Lately I had used Lore in my decks after a while without it, so both Bilbo and Glorfindel are quite well known pal to me. And Bifur and Beravor were also used in my decks although not lately. But Denethor seems to be somehow forgotten in my decks. I tend to use Hennamarth Riversong to peek at the encounter deck. Anyway I should give him another try afterwards. \n\nThank you for all this insight, pal. Greetings happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=620957","commentId":620957,"userName":"lleimmoen","timestamp":1335158773,"content":"Thank you for reading and kind words, Robert.\n\nEnjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=620960","commentId":620960,"userName":"leptokurt","timestamp":1335160478,"content":"Good work again!\n\n \n\nPerhaps it should be noted that Glorfindel can be very useful in combination with Éowyn  to build a so called \"rabbit deck\". Both have a combined WP of 7 which enables a fellowship to hurry through some scenarios, thus reducing both the numer of rounds played and the possibilty of meeting deadly encounters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=620973","commentId":620973,"userName":"Robert McMutton","timestamp":1335162540,"content":"leptokurt said:\n\nGood work again!\n\n \n\nPerhaps it should be noted that Glorfindel can be very useful in combination with Éowyn  to build a so called \"rabbit deck\". Both have a combined WP of 7 which enables a fellowship to hurry through some scenarios, thus reducing both the numer of rounds played and the possibilty of meeting deadly encounters.\n\n\n\nI have been using it lately. Eowyn, Frodo Baggins and Glorfindel, and yes, rushing throught the quests at full speed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=620990","commentId":620990,"userName":"Ninjawa2","timestamp":1335164873,"content":"Robert McMutton said:\n\nleptokurt said:\n\n \n\nGood work again!\n\n \n\nPerhaps it should be noted that Glorfindel can be very useful in combination with Éowyn  to build a so called \"rabbit deck\". Both have a combined WP of 7 which enables a fellowship to hurry through some scenarios, thus reducing both the numer of rounds played and the possibilty of meeting deadly encounters.\n\n \n\n \n\nI have been using it lately. Eowyn, Frodo Baggins and Glorfindel, and yes, rushing throught the quests at full speed.\n\n\n\nEowyn, Frodo and Glorfindel is my current favourite trio.  Hold Glorfindel back if there are any big enemies otherwise do some huge questing and his ability I actually find very useful for taking care of any chip damage the other 2 pick up (very good for Frodo dealing with the snow wargs)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=620994","commentId":620994,"userName":"lleimmoen","timestamp":1335166391,"content":"Ok, but is it actually Glorfindel making the trio good? Just imagine Imrahil in his stead. 1 less threat, 1 less willpower, easy ways to ready with 2 Spirit heroes: Escort from Edoras, The Riddermark's Finnest, Westfold Horse-breaker (double-effect there) - all these could be played on round 1 and each round aftewards, so that Imrahil can keep questing and fighting. And Arwen could help making him even better defender.\n\nI am glad though he sees play, I have been playing him myself a lot, mostly though for the love of the character from the books."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621003","commentId":621003,"userName":"Ted Sandyman","timestamp":1335169755,"content":"Poor Glorfindel hasnt exactly seen good press though has he in the various films that have been released, poor chap. In Ralph Bakshi's animated version back in the 70's/80's he was replaced by Legolas coming to the help of Strider and the hobbits, then in the recent trilogy Arwen appears to get Frodo over the line. Why were they so reluctant to stick to the book concerning Glorfindels heroics at this point of the journey? If it wasnt for him coming to the rescue, the ring would have fallen into the hands of the nine. We would all be working down the mines right now instead of playing the game. Just a thought!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621020","commentId":621020,"userName":"lleimmoen","timestamp":1335174216,"content":"Ted Sandyman said:\n\nPoor Glorfindel hasnt exactly seen good press though has he in the various films that have been released, poor chap. In Ralph Bakshi's animated version back in the 70's/80's he was replaced by Legolas coming to the help of Strider and the hobbits, then in the recent trilogy Arwen appears to get Frodo over the line. Why were they so reluctant to stick to the book concerning Glorfindels heroics at this point of the journey? If it wasnt for him coming to the rescue, the ring would have fallen into the hands of the nine. We would all be working down the mines right now instead of playing the game. Just a thought!\n\n\n\nExcellent post.\n\nI first saw the movie, it is true the story has many more characters than is usual already, and there I see the reasoning behind excluding those not present throughout the books (on the other hand Arwen is mostly just in the apendices).\n\nA few years after the movies I saw the (sort of) animated version and when a golden hair Elf appeared to aid the party I said aloud to my girlfriend \"oh great, they did use Glorfindel,\" which was immediately followed by Aragorn's \"hello Legolas.\"\n\nI sometimes do understand why are people angry over the Jackson's film adaptation, some things bother me too, but then I remember this animated horror (or a great number of other adaptations of much more easily adaptable books) and I am thankful that we got what we have. If it were up to me, I would not skip the large majority of Three is Company, A Short Cut to Mushrooms or the entire Bombadil story-line, but then again, others are in charge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621033","commentId":621033,"userName":"Ted Sandyman","timestamp":1335176188,"content":"I had to laugh at the \"animated horror\". I remember back as a kid watching it for the first time, i had a few nightmares as some parts were real people that were half animated (if you know what i mean). Scared the hell out of me but recently ive bought it again and have come to appreciate the different take on it. Just a shame it wasnt finished. By the way, great detail and in depth look at the heroes. Enjoyed reading them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621057","commentId":621057,"userName":"Morithain","timestamp":1335181571,"content":"Jackson obviously had to make some tough decisions in his adaptation, but overall I think he did a great job--though I have my quibbles.   Interestingly, he took several scenes from the animated 'horror' that Bakshi did well (in general I think Bakshi's version is an uneven mess with a few standout scenes):  the shot of Odo Proudfoot shouting \"Proudfeet!\" was an homage to Bakshi's version, as is the scene where the Nazgul are gathering to kill the hobbits in the Prancing Pony;  also at the end of the Fellowship, when Frodo tells Sam he is going to Mordor alone, Sam's reply \"Of course you are, and I'm going with you!\" is from Bakshi's LOTR, *not* the book. \n\nStill, there's no way to best the book.  And, I agree, Glorfindel isn't as good as he should be--the healing ability is just not anywhere near as good as other 12 threat heroes, like Aragorn, for example, who basically has a 1-point unexpected courage auto-attachment.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621058","commentId":621058,"userName":"Narsil0420","timestamp":1335181730,"content":"Ted Sandyman said:\n\nPoor Glorfindel hasnt exactly seen good press though has he in the various films that have been released, poor chap. In Ralph Bakshi's animated version back in the 70's/80's he was replaced by Legolas coming to the help of Strider and the hobbits, then in the recent trilogy Arwen appears to get Frodo over the line. Why were they so reluctant to stick to the book concerning Glorfindels heroics at this point of the journey? If it wasnt for him coming to the rescue, the ring would have fallen into the hands of the nine. We would all be working down the mines right now instead of playing the game. Just a thought!\n\n\n\n \n\nWell, I love Glorfindel as much as anybody but you have to admit that he really doesn't do anything in Lord of the RIngs! He arrives and gives Frodo a horse. That's pretty much it. What we get excited about are the HINTS that he's \"really powerful\" but we don't actually see that. I'm not surprised that they cut him out of the movies because why introduce a character that is only in one scene?\n\nWith that in mind, I'm perfectly happy with the way the game has portrayed Glorfindel. He's got the second highest willpower and equal attack to anyone. He can also easily take an undefended hit and you know he can heal himself. And surely his healing ability became more important while escorting Arwen to Rivendell.\n\nYes, it is a pain to not be able to use his 3 attack. But he's not the only hero who's rull potential requires getting an unexpected courage on them. Berevor's abilities go hugely to waste if you can't use her multiple times in a turn. I don't see why we so easily forgive Berevor her handicap but get down on poor Glorfindel. Maybe we need to give Glorfindel the respect he deserves. Put an Unexpected Courage and a Rivendell Blade on him and let's let him shine!\n\nhumbly yours,\n\nNarsil0420"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621128","commentId":621128,"userName":"Titan","timestamp":1335191502,"content":"I used to not be much of a fan of Denethor through most of the Mirkwood cycle. Rarely used him. Then, after setting him to bypass the worst of the Return to Mirkwood enemies and finally beating that quest, I have gained a newfound respect for his abilities. I have now used him in both Redhorn Gate and Road to Rivendell with good results. The trio of Denethor/Henamarth/Rumor From the Earth is unbeatable as far as figuring out what's coming next and either avoiding it or being prepared for it. \n\nI really think that with the introduction of the new Aragorn and what it already has, Lore may be at the top of the game right now among the spheres. I believe even a mono Lore deck is going to be very playable with the new AP. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621140","commentId":621140,"userName":"lleimmoen","timestamp":1335192876,"content":" As for Lore, yes it is probably the best sphere fit for mono-coloured deck, also due to the Minstrel. It will certainly need some resource-acceleration though, again with either Song of Kings or Travel, this is more of an option. Or with Resourceful but that means either two heroes or Spirit again (doing it via Needful to Know does not seem efficient yet).\n\nAs for Glorfindel, it shows again that players have different opinions - that certainly is a good sign for the game and its balance (within the player cards at least). As I was pointing out that he is perfectly playable, I just do not see him as efficient as others - given the highest threat cost. But what really bugs me (and that may be just a fancy of mine) is the thematic issue, it is hard to argue Glorfindel's ability is very good; this notion is easily supported by other healing cards that often grant better goods.\n\nAs for Glorfindel and his part in the story, no, he was not just providing the horse. He made the entire flight possible, the whole thing would have most likely failed without his timely aid. That his name only appears on a limited number of pages is nothing strange for Tolkien, the titular character only has one line after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621170","commentId":621170,"userName":"Budgernaut","timestamp":1335198238,"content":" Now in the movies, Arwen spoke to Frodo to try to stop the poison of the morgul blade. Didn't Glorfindel do something like that in the book? I always thought that's where the theme of the ability came from, so I considered it a neat ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621199","commentId":621199,"userName":"GrandSpleen","timestamp":1335204912,"content":"Yep Budger -- Glorfindel lays hands on Frodo and relieves some of the pain.  Can't heal it all on his own, obviously, but maybe that is why his ability can only heal 1 point of damage =)\n\n \n\nAs I've said before, Lore is my favorite sphere and I typically play a green/red deck while my wife plays blue/purple (we pretty well stick to the same decks with only slight modifications from quest to quest... less time commitment for us, and easier for her to learn and remember cards).\n\nOur strategy is typically dependent on card draw, so it is very hard for me to play without Bilbo or Beravor (we favor Bilbo for the certainty of the extra draw).  Bilbo with a Burning Brand and Dunedain Warning is a poor man's Denethor :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I currently don't have any songs for Tactics, so I play 2 Tactics heroes and 1 Lore, but I am looking forward to the day not so far off when I will buy the Dead Marshes and get myself set up to play 2 Lore and 1 Tactics.  And I'm very much looking forward to the (far off!) day when I will get to use this new Strider version of Aragorn!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621236","commentId":621236,"userName":"Beano","timestamp":1335212618,"content":"lleimmoen said:\n\nOk, but is it actually Glorfindel making the trio good? Just imagine Imrahil in his stead. 1 less threat, 1 less willpower, easy ways to ready with 2 Spirit heroes: Escort from Edoras, The Riddermark's Finnest, Westfold Horse-breaker (double-effect there) - all these could be played on round 1 and each round aftewards, so that Imrahil can keep questing and fighting. And Arwen could help making him even better defender.\n\nI am glad though he sees play, I have been playing him myself a lot, mostly though for the love of the character from the books.\n\n\n\nYea it is funny, almost every time I \"think\" that I've finally found a use for Glorfindel, I take a step back and realize how much better the deck is if I simply replace him with Bifur or Beravor. I mean, Bifur quests at just 1 less but has **5** less threat. That is freakin huge! And if Dain is in play, he matches the questing ability. That said, I really like the concept of the Eowyn, Frodo, Glorfindel trio. With Elrond's Council coming out, there is finally an argument to defend including Glorfindel.\n\nTitan said:\n\nI used to not be much of a fan of Denethor through most of the Mirkwood cycle. Rarely used him. Then, after setting him to bypass the worst of the Return to Mirkwood enemies and finally beating that quest, I have gained a newfound respect for his abilities. I have now used him in both Redhorn Gate and Road to Rivendell with good results. The trio of Denethor/Henamarth/Rumor From the Earth is unbeatable as far as figuring out what's coming next and either avoiding it or being prepared for it.\n\nI really think that with the introduction of the new Aragorn and what it already has, Lore may be at the top of the game right now among the spheres. I believe even a mono Lore deck is going to be very playable with the new AP.\n\n\nThe new Loragorn provides cheap and dependable threat reduction to Lore which is neat and definitely helps round it out. Plus Aragorn gives them a much needed attack boost. I've seen the value of/need for Lore progressively declining over the course of the expansions. Perhaps they are rebounding here a bit. But while there is possibly an argument in solo for Lore, in general Spirit is unquestionably the best.\n\nhttp://www.boardgamegeek.com/blogpost/9634/the-rise-and-fall-of-lore [http://www.boardgamegeek.com/blogpost/9634/the-rise-and-fall-of-lore]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621286","commentId":621286,"userName":"lleimmoen","timestamp":1335227201,"content":"GrandSpleen said:\n\nYep Budger -- Glorfindel lays hands on Frodo and relieves some of the pain.  Can't heal it all on his own, obviously, but maybe that is why his ability can only heal 1 point of damage =)\n\n\n\nYes, you are both right, just remember, it was no ordinary damage dealt to Frodo by the Morgul Blade, which is why he could not heal it all I believe.\n\nThanks for all the comments fellow players. Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63482-20-heroes-in-lore/?do=findComment&comment=621318","commentId":621318,"userName":"leptokurt","timestamp":1335234946,"content":"Beano said:\n\nlleimmoen said:\n\n \n\nOk, but is it actually Glorfindel making the trio good? Just imagine Imrahil in his stead. 1 less threat, 1 less willpower, easy ways to ready with 2 Spirit heroes: Escort from Edoras, The Riddermark's Finnest, Westfold Horse-breaker (double-effect there) - all these could be played on round 1 and each round aftewards, so that Imrahil can keep questing and fighting. And Arwen could help making him even better defender.\n\nI am glad though he sees play, I have been playing him myself a lot, mostly though for the love of the character from the books.\n\n \n\n \n\nYea it is funny, almost every time I \"think\" that I've finally found a use for Glorfindel, I take a step back and realize how much better the deck is if I simply replace him with Bifur or Beravor. I mean, Bifur quests at just 1 less but has **5** less threat. That is freakin huge! And if Dain is in play, he matches the questing ability. That said, I really like the concept of the Eowyn, Frodo, Glorfindel trio. With Elrond's Council coming out, there is finally an argument to defend including Glorfindel.\n\nTitan said:\n\n \n\nI used to not be much of a fan of Denethor through most of the Mirkwood cycle. Rarely used him. Then, after setting him to bypass the worst of the Return to Mirkwood enemies and finally beating that quest, I have gained a newfound respect for his abilities. I have now used him in both Redhorn Gate and Road to Rivendell with good results. The trio of Denethor/Henamarth/Rumor From the Earth is unbeatable as far as figuring out what's coming next and either avoiding it or being prepared for it.\n\nI really think that with the introduction of the new Aragorn and what it already has, Lore may be at the top of the game right now among the spheres. I believe even a mono Lore deck is going to be very playable with the new AP.\n\n \n\nThe new Loragorn provides cheap and dependable threat reduction to Lore which is neat and definitely helps round it out. Plus Aragorn gives them a much needed attack boost. I've seen the value of/need for Lore progressively declining over the course of the expansions. Perhaps they are rebounding here a bit. But while there is possibly an argument in solo for Lore, in general Spirit is unquestionably the best.\n\nhttp://www.boardgamegeek.com/blogpost/9634/the-rise-and-fall-of-lore [http://www.boardgamegeek.com/blogpost/9634/the-rise-and-fall-of-lore]\n\n\n\nI read the article and have to say that the author apparently never played a Dwarven deck. Otherwise I can't explain why he claims that lore is not that good at questing. Lore has a one resource ally (who isn't even limited!) who has 2 WP. Hammersmith and Miner have also 2 WP and are excellent defenders. And, last but not least, lore has Erebor Mapmaker and Protector of Lórien! With a good starting hand a Dwarven deck can quest with 9-10 WP in round 1, with a bad starting hand it still has 5-6 WP, depending on the heroes you chose. It also has solid fighters and attachments. I don't think we can speak of a \"decline\" regarding the lore sphere, epsecially as it is an integral part of the new secrecy concept.\n\nNevermind spirit is probably still the best sphere, but the players now have good alternatives to succeed without it, as Ileimmoen's beautiful descriptions of the single spheres shows."}]}