{"url":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/","title":"Did that really just happen►","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621601","commentId":621601,"userName":"DurinIII","timestamp":1335291204,"content":"Game setup; I reveal Orc Raiders, they engage me.  Turn 1, play Erebor Record Keeper and put a Song of Wisdom on Frodo.  I quest with Bifur, Bilbo, Frodo, Arwen and Erebor Record Keeper, reveal a Pathless Country location, and win overall by 5 willpower. I travel to the location, the staging area is now empty and now I must contend with the Raiders who engaged me during setup.  Obviously I have to declare the attack undefended as all of my characters are exhausted. I draw a Sleeping Sentry, GAME OVER!  Wow, now that was entirely unexpected. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621624","commentId":621624,"userName":"soullos","timestamp":1335296870,"content":"KO''d in the first turn! Ouch, that is some very bad luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621639","commentId":621639,"userName":"Asmoridin","timestamp":1335299736,"content":"I feel like all of my solo games end in a similar fashion.  ''Yeah, I have a chance'' -> ''What, everything dead in a turn►''"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621641","commentId":621641,"userName":"DurinIII","timestamp":1335299910,"content":"Haha, yeah it sucked but hey, I win against this scenario with this deck most of the time. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621685","commentId":621685,"userName":"guciomir","timestamp":1335310574,"content":"Well, if everybody is sleeping, including sentry, it is fairly common to die during night ambush.\n\nBut seriously, you need a shadow card counter in the opening hand :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621745","commentId":621745,"userName":"Ninjawa2","timestamp":1335332447,"content":"I think the real problem with that card is that both the when revealed and shadows are potential game enders.  You basically have to draw 2 test of wills and 2 hasty strokes specifically to counter it.  It is no real surprise that out of the 5 runs at that quest the 3 failures involved both copies of sleeping sentry coming up in the first 5 turns and no cancelling card draws.  For what is supposed to be difficulty 4, this quest has by far my biggest loss rate recently.  I suppose I should add in some encounter deck scouting so I''m more prepared."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621765","commentId":621765,"userName":"leptokurt","timestamp":1335336611,"content":"Ninjawa said:\n\nI think the real problem with that card is that both the when revealed and shadows are potential game enders.  You basically have to draw 2 test of wills and 2 hasty strokes specifically to counter it.  It is no real surprise that out of the 5 runs at that quest the 3 failures involved both copies of sleeping sentry coming up in the first 5 turns and no cancelling card draws.  For what is supposed to be difficulty 4, this quest has by far my biggest loss rate recently.  I suppose I should add in some encounter deck scouting so I''''m more prepared.\n\n\n\nOr you have to play Burning Brand, Dúnedain Watcher or Dawn take you all. Or use Eleanor. Or Out of the WIld."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621790","commentId":621790,"userName":"guciomir","timestamp":1335343685,"content":"This quest is interesting because it forces you to do mulligan even if you have a nice starting hand (but no counters). It also makes you rethink strategy a little bit. For example: draw cards with gandalf, so you get more counters or try to finish quest as soon as possible because fewer turns = lower chance to draw sleeping sentry / ambush.\n\nI played it several times now and I remember situations when I got great starting hand but no dunedain watcher / hasty stroke. With a bit of pain, I mulliganed into a much worse hand, but I had those shadow counters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621803","commentId":621803,"userName":"DurinIII","timestamp":1335345456,"content":"Interesting; I don''t find victory in this quest to rely solely on counters to the deck.  I rarely take a mulligan if I have no counters in my opening hand.  Ambush isn''t the issue for me in this quest with the deck I play, just sleeping sentry.  Sleeping sentry has only ever done me in during the Combat Phase (as a shadow card). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621829","commentId":621829,"userName":"Titan","timestamp":1335349278,"content":"I''ve been packing A Burning Brand, Hasty Stroke and A Test of Will, 3 cards I use rarely, for this quest. To top it all off, I''m also using     Denethor/Henamarth/Rumor From The Earth to see what''s coming and if at all possible, avoid it. There''s just too many extremely nasty pitfalls on this quest due to treachery cards and shadow effects. It''s not just Sleeping Sentry. The shadow effect of Undisturbed Bones, which can discard an ally and cause an attack to go undefended, possibly killing a hero, Orc Ambush which can deposit a number of enemies back in the staging area. Then there''s Followed by Night, and more besides. No reason to deal with them if they can be avoided.\n\nAs a matter of fact, A Burning Brand already saved me the first time I played this quest by negating Sleeping Sentry''s shadow effect. It would have been an automatic loss as it would have forced me to discard Arwen amongst others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=621838","commentId":621838,"userName":"DurinIII","timestamp":1335350671,"content":"Yeah, good points Titan, though Undisturbed Bones is never an issue for me because I almost exclusively block with Frodo (who usually has a Fast Hitch on).  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=622007","commentId":622007,"userName":"The_Fallen_Arises","timestamp":1335382342,"content":" Road to Rivendell is ruthless…along with Journey to Rhosgobel, it is one of the cheapest quests in the whole game. In fact, I played Rhosgobel two times yesterday with my roommate. We had a decent run but then BAM ! All those treacheries fall on our heads, our cancelling cards aren't enough, and we end up losing….ugh ! Somehow, some quests demand a lot more luck than others…At least IMO"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63552-did-that-really-just-happen%E2%96%BA/?do=findComment&comment=622038","commentId":622038,"userName":"gatharion","timestamp":1335389355,"content":" Yeah, my win/loss record with Road to Rivendell is pretty much dependent on whether or not I draw Sleeping Sentry and if I can cancel it.\n\n \n\nMy very first go at Flight From Moria also resulted in a first turn loss."}]}