{"url":"https://community.fantasyflightgames.com/topic/63627-group-size-question/","title":"Group Size Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63627-group-size-question/?do=findComment&comment=622102","commentId":622102,"userName":"Tromdial","timestamp":1335408665,"content":"Began looking at LotR LCG today and it looks really cool. I have a question on player allotment: the game goes up to 4 players if you buy 2 core sets. However, with all the other cards that come from expansions and adventure decks, is that statement still true that I have to buy the same core box twice? What am I buying that I need double of? Also, can this game go beyond 4 players too if I hypothetically bought a third box, or is there something that prevents seamless game play beyond 4? Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63627-group-size-question/?do=findComment&comment=622122","commentId":622122,"userName":"starhawk77","timestamp":1335417770,"content":"You really don't need two Core Sets to support four players. While a single Core Set only comes with two threat trackers, it also includes four pre-constructed decks. As long as two people are okay with keeping track of threat using dice or pen and paper, one Core Set should easily suffice. Really, the only reason to buy multiple copies is to expand your deck-building options. I'd definitely recommend starting with just a single Core Set, and then potentially adding more if your group really wants to do so.\n\nAs to your other question, MOST scenarios can conceivably support more than four players. I emphasize this point because there are a few quest setups that scale based on the number of players, but cannot easily adapt to five or six participants (Conflict at the Carrock, The Massing at Osgiliath, and Flight From Moria come to mind). In general, though, five or six players should be able to tackle the majority of available scenarios. You'll probably want at least two Core Sets to support more than four players; otherwise, there just won't be enough cards to go around."}]}