{"url":"https://community.fantasyflightgames.com/topic/63742-chronology-of-scenarios-for-thematic-play/","title":"Chronology of scenarios for thematic play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63742-chronology-of-scenarios-for-thematic-play/?do=findComment&comment=623191","commentId":623191,"userName":"Style75","timestamp":1335609732,"content":"I've decided that my favorite part of this game is the story behind the scenarios, locations and the player cards. The other day I thought that if that's what I enjoy, I should start playing the game in a way that maximizes that enjoyment. I want to play the game in a way that a story unfolds as logically as it should with characters and items that reinforce that story.\n\nI decided to start my story based game at the beginning with the core set and shadows of mirkwood expansion.\n\nThe first thing I did was to put together 2 player decks that would have a common theme linked directly to the story. I thought that if the heroes are sent from Mirkwood to hunt down gollum they should probably be elves and have as many elven support cards as possible. I also remembered from the books (particularly Unfinished Tales) that Aragorn and the rangers (Dunedain) played a role in the capture of Gollum. Therefore I put in a moderate number of Dunedain heroes and support cards. The end result were two decks that feel very tight thematically and bring the story to life in very vivid way.\n\nThe second thing I did was to figure out the correct chronological order for the scenarios to play out so that the story unfolded in a logical way. To understand why I've chosen this order, it helps to have a map of middle earth handy as a lot of this is based on geographic locations. Here's what I came up with:\n\n1. Escape from Dol Guldur - I chose to do this first because in the books, the escape of Gandalf from the fortress occurred over 150 years before the capture of Gollum. This was the hardest scenario to fit into my timeline because it is quite different from the others. I view this as a prequel story, which makes me feel better about my almost certain failure in beating this extremely hard scenario. Lots of movies start off with bad things happening.\n\n2. Passage through Mirkwood - Many years later, Gandalf has convinced King Thranduil of Mirkwood to deal with the threat of Dol Guldur and the King sends a team of heroes to ask for assistance from the elves of Lothlorien.\n\n3. Conflict at the Carrock - Having emerged from Mirkwood forest, the elf and Dunedain heroes discover a terrible battle taking place at the Carrock and decide to help out. I went this this one second because the Carrock is quite far north on the river and is the logical first stop after emerging from a straight east to west transit.\n\n4. Journey down the Anduin - The Beornings told the heroes to be on the lookout for Gollum who they've seen heading south along the river. Gandalf would like very much to capture this creature and directs the heroes to do everything they can to catch him alive. The party then heads south on the river and of course things bad very quickly. I wanted to run this scenario after Carrock to get the feel of traveling a long distance down river.\n\n5. Journey to Rhosgobel - After the ambush, the heroes are continuing down the river and approaching the southwest edge of Mirkwood. According to the books, this is the location of Rhosgobel so it fits that this scenario take place next. After this scenario I added tactics to one of my decks and put in a number of eagle cards.\n\n6. The Hunt for Gollum - South of the Gladden Fields and close to Dol Guldur, Aragorn picks up the trail of Gollum and the hunt is on. The message to Lothlorien will have to wait, Gollum must be caught before he gets away. The heroes pursue him south along the river, almost catching him before he escapes into the Emyn Muil. I like starting this scenario so late because it creates a continuous narrative of Gollum's capture with the rest of the scenarios. I find that these scenarios build up a nice tension culminating in the Dead Marshes.\n\n7. The Hills of Emyn Muil - Gollum is running and hiding through the rugged hills while the heroes are in hot pursuit. They track him southeast into the Dagorlad and the Dead Marshes.\n\n8. The Dead Marshes - Gollum is cornered and does everything he can to escape, but eventually his is captured and dragged kicking and screaming north to the outskirts of Lothlorien.\n\n9. The Return to Mirkwood - The heroes deliver their message to Galadriel who thanks them and advises them to return Gollum to King Thranduil and Gandalf in Mirkwood. The elves of Lothlorien refuse to allow Gollum inside their borders. The heroes must escort him north which of course leads to a great finale to the whole story line.\n\n \n\nSo what do you think? I've played through it once and I have to say that it was an incredible amount of fun. What really made it for me was the combination of a really tight thematic deck of elves and dunedain with a logical story progression that matched the geography of Middle Earth. My decks weren't the absolute best deck builds and we lost several of the scenarios that would we could easily have won with better decks, but overall the experience was so enjoyable I didn't mind not having that perfect deck constructed for each scenario. I highly recommend this to anyone looking to get more fun out of this great game.\n\nI can't wait for the Dwarrodelf cycle to finish so that I can give it and the Kahazd-Dum set a similar treatment. I think a nice segway between the two cycles would be for me to start with Redhorn Gate and Road to Rivendell and continue to use my elf/dunedain deck. I think I'd flavor it that Arwen had assisted in the interrogation of Gollum and was now returning to her father with news of what they uncovered. For Road to Rivendell, I'd add in a dwarven hero, someone they meet in the mountains who would inform the heroes (and then Elrond) that the mines are lost again to the orcs. For Watcher in the Water, I'd say that Elrond informed a group of dwarves what has happened and then I use dwarven decks for the rest of the cycle.\n\nI can't wait! Hurry up FFG and release those chapter packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63742-chronology-of-scenarios-for-thematic-play/?do=findComment&comment=623278","commentId":623278,"userName":"Ted Sandyman","timestamp":1335630054,"content":"I like your idea of following the story through so im going to give it a try tomorrow. Will start working on my decks this evening. Well done for suggesting the new angle on this game too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63742-chronology-of-scenarios-for-thematic-play/?do=findComment&comment=623348","commentId":623348,"userName":"Budgernaut","timestamp":1335643409,"content":"I think this is awesome stuff! Great job!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63742-chronology-of-scenarios-for-thematic-play/?do=findComment&comment=624660","commentId":624660,"userName":"Yenninho","timestamp":1335884659,"content":"Brilliant work!! Can you tell me wich cards and heroes you used?\n\nP.S.: I'm looking forward to your Dwarrowdelf storyline\n\n \n\nYenninho"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63742-chronology-of-scenarios-for-thematic-play/?do=findComment&comment=625627","commentId":625627,"userName":"Cotillion37","timestamp":1336056021,"content":"That looks amazing! I'm going to try playing it this way later today."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63742-chronology-of-scenarios-for-thematic-play/?do=findComment&comment=625786","commentId":625786,"userName":"gmerwin2","timestamp":1336080585,"content":" Very, very nice.  The thematic play of this game is by far my favorite part.  I will definitely make a run at this format!"}]}