{"url":"https://community.fantasyflightgames.com/topic/63784-new-aragorn-in-quest-log/","title":"New Aragorn in Quest Log??","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63784-new-aragorn-in-quest-log/?do=findComment&comment=623534","commentId":623534,"userName":"AndreasL","timestamp":1335700057,"content":"Hi,\n\nHow do people register the new Lore Aragorn from Watcher in the Water in the Quest Log? Currently FFG only has one Aragorn in the Hero list and that is the Leadership version. FFG usually is quite fast at updating the hero list in the Quest Log so I am bit worried that they just thinking we could use the old Aragorn entry. Do you think he will be added as Aragorn (Lore) or something like that?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63784-new-aragorn-in-quest-log/?do=findComment&comment=623541","commentId":623541,"userName":"SiCK_Boy","timestamp":1335701088,"content":" They should use the set rather than the sphere to distinguish multiple versions of the same hero. For example: Aragorn (Core) or Aragorn (Watcher in the Water). This way, they'll be ready when they decide to reissue another Lore or Leadership version of Aragorn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63784-new-aragorn-in-quest-log/?do=findComment&comment=623555","commentId":623555,"userName":"Robert McMutton","timestamp":1335703949,"content":"In the spanish version they have already added him, and he appears as Aragorn, just the same as the first. So, we have Aragorn, and Aragorn to choose, which could be a problem. I suppose that it goes with order of appearance in the list, but not sure until I try it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63784-new-aragorn-in-quest-log/?do=findComment&comment=623557","commentId":623557,"userName":"Jacob5432","timestamp":1335704360,"content":"Robert McMutton said:\n\nIn the spanish version they have already added him, and he appears as Aragorn, just the same as the first. So, we have Aragorn, and Aragorn to choose, which could be a problem. I suppose that it goes with order of appearance in the list, but not sure until I try it.\n\n\n\nThat does not sound very clever. Hopefully they will find a better solution for the English version (and fix the Spanish). I hope the quest log will be updated in the coming week so we can get our Watcher in the Water quests logged."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63784-new-aragorn-in-quest-log/?do=findComment&comment=623591","commentId":623591,"userName":"Mattr0polis","timestamp":1335709754,"content":"I agree that is not a very good solution. Especially since it sounds like we could have many versions of many heroes in the future. There's already that new Bilbo coming as well (though he seems linked to quests and so probably won't be in the quest log) and I think there was a interview where the designers talked about different versions of Glorfindel, etc at some point.\n\nIt's not that bad a problem with only Aragorn but it WILL be a problem with three or four heroes with different versions, or worse, 3+ versions of a single hero.\n\nI agree with sick_boy, use the set to distinguish them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63784-new-aragorn-in-quest-log/?do=findComment&comment=625441","commentId":625441,"userName":"EmilL","timestamp":1336032993,"content":"The Quest Log has been updated and now has two Aragorn heroes. As Sick_Boy suggested they are named after their game so we have Aragorn (Core) and Aragorn (Watcher in the Water).\n\nThanks to FFG for fixing this pretty fast."}]}