{"url":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/","title":"Sleeping Sentry -how do you stop this?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=624056","commentId":624056,"userName":"crichtonfarscape","timestamp":1335795461,"content":"Sleeping Sentry\nType: Treachery\nEncounter Set: Road to Rivendell\n\nWhen Revealed: Deal 1 damage to each exhausted character. Then, exhaust all ready characters.\nShadow: Defending player must discard all exhausted characters he controls.\n\nSet: RtR Number: 46\nQuantity: 2\nIllustrator: Tiziano Baracchi\n\n \n\nWe almost won a 2 player game then this card came up as a shadow card and eliminated Arwen- our escort so we lost the game\n\nGRRRR- We were tactics and Spirit- I think we would need Lore and Burning Brand or just dont quest with Arwen????"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=624064","commentId":624064,"userName":"leptokurt","timestamp":1335796590,"content":"Spirit has Hasty Stroke to prevent this, tactics has Feint to prevent an attack and thus the shadow effect from happening. Quick Strike helps you to eliminate an enemy before he can attack you. Hail of Stones also can kill an enemy before he engages you. Leadership has Dúnedain Watcher and Dawn Takes You All.\n\nThe tactic cards and Dawn Takes You All are not as effective as the other two cards, but when you're close to winning you can use them to prevent shadow effects from happening."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=624428","commentId":624428,"userName":"DurinIII","timestamp":1335853998,"content":"Denethor can potentially stop it too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=624559","commentId":624559,"userName":"leptokurt","timestamp":1335872150,"content":"DurinIII said:\n\nDenethor can potentially stop it too.\n\n\n\nCorrect. As can Shadow of the Past"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=624653","commentId":624653,"userName":"Drengi","timestamp":1335884010,"content":"As pointed out, there are lots of ways to stop it…… te problem is having them to hand at the right time! It is just the random nature of the game that gets us!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=626025","commentId":626025,"userName":"richsabre","timestamp":1336133063,"content":"out of the wild- get rid of it for good"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=626133","commentId":626133,"userName":"Dam the Man","timestamp":1336144138,"content":"After eight plays of RtR, I'm 1-7, two more plays tomorrow, then, thanks mainly to SS, won't ever touch this ***** quest again. ***** do I care if Arwen is killed? Nobody in either party is even wounded and that stupid ****** is discarded and we lose. ****** that. Five losses directly as a result of SS, other two Pathless Country as Shadow Effect hitting all allies for 1 dmg. Only win was when Beravor + UC spam worked from turn 1 onwards, allowing all those cancellers in hand (although could've been so different without Eleanor as SS came up during setup). Burning Brand is nice, if A) you can get it and B) keep it, those attachment discarders have measly 21 engagement cost (IIRC) and nothing cancels Forceds. Back to back turn 1 losses today, even Beravor + UC wasn't enough today.\n\nKD had Sudden Pitfall which was regularly a hero-killer (both as Treachery and Shadow Effect) but SS is a quest-killer. In RHG, Snowstorms weren't introduced until stage 2, so you knew they were waiting, SS can easily hit turn 1, especially thanks to Ambush. Crebain surging into SS is an unstoppable exhauster combo.\n\n[ADMIN: Edited for language. Please remember to keep your language family-friendly.]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=626421","commentId":626421,"userName":"Style75","timestamp":1336223446,"content":"Sleeping Sentry is way overpowered for a scenario that is only supposed to be difficulty 4. If it gets drawn and you have no way to counter it then it's game over. You might suffer through a couple more rounds, but you're going to lose. Even the shadow effect is way overpowered. I've played this scenario about 5 times and have won only once. In every other case I lost because I get hit by Sleeping Sentry.\n\nI've decided to houserule the card so it's still hard but less game breaking. Any suggestions?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=626567","commentId":626567,"userName":"Glaurung","timestamp":1336265234,"content":"Style75 said:\n\nSleeping Sentry is way overpowered for a scenario that is only supposed to be difficulty 4. If it gets drawn and you have no way to counter it then it's game over. You might suffer through a couple more rounds, but you're going to lose. Even the shadow effect is way overpowered. I've played this scenario about 5 times and have won only once. In every other case I lost because I get hit by Sleeping Sentry.\n\nI've decided to houserule the card so it's still hard but less game breaking. Any suggestions?\n\n\n\nDont Use Arwen and everything will be ok. And also dont wait advance quickly on the quest.\n\nThis adventure peace of cake very big shame of designers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=626613","commentId":626613,"userName":"starhawk77","timestamp":1336279629,"content":"Glaurung said:\n\nDont Use Arwen and everything will be ok. And also dont wait advance quickly on the quest.\n\nThis adventure peace of cake very big shame of designers.\n\n \n\n \n\n~Haven't you figured it out, Glaurung? Nate French and Lukas Litzinger are just trolling you with each new release. They're purposely making every scenario ridiculously easy precisely because they know it will infuriate you. The following was transcribed from one of their Khazad-Dum design sessions:\n\nNF: Hey, you know what would be hilarious? A location with X threat, where X is the number of players in the game. And we'll give it no harmful travel effect.\n\nLL: Dude! Okay, check this out: we also give it X quest points. Talk about a cakewalk! \n\nNF: BAHAHAHA! Oh-em-gee, Glaurung will be apoplectic. It's SO BENIGN!\n\nLL: I know, right? And here's the best part: we can do the same thing with an enemy…\n\nNF: Cha-ching!\n\n \n\nSo, it's all just a long con to get your goat. They spend their lunch breaks reading your frustrated comments and giggling to themselves maniacally. When you complain about the difficulty, you're just playing right into their hands. Don't give them that satisfaction, Glaurung. Don't let them win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=626760","commentId":626760,"userName":"richsabre","timestamp":1336314158,"content":"that must have taken some creative inspiration starhawk haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=626786","commentId":626786,"userName":"leptokurt","timestamp":1336321008,"content":"Well, Glaurung is right that Arwen shouldn't quest when you have enough WP (and resources). In my (solo) gamesshe rareley got killed. Needful to Know, Rumour from the Earth, Henamarth, Shadow of the Past - there are many cards that can prevent this from happening.\n\nSure, the shadow effect of Sleeping Sentry is more annoying, but when you play a secrecy deck you won't get too many shadow effects. as most of the enemies won't attack you Take Théodred and Bilbo as your heroes, include Dúnedain Watcher, May Dawn take you All, Dark Knowledge and the aforementioned lore cards and the risk of loosing will be reduced to a minimum. This quest isn't too difficult otherwise, all you need is some WP to progress further through the quest.\n\nGood luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=627521","commentId":627521,"userName":"Cotillion37","timestamp":1336437117,"content":"starhawk77 said:\n\nGlaurung said:\n\nDont Use Arwen and everything will be ok. And also dont wait advance quickly on the quest.\n\nThis adventure peace of cake very big shame of designers.\n\n \n\n \n\n~Haven't you figured it out, Glaurung? Nate French and Lukas Litzinger are just trolling you with each new release. They're purposely making every scenario ridiculously easy precisely because they know it will infuriate you. The following was transcribed from one of their Khazad-Dum design sessions:\n\nNF: Hey, you know what would be hilarious? A location with X threat, where X is the number of players in the game. And we'll give it no harmful travel effect.\n\nLL: Dude! Okay, check this out: we also give it X quest points. Talk about a cakewalk! \n\nNF: BAHAHAHA! Oh-em-gee, Glaurung will be apoplectic. It's SO BENIGN!\n\nLL: I know, right? And here's the best part: we can do the same thing with an enemy…\n\nNF: Cha-ching!\n\n \n\nSo, it's all just a long con to get your goat. They spend their lunch breaks reading your frustrated comments and giggling to themselves maniacally. When you complain about the difficulty, you're just playing right into their hands. Don't give them that satisfaction, Glaurung. Don't let them win.\n\n\n\nI was the one doing the transcription of that design meeting, and can confirm that this is exactly how it went down."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=674129","commentId":674129,"userName":"pinkbatgirl","timestamp":1345015505,"content":" @Style75 - We have houseruled the shadow text for Sleeping Sentry to apply to 'all allies' rather than 'all characters' and we don't quest with Arwen if we think that deck might be engaged with an enemy (we play with 4 single-sphere decks)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63841-sleeping-sentry-how-do-you-stop-this/?do=findComment&comment=675103","commentId":675103,"userName":"Rheingold","timestamp":1345158282,"content":" I feel you man.  Everything is always going great and then that card kills me.  I don't see why I am required to change spheres to deal with it, but I guess that is how they seem to have designed the game, especially if you want to play solo.  Otherwise, my Aragorn/Twins deck has been performing well.  Not using Arwen is an option, but those two spheres, without attachments, don't quest so well.  The guy who said it was easy seems to not be considering that if you are questing and powering through \"quickly\" then you have more characters exhausted, and are thus even more vulnerable to the card.  Losing Arwen is insta-loss if you happened to risk questing with her, but you will almost always have a hero exhausted at that point if you wish to make ANY progress on the quest, and in solo, losing a hero is effectively insta-loss.  I have beaten it, but felt only like I did so because the card wasn't drawn, or came at a more fortuitous (through no work of mine) time. \n\nEither way, I find cards of this ilk to be a lazy way to provide \"challenge\".  But again, I play solo.   Multiplayer I think could survive this a bit more, but maybe I am wrong, given some of the rage I see.  \n\n \n\n \n\n \n\n   "}]}