{"url":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/","title":"5 cards that need to be made","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=625004","commentId":625004,"userName":"Boris_the_Dwarf","timestamp":1335950776,"content":" My creative brain started working on a solution to the lack of balance among the spheres in solo play (it is my personal belief based on extensive play of this game that decks without threat reduction and quest power cannot win on their own. Particularly, Tactics sphere cards are heavily designed as support cards (and not just the ones with the \"ranged\" keyword, either). After some thought, I came up with these 5 cards that I think could do wonders for balancing the weaker spheres better. It sucks knowing half of all the cards I open just set in the box unusable.\n\n \n\nHere we go…\n\n1. The Last Alliance  cost 1  Tactics Event\n\nPlay only during the planning phase. Reduce your threat by 2 for each ally card you play this phase.\n\nThis plays into one of the few strengths of the Tactics sphere - the ability to collect a great number of resource tokens while you wait for the right moment to play specific cards. You can drop a whole handful of cheap allies on a single turn and reduce your threat to a manageable level.\n\n \n\n2. Council Summons  cost 5 Neutral Event\n\nSearch your deck and discard pile for any 3 ally cards with different names and put them into play with 2 progress tokens on them. Those allies cannot quest, attack, or defend while they have progress tokens on them. During the refresh phase, you may move 1 progress token onto any location.\n\nThis would allow you to mix up the spheres a little more than is currently possible without \"mana fixing.\"\n\n \n\n3. Arwen Undomiel 6 Threat Hero Leadership\n\n3 Willpower/ 0 Attack/ 2 Defense\n\nArwen Undomiel can't be chosen as one of your starting heroes and is instead shuffled into the player deck at the start of the game. Raise your threat by 6 minus the number of players to play this card from your hand. Resource tokens from characters you control may be spent as though they were of any sphere.\n\nVery powerful, but the tradeoff is you have to actually draw her and then raise your threat. Her threat is the lowest in the game and she can quest. She also provides mana fixing.\n\n \n\n4. The Art of War t cost 2 Tactics Attachment\n\n Restricted. Attach only to a Tactics hero. Whenever a character you control participates in an attack that destroys an enemy, place 1 progress token on the current quest and reduce your threat by 1.\n\n \n\nThis one should be self-explanatory. If combat is the flavor of the Tactics sphere, then it should directly tie into the win condition of the game.\n\nAnd finally…\n\n5. Fearless Leadership cost 4 Attachment Tactics\n\nCharacters with the Ranged keyword may attack enemies in the staging area at +2 attack.\n\nSo there you have it. With those 5 cards, I think the game could come a long way in allowing each sphere to be equally playable in solo while still retaining individual flavor.\n \n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=625127","commentId":625127,"userName":"Dwnhmcntryboy","timestamp":1335969820,"content":"Boris_the_Dwarf said:\n\n1. The Last Alliance  cost 1  Tactics Event\n\nPlay only during the planning phase. Reduce your threat by 2 for each ally card you play this phase.\n\nThis plays into one of the few strengths of the Tactics sphere - the ability to collect a great number of resource tokens while you wait for the right moment to play specific cards. You can drop a whole handful of cheap allies on a single turn and reduce your threat to a manageable level. \n\nI don' t like this idea at all. to me it is counter intuitive. Sure there is strength in numbers and you are able to handle anything. I get that for the threat reduction but at the same time the more people you have the more attention you will draw so then the threat would go right back up. Just does not fit for tactics.\n\n \n\nBoris_the_Dwarf said:\n\n 2. Council Summons  cost 5 Neutral Event\n\nSearch your deck and discard pile for any 3 ally cards with different names and put them into play with 2 progress tokens on them. Those allies cannot quest, attack, or defend while they have progress tokens on them. During the refresh phase, you may move 1 progress token onto any location.\n\nThis would allow you to mix up the spheres a little more than is currently possible without \"mana fixing.\"\n\n \n\nTurn 2 drop in 3 guys. Turn four they activate.  I don' t like it. Sure i will play 3 spheres and then I get to cherry pick my 6+ cost guys and drop them into play.  While all that is going on Turn 3 and 4 I will buy more cheap allies and have an army turn 4. Just over powered. Too Over Powered.\n\n \n\nBoris_the_Dwarf said:\n\n3. Arwen Undomiel 6 Threat Hero Leadership\n\n3 Willpower/ 0 Attack/ 2 Defense\n\nArwen Undomiel can't be chosen as one of your starting heroes and is instead shuffled into the player deck at the start of the game. Raise your threat by 6 minus the number of players to play this card from your hand. Resource tokens from characters you control may be spent as though they were of any sphere.\n\nVery powerful, but the tradeoff is you have to actually draw her and then raise your threat. Her threat is the lowest in the game and she can quest. She also provides mana fixing. \n\nThis is just a horrible Idea. Especially with the amount of threat manipulation in the game her draw back become moot. Combine that with the search functions in the game already. and she become another broken card. Then she is a hero so you can safely sacrifice one of your heroes and not really feel the pain of it? I get the theme and think Isee what you are trying to do. She shows up to save the day/Hobbit out of no where at the last minute and conducts a heroic rescue ala Movie and Leadership.  The book is a bit different.\n\n \n\nBoris_the_Dwarf said:\n\n4. The Art of War t cost 2 Tactics Attachment\n\n Restricted. Attach only to a Tactics hero. Whenever a character you control participates in an attack that destroys an enemy, place 1 progress token on the current quest and reduce your threat by 1.\n\nTactics is not about threat reduction. In fact It is about taking the threat on head to head and plowing through. Some of the ideas I have had are your Tactics heroes take wounds in order to up their Questing. Getting from point \"A\" to point \"B\". Then you have yet another restricted Item to add to tactics guys that already are needing the restricted Items they have to do anything worth while. Instead of Restricted. \"Limit 1 per Hero\" The Failing of Tactics is their Questing ability, NOT the threat management.\n\nBoris_the_Dwarf said:\n\n5. Fearless Leadership cost 4 Attachment Tactics\n\nCharacters with the Ranged keyword may attack enemies in the staging area at +2 attack.\n \n\n \n\nChange it to \"Hero with the Ranged…\" and make it Unique and Neutral Attachment… I think you are on to something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=625173","commentId":625173,"userName":"RedGiant","timestamp":1335975882,"content":" 1. I agree with the first reply post. It doesn't make sense that threat would be reduced from playing more allies. On the contrary, I actually like the idea that you could play allies at reduced cost but that would INCREASE your threat to play them at reduced cost. It would make more sense from a thematic and mechanical standpoint. \n\n2. I sort of like the delayed activation of this card, but there is no way a card that allows you to search for multiple allies in your entire deck to bring them in. That's ludicrously overpowered. I think maybe a card like this only for Noldor or Silvan characters, akin to Mustering the Rohirrim or The Eagles are Coming, is reasonable. \n\n3. I too, wish that Arwen would have been a hero instead of just an objective and ally. However, having a Hero that starts in the encounter deck brings up a huge assortment of problems with the rules. So you would have 4 heroes? Or you would have to start with 2 in order to play her?\n\n4. I agree with the first reply here too. It sounds like you want Tactics to be more well rounded. Having played solo most of the time, I am also frusterated that Tactics has practically no role in solo play, but Tactics getting threat reduction would be counter to the theme of the sphere. I more like the idea that was started with Unseen Strike, in that combat bonuses are given to low threat tactics parties. \n\n5. To be honest, for balancing reasons I believe attacking the staging area would be better suited to an event card rather than an attachment, which could potentially be game breaking. An event would be useful (similar to hail of stones) but not so powerful it would allow you to destroy enemies effortlessly every turn. \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=626528","commentId":626528,"userName":"player2052423","timestamp":1336251415,"content":"I think all 5 are right on the mark.  I see you got the usual \"Thats a horrible idea\", or change it to this and then it will be OK. \n\nAs you plainly stated in your initial post, the drawback to this game is the unusability of most the cards that we are handed in the adventure packs. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=626969","commentId":626969,"userName":"leptokurt","timestamp":1336359152,"content":"I like the idea of sacrificing attachments to get some extra bonus or an even better attachment. Otherwise I agree with what have been said already. However, I think that tactics should get some way to lower a player's threat to make it more playable for solo players. Something like \"exhaust X allies to lower your threat by X\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=626981","commentId":626981,"userName":"Mighty Jim 83","timestamp":1336363160,"content":" Some of these cards are ridiculously over-powered.\n\nMost obvious example.\n\nBlade of Gondolin - cost 1. When attached character kills an enemy, place 1 progress token on the current quest\n\nThe Art of War - Cost 2. When ANY character you control kills an enemy, place 1 progress token on the current quest AND lower your threat by 1.\n\nAlso, as someone else has said, Tactics isn't about threat management, it's about killing stuff. It's about Boromir charging up mount doom sword in each hand shouting \"come and have a go if you think you're hard enough\" If you want lots of bonus progress tokens and threat management, then play Spirit.\n\nThis thread would be more accurately titled \"5 cards which would make the game much much easier, and remove a lot of the flavour from the different spheres.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627207","commentId":627207,"userName":"player2052423","timestamp":1336392034,"content":"Disagree, the thread is labled correctly.  The examples are not overpowered and would not reduce the flavor from the other spheres.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627308","commentId":627308,"userName":"Dwnhmcntryboy","timestamp":1336401405,"content":"Moses, you are coming off as a troll just trying to start fights. There is no need for that. I appreciate the OP thread as it is showing his interest in the game. He is trying to address known issues and Kudos for him. All I was attempting to do was show him the error of his thinking and put him on the right track. He is a Tactics fan, GREAT, but everything revealed so far for tactics has not addressed Threat management but Enemy and to a lesser degree Quest management.\n\nEnemy management already allows Tactics to wound enemies in the staging area and other locations. Legolas and Blade of Gondolin  allows tactics to manage Quests to a degree. This is the vein that Tactics cards should run in, most importantly IMO. Sorry OP if I offended you in any way.\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627539","commentId":627539,"userName":"Budgernaut","timestamp":1336439877,"content":"Dwnhmcntryboy said:\n\n \n\nBoris_the_Dwarf said:\n\n4. The Art of War t cost 2 Tactics Attachment\n\n \n\n Restricted. Attach only to a Tactics hero. Whenever a character you control participates in an attack that destroys an enemy, place 1 progress token on the current quest and reduce your threat by 1.\n\n \n\nTactics is not about threat reduction. In fact It is about taking the threat on head to head and plowing through. Some of the ideas I have had are your Tactics heroes take wounds in order to up their Questing. Getting from point \"A\" to point \"B\". Then you have yet another restricted Item to add to tactics guys that already are needing the restricted Items they have to do anything worth while. Instead of Restricted. \"Limit 1 per Hero\" The Failing of Tactics is their Questing ability, NOT the threat management.\n\n \n\n \n\nHow about a card that reduces threat when you lose a character, rather than kill an enemy. Thematically, the enemy will feel threatened by the Tactics player, but destroying an ally or hero may cause the enemy to \"let its guard down.\" If this were an event, you'd only see it three times in a game, except for rare circumstances, so I don't think it would be a game-breaker. It would really depend on the cost of the card and how much threat it reduces. Oooh! New idea. Make it reduce threat equal to the attack of the character that is being destroyed (not just leaving play). Still not sure about cost . . .\n\nAlthough I agree that Tactics is not about threat reduction, I believe that giving it the ability to quest well will kill it's unique flavor faster than giving it threat reduction. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627794","commentId":627794,"userName":"Eryx_UK","timestamp":1336479588,"content":"The only card I think needs to be made is one that is neutral, reasonablely costed and allows you to search your deck for one card and put it into your hand. Basically a Demonic Tutor from Magic T Gathering."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627820","commentId":627820,"userName":"Faradey","timestamp":1336482174,"content":"How about this:\n\n \n\nSong of Resting (Neutral attachment)\n\nCost: 1\n\n \n\nAttach to a hero.\n\n \n\nAction:  Exhaust hero and pay 1 resource token to lower current threat level by 2.\n\n \n\nOR\n\n \n\nCover tracks (Tactics condition attachment)\n\nCost: 3\n\n \n\nAttach to a Tactics character.\n\n \n\nResponse: After questing unsuccessfully, the character exhausts and lowers threat by 2\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627843","commentId":627843,"userName":"Sprenger","timestamp":1336483973,"content":"Budgernaut said:\n\nHow about a card that reduces threat when you lose a character, rather than kill an enemy. Thematically, the enemy will feel threatened by the Tactics player, but destroying an ally or hero may cause the enemy to \"let its guard down.\" If this were an event, you'd only see it three times in a game, except for rare circumstances, so I don't think it would be a game-breaker.\n\nI think he is on to something here. Just like the Leadership has a card that lets a player draw 2 cards after an ally is killed, tactics could have a card with cost of 1. with \"Combat Response: When a defending ally under your control is killed or discarded, reduce your threat by 1 for every enemy that is engaged to you.\" "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627861","commentId":627861,"userName":"Boris_the_Dwarf","timestamp":1336486436,"content":" Let's clear up a couple of things. First of all, I am not \"a Tactics fan.\" Rather, I am a fan of the idea that I can use ALL of the cards and spheres in the packs and boxes I have bought instead of being relegated to using Spirit and Lore if I want a reasonable chance of winning in solo.\n\nTactics is not a solo-player sphere. It doesn't even mix well with the other spheres for solo play. Anything Tactics can do Lore can do better - and Lore offers healing. I don't know how other people play the game, but the game is about one thing and one thing only: QUESTING. The faster you quest, the faster you win. There may be one or two specific encounters that require certain/all enemies to be defeated, but in general it's about questing. And only Lore and Spirit have the willpower to do that. I am so, so tired of having to slap down Eowyn/Bifur/Dunhere in order to get through a series of quest cards. I've played this game extensively with all the spheres and after 3 months, I don't even look at the tactics sphere cards anymore, unless I have a partner to play with. More often I am running the game on my own, and I will take Bifur and Mirkwood Runner and Infighting over Legolas and Dwarven Axehand and Hail of Stone any day of the week. It's like playing chess - you can knock out every piece but at the end of the game you still have to capture the king. While you are killing my pawns, I will just go ahead and capture your king with 12 of your pieces still on the board.\n\n \n\nSecondly, I don't see how these cards \"kill flavor.\" They are meant to embrace flavor. Tactics strength is in killing enemies but it has ZERO questing ability. Why not enhance that flavor by helping with the actual win condition? Legolas is nice and all but when I'm playing by myself the last thing I want to do is throw down a 9-threat Tactics character with a useless ability.\n\nFinally, I kind of chuckled at the labeling of Moses as a \"troll trying to pick a fight.\" His only crime was in saying he liked my ideas. I guess it's wrong to disagree with people who disagree. That's fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627919","commentId":627919,"userName":"Dwnhmcntryboy","timestamp":1336492542,"content":"Boris if that is what you took away from the discussions then I feel sorry for you.\n\n3 months of game play is nothing. No one was attacking you personally, Except maybe MightyJim….\n\nDid you even read the good things I said about you? Did you recognize that I was trying to support you? Did you notice how besides Moses everyone else agreed with me?\n\nHell Budgernaut and BigShow even helped out, which I think were fairly solid suggestions, especially Budgernaut.\n\nAlso if you don't look to Tactics in solo play then you are missing out on a few good themes. No one sphere has an answer for everything and theme is very important to each of those spheres. it is how they operate. Take another 3 months of playing, rip the cards a new one and you will see where the themes lie and don't. \n\nI only hated 1 of your suggestions which I noted. The others, although way op, were right for other spheres but you wanted them for Tactics. When you post an opinion piece people are going to give you their opinions and in some cases their educated opinion which I was trying to do, I've been playing for a year. I am sorry for not jumping on your bandwagon but as I said now in 3 posts I was trying to help you get to the Tactics vein of thinking for the cards you offered up for the Tactics sphere, which again, I applaud your effort and enthusiasm.\n\nWhen having a discussion of this nature arguments should be \"point/counterpoint\". I offered up my points. Rather than take it personally and get snippy, you could have offered up counterpoints but now, for me ,you have undermined what I thought was a great, creative, open to ideas and discussion person and revealed something not appealing at all.\n\nObviously you took offense but I will not apologize any more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627932","commentId":627932,"userName":"Budgernaut","timestamp":1336494440,"content":" [silence] \n\nSoooo . . .\n\nI've been thinking a lot about what you (Boris_the_dwarf) said about wanting to use all your cards. My question is why do you feel you can't use them? I think this answer will really depend on what type of player you are. If you feel like you have to  win and win often, it's much harder to use Tactics in solo play. If you love to mix it up and try new things, you'll use all your cards, no matter how likely your chances of success. I won't presume to know where your playing style lies, but I think I ought to disclose that I like to mix things up. I'm mostly a Pippin player, looking for new combinations to try out.\n\nThat said, I respectfully disagree with your statement that Tactics is not a solo-player sphere. I've found plenty of uses for Tactics (not monosphere, of course). Thalin is great for Journey Along the Anduin because he can stop the surging crows and allows me to play dwarven axe and other attack-enhancers on Dunhere. Boromir was great at defending the Hobbits when I played A Journey to Rhosgobel. Taking the recent challenge to play Conflict at the Carrock with the three hunters (Aragorn, Legolas, and Gimli) was challenging, but amazingly fun! It took a few tries, but I was able to beat each of those scenarios with a Tactics hero in my fellowship. \n\nIn conclusion, I don't think any sphere is meant to stand on its own. Rather, each sphere is supposed to excel at certain tasks to support other spheres. I think we will eventually see some threat management for Tactics or some heroes with higher willpower, but I don't consider this sphere broken just because we don't have that yet. All I can say is, give Tactics a second chance. You'll enjoy the challenge and understand the sphere a lot better for it, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=627933","commentId":627933,"userName":"Faradey","timestamp":1336494621,"content":" \n\nBoris_the_Dwarf said:\n\n \n\n Let's clear up a couple of things. First of all, I am not \"a Tactics fan.\" Rather, I am a fan of the idea that I can use ALL of the cards and spheres in the packs and boxes I have bought instead of being relegated to using Spirit and Lore if I want a reasonable chance of winning in solo.\n\nTactics is not a solo-player sphere. It doesn't even mix well with the other spheres for solo play. Anything Tactics can do Lore can do better - and Lore offers healing. I don't know how other people play the game, but the game is about one thing and one thing only: QUESTING. The faster you quest, the faster you win. There may be one or two specific encounters that require certain/all enemies to be defeated, but in general it's about questing. And only Lore and Spirit have the willpower to do that. I am so, so tired of having to slap down Eowyn/Bifur/Dunhere in order to get through a series of quest cards. I've played this game extensively with all the spheres and after 3 months, I don't even look at the tactics sphere cards anymore, unless I have a partner to play with. More often I am running the game on my own, and I will take Bifur and Mirkwood Runner and Infighting over Legolas and Dwarven Axehand and Hail of Stone any day of the week. It's like playing chess - you can knock out every piece but at the end of the game you still have to capture the king. While you are killing my pawns, I will just go ahead and capture your king with 12 of your pieces still on the board.\n\n \n\nSecondly, I don't see how these cards \"kill flavor.\" They are meant to embrace flavor. Tactics strength is in killing enemies but it has ZERO questing ability. Why not enhance that flavor by helping with the actual win condition? Legolas is nice and all but when I'm playing by myself the last thing I want to do is throw down a 9-threat Tactics character with a useless ability.\n\nFinally, I kind of chuckled at the labeling of Moses as a \"troll trying to pick a fight.\" His only crime was in saying he liked my ideas. I guess it's wrong to disagree with people who disagree. That's fine.\n\n\n\n \n\nI'm confused. You say you want questing ability, but you think Legolas has a 'useless ability'? I think Legolas is a great hero for his exact ability. He's good at taking down enemies AND provides quest progress. Where's the problem there? \n\n \n\nMix it up a little. Try running a Spirit/Lore/Tactics deck with Frodo/Denethor/Legolas. Works out quite well for me on a number of quests. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628036","commentId":628036,"userName":"Boris_the_Dwarf","timestamp":1336511049,"content":"Faradey said:\n\n \n\nBoris_the_Dwarf said:\n\n \n\n Let's clear up a couple of things. First of all, I am not \"a Tactics fan.\" Rather, I am a fan of the idea that I can use ALL of the cards and spheres in the packs and boxes I have bought instead of being relegated to using Spirit and Lore if I want a reasonable chance of winning in solo.\n\nTactics is not a solo-player sphere. It doesn't even mix well with the other spheres for solo play. Anything Tactics can do Lore can do better - and Lore offers healing. I don't know how other people play the game, but the game is about one thing and one thing only: QUESTING. The faster you quest, the faster you win. There may be one or two specific encounters that require certain/all enemies to be defeated, but in general it's about questing. And only Lore and Spirit have the willpower to do that. I am so, so tired of having to slap down Eowyn/Bifur/Dunhere in order to get through a series of quest cards. I've played this game extensively with all the spheres and after 3 months, I don't even look at the tactics sphere cards anymore, unless I have a partner to play with. More often I am running the game on my own, and I will take Bifur and Mirkwood Runner and Infighting over Legolas and Dwarven Axehand and Hail of Stone any day of the week. It's like playing chess - you can knock out every piece but at the end of the game you still have to capture the king. While you are killing my pawns, I will just go ahead and capture your king with 12 of your pieces still on the board.\n\n \n\nSecondly, I don't see how these cards \"kill flavor.\" They are meant to embrace flavor. Tactics strength is in killing enemies but it has ZERO questing ability. Why not enhance that flavor by helping with the actual win condition? Legolas is nice and all but when I'm playing by myself the last thing I want to do is throw down a 9-threat Tactics character with a useless ability.\n\nFinally, I kind of chuckled at the labeling of Moses as a \"troll trying to pick a fight.\" His only crime was in saying he liked my ideas. I guess it's wrong to disagree with people who disagree. That's fine.\n\n\n\n \n\nI'm confused. You say you want questing ability, but you think Legolas has a 'useless ability'? I think Legolas is a great hero for his exact ability. He's good at taking down enemies AND provides quest progress. Where's the problem there? \n\n \n\nMix it up a little. Try running a Spirit/Lore/Tactics deck with Frodo/Denethor/Legolas. Works out quite well for me on a number of quests. \n\n\n\n \n\nStarting here and working backward. \"Useless ability\" meaning \"ranged,\" not his special ability.\n\n@Mighty Jim: I find Tactics to be the weakest sphere, then Leadership, then Lore, then Spirit, in that order (worst to best). Anything Tactics can do Lore can do better. I have said that many times. I'd like to know what kind of decks people are running that include Tactics cards in solo play. Again, IN SOLO PLAY. I tend to run 2-sphere decks, and after playing every scenario at least 3-5 times, I have found the best combo to just be Dunhere/Bofur/Eowyn. Not Frodo. Not Beravor. Not Thalin or Dain or even Gimli. Games with those heroes tend to end with me upping my threat 1-2 points each round, usually watching an ally get tossed to the discard pile after being killed, and then ultimately losing the game because I either couldn't quest for enough points to get NOT BONUS tokens as someone put it (can't remember who) but regular-round tokens. Perhaps I'm missing something about this game, but when the choice is sending 3 people for 6 Willpower and have nothing to block with or 2 people for 8 Willpower and have 3 more to block with, there's something wrong. I suppose I could mix Tactics and Spirit, and have done so in the past, but I'd rather have a 3-cost character that ignores defense ratings than a 3-cost character whose only perk is it can attack enemies engaged with the non-existent second player.\n\nThe kind of player I am is the kind who likes to be able to unwind at the end of a long day with a well-built deck utilizing any sphere of cards. What I have learned about this game is if you don't have high willpower, you will lose - period. Defeat every enemy, but if your threat is racing toward 50 by the time you get there, then what was the point? I am not an \"I must win!\" player but I'd like to think I have better than average odds with any particular, well-built deck (obviously there are bad cards in any card game and this one is no exception). It'd be like sitting down with a blue Magic deck built around the very best it has to offer and having to admit right up front, I can't win. Seriously, who wants to play a game like that? The bigger question becomes - why the heck are they making blue cards if the color can't compete?\n\nThe game is touted as a game for 1 player, but that seems to only be true if you use Lore and Spirit. At least that has been my experience.\n\nFinally, @Dwnhmcntryboy: I'm not offended, and nothing you wrote offended me. There's no right or wrong here. We all have our own opinions about the cards that should be made, and that's fine. I chuckled because someone agreed with me and got called a troll for it. But no one reacted that way to anyone who disagreed with me, and I certainly have no problem with anyone who has a difference of opinion. If I had, I would have written \"Thoughts?\" at the end of my original post.\n\nThat said, the point of my response was to clear up some obviously false impressions about the reason for my posting the ideas. I don't understand why \"point/counterpoint\" is really necessary, and accomplishes nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628142","commentId":628142,"userName":"jhaelen","timestamp":1336532160,"content":"Boris_the_Dwarf said:\n\nAnything Tactics can do Lore can do better. I have said that many times.\n\nRepeating something doesn't make it more true. Tactics is unarguably best at what it is meant to do. And that is defeating enemies and not questing or reducing threat.\n\nBoris_the_Dwarf said:\n\nThe game is touted as a game for 1 player, but that seems to only be true if you use Lore and Spirit. At least that has been my experience.\n\nSo what?\n\nA solo deck _must_ include everything required to deal with all of the different challenges and obstacles quests and the encounter deck might throw against you. It should be obvious that a single sphere cannot deal with everything.\n\nIf every sphere was supposed to have answers to every potential threat why have spheres at all?\n\n \n\nBasically you're complaining that your hammer is useless if you want to drill a hole or screw something together. Well, big surprise there!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628283","commentId":628283,"userName":"Boris_the_Dwarf","timestamp":1336560602,"content":"jhaelen said:\n\nBoris_the_Dwarf said:\n\n \n\nAnything Tactics can do Lore can do better. I have said that many times.\n\nRepeating something doesn't make it more true. Tactics is unarguably best at what it is meant to do. And that is defeating enemies and not questing or reducing threat.\n\n \n\nBoris_the_Dwarf said:\n\n \n\nThe game is touted as a game for 1 player, but that seems to only be true if you use Lore and Spirit. At least that has been my experience.\n\nSo what?\n\n \n\nA solo deck _must_ include everything required to deal with all of the different challenges and obstacles quests and the encounter deck might throw against you. It should be obvious that a single sphere cannot deal with everything.\n\nIf every sphere was supposed to have answers to every potential threat why have spheres at all?\n\n \n\nBasically you're complaining that your hammer is useless if you want to drill a hole or screw something together. Well, big surprise there!\n\n\n\nYeah, if the item I was assembling stated on the box that everything I need to put it together is in the box and there was a hammer but not a drill and I needed to make a hole, yeah I'd be kind of annoyed. \n\nDefeating enemies is not how you win the game. Repeating something doesn't make it more true, but it doesn't make it less true either. Every sphere should provide a way to win scenarios, especially if the box touts the game as playable for one person. No sphere can win on its own in one player, that part I agree with. But no deck with Tactics added to the level that you notice its presence can reasonably win in one player.  (Reasonably meaning 80% of the time.)\n\nI have yet to see where anyone has described how they win running tactics cards in their deck in a solo game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628296","commentId":628296,"userName":"Budgernaut","timestamp":1336561558,"content":"Boris_the_Dwarf said:\n\nI have yet to see where anyone has described how they win running tactics cards in their deck in a solo game.\n\n\n\nI'd like to describe this to you, but first I want to know: what are you looking for exactly? Do you want a play-by-play of every game an individual has played using Tactics? What constitutes a high enough presence for Tactics? One hero is enough, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628331","commentId":628331,"userName":"Boris_the_Dwarf","timestamp":1336564860,"content":"Budgernaut said:\n\n \n\nBoris_the_Dwarf said:\n\n \n\nI have yet to see where anyone has described how they win running tactics cards in their deck in a solo game.\n\n \n\n \n\nI'd like to describe this to you, but first I want to know: what are you looking for exactly? Do you want a play-by-play of every game an individual has played using Tactics? What constitutes a high enough presence for Tactics? One hero is enough, right?\n\n \n\n \n\nJust a general overview would suffice. A play-by-play isn't necessary. What cards do you use when you run Tactics? What sphere do you pair it with? How do you handle the game when your threat goes up round after round after round and no matter what you do to get ahead by knocking out the enemies of the staging area, you still lose because your threat hits 50 before you can do anything about it?\n\nThat is the biggest problem I have with the game, and not just in Tactics. I have tried running a variety of heroes in her place, and tried running sets of heroes in other spheres, but I can't seem to solo without Eowyn's  4/5 willpower and do well. If I tie or miss a single round and she's not on the team, I am screwed. I just fall further and further behind. Even with her on the team, it's easy to get overwhelmed and never come back from that, but it's almost a certainty without her.\n\nI'm less concerned about the heroes a pro-Tactics player would choose and more interested in what cards you toss into the deck. If you are running Tactics completely as tertiary support (meaning you have a 3-color/sphere deck and Tactics is just there to splash attachments and events). well that's not really what I would call using Tactics as a core part of the deck. Let me walk you through my deck as it stands currently (as best I can from memory);\n\nHeroes - Dunhere/Eowyn/Bifur  Starting threat is 24. Dunhere and Eowyn give me 2 spirit every round. Bifur can get 2 if he needs.\n\nAllies: \n\nArwen Undomiel x3 (Duh)\n\nGandalf x3 (Double Duh)\n\nGleowine x2 (Engine)\n\nMiner of the Iron Hills x1 (For that nasty condition)\n\nWest Road Traveller x3 (To switch good locations with bad ones without suffering the travel effect)\n\nProtector of Edoras x3 (The guy who gives 4 willpower and then dies; not sure about his name)\n\nHenamarth x2\n\nNorthern Tracker x2 (Location control)\n\nGildor Inglorion x2 (Additional Noldor character, helps with draw or quest or combat)\n\nMirkwood Runner x3 (Excellent combatant, or quester in a pinch)\n\n \n\nEvents\n\nElrond's Counsel x2 (Threat reducer/willpower increaser)\n\nGreetings of the Galadhrin x3 (More threat reduction)\n\nInfighting x3 (Damage the easy to kill high HP guy, then move it to the tough to kill monster sitting in the staging area)\n\nTest of Will x3 (Because \"When Revealed\" effects suck)\n\nHasty Stroke x3 (Because shadow effects usually suck)\n\nStand and Fight x3 (Retrieves cheap allies who died during the game - it rocked when you could grab Gandalf, but it's still decent)\n\nDwarven Tomb x2 (To get Tests of Will or Elrond's Counsels or Stand and Fights back in my hand; the card just keeps getting better and better)\n\nLore of Imladris x3 (I used to use Daughter of the Nimrodel, but I like this better because sometimes its nice to be able to heal more than just heroes)\n\n \n\nAttachments\n\nProtector of Lothrien x2 (This card wins games frequently)\n\nBurning Brand x2 (Bifur and/or Gildor stop shadow effects)\n\n \n\nI think that's everything. I run exactly 50 cards in my deck. The idea of it is to keep my threat low enough for as long as possible so that Dunhere can hit enemies in the staging area. Once the Mirkwood Runner is on the table, I use Bifur to block and then the Runner cuts the enemy down by 2 until it is dead. Infighting helps spread Dunhere's damage around. I'll cut on something like a Marsh Adder for up to 6 damage, and then Infighting it over to a Hill Troll. Then it's just a matter of fighting it or throwing Gandalf's damage at it.\n\nI do keep a \"sideboard\" of sorts now for specific quests, but I don't change out cards all that often if I can avoid it. I might drop the one Miner of the Iron Hills for a Haldir (ranged guy that costs 4) if ranged is important, or a third Northern Tracker in a location heavy encounter like Hills of Emyn Muil."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628344","commentId":628344,"userName":"Cotillion37","timestamp":1336566121,"content":"Heroes:\nEowyn, Frodo, Legolas\n\nAllies:\nEscort From Edoras\nRidermark's Finest\nLorien Guide\nNorthern Tracker\nVassal of the Windlord\nGondorian Spearman\nVeteran Axehand\nWinged Guardian\nGandalf\n\nAttachments:\nAncient Mathom\nUnexpected Courage\nHorn of Gondor\nBlade of Gondolin\n\nEvents:\nTest of Will\nGaladhrim's Greetings\nHasty Stroke\nFeint\nQuick Strike\n\n \n\nI've been using this deck lately with moderate success. I have yet to use any of the Khazad-Dum and Dwarrowdelf cycle cards, which I'm sure will change the way my deck looks.\n\nAll my Tactics cards cost either 1 or 2 resources, which makes it easy to get out a ton of allies. Once I get out a Tactics ally, I'll quest with Frodo. Depending on what cards I have in my hand is what determines who I put Horn of Gondor on, and the eagle allies have a discard from play response after they attack (Vassal) or defend (Winged Guardian) which helps generate resources, though I usually throw it on Frodo to generate more Spirit resources since I want to get more northern trackers out.\n\nI would use this deck against some of the more location/questing heavy scenarios, though I'm sure it would fair well against something like Journey Down the Anduin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628351","commentId":628351,"userName":"Cotillion37","timestamp":1336566587,"content":"**** the inability to edit posts (that I know of). I'm playing around with the idea of getting rid of the Lorien Guides, since I barely use them, and replacing them with Support of the Eagles. Costs 3, but can make Legolas a total beast with 6 attack or 5 defense if I have Vassal and Winged Guardian out.\n\nedit: Figured it out…though I'm not sure why I couldn't see the edit button on my previous post until I made the second post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628397","commentId":628397,"userName":"player2052423","timestamp":1336570587,"content":"Dwnhmcntryboy said:\n\nMoses, you are coming off as a troll just trying to start fights. There is no need for that. I appreciate the OP thread as it is showing his interest in the game. He is trying to address known issues and Kudos for him. All I was attempting to do was show him the error of his thinking and put him on the right track. He is a Tactics fan, GREAT, but everything revealed so far for tactics has not addressed Threat management but Enemy and to a lesser degree Quest management.\n\nReferring to me as a troll in any way is totally inappropriate and quite frankly,  is a reportable offense.  I disagreed with you, period.  I did not disparage your opinions in any way.  Your welcome to your opinion as I am entitled to mine. \n\nTake a moment to read what you wrote above.  You feel that the OP needs to shown the error in his thinking and be put on the right track?  Get over yourself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628410","commentId":628410,"userName":"Budgernaut","timestamp":1336572288,"content":" I'll try to reconstruct decks I've used previously, but here's an example off the top of my head. For threat management, my favorite game was the three hunters (Aragorn, Legolas, Gimli). Aragorn got Steward of Gondor and Song of Battle while Legolas got Horn of Gondor. I would Sneak Attack Gandalf in for threat reduction during the resource phase, then pay for him with my resources during the planning phase with Born Aloft. I could discard Born Aloft before the end of the round to get Gandalf back, all the while generating resources with Horn of Gondor. I only have one Core set, but if you had 3 Sneak Attacks, you could play Gandalf 9 times in a game, decreasing threat by 45.\n\nI will grant that this is dependent on drawing the right cards. I had Spirit Splashed with Aragorn and Celebrian's Stone so that I had Ancient Mathom and also had Valiant Sacrifice (worked with Gandalf) to increase card draw. The other Spirit cards were two Galadhrim's Greetings and one Unexpected Courage.\n\nI think it had about a 50-66% win ratio. I know, that sucks to a lot of people. But I had soooo much fun playing this deck, it didn't matter to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628465","commentId":628465,"userName":"Dwnhmcntryboy","timestamp":1336578061,"content":"Moses2813 said:\n\n \n\nDwnhmcntryboy said:\n\nMoses, you are coming off as a troll just trying to start fights. There is no need for that. I appreciate the OP thread as it is showing his interest in the game. He is trying to address known issues and Kudos for him. All I was attempting to do was show him the error of his thinking and put him on the right track. He is a Tactics fan, GREAT, but everything revealed so far for tactics has not addressed Threat management but Enemy and to a lesser degree Quest management.\n\n \n\nReferring to me as a troll in any way is totally inappropriate and quite frankly,  is a reportable offense.  I disagreed with you, period.  I did not disparage your opinions in any way.  Your welcome to your opinion as I am entitled to mine. \n\nTake a moment to read what you wrote above.  You feel that the OP needs to shown the error in his thinking and be put on the right track?  Get over yourself.\n\n \n\n \n\n \n\nAll of your posts have added nothing to the conversation and only attacked the poster. You attacked my post in an ,assumed, attempt to de-evaluate anything I had said.\n\nYou then,IMO, attacked Big Jim needlessly about his, disparaging remark. Yet still not adding anything of benefit to the OP that pertained to his thread.\n\nNow this. Once again you derail the topic just to make a point and add nothing to the original.\n\nStay on topic and address the topic. Try to help Boris out instead of all of this extra crap. That is what I mean when I say, \"You are coming off as a troll.\"\n\n \n\nBoris, I can have a deck list for you to try in a bit if you like it is Tactics heavy focusing on dwarves. I built it to compliment the posted Dwarf Deck from FFG but it has shown some promise as a solo deck on it's own. I am also working on a Secrecy deck using Boromir. but it is still early to do anything with.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628549","commentId":628549,"userName":"Boris_the_Dwarf","timestamp":1336594101,"content":"Dwnhmcntryboy said:\n\n Boris, I can have a deck list for you to try in a bit if you like it is Tactics heavy focusing on dwarves. I built it to compliment the posted Dwarf Deck from FFG but it has shown some promise as a solo deck on it's own. I am also working on a Secrecy deck using Boromir. but it is still early to do anything with.\n \n\n\n\n \n\nI'd like to see what you came up with. I'll try it out. You're right, by the way - 50% win ratio sucks. I need better rates than that for the time I am killing playing the game. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628636","commentId":628636,"userName":"player2052423","timestamp":1336606399,"content":"Finally got to proxy two of your concept cards.  I loved the Arwen and even drew her finally.  I liked The Art of War as well.  For me, it was fun to use the new cards. \n\nIf you ever do this again, put me on the PM list.  I can avoid getting called names and you do not have to spend a bunch of  time defending your ideas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628645","commentId":628645,"userName":"player2052423","timestamp":1336607107,"content":"Dwnhmcntryboy said:\n\nAll of your posts have added nothing to the conversation and only attacked the poster. You attacked my post in an ,assumed, attempt to de-evaluate anything I had said.\n\nYou then,IMO, attacked Big Jim needlessly about his, disparaging remark. Yet still not adding anything of benefit to the OP that pertained to his thread.\n\nNow this. Once again you derail the topic just to make a point and add nothing to the original.\n\nStay on topic and address the topic. Try to help Boris out instead of all of this extra crap. That is what I mean when I say, \"You are coming off as a troll.\"\n\nPlease, you need to calm down.  I attacked no one.  I disagreed with you and Big Jim and felt the OP had put together 5 cards that were right on the mark.  That is on topic and I do not feel that I have to \"help out\" or \"set the OP on the right track\".  The OP has stated this to you as well.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628667","commentId":628667,"userName":"Cotillion37","timestamp":1336611343,"content":"Moses2813 said:\n\nDwnhmcntryboy said:\n\nAll of your posts have added nothing to the conversation and only attacked the poster. You attacked my post in an ,assumed, attempt to de-evaluate anything I had said.\n\n \n\nYou then,IMO, attacked Big Jim needlessly about his, disparaging remark. Yet still not adding anything of benefit to the OP that pertained to his thread.\n\nNow this. Once again you derail the topic just to make a point and add nothing to the original.\n\nStay on topic and address the topic. Try to help Boris out instead of all of this extra crap. That is what I mean when I say, \"You are coming off as a troll.\"\n\n \n\nPlease, you need to calm down.  I attacked no one.  I disagreed with you and Big Jim and felt the OP had put together 5 cards that were right on the mark.  That is on topic and I do not feel that I have to \"help out\" or \"set the OP on the right track\".  The OP has stated this to you as well.  \n\n\n\nThe cards aren't right on the mark though. One of the cards is to reduce threat for playing allies…how is that logical? The more allies you have, the bigger your party, the more noise you make, etc etc. If anything, that card should have been \"If you play no allies this round, lower your threat by 3.\"\n\nThe Arwen card is also not on the mark. It forces you to play with 2 heroes to start. Sure, secrecy is awesome. But then you may or may not luck in to drawing her, and having to raise your threat by 6 basically negates the whole idea of running a secrecy deck in the first place. It also has no hitpoints on it, but since it's 6 threat, 3WP and 2D, I'm going to assume she has 1 hitpoint in following with every other card (with the exception of Bilbo, whose threat is 1 higher than the totals on his card). She is frail and absolutely not worth it.\n\nThe Art of War is also meh. I like the reducing threat for killing an enemy, but the putting a progress token on the quest needs to go as that completely negates the need for Blade of Gondolin. It shouldn't have both the ability to give quest progress and threat reduction. That makes it a no brainer to use. If it was a restricted attachment that only reduced threat, that makes the player think about whether he should play Blade of Gondolin or the Art of War.\n\nAnd finally Fearless Leadership. Completely broken card. Killing enemies with Tactics is already pretty trivial, why make it even easier by allowing them to kill everything before it ever engages the player? It's not fun and completely ruins the fun factor of having to decide who to defend/attack with and how best to quickly kill off engaged enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=628676","commentId":628676,"userName":"jhaelen","timestamp":1336615481,"content":"Boris_the_Dwarf said:\n\nEvery sphere should provide a way to win scenarios, especially if the box touts the game as playable for one person.\nWhy do you think so? What does one thing have to do with the other? The box says it's a game for 1-2 players.\n\nJust because _you_ want every scenario to be winnable with any kind of deck you may come up with doesn't mean that it would be a good idea.\n\nI've mentioned many times that I feel the game doesn't work particularly well solo. It's also true that the Tactics sphere is a bit of a 'trap' for players new to the game. But what you're proposing would be the death of the game, imho: Making every sphere alike is a bad, bad, bad, idea!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=629005","commentId":629005,"userName":"Boris_the_Dwarf","timestamp":1336660065,"content":"Cotillion37 said:\n\nMoses2813 said:\n\n \n\nDwnhmcntryboy said:\n\nAll of your posts have added nothing to the conversation and only attacked the poster. You attacked my post in an ,assumed, attempt to de-evaluate anything I had said.\n\n \n\nYou then,IMO, attacked Big Jim needlessly about his, disparaging remark. Yet still not adding anything of benefit to the OP that pertained to his thread.\n\nNow this. Once again you derail the topic just to make a point and add nothing to the original.\n\nStay on topic and address the topic. Try to help Boris out instead of all of this extra crap. That is what I mean when I say, \"You are coming off as a troll.\"\n\n \n\nPlease, you need to calm down.  I attacked no one.  I disagreed with you and Big Jim and felt the OP had put together 5 cards that were right on the mark.  That is on topic and I do not feel that I have to \"help out\" or \"set the OP on the right track\".  The OP has stated this to you as well.  \n\n \n\n \n\nThe cards aren't right on the mark though. One of the cards is to reduce threat for playing allies…how is that logical? The more allies you have, the bigger your party, the more noise you make, etc etc. If anything, that card should have been \"If you play no allies this round, lower your threat by 3.\"\n\nThe Arwen card is also not on the mark. It forces you to play with 2 heroes to start. Sure, secrecy is awesome. But then you may or may not luck in to drawing her, and having to raise your threat by 6 basically negates the whole idea of running a secrecy deck in the first place. It also has no hitpoints on it, but since it's 6 threat, 3WP and 2D, I'm going to assume she has 1 hitpoint in following with every other card (with the exception of Bilbo, whose threat is 1 higher than the totals on his card). She is frail and absolutely not worth it.\n\nThe Art of War is also meh. I like the reducing threat for killing an enemy, but the putting a progress token on the quest needs to go as that completely negates the need for Blade of Gondolin. It shouldn't have both the ability to give quest progress and threat reduction. That makes it a no brainer to use. If it was a restricted attachment that only reduced threat, that makes the player think about whether he should play Blade of Gondolin or the Art of War.\n\nAnd finally Fearless Leadership. Completely broken card. Killing enemies with Tactics is already pretty trivial, why make it even easier by allowing them to kill everything before it ever engages the player? It's not fun and completely ruins the fun factor of having to decide who to defend/attack with and how best to quickly kill off engaged enemies.\n\n\n\nHitting this point by point:\n\n\"One of the cards is to reduce threat for playing allies… how is that logical?\" \n\nIt's logical in the same sense that you have to have a big party to overcome staging threat totals as rounds progress. Otherwise, your threat goes up. If all you ever have are three herores, then yeah they may make \"less noise\" but they are also race to the line of defeat.\n\nFearless Leadership isn't broken, it just gives the Tactics sphere what it needs in a way that (IMHO) is in flavor with the concept of that sphere - the ability to defeat enemies quickly so that the heroes and allies can quest. Quest = progress tokens = cleared stages = victory vs. the inability to defeat enemies = rapidly increasing threat = defeat. Look at the other cards in the sphere and then explain to me realistically how this isn't in flavor.\n\nI also fail to see how these suggestions destroy flavor, and no one who has claimed that has offered to answer that question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=629039","commentId":629039,"userName":"Bohemond2","timestamp":1336662130,"content":"Without getting into the specific (I share many of the concerns about these cards expressed early in the set) about the rules of the cards, I wanted to make a brief point about the names.\n\nYou can not have a card in one sphere that uses the name of another sphere in its design.  Having a Tactics card called 'Fearless Leadership' is incredibly confusing.  Change the title!\n\nI am not a Tolkien expert by any means, but the  'Art of War' (which I see as the most playable of the five cards) evokes images of Chinese military philosophy in my head, rather than ents, elves, dwarves or the armies of mordor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=629055","commentId":629055,"userName":"Dwnhmcntryboy","timestamp":1336663533,"content":" Just wanted to point out that the Arwyn \"Hero\" in your deck would be completely neutered by the Arwyn Ally and Objective cards should they be in play before your hero came up.\n\nI think the above best illustrates why all spheres should not be able to do all things. LotR is a game where you have to constantly change your deck based on scenario. IMO it is best to have a core deck Idea, like playing a  Tactics based deck, with what is commonly known as a side board. This game is meant for players to collaborate to build decks to defeat scenarios. It is not in the spirit of the game to have 1 sphere or deck be able to do all things. That is where I see the failing of so many of your cards. They break that spirit of the game and thus the mechanics.\n\nAll except your last card. I do like it I think tweeks are in order for it but it definitely fits the Tactics theme."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63940-5-cards-that-need-to-be-made/?do=findComment&comment=629242","commentId":629242,"userName":"Cotillion37","timestamp":1336683662,"content":"Boris_the_Dwarf said:\n\n \n\nHitting this point by point:\n\n\"One of the cards is to reduce threat for playing allies… how is that logical?\" \n\nIt's logical in the same sense that you have to have a big party to overcome staging threat totals as rounds progress. Otherwise, your threat goes up. If all you ever have are three herores, then yeah they may make \"less noise\" but they are also race to the line of defeat.\n\nFearless Leadership isn't broken, it just gives the Tactics sphere what it needs in a way that (IMHO) is in flavor with the concept of that sphere - the ability to defeat enemies quickly so that the heroes and allies can quest. Quest = progress tokens = cleared stages = victory vs. the inability to defeat enemies = rapidly increasing threat = defeat. Look at the other cards in the sphere and then explain to me realistically how this isn't in flavor.\n\nI also fail to see how these suggestions destroy flavor, and no one who has claimed that has offered to answer that question.\n\n\n\nYour Tactics cards ruin flavour because quest progression/threat reduction is not the strength of the sphere - brute strength and killing enemies is.\n\nThe whole point of having the Fellowship capped at nine people was so that they didn't draw attention to themselves when taking the ring to Mordor. Sure maybe it would have been easier to race to Mordor with an army, but it would be guaranteed that an army would oppose them when they got there. Playing more allies to lower threat is just ludicrous as it draws more attention to your party from a logical perspective. Yeah, it is possible to get out a lot of allies with Tactics, but you're also going to be wasting a resource to play that card, meaning potentially one less ally to play. Nothing about that card makes any sort of sense. It would be far better if the effect was to lower your threat by not playing allies that round (something that you can do once you already have enough allies out and don't need to play more, which will be a number of turns in to the game when you are going to need the threat reduction). You're also going to have to save resources to play enough allies to make the threat reduction worth it, so you're going to have college funds for your children on your Tactics heroes. It hinders you in the turns prior simply because you won't have enough allies out for potential threats because you're saving to play allies and your Last Alliance card (so the threat reduction effect is greater).\n\nAnd Fearless Leadership is broken.  Playing the game is going to be a complete joke with that card because enemies are all going to be dead before you get a chance to engage them. And it's an attachment, meaning you can do it every single turn. It's also not restricted, meaning you could have a Rivendell Blade and Rivendell Bow on your hero for massive damage. You would never have to engage and defend against enemies, which ruins all the fun of playing the Tactics sphere. Sure it has the chance of making me win faster, but it's at the cost of fun. Someone else suggested that it be an event instead of an attachment, and I find that far more reasonable.\n\n \n\nI respect your opinions about the cards, but I'm glad you're not designing the game as you would likely ruin my favourite sphere if these cards were included without massive changes. I realize you don't think that Tactics is a viable sphere solo, hence your ideas for these cards, but Tactics is perfectly viable solo and I have no issues powering my way through quests with the Spirit/Tactics deck I posted earlier in this thread."}]}