{"url":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/","title":"Sneaking? More like Sprinting past the Watcher in the Water…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625167","commentId":625167,"userName":"RedGiant","timestamp":1335975077,"content":" I've been playing through The Watcher in the Water quite a bit over the last few days and while I really like the art, flavor, and mechanics of the new scenario, I really feel like it does have certain flaws that make it prone to being too easy. \n\n-You can discard an unlimited amount of cards to pass the Doors of Durin. Phase two will only last one turn in all but the most unusual of circumstances, so it doesn't make sense to NOT discard your entire deck. \n\n-You don't have to defeat any enemies. Tentacles can beat on you all day as long as you can survive 1 or 2 rounds of attacks, you can simply willpower overload your way to victory. Frodo's ability is key in taking damage from attacks or from the Watcher's triggered ability. \n\nThis is a problem because you can simply stack willpower up the wazoo and literally sprint by the Watcher. For my solo deck, I have been using Mono spirit with Eowyn, Frodo, and Eleanor. Throw in as many of the 2 cost allies with high will power (West Road, Arwen, Escort for Edoras, Riddermarks Finest, Eomer…) along with certain events (Stand and Fight, Test of Will, Hasty Stroke, Shadow of the Past, Astonishing Speed), and you have got yourself a deck that can pretty much never lose, as long as you throw in a couple cards that contain the right letters and can also help with Willpower (Bofur, Gandalf, The Galadrim's Greeting)\n\nWith Eowyn, Frodo, and multiple allies questing, there should be no problem beating phase 1 in 2 turns. Once you are on phase 2, simply discard your entire hand so that at least one of the cards matches the encounter deck. Hopefully you have a Stand and Fight, so you can summon an Escort from Edoras, but even if you don't, it shouldnt be too hard to make 5 progress to beat the quest. Use Frodo's ability to take the Watchers 3 damage, or simply kill off Eleanor since there really aren't any truly bad treacheries in this deck and you won't need to defend once you've won the scenario. \n\nThematically, I understand that to kill the Watcher should be much harder to beat the scenario than to simply pass the door, but I wish there was some additional mechanical reason to engage the Watcher.\n\nThis will also work for two player- I've been using a Mono Leadership deck with Prince Imrahil, Aragorn, and Theodred to go with the mono spirit from before.  Simply power quest your way to victory, Imrahil and Aragorn can ready themselves enough to defend the attacks as necessary from tentacles, wargs, and uruks. The only way I have real problems is if A Bitter Wind comes up during set up. \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625170","commentId":625170,"userName":"SiCK_Boy","timestamp":1335975727,"content":" You discard from your hand to pass the door, not from your deck. Maybe that's why you find it so easy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625174","commentId":625174,"userName":"guciomir","timestamp":1335975987,"content":"What is your chance of opening the doors? I play localized version of the game and , unless I build the deck so letters match, the chance for opening the doors is pretty low, even when I discard my whole hand. This is why guestting password is not a valid tactic for me. Instead I have to fight Watcher (with opening the doors being just a distant option)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625175","commentId":625175,"userName":"starhawk77","timestamp":1335976477,"content":"The action on Doors of Durin is also limited to once per round, so you'll have to get pretty lucky even if you do discard your entire hand. Henamarth/Rumour From the Earth are the best options, otherwise it's basically just a crapshoot. Some letters give you a better chance than others, but I don't think you can devise a consistent strategy around the Doors unless you incorporate some form of encounter deck control. \n\nI actually really enjoy the alternate routes to victory. That way, both combat-oriented decks and heavy questing builds stand a chance. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625180","commentId":625180,"userName":"leptokurt","timestamp":1335977062,"content":"I begin to hate this scenario. It's one of these lottery adventures - either you draw no tentacles or you can defeat them in one round, in which case the game is an easy win, or these tentacles stay in the game, in which case you're doomed.\n\nThe bad thing is that I don't have any control over these tentacle forced effects. Only Feint and Forest Snare can prevent them from happening. Especially the tentacle that attacks you undefendended with 4 attack can eliminate your heroes in a blink of an eye.\n\nSo far my win ratio is 3-3, but the victories don't feel deserved and more luck dependened.\n\n \n\nQuestion: the tentacle that gives you three points damage when you attack it, will it still be destroyed when you draw a tentacle/shadow effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625182","commentId":625182,"userName":"RedGiant","timestamp":1335977112,"content":" Sick Boy is actually absolutely right, I misread the card entirely as 'deck' instead of hand. Back to the drawing board on that one! Feeling pretty dumb, but at the same time happy that it wasn't as easy as I originally thought. \n\nI still think my deck would work with some jumbling to only include cards are letter specific. \n\nThe stats for the encounter deck are as follows:\n\n8 S's\n\n7 B's\n\n6 T's W's\n\n5 M's\n\n4 G's \n\n3 D's\n\n2 P's\n\n1 I, 1 K\n\n \n\nTaking the idea of high will power and then including S T B W M G cards would I think give a relatively favorable winning %\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625187","commentId":625187,"userName":"starhawk77","timestamp":1335977747,"content":"leptokurt said:\n\nQuestion: the tentacle that gives you three points damage when you attack it, will it still be destroyed when you draw a tentacle/shadow effect?\n\n\n\nNo. It instructs you to deal the damage from the attack to a friendly character; it doesn't say \"deal an equal amount of damage\" or \"also deal the damage.\" There's one chunk of attack strength, and it will either kill the tentacle or be reflected back at the attacking player. Also note that the damage can be dealt to ANY character controlled by the attacking player, not just one of the attacking characters. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625192","commentId":625192,"userName":"leptokurt","timestamp":1335978971,"content":"starhawk77 said:\n\nleptokurt said:\n\n \n\nQuestion: the tentacle that gives you three points damage when you attack it, will it still be destroyed when you draw a tentacle/shadow effect?\n\n \n\n \n\nNo. It instructs you to deal the damage from the attack to a friendly character; it doesn't say \"deal an equal amount of damage\" or \"also deal the damage.\" There's one chunk of attack strength, and it will either kill the tentacle or be reflected back at the attacking player. Also note that the damage can be dealt to ANY character controlled by the attacking player, not just one of the attacking characters. \n\n \n\n\n\n \n\nI feared that.\n\n \n\nOh Gandalf, had you known that becoming a wizard meant to kill slippery slimy tentacles all the time…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625217","commentId":625217,"userName":"Titan","timestamp":1335981410,"content":"From my still limited experience playing this quest, it seems to me that the best way to win this scenario is to slow down the questing a bit on the first quest card, Carrock style, while you build up some resources. Then, blitz The Watcher when he comes into play and quest all out for the victory. There's no need to even bother with the Doors because all you need are 3 victory points which The Watcher provides. \n\nI do, however, find this to be rather odd thematically. You could run away from The Watcher and still enter the mines. But how do you ignore the Doors and still get in? I understand that, in practical terms, the Doors cannot be a requirement as it's effect could endlessly frustrate players and grind an otherwise won game to a halt, but I think that something should have been done so that the Doors were a requirement.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625219","commentId":625219,"userName":"leptokurt","timestamp":1335981463,"content":"I don't get why they first tell us the secrecy mechanic is such a great new way to play this game and that WitW has all the cool cards (incl. Loragorn) that we needto play this game in secrecy mode - and give us an adventure that you absolutely don't want to play with only two heroes.\n\nHow am I supposed to sneak around the Watcher when the tentacles have threats of 12 and 18? If I'd use Loragorn as one of my heroes, the tentacles would be able to attack me right from the start. As I need leadership to play the blade and to use the secrecy cards of that sphere, I won't have spirit to lower my threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625222","commentId":625222,"userName":"leptokurt","timestamp":1335981653,"content":"Titan said:\n\nFrom my still limited experience playing this quest, it seems to me that the best way to win this scenario is to slow down the questing a bit on the first quest card, Carrock style, while you build up some resources. Then, blitz The Watcher when he comes into play and quest all out for the victory. There's no need to even bother with the Doors because all you need are 3 victory points which The Watcher provides. \n\nI do, however, find this to be rather odd thematically. You could run away from The Watcher and still enter the mines. But how do you ignore the Doors and still get in? I understand that, in practical terms, the Doors cannot be a requirement as it's effect could endlessly frustrate players and grind an otherwise won game to a halt, but I think that something should have been done so that the Doors were a requirement.\n\n \n\n\n\nThe idea is that while you're fighting tentacles you don't have much time to open the door. However, once the Watcher is defeated your fellowship can take all the time of the world to find the right password."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625272","commentId":625272,"userName":"SiCK_Boy","timestamp":1335989703,"content":"I've had the adventure for a few days now, but haven't tried it yet.\n\nOne thing I hope we'll see at some point for a player card is an effect that can cancel a \"forced\" effect. I'm thinking about something similar to the card \"Stiffle\" in Magic: the Gathering.\n\nThat tentacle dealing 4 points of automatic damage is a beast. Very similar to Hummerhorns in that it's almost an auto-hero-kill, but much worse since at least, with Hummerhorns, you can leave it in staging for a while before engaging…\n\nEither that, or damage prevention effects (similar to Frodo's effect in that you can \"cancel\" damage); right now we only have healing, which you can only use if you survive the damage in the first place…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625280","commentId":625280,"userName":"starhawk77","timestamp":1335991450,"content":"Yeah, all of the tentacles are pretty unpleasant. Hail of Stones is fantastic for eliminating the really problematic ones, but it always seems like a bit of a waste to take out an enemy with such limited defensive capabilities (especially since you'll likely need that direct damage to kill The Watcher). \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625334","commentId":625334,"userName":"leptokurt","timestamp":1336007709,"content":"starhawk77 said:\n\nYeah, all of the tentacles are pretty unpleasant. Hail of Stones is fantastic for eliminating the really problematic ones, but it always seems like a bit of a waste to take out an enemy with such limited defensive capabilities (especially since you'll likely need that direct damage to kill The Watcher). \n\n \n\n\n\nAnd you need three characters that you can exhaust.\n\n \n\nI once defeated one of them with Swift Strike + Gondorian Spearman. Quick Strike and Feint can also safe your live, and Landroval might bring back one of your heroes in case everything else didn't work. I've played my last games with tactics and won 50 percent of my games. Gimli, Boromir and (old) Aragorn are hard to kill. The main problem with this deck is the lack of WP and the high starting threat. As I use Gandalf most of the time to kill tentacles or wargs I'm not able to lower my threat at any point of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625485","commentId":625485,"userName":"The_Fallen_Arises","timestamp":1336040747,"content":" Denethor can be a beast in this quest…especially if you're lucky enough to have A Burning Brand, Unexpected Courage and Arwen Undomiel in play. That, and his ability really shines since you can dig into the encounter deck to have better chances of finding a card that matches one in your hand, especially with Henamarth (use Denethor, put card on the bottom, use Henamarth). Also, Shadow of the Past totally rocks. If the top discarded Encounter card fits one of the cards in your hand, simply play Shadow of the Past, and then calmly discard the right card. Plus. it begins with an S, the most Frequent letter encountered in this quest AND it's neutral, so multi-sphere is never an issue.\n\nFrankly, I am quite glad to finally see that card have a crucial use in one of the Quests, always wanted to play it. :-p As for Door VS Watcher, I say run for the door : it's easier if you have the right tools, especially in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625921","commentId":625921,"userName":"Titan","timestamp":1336122134,"content":"The_Fallen_Arises said:\n\n Denethor can be a beast in this quest…especially if you're lucky enough to have A Burning Brand, Unexpected Courage and Arwen Undomiel in play. That, and his ability really shines since you can dig into the encounter deck to have better chances of finding a card that matches one in your hand, especially with Henamarth (use Denethor, put card on the bottom, use Henamarth). Also, Shadow of the Past totally rocks. If the top discarded Encounter card fits one of the cards in your hand, simply play Shadow of the Past, and then calmly discard the right card. Plus. it begins with an S, the most Frequent letter encountered in this quest AND it's neutral, so multi-sphere is never an issue.\n\nFrankly, I am quite glad to finally see that card have a crucial use in one of the Quests, always wanted to play it. :-p As for Door VS Watcher, I say run for the door : it's easier if you have the right tools, especially in multiplayer.\n\n\n\n\n \n\nUsing Shadow of the Past is a pretty clever strategy, though if you already have Denethor/Henamarth, you could certainly achieve it with their effects, as well. Come to think of it, I have a deck that uses them and Rumor From The Earth liberally, so with that deck, I will probably go for the Door while avoiding The Watcher. The more combat oriented one that I've used so far, has a more straightforward approach, so The Watcher is probably the best bet there. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=625943","commentId":625943,"userName":"The_Fallen_Arises","timestamp":1336125489,"content":"Titan said:\n\nThe_Fallen_Arises said:\n\n \n\n Denethor can be a beast in this quest…especially if you're lucky enough to have A Burning Brand, Unexpected Courage and Arwen Undomiel in play. That, and his ability really shines since you can dig into the encounter deck to have better chances of finding a card that matches one in your hand, especially with Henamarth (use Denethor, put card on the bottom, use Henamarth). Also, Shadow of the Past totally rocks. If the top discarded Encounter card fits one of the cards in your hand, simply play Shadow of the Past, and then calmly discard the right card. Plus. it begins with an S, the most Frequent letter encountered in this quest AND it's neutral, so multi-sphere is never an issue.\n\nFrankly, I am quite glad to finally see that card have a crucial use in one of the Quests, always wanted to play it. :-p As for Door VS Watcher, I say run for the door : it's easier if you have the right tools, especially in multiplayer.\n\n \n\n\n \n\n \n\nUsing Shadow of the Past is a pretty clever strategy, though if you already have Denethor/Henamarth, you could certainly achieve it with their effects, as well. Come to think of it, I have a deck that uses them and Rumor From The Earth liberally, so with that deck, I will probably go for the Door while avoiding The Watcher. The more combat oriented one that I've used so far, has a more straightforward approach, so The Watcher is probably the best bet there. \n\n\n\n \n\nIndeed, but it pays to be careful, especially with the Watcher breathing down your neck ! ;-) Scrying is useful alone, but with all those Encounter Cards going to the discard pile (Shadow cards especially) it would be a shame to pass it up. That, and in multiplayer, Denethor is still good but becomes less so as you add more players into the mix.But you are right, Scrying is one of the game-changers of this quest. And thanks for the comment ! :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=640882","commentId":640882,"userName":"RGun","timestamp":1338945165,"content":"What are people's win %'s on this quest?  I've just started playing it in the last week or so and find it quite difficult…it took me 6 plays to finally get past the first quest card and after 10 plays I have only a 30% win percentage which is lower than I usually have for quests with difficulty level 5.  I would rate this one as more like a difficulty level 6 and the Redhorn Gate more as a 5.  I do quite like it though and find it to be one of the more thematic quests.  I'm playing with 1 core set and all of the cards up to this adventure pack so not sure if that makes much difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=640912","commentId":640912,"userName":"richsabre","timestamp":1338952548,"content":"RGun said:\n\nWhat are people's win %'s on this quest?  I've just started playing it in the last week or so and find it quite difficult…it took me 6 plays to finally get past the first quest card and after 10 plays I have only a 30% win percentage which is lower than I usually have for quests with difficulty level 5.  I would rate this one as more like a difficulty level 6 and the Redhorn Gate more as a 5.  I do quite like it though and find it to be one of the more thematic quests.  I'm playing with 1 core set and all of the cards up to this adventure pack so not sure if that makes much difference.\n\n\n\nfind this one easier than the other two dwarrowdelf with a much higher win rate than the other two- my solo win rate is never high anyways but id have to say around 60%"},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=642881","commentId":642881,"userName":"Dam the Man","timestamp":1339407237,"content":"Finally got around to playing Watcher. First game, got to the second stage with a hand of mostly cards that started with the same letter, not much help. Took about three turns to get the blood Doors open, even with Denethor in full swing. Second game, overkilled a bit. Thanks to two Treacheries on the last turn of stage 1, was able to engage the Watcher, threw a meatshield at it, then Brand, Boromir, Landroval, Gandalf and Dwalin with 2x Dwarven Axe smacked the Watcher with 19 attack. Staging area still empty, for kicks played Henamarth, saw Grasping Tentacle on top and tossed Gandalf from hand to open the Doors as well.\n\nMountain Wargs were a real pain here, both games had a Warg hang around from around turn 2 onwards, always getting no Shadow Effect, it was starting to piss me off. So many Tentacles that have no Shadow Effect, seemed like many more non-SE cards than in RHG or RtR."},{"commentUrl":"https://community.fantasyflightgames.com/topic/63961-sneaking-more-like-sprinting-past-the-watcher-in-the-water%E2%80%A6/?do=findComment&comment=643017","commentId":643017,"userName":"leptokurt","timestamp":1339422166,"content":"RGun said:\n\nWhat are people's win %'s on this quest?  I've just started playing it in the last week or so and find it quite difficult…it took me 6 plays to finally get past the first quest card and after 10 plays I have only a 30% win percentage which is lower than I usually have for quests with difficulty level 5.  I would rate this one as more like a difficulty level 6 and the Redhorn Gate more as a 5.  I do quite like it though and find it to be one of the more thematic quests.  I'm playing with 1 core set and all of the cards up to this adventure pack so not sure if that makes much difference.\n\n\n\nI lost a lot of games in the beginning, but of my most recen gamest I won approximately 80 percent (or even more) of my games. I used Loragorn/Bilbo/Frodo and another deck with Boromir/Loragorn/Glorfindel. Once you've figured out how to treat those tentacles (in most cases: let them be), it's not that difficult., but still a challenge."}]}