{"url":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/","title":"Card Sleeves","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625729","commentId":625729,"userName":"J0shjames","timestamp":1336068945,"content":"Hey everyone,\n\nSorry if this is a very noob question, but I just picked up LOTR: TCG today and I was just wondering if most of you use card sleeves for your cards. I can see how protecting the cards after many plays would be beneficial but in my limited card sleeve experience they seem to make it hard to shuffle and handle the cards though the ones I bought previously were pretty cheap… Thoughts and opinions on card sleeves? Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625749","commentId":625749,"userName":"richsabre","timestamp":1336070369,"content":"ive had long tedious arguments in the past about sleeves-i dont sleeve due to the cost, and seeing as i have a back log of packs building up, id rather save for a new pack- however, the general idea is yes use them if you can afford to buy the decent ones, the cards do get pretty rough on the edges quite quickly\n\n \n\nhowever please dont listen to all the patronising comments that are surely to crop up here at some point along the lines of 'if you dont sleeve you are stupid' or 'if you dont sleeve your cards they will come alive at night a kill you for being so horrible to them' you get the point…sleeving is a choice and at the end of it all- its a more expensive choice than not,\n\n \n\nyeah your cards get a bit rough, but its not too bad- ive been playing for a year with mine, very regularly, unsleeved, and theyre fine to me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625757","commentId":625757,"userName":"DurinIII","timestamp":1336071883,"content":"Listen to Rich; he is a smart guy for sure.  I sleeve mine as I find it protects the cards and also makes shuffling easier.  Rich is right though; it's your overall choice-you don't need sleeves to play the game-on the other hand, if you can afford them, I would do so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625758","commentId":625758,"userName":"richsabre","timestamp":1336071993,"content":"DurinIII said:\n\nListen to Rich; he is a smart guy for sure.  I sleeve mine as I find it protects the cards and also makes shuffling easier.  Rich is right though; it's your overall choice-you don't need sleeves to play the game-on the other hand, if you can afford them, I would do so.\n\n\n\nthank you…i dont agree with you but thanks all the same lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625794","commentId":625794,"userName":"Mattr0polis","timestamp":1336082716,"content":"I don't think I could ever play a normal card game without sleeves. But that's because I shuffle the cards and fiddle with the cards in my hand and that are on the table more than anyone else I've ever seen.\n\nIt's probably like an OCD thing or the need to be doing something with my hands, but it also results in horribly ruined cards for me at a pretty quick pace.\n\nSo if you do THAT, then sleeves probably yes. Otherwise, you might be okay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625821","commentId":625821,"userName":"jhaelen","timestamp":1336098219,"content":"richsabre said:\n\nive had long tedious arguments in the past about sleeves-i dont sleeve due to the cost, and seeing as i have a back log of packs building up, id rather save for a new pack- however, the general idea is yes use them if you can afford to buy the decent ones, the cards do get pretty rough on the edges quite quickly\n\n \n\nI don't sleeve my cards, either, due to the high cost.\n\nAnd even after all this time (almost 100 games) the only cards that show slight signs of use are the Gandalf cards.\n\nImho, unless you plan to sell off your collection at some point, there's little reason to sleeve the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625849","commentId":625849,"userName":"richsabre","timestamp":1336108886,"content":"yes agreed- seeing as i only play this game and no others i can work out an average play amount-\n\ni got this about a year ago (start of may) and play on average about 7 games a week (sometimes i play many games a night, sometimes a day off, but it averages out to about 1 per day)…..\n\nso thats well over 300 games….still going strong on my end"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=625878","commentId":625878,"userName":"leptokurt","timestamp":1336115042,"content":"I've played a lot for almost a year, I didn't sleeve my cards, and they're still ok. The main problem is when you get new cards from the expansions and mix them with your old cards. There is a difference and the new cards tend to stick together when you mix them. That's why I think about buying some sleeves, but right now I'm in the same situation moneywise as Rich."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626013","commentId":626013,"userName":"Sprenger","timestamp":1336132036,"content":"If you do decide on sleeving your cards I would strongly recommend that you use clear or all the same colored sleeves for player cards. I don't know about anyone else but I change up my decks a lot and since each of my player decks are in different colored sleeves (purple, green, blue and red) I am constantly unsleeving and re-sleeving cards. it is a pain and a waste of time.\n\nI am slowly switching out my colored sleeves for clear dragon shield sleeves. They are totaly worth the $10."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626055","commentId":626055,"userName":"The_Fallen_Arises","timestamp":1336136999,"content":" Sleeve those bad boys…the art alone makes it a worthwile endeavour !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626114","commentId":626114,"userName":"Ted Sandyman","timestamp":1336142120,"content":"Personally i sleeve mine as ive got 2 young daughters who often have sticky fingers from eating too much rubbish. I usually play each day and they often pick the cards up as they absolutely adore the artwork. So i just wipe them clean if i do see smudges on them. I have noticed recently though that there is occasionally some kind of static electricity feel to them which makes it harder to shuffle them but thats strangely only every now and again. Do what suits your situation my friend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626119","commentId":626119,"userName":"Drengi","timestamp":1336142495,"content":"Im a bit anal so I always sleeve! I just cant stand not doing it (not that there is anything wrong with leaving them unsleeved).\n\n \n\n I agree with the above poster about clear sleeves, they are superior! I actually ordered some of the art sleeves, forgot about them and sleeved everything clear. I cant mix sleeves of different types (again really anal!). The art sleeves arrived a few months ago, but the clear sleeves are much nicer for the cards!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626155","commentId":626155,"userName":"J0shjames","timestamp":1336148584,"content":"Thanks for the replies everyone, I think i've decided I'll give the sleeves a shot and maybe try the dragon shield sleeves as it sounds like most people really like those. The sleeves are  within my budget but it's just enough of an expense I thought I'd get a little feedback before dropping $20-$30 on sleeves for just my core set when I could buy 2 expansions for that!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626177","commentId":626177,"userName":"Cotillion37","timestamp":1336152113,"content":"I sleeve my cards. The extra costs suck, but I find that it is worth sleeving the cards. Makes it much easier to shuffle, and in the event that you have a disastrous spill or something, the cards won't be completely ruined."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626284","commentId":626284,"userName":"Narsil0420","timestamp":1336181531,"content":"I don't like sleeving normally, it's just a game after all. However, I took one look at these beautiful cards and I knew I would not be able to let my friends touch the cards without being really OCD about them if they didn't have sleeves. I use FFG's clear sleeves and I'm really glad I went with them, they're quality."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626629","commentId":626629,"userName":"BiJay","timestamp":1336285195,"content":"richsabre said:\n\nyes agreed- seeing as i only play this game and no others i can work out an average play amount-\n\ni got this about a year ago (start of may) and play on average about 7 games a week (sometimes i play many games a night, sometimes a day off, but it averages out to about 1 per day)…..\n\nso thats well over 300 games….still going strong on my end\n\n\n\nI'm quite surprised your cards still seem to look okay. For me they seem less durable than Magic: The Gathering cards for example that's why I sleeved them straight away. When I would play that many games unsleeved my cards would look terrible without any doubt. ^^ So it's really a matter of how you handle your cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=626678","commentId":626678,"userName":"richsabre","timestamp":1336296769,"content":"BiJay said:\n\nrichsabre said:\n\n \n\nyes agreed- seeing as i only play this game and no others i can work out an average play amount-\n\ni got this about a year ago (start of may) and play on average about 7 games a week (sometimes i play many games a night, sometimes a day off, but it averages out to about 1 per day)…..\n\nso thats well over 300 games….still going strong on my end\n\n \n\n \n\nI'm quite surprised your cards still seem to look okay. For me they seem less durable than Magic: The Gathering cards for example that's why I sleeved them straight away. When I would play that many games unsleeved my cards would look terrible without any doubt. ^^ So it's really a matter of how you handle your cards.\n\n\n\nmy cards remain out on a soft surfaced old pool table away from direct sunlight- i dont need to pack away etc…..thats obviously a situation vetern card gamers wont have- but thats the reason they are so good still"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=627157","commentId":627157,"userName":"gvaughn1","timestamp":1336388820,"content":"I'm not sure yet about sleeves either.  I do have a couple questions though.\n\n1.  Are the \"Standard Card Game Sleeves\" (the Gray pack) from FFG the right kind to buy?  It looks like you get 50 sleeves for $2.99.  That seems reasonable.\n\n2.  Sort of a separate question: How does everyone store their cards?  At some point, they can't all fit in the box, right?  Do you get Card Boxes to store them?  Or use zip-lock baggies?  Just curious.\n\n3.  Is it more difficult to store the cards if they're sleeved?  Is it also more difficult to shuffle them?  Do they go flying and slipping around?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=627192","commentId":627192,"userName":"Budgernaut","timestamp":1336391216,"content":"gvaughn1 said:\n\nI'm not sure yet about sleeves either.  I do have a couple questions though.\n\n1.  Are the \"Standard Card Game Sleeves\" (the Gray pack) from FFG the right kind to buy?  It looks like you get 50 sleeves for $2.99.  That seems reasonable.\n\n2.  Sort of a separate question: How does everyone store their cards?  At some point, they can't all fit in the box, right?  Do you get Card Boxes to store them?  Or use zip-lock baggies?  Just curious.\n\n3.  Is it more difficult to store the cards if they're sleeved?  Is it also more difficult to shuffle them?  Do they go flying and slipping around?\n\n \n\nThanks\n\n\n\n1. Yes, I got the FFG grey pack. They are the \"right size\" but they don't fit very tight. Still, you get used to it pretty quick.\n\n2. The Core and Shadows of Mirkwood should all fit in the core set box if you invert the cardboard insert to create two columns. That's how I currently store my cards. I don't have anything beyond those yet, but I imagine you can fit a fair few cards into the Khazad-dum box as well. If it comes down to it, you may need to alter the insert in your core set box to allow three rows of cards.\n\n3. I don't find slipping to be a big problem with my sleeved cards, but one thing you have to consider is that you need to shuffle at an angle at the bottom corner. If you shuffle top-edge-to-bottom-edge you will get card trying to fit into other cards' sleeves. Still, I was finding that I didn't get a very good shuffle with the card sleeves. A lot of cards stuck together. Recently I've started just laying the two halve of the deck side-by-side and merging them sideways, starting at the lower corner. This seems to get a pretty good mesh and doesn't require bending the cards. I miss traditional shuffling, but I can just get a deck of cards out for that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=627197","commentId":627197,"userName":"FAAx87","timestamp":1336391414,"content":"gvaughn1 said:\n\n2.  Sort of a separate question: How does everyone store their cards?  At some point, they can't all fit in the box, right?  Do you get Card Boxes to store them?  Or use zip-lock baggies?  Just curious.\n\n\nI got my sleeves today and now I have exactly the same problem. So I'm looking for a solution at the moment…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=627209","commentId":627209,"userName":"player2052423","timestamp":1336392207,"content":"You can use regular baseball card boxes with foam dividers.  Then put the boxes in a carryall or briefcase type carrying case. \n\nUse clear sleeves so you can distinguish the different types of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=627291","commentId":627291,"userName":"Svenn","timestamp":1336399009,"content":"I've started sleeving my cards, but boy is it expensive. Extra expensive because I've been using Dragon Shields which seem to be near double the price of the other sleeves. However, I bought several types of sleeves and they just felt the best. I never used to be a fan of sleeving cards but now I think I like the feel of sleeved cards better than unsleeved.\n\nAs far as the box goes… I've converted my original box to hold all of the cards. I took out the cardboard piece and used some other cardboard (or foamboard, which actually works a little better) to build rows inside the original box. It can hold quite a large amount of cards this way. Some simple dividers made out of paper or cardboard work well for organization.\n\nI've been meaning to write a full post up on my site about how I did the custom box, but there is a picture on this review of one of my custom boxes (this one for Warhammer Invasion specifically, but I did the same thing for LotR): tabletopgeeks.com/warhammer-invasion-living-card-game-review/ [http://tabletopgeeks.com/warhammer-invasion-living-card-game-review/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=627328","commentId":627328,"userName":"Dwnhmcntryboy","timestamp":1336403105,"content":"For me it is a force of Habit/OCD thing. I must sleeve the cards I am going to play with. I sleeve all of the Quests in cheap penny sleeves just because they do get handled. All of the cards for the Quest Deck get sleeved because I have horrible organization skills and just throw the cards back in the box when I am done rather than sort them out and put them up. Lastly I sleeve my Decks because I play a lot, shuffle and fiddle with my cards constantly. The rest of the sphere card I leave unsleeved because I only break them out during deck building. I use the FFG 50 count clear sleeves for standard card sizes and they only run me 3 bucks and 100 count penny sleeves that cost me 1 dollar. I don't/won't use the art sleeves until there is a tournament scene."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=627431","commentId":627431,"userName":"evilidler","timestamp":1336419400,"content":" I sleeve the heck out of nearly everything. Other people's fingers = about the same as a first encounter with an alien race. You don't know where they have been, or if their natural bacteria will kill you ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI've used the cheapest kind of clear Ultra-Pro for double-sided cards like the quest cards in LotR, but I've really liked FFG's own coloured sleeves for all LCGs and other games with the same size cards. You will really start feeling it's hard to shuffle because of the size at 60+ cards, but they will last practically forever. I got a few of Ultra-Pro's premium clear sleeves recently, and they feel even better. FFG's sleeves are a bit thicker, and feel like two halves welded together. The Ultra-Pros feel like one piece. They're slightly more rigid also, but seem a tiny bit thinner than FFG sleeves. Neither brand clings together because of static electricity, at least not as extremely noticeably as the cheapest Mayday sleeves. Those are basically miniature trash bags.\n\nI even put sleeves on AGoT agenda cards…\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=628116","commentId":628116,"userName":"laiyna","timestamp":1336527853,"content":"I sleeve, the sleeves are cheaper then the cards, and I play for the nice pictures the cards have :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I would hate to see them damaged, it would lower the enjoyment of my game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=642601","commentId":642601,"userName":"gvaughn1","timestamp":1339332777,"content":"I just purchased 500 sleeves and sleeved up all my player cards & quest cards.  (I need another set of 500 to sleeve all my encounter cards).\n\nI spent $32.  Was it worth it?  HECK YES!\n\nCount me as a sleeve convert.  My enjoyment of playing the game has just increased quite a bit.  For the following reasons:\n\n * It is so incredibly easy to shuffle (by just pushing the deck halves together)\n * The cards feel great\n * The cards look great\n * They don't get damaged, bent, etc.\n\nAnyway, I wasn't sure if it was worth the cost ($60 by the time everything I own is sleeved) but now I'm a huge fan.\n\nGeorge"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=642643","commentId":642643,"userName":"booored","timestamp":1339338841,"content":"you forgot that you can print out custom encounter sets or make proxy cards to get 3 copies of UC by simple printing onto normal paper, grabbing a sleeved card you are not going ot use and sliding the print out in front of the card but in the sleeve.. instant.. easy 100% undetectable proxy and custom cards you can use …."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=642734","commentId":642734,"userName":"DurinIII","timestamp":1339362462,"content":"I completely agree with you Leiyna!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=642853","commentId":642853,"userName":"Mighty Jim 83","timestamp":1339401903,"content":"booored said:\n\nyou forgot that you can print out custom encounter sets or make proxy cards to get 3 copies of UC by simple printing onto normal paper, grabbing a sleeved card you are not going ot use and sliding the print out in front of the card but in the sleeve.. instant.. easy 100% undetectable proxy and custom cards you can use ….\n\n\n\n \n\nI've always sleeved my cards- been using penny sleeves up until recently, but just taken the plunge with a few packs of the art sleeves for this reason. I Play a lot of 4 player, so I got a 2nd core set early on, will probably get a third some time soon. But there's no way I'm ever picking up 6 core sets just to get all those unexpected courages I'd need. Good sleeves are your friend for proxies and customs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=643940","commentId":643940,"userName":"EndlessForms","timestamp":1339576614,"content":" I just started to get in to card games recently, starting with LOTR and now moving into AGOT LCG.  I wasn't sure if the extra cost of sleeves would be worth it, but I'm OCD and hate when I'm playing Chrononauts, for example, and my friends bend up the cards trying to turn them over, so I bought enough clear sleeves to cover my LOTR core set and I'm so glad I did.  Not only do they make shuffling easier in my opinion (if you shuffle by pushing two halves together), but they look nicer and don't get scratched up and (since I usually play on my glass-top desk) are much easier to pick up off the table without bending corners.\n\nThe cost is very prohibitive and buying enough sleeves to cover all my LOTR cards has cost quite a bit but I will keep sleeving anyways.  I haven't decided if I'm going to sleeve AGOT yet because I don't play it as often and, again, it costs so freaking much.  I might just go with cheaper sleeves for AGOT but in an effort to keep all my cards the same I'll keep buying higher-quality sleeves for LOTR."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=644663","commentId":644663,"userName":"Mr Coffee","timestamp":1339690482,"content":"FAAx87 said:\n\ngvaughn1 said:\n\n2.  Sort of a separate question: How does everyone store their cards?  At some point, they can't all fit in the box, right?  Do you get Card Boxes to store them?  Or use zip-lock baggies?  Just curious.\n\n\n\nI got my sleeves today and now I have exactly the same problem. So I'm looking for a solution at the moment…\n\n \n\n\n\n \n\nI've converted my original boxes (2 core sets) by removing all the packaged cardboard liners.  To hold my sleeved cards (yes, I'm a sleever- I have two sons: 6 years and 3-months old… walking/slobbering destruction for any games around… lol), I have used FFG's own deck boxes:\n\nhttp://store.fantasyflightgames.com/productdetails.cfm?SKU=FFS60 [http://store.fantasyflightgames.com/productdetails.cfm?SKU=FFS60]\n\nThese are great, can hold up to 100 SLEEVED cards (theoretically 2 decks, although I use them to hold each sphere individually), include a small compartment to hold the counters/tokens for the game, and come in 5 colors (black, white, red, blue, green) which match up pretty well for my holding my spheres (blue-Spirit, green- Lore, red-Tactics, white Neutral, black-Encounter cards), except for Leadership (no purple), so I just use another white case.  They do cost a bit, but my cousin introduced me to a great site that sells pretty much all of FFG's stuff at a pretty decent mark-down from FFG's own listed MSRP:\n\nhttp://www.coolstuffinc.com/ [http://www.coolstuffinc.com/]\n\nThis is where I've done all my large LOTR LCG ordering.  even the AP's are cheaper ($9.99 versus listed $14.99, etc) and the cases only cost $7.99 here (the sleeves are cheaper as well).  So anyone looking to buy sleeves, boxes, or any of the APs or core/expansions at a reduced amount, definitely check them out!  (shipping is free for orders over $100)…  Didn't mean for this to be an \"ad\" for that sirte, but it saved me a bunch of $$$ when I got into the game a few months ago!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=644668","commentId":644668,"userName":"Mr Coffee","timestamp":1339690596,"content":"benhanses said:\n\nFAAx87 said:\n\n \n\ngvaughn1 said:\n\n2.  Sort of a separate question: How does everyone store their cards?  At some point, they can't all fit in the box, right?  Do you get Card Boxes to store them?  Or use zip-lock baggies?  Just curious.\n\n\n\nI got my sleeves today and now I have exactly the same problem. So I'm looking for a solution at the moment…\n\n \n\n \n\n \n\n \n\nI've converted my original boxes (2 core sets) by removing all the packaged cardboard liners.  To hold my sleeved cards (yes, I'm a sleever- I have two sons: 6 years and 3-months old… walking/slobbering destruction for any games around… lol), I have used FFG's own deck boxes:\n\nhttp://store.fantasyflightgames.com/productdetails.cfm?SKU=FFS60 [http://store.fantasyflightgames.com/productdetails.cfm?SKU=FFS60]\n\nThese are great, can hold up to 100 SLEEVED cards (theoretically 2 decks, although I use them to hold each sphere individually), include a small compartment to hold the counters/tokens for the game, and come in 5 colors (black, white, red, blue, green) which match up pretty well for my holding my spheres (blue-Spirit, green- Lore, red-Tactics, white Neutral, black-Encounter cards), except for Leadership (no purple), so I just use another white case.  They do cost a bit, but my cousin introduced me to a great site that sells pretty much all of FFG's stuff at a pretty decent mark-down from FFG's own listed MSRP:\n\nhttp://www.coolstuffinc.com/ [http://www.coolstuffinc.com/]\n\nThis is where I've done all my large LOTR LCG ordering.  even the AP's are cheaper ($9.99 versus listed $14.99, etc) and the cases only cost $7.99 here (the sleeves are cheaper as well).  So anyone looking to buy sleeves, boxes, or any of the APs or core/expansions at a reduced amount, definitely check them out!  (shipping is free for orders over $100)…  Didn't mean for this to be an \"ad\" for that sirte, but it saved me a bunch of $$$ when I got into the game a few months ago!\n\n\n\n \n\nOh, and those FFG deck boxes fit perfectly within the LOTR LCG core set box…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64021-card-sleeves/?do=findComment&comment=645147","commentId":645147,"userName":"J0shjames","timestamp":1339780430,"content":"Hey guys,\n\nOne more question, I've picked up a set of penny sleeves and a set of dragon shield sleeves and I'm just wondering how the FFG sleeves compare ( and the other major brand i can't seem to remember at the moment) I love the dragon sleeves because they feel sturdy, shuffle easy, and when I put a stack of cards down they stay put. The penny sleeves however are pretty flimsy and they slide all over the place if I stack a few on top of each other. The dragon shield are just so expensive it's hard to justify buying that many. Is there a good middle ground?"}]}