{"url":"https://community.fantasyflightgames.com/topic/64395-wargs/","title":"Wargs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64395-wargs/?do=findComment&comment=629298","commentId":629298,"userName":"Schmiegel","timestamp":1336696318,"content":" I'm probably over-thinking this….but I am looking for people's opinions/clarification on the Wargs \"Forced\" effect, which is: \"If Wargs is dealt a shadow card with no effect, return Wargs to the staging area after if attacks.\"\n\nIn my current game of Conflict at the Carrock, Bilbo is defending against Wargs. The shadow card dealt to Wargs is \"Roasted Slowly\". That card does have a shadow effect, namely \"If attacking enemy is a Troll, remove two damage tokens from it.\" So should I simply then say that, yes, that card does have a shadow effect and deem that Wargs DOES NOT return to the staging area? \n\nOr, should I interpret it instead that since Wargs is not a troll, therefore the shadow card \"has no effect\", and return Wargs to the staging area..?\n\nAlso, in this case, Bilbo has the \"A Burning Brand\" attachment, which has the following effect: \"While attached character is defending, cancel any shadow effect on cards dealt to the attacking enemy.\" In the case of Wargs attacking Bilbo with him possessing that attachment, would that mean that shadow cards never have an effect and therefore Wargs would ALWAYS return to the staging area after attacking Bilbo, or not? I'm thinking not. (Because Wargs wasn't DEALT a card with no effect, A Burning Brand instead cancelled it.)\n\nAny opinions would be appreciated. Thank you.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64395-wargs/?do=findComment&comment=629312","commentId":629312,"userName":"Budgernaut","timestamp":1336699430,"content":" I believe the consensus the last time this question came up was that as long as there is a shadow effect printed on the card, the Wargs do not retreat to the staging area, even if the shadow effect is cancelled or has no effect on the current situation of the game.\n\nEdit: But I can't tell you offhand if that was an official ruling or not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64395-wargs/?do=findComment&comment=629322","commentId":629322,"userName":"leptokurt","timestamp":1336703783,"content":"Budgernaut is right. As long as the shadow card has a printed shadow effect the Wargs don't return to the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64395-wargs/?do=findComment&comment=629332","commentId":629332,"userName":"Schmiegel","timestamp":1336705258,"content":" That's what I thought, and is the way I played it. Thanks, I appreciate the responses!"}]}