{"url":"https://community.fantasyflightgames.com/topic/64447-anyone-have-any-house-rules-for-the-set-up-of-a-quest/","title":"anyone have any house rules for the set up of a quest?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64447-anyone-have-any-house-rules-for-the-set-up-of-a-quest/?do=findComment&comment=629818","commentId":629818,"userName":"chainsaw_ash","timestamp":1336763245,"content":"I'm asking because my friend and I, have just played escape from dol guldur 3 times and lost 3.\n\nThat in itself wouldn't be such a problem. After all, the first game we played went on for an hour before we lost.\n\nThe last 2 games however we died in the first round following setup, due to some terrible treachery cards we drew, when setting up  the guarding of the 3 objectives.\n\nI can't rememeber  the details but one tapped all our heroes, so they were unavailable to quest and defend in the first turn.\n\nWe were a hammer and anvil decks so we pretty muched threated out and then a hero was killed as we could not defend.\n\nA scenario in which you have effectivly lost the game during setup, seems broken to me and is exactly why I stopped playing MTG because of the daft overpowered decks people played.\n\nMy mate and I were thinking maybe a house rule would prevent such ill feeling. (we discarded the scenario and chose another and I doubt we will go back to it again tbh) Maybe you should be allowed to increase your threat by 1 and redraw a setup card,  if it equally game breaking  you could discard and chose another with an increase of 2 next it would be 3 etc. Does that seem reasonable, I mean its only luck after all what comes out of the encounter deck during the initial setup after all.\n\nAnyone do anything similiar or have other suggestions?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64447-anyone-have-any-house-rules-for-the-set-up-of-a-quest/?do=findComment&comment=629945","commentId":629945,"userName":"Dam the Man","timestamp":1336787682,"content":"chainsaw_ash said:\n\nThe last 2 games however we died in the first round following setup, due to some terrible treachery cards we drew, when setting up  the guarding of the 3 objectives.\n\nI can't rememeber  the details but one tapped all our heroes, so they were unavailable to quest and defend in the first turn.\n\nHmm, there is no such Treachery in DG, so make sure you are using the correct cards (or reading them right). There are 2x King Spider in the deck and I've drawn them both during setup, leaving just 1 character ready. There really isn't anything you can do in those situations, you've quite possibly lost the game during setup without having any say in the matter. And yes, it's stupid."}]}