{"url":"https://community.fantasyflightgames.com/topic/64491-sequence-of-actions/","title":"Sequence of actions ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64491-sequence-of-actions/?do=findComment&comment=630266","commentId":630266,"userName":"91Vaapad013","timestamp":1336846764,"content":"I have two questions:\n\n \n\nI have Thalin as a Hero that is committed to a quest. The Encounter deck reveals Dol Goldor Orcs.\n\nThalin's text ( While Thalin is committed to a quest, deal 1 damage to each enemy as it revealed by the encounter deck).\n\nDol Goldor Orc's text ( WHEN REVEALED: Choose one character currently committed to a quest. Deal 2 damage to that character)\n\nDoes Thalin kill the Orcs BEFORE the When Revealed action takes place? Since they have 0 Defense and must take a wound I played it that way. But want to be sure.\n\n \n\nAlso question number two:\n\nI had \"Unexpected Courage\" attached to Eleanor. The encounter deck revealed a treachery card with a \"When Revealed\" action. Eleanor's text allowed me to exhaust her to discard that card and draw another. Then another treachery card with a \"When Revealed\" action came up. I exhausted \"Unexpected Courage\" to ready her then exhausted her again to cancel that card. Is that the right way to play \"Unexpected Courage\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64491-sequence-of-actions/?do=findComment&comment=630308","commentId":630308,"userName":"chainsaw_ash","timestamp":1336858740,"content":" the way i play it is Thalin does his damage first and kills your dol goldor orcs before they can do their bit.\n\n \n\nq2 i think the answer is no. you have to exhaust Eleanor and resolve the effects of her ability ie the drawing and resolving of another encounter card.\n\n \n\nI have Thalin as a Hero that is committed to a quest. The Encounter deck reveals Dol Goldor Orcs.\n\nThalin's text ( While Thalin is committed to a quest, deal 1 damage to each enemy as it revealed by the encounter deck).\n\nDol Goldor Orc's text ( WHEN REVEALED: Choose one character currently committed to a quest. Deal 2 damage to that character)\n\nDoes Thalin kill the Orcs BEFORE the When Revealed action takes place? Since they have 0 Defense and must take a wound I played it that way. But want to be sure.\n\n \n\nAlso question number two:\n\nI had \"Unexpected Courage\" attached to Eleanor. The encounter deck revealed a treachery card with a \"When Revealed\" action. Eleanor's text allowed me to exhaust her to discard that card and draw another. Then another treachery card with a \"When Revealed\" action came up. I exhausted \"Unexpected Courage\" to ready her then exhausted her again to cancel that card. Is that the right way to play \"Unexpected Courage\"?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64491-sequence-of-actions/?do=findComment&comment=630447","commentId":630447,"userName":"Tracker1","timestamp":1336899006,"content":" The orcs have 3 hit points.  Thalin only does one damage, so they still have two points left.  So, the way I understand it, is that the orcs would still deal two damage, and be placed in the staging area with one damage token on it.  That's the way I play it, the way you describe makes it sound like Thalin will destroy any enemy when it's revealed from the deck.  \n\nLet me know if I'm playing it wrong, if I am Thalin will be in my deck more often"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64491-sequence-of-actions/?do=findComment&comment=630476","commentId":630476,"userName":"Valyrian Steel","timestamp":1336905251,"content":"As stated in the FAQ, Thalin's ability trigger's before any keyword or when revealed effect from the encounter deck so he would do his one damage first. As mentioned above, the Dol Guldar Orcs have 3 hp so they would still be alive at this point.\n\nUnexpected courage could not be used in your scenario. During the portion of the quest phase that encounter cards are revealed there is no action window for the player. You may only play responses like Eleanor's but once used her ability wouldn't be available again that quest phase. Check out the action window chart near the end of the rule book.\n\nHope that helps!"}]}