{"url":"https://community.fantasyflightgames.com/topic/64549-anduin-query/","title":"Anduin query","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64549-anduin-query/?do=findComment&comment=630833","commentId":630833,"userName":"Ted Sandyman","timestamp":1336977593,"content":"Hi, im literally going to have to sit here and wait for an answer hopefully from someone! Ive just turned over to stage 3 of journeying down the anduin(as i quested successfully) but now have a problem. Ive added 2 encounter cards like it says so have now got 6 enemies in the staging area as i didnt optionally engage many during stage 2. As my threat is at 42, do all the enemies come down and attack(as they are all under 42) or is it like stage 2 where i dont have to make engagement checks but can optionally choose to bring an enemy down if i want to? If that stage 2 condition is now defunct i am literally buggered as i quested with 7 out of my 8 characters to get  high questing power to get to stage 3. They will all come down and take my characters out!! Im hoping for a favourable answer but i fear they may all attack as the story says the raft is dragged to the shore with us all on it!!! I guess all my heroes will take the undefended hits (killing the 3 of them) which will leave my characters free to refresh then next turn have a battle(then i will be slaughtered i expect as i will be defending with them all. Anyway, game paused!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64549-anduin-query/?do=findComment&comment=630834","commentId":630834,"userName":"Angus Lee","timestamp":1336978003,"content":"Sadly, since Stage 2B card is not there anymore during quest phase, so in the Engagement Phase, the Enemies will all engage you! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64549-anduin-query/?do=findComment&comment=630892","commentId":630892,"userName":"Doom1502","timestamp":1336985549,"content":"Ted Sandyman said:\n\nI guess all my heroes will take the undefended hits (killing the 3 of them) which will leave my characters free to refresh then next turn have a battle(then i will be slaughtered i expect as i will be defending with them all. Anyway, game paused!!!\n\n\n\nThey won't refresh - if all your heroes got killed it's game over."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64549-anduin-query/?do=findComment&comment=630899","commentId":630899,"userName":"Ted Sandyman","timestamp":1336987007,"content":"Sadly i thought that was the case with stage 3. Durrrr yeh in all the excitement i forgot about the heroes!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64549-anduin-query/?do=findComment&comment=630956","commentId":630956,"userName":"radiskull","timestamp":1336993436,"content":" I always pictured it as your enemies traveling along the banks of the river, watching you float along, following you to the point at which you're going to dock.  You can shoot some arrows, or one enemy might try to swim out to you after some effective taunting on your part (your optional engagement), but as soon as your raft hits land, boom - those enemies are waiting for you.\n\nThe trick to this quest is to control your pace, and land in phase 3 only when it is reasonably safe to do so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64549-anduin-query/?do=findComment&comment=631335","commentId":631335,"userName":"Ted Sandyman","timestamp":1337068679,"content":"Yeh i agree thats the kind of story line that i was picturing. You finally get to the shore and they all pounce on you. I havent played this scenario for a few months and made the mistake of not reading the quest cards in advance so i forgot they all attack in stage 3. Will give it a go again tonite and make sure im ready for the blighters when (or if) i get to stage 3. Cheers"}]}