{"url":"https://community.fantasyflightgames.com/topic/64564-secrecy-in-cooperative-play/","title":"Secrecy in cooperative play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64564-secrecy-in-cooperative-play/?do=findComment&comment=630953","commentId":630953,"userName":"FAAx87","timestamp":1336993203,"content":"Hello!\n\nToday I received my copy of the watcher in the water and now I'm thinking about a secrecy deck with lore and leadership (Bifur and Théodred for a starting threat of 15).\n\nNow I'm asking myself if a secrecy deck would work out well in cooperative play, if my partner is not playing under the radar. In the theory he will have to deal with nearly all the enemys alone. Has anybody tried playing secrecy in a 2 player game already? How did it work? My partner usually plays a spirit only rohan deck with starting threat of 24. Do you think this is low enough?\n\nI'm very curious!\n\nI also read, that the secrecy mechanic is not working quite well in the KD scenarios. Are there some new experiences with this?\n\nBeside of that, there are several enemys in the core set with a very low threat level reaching from 5-15. I'm not sure the secrecy mechanic will work there out very well too. What do you think?\n\nCan't wait to try it myself :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n[i'm sorry for my bad english ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64564-secrecy-in-cooperative-play/?do=findComment&comment=630977","commentId":630977,"userName":"lleimmoen","timestamp":1336996048,"content":"Yeah, we mostly play two player games with a \"normal\" deck of Boromir, Eowyn, Dunhere (for instance) and the \"secrecy\" deck with Theodred and Strider. It works very well. The player with the low threat can still optionally engage enemies. And there are ways to diminish the threat level difference if need be - the Galadhrim's, the Took, or the Song of Earendil.\n\nWhat is the other deck you are thinking of?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64564-secrecy-in-cooperative-play/?do=findComment&comment=630994","commentId":630994,"userName":"FAAx87","timestamp":1336998644,"content":"Mh… but there are no real benefits for sneaking, or am I missing something? Except for the reduced costs for secrec cards? Someone has to deal with the monsters anyway and there might be situations where it is not enough to engange only one monster."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64564-secrecy-in-cooperative-play/?do=findComment&comment=631010","commentId":631010,"userName":"lleimmoen","timestamp":1337000803,"content":"Sure, Boromir is great for dealing with multiple enemies. Play Arwen in the same deck and you shall be able (if you're lucky to draw her) to use Boromir as a sentinel on round 1, and with the defence of 3.\n\nTimely Aid is so far (un)arguably the best secrecy card, fill the secrecy deck with allies, preferably the strong ones like Northern Tracker or Gildor Inglorion and you might be able to have one of these greats on round 1 as well. And it again does not go against great odds. Having one of these so early does almost already outweigh the shortcomings of having only two heroes.\n\nOverall, I think it is much easier to run secrecy in coop - at least until more secrecy cards show up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64564-secrecy-in-cooperative-play/?do=findComment&comment=631103","commentId":631103,"userName":"DurinIII","timestamp":1337012335,"content":" I agree with you FAAx87!  Secrecy in general is only advantageous in that it starts you with a lower threat and allows for some cards with the secrecy keyword to cost less to play.  I haven't found that secrecy works well in either solo or multi yet.  I think it needs a lot more time to develop."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64564-secrecy-in-cooperative-play/?do=findComment&comment=631124","commentId":631124,"userName":"lleimmoen","timestamp":1337016320,"content":"It does work - but you need either a good starting hand or a good other player to coop with. And you are right, it is in its beginnings, new cards will make it much better."}]}