{"url":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/","title":"Foundation of Stone Anticipation","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=633931","commentId":633931,"userName":"lleimmoen","timestamp":1337604757,"content":"With the first preview likely coming up soon, what are your expectations? To catch upon similar threads, what do you think the game has to offer us this time?\n\nPersonally, I hope for a nice questing Hero, I think the game is lacking on those a bit with the combatants sharing three quarters (at least) of the pool so far this cycle.\n\nI am also hoping for a nice secrecy card. Just one maybe but a really good one like Timely Aid - in a different sphere perhaps. It would be interesting if Tactics had got one (their first).\n\nAnd as always, I am crossing fingers for some new Elven synergies.\n\nAs for the quest, I am not a big fan of the underground and I think this one may be a bit easier before the final really hard one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=633939","commentId":633939,"userName":"Drengi","timestamp":1337605785,"content":"Really want a Spirit or Lore Hero this time please FFG!\n\n \n\n With that in mind I dont mind if it isnt a quester…. I still want Gwahir TBH… would it be outrageous for him to not be Tactics Sphere despite the other eagles beng in there?\n\n \n\n Again I wouldnt mind another Elf hero!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=633957","commentId":633957,"userName":"richsabre","timestamp":1337607449,"content":"mmmmm……i would like another hobbit- cant go wrong with some good hobbit lovin' :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=633966","commentId":633966,"userName":"Mr Coffee","timestamp":1337608276,"content":"Drengi said:\n\nReally want a Spirit or Lore Hero this time please FFG!\n\n \n\n With that in mind I dont mind if it isnt a quester…. I still want Gwahir TBH… would it be outrageous for him to not be Tactics Sphere despite the other eagles beng in there?\n\n \n\n Again I wouldnt mind another Elf hero!\n\n\n\n \n\nActually, I'd love to see Gwahir as anything BUT a tactics hero.  Part of the difficulty of using tactics (specically for solo play) is that they are so limited in scope, and don't \"play well\" at times with other spheres.  What better way to blend in another sphere than by having him be either Spirit or Lore?  You could use him to bring in the cards from whichever sphere he belonged to and supplement the combat-ready tactics decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=633969","commentId":633969,"userName":"lleimmoen","timestamp":1337608443,"content":"I really expect Gwaihir to be another Tactics Eagles ally. Although it does seem strange he has been left out off the succession in the previous cycle. Perhaps we shall see another line of Eagles for the Hobbit expansion, which would fit perfectly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=634066","commentId":634066,"userName":"Robert McMutton","timestamp":1337617717,"content":" I think Gwaihir will be one of the heros in The Hobbit saga expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=634075","commentId":634075,"userName":"lleimmoen","timestamp":1337618522,"content":"Robert McMutton said:\n\n I think Gwaihir will be one of the heros in The Hobbit saga expansion.\n\n\n\nCould be, especially as they stated the first deluxe box to contain five heroes. If they're gonna be thematic from the story, it is hard to think up five suitable heroes, Gwaihir could very well be one of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=634150","commentId":634150,"userName":"Angus Lee","timestamp":1337631945,"content":"My expectation from the latest preview is an updated FAQ!  It's over six months that FFG has not updated it with a bunch official responses posted elsewhere on the web."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=634160","commentId":634160,"userName":"DurinIII","timestamp":1337633467,"content":"Great idea there benhanses!  That is indeed a good way to incorporate another complimentary sphere to Tactics!  And as we all know, Tactics needs some help for solo play!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=634287","commentId":634287,"userName":"lleimmoen","timestamp":1337666902,"content":"So now we know much more. Beside the Gazer and Mount, both Leadership and Tactics are gaining an ally. I think (and hope) neither is a Dwarf, and am especially interested in that Tactics ally, beside the Dwarves and Eagles, there haven't been many in the expansions (Beekeeper, Watcher), so perhaps we shall see another Elf there to make more use of their new weaponry. And Leadership, after a long wait, are gaining second ally in a row (and third in four packs), I think some people shall be happy. Since they claim all those allies will likely see play, I think they might be right, from the experience they never advertise the \"poorer\" cards that much, so I do not think we shall expect another Ravenhill Scout, Bombur, Watcher of the Bruinen or Dunedain Wanderer (though I know some players like some of these surely)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640056","commentId":640056,"userName":"Captain Poe","timestamp":1338801951,"content":"Not particularly fond of the idea of an eagle hero. I have enough trouble seeing the eagles working cinematically for most of the current expansion… Really, how useful would I gang of giant eagles be in the mines of moria?\n\n \n\nThat being said, I'd like another hobbit, another noldor, or a quest focused dwarf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640057","commentId":640057,"userName":"lleimmoen","timestamp":1338802226,"content":"For me, as always, I would like to see another Elf. And I am really interested in the two allies they mentioned, especially the Tactics one. Hope he can quest a bit or gets some kind of bonus as Legolas does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640733","commentId":640733,"userName":"jjeagle","timestamp":1338912988,"content":"I think the hero is likely to be a Spirit version of Glorfindel. My reasoning is:\n\n1. Spirit is \"due\" a hero (it has fewer than all the other spheres)\n\n2. In TWITW, we got a new Aragorn plus an Aragorn-specific attachment in the same sphere as his original version. For TLD we know we will have a Glorfindel-specific attachment in the same sphere as his original version.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640772","commentId":640772,"userName":"lleimmoen","timestamp":1338918553,"content":"jjeagle said:\n\nI think the hero is likely to be a Spirit version of Glorfindel. My reasoning is:\n\n1. Spirit is \"due\" a hero (it has fewer than all the other spheres)\n\n2. In TWITW, we got a new Aragorn plus an Aragorn-specific attachment in the same sphere as his original version. For TLD we know we will have a Glorfindel-specific attachment in the same sphere as his original version.\n\n \n\nI've reasoned the same. I just wish you're right, so I'm a little scared to predict so. Haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640936","commentId":640936,"userName":"Serazu","timestamp":1338962548,"content":"The truth is there are so many yet-to-make-their-appearance Tolkien characters out there that there is really no reason to put variable versions of the same hero, especially a background one, such as Glorfindel. An ally version of him should be enough. That said, Glorfindel is really thematic in the current cycle. Though I would much prefer Elrond as the new Spirit hero, even though I think he 'd be more suited as a Lore or Leadership one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640938","commentId":640938,"userName":"richsabre","timestamp":1338963053,"content":"agreed-there are many characters to come but i still think glorfindel deserves better than what his initial cards has given his status in middle earth throughout all ages ………..saying that i have him in a 'flight to the ford' deck with lore strider/frodo/glorfindel and it is very effective and this will increase when asfaloth is released"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640944","commentId":640944,"userName":"jjeagle","timestamp":1338964745,"content":"Serazu said:\n\nThe truth is there are so many yet-to-make-their-appearance Tolkien characters out there that there is really no reason to put variable versions of the same hero, especially a background one, such as Glorfindel. An ally version of him should be enough. That said, Glorfindel is really thematic in the current cycle. Though I would much prefer Elrond as the new Spirit hero, even though I think he 'd be more suited as a Lore or Leadership one.\n\n\n\nPersonally, I don't think a hero Elrond would work thematically. As far as we can tell, he hasn't left Rivendell for 3000 years. His role is sage counsellor and master of lore and healing, not active questing hero or fighter. In my view, he would be better represented through event cards (as he already is, with Elrond's Counsel) or a temporary ally (like Gandalf). The same would go for Galadriel too.\n\nRegarding a Spirit Glorfindel, my concern would be whether a unique Noldor Spirit hero would power up Elrond's Counsel excessively by allowing you to play it right from the start."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640956","commentId":640956,"userName":"Serazu","timestamp":1338967205,"content":"jjeagle said:\n\nRegarding a Spirit Glorfindel, my concern would be whether a unique Noldor Spirit hero would power up Elrond's Counsel excessively by allowing you to play it right from the start.\n\n\n\nBut this can already happen in a Spirit / Lore deck. And it's not that gamebreaking I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640958","commentId":640958,"userName":"richsabre","timestamp":1338967648,"content":"problem with elves is we so seldom see them in 'action' ….i mean take galadriel for example…..i believe i am right in saying she was only only surviving elf in the 3rd age to have made the trip over the helcaraxe wastes……so you could take that to be a huge amount of willpower…..but is it relavent in a third age middle earth? im not so sure, as we never see galadriel as anything other than a wise leader and member of the white council….\n\nhowever in more than one occasion her power or influence contributes to the war against sauron….ie lorien being assaulted 3 times by dol guldur, which she eventually destroys after the war of the ring, so she could function more in her leadership powers\n\nand of course you have her ring of power nenya….so i guess my point is how do you define such powerful characters? i think it is difficult to place where a major player in the events of middle earth should lie….and it is perhaps worse with elves as their ways are so distanced and secretive in the 3rd age\n\nso perhaps it is better to have these characters as 'gandalf' type cards so that there is no themetic/gameplay issues…..and yet id be dissapointed if they didnt at least give elrond/galadriel/celeborn all a shot\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640980","commentId":640980,"userName":"lleimmoen","timestamp":1338972079,"content":"jjeagle said:\n\n \n\nSerazu said:\n\n \n\nThe truth is there are so many yet-to-make-their-appearance Tolkien characters out there that there is really no reason to put variable versions of the same hero, especially a background one, such as Glorfindel. An ally version of him should be enough. That said, Glorfindel is really thematic in the current cycle. Though I would much prefer Elrond as the new Spirit hero, even though I think he 'd be more suited as a Lore or Leadership one.\n\n \n\n \n\nPersonally, I don't think a hero Elrond would work thematically. As far as we can tell, he hasn't left Rivendell for 3000 years. His role is sage counsellor and master of lore and healing, not active questing hero or fighter. In my view, he would be better represented through event cards (as he already is, with Elrond's Counsel) or a temporary ally (like Gandalf). The same would go for Galadriel too.\n\nRegarding a Spirit Glorfindel, my concern would be whether a unique Noldor Spirit hero would power up Elrond's Counsel excessively by allowing you to play it right from the start.\n\n \n\n \n\nBut given the fact they will probably keep realeasing this game for at least 30 more heroes (probably many more than that) we are bound to get a Spirit Noldor hero anyways.\n\nI really hope Elrond is not a hero, ally fits him much better in my opinion. The same I feel about him not being Spirit but Lore.\n\nFinally, what do you call a background character? Glorfindel probably has as much \"text-time\" as Elrond in the book. As for the story, his commitment is vital to the quest. And as for the history, there aren't many with such a curriculum vitae. Hardly a background character from any point of view, unless you call every character but the Fellowship such."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640991","commentId":640991,"userName":"Serazu","timestamp":1338975783,"content":"Exactly. Aragorn is a pivotal character, that's why I 'm ok with him having an additional version so soon in the game. Glorfindel is not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640995","commentId":640995,"userName":"lleimmoen","timestamp":1338976397,"content":"Serazu said:\n\nExactly. Aragorn is a pivotal character, that's why I 'm ok with him having an additional version so soon in the game. Glorfindel is not.\n\n\n\nFair enough. If it were up to me, I would not like any character appearing twice (I guess now). But I like the Strider version much more than the initial Aragorn and I have a hunch I might like the new (if any) version of Glorfindel much more than the original one. I would not be wishing for a new version had I not thought the original does not justice to the character. As Rich put it fitly, you don't go about slaying a Balrog with \"pay a resource to heal a damage.\" That's still my whole point. The second point has to do with Tolkien actually repeating the character as well - Glorfindel appearing twice, later blending into one. So this could be a nice nod to that.\n\nOn a side note, what do others think, guess, who will be the hero in the Foundations of Stone? In a week (or less) we might know…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=640998","commentId":640998,"userName":"richsabre","timestamp":1338976606,"content":"ill go with jjeagles line of thought - asfaloth points to glorfindel"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641032","commentId":641032,"userName":"Captain Poe","timestamp":1338981304,"content":"Serazu said:\n\nExactly. Aragorn is a pivotal character, that's why I 'm ok with him having an additional version so soon in the game. Glorfindel is not.\n\n\n\nAragorn is more pivitol, but his history is far more fleshed out by tolkien. Cinematically speaking, it makes more sense for Glorfindel who is not as fleshed out to be the ones going on these quests.\n\nThe glorfindel we have is not worth playing. Sure, a few builds make be able to make use of him… but making a use of a card does not always mean that it is a balanced card. As is, glorf is too expensive for what he does. He's a good quester, but not a great one. He's a good attacker, but not a great one. For a 12 threat, he should excel at something. His ability can be useful, but again, its for a 12 cost, the ability is expensive. I think he could use a remake."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641041","commentId":641041,"userName":"Mattr0polis","timestamp":1338982607,"content":"Captain Poe said:\n\nSerazu said:\n\n \n\nExactly. Aragorn is a pivotal character, that's why I 'm ok with him having an additional version so soon in the game. Glorfindel is not.\n\n \n\n \n\nAragorn is more pivitol, but his history is far more fleshed out by tolkien. Cinematically speaking, it makes more sense for Glorfindel who is not as fleshed out to be the ones going on these quests.\n\nThe glorfindel we have is not worth playing. Sure, a few builds make be able to make use of him… but making a use of a card does not always mean that it is a balanced card. As is, glorf is too expensive for what he does. He's a good quester, but not a great one. He's a good attacker, but not a great one. For a 12 threat, he should excel at something. His ability can be useful, but again, its for a 12 cost, the ability is expensive. I think he could use a remake.\n\n\n\nI'm not sure what you are arguing here. Glorfindel's current card is definitely very playable. And now with Asfaloth even moreso.\n\nNot a great quester? The only Hero with higher willpower is Eowyn and the only other 3's are Dwarves with Dain helping them.\n\nNot a great attacker? He is tied for the highest base attack value.\n\nIs he expensive? Yes, but you are getting a hero with TWO 3's, which is so versatile. And even his ability is useful just not overly so.\n\nI keep reading all this stuff about how he needs to be better to be more representative of him in the books. How much better can he be? Like Rich said above, how do you define these powerful characters? I think they did all they can do in a game format. More than that will unbalance the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641071","commentId":641071,"userName":"lleimmoen","timestamp":1338986303,"content":"Gildor Inglorion is portrayed in a very interesting way. He also has two 3's (three with hp, haha) but his ability is special. I think that's all some of us are asking for, Glorfindel's ability is the least special imaginable with Warden of Healing, Daughter of the Nimrodel, Healing Herbs, Self Preservation, Lore of Imladris, Beorn's Hospitality… is he playable, very much so, has he got better with Asfaloth, most definitely. But I cannot but agree with most what Captain Poe has to say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641079","commentId":641079,"userName":"Captain Poe","timestamp":1338987218,"content":"lleimmoen said:\n\nGildor Inglorion is portrayed in a very interesting way. He also has two 3's (three with hp, haha) but his ability is special. I think that's all some of us are asking for, Glorfindel's ability is the least special imaginable with Warden of Healing, Daughter of the Nimrodel, Healing Herbs, Self Preservation, Lore of Imladris, Beorn's Hospitality… is he playable, very much so, has he got better with Asfaloth, most definitely. But I cannot but agree with most what Captain Poe has to say.\n\n\n\n \n\nI'm not arguing that he's not playable. He is very playable. But Is he as good as the other 12 threat heroes?\n\n \n\nAragorn:\n\n2 Will, 3 Atk, 2 Def, 5 HP - 1 Resource to ready after questing\n\nLoragorn:\n\n2 Will, 3 Atk, 2 Def, 5 HP - Reset threat once per game\n\nGlorfindel\n\n3 Will, 3 Atk, 1 Def, 5HP - 1 Resource to heal 1 damage.\n\n \n\nThe point value is equal, Aragorn's get a +1 defense but have a -1 Will. But look at their abilities. For the same price, Aragorn can ready. I argue that aragorn is the better quester, because while he quests for 1 less, for that 1 resource he can then block or attack. Glorfindel is restricted to one role or the other.For a 12 threat, you get JUST a quester, or JUST an attacker. He can heal damage for a 1 for 1 cost, which is really not great at all considering all the better healing options within his sphere.\n\nLoragorn might be more restricted in his use per round, but his 1 defense means he likely takes 1 damage less then glorfindel in the same situation, and he doesn't have to pay to undo that soaked damage. His ability is extremely useful in secrecy decks, or decks that focus on using threat as a tool (bormir/frodo).\n\nI think glorifindel is much better thanks to his new horse friend, but Its not a perfect fix. There is always a chance you never will draw that card. There are a lot of cards that will remove the horse from him as well. Its a great upgrade, and I will be trying him out for the first time since I first played the game and played the premade lore deck… but I still don't think he's worth his cost. Playable? Yes. But so is every card in this game, the good and the bad.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641096","commentId":641096,"userName":"Mattr0polis","timestamp":1338988826,"content":"I do not understand the forum posters here sometimes. FFG gives us a Hero with multiple 3's, which no other Hero has and of which is tied for 1st or 2nd highest in both Willpower and Attack but make up for it and keep it balanced by having high threat and an ability that is not an every-turn usable one as much. You can even easily build decks with multiple Unexpected Courages to utilize both of his 3's (not my fault if some people choose to be cheap and not buy extra core sets or at least proxy cards) or a co-op friend with Brand hero or etc etc. Also like you pointed out, Captain Poe, there's always a chance you won't draw a certain card. A card like the healing you put in deck. Having access to healing every turn no matter what you draw I would argue can be pretty amazing in an emergency. Overall he's a good hero.\n\nWhat will make you people happy? A Glorfindel that wins Willpower and Attack and has access to Asfaloth AND has a powerful ability AND has cheaper threat? And most people it sounds like want him to be Spirit, which is already clearly the best sphere.\n\nIt's just a game and at the end of the day you need to keep some sort of balance on the cards.\n\nAnd to do what lleimmoen says, that he's okay and you just want a different ability: why should they do that? Why should they waste all of our time just remaking cards they already made just to change 1 line of text? Every card game I've ever played has some imperfect cards. Plus, we only get a limited supply of cards per month, I do not wish to see them wasted on remakes when there is still so much in Middle Earth to explore. And if they WERE going to do remakes, there's quite a few cards to change far before Glorfindel. Like the almost completely unusable Meneldor's Flight. Or errata'ed Zigil Miners.\n\n \n\nIf they do make another Glorfindel, I'll shrug my shoulders, check him out and probably use him. But I'll constantly wonder about what other Middle Earth characters we could have had by now instead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641100","commentId":641100,"userName":"Captain Poe","timestamp":1338989450,"content":"Mattr0polis said:\n\nI do not understand the forum posters here sometimes. FFG gives us a Hero with multiple 3's, which no other Hero has and of which is tied for 1st or 2nd highest in both Willpower and Attack but make up for it and keep it balanced by having high threat and an ability that is not an every-turn usable one as much. You can even easily build decks with multiple Unexpected Courages to utilize both of his 3's (not my fault if some people choose to be cheap and not buy extra core sets or at least proxy cards) or a co-op friend with Brand hero or etc etc. Also like you pointed out, Captain Poe, there's always a chance you won't draw a certain card. A card like the healing you put in deck. Having access to healing every turn no matter what you draw I would argue can be pretty amazing in an emergency. Overall he's a good hero.\n\nWhat will make you people happy? A Glorfindel that wins Willpower and Attack and has access to Asfaloth AND has a powerful ability AND has cheaper threat? And most people it sounds like want him to be Spirit, which is already clearly the best sphere.\n\nIt's just a game and at the end of the day you need to keep some sort of balance on the cards.\n\nAnd to do what lleimmoen says, that he's okay and you just want a different ability: why should they do that? Why should they waste all of our time just remaking cards they already made just to change 1 line of text? Every card game I've ever played has some imperfect cards. Plus, we only get a limited supply of cards per month, I do not wish to see them wasted on remakes when there is still so much in Middle Earth to explore. And if they WERE going to do remakes, there's quite a few cards to change far before Glorfindel. Like the almost completely unusable Meneldor's Flight. Or errata'ed Zigil Miners.\n\n \n\nIf they do make another Glorfindel, I'll shrug my shoulders, check him out and probably use him. But I'll constantly wonder about what other Middle Earth characters we could of had by now instead.\n\n\n\n \n\nYou do have some valid points. I just feel that the 1 for 1 healing is just not that great. Can it be a life saver? Yes… but so can every heroe's ability in the right circumstances. I think he is getting better, especially with cards that only target noldor, or unique noldor at that. Like I said, with the introduction of asfaloth, I am really excited to use glorfindel… but its taken me, what, 10 expansions or so to get to the point where I would even consider using him over any other lore hero. His two 3's just isn't enough of a selling point for me.\n\nFor me, i just felt like he needed the slightest tweek (remove 1 damage from 2 characters? Remove 2 damage from one character? I dunno… its a difficult balance to make him on par without crossing the line of overpowered)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641110","commentId":641110,"userName":"lleimmoen","timestamp":1338990420,"content":"Look at it this way Mattr0polis, some people like the card version of Glorfindel, some don't. Actually, it wouldn't be far from the truth that before Asfaloth showed up, every other player called him among the worst in the game. So the consensus is there, I do not claim those people be right or wrong but it is not us few lunatics that think the card is underwhelming. And then you have this, why should one of the most powerful characters in Middle-earth (fact) be represented by an underwhelming card, a few may ask. You've got your reasoning and it is understandable from your point of view but instead of saying \"I don't understand\" maybe it would be more useful to try and understand.\n\nOf course the game cannot be pefrectly accurate in any way. Still people won't stop wishing it's as accurate as it can be.\n\nWhat would make me happy? I actually wouldn't mind if Glorfindel had threat cost of 14 or even higher. I actually think he should have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641144","commentId":641144,"userName":"Captain Poe","timestamp":1338992829,"content":"lleimmoen said:\n\nLook at it this way Mattr0polis, some people like the card version of Glorfindel, some don't. Actually, it wouldn't be far from the truth that before Asfaloth showed up, every other player called him among the worst in the game. So the consensus is there, I do not claim those people be right or wrong but it is not us few lunatics that think the card is underwhelming. And then you have this, why should one of the most powerful characters in Middle-earth (fact) be represented by an underwhelming card, a few may ask. You've got your reasoning and it is understandable from your point of view but instead of saying \"I don't understand\" maybe it would be more useful to try and understand.\n\nOf course the game cannot be pefrectly accurate in any way. Still people won't stop wishing it's as accurate as it can be.\n\n\n\n \n\nExactly. I'm not asking that Glorfindel be as powerful in the game as he is in the books. Its not like i'm saying he should be able to exhaust to destroy the nameless fear (which he should!).  I play solo, thats it. In a solo deck, each hero needs to play a key role. Eyown can do the questing of 2-3 characters worth. Boromir is an amazing attacker/blocker. Bifur is a decent quester, a cheap hero, and great for resource management. What can Glorifindel do? If I need a quester, there are cheaper questers. If I need an attacker, there are better attackers. If I need a healer, I throw some allies or healing events/attachments which are all more efficient at what they do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641180","commentId":641180,"userName":"Budgernaut","timestamp":1338995528,"content":" I think it'll be a different hero -- not Glorfindel. Not yet, anyway. I think that even though they've released Asfaloth, they're going to wait till the final pack to bring out Glorfindel since that pack has the balrog in it. Since Glorfindel slew a balrog, it would be neat to have him come in the same pack as a balrog. Also, as others have mentioned, we are due a spirit hero and I think it more likely to get a Tactics Glorfindel because he was such an amazing fighter (again, he killed a balrog). So, random Spirit hero this pack, Tactics sphere Glorfindel next pack.\n\nDisclaimer: I'm not sure I really believe what I just wrote, but wanted to throw it out there as another possibility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641185","commentId":641185,"userName":"richsabre","timestamp":1338995689,"content":"how funny would it be if it was really random hero choice…….someone like famer maggot?\n\n…..wait…..i actually would love to see that…..im sticking with maggot happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641197","commentId":641197,"userName":"Captain Poe","timestamp":1338996787,"content":"601264_429325760421555_1825849757_n.jpg [http://sphotos.xx.fbcdn.net/hphotos-ash3/601264_429325760421555_1825849757_n.jpg]\n\n \n\nSpoiled"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641200","commentId":641200,"userName":"richsabre","timestamp":1338997125,"content":"OVERPOWERED!! POWERCREEEPPPPP!!!! \n\nand oh i do love his 'quote' haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641215","commentId":641215,"userName":"Glaurung","timestamp":1338999191,"content":"Glorifindel is amazing hero! I already post before my deck Glor/Bilbo/Frodo. Is the best solo deck in my opinion cose can win against any current quest with very good win ratio. Now with Asfaloth this deck go 1000 times better! Glorifindel is a key hero for this deck. 1 Uc and you have quester/attacker Glor every round. + Slowly he can heal all the party in the couple of rounds. In my opinion he is Balanced perfect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641220","commentId":641220,"userName":"Robert McMutton","timestamp":1339000162,"content":" If it has to be Glorfindel, having the experience of Strider… the stats will be the same, and just the sphere and special hability will change, i think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641225","commentId":641225,"userName":"lleimmoen","timestamp":1339000968,"content":"The Fatty card is awesome.\n\nBut now outside of the fun of it, what if he'd be an ally of some low cost and the same response plus a positive response to that response - thematically corresponding to the role Fredegar Bolger was playing by staying behind and impersonating and then sounding the alarm when danger came; maybe it's a bit too ambitious to make that work but I'd love such a card. Anyone up for it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641227","commentId":641227,"userName":"richsabre","timestamp":1339001330,"content":"lleimmoen said:\n\n \n\nThe Fatty card is awesome.\n\nBut now outside of the fun of it, what if he'd be an ally of some low cost and the same response plus a positive response to that response - thematically corresponding to the role Fredegar Bolger was playing by staying behind and impersonating and then sounding the alarm when danger came; maybe it's a bit too ambitious to make that work but I'd love such a card. Anyone up for it?\n\n \n\n \n\nagreed- ive been keen for more hobbits - especially the less central ones, since the start…..i like your thinking……on the theme point, perhaps he could cancel threat increase or treachery cards….we all want that other test of will dont we?\n\non a side note that crickhollow scene is perhaps one of my very favourite scenes of all time…..amazing atmosphere when the nazgul surround the house- i imaged something very horrifying when i read it! the way they stood there for ages without moving still creeps me out"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641354","commentId":641354,"userName":"lleimmoen","timestamp":1339039458,"content":"richsabre said:\n\n \n\non a side note that crickhollow scene is perhaps one of my very favourite scenes of all time…..amazing atmosphere when the nazgul surround the house- i imaged something very horrifying when i read it! the way they stood there for ages without moving still creeps me out\n\n \n\n \n\nAnd beautifully written. I think of that any time when some snob calls Tolkien writing not \"good\" enough in style, like that Nobel Prize committee."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641660","commentId":641660,"userName":"Mattr0polis","timestamp":1339084016,"content":"Glaurung said:\n\n \n\nGlorifindel is amazing hero! I already post before my deck Glor/Bilbo/Frodo. Is the best solo deck in my opinion cose can win against any current quest with very good win ratio. Now with Asfaloth this deck go 1000 times better! Glorifindel is a key hero for this deck. 1 Uc and you have quester/attacker Glor every round. + Slowly he can heal all the party in the couple of rounds. In my opinion he is Balanced perfect.\n\n \n\n \n\nExactly. He fits great in solid Lore or Lore/Spirit decks because a lot of other heroes in those two spheres are lower threat and so balance out with Glorfindels. And then you put Courage on him to quest and attack while also getting to always keep up on damages which is also great in Lore/Spirit because many of those other heroes are weaker. And now Asfaloth is just icing on the cake.\n\nI think it comes down to the different ways you can deck builds too. Alot of anti-Glorfindel people seem to want all 3 main game phases covered by a Hero: aka 1 quester, 1 defender, 1 attacker and I agree some decks need that kind of setup.\n\nBut a hero like Glorfindel, you can double him up as a quester/attacker with Courage, which leaves open a slot for a hero who's only job is some sort of tricks. Like Beravor mega drawing or Eleanor cancelling horrible treacheries, etc. Or to be able to send 2 heroes questing and still have an attacker and blocker. You can put Courage on any Hero but Glorfindel is the best in these type of decks because of his multiple 3's.\n\nBoth deck builds have merit sometimes, which is why Glorfindel has merit sometimes. Both deck builds also have some down sides, like the 3 different phase hero builds can get screwed when one of the heroes die. And the trick heroes type of builds can sometimes start off slow if you can't find a Courage.\n\nPeople just need to take into account the multiple ways you can build a hero team when evaluating Glorfindel, that's all I ask."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641682","commentId":641682,"userName":"lleimmoen","timestamp":1339087195,"content":"And those are all good points. And I was really never doubting any of that although I was at times having a bit of trouble to find place for Glorfindel in my decks although I see now it is perfectly do-able and the whole thing has gotten much better with Asfaloth. My only concern was in terms of the theme because I felt it doesn't do the great hero from the First Age justice. It is just one way of looking at it, and we can just agree to disagree so we don't keep beating the dead wood too long. Still wondering whether he shows up next though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641684","commentId":641684,"userName":"Mattr0polis","timestamp":1339087659,"content":"lleimmoen said:\n\n \n\nStill wondering whether he shows up next though.\n\n \n\n \n\nYeah, I mean, I honestly don't care too much either way, if it is him or just someone new. I just want the new pack!\n\nI NEED it! ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641685","commentId":641685,"userName":"richsabre","timestamp":1339087748,"content":"Mattr0polis said:\n\nlleimmoen said:\n\n \n\nStill wondering whether he shows up next though.\n\n \n\n \n\nYeah, I mean, I honestly don't care too much either way, if it is him or just someone new. I just want the new pack!\n\nI NEED it! ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\n\n\nhell im still waiting for the long dark! soon though…………gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641690","commentId":641690,"userName":"lleimmoen","timestamp":1339088342,"content":"How come it takes so long to get to England? My retailer has actually said he's ordering from England and I got the pack last week. sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=641705","commentId":641705,"userName":"richsabre","timestamp":1339091583,"content":"lleimmoen said:\n\n \n\nHow come it takes so long to get to England? My retailer has actually said he's ordering from England and I got the pack last week. sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif]\n\n \n\n \n\nnah the richsabre treasury is low gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]…….hoping to get it next week though, its going to be good- its the first pack i havent seen the full spoilers of so itl be a nice surprise"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643015","commentId":643015,"userName":"jjeagle","timestamp":1339421890,"content":"A point I have noticed looking back at the preview for Durin's Axe [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/foundations-of-stone/durins-axe.png] from FOS.\n\nThe card is numbered 1 of 24. Assuming that there are 28 player cards as there have been in every other set, this means (I think) that either:\n\n1. the card is misnumbered (not unprecedented)\n\n2. there are 8 quest cards, so either a very lengthy quest, or a Flight from Moria style \"quest deck\" or similar\n\n3. there are two separate encounter sets in FOS, one large one and one small one (maybe a small one that will be added in at a certain quest stage)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643050","commentId":643050,"userName":"lleimmoen","timestamp":1339426009,"content":"Hmm. Or more player cards also? Path of Need for instance may be an additional one? Although since they keep saying each player card is included thrice, Path of Need may be as well… Interesting catch anyways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643056","commentId":643056,"userName":"Captain Poe","timestamp":1339426968,"content":"Do we think the article was delayed? I think we usually get it fairly early in the day on mondays."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643058","commentId":643058,"userName":"jjeagle","timestamp":1339427259,"content":"The \"launch\" article plus final preview for TLD was published on Wed 16 May, so don't hold your breath…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643066","commentId":643066,"userName":"lleimmoen","timestamp":1339428532,"content":"I know. They sometimes do Wednesday instead which drives me crazy. Also, different time zones can make it suck as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643738","commentId":643738,"userName":"Mr Coffee","timestamp":1339533282,"content":"richsabre said:\n\nproblem with elves is we so seldom see them in 'action' ….i mean take galadriel for example…..i believe i am right in saying she was only only surviving elf in the 3rd age to have made the trip over the helcaraxe wastes……so you could take that to be a huge amount of willpower…..but is it relavent in a third age middle earth? im not so sure, as we never see galadriel as anything other than a wise leader and member of the white council….\n\nhowever in more than one occasion her power or influence contributes to the war against sauron….ie lorien being assaulted 3 times by dol guldur, which she eventually destroys after the war of the ring, so she could function more in her leadership powers\n\nand of course you have her ring of power nenya….so i guess my point is how do you define such powerful characters? i think it is difficult to place where a major player in the events of middle earth should lie….and it is perhaps worse with elves as their ways are so distanced and secretive in the 3rd age\n\nso perhaps it is better to have these characters as 'gandalf' type cards so that there is no themetic/gameplay issues…..and yet id be dissapointed if they didnt at least give elrond/galadriel/celeborn all a shot\n\nrich\n\n\n\n \n\nGaladriel is personally my LEAST favorite character in JRRT's writings.  Probably because she was a \"retcon\" before anyone knew what the hell that even was… lol.  She wasn't in his original writings on Middle-Earth, but had to be \"back-written\" into the story due to her inclusion in the later writings (that were published first).  That's why she never really gets mentioned outside of Lorien (other than her inclusion in the \"rebellion\" later)…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643859","commentId":643859,"userName":"Quit2","timestamp":1339563221,"content":"jjeagle said:\n\nA point I have noticed looking back at the preview for Durin's Axe [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/Dwarrowdelf/foundations-of-stone/durins-axe.png] from FOS.\n\nThe card is numbered 1 of 24. Assuming that there are 28 player cards as there have been in every other set, this means (I think) that either:\n\n1. the card is misnumbered (not unprecedented)\n\n2. there are 8 quest cards, so either a very lengthy quest, or a Flight from Moria style \"quest deck\" or similar\n\n3. there are two separate encounter sets in FOS, one large one and one small one (maybe a small one that will be added in at a certain quest stage)\n\n\n\n4. There are multiple copies of certain encounter cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=643935","commentId":643935,"userName":"jjeagle","timestamp":1339574857,"content":"No, that has (so far) been taken into account in the new \"x of y\" numbering for encounter sets."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644301","commentId":644301,"userName":"Sprenger","timestamp":1339628936,"content":"If my math is correct it should be 24 encounter cards, 1 hero, 2 quest cards and 33 (11x3) player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644328","commentId":644328,"userName":"jjeagle","timestamp":1339636259,"content":"What makes you think there will be only 2 quest cards again? I am hoping for more personally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644338","commentId":644338,"userName":"Sprenger","timestamp":1339638169,"content":" It can only be 2 or 5 quest cards. 8+ just seems dumb.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644351","commentId":644351,"userName":"Quit2","timestamp":1339641436,"content":"Sprenger said:\n\nIf my math is correct it should be 24 encounter cards, 1 hero, 2 quest cards and 33 (11x3) player cards.\n\n\n\nMaybe the \"limit 1 per deck\" are not 3 times in the pack.\n\nIt could be\n\n24 encounter\n1 hero\n4 quest cards\n31 player cards (10x3 + 1 or 9x3 + 4)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644375","commentId":644375,"userName":"Sprenger","timestamp":1339645587,"content":"quit said:\n\nSprenger said:\n\n \n\nIf my math is correct it should be 24 encounter cards, 1 hero, 2 quest cards and 33 (11x3) player cards.\n\n \n\n \n\nMaybe the \"limit 1 per deck\" are not 3 times in the pack.\n\nIt could be\n\n24 encounter\n1 hero\n4 quest cards\n31 player cards (10x3 + 1 or 9x3 + 4)\n\n\n\n \n\nI can't see them doing just 1 copy of a player card. Eventually we will have enough cards to create more than 1 Leadership deck and it would be annoying having to find this card and put it in the your current deck (assuming you want it in both decks) every time you switched decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644483","commentId":644483,"userName":"Mattr0polis","timestamp":1339669455,"content":"Sprenger said:\n\n \n\nI can't see them doing just 1 copy of a player card. Eventually we will have enough cards to create more than 1 Leadership deck and it would be annoying having to find this card and put it in the your current deck (assuming you want it in both decks) every time you switched decks. \n\n \n\n \n\nYeah, but at the same time, they can't plan for people that want to build multiple decks. They give us a full 1 deck playset, usually 3x of a card since that's the limit. Just as I don't get 6x of a card that I'd want for 2 different decks (or 3x of every hero) I don't think they should waste slots to give us 3x of a card that is only 1 per deck.\n\nI'd much rather see those slots be used for other 1 per decks, extra new heroes, or extra encounter cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644492","commentId":644492,"userName":"Mattr0polis","timestamp":1339670675,"content":"Also, you can already build 2 Leadership decks if you don't double up any heroes (or of any sphere except spirit, until we get New Glorfindel).\n\nWhat's the difference between not having enough Steward of Gondors or Sneak Attacks for 2 decks and not having enough Path of Needs for 2 decks?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644500","commentId":644500,"userName":"lleimmoen","timestamp":1339671662,"content":"Mattr0polis said:\n\nAlso, you can already build 2 Leadership decks if you don't double up any heroes (or of any sphere except spirit, until we get New Glorfindel).\n\nWhat's the difference between not having enough Steward of Gondors or Sneak Attacks for 2 decks and not having enough Path of Needs for 2 decks?\n\n\n\nI agree, I myself don't want Path of Need three times, I think I might have a hard time finding a single deck with a slot for it.\n\nI am still pissed what they did with the core set though, three a piece should have been a rule there also."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644508","commentId":644508,"userName":"Mattr0polis","timestamp":1339672364,"content":"lleimmoen said:\n\nI am still pissed what they did with the core set though, three a piece should have been a rule there also.\n\n\n\nLol yeah, I should've picked different cards for my example. Steward and Sneak Attack there isn't enough for ONE deck, let alone two. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nI should've said Elrond's Counsel or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644536","commentId":644536,"userName":"jjeagle","timestamp":1339675002,"content":"Sprenger said:\n\n It can only be 2 or 5 quest cards. 8+ just seems dumb.\n\n \n\n\n\nThere are 8 quest cards in Flight from Moria, so, dumb or not, it is at least possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644537","commentId":644537,"userName":"lleimmoen","timestamp":1339675019,"content":"On a slightly different topic, anyone picked up this one already? It is usually that we see a person announcing it before ffg do… and I was really expecting the \"on sale\" announcement this Monday."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644666","commentId":644666,"userName":"DurinIII","timestamp":1339690520,"content":"Na man; I am usually one of those guys who posts about a day before (or on the day of) FF releases it.  I am oddly surprised this time around as it seems like they are backlogged about a week from the usual release on these adventure packs.  Please hurry up!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64896-foundation-of-stone-anticipation/?do=findComment&comment=644685","commentId":644685,"userName":"lleimmoen","timestamp":1339693166,"content":"Yeah, for a while I thought they finally had it going nicely with some frequency. And then I heard they want to release the Hobbit in July which now leaves half a month and a half for three releases. I fear they won't make it."}]}