{"url":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/","title":"Secrecy -is it just me?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634437","commentId":634437,"userName":"Boris_the_Dwarf","timestamp":1337686191,"content":"I kind of wish FFG would get off the Secrecy kick. IMO it's a bad - strike that, terrible - ability that doesn't mesh with the concepts of the rest of the game. When you have to design an entire subset of cards to work in tandem in order to make a keyword ability play within the rules of the game you've created, I'm sorry but that is not a success.\n\nAfter looking at the new ally preview card today, I can tell you I was already thinking about what I would take out of the deck I play in solo to fit 2-3 of those in. It looks like a great card to be sure. But then I read the write-up with the preview, and I was like, umm what? How does this card help Secrecy? Who cares! The question should be: How does Secrecy help THIS CARD, or THE DECK? She pairs great with the Zigil Miner for people who need a ton of resources, but I think she will have great use in general for finding the cards you need at just the right time. Secrecy is the last thing on my mind. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634451","commentId":634451,"userName":"Rapier1","timestamp":1337687325,"content":" Secrecy would be on your mind if you like playing with less than 3 heroes.\n\n \n\nPersonally I think it's a good attempt to make card costs scale with hero count on a single rule. I'm not sure it's strictly the neatest way. (Having cards with a split cost 2/4 - would be the same but not require a key word). I do quite like it being tied to threat as in - the evil hasn't noticed you yet and you build up.\n\nIt gives you a new way to play and makes some cards shine. They're only harping on about secrecy so much because it's \"the\" thing for this cycle.\n\n \n\nI wonder if we'll see more eagles and more secrecy cards ever after this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634474","commentId":634474,"userName":"leptokurt","timestamp":1337689375,"content":"So far secrecy doesn't work in solo mode. I will give it a try against The Long Dark, but so far I have been disappointed with this concept. It doesn't work against any of the Mirkwood and KD scenarios at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634481","commentId":634481,"userName":"richsabre","timestamp":1337689961,"content":"i have yet to work with secrecy properly….as a purely solo player it doesnt offer all that much…saying that i quite like the idea, and dont want them to give up on it yet\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634492","commentId":634492,"userName":"HilariousPete","timestamp":1337690773,"content":"I like the idea of secrecy. It's increasing deck diversity. Without it, there would be virtually no one playing with 1 or 2 heroes.\n\nI also feel that there are not enough good secrecy cards out there currently. I wait until the cycle ends. Support of the Eagles and Eagles of the Misty Mountains were 2 very important cards for eagle decks, and FFG put them in the last AP of the Mirkwood cycle. So I hope we will see a few more good secrecy cards in the last 2 APs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634506","commentId":634506,"userName":"Captain Poe","timestamp":1337692096,"content":"leptokurt said:\n\nSo far secrecy doesn't work in solo mode. I will give it a try against The Long Dark, but so far I have been disappointed with this concept. It doesn't work against any of the Mirkwood and KD scenarios at all.\n\n\n\n \n\n I was able to solo Journey to Rivendell using a secrecy deck and Aragorn (Leadship) with Bifur. It worked very well, as that quest has a boat load of ambushes, but my threat was low the entire time, so I was able to sneak past most combatants. It also worked because arwin generates resources, which is the biggest problem I've experienced running the same deck in other quests. When I tried the same deck on Watcher in the water (which has a lot of cards that hit your resources, I was basically having to auto restart if i didn't draw one of my   3 resourceful's and 2 stewards in my opening draw. Even then,  It couldn't beat this mission with it.\n\nI guess it depends on the deck and the quest, but its not impossible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634511","commentId":634511,"userName":"leptokurt","timestamp":1337692708,"content":"Captain Poe said:\n\nleptokurt said:\n\n \n\nSo far secrecy doesn't work in solo mode. I will give it a try against The Long Dark, but so far I have been disappointed with this concept. It doesn't work against any of the Mirkwood and KD scenarios at all.\n\n \n\n \n\n \n\n I was able to solo Journey to Rivendell using a secrecy deck and Aragorn (Leadship) with Bifur. It worked very well, as that quest has a boat load of ambushes, but my threat was low the entire time, so I was able to sneak past most combatants. It also worked because arwin generates resources, which is the biggest problem I've experienced running the same deck in other quests. When I tried the same deck on Watcher in the water (which has a lot of cards that hit your resources, I was basically having to auto restart if i didn't draw one of my   3 resourceful's and 2 stewards in my opening draw. Even then,  It couldn't beat this mission with it.\n\nI guess it depends on the deck and the quest, but its not impossible.\n\n\n\nYes, this is the one scenario where secrecy absolutely shines. Watcher OTOH is not for secrecy - which is a shame as they made a big deal about sneaking around the Watcher with a secrecy deck. Haven't tried secrecy against Redhorn yet, I think it could work there too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634576","commentId":634576,"userName":"leptokurt","timestamp":1337698534,"content":"Ok, after five attempts I finally beat TLD with a secrecy deck (Bifur/Frodo). First game I had two Goblin Followers in round 1 and 2. In game 2 I had two of those spiders who force you to discard 4 cards - which means I had no deck at all anymore. In my six games Arwen never appeared, apparently she had to spent some time in front of her mirror instead of joining my fellowship - or she was busy holding Elassar's hand. Who knows…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634607","commentId":634607,"userName":"Bullroarer Took","timestamp":1337701818,"content":" When the Eagles cards first came out I didn't think they worked very well.  It wasn't until the entire Mirkwood cycle was finished that I learned to appreciate them.  With that in mind I'm trying not to judge Secrecy too early, but…\n\nSecrecy is NOT a free lunch.  Just because those enemies don't engage right away doesn't mean they're gone.  They're threat is still a factor and sooner or later you'll have to face them, often more than one at a time once your threat reaches the tipping point.  And if you track VPs (which I don't) you are giving away 10 points a turn while you are sneaking around.  So I don't think Secrecy is quite ready yet, and it may never be for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634641","commentId":634641,"userName":"lleimmoen","timestamp":1337704938,"content":"The Watcher - together with Dol Guldur obviously - is the worst quest to use the secrecy on. It is funny since they spent much effort on secrecy in the Watcher previews, even posted the deck that has little to no chance beating the quest.\n\nBut I really like the idea and am quite surprised how well it works already, given it shall work much better still with the card pool surely growing much yet. Timely Aid and Resourceful are the main strategy cards now, I say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634645","commentId":634645,"userName":"leptokurt","timestamp":1337705408,"content":"Hmmmh, three wins in a row now against TLD, with an average result of 95. Not too bad\n\nAs long as I am not confronted with the real nasty cards I have a chance and can even score mediocre results. I am hinking about adding a third hero - Dúnhere, Dwalin, or Eleanor…?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634656","commentId":634656,"userName":"Drengi","timestamp":1337705856,"content":"As above, I didnt use the Eagles until the whole set was out… gotta have things in completion!\n\n \n\n I havent actually played any Darrowdelf scenarios yet, I need the whole set before I start, I did the same thing with Mirkwood!\n\n Im sure when the cycle is complete secrecy will rock!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634673","commentId":634673,"userName":"richsabre","timestamp":1337708331,"content":"so (this may be a stupid question) will secrecy continue on after the cycle?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634686","commentId":634686,"userName":"Budgernaut","timestamp":1337709425,"content":" I suppose that depends on what you're asking. Will you still be able to run secrecy decks? Sure. Will FFG continue to print cards with a Secrecy discount? Not sure. I hope so. It would be a shame to let this mechanic go by as a one-cycle fling, especially since it's not like every card so far has had a secrecy cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634688","commentId":634688,"userName":"richsabre","timestamp":1337709618,"content":"Budgernaut said:\n\n \n\n I suppose that depends on what you're asking. Will you still be able to run secrecy decks? Sure. Will FFG continue to print cards with a Secrecy discount? Not sure. I hope so. It would be a shame to let this mechanic go by as a one-cycle fling, especially since it's not like every card so far has had a secrecy cost.\n\n \n\n \n\nyes i was meaning would they continue to print the secrecy cards…personally i think there wont be all that many of them if its a once cycle thing…..i would assume they would continue…but could be wrong!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634700","commentId":634700,"userName":"Beano","timestamp":1337710660,"content":"The good thing about secrecy is that they can quite easily target cards at both secrecy and normal decks just by adjusting the price of the card. For instance, Timely Aid can be a fantastic card in any deck, it just happens to scale to be effective in secrecy. I can certainly imagine that it makes card design more challenging to target cards at both strategies but it can be done . . .\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634707","commentId":634707,"userName":"richsabre","timestamp":1337711347,"content":"well they certainly have a great design team….theres no doubt…however it all depends whether secrecy holds their attention for long enough or is getting whatever results they were aiming for"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634713","commentId":634713,"userName":"Boris_the_Dwarf","timestamp":1337711818,"content":" This is the line from the article that just bugs me:\n\n\"Of course, the Imladris Stargazer is a natural companion to another Spirit ally, the Zigil Miner (Khazad-dûm, 9), but she’s potentially more interesting in combination with a number of Secrecy-focused cards. The Imladris Stargazer offers Secrecy decks a means of draw manipulation that rivals that of Gildor Inglorion (The Hills of Emyn Muil, 79), but one that plays for a mere fraction of Gildor's cost. Thus, the Stargazer is far more likely to aid a Secrecy strategy during its vital early turns.\"\n\nWhen I finished reading that first sentence, I just wanted to scream out loud, \"No, she's not!\" There's nothing about \"Secrecy-focused cards\" that makes her \"potentially more interesting with them\" than if you were playing a traditional non-Secrecy deck and were digging through the top cards looking for the best option. And yes, she costs 3 less than Gildor (who is unique and actually grants you the benefit of Elrond's Counsel), but he also has +2 WP, +3 Attack, and +1 Defense, and +2 HP. What does she have? That's right 0/0/1 for stats, and 1 Hit Point. She may be a \"fraction\" of Gildor's cost, but she can only do a \"fraction\" of what he can so that seems fair. Frankly I would have limited her cost to 1 Spirit and reduced the number of cards she can look at to 3 or 4. She's an expensive blocker most of the game, unless you are using her in a very tight combo. Whether the card you are looking at has Secrecy written on it or not is irrelevant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=634995","commentId":634995,"userName":"booored","timestamp":1337770732,"content":"well lets see… I think secrecy might pan out.. I mean eagles was lame as hell until the end of the cycle.. dwarf sucked untill khaz and hobbits are getting the big turbo charge soon (please i wana see a tactics sam!).. The point is until the full cycle is out we do not know the full power. There is defiantly a load of threat management stuff coming out.\n\nTragic (I play with him a bit in lackeyCCG) is brewing a pretty interesting draw deck for secrecy. I am probably going to be yelled at for this.. as it is early.. but the main idea is to use Aragorn (Lore) in the secrecy deck and then Bilbo and / or Beravore to draw. The version I have seen is for 2 player. Anyway the idea is that you draw a ton of cards into your hand.. from a secrecy deck, and then BANG you use Aragorns ability to reset yourself under secrecy level and play like a huge smack ton of cards in a single turn.. all at secrecy cost. I have seen his brew version and the engine defiantly works.. the question is will enough good cards be available to make the \"a Secret Dump Deck\" as he calls it, worth it.\n\nThe point is that secrecy is cool as it is a macaronic that people can play with.. and until the card pool grows you can nvr tell where it will end up.\n\nAs for how this card helps… well take a look…. and who knows what is next… but most that we know off have a deck peak machanic.\n\nmed_timely-aid-trg.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_timely-aid-trg.jpg]med_needful-to-know-trg.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_needful-to-know-trg.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635002","commentId":635002,"userName":"cordeirooo","timestamp":1337771589,"content":"Yes, secrecy is worth it if you build around it.\n\n \n\nI have a Lore/Leadership that works wonders in 2-player games, and most of my cards costs 4-5, mostly to take advantage of Taking Initiative (it's a wonderful card in my opinion). I use most Secrecy Cards available to those two spheres and lots of Allies to help me in questing and combat; it starts slow, only get a good Will on t2 (with luck) and more consistently on t3.\n\nThere is a certain time in the game that Taking isn't useful anymore, but that's why you have Protector of Lórien, to dump useless/not-so-useful cards in your hand for will/def boost.\n\nThe Lore sphere is great for Secrecy because it have useful people both for combat and questing! Haldir and Gildor are Uniques, and as such, they are supposed to be very good, but heck, putting them into play soon can make a huge difference. Mirkwood Runner is there too, he is great to get those Trolls. Another thing is that the deck has a good amount of Sentinel/Ranged, so if the other deck (an attrition-based) is having some problems in combat, this Secrecy can help a little bit!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635003","commentId":635003,"userName":"Budgernaut","timestamp":1337771663,"content":"booored said:\n\nTragic (I play with him a bit in lackeyCCG) is brewing a pretty interesting draw deck for secrecy. I am probably going to be yelled at for this.. as it is early.. but the main idea is to use Aragorn (Lore) in the secrecy deck and then Bilbo and / or Beravore to draw. The version I have seen is for 2 player. Anyway the idea is that you draw a ton of cards into your hand.. from a secrecy deck, and then BANG you use Aragorns ability to reset yourself under secrecy level and play like a huge smack ton of cards in a single turn.. all at secrecy cost. I have seen his brew version and the engine defiantly works.. the question is will enough good cards be available to make the \"a Secret Dump Deck\" as he calls it, worth it.\n\n\n\nI wouldn't worry about letting the cat out of the bag. No offense to you or Tragic, but that combination seemed pretty obvious to me right from when Aragorn (Lore) was announced. I just won't be able to execute it for a while since I have no Dwarrodelf packs . . . yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635005","commentId":635005,"userName":"booored","timestamp":1337772006,"content":"yeah well.. i aint seen anyone else mention it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635038","commentId":635038,"userName":"cordeirooo","timestamp":1337776410,"content":"As soon as he was previewed, the first thing that popped in my mind was an alliance with Frodo.\nYou can basically ignore most combat damage for a while and then reset yourself to Secrecy; Spirit has good cheap allies too, and ways to bring your threat down after reseting (Wandering Took, The Galadhrim's Greeting, Elrond's Counsel, etc), so I think it is the most obvious couple for Aragorn (Lore)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635046","commentId":635046,"userName":"richsabre","timestamp":1337776887,"content":"personally i think hes the most powerful hero in the game as, as stated above, he allows you to really exploit other heros abilities….also it makes great thematic sense…..four travel weary hobbits, fresh from the downs, come into the pracing pony…..and their threat is reset by the meeting with strider…great stuff"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635059","commentId":635059,"userName":"booored","timestamp":1337778035,"content":"cordeirooo said:\n\n \n\nAs soon as he was previewed, the first thing that popped in my mind was an alliance with Frodo.\nYou can basically ignore most combat damage for a while and then reset yourself to Secrecy; Spirit has good cheap allies too, and ways to bring your threat down after reseting (Wandering Took, The Galadhrim's Greeting, Elrond's Counsel, etc), so I think it is the most obvious couple for Aragorn (Lore).\n\n \n\n \n\njust remeber frodo only works once per turn.. so high agro encounter decks like say anduin he dosn't help as much as some people think. But yeah Boromire and Frodo are often talked about as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635070","commentId":635070,"userName":"cordeirooo","timestamp":1337778769,"content":"booored said:\n\ncordeirooo said:\n\n \n\nAs soon as he was previewed, the first thing that popped in my mind was an alliance with Frodo.\nYou can basically ignore most combat damage for a while and then reset yourself to Secrecy; Spirit has good cheap allies too, and ways to bring your threat down after reseting (Wandering Took, The Galadhrim's Greeting, Elrond's Counsel, etc), so I think it is the most obvious couple for Aragorn (Lore).\n\n \n\n \n\njust remeber frodo only works once per turn.. so high agro encounter decks like say anduin he dosn't help as much as some people think. But yeah Boromire and Frodo are often talked about as well\n\n\n\n \n\nDang! You're right.\nI didn't realize his 'once per turn' clause. What a shame. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nWell, you can still take a hit without worrying much, anyway. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n\nWhile I do agree Boromir could use the Strider's ability, I don't find the Lore/Tactics spheres conjunction very useful for a two-Hero deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635109","commentId":635109,"userName":"leptokurt","timestamp":1337783784,"content":"The card draw trick won't work in solo mode, as the big problem with secrecy decks (so far) is to survive the first 2-3 rounds. If you have a partner that is covering you, yep, it is fine. If you're on your own, you just can't wait too long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635287","commentId":635287,"userName":"Narsil0420","timestamp":1337826833,"content":"I've gotten some of my best scores with secrecy. I scored an 89 on Hunt for Gollum with Eowyn and Bilbo and a Zigil/secrecy deck. Also it works for 2 player as well, I've got the current highest score for the Juicebox 2-player Dead Marshes tournament thanks to secrecy. I also got a 105 on Road to Rivendell with Loragorn and Theodred. Theodred and Dunhere are also a good combo. Just give it a try and experiment, it's fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635310","commentId":635310,"userName":"booored","timestamp":1337832754,"content":"yeah ziggy+secrecy is fine for solo.. you get great scores and it is very consistant"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64939-secrecy-is-it-just-me/?do=findComment&comment=635376","commentId":635376,"userName":"DurinIII","timestamp":1337851142,"content":"Frodo's ability can actually be triggered \"once per phase,\" so don't forget that he can suck up damage in the Questing phase as well as the Combat phase. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}