{"url":"https://community.fantasyflightgames.com/topic/64934-watcher-in-the-water-tentacle-attachemnets/","title":"Watcher in the water: tentacle attachemnets?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64934-watcher-in-the-water-tentacle-attachemnets/?do=findComment&comment=634352","commentId":634352,"userName":"Captain Poe","timestamp":1337677165,"content":"Hey guys… played the watcher quest a few times last night… and ended up being felt up like a japanese anime school girl each time. I have a few questions…\n\n1. The tentacle states that it becomes an attachment. Is this supposed to be a condition? If not, how do you remove them?\n\n2. One of the orcs in the set says that when he comes into play, remove an attachment from one of your characters, if able. Does the tentacle qualify for this? I know its unintuitive that an enemy card could be used to aid you, but it doesnt specifically say  remove a attachment \"you control\".\n\n \n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64934-watcher-in-the-water-tentacle-attachemnets/?do=findComment&comment=634377","commentId":634377,"userName":"Troymk1","timestamp":1337679534,"content":"It does seem the Black Orcs are the only way to cut the tentacles from you.\n\nThis gives me a thought that the nuetral card that lets you put a discarded encounter card back onto the deck could be very useful here.\n\nKill the black orcs, put them back on top to clear a tentacle.  !!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64934-watcher-in-the-water-tentacle-attachemnets/?do=findComment&comment=634380","commentId":634380,"userName":"HilariousPete","timestamp":1337679587,"content":"1) The card doesn't specify that it's a condition attachment, so it is none.\n\n2) That's true, the Orc can be used to remove such an attachment. I don't feel it's counter-intuitive, in Tolkien's Middle-Earth, the forces of evil don't like each other and probably would kill each other if it weren't for Sauron and their common enemy, free people.\n\nThere has also been some discussion about this topic here [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=284&efcid=4&efidt=655240].\n\nNext to that Uruk, you can get rid of the tentacle attachment by either getting that character killed and resurrecting him via Stand and Fight or bringing him back in hand with Born Aloft or To the Eyrie for an ally; or Fortune and Fate or Landroval for an hero. Miner of the Iron Hills doesn't work, as you noticed, and I don't know of any card that can cancel forced effects or let you discard any attachment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64934-watcher-in-the-water-tentacle-attachemnets/?do=findComment&comment=634426","commentId":634426,"userName":"Captain Poe","timestamp":1337685274,"content":"Thanks for the clarifications and links"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64934-watcher-in-the-water-tentacle-attachemnets/?do=findComment&comment=634489","commentId":634489,"userName":"leptokurt","timestamp":1337690682,"content":"The better solution:\n\nlet a low cost ally join the attack and attach all tentacles to him/her*\n\n \n\n \n\n* if you don't use Daughter of the Nimrodel for healing, let her join forces to take some of the tentacle attachments"}]}