{"url":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/","title":"Playing with Two Heroes: Solo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=634488","commentId":634488,"userName":"gvaughn1","timestamp":1337690632,"content":"Has anyone seriously tried playing solo (or cooperative) for an extended period of time with 1 or 2 heroes?\n\nI think 1 hero would be impossible, but what about two heroes?  In theory, you could get two good heroes (in two different spheres) and still come in at a threat of 16-19 or so.  You'd have to load up your deck with 1-2 point cards (since you'll be light on resources to spend on high cost cards) and perhaps use Ziggy for the extra resources.\n\nI'm still pretty new, so I'm sure there are better strategies that people have tried.\n\nDoes anyone have success with this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=634548","commentId":634548,"userName":"Rapier1","timestamp":1337695764,"content":" Using two heroes is the entire goal of the secrecy deck. \n\nSecrecy is a keyword from the second cycle that reduces the cost of cards when you have low threat.\n\n \n\nIf you're new and only have the core set - in a 2 player game one person 'could' try a 2 hero strategy, however with only the core set you're really losing a lot and not gaining much.\n\n \n\nHowever before secrecy came out I did have 2 decks that were only 2 heroes. An eowyn/frodo solo spirit deck and a legolas/brand ranged + sentinel deck. So it can be done in 2 player with some of the Mirkwoord cycle cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=634575","commentId":634575,"userName":"gvaughn1","timestamp":1337698511,"content":"Cool.  The Eowyn/Frodo solo deck sounds interesting.  You'd only have a threat of around 16 to start so you could easily use Frodo to absorb damage and increase threat without pushing threat too high.  So Frodo could be your defensive star and Eowyn could quest.  Your biggest challenge will be offense, but I guess that what allies are for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=635851","commentId":635851,"userName":"lleimmoen","timestamp":1337934951,"content":"One of my decks is Théodred and Strider, with a deck much different from the one posted by ffg - has anyone tried that by the way, it seems not very good - no offense ffg, please, you have made many of my days more interesting with this game.\n\nWell, back to the topic, I really love the deck but it might struggle solo, most of my games are 2-player, I would need to swap a few cards to play solo. If I played for money, I would not choose that deck solo but as many have said, secrecy is relatively new with a very limited card pool (some six cards at the moment); it will definitely be more potent even for solo play when this cycle has finished.\n\nAs for Éowyn, Frodo, it is tempting to start at 16 and 6 willpower, plus Frodo can use the Good Meal to keep the threat down quite easily. Still, I think Dúnhere is nicely suited for secrecy deck, I have considered making Dúnhere, Háma on one side and Théodred, Éowyn on the other - nicely thematic, the Rohan Musketeers, eh… well, Riders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=636412","commentId":636412,"userName":"DurinIII","timestamp":1338047888,"content":"Yeah, I am still convinced that a lot more cards need to come out that utilize the secrecy ability in order to make it comparable to other 3-hero decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=636422","commentId":636422,"userName":"richsabre","timestamp":1338053394,"content":"agreed- thats why i hope they keep bringing them out after this cycle"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=636489","commentId":636489,"userName":"lleimmoen","timestamp":1338088385,"content":"I think it is quite plain they will. I think we shall see one or two in each Hobbit box, and one in each of the following smaller packs if ever they resume.\n\nBut then, I wonder if there's going to be yet another keyword introduced anytime soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=636504","commentId":636504,"userName":"richsabre","timestamp":1338094167,"content":"so if there is a new keyword then i guess the question is how will they divide their attention between them…..i think one in each on the adventure packs would be ok….1/9 would be slow going for secrecy lovers but at least its still growing….i just hope they dont have a habit of bringing a new keyword out each cyle and then loosing focus on the previous ones"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=636515","commentId":636515,"userName":"lleimmoen","timestamp":1338097859,"content":"One way to do it is to introduce more \"supporting\" cards for the secrecy, like Taking Initiative (I still haven't learnt how to use that one right, I guess)… you know cards that can go to \"normal\" 3 hero-decks and secrecy deck. Good Meal or Imladris Stargazer could be other examples of such.\n\nBut I doubt there'll be yet another new keyword soon. We actually don't know how they've got it planned, do we? Hobbit part 1, Hobbit part 2, nothing in between, and?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/64944-playing-with-two-heroes-solo/?do=findComment&comment=636516","commentId":636516,"userName":"richsabre","timestamp":1338098362,"content":"so what happens when the hobbit comes out in august…..another cycle starts in september time?\n\n "}]}