{"url":"https://community.fantasyflightgames.com/topic/65014-imrahil-and-eagles-of-the-misty-mountains/","title":"Imrahil and eagles of the misty mountains.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65014-imrahil-and-eagles-of-the-misty-mountains/?do=findComment&comment=635228","commentId":635228,"userName":"JonofPDX","timestamp":1337809473,"content":" Sorry if somebody has already asked this, but I am on a phone and searching the forums is proving difficult. My question is this: When an eagle (say winged guardian) leaves play (either by being killed or not spending its upkeep cost after blocking) while eagles of the misty mountains and prince imrahil are both out, would eotmm be able to attach it face down as a buff while it also readies imrahil? Thematically it make sense, but I am not sure if the eagle buff counts as the original card being \"in play\" and I don't know if it would leave play (triggering imrahil) before returning as the eagle buff.\n\n \n\nHelp please?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65014-imrahil-and-eagles-of-the-misty-mountains/?do=findComment&comment=635242","commentId":635242,"userName":"starhawk77","timestamp":1337811979,"content":"Sure, that will work.\n\nImrahil's response can be triggered after another character leaves play. Eagles of the Misty Mountains can trigger its response after another Eagle character leaves play. So, after an Eagle character leaves play, it will satisfy the trigger requirement for both effects. You then simply choose the order in which the responses resolve (not that it will likely matter). For gameplay purposes, it is irrelevant whether or not the discarded Eagle \"returns\" to play as an attachment; once it dies, that's all Imrahil needs to ready.\n\nBasically, any particular trigger can satisfy any number of appropriate response effects. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65014-imrahil-and-eagles-of-the-misty-mountains/?do=findComment&comment=635358","commentId":635358,"userName":"JonofPDX","timestamp":1337847158,"content":" Thanks for the quick reply--and thanks for helping out a new player :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nThat was how I thought they would interact but I am still not 100% sure sometimes on order of play kind of rulings."}]}