{"url":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/","title":"couple of watcher qs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=636261","commentId":636261,"userName":"richsabre","timestamp":1338015177,"content":"sorry if this has already come up\n\nfirst am i correct in thinking you can forest snare the watcher as per normal…it feel as if the watcher should be immune as its quite easy to enagage it when the staging areas empty the snare it next round….\n\nsecondly say ive committed two heros to a quest and wrapped comes up…i attatch it to one of the commited heros allowing me to use my free hero to get rid of it later….is that hero still considered commited to the quest?\n\nthanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=636323","commentId":636323,"userName":"leptokurt","timestamp":1338028427,"content":"1) The Watcher can be snared (but it makes little sense to do so).\n\n2) That hero is still committed to the quest, but he won't be able to ready himself, even if an attachment or event allows him to do so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=636392","commentId":636392,"userName":"richsabre","timestamp":1338042341,"content":"why would it make little sense? i usually snare it so i can concentrate on getting the doors open…or am i missing something?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=636419","commentId":636419,"userName":"leptokurt","timestamp":1338052536,"content":"richsabre said:\n\nwhy would it make little sense? i usually snare it so i can concentrate on getting the doors open…or am i missing something?\n\n\n\nEither you open the doors or you kill The Watcher. If you haven't opened the doors while you're engaged with the Watcher, you're in deep trouble. I am usually prepared to open the doors once I enter the second stage, so I ignore the Watcher (Radagast's Cunning is a big help here). Or I have a tactics centred deck to kill the Watcher befor he can say \"snare\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=636421","commentId":636421,"userName":"richsabre","timestamp":1338053182,"content":"still with snare you only need to suffer 1 attack from the watcher- then you can go through the door at leisure…you dont even need to kill it as there isnt really any cards that will discard the snare…anyways thats how i play it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=637660","commentId":637660,"userName":"jjeagle","timestamp":1338345525,"content":"I don't quite get your point here, leptokurt.\n\nIf you don't engage the Watcher, he will kill one ally per turn in all probability\n\nIf you do engage the Watcher, he will kill one ally per turn when you defend.\n\nTherefore, it makes sense to engage him (assuming you can) at the first opportunity and get his threat out of the staging area. And then you may as well, if possible, slap Forest Snare on him to give added security while you sort out the Doors.\n\nThe point being that (though I may be missing something here) I don't see how you can be \"prepared to open the doors\" with any certainty. Even with Henamarth and Shadow of the Past, this gives you the knowledge only of two Encounter cards whose initial letter you need to match. It's perfectly possible that you won't have the appropriate cards in hand to match them, and therefore you can easily end up taking additional turns waiting at the Doors.\n\nI do think it was a minor design mistake, in terms of theme and the \"end-of-level boss\" idea, to omit the \"no attachments\" clause from the Watcher, that the Witch-king and the (errata'd) Nazgul of Dol Guldur possess. It would certainly have to be one hell of a snare… (giant fishing net?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=637698","commentId":637698,"userName":"richsabre","timestamp":1338354929,"content":"yes that was my thought….so much so i miss read the card text as 'watcher cannot be optionally engaged as i really couldt believe it could be so easily tackled with a simple 3 cost lore card"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=638512","commentId":638512,"userName":"leptokurt","timestamp":1338461337,"content":"The point is that when you reach 2B you should already be prepared to open the doors immediatly (or to defeat the Watcher, that is). Why should I bring both Watcher and Doors into play when I am not able to get rid of them at once? And no, you are not dependend on two different cards, (ususally that's enough to open the doors anyway). You can also use the shadow cards, as for sure there will be the one or othe tentacle around to attack you (or the Watcher himself). Which is why I don't eliminate tentacles, but keep them around.\n\nWhen I play I always open the doors in the same round in which they were placed as an active location (either with Shadow of the Past or Runour from teh earth or Henamarth). In the next round I get the 5 progress tokens needed and enjoy afterwards the dumb look on the Watcher's ugly face when there is no one left to smash/grasp/strike.\n\n \n\nExamples:\n\n \n\nYou can use Rumour from the Earth before dealing the shadow cards and afterwards. Gives you the choice from two cards. You can use it again during the next round after the encounter card has been revealed. Makes three cards.\n\nYou can use Shadow of the Past after the quest phase or after the combat phase. As you can choose which shadow card will end at the top of the discard pile, it's quite easy to get a matching letter.\n\nIf you have Out of the Wild you will get even more cards to choose from.\n\nYou can also trigger the effects of the tentacles to get new cards on the top of the discard pile. In fact, if you have Shadow of the Past in your hand, you have to be really unlucky not to open the doors."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=638520","commentId":638520,"userName":"jjeagle","timestamp":1338461718,"content":"Good point about SOTP on the Shadow cards. I don't understand how you are using Out of the Wild to help though? Just to reshuffle the encounter deck to get a new top card to look at?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65115-couple-of-watcher-qs/?do=findComment&comment=638699","commentId":638699,"userName":"leptokurt","timestamp":1338478993,"content":"jjeagle said:\n\nGood point about SOTP on the Shadow cards. I don't understand how you are using Out of the Wild to help though? Just to reshuffle the encounter deck to get a new top card to look at?\n\n\n\nYep. And I usually play with Bilbo, so I have about 10+ cards in my hand when I reach the doors. I ususally try to have one of SotP or RftE in m ystarting hand and to draw the other one during the game. I spare some lore resources to be able to play RftE multiple times. The top card doesn't fit? I attack a tentacle and trigger it's effect. It still doesn't fit? I attack another tentacle and trigger it's effect. The game mechanics of TWitW allow you to manipulate the encounter deck to a certain degree.\n\n \n\n(it's still more fun to defeat the Watcher, though!)"}]}