{"url":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/","title":"Tolkienology Chapter 8: The Hobbit Prequel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=636788","commentId":636788,"userName":"richsabre","timestamp":1338180982,"content":"Hello and welcome to Chapter 8: Prequel to The Hobbit. This chapter is going to focus on the little known pre-Unexpected Party events that led up to the meeting of the dwarves and Bilbo in Bag End.\n\nIf you are currently going ‘whoah….hold on…there’s a hobbit prequel? then the answer is yes, there is. It is a short account in the Unfinished Tales, and despite its briefness, it is non-the-less one of the most fascinating of all the unfinished tales of the book.\n\nThe first part of this chapter will be a short discussion on my thoughts on why Gandalf got Thorin and co. together, and the second part will be a discussion on the actual tale.\n\n\nIt has long been discussed amongst Tolkien fans whether there was any deep reason for the expedition to the Lonely Mountain. Those who take a ‘detached’ view of middle earth will argue that The Hobbit was wrote before the trilogy and therefore there obviously wasn’t any plans for the events to influence the war of the ring (which is true as you can see from the discarded drafts of the Fellowship…see chapter 6), however in Tolkienology we don’t play it quite like that- if Tolkien wrote it, it’s real, and it happens in real time.\n\nSo taking that in mind it doesn’t take much reflection to realise the huge benefits for Gandalf to arrange the company of Thorin. The fact that Smaug held a position of power in middle earth was of great concern. Not only was the dragon an extremely powerful being (apart from the mysterious desert worms, the only one known in the third age) capable of ruining entire armies and laying lands to waste (whether Sauron would have been able to control that power is another point of argument), he was also a barrier to a strong and reformed dwarven kingdom in Erebor. This in itself, if it could be achieved, would have been of great benefit- and as we can see, this is indeed played out as a frontline of combat during the end of the war of the ring. The outcome, if both Dale and Erebor hadn’t been as strong, would have been dire. An extra front for the allies of the west to worry about was the last thing they would have needed.\n\nTherefore as we can see, it is plainly obvious that Gandalf intended to kill several birds with one stone (or hobbit burglar as it were). If Smaug could be removed, not only would a powerful enemy would be destroyed, a new kingdom could be set up, and the ever increasing threat from Mount Gundabad could be stayed as well.\n\nLastly to the matter of the finding of the ring- in this case, as Gandalf later points out- was an act of fate. Gandalf did not know of the ring’s location during the events of The Hobbit, and indeed it is only confirmed many years later during the early Fellowship chapters. Now whether we can rule out other meddling hands is a matter to wonder about- for instance it is not known just how much Eru Illuvatar really had in the events of the war of the ring- there certainly seems to be a lot of ‘coincidences.’ I.e out of all the tunnels under the Misty Mountains- our Hobbit friend just ‘happened’ to go down to Gollum’s pond, and just ‘happened’ to lay hands on the ring in compete darkness. Of this matter I shall leave you to draw your own conclusions.\n\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\nWith that said I would like to take some time to discuss the actual events that led up to the Hobbit, as described in the Unfinished Tales. This is a fascinating account, and if you haven’t had chance to get your hands on a copy- I heartily recommend it. I you haven’t got UT then a similar account can be found in the LOTR appendices.\n\nThe actual timeline of the events of the Hobbit go far back into dwarven history, however it wasn’t until a chance (or not?) meeting between Gandalf and Thorin near Bree (there are two accounts- UT gives it outside on the road, LOTR appendices give it in the Prancing Pony Inn, in this discussion I shall use the UT account) that the true plans were laid.\n\nNote: The following account is the one as told by Gandalf to Frodo, Pippin, Merry and Gimli, in Minas Tirith after the fall of Sauron.\n\nThorin Oakenshield, son of Thrain II, was part of the exiled dwarven colony of Ered Luin in the Blue Mountains. His people were driven out of Erebor when Smaug descended upon it, taking the kingdom for his own.\n\nNot long after their expulsion, Thror, Thorin’s grandfather, was murdered in Moria, by the orc chieftain Azog.\n\nNote: Azog's son was Bolg who led the goblin army to the battle of five armies, later to be killed by Beorn…this is one of the few cases we hear of orc families in the entire works of Tolkien\n\nHis body was hacked, and his head was branded with Azog’s name. The dwarves, obviously infuriated by this led an assault upon the orc holds of the Misty Mountains leading to the infamous War of The Dwarves and Orcs which climaxed in the Battle of Nanduhirion outside Moria’s east gate.\n\nThe battle was costly, and Thorin was wounded, being forced to defend himself with a hewn oak branch earning his name Oakenshield. Despite being victorious, the dwarves knew they could not enter Moria and take it for their own. Dain knew that Durin’s Bane still lurked inside its depths.\n\nSo being exiled from both Erebor and Khazad Dum, the Dwarves took to the Blue Mountains, and there lived well, if not grandly. But the dwarves would never be content while Smaug held their beloved kingdom.\n\nThorin’s father, Thrain, was given the last ring of power by his father Thror before he was murdered in Moria. However in the year 2841, Thrain set out to journey to Erebor, however was captured near the Anduin and taken to Dol Guldur, where he was later to be found (quite mad by that time) by Gandalf, to give a mysterious map and key. The ring had of course been taken by Sauron.\n\nNote: it is interesting to note the meddling hands of the dwarven ring in both Thror and his son Thrain. Whilst it is known that the rings did not have the corruptive power over dwarves as that of men, nor were the dwarves as resilient as the elves. Thus the rings had a different hold over their bearers- greed. So it is generally thought that behind both Thror’s and Thrain’s clearly mad ideas to wander alone into the hands of the enemy was the ring of power, trying to get back to its master.\n\nSo it was that when Gandalf was journeying near Bree, he met Thorin on the road. Gandalf was greatly troubled at the time, pondering both how to deal with the Necromancer in Mirkwood, and how best to deal with the threat of Smaug lingering in the north east. Dol Guldur was a more imminent threat he decided, and would urge the White Council to deal with it, while for Smaug he hatched a very cunning plan indeed.\n\nThorin, thinking only as a dwarf can, wished for battle with Smaug, as if he were a king of many thousands of warriors, however Gandalf knew better methods could be applied- secrecy could win where battle could not. So he persuaded Thorin to enlist the help of a certain Bilbo Baggins, a hobbit of The Shire.\n\nNow upon travelling to Bag End and seeing Mr Baggins, Thorin and his companions were furious- how was this over fed halfing going to help in their quest? He would hinder them if anything! After Bilbo had retired (where the Hobbit narrative cuts out) and the dwarves and Gandalf were still awake inside Bag End, Gandaf went about trying to persuade the company to take him along:\n\n“Listen to me Thorin Oakenshield! If this hobbit goes with you, you will succeed. If not you will fail. A foresight is one me and I am warning you,” he said.\n\nIn an earlier version we get to see just what exactly the dwarves think if hobbits as spoken by Gloin:\n\n“What! One of those simpletons down in the Shire? What use on earth or under it could he possibly be? Let him smell as he may, he would never dare to come within smelling distance of the nakedest dragonet new from the shell!”\n\nThorin doesn’t seem to have any better opinion of him either:\n\n“He is soft. Soft as the mud of his Shire, and silly. His mother died too soon. You are playing some crooked game of your own Master Gandalf.”\n\nAfter a hasty argument, Thorin agreed, reluctantly to let Bilbo come along (if he dared to that is), and on the condition that Gandalf came along also.\n\nAgain in an earlier version of the account, Pippin asks a very interesting question ‘why Bilbo out of all the hobbits?’\n\n“I want a dash of Took (but not too much master Peregrin) and I want a good foundation of the stolider sort, a Baggins perhaps. That pointed at once to Bilbo.”\n\nI began this chapter with the question of whether Gandalf had deeper motives behind bringing together Thorin and co. and we can clearly see now he did. His motives went far beyond the dwarves, who wanted their homes and their riches, and far beyond Bilbo’s, who was out to prove (mostly to himself) that he was no ordinary hobbit. He wanted to plant the seeds that would grow through the following decades to become a major player in the war of the ring. Just how major I do not think Gandalf really knew until many years after, when he discovered the real identity of Bilbo’s magic ring.\n\nHappy gaming\nRich\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=636948","commentId":636948,"userName":"Robert McMutton","timestamp":1338214507,"content":"Great as always, rich. Thank you again for your series. Regarding this post, it's indeed interesting. The Hobbit could be seen as a fortuite adventure, but it has the clever hand of Gandalf behind much of it. Of course all the matter of the Ring is an additional prize, but the Grey Wizard was the very winner in all this quest, orchestrating the main events ending most of them in a very succesful way.\n\nAnd is of note that Galdalf had the courage and the skill to sneak away under the gaze of Sauron, entering and escaping Dol Guldur. aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]\n\nI'm glad that you have returned to the path of Tolkienology series after a break gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif].\n\nGreetings, rich."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=636962","commentId":636962,"userName":"richsabre","timestamp":1338216668,"content":"thank you for stopping by robert\n\nindeed i agree on gadalfs part, more so that he sneaked in twice! if its half as difficult as the 'espace from dol guldur' quest then he truely is the greatest wizard on middle earth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=636971","commentId":636971,"userName":"Robert McMutton","timestamp":1338217260,"content":"richsabre said:\n\n \n\nthank you for stopping by robert\n\nindeed i agree on gadalfs part, more so that he sneaked in twice! if its half as difficult as the 'espace from dol guldur' quest then he truely is the greatest wizard on middle earth\n\n \n\n \n\nIndeed he is cool.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/cool.gif]. And it's true, I forgot to mention above… he did it twice!!!\n\nAnd you're welcome. I don't have much time, and I hardly keep myselft at day reading all the posts of the forum… but sometimes I can reply here and there a little gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=637257","commentId":637257,"userName":"Mattr0polis","timestamp":1338287957,"content":"Thanks again, Rich!\n\nIn regards to events in The Hobbit tying in with the later books and Gandalf having deeper motives, I just re-read The Hobbit last month for the first time in forever. I was very surprised at the amount of stuff that I had forgotten about, especially when it came to all the foreshadowing/hinting at a much larger story going on, dealing with Gandalf and \"the Necromancer\", etc.\n\nI know some people say that Tolkien probably didn't have any plans to have events in The Hobbit influence the War of the Ring but I think Tolkien did a wonderful job of giving us that hint of a much larger world in the background of The Hobbit and then later tying it in so perfectly with the events of The Lord of the Rings. The books fit together so well, regardless if they were written in complete conjunction with each other or not. Especially in regards to Gandalf and also The Ring, which seems like quite a lot was put in the book if it was just supposed to be an average magic ring.\n\nSo yes, I agree. Gandalf had to have deeper motivations for forming the expedition, mainly to gain some footholds for the incoming war, and to push Bilbo towards his destiny. Both of which I think Gandalf could sense on some level. This neat prequel story just further reinforces it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=637292","commentId":637292,"userName":"richsabre","timestamp":1338291937,"content":"thanks mattr0polis- its interesting to note that when tolkien prepared to write the lord of the rings he stated to his publisher that he believed he had used all his 'good' material on the hobbit and couldnt see how a sequel could possible form-how wrong he was! (see the could have been's chapter for more on that)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=637546","commentId":637546,"userName":"Style75","timestamp":1338315498,"content":"This is a great addition to your series which has been consistently well researched and written. Thanks for the hard work and keep 'em coming!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=637548","commentId":637548,"userName":"richsabre","timestamp":1338315666,"content":"Style75 said:\n\nThis is a great addition to your series which has been consistently well researched and written. Thanks for the hard work and keep 'em coming!\n\n\n\nthank you very much style75!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=649148","commentId":649148,"userName":"player543086","timestamp":1340592818,"content":" Wow what I great series. I like Lord of the Rings but I am far from being a great fan. I've read the books (LOTR, Hobbit and Simalirion) but it was a long time ago and I do not see having enough time on my hand to reread them (instead of reading something new to me). I've said somewhere already that Fellowship of the cards podcast greatly increased my enjoyment of the game and now this series did it as well. I really hope you will have energy and time to continue! Thanks a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=649221","commentId":649221,"userName":"richsabre","timestamp":1340604792,"content":"thank you very much wojo!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=653972","commentId":653972,"userName":"Ted Sandyman","timestamp":1341460013,"content":"Hi rich, another brilliant piece i enjoyed reading as Hobbits are close to my heart! It just shows us all how there are still a million different avenues that are unexplored or \"left hanging\" in the writings of Middle Earth. Shame, i bet Tolkien had ideas he never got round to writing about. Well done again though mate, cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=653995","commentId":653995,"userName":"richsabre","timestamp":1341467069,"content":"cheers ted - pleased you liked it\n\nthere definatly avenues that never got published- like an entire sequel to LOTR based with aragorns son and a cult who worships sauron!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=654038","commentId":654038,"userName":"Ted Sandyman","timestamp":1341478389,"content":"Really! I never knew that. It would be good, if you've got time, to see a bit on that subject."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=654059","commentId":654059,"userName":"Captain Poe","timestamp":1341481253,"content":"Ted Sandyman said:\n\nReally! I never knew that. It would be good, if you've got time, to see a bit on that subject.\n\n\n\nIt was called \"The New Shadow\", I'm not sure how much there is to tell about it. Tolkien only wrote 13 pages of it and then quit.\n\n\"I did begin a story placed about 100 years after the Downfall, but it proved both sinister and depressing. Since we are dealing with Men it is inevitable that we should be concerned with the most regrettable feature of their nature: their quick satiety with good. So that the people of Gondor in times of peace, justice and prosperity, would become discontented and restless — while the dynasts descended from Aragorn would become just kings and governors — like Denethor or worse. I found that even so early there was an outcrop of revolutionary plots, about a centre of secret Satanistic religion; while Gondorian boys were playing at being Orcs and going around doing damage. I could have written a 'thriller' about the plot and its discovery and overthrow — but it would have been just that. Not worth doing.\"\n? The Letters of J.R.R. Tolkien, Letter 256)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=654064","commentId":654064,"userName":"Runix","timestamp":1341481989,"content":"Thanks for the post, very informative!\n\nAs for the apparent coincidence regarding the Ring, my distinct impression is that it was neither a coincidence nor a conscious plot, but rather the Ring itself at work.  The Ring tired of Gollum and wanted to return to its master, so it tried to find what would be a more suitable bearer.  It was not a mistake that Gollum, who otherwise was so careful of the Ring, would drop it and leave it where Bilbo would find it - the Ring was precisely where it intended to be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=654116","commentId":654116,"userName":"richsabre","timestamp":1341489406,"content":"Captain Poe said:\n\nTed Sandyman said:\n\n \n\nReally! I never knew that. It would be good, if you've got time, to see a bit on that subject.\n\n \n\n \n\nIt was called \"The New Shadow\", I'm not sure how much there is to tell about it. Tolkien only wrote 13 pages of it and then quit.\n\n\"I did begin a story placed about 100 years after the Downfall, but it proved both sinister and depressing. Since we are dealing with Men it is inevitable that we should be concerned with the most regrettable feature of their nature: their quick satiety with good. So that the people of Gondor in times of peace, justice and prosperity, would become discontented and restless — while the dynasts descended from Aragorn would become just kings and governors — like Denethor or worse. I found that even so early there was an outcrop of revolutionary plots, about a centre of secret Satanistic religion; while Gondorian boys were playing at being Orcs and going around doing damage. I could have written a 'thriller' about the plot and its discovery and overthrow — but it would have been just that. Not worth doing.\"\n? The Letters of J.R.R. Tolkien, Letter 256)\n\n\n\npersonally im pleased he left it at that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=655515","commentId":655515,"userName":"Goblin King","timestamp":1341787999,"content":"Bravo Rich.\n\nI'm hopeful that the Hobbit prequel will find its way into the Peter Jackson films. If anyone here is going to ComicCon in San Diego, you should try to ask Mr. Jackson during the forum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=655544","commentId":655544,"userName":"richsabre","timestamp":1341796303,"content":"Goblin King said:\n\nBravo Rich.\n\nI'm hopeful that the Hobbit prequel will find its way into the Peter Jackson films. If anyone here is going to ComicCon in San Diego, you should try to ask Mr. Jackson during the forum.\n\n\n\nthank you\n\ni could imagine it could be something like the last alliance prlogue to the fellowship- just a quick 5 minute introduction with a narration\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=658374","commentId":658374,"userName":"jormungandr","timestamp":1342235958,"content":"Rich,\n\nJust wanted to say how much i love your tolkienology series! Great stuff and thanks for the huge investment!\n\nJormungandr"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65169-tolkienology-chapter-8-the-hobbit-prequel/?do=findComment&comment=658483","commentId":658483,"userName":"richsabre","timestamp":1342264032,"content":"jormungandr said:\n\nRich,\n\nJust wanted to say how much i love your tolkienology series! Great stuff and thanks for the huge investment!\n\nJormungandr\n\n\n\nthanks very much my friend!"}]}