{"url":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/","title":"Defending with exhausted Watcher of the Bruinen/Grimbeorn","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637121","commentId":637121,"userName":"jjeagle","timestamp":1338254517,"content":"I think I know the answer to this one, but I want to check I'm not missing something.\n\nWatcher (and Grimbeorn v Trolls) has the text \"does not exhaust to defend\".\n\nDoes this mean that he can defend when already exhausted?\n\nI think the answer is yes, because whilst the rulebook (p18) has the clear requirement that \"a character must exhaust to be declared as a defender\" [which obviously the Watcher's card text overrides], I don't believe that there is any global statement in rulebook or FAQ that only unexhausted characters may defend (or attack for that matter)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637135","commentId":637135,"userName":"Dam the Man","timestamp":1338258776,"content":"There was a recent official clarification on questing with an exhausted hero who has the Book of Mazarbul (hero doesn't exhaust to quest) and the answer was that you still need the hero ready to be able to quest.\n\nwww.boardgamegeek.com/thread/800037/book-of-mazarbul [http://www.boardgamegeek.com/thread/800037/book-of-mazarbul]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637136","commentId":637136,"userName":"jjeagle","timestamp":1338259069,"content":"Ah, thanks. Looks like the same \"clarification\" would apply to the situation I describe regarding defending.\n\nThough I would say that this is less a clarification, and more an invention of a new rules principle in contradiction of the rulebook…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637153","commentId":637153,"userName":"richsabre","timestamp":1338264692,"content":"i would tend to disagree- i think it stays with the rules quite well- the card states 'does not exhaust to defend' so that is just a condition that affects the point in time when he is declared defender, it doesnt affect any other rule, therefore the card still needs to be ready to actually make the move-  as the ability is there to allow mulitple defencea and nothing else"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637157","commentId":637157,"userName":"jjeagle","timestamp":1338265752,"content":"Hm, maybe - the thing is, the rules don't actually state that you need to be ready in order to defend, only that you need to exhaust to do so.\n\nAnyway, there's no point in this debate, as the official ruling is clear enough. Now all we need is for the official rulings to be published in a single FAQ rather than scattered around in email responses which have been posted on various forums…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637229","commentId":637229,"userName":"richsabre","timestamp":1338282536,"content":"there is an faq, but it has been a while since it was updated. i think it needs to be updated more often as you say"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637710","commentId":637710,"userName":"jjeagle","timestamp":1338358845,"content":"What I find frustrating is this: it's not like the designer isn't regularly making rulings on genuine points of uncertainty. It's just that this is being done via email to individuals, leaving it up to those individuals to share the ruling with the community, and up to other players to familiarise themselves as best as they can with this scattered information.\n\nSurely it would not be difficult for the designer to routinely pass his email rulings on to the FFG web people for regular online publication?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65208-defending-with-exhausted-watcher-of-the-bruinengrimbeorn/?do=findComment&comment=637721","commentId":637721,"userName":"richsabre","timestamp":1338360154,"content":"well you can try and get them to do something official and regualar like a official faq subforum that gets updated by a mod- for instance the subforums are here because i launched a petition which with the support of the forum really took off and then ffg gave us them, so if you show them the amount of confusion on the rules sub forum, then they may do something"}]}