{"url":"https://community.fantasyflightgames.com/topic/65212-when-revealed-vs-added-to-the-staging-area/","title":"&quot;When Revealed&quot; vs &quot;added to the staging area&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65212-when-revealed-vs-added-to-the-staging-area/?do=findComment&comment=637159","commentId":637159,"userName":"jjeagle","timestamp":1338266013,"content":"This isn't a question so much as a rules point I have just discovered which surprised me.\n\nRulebook p23 - \"when revealed effects are a special case of forced effects, that occur automatically as soon as the encounter card is revealed\".\n\nFAQ - \"A card is only considered to be revealed if the card or game effect causing the card to enter play specifically uses a form of the word \"reveal\".\n\nThis is clear enough, what surprised me is the interaction with (say) Branching Paths (\"Forced: After Branching Paths leaves play as an explored location, look at the top 3 cards of the encounter deck. Players must choose 1 of those to reveal and add to the staging area, moving the other 2 to the bottom of the deck.\")\n\nI hadn't realised that you can just select a treachery from Branching Paths that will then be added to the staging area without triggering its When Revealed effect, and thereby do nothing.\n\nApologies if this was already obvious."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65212-when-revealed-vs-added-to-the-staging-area/?do=findComment&comment=637171","commentId":637171,"userName":"muemakan","timestamp":1338270949,"content":" \n\n No, the \"when revealed\" effect will trigger. You even mention the reason in your own post.\n\n \n\nPlayers must choose 1 of those to reveal and add to the staging area….\n\n \n\n \n\nIf it would say: Players must choose 1 and add it to the staging area….then the effect would not trigger.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65212-when-revealed-vs-added-to-the-staging-area/?do=findComment&comment=637175","commentId":637175,"userName":"jjeagle","timestamp":1338272333,"content":"Bah, you're right - my fault for not reading the card properly.\n\nThere are some other instances where my point would apply though, eg Orc Ambush (\"return all Orc enemies in the encounter discard pile to the staging area\") + an Orc with a when-revealed effect (eg Black Uruks or Chieftain of the Pit). So still worth watching out for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65212-when-revealed-vs-added-to-the-staging-area/?do=findComment&comment=637179","commentId":637179,"userName":"lleimmoen","timestamp":1338272658,"content":"Yes, this is a good point since they made it clear the word reveal must be present. What I then hated about it was some errata saying specifying that this is not the case, example Eleanor, her ability instructs to replace the card, thus one would conclude the next card is not revealed. This would actually make Eleanor a more interesting hero in my opinion, and still certainly not overpowered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65212-when-revealed-vs-added-to-the-staging-area/?do=findComment&comment=637185","commentId":637185,"userName":"jjeagle","timestamp":1338273846,"content":"Good point. Another relevant example (since all three cards are in the Twists & Turns encounter set) is that the enemy your Cave Torch might summon is simply added to the staging area, whereas an enemy from Branching Paths is revealed and added to the staging area. So a Goblin Follower who comes from the Branching Paths would immediately engage you, where as a Goblin Follower summoned by the Cave Torch would not.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65212-when-revealed-vs-added-to-the-staging-area/?do=findComment&comment=637528","commentId":637528,"userName":"leptokurt","timestamp":1338313880,"content":"jjeagle said:\n\nGood point. Another relevant example (since all three cards are in the Twists & Turns encounter set) is that the enemy your Cave Torch might summon is simply added to the staging area, whereas an enemy from Branching Paths is revealed and added to the staging area. So a Goblin Follower who comes from the Branching Paths would immediately engage you, where as a Goblin Follower summoned by the Cave Torch would not.\n\n \n\n \n\n\n\n \n\nYep, I'm always happy when this guy is lured into the staging area  by the Cave Torch. The Follower is a real desaster to everyone playing a secrecy deck, I'tll tell ya!"}]}