{"url":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/","title":"Do you guys clear the stanging area on the last stage of teh quest?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=638453","commentId":638453,"userName":"booored","timestamp":1338455316,"content":"I know it is not in the rules and that as soon as you complete the final stage's requirements it is instant game over.. but it always bugs me leaving monsters and stuff in the engagement or staging area, It just doesn't make any sense to me… So I usually play that after the final quest card requirements are completed you still play but you draw x-1 less encounter cards were x is the amount of players .. so in a 2 player game you only draw 1, in a 1 player game you draw nothing. Any location is discarded (as you are AT the final destination)\n\nDose anyone else play any kind of variants to get over the awkward feeling of the game just abruptly ending while in mid fight or with tons of crap in the staging area?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=638489","commentId":638489,"userName":"Mattr0polis","timestamp":1338458770,"content":"We just play it the normal way, questing and leaving everything behind if possible. Sometimes there will be a ton of stuff out but we'll make a huge last questing push and beat the quest that way and we wouldn't stand a chance if we had to fight.\n\nIt doesn't really bother me though. I kind of think of it thematically as, the group completed their mission and have now scurried out of harm's way, but Sauron and his minions will still always be out there. At least until the Ring is destroyed. And until then there will always be more Orcs. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\nBasically, you won a small victory but the larger war still looms."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=638499","commentId":638499,"userName":"leptokurt","timestamp":1338460073,"content":"booored said:\n\nI know it is not in the rules and that as soon as you complete the final stage's requirements it is instant game over.. but it always bugs me leaving monsters and stuff in the engagement or staging area, It just doesn't make any sense to me… So I usually play that after the final quest card requirements are completed you still play but you draw x-1 less encounter cards were x is the amount of players .. so in a 2 player game you only draw 1, in a 1 player game you draw nothing. Any location is discarded (as you are AT the final destination)\n\nDose anyone else play any kind of variants to get over the awkward feeling of the game just abruptly ending while in mid fight or with tons of crap in the staging area?\n\n\n\nIt bugs me too, but as I am playing for scores I don't prolongue my games unneccessarily. However, I always appreciate adventures that require the elimination of all enemies at one point of the game. Would make tactics a bit more useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=638509","commentId":638509,"userName":"Mattr0polis","timestamp":1338461257,"content":"Another thematic way to look at it that I can picture perfectly, would be something like this: Aragorn, Legolas and the rest of their party swoop in, cutting down Orcs left and right. They enter the Tower, free the prisoner and make their way through the tunnels and back outside, cutting down more enemies along the way with bow and sword, even felling a mighty Nazgul. They cut down a few more Orcs that get too close and escape back into the forest victorious.\n\nSome Orcs are left alive. They look around at the destruction before them, The Tower has been breached, the prisoner gone, the Nazgul felled, the army once protecting the Tower all but destroyed, and those responsible escaped. The Orcs think of how Sauron will take this. Panic sets in. They are alive but at what cost? And for how long…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=638513","commentId":638513,"userName":"richsabre","timestamp":1338461347,"content":"Mattr0polis said:\n\nAnother thematic way to look at it that I can picture perfectly, would be something like this: Aragorn, Legolas and the rest of their party swoop in, cutting down Orcs left and right. They enter the Tower, free the prisoner and make their way through the tunnels and back outside, cutting down more enemies along the way with bow and sword, even felling a mighty Nazgul. They cut down a few more Orcs that get too close and escape back into the forest victorious.\n\nSome Orcs are left alive. They look around at the destruction before them, The Tower has been breached, the prisoner gone, the Nazgul felled, the army once protecting the Tower all but destroyed. The Orcs think of how Sauron will take this. Panic sets in. They are alive but at what cost? And for how long…\n\n\n\nindeed-even after saurons downfall there were still plenty of orcs about"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=638702","commentId":638702,"userName":"Budgernaut","timestamp":1338479266,"content":" I've had a similar thought, Booored, but to me, leaving those enemies in the staging area always reminds me of the movie of The Fellowship of the Ring (please don't stone me Richsabre). After Gandalf falls to the Balrog and the heroes retreat, one of them (Legolas? Aragorn?) turns to look behind and sees the orc archers and (quite ridiculously) ducks out of the way of an arrow before going down the last tunnel to the exit. That image always pops in my mind when the quest is over and enemies are still engaged with me. Then I don't feel so bad about leaving enemies out.\n\nBut I like your house rule. It sounds interesting. I may try it sometime, especially when I get a Tactics engine running and wanna keep using it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=638729","commentId":638729,"userName":"richsabre","timestamp":1338482672,"content":"Budgernaut said:\n\n \n\n I've had a similar thought, Booored, but to me, leaving those enemies in the staging area always reminds me of the movie of The Fellowship of the Ring (please don't stone me Richsabre).\n\n \n\n \n\nhaha..i wont…my dislike for the film is as an adaption…i actually think that scene to be one of the most moving things ive ever seen on screen (i dont mind admitting i nearly llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=639469","commentId":639469,"userName":"monkeyrama","timestamp":1338641348,"content":"In some scenarios it feels a little off, but at the end of Massing it is almost cooler to pull it off with essentially a whole army in the staging area, chasing you. Thematically that works really well I've always felt, since it takes a hell of a good game to clear the board in that scenario!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=639486","commentId":639486,"userName":"Mr Coffee","timestamp":1338646231,"content":"richsabre said:\n\nBudgernaut said:\n\n \n\n I've had a similar thought, Booored, but to me, leaving those enemies in the staging area always reminds me of the movie of The Fellowship of the Ring (please don't stone me Richsabre).\n\n \n\n \n\nhaha..i wont…my dislike for the film is as an adaption…i actually think that scene to be one of the most moving things ive ever seen on screen (i dont mind admitting i nearly llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif])\n\n\n\n \n\nI did think the inability to hit ANYONE with at least one of the hundreds of arrows being fired a bit humorous :-)\n\nI wasn't as \"moved\" by that scene until after they were already outside and everyone was shell-shocked and Boromir was pleading with Aragorn to give them all a moment to grieve and they turned to look for Frodo only to find that, with tears streaming down his face, he was already headed down the mountain.  Other than Aragorn, he knew and cared for Gandalf more than anyone there, but had the resolve to forge ahead so that his sacrifice wasn't in vain.  I'm in agrrement that there are plenty of things I wish the movies could have done better (Jackson SLAUGHTERED the reputation of my favorite LOTR character, Faramir), but PJ does know how to tell a compelling story…\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65335-do-you-guys-clear-the-stanging-area-on-the-last-stage-of-teh-quest/?do=findComment&comment=639491","commentId":639491,"userName":"richsabre","timestamp":1338648287,"content":"benhanses said:\n\nrichsabre said:\n\n \n\nBudgernaut said:\n\n \n\nbut PJ does know how to tell a compelling story…\n\n \n\n \n\n\n\nalbiet one already told by an even greater story teller gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"}]}