{"url":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/","title":"Weapons for people other than dwarves and elves?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/?do=findComment&comment=639218","commentId":639218,"userName":"Captain Poe","timestamp":1338565869,"content":"Was trying to build a deck focuses on pumping up Boromir… and realized that he can't really use the vast majority of the tactics weapons, or if he can, he's limited in their value. Pretty much his options are the dwarf axes that he only gets half the bonus from, or the blades that only effect orcs. While I love dwarf decks, and am glad the elves are finally getting some support, it would be nice if we could get some boosts for gondor. Just my opinion… but i'd really like to be able to make a gondor deck the way i can do dwarves, rohan, and to a lesser extent elves and eagles right now.\n\nOh yeah, and another hobbit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/?do=findComment&comment=639223","commentId":639223,"userName":"richsabre","timestamp":1338566378,"content":"all in good time my friend\n\nsomething tells me minas tirith and gondor will be a later pack…dont know why, maybe because its based around the return of the king book, but i may be wrong…..after all they dont seem to be following any 'grand design'\n\nbut even then they dont really need to do a gondor pack…..numenorean blades could be a gondolin/rivendell equivalent, and could easily refer to boromirs noble blood….or perhaps some arnor blades saved from the north kingdom which would also be able to be used by men…..or just any **** sword will do i suppose….men were after all the most numerous of races\n\nor perhaps we could have some ithillien rangers other than faramir……im looking forward to how they will portray the declining might of gondor\n\ni am particularly hoping they will address boromirs hundred something days journey to search for rivendell……..ripe for the taking ffg…..gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nps. also looking forward to sam/merry/pippin/fatty …………"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/?do=findComment&comment=639398","commentId":639398,"userName":"DurinIII","timestamp":1338620353,"content":"All in good time indeed! The weapons are coming I assume, but like you, I also wish more were available at the moment outside of Elves and Dwarves. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/?do=findComment&comment=639412","commentId":639412,"userName":"booored","timestamp":1338623816,"content":"DurinIII said:\n\nAll in good time indeed! The weapons are coming I assume, but like you, I also wish more were available at the moment<snip>. \n\n\n\nwelcome to the LCG addiction maniac…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/?do=findComment&comment=639419","commentId":639419,"userName":"Asmoridin","timestamp":1338626572,"content":"Yeah, it's just a matter of being patient until stuff gets released.  FFG certainly hasn't forgotten about Gondor, it's just not yet time for them to be the focus."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/?do=findComment&comment=639426","commentId":639426,"userName":"lleimmoen","timestamp":1338629027,"content":"And from the big ones, Dwarves, Hobbits, Rohan, Dúnedain, Silvan, Noldor, it seems to me Gondor might be concentrated on the latest, they have got For Gondor! but that one can be used well in almost any deck. Now I think it is really time for the Elves to get the love.\n\nWhat I also wonder about is whether factions like Dale or Beornings get enough to one day build a deck around them. I was disappointed we only got one additional Beorning in the Conflict at the Carrock (and nothing afterwards). I know it is harder with factions like these but the result can be all the more satisfying when done well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65406-weapons-for-people-other-than-dwarves-and-elves/?do=findComment&comment=639434","commentId":639434,"userName":"richsabre","timestamp":1338631114,"content":"for the minor nations which you mention the designers should look to the appendices as this is really their only hope of releasing more 'tolkien original' material"}]}