{"url":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/","title":"Completing Paths of Mirkwood scenario","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639760","commentId":639760,"userName":"91Vaapad013","timestamp":1338727152,"content":"I had an interesting thing happen during a game yesterday. I was on 3a in which you need to kill Ungoliant's Spawn to win the game. I searched the deck to find it and put it into the staging area. We then decided to travel to a location from the staging area making it the active location. During that turn, I killed the Ungoliant's Spawn with Legolas thus putting the required amount of progress tokens to get rid of the active location. Did we win the game being that the Spawn was killed? Or do I have to search the deck \"again\" to retrieve it to satify 3a?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639763","commentId":639763,"userName":"radiskull","timestamp":1338727539,"content":" I'm confused.  You were on the quest that states you must kill Ungoliant's Spawn to win the game.  You killed Ungoliant's Spawn.  And your question is did you win the game?\n\nI'm not sure it could be any clearer.  Is there some complicating factor that I'm missing here? (I'm not aware of ANY quest card that will trigger its When Revealed text more than once.  You don't even have that option.)\n\n(Clearing the active location was not necessary, btw - you had the right number of progress tokens on the quest card, and you satisfied its objectives.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639769","commentId":639769,"userName":"richsabre","timestamp":1338728391,"content":"hi\n\ni think there has been some confusion here:\n\non one of the random 3b cards you dont have to draw the spawn instead you just place 10 progress tokens on the quest\n\nthe other 3b card you have to draw and kill the spawn but dont have to place any progress tokens on as it is set at 0\n\nyou complete either of these and you win\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639773","commentId":639773,"userName":"91Vaapad013","timestamp":1338729054,"content":"Here was my sequence of events, maybe this can help me explain:\n\n1. Completed 2b and selected at random the 3a (where you have to kill the Spawn in order to win the game). We chose a Forest Spider and the Spawn and placed them into the Staging area.\n\n2. Old Forest Road was in the staging area already.\n\n3. We decided to Travel to Old Forest Road making it the active location. Thinking the benefit would help us somehow.\n\n4. I engaged the Spawn and was able to kill it (with the help of other available characters AND Legolas). He was able to put 3 progress tokens (with the help of the sword) on the location and discard it. With the Spawn dead that turn, (and it being the only requirement needed to successfully Quest 3b), did we win the game?\n\n                                                                                       -or-\n\nDo we need to search the discard pile and put the Spawn BACK out because 3b was NOT the active location when the Spawn was defeated?\n\n \n\nHope this clarifys my situation. \n \n\nBtw, we decided that it was enough to beat the Spawn that turn and succesfully win the game. Not sure I was correct though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639794","commentId":639794,"userName":"richsabre","timestamp":1338733813,"content":"i see- you win as soon as you kill the spawn, regardless of whether you were still on a location or not\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639831","commentId":639831,"userName":"radiskull","timestamp":1338740273,"content":"3a will never be the active location because it is a quest card.\n\nAdditionally, you only search the encounter deck/discard pile ONE time.  There is no mechanism in the game for you to execute the When Revealed text of a quest card more than once.  If you searched for the Spawn when you revealed 3a, that's all.  Even if you wanted to, you couldn't go look for more Spiders at a later time - the rules simply do not allow it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639837","commentId":639837,"userName":"91Vaapad013","timestamp":1338741253,"content":" Thanks guys I appreciate you giving me answers that are not confusing (like my question). I need to read these cards and take them very literally! :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=639841","commentId":639841,"userName":"richsabre","timestamp":1338741791,"content":"your welcome- and i think your own advice is good- often the rules of this game need to be taken very literally indeed\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=642587","commentId":642587,"userName":"Eric W","timestamp":1339330158,"content":"I was also under the impression Legolas puts progress markers on the current quest card, not the current active location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=642616","commentId":642616,"userName":"Dam the Man","timestamp":1339334423,"content":"Active location acts as a buffer for the quest card. Legolas has to clear the active location before he can put progress on the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65461-completing-paths-of-mirkwood-scenario/?do=findComment&comment=642619","commentId":642619,"userName":"jjeagle","timestamp":1339334607,"content":"Eric W said:\n\nI was also under the impression Legolas puts progress markers on the current quest card, not the current active location.\n\n\n\nThe active location acts as a \"buffer\" for the current quest card, so tokens that would go on the quest go on the location instead (rulebook p.15). It has been ruled (in the official FAQ) that Legolas' ability is not an exception to this rule."}]}