{"url":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/","title":"Solo players: a suggested drafting method for opening hands","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640595","commentId":640595,"userName":"xibxang","timestamp":1338897646,"content":" Dear fellow solo players,\n\nWe all know how much our opening hand counts at the start of a game. Indeed, we all know what it's like to draw an opening hand and then immediately concede the game. To me this isn't gaming and it's something that FF really needs to address. Until then, allow me to proffer my new method for drawing an opening hand.\n\nxibxang's LotR: LCG drafting method.\n\nEasy Version:\n\n * Shuffle your player deck and then deal six piles containing six cards.\n * Look through each pile and draw one card that you'd like to keep.\n * Discard the remaining five cards back into your player deck before moving to the second pile.\n * Rinse and repeat until you have a hand of six cards.\n * Shuffle the player deck thoroughly before commencing the game.\n\nHard version:\n\n * Shuffle your player deck and then deal one pile containing six cards.\n * Look through the pile and draw one card that you'd like to keep.\n * Discard the remaining five cards back into your player deck.\n * Shuffle the player deck thoroughly and then deal another five cards to make your opening hand.\n\nObviously you can scale the difficulty level anywhere between drafting all six cards of your opening hand and just one of them.\n\nI fully acknowledge that this isn't anywhere near the official rules and could be viewed by many as cheating. I don't disagree. This method comes from drawing so many opening hands and see them spectacularly fail within two turns.\n\nIf you have the luxury of a playing partner who might be able to support you until you can get some time to draw some better cards then that's excellent and the way the game's meant to be played. FF's solo variant rules are sorely lacking though and this is my attempt to make the game more fun for solo players while retaining some scalability to appeal to taste.\n\nMake of this suggestion what you will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640607","commentId":640607,"userName":"richsabre","timestamp":1338898762,"content":"interesting………..id be lying if i said i was going to try this, as i wont, as i believe to stick to the game rules no matter how hard it makes it. however its your game so its completely up to you.\n\nwhat do you mean by solo varient rules? i see no difference in the rulings between solo and multiplayer other than the obvious scaling methods such as drawing an extra card in staging or whatever….i just see them as 'rules' …..i would use 'varient' for something much more extreme\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640618","commentId":640618,"userName":"xibxang","timestamp":1338899866,"content":"richsabre said:\n\ninteresting………..id be lying if i said i was going to try this, as i wont, as i believe to stick to the game rules no matter how hard it makes it. however its your game so its completely up to you.\n\nAnd that's completely up to you, sir. \n\nThis is a superb game. However, the solo version is - to my mind - marred by the opening hand system. We've all played the game enough to instantly recognise a losing opening hand and to circumvent the frustration (and the sheer time cost of drawing duds) I've suggested this.\n\nrichsabre said:\n\nwhat do you mean by solo varient rules? i see no difference in the rulings between solo and multiplayer other than the obvious scaling methods such as drawing an extra card in staging or whatever….i just see them as 'rules' …..i would use 'varient' for something much more extreme\n\nrich\n\nVariant, version, system. Are we to engage in semantics?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640621","commentId":640621,"userName":"richsabre","timestamp":1338900262,"content":"im sorry if ive offended you……it wasnt meant to sound blunt, just some ideas\n\nas for my comment on the varient i merely made it incase i was missing your point…..often on forums its hard to get the full picture\n\nas i say - your game, you can do with the rules whatever you like, i was just giving my opinion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640627","commentId":640627,"userName":"xibxang","timestamp":1338900978,"content":"richsabre said:\n\nim sorry if ive offended you……it wasnt meant to sound blunt, just some ideas\n\nas for my comment on the varient i merely made it incase i was missing your point…..often on forums its hard to get the full picture\n\nas i say - your game, you can do with the rules whatever you like, i was just giving my opinion\n\n\n\nNo offense caused at all. Dinnae be daft. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640691","commentId":640691,"userName":"lleimmoen","timestamp":1338907126,"content":"I have tried this (or similar) before. I think it is good if for nothing else as a learning tool. I used to pick a card I really wanted in a quest, sometimes I realized it was not necessary, sometimes I learned it was really the one, that taught me what cards I always try to mulligan for now (and for which quests) and what hands I surely keep (in which quests). I haven't done it in a while but I recomend it especially to the beginners."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640699","commentId":640699,"userName":"Thorongil","timestamp":1338908174,"content":"I also think a variant like this is good for a learning tool, but I don't really have much difficulty with the quests solo, even given a suboptimal hand. Part of deckbuilding, as I see it, is the challenge of ensuring consistency across your draws. This means balancing your cost curve, your ratio resource/boost cards versus the actual power cards, and your ability to draw cards in the first place. Most of the time my decks have faltered, it's been due to lack of card draw, so I guess my recommendation would be to look into the value of cards like Beravor, Bilbo, Gleowine, Ancient Mathom, and others.\n\nGood luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65548-solo-players-a-suggested-drafting-method-for-opening-hands/?do=findComment&comment=640706","commentId":640706,"userName":"xibxang","timestamp":1338909179,"content":"Thorongil said:\n\nI also think a variant like this is good for a learning tool, but I don't really have much difficulty with the quests solo, even given a suboptimal hand. Part of deckbuilding, as I see it, is the challenge of ensuring consistency across your draws. This means balancing your cost curve, your ratio resource/boost cards versus the actual power cards, and your ability to draw cards in the first place. Most of the time my decks have faltered, it's been due to lack of card draw, so I guess my recommendation would be to look into the value of cards like Beravor, Bilbo, Gleowine, Ancient Mathom, and others.\n\nGood luck!\n\n\n\nOf course, you're absolutely right and I have endless amounts of respect (and envy!) for your skill set. Deck building is something I'd so love to be good at but I'm beginning to think that I might not have the observational finesse to see exactly what works and what doesn't. I seem to be a more en masse type of builder. Something works well? Get three of them in the deck!"}]}