{"url":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/","title":"LLT - Local LotR Tourney","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640614","commentId":640614,"userName":"cordeirooo","timestamp":1338899547,"content":"So, I have heard over and over that FFG will make a tourney system and what not, but I don't believe it will come up so soon; due to the wake of the first saga expansion, a good number of new players surfaced in my region, which prompted me to try to figure out a tourney system.\nUnfortunately, I only have 2 playtesters (the same who constantly test my custom scenarios with me) and I'm not having much time between law school and my company, but I have an idea (still in progress) to a way to develop a nice tourney scene in my playgroup.\n\n \n\n'How it works?' You ask.\nAsk and you shall receive!\nIt is pretty simple, but it needs some requirements; all you will do is to have a observer in each table to guarantee no one cheats (or makes a mistake) - while we are all friends, sometimes one rule may just slip your mind… and, well, I'm pretty sure everyone wants to win, some more than others; so, just in case. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nBut, Cordeiro (yeah, that's my surname, big surprise), who in the nine circles of hell would like to be an observer?\nGood question, mister on the left. I'll answer this simply: NO ONE!\nYes, that's right! No one will like to be an observer, you will be OBLIGED (not sure this is the right word, but who cares?) to be one.\nWhat will happen is that every round, some people will stay out of the match and become an observer.\n\n \n\nHmm, I got it. One question, though. How do we decide who is an observer and when?\nSee? This is a productive question!\nThis is a step in development yet. My idea is the following:\n\nThe Tourney will be in doubles (sorry solo players, I still haven't thought of you yet :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] - but I said YET), then, a certain number of doubles will be out (the first round will be decided via raffle) and each of the participants will be assigned one table to watch. Along with the observation, this person will have a little sheet to fill with each player's threat, cards in hand, damage on heroes and total number of resources per turn.\nWith this idea in mind, we have something like 1/3 of the field of each round, while the other 2/3 play. Certainly there will be some people who doesn't like this system, but it works for my playgroup, and I'll always have them in mind first.\n\nAnother little inconvenient, is how we'll determine the next observers. Will it be the least pointing players? Or another raffle (excluding the ones who participated last turn)? If we use this last method, we can have any number of odd rounds, with the fixed observers (the first third on the first round, the second on second, third on third, then everything starts over with the first third observing the fourth round and so on).\n\n \n\nWell man, that's lame!\nI told some people wouldn't like this system.\nWell, sorry mate. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\nStill, if you have something to say that will help me improve this system, I'm all ears (or… eyes?)!\n\n \n\nLast, but not least: What do I win, man? Seriously. I'm here for the prize! TEH PRIEZ I SAID!\nWow! Chill man.\nHere. This is another minor problem. Some people gave the idea of a 'cash' prize. I have no problem with that, but really, some people don't like to play this game with the competitive mind BUT will obviously enjoy a nice tourney scene.\nOne of my players gave the idea of giving the guy the option to help us produce a new quest or player card, kind of like how L5R (the best card game ever, yeah, don't discuss) involves it's players in the story and mechanic of the game.\n\n \n\n \n\n \n\nThat's it folks!\nHope you enjoy, and more than that, I hope you find this lacking some feature and you can help me fixing that out!\n\nCheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640620","commentId":640620,"userName":"richsabre","timestamp":1338900058,"content":"ok firstly youll know im not a tournament player, but youre always good enough to comment on my chapters so ill comment here……ive read everything (and sorry if ive missed this) but i see the problem of 'what if the observer isnt familiar enough with the rules'? i dont think anyone on this forum or others knows the rules inside and out…..yes there are some of us who are very close (radiskull im pointing at you) but everyone in your rules has to observe….and we all know what a pain the 'hard rules' are ie the ones that really should be in an updated FAQ by now\n\nalso who has the final say on rules disagreements? will there by a head observer?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640624","commentId":640624,"userName":"cordeirooo","timestamp":1338900647,"content":"Yes, that's another issue, but a minor one, to be honest.\n\n \n\nWe all know each other to a lesser extent, and all the observer needs to know is the basic rules. If he or the players have any doubt during the round, they can call me and we figure it out together. The real 'rules' he needs to observe is actually the flowing chart; I often mix up the resource and refresh phase because almost nothing happens (I straighten and draw a card simultaneously, together with raising my threat, etc) and this is something I would not do in a tourney scene: Everything must follow the rules. At your refresh phase, you ready everyone, raise your threat, do your actions (if any) and then proceed to the next turn (starting with… the Resource phase!).\n\n \n\n \n\nEDIT: Oh! I forgot to mention one thing: I'll not play the tourney, only help other people."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640659","commentId":640659,"userName":"Thorongil","timestamp":1338904432,"content":"Hi cordeirooo,\n\nWhile I'm not entirely certain the game needs tournaments, I've given some thought to different formats, and the simplest one I've dreamt up is this:\n\n1) Players build a single deck and bring any number of hero cards to the tournament.\n\n2) Each round, instead of pairing *against* someone, players pair *with* someone. It works like a reverse Swiss. After one round, you pair the top with the bottom and so forth.\n\n3) Players draft heroes with their partners. Either someone randomly selects a hero first, or both players just say what they want to play and dice off to resolve any disagreements.\n\n4) Players get some points for defeating the scenario and track the tournament score as a tie-breaker. It's in each player's best interests to both score as low as possible and to ensure their partner / rival plays honestly.\n\n5) At the end of X number of rounds, you could cut to 2 or 4 players. Otherwise, you could just compare (reverse) Swiss scoring.\n\nThe basic structure encourages players to help their partners defeat scenarios, even while working to keep their threats as low as possible and take as few wounds as possible. Unfortunately, it encourages some selfishness (I'll engage a weak monster to force you to take one that will kill your hero…), so it's not quite in the proper spirit of the game. However, I expect organizers could pick scenarios that force players to work together, rather than against each other, in order to succeed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640666","commentId":640666,"userName":"cordeirooo","timestamp":1338904996,"content":"Crap. I made a big answer but I know this software just hates me.\n\n \n\n \n\nStill, just like this software, I think your system has too many rules to just sit and play cards.\nSee, this is not me judging (I need to make it clear, because we are on the internetz! haha), just that I like mine better.\n\n \n\nThe idea behind both tournaments are different, I envision players coming with two decks that work well together and the best double wins, because they worked together. I don't care much for a public champ or something like that, so I don't need hard-rules to make it work. I want to just pick a number of scenarios and then make people struggle to win them. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nYours, on the other hand, has a big advantage over mine: The observer is YOUR OWN partner!\n\n \n\n \n\n*Also, I do not think the game NEEDS a tournament scene, just that it doesn't hurt to have one. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640683","commentId":640683,"userName":"Thorongil","timestamp":1338906377,"content":"Hey, you're organizing your tourney, so you're certainly welcome to run it however you'd like. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nI just know that I wouldn't be happy about getting stuck in the \"observer\" role, and I know that one of the things that interests me most about tournaments for other card games is that I get to see a diverse range of deck builds. If I play with the same partner throughout a whole Lord of the Rings \"tournament,\" I'll only ever see two decks. That doesn't really move me.\n\nReverse Swiss isn't a difficult concept, but I'll admit it's a little weird. I was mostly tossing it out in case anyone else was looking for ideas how to organize an event. The way I see it, the primary advantages my format offers are two-fold: No one sits out (except the \"bye\" if there is one), and you get to interact with a variety of decks.\n\nThere are, however, definitely advantages to a two-player format, where you and a partner can expect to help each other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640687","commentId":640687,"userName":"cordeirooo","timestamp":1338906918,"content":"Indeed! \n\nI was aware the observer would be somehow bad at first glance, but people here welcomed it with open arms.\nThey are itching for some form of organized competition to see how well they can perform.\n\n\nOther than what you already addressed, how do you manage to distribute points?\nI thought something like the F1 points-per-position. Instead of using the scoring and making a average, you give each double a number of points based on how well they went."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=640694","commentId":640694,"userName":"Thorongil","timestamp":1338907552,"content":"With the double, I figure you could score two ways simultaneously: 1) Take the total score for the partners and divide it by half for each player. 2) Each player tracks an individual score (turns, threat, wounds, etc.), taking half of all Victory Points (rounded up). That way, if you want an individual champion, rather than just a team champion, you can get one.\n\nIf you use Reverse Swiss, you would track wins, table scores, individual scores, and strength of schedule. The worse your partners' record, the better for you (provided you win when paired together). If you imagine it, it's kind of the opposite of a chess rating; you prove your worth by lifting others up, rather than by beating them down."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65551-llt-local-lotr-tourney/?do=findComment&comment=644363","commentId":644363,"userName":"Sprenger","timestamp":1339643507,"content":"My idea of a tournament is you would have 12 players. \n\nRound 1: 3 tables of 4 player \n\nRound 2: 3 Table of 4 player\n\nRound 3: 4 tables of 3 player\n\nRound 4:  4 tables of 3 player\n\n \n\nRound 1 and 2: \n\n[sETUP]\n\nTable Selection - Select the 3 Players with the most experience to act as  Party Leaders for each table. Then the other 9 players will be randomly selected to fill the rest of the slots at each table.   \n\n- Quest Selection: 1 quest will be selected and each table will run the same quest. [For Round 2 the quest is chosen after players finish building there decks]\n\n- Hero Selection :{Duration: 5 Minutes} Each player will be assigned a sphere at random. Then each player will get to select up to 3 Heroes from their sphere. After that the remaining heroes can be swapped out for players that want to splash. (The idea is that Non-Splashing decks take priority over splashing decks).\n\n- Deck Building: {Duration: 20 Minutes} Once Heroes are selected, players will build/change-up  their decks. {50 cards at a minimum) Party leaders will have to check each players deck to make sure they meet any and all requirements.\n\nTable Talk - This is one of the rules that is hard to enforce because it usually ends with players getting mad at each other. So the only hard and fast rule will be players are not allow to talk about cards in their hand. If this rule is broken that player must discard the card in question.\n\nThen each sphere will be assigned one aspect of the game to be in charge of. (This will keep every player focused on the game and help share the load to prevent errors)\n\nSpirit - Keeps track of the number of rounds, Threat raise during the refresh action\nLeadership - Total Threat in the staging area during the Quest phase.\nTactics - Total Will power of questing characters during the quest phase\nLore - Locations and lasting affects in the staging area\n\nParty Leader will also be in charge of revealing the encounter cards.  \n\nRound 3 and 4:\n\n[sETUP] \n\nTable Selection - The 4 players with the lowest score, with the fewest \"L\" become a party leader for one of the 4 tables. The other 8 slots are picked at random. \n\n- Quest Selection: 1 quest will be selected and each table will run the same quest.\n\n- Hero Selection :{Duration: 5 Minutes} Each player will be assigned a sphere at random. Then each player will get to select up to 3 Heroes from their sphere. After that the remaining heroes can be swapped out for players that want to splash. (The idea is that Non-Splashing decks take priority over splashing decks).\n\nParty Leader will pick up the responsibility of the missing sphere. \n\n\nScoring: \n\nEach table will have 2 attempts to complete the current quest. However players receive the score from the first time they complete the quest. If a table loses both games they receive an \"L\" for that round. When a table beats the quest each player is given the same score. If a table loses on the first try but win on the second they receive the score with a \"*\". The \"*\" would only be used in case of a tie between 2 or more players. \n\nIn addition to the 2 attempts, the group receives 1 conditional restart if the encounter deck wins in the first round. \n \n\nFinal scores: \n\nEach player adds all 4 scores together.\n\nThen the scores will be divided into groups based on the Number of \"L\" each player has. \n\nGroup 1 - No \"L\"\nGroup 2 - 1 \"L\" \nGroup 3 - 2 \"L\"\nGroup 4 - 3 \"L\"\nGroup 5 - 4 \"L\"\n\nThen Starting with Group 1, rank players from lowest score to highest score. Then move to Group 2. Then 3, Then 4 and Finally 5. "}]}