{"url":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/","title":"Automatically discarding characters from play is not fun","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/?do=findComment&comment=642739","commentId":642739,"userName":"Stenun","timestamp":1339365560,"content":"I’m getting rather sick of “instant kill” Quest Cards.\n\nUndisturbed Bones, card 33 from the Khazad-Dum expansion:\nShadow Effect: If the defending character is an ally, discard it from play,\n\nSudden Pitfall, card 51 from the Khazad-Dum expansion:\nWhen Revealed: The first player must discard 1 questing character he controls, if able. This effect cannot be cancelled. Shadow Effect: Discard the defending character from play.\n\nSleeping Sentry, card card 46 from the Road To Rivendell\nShadow Effect: Defending player must discard all exhausted characters he controls.\n\nNot to mention all the pain that The Redhorn Gate can inflict due to reducing Willpower and discarding characters if they have 0 Willpower left. Or Striking Tentacle’s “Forced” text which, through no fault of your own, can suddenly be attacking undefended so that’s 4 damage straight onto a Hero.\n\nThese cards aren’t a “challenge”, they’re not “difficult”, they’re just Russian Roulette. If the card comes up, you’re dead. Sleeping Sentry can kill a player in a strong position in an instant – discard the Hero that went Questing, discard the Hero that’s defending leaving the attack undefended which means the Enemy’s attack hits your lost Hero as direct damage. Bam, player eliminated.\n\nThese cards take the fun out of the game completely. Whether you win or lose is no longer down to player skill or deck construction or co-operative tactics or good play; we might as well just roll a dice and kill a Hero on each roll of 1. Woo, how fun …\n\nNow if this is a theme of the Dwarrowdelf cycle of Scenarios then OK; I don’t like it but I can accept it. It just means that I’ll play these Scenarios rarely in future. But if this sort of effect is going to be a permanent fixture in the game then I’m just gonna stop playing. These cards just aren’t fun, they’re just a random crap shoot.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/?do=findComment&comment=642752","commentId":642752,"userName":"Asmoridin","timestamp":1339368566,"content":"Agree completely.  Nothing takes the wind out of the sails of playing this game like setting up some stuff, and having one of your heroes 'auto-discarded' by an unlucky draw, with no way to counter it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/?do=findComment&comment=642785","commentId":642785,"userName":"jjeagle","timestamp":1339380546,"content":"I don't entirely agree. There is a skill element here in knowing the challenges presented by a particular encounter deck, and adapting your play to work around them.\n\nEg Sudden Pitfall - if you want to avert the worst consequences of this, don't quest unless you have a weak ally available to send.\n\nEg Undisturbed Bones - designed to punish blocking with weak \"meat-shield\" allies, I think. Use your heroes instead\n\nEg the Redhorn Gate - you need to know exactly what WP penalties can/might hit you in this quest, and when, and be accordingly careful in who you commit to quest.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/?do=findComment&comment=642837","commentId":642837,"userName":"Dam the Man","timestamp":1339398110,"content":"jjeagle said:\n\nEg Sudden Pitfall - if you want to avert the worst consequences of this, don't quest unless you have a weak ally available to send.\n\nEg Undisturbed Bones - designed to punish blocking with weak \"meat-shield\" allies, I think. Use your heroes instead\n\nEg the Redhorn Gate - you need to know exactly what WP penalties can/might hit you in this quest, and when, and be accordingly careful in who you commit to quest.\n\n\n\nI agree on Sudden Pitfall, although turn 1 it can be heartbreaker. However, regarding Undisturbed Bones, if you do block with a hero, you can bet your candy-ass the Shadow Effect will then be Sudden Pitfall, meaning you lose the defending hero and quite possible another hero as the attack just became undefended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/?do=findComment&comment=642883","commentId":642883,"userName":"richsabre","timestamp":1339407264,"content":"i agree it is frustrating and certainly takes away some of the strategic aspect of the game,but as above there are ways to strategically stop them, so i dont think theyre that bad…..just dont want to see too many of them\n\nactually  i was just thinking of how they remind me of the original dungeonquest cards- that was BAD for luck based play- i mean you have like a 2% chance of winning- ive never won personally"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/?do=findComment&comment=642894","commentId":642894,"userName":"Bohemond2","timestamp":1339408457,"content":"I won't argue about Sleeping Sentry, which I see as a badly designed card as well because of the scope of the card. \n\nUndisturbed Bones, Sudden Pitfall  and even Sleeping Sentry have multiple ways to control them.  If you have a way to use Lore scry, you can tell they are comming and avoid their effects.  Spirit offers hard counters or replacement draws for most these events and all of the shadow effects.  Cards like Burning Brand, Feint or Forest Snare can prevent you from ever drawing shadow effects.  So can keeping threat low, deploying a lot of direct damage or a myriad of other strategums.  Careful deployment of allies, backed up by tough heroes and some healing, allows you to mitigate the effects of these cards, even if they lead to undefended attacks.  You have a range of tools you can use to manage these potentially devastating cards.\n\nAs for the Red Horn Gate, navigating that threat is the major challenge of the quest.  There is nothing random about it.  You know the effect is commining.  SKileld players construct decks that will be able to handle that threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65797-automatically-discarding-characters-from-play-is-not-fun/?do=findComment&comment=642941","commentId":642941,"userName":"dvang","timestamp":1339413762,"content":"As mentioned, there are several ways to prevent or mitigate both Shadow Effect cards, as well as When Revealed effects."}]}