{"url":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/","title":"Question about the twins.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=643142","commentId":643142,"userName":"hildargo","timestamp":1339436340,"content":"I recently built a deck that I thought would utilize the twiins pretty well, but when thinking about it, I think I may be playing them wrong. So here is the question to those who would know how to play them better than I: Can I exhaust them to quest, and then when the combat phase occurs, declare them as defender (Elrohir) or attacker (Elladan), use their action to ready them, and then resolve the attacks? I think I know the answer to this, which is no, but I just want to get some consensus on this. Thanks.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=643165","commentId":643165,"userName":"muemakan","timestamp":1339437918,"content":" Exhausted characters cannot defend or attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=643179","commentId":643179,"userName":"hildargo","timestamp":1339438745,"content":"This is what I thought, especially revisiting the rule book. Thanks for the quick reponse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=643283","commentId":643283,"userName":"Glaurung","timestamp":1339456922,"content":"The brothers a cool. But there is a problem in solo game: if one brother die another is going to be very weak. And most of the time(actually all of the times in my case) in means you lose the game.\n\nIn coop game better each player use 1 brother instead 1 player control both. This strategy more useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=643979","commentId":643979,"userName":"DevastazioneH88","timestamp":1339581901,"content":" With glorfindel they're gonna be great in solo too. In coop I found them awsome in a ranged-sentinel support deck with legolas…obviously your partner has to quest with almost every character and heal your wounds at times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=643980","commentId":643980,"userName":"DevastazioneH88","timestamp":1339581911,"content":" With glorfindel they're gonna be great in solo too. In coop I found them awsome in a ranged-sentinel support deck with legolas…obviously your partner has to quest with almost every character and heal your wounds at times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=644074","commentId":644074,"userName":"leptokurt","timestamp":1339593670,"content":"Glaurung said:\n\nThe brothers a cool. But there is a problem in solo game: if one brother die another is going to be very weak. And most of the time(actually all of the times in my case) in means you lose the game.\n\nIn coop game better each player use 1 brother instead 1 player control both. This strategy more useful.\n\n\n\nWell, if one of your hero dies midgame it's always true that you're likely going to loose, not only for the twins.\n\n \n\nWhen I play the twins I ususally send Elladan questing long with the third hero. Elrohir will be there as my defender. Due to Elladan's ability it doesn't really matter if he is not able to attack in the round in which an enemy engages you. Even if there should be a second enemy next round, the twins can handle both of them easily."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65844-question-about-the-twins/?do=findComment&comment=644121","commentId":644121,"userName":"Dam the Man","timestamp":1339602049,"content":"I think this might be more appropriate in the Strat & deck-building section, but since this thread is up, why make a new one?\n\nMy Leadership/Tactics deck has maintained two of its heroes from the start, was Coragorn, Theodred, Legolas, when Loragorn came out, replaced Coragorn with Imrahil. While tweaking the deck with the TWitW and TLD cards, I was considering the twins instead of Imra and Lego (same combined threat cost), but I'm still unsure if it would pay off. On one hand, both twins having 2WP would allow the Tactic-twin to take part in questing (which Lego almost never does) and thus gain resources from Theodred, but on the other, Lego's innate Ranged + 2 progress for kill is never a bad thing. Would need Rivendell Bow (or the Leadership card) to give Ranged, instead of having innate Ranged. Progress could also be done via 2x Blade of Gondolin, but again, cards, time and resources needed. So far, haven't really gotten a lot of use out of Imrahil's ready ability (playing TWitW atm) and keep getting left without a defender if I quest with him, which first three or so turns he pretty much has to, only if Theo gets Celebrian's Stone can he be kept back. Defense would go up a notch, although none of the heroes are still able to withstand a Striking Tentacle (card which is going up the \"hell yes I'm pissed off\" list fast), same for questing in general.\n\nPros/cons?"}]}