{"url":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/","title":"Down with Dwalin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=643284","commentId":643284,"userName":"Narsil0420","timestamp":1339457053,"content":"**Disclaimer: Please note that this post was written by Matt's wife, and in no way reflects on his sentiments about Dwalin…or Beorning Beekeeper.\"\n\nWith the advent of Glorfindel, it's no secret that Spirit is fast becoming (if not already) the strongest sphere.  The only blight, on what I consider to be a well rounded sphere is Dwalin - what a waste of a card.\n\nYes, I am aware that his power of threat reduction (when used in tandem with secrecy) can be useful, but I find in most games it is a small consolation.  Further more, any true effectiveness that Dwalin brings to the game is enhanced only by a benevolent tactics player.  Truly, Dwalin is at his best when he is outfitted with several of the tactics attachments, but as a stand alone character he is ineffectual. A case can be made that he is more of a cooperative character, best suited for games where heroes from different spheres are mixed, but that being said, I still return to my earlier point which is that he is best when he is combied with tactics, which again shows how very limited his use is.\n\n(As a side note, because \"beefing him up\" requires cards from other spheres, his special ability should have been able to be extended to other players in reciprocity for assignment of their items to Dwalin.  It seems a weak 'thank you' to another player to use their attachments and only pay them back when Renewed Friendship rolls around)\n\nI have yet to play a game or find a scenario that has truly allowed Dwalin to be anything but mediocre.  To me, Beorning Beekeeper is more valuable (especially when used in tandem with Thalin in the Seventh Level scenario.  Talk about carnage, I've killed multiple goblins with this lethal combo!)  And I think that's saying something.\n\n~Amanda"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=643354","commentId":643354,"userName":"Budgernaut","timestamp":1339473778,"content":" Interesting. I was just trying to make a monosphere Spirit deck today and my first goal was to include Dwalin somehow, but I felt as you did: he really needs an attack boost. So he ended up not making the cut."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=643362","commentId":643362,"userName":"lleimmoen","timestamp":1339476025,"content":"I do agree with Amanda. I dislike having situational cards like this in a deck as I don't switch cards in between the quests.\n\nI do like Beorning Beekeeper (mostly for the theme) despite the rather high cost. It is also quite situational but at least it doesn't have the restrictive requirement, there may always be enemies in the staging area but BB is probably best suited for multiplayer games, the more players the better the chance of having more enemies lined up for him to strike. I wish the cost was 3 though, it would surely not be OP then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=643629","commentId":643629,"userName":"gatharion","timestamp":1339516698,"content":" I've been perfectly happy to have Dwalin repping Spirit for the Dwarf decks and giving them some much needed threat reduction. He combos quite nicely with numerous Dwarf cards.\n\n \n\nI don't think I've ever considered playing him in a deck that wasn't Dwarf-themed, but I'm okay with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=643638","commentId":643638,"userName":"Bullroarer Took","timestamp":1339517375,"content":" IMO, Spirit has always had the silver spoon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=643943","commentId":643943,"userName":"Captain Poe","timestamp":1339577095,"content":"Dwalin is situational, but I don't think there is a single quest at this point that has no orcs… so that situation is fairly common to capitalize on. I've had a great degree of sucess using Dwalin with Boromir…  Boromir can be untapped twice a round if you can manage to kill an orc with dwalin, and at no cost in the end. Especially early game, its nice to block with Boromir, unexhaust, and then have him assist dwalin in the kill. The -2 threat negates both boromirs ready action and the +1 threat that you would normally take for the round, thus, breaking even.\n\nI also believe that as more dwarf darks are released, he will only become more useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=643989","commentId":643989,"userName":"lleimmoen","timestamp":1339583082,"content":"I might do the math later but surely the chances of meeting an Orc are rather slim in Hunt (just the MMG), Carrock (MMG, WR and Sniper - which is no natural target for Dwalin anyway), Emyn Muil (Thieves) and Return to Mirkwood (?). And even in Dwarrodelf the Redhorn Gate and Watcher only has a few."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644040","commentId":644040,"userName":"Dam the Man","timestamp":1339588623,"content":"Whichever Mirkwood quests use Dol Guldur Orcs as one of the Encounter sets, you have 3x Dol Guldur Orcs, 1x Ufthak and 2x Beastmaster included.\n\nStill, I'll take Dwalin over Dunhere and since those are the two options left for a Spirit hero before the new Glorfindel, might as well go with Dwalin in my Tactics/Spirit deck, it has had the Dwarven Axes in it since day one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644073","commentId":644073,"userName":"lleimmoen","timestamp":1339593620,"content":"Interesting really. Choosing between the two I would always but ALWAYS go for Dúnhere. Again the designers prove their worth giving us options like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644112","commentId":644112,"userName":"Dam the Man","timestamp":1339601067,"content":"Yeah, I think we've danced the Dunhere-Craphere dance a few times before, right? Are you mostly a solo (1-deck) player? My summary of Dunhere is: can't quest, can't attack, can't defend. At least he doesn't excel at any of those three, mediocre in attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644140","commentId":644140,"userName":"lleimmoen","timestamp":1339604190,"content":"He's best in attack in some situations. We all know he's the only one who can hit the staging area (beside the direct damage). He helped beat Osgiliath many times, solo and coop. And every time I saw someone mention having trouble with Hummerhorns or the Sniper I felt good having Dúnhere on my side.\n\nHowever, he does require to deck-build around him quite a lot. I would say much more than a usual hero, so here the problem may lie. Plus, some quests are not very fit for him. Still, I think he's superb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644195","commentId":644195,"userName":"booored","timestamp":1339610697,"content":"are you crazy? He is frickn awesome. That -2 Threat each kill is HUGE. Especially for a secrecy deck. While I think that Spirit is the strongest sphere and Lore is no slouch… This Hero is extremely powerful. I used to think the same but then tried him in a few decks to see how it goes and the constant threat reduction is just insane.\n\nI think he is key for a secrecy deck. If you run this guy you can run three heroes and still be fairly sure to hit secrecy after a few turns. Most secrecy decks are trying to field heroes that are under 20 threat.. this is very hard even with the new 5 threat dude.\n\nIf you tun run Dwalin then you can still run that 3rd hero and achieve secrecy anyway.\n\nHe is a strong hero and vital to a few deck types. Like the Boromir orc slayer deck for Khaz\n\nPublish [http://www.fantasyflightgames.com/edge_public/img_edge/spacer.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644197","commentId":644197,"userName":"booored","timestamp":1339610881,"content":"Dam said:\n\nYeah, I think we've danced the Dunhere-Craphere dance a few times before, right? Are you mostly a solo (1-deck) player? My summary of Dunhere is: can't quest, can't attack, can't defend. At least he doesn't excel at any of those three, mediocre in attack.\n\n\nDunhere is good but you need to build a deck for him. His ability to attack into the staging area is extremely good but unless you build a low threat deck then he is just not worth it. I think he is a complex hero and kinda ahead of his time as he is startingto really shine in these secrecy decks that are trying to become at the moment. A deck type I still think needs more cards. I am hoping for some killer secrecy cards to glue the secrecy deck together by the end of the cycle like with the eagles deck in SoM."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644362","commentId":644362,"userName":"lleimmoen","timestamp":1339643474,"content":"booored said:\n\nare you crazy?\n\n\n\nMaybe I am. But not to the point to give out such judgement about others based on a card preference, nor to jump to quick conclusions often based on limited experience.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644396","commentId":644396,"userName":"Dam the Man","timestamp":1339649895,"content":"booored said:\n\nDunhere is good but you need to build a deck for him. His ability to attack into the staging area is extremely good but unless you build a low threat deck then he is just not worth it. I think he is a complex hero and kinda ahead of his time as he is startingto really shine in these secrecy decks that are trying to become at the moment. A deck type I still think needs more cards. I am hoping for some killer secrecy cards to glue the secrecy deck together by the end of the cycle like with the eagles deck in SoM.\n\nTrue, but in a 2+ player game, all the decks have to be built to manage Dunhere. His ability goes to waste if any other deck has a starting threat that sees Enemies auto-engage soon after the start. And really useless in TWitW, where those dam(n) Tentacles engage at 12 and 18!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644402","commentId":644402,"userName":"lleimmoen","timestamp":1339650834,"content":"Dam said:\n\nbooored said:\n\nDunhere is good but you need to build a deck for him. His ability to attack into the staging area is extremely good but unless you build a low threat deck then he is just not worth it. I think he is a complex hero and kinda ahead of his time as he is startingto really shine in these secrecy decks that are trying to become at the moment. A deck type I still think needs more cards. I am hoping for some killer secrecy cards to glue the secrecy deck together by the end of the cycle like with the eagles deck in SoM.\n\n \n\nTrue, but in a 2+ player game, all the decks have to be built to manage Dunhere. His ability goes to waste if any other deck has a starting threat that sees Enemies auto-engage soon after the start. And really useless in TWitW, where those dam(n) Tentacles engage at 12 and 18!\n\n\n\nBut what would you call Gimli in the Watcher then? Dúnhere can at least hit at them mildly and survive the thrashing but the whole point of boosting Gimli is turned upside down there. It's hard to find a hero suited for every quest. But it's true that the attacking specialists, like Dúnhere (or Dwalin) are more situational than some others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644472","commentId":644472,"userName":"Dam the Man","timestamp":1339667232,"content":"Well, Gimli quests for 3 (vs 1 for Dunhere, naturally Dain is in the same deck as Gimli), can defend against most Enemies twice and can smack down a Mountain Warg in one hit. Plus, you only need to hit the Trasher for 3, heroes can take that and if you do get a bad break, toss the damage on a meatshield. And most importantly, he can take a Striking Tentacle's undefended hit unless it gets +attack from the Shadow Effect. He does everything better than Dunhere for only 3 more threat.\n\nFor me it is hard to find a quest where Dunhere is worth it. Seventh Level, due to those Goblins getting added to the staging area from Shadow Effects, is the only quest so far where I've found him to carry his own weight, instead of dragging everyone down with him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644497","commentId":644497,"userName":"lleimmoen","timestamp":1339671408,"content":"I love these comparisons, Gimli quests for 3, hmm, Dúnhere on Astonishing Speed quests for 3 as well.\n\nBut really, each to his own, of course when you're not about to try something out, you're hardly about to learn. And as you say you only play a quest 10 times and be done with it. And I suspect for most of those you haven't even picked Dúnhere once. I rather try and tune a certain strategy without counting the games. I've killed Nazguls and Trolls with him and he helped ease the questing considerably, I wouldn't be telling you if I haven't just for the sake of proving a point. Why would you count the games to 10 anyways?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644548","commentId":644548,"userName":"Captain Poe","timestamp":1339676160,"content":"lleimmoen said:\n\n \n\nI love these comparisons, Gimli quests for 3, hmm, Dúnhere on Astonishing Speed quests for 3 as well.\n\nBut really, each to his own, of course when you're not about to try something out, you're hardly about to learn. And as you say you only play a quest 10 times and be done with it. And I suspect for most of those you haven't even picked Dúnhere once. I rather try and tune a certain strategy without counting the games. I've killed Nazguls and Trolls with him and he helped ease the questing considerably, I wouldn't be telling you if I haven't just for the sake of proving a point. Why would you count the games to 10 anyways?\n\n \n\n \n\n\nI've played dunhere. I'm a solo player. You have to understand, from a solo point of view, I really need 3 bases covered. Quest, Attack, Defend. Dunhere obviously is an attacker. The problem is, is that on certain quests, the encounter threat of the monsters is just too low. He is not that good of an attacker unless he's attacking the staging area. So, if you get mobbed you  can't really do much to clean up the mess. On other quests, especially with high encounter threat monsters, dunhere does do better, BUT, if  you have to deal with 3 Defense 5+HP enemies… well, you're in trouble again. There are a few attack boosting solutions at this time… dunadain cards, some dwarven axes can be used with him, but it takes a lot of work.\n\n \n\nSince this is supposed to be a dwalin thread, i'll tie it back in. While dwalin and dunhere have the same attack when dealing with engaged enemies, I feel like Dwalin has a few edges. He has access to some better weapon choices (or gets more use out of the weapons that he and dunhere can both use), and he also has access to Dain, giving him a +3. As I stated earlier, when used with boromir, I find the bonus of his threat reduction to be great as you can easily break even, stalling threat generated from a generally high threat character.\n\nI think dunhere has his uses, but for a solo player, it just depends on the quest. Unless I think I can fly under the radar, I would almost always pick dwalin. If I think I can keep my threat low, I would go dunhere (he's how I managed to solo the 4 trolls with relative ease after getting smashed by them when trying to engage in more conventional means)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644563","commentId":644563,"userName":"lleimmoen","timestamp":1339677497,"content":"I think it's definitely harder to find a deck for Dúnhere solo, since as you say the deck has to do it all. And Dúnhere really needs a Tactics hero so then you have two heroes already that don't quest (or hardly ever). And coop is hard because both players (or more) have to keep low. So I agree, not easy.\n\nYou mention Dúnedain Mark, yes, that and Fresh Tracks is great. But Unseen Strike it the best boost for him. And now he's got Háma, it is not easy either to divide the attacking between the two but Háma helps recycling the most important cards for Dúnhere, Unseen and Quick Strike. On a good day you can apply one copy of Unseen Strike twice in a phase, and then +6 is good. Eagles are another aid for this strategy.\n\nI am sure one can theorize like this about Dwalin quite as well - or better. But there's no escaping the fact that some quests only have a very few Orcs. Actually the ones I tend to play most (which is my choice of course) like Osgiliath have so few that Dwalin's ability is almost totally vain - or surely not worth  more than a copy of the Galadhrims."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644566","commentId":644566,"userName":"Dam the Man","timestamp":1339677700,"content":"lleimmoen said:\n\nI love these comparisons, Gimli quests for 3, hmm, Dúnhere on Astonishing Speed quests for 3 as well.\n\nNot on the first turn unless you play full Spirit or Theodred along with two Spirit heroes. Gimli quests for 3 without any additional card in the play deck, of which AS takes a slot (gimme 3x Lure of Moria over 3x AS any day).\n\nlleimmoen said:\n\nBut really, each to his own, of course when you're not about to try something out, you're hardly about to learn.\n\nEh, what is there to learn? Spending hours building/tweaking decks vs spending hours playing, I'll take playing thank you very much. Building decks is time wasted on not playing for me.\n\nlleimmoen said:\n\nAnd as you say you only play a quest 10 times and be done with it. And I suspect for most of those you haven't even picked Dúnhere once. I rather try and tune a certain strategy without counting the games. I've killed Nazguls and Trolls with him and he helped ease the questing considerably, I wouldn't be telling you if I haven't just for the sake of proving a point. Why would you count the games to 10 anyways?\n\nUmm, before Dwalin came out, I was FORCED to include Dunhere, since there was no other Spirit hero on offer (and no, Froho doesn't count since hobbits will NEVER see play). So I've seen him in a deck close to 100 plays I'd say. Initially he was either in Spirit/Lore deck with Beravor and Eleanor or Tactics/Spirit with Gimli and Thalin. In the former, he was twiddling his thumbs, anything that engaged, he couldn't kill in one go (which is important, since that deck lacks/-ed both defense and attack) and most of the time they had to either engage an Enemy or have the other deck take on both Enemies, but either way, no Enemy in the staging area for him to attack. I would much rather engage a Dol Guldur Beastmaster and have him attack once, then kill him in one go, than chip away with Dunhere while it is in the staging area contributing threat. In the Tactics/Spirit deck, questing was an issue, but more over, with Gimli in the mix, he was again pitiful in attack in comparison.\n\nAnd I don't count to 10, I have a simple sheet which I tick off which pair has played.\n\n1-2\n3-4\n5-1\n2-3\n4-5\n1-3\n2-4\n3-5\n1-4\n5-2\n\nTwo plays per day, that way I don't have to play the same deck more than once per day. After that rotation, each of the decks has been paired once with each other deck against the quest currently played. At that point, a quest is \"complete\", I've seen it played with all deck combinations, I see no reason to re-run it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644569","commentId":644569,"userName":"lleimmoen","timestamp":1339678358,"content":"I could go on and on, you give strange examples like one cannot play AS unless you have 3 Spirit heroes or Théodred, what is that? Also no Hobbits, ok, interesting logic there. Sometimes it's hard to argue with people of such strong principles. But enough of that.\n\nWell, thanks for illumination about the numbers. So you say building decks is wasting time. Ok, I actually like it but I understand it's not for everyone. But then you keep complaining (or so I thought) that you lose to Road to Rivendell every game, mostly in opening few rounds, is that fun? It certainly never happened to me out of some dozen games now (I lost one but in the final stage due to the Sentry). Don't you think it's more fun that way, meaning when the deck can actually win consistently? More so, there's nothing wrong about winning or losing, I have lost against the easiest quests and I suck in many games. But arguing whether certain character is crap (what you called Dúnhere) and at the same time prasing a different character which gives you such crap record, that is quite strange."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644586","commentId":644586,"userName":"Dam the Man","timestamp":1339680567,"content":"Note I said AS (costs 3) on turn 1 is not feasible without 3x Spirit or 2x Spirit + Theo. Spending all your resources for that vs getting the same with just Gimli and saving up resources.\n\nNot sure how building a deck would help when you get 3 Enemies engaged turn 1 and one of them gets SS when the draw doesn't go your way (meaning no Hasty Stroke, of which I do have 3x in said Spirit/Lore deck) or your resources are wiped out by another Treachery when you do have it. Dunhere can't help at all, not with Ambush having them auto-engage. I'd say those quests I won with Dunhere, I won inspite of having him in play (because they were easy quests like Carrock or Emyn Muil) and would've lost those quests (like RtR) even with Dunhere. He was the star in Seventh Level (hell, even had UC on him there), but in no other quest do I see the amount of Enemies in the staging area and if there are no targets for him, especially without pumping him up with 2+ Marks so he can actually do some damage, he isn't delivering. Might as well put those Marks on Brand or Legolas who have Ranged AND provide benefits besides just killing an Enemy. Okay, MaO had quite a few Enemies there, but with so many of them engaged and those in the staging area being durable enough to survive at least one turn from him, it is again more important to deal with the ones engaged, ideally engage some in the staging area and kill them outright.\n\nRegardless of my record against a quest, I don't see any reason to go back to it. After 10 plays, I think I have a decent view of what it has to offer, what's the point of rehashing it? Might as well play other games while waiting for the next quest to come out. Note that this isn't limited to LotR, pretty much all scenario-based games I own (Command & Colors seriers, Gears of War, Mansions of Madness) suffer the same limitation, once I've played it, there just doesn't seem to be any point in playing it again (double-headers in C&C, 6 plays per mission in GoW and once per each objective in MoM). If I have breezed through a quest, with a win-% of over 50, there is even less interest in playing it again, but going 1-5 (Dol Guldur and Return to Mirkwood) or 2-8 (RtR and MaO) doesn't entice me to go back either, I've taken my licks, I'm not a glutton for punishment for losing even more. Winning around 50% is fine by me, winning consistently to me, as a term, means going up to 65-75% win-record, at which point things get boring because they are too easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644602","commentId":644602,"userName":"lleimmoen","timestamp":1339682290,"content":"As I said, I totally understand your point of view, with the games played, repetition, deck-building. Mine is different and that is alright.\n\nThe one thing I didn't understand was that you were trying to prove Dúnhere sucks despite A) not using him much (or hardly at all) and B) not doing that well with some of the heroes which you gave as an example of being far superior to him. And I wasn't trying to argue to death, I was just giving an advice which could enhance your future gaming perhaps.\n\nThe examples you give about Road or Massing are partly misleading. As we know Dúnhere is better when your threat is low so that you need to try and keep. There's no Doomed in Road to Rivendell (I believe) so when you start with a low threat (under 27) there's no way you get three enemies engaged with you on round one. Similar with Osgiliath, once I started using Dúnhere I think I have won about half the games against Osgiliath solo or 2-player (having almost no chance with more than 2 players). In those games I won, there were hardly ever any enemies engaged, especially in solo play, you only need to worry about the Snaga (and Dúnhere can kill one on round 1) and killing Wolves early enough (before you hit 27 again); then he just chips them away as you put it. He can kill the Easterlings in two blows but in one with 2 marks or Unseen Strike (not that hard to combo), Wolves go down right away with a single Mark; Fresh Tracks as I said before make things much easier still."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644649","commentId":644649,"userName":"Dam the Man","timestamp":1339688256,"content":"Remember, I play 2-deck games, thus would require two decks with below 27 threat. Currently only have one, that Spirit/Lore with 26, others are 28-30. Because I play 2-deck, RtR for example I'm looking at min 2 cards for setup + another 2 min for turn 1. Odds of getting 3 Enemies aren't all that small, at least they didn't seem to be.\n\nSimilarly, one of today's TWitW games, started with Striking + Grasping Tentacle, got the same pair for staging on the opening turn. Needless to say, it didn't last long. Might've had a chance with the Dwarf deck (both Dain and Gimli could take the ST undefended), but instead it was the pair of Leadership/Tactics and Spirit/Lore, none of those six heroes have more than 4hp, so one Forced triggering for ST = dead hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644654","commentId":644654,"userName":"lleimmoen","timestamp":1339688838,"content":"But that's exactly why deck-building makes sense. With the 25 heroes (two duplicate) now, the options are certainly there. I know you don't deckbuild for oarticupar quests but neither do I. It's nice however to have certain prototypes of decks that work for certain situations, and especially when you run 5 decks, it shouldn't then be too hard to have two of low initial threat. And this is where Dúnhere steps in perfectly, he won't be great in some quests but shall be very special in others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644744","commentId":644744,"userName":"booored","timestamp":1339709215,"content":"Talking about Dunhere, it is interesting to note that the threat reduction effect of Dwalin is very synigistic with Dunhere. These heros go very well togteher as Dwalin is one of teh best threat reduction options around in the game at the moment.. spesh if you are in orc heavy decks. His ability to drop the threat with easy and with out the use of card back under secrecy or in dunheres case under the engagment level for the player. it not to be scoffed at.\n\nCaptain Poe said:\n\nI've played dunhere. I'm a solo player. You have to understand, from a solo point of view, I really need 3 bases covered\n\nUm.. Dunhere is a solo hero. In multiplayer decks you need to control the threat of everyone at the table for his effect to be functional. He is MUCH better solo hero.. and a very powerful one as well… you just need to build your deck around it.\n\nDam said:\n\nand no, Froho doesn't count since hobbits will NEVER see play\n\nlol, what have you got against our big footed friends?\n\nDam said:\n\nNot on the first turn unless you play full Spirit or Theodred along with two Spirit heroes. Gimli quests for 3 without any additional card in the play deck, of which AS takes a slot (gimme 3x Lure of Moria over 3x AS any day).\n\nI in fact think Gimli is a pretty bad character. He's effect is just over powered. Not in a broken card kind of way, but in that by the end game and after you have the attachments working on him, he is hitting for way more dmg than you will ever need.. so in a way his ability becomes negated and worthless. In much the same way a ewoyen is a card for beginners that are not very good at deck building.. so is Gimli. Once you start to substitute him for heroes that have much better long term abilities that are reverent for then entire course of the game you just can not go back. His threat level is just prohibitive, and his effect is irrelevant… I just can never really fund much of an excuse to run him.\n\nlleimmoen said:\n\nThe one thing I didn't understand was that you were trying to prove Dúnhere sucks\n\nI do not think anyone is saying he sucks.. He was one of my fav Heros for a long time and is key in solo decks to beat Carrock, Audin and Dol Guldor. But he dose require clever deck building and also you need to pilot your deck correctly.. he is defiantly one of the trickery heroes to run, and his use drops the more players you add over solo as you need to threat manage every play on the table."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644799","commentId":644799,"userName":"gatharion","timestamp":1339722265,"content":" Really? After three straight quests filled with wargs that had a nasty habit of jumping back into the staging area and folks are questioning Dunhere's usefulness? \n\nHe's not my favorite hero, but it's not that unusual for him to be useful either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644809","commentId":644809,"userName":"Dam the Man","timestamp":1339724187,"content":"booored said:\n\n \n\nlol, what have you got against our big footed friends?\n\n \n\nList is long.\n\nbooored said:\n\nI in fact think Gimli is a pretty bad character. He's effect is just over powered. Not in a broken card kind of way, but in that by the end game and after you have the attachments working on him, he is hitting for way more dmg than you will ever need.. so in a way his ability becomes negated and worthless. In much the same way a ewoyen is a card for beginners that are not very good at deck building.. so is Gimli. Once you start to substitute him for heroes that have much better long term abilities that are reverent for then entire course of the game you just can not go back. His threat level is just prohibitive, and his effect is irrelevant… I just can never really fund much of an excuse to run him.\n\n \n\nOnly other dwarven option left atm is Thalin. While he might quest for 2 with Dain, Gimli can do some killing before getting Erebor Battle Master out. As Gimli is the one most often turning in his resource to Bifur, it can take a while. But starting threat 27 (with Thalin) or 29 with Gimli, it doesn't make a whole lot of difference. Still won't hit 50 threat in most cases before the end and will be engaging Enemies to get them out of the staging area when a kill can be had, even if they wouldn't auto-engage.\n\n@ gatharion: Wargs packs 2 def and 4 hp, vanilla Dunhere needs 4 turns to kill one, even single-marked takes two turns. That's assuming you have no other Enemies engaged that might need to be attacked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644847","commentId":644847,"userName":"lleimmoen","timestamp":1339736027,"content":"A single Unseen Strike can make him kill the Wargs. That is ONE card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644919","commentId":644919,"userName":"Dam the Man","timestamp":1339748001,"content":"lleimmoen said:\n\nA single Unseen Strike can make him kill the Wargs. That is ONE card.\n\n\n\nWargs have engagement cost of 30, meaning, unless they come out during the first turn or two, US would only boost one of the decks I have (or none, if that Doomed 5 pops out).\n\nAlso, might be a solo vs multiplayer thing, but not a fan of cards like US, especially if they are so situational an Event, that can only be played on a char you control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644947","commentId":644947,"userName":"lleimmoen","timestamp":1339752057,"content":"It all comes in circles. Yes, if you cannot keep the threat low for Dúnhere, don't play him. My experience with Unseen Strike is that I think I have played the card more than 20 times (somtimes repeatedly when I played Háma also) and only once or twice I had it in my hand and was unable to use it. From that experience Dwalin can be called situational, US not even close to it. Actually right now I cannot think of a card which would see play so easily in my games, especially given the cost of 0."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=644992","commentId":644992,"userName":"Dam the Man","timestamp":1339756963,"content":"Weren't you only earlier talking about how tough it is to have a Tactics hero in a solo deck?\n\nFor US, I looked at the card, saw the threat requirement clause and packed it away right after opening the pack. Tactics/Spirit deck has Boromir for me, so threat isn't really going down, Leadership/Tactics lacks any and all threat reduction (bar Gandalf), another \"no chance in hell\" to get use out of US, except against those 40+ threat Enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=645005","commentId":645005,"userName":"booored","timestamp":1339757867,"content":"Dam said:\n\nbooored said:\n\n \n\nlol, what have you got against our big footed friends?\n\n \n\nList is long.\n\n\n\ngo on tell me!! I wana know.\n\nPublish [http://www.fantasyflightgames.com/edge_public/img_edge/spacer.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=645014","commentId":645014,"userName":"lleimmoen","timestamp":1339758916,"content":"Dam said:\n\n \n\nFor US, I looked at the card, saw the threat requirement clause and packed it away right after opening the pack.\n\n \n\n \n\nI think this pretty much sums up your game status. Again, each to his taste, but with this attitude you're hardly going to enhance your gaming experience. It seems to me you have this sort of military approach to gaming in general, have your strict order, play the games - you even schedule them 2 per day, and be done with it. It almost frightens me someone can take a game to such level."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=645085","commentId":645085,"userName":"Dam the Man","timestamp":1339769953,"content":"lleimmoen said:\n\nDam said:\n\n \n\nFor US, I looked at the card, saw the threat requirement clause and packed it away right after opening the pack.\n\n \n\n \n\nI think this pretty much sums up your game status. Again, each to his taste, but with this attitude you're hardly going to enhance your gaming experience. It seems to me you have this sort of military approach to gaming in general, have your strict order, play the games - you even schedule them 2 per day, and be done with it. It almost frightens me someone can take a game to such level.\n\n\n\nI guess for you, when I opened the packs that had Fast Hitch or Good Meal, I must try to include them in a deck even when there are no hobbits in sight, just to \"enhance the experience\"? While US wouldn't be a 100% useless card like those two, I would like to think I'm better off not including such a marginal card but rather put in a card that actually sees play.\n\nIf you don't schedule your plays (like, two games tomorrow), how do you settle on when to play and what to play? On a whim?\n\nIf I was playing 1-deck games, I would only get half the games I now do. Further, having a sheet enables me to ensure that all decks get the same amount of plays (otherwise, if some deck isn't getting played, why have it at all?). If I cherry-built for each deck, I would only get a single play with each given deck, then would have to blow it up and make a new deck to play the quest again. For me, once I've seen a quest with deck X, what's the point of playing it again with deck X? That would result in too much time wasted on building, not playing, time that would also reduce the time I could play other games. I've been reading the games reported by people in those Living Tournaments and know I could never take part. Even if I cared to build a solo deck, I could never care to play a quest three times with the same deck, let alone in a row, just playing the same quest for the second time with the same deck is already boring. Three times? Never."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=645112","commentId":645112,"userName":"lleimmoen","timestamp":1339774242,"content":"I see.\n\nI do have some free time now. And I can play several games a day and seldom mind the repetition. When alone I tend to play quite quickly and I can easily manage three to four games an hour. Although I have to say I only repeat the quests I really like, now that we have many to choose from. And I have to say that I often enjoy tuning the decks as much as the playing itself, I like to look through the cards and think. I see that I really \"waste\" a lot of time with this game at the moment. It may be that \"tomorrow\" I won't be able to do so.\n\nSo how do I manage to play? I get down from to couch onto the floor, pick up the decks and play. I really don't need a sheet for that but I see I'm not a well-organized person.\n\nOverall I think we may have humoured this board a wee bit too long, don't you think? But I will gladly resume a conversation on another topic elsewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=645237","commentId":645237,"userName":"Dam the Man","timestamp":1339813012,"content":"True enough.\n\nSince a relevant (to my POV) thread was just posted in the Strategy and deck-building section, I do want to say that while I mostly play solo, even if I play 2-deck games, when we do play with my friend a proper 2-player game, I'm the one who owns the cards and has to build the decks. If I consolidated all my cards into just two decks, we could only play one game and then have to find another game. With four decks, we can play 2 games, which is about the normal time frame for our play sessions, maybe a filler after that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=646156","commentId":646156,"userName":"gatharion","timestamp":1340048949,"content":" Better four turns to kill a warg then just not being able to kill him at all. Of course that's assuming you don't have ANYTHING to bolster Dunhere's attack or the damage on the wargs. Even if he just tags them once and then they don't leap back to the staging area on the next round, they'll be at least a little easier to kill.\n\nIf you can keep your threat low, then Thalin + Dunhere + Fresh Tracks = killing most things before they ever engage with you.\n\n \n\nI don't especially love Dunhere, but I've seen him be useful far too often for me to just discount him. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/65859-down-with-dwalin/?do=findComment&comment=646890","commentId":646890,"userName":"armakis","timestamp":1340184023,"content":"same as Dáin, he is good in a dwarf game otherwise …"}]}