{"url":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/","title":"Curse of the 3-cost Allies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643385","commentId":643385,"userName":"lleimmoen","timestamp":1339480314,"content":"Whilst looking through my decks I noticed an interesting trend, I tend to include very few (often none) 3-cost allies.\n\nThere are only 2 of those who cost 6, Beorn and Brok. The latter seems very situational, the former less so but still hard to include in most of the decks. The cost of 6 is extreme though, so let us set it aside for now.\n\nSurprisingly there are still only 4 allies of cost 1. But they're all super useful, I would go as far as saying that a majority of long-term players who run several decks have utilized most of the 4 allies in them.\n\nThen you've got 2-cost. Spirit - having none of the 1-cost allies - shines in this dept. And it is not hard to make a deck that allows for playing one of these each round, building up a questing army. But other spheres have some great representatives here as well: Guardian, Spearman, Hammersmith, etc.\n\n4-cost allies tend to be superb also. Haldir, Faramir, Tracker, Eagles of the Misty Mountains, these four may be among many players' favourites (and there are only 10 in total).\n\n5-cost allies are even fewer, not surprisingly, so similar to the most expensive ones it is hard to look at them as a group. But there is Gandalf (and the new one coming) and Gildor, two game-shaping characters.\n\nAnd finally you've got 3-cost allies, 16 of them! But for me it is hard to utilize them in my decks, they often seem too costly for what they do, and if I want to invest into an ally, for 1 more resource I can usually find a much more effective one among the more expensive group. Not saying they're all bad cards. Rivendell Minstrel may be the best of them though I still hardly play it. Mirkwood Runner is nice. Son of Arnor can be, and I have played that one a lot, but most of the games I only saw him being discarded. Dúnedain Watcher can save the day but there are swifter ways of dealing with shadow cards.\n\nDo others feel the same or no?\n\nps: I wish Descendant of Thorondor had a cost of 3, we would then have an eagle for each cost from 1 to 5 (and Gwaihir coming as 6-cost perhaps)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643388","commentId":643388,"userName":"richsabre","timestamp":1339480760,"content":"yes! i never thought of it that way until now……..im trying to think of 3 cost allies featuring in my decks-\n\nrivendell minstrel- wel lets be honest, in this case she deserves 3\n\nbofur- again hes good for 3\n\nmirkwood runner - mmmm…yeah ….i love him so i think he deserves it\n\n \n\napart from that though thats all the 3 cost allies my flight to the ford deck had in when i checked it…..so i can see where youre coming from\n\ni actually think quite a few of them are 'multiplayer' cards…(or arent they?)..so like the leadership elf archer, so maybe thats why not many of them are in"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643415","commentId":643415,"userName":"lleimmoen","timestamp":1339485852,"content":"I totally forgot to mention Bofur. Yes, he's a great card.\n\nThe two archers, Rohan (Tactics) and Silvan (Leadership) are very underwhelming even for coop. And they're not getting much love from the synergies either although most of the Silvan synergies are yet to come but I doubt we'll see the same as for Dwarves, the Elven cards seem to be more specific in application."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643427","commentId":643427,"userName":"Budgernaut","timestamp":1339487608,"content":" What a timely topic! I was just realizing lately that Lore has a ton of 3-cost allies and I find it hard to play them because of resource limitations when building multi-sphere decks. So I tried tonight to put it to my advantage. I thought I'd pack my deck full of 3-cost cards so Zigil Miner could make a fortune, and then we'd be able to afford all of those 3-cost cards. Unfortunately, I didn't have enough 3-cost cards so Zigil Miner dug for two turns without striking mithril and then we got killed by a Cave Troll. Anyway, I think there's something there worth exploiting. The trouble is that a bunch of 1-cost cards are so darn important (Sneak Attack, A Test Of Will, Feint, Protector of Lorien). Oh well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643454","commentId":643454,"userName":"lleimmoen","timestamp":1339492401,"content":"Interesting. Do you think the blind Zigil approach is still worth it even with the Stargazer around?\n\nAnd I forgot to mention that Bofur is obviously great only because he can be played for 1, so that's him being quite different from other 3-cost allies, probably why I forgot about him in the first place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643574","commentId":643574,"userName":"jjeagle","timestamp":1339506268,"content":"The Erebor Battle Master is pretty good value for cost 3 - base attack 4 with three Dwarf heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643586","commentId":643586,"userName":"lleimmoen","timestamp":1339508965,"content":"You're right. I think Tactics is least fit for a Dwarven deck but Battle Master is very strong, and Dwarves are even stronger in coop where the Tactics Dwarven heroes become stronger."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643615","commentId":643615,"userName":"Shelfwear","timestamp":1339513195,"content":"I think sooner or later many of the 3-cost allies will be replaced by better 2-cost ones like Warden of Healing, Arwen, Zigil Miner, Stargazer etc\n\nAnd I would judge Leadership allies differently to the rest because most of them suffer the \"Leadership tax\" and cost 1 resource more than equivalent allies (statwise) from other spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643662","commentId":643662,"userName":"lleimmoen","timestamp":1339519843,"content":"The two of Leadership 2-cost allies seem especially terrible, Guard of the Citadel being probably the worst ally in the game right now and Keen-eyed Took being all but useless. But then Snowbourn Scout is really quite ok, more than that actually!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65866-curse-of-the-3-cost-allies/?do=findComment&comment=643885","commentId":643885,"userName":"Sprenger","timestamp":1339568514,"content":"I feel like this curse really only applies to Lore. I hated playing Lore because it required you to play with 3 lore characters or including bifur just be able to play 1 ally out each turn. Not only are the Lore allies high cost but they also have a lot of 3 cost event cards that are never worth using cause when it comes to allies or event most of the time I have to take the ally unless the rest of the group is rocking."}]}