{"url":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/","title":"Your Favourite Way of Dealing with Shadow","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644433","commentId":644433,"userName":"lleimmoen","timestamp":1339658848,"content":"Shadow effects have in my opinion got much scarier with Khazad and Dwarrodelf and thus the importance of dealing with them rises. I would like to run a quick poll sort of thread to see what's your favourite way of dealing with them.\n\nWhat we've got so far is:\n\nDúnedain Watcher, Leadership Ally Cost 3\n\nDawn Take You All, Leadership Event Cost 2\n\nRider of the Mark, Spirit Ally Cost 3\n\nHasty Stroke, Spirit Event Cost 1\n\nA Burning Brand, Lore Attachment Cost 2\n\nOne could also consider Feint or some sort of direct damage like Gandalf or Gondorian Spearman but that would broaden the topic too much I feel. So what's your take and reasons behind?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644435","commentId":644435,"userName":"Serazu","timestamp":1339659145,"content":"Since I play Spirit and Lore, my vote will have to go to HS. Cheap, effective and, being Spirit, recursive.\n\nABB is an almost no-brainer as well in Glorf / Aragorn Secrecy decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644438","commentId":644438,"userName":"richsabre","timestamp":1339659519,"content":"burning brand- i play lore a hell of alot, more than any other, and i love playing bilbo and plonking some dunedain warnings, fast hitches, erebor boots and brand on him- works everytime\n\ni usually pair with spirit so i run 2 copies of hasty stroke also"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644473","commentId":644473,"userName":"Dam the Man","timestamp":1339667355,"content":"Whichever I happen to have handy. Usually, especially in RtR, nothing llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644482","commentId":644482,"userName":"richsabre","timestamp":1339669187,"content":"number 1 way = denial……..is sleeping sentry i just drew? nah…it couldnt have been happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644583","commentId":644583,"userName":"jjeagle","timestamp":1339680340,"content":"My view:\n\nDawn Take You All is unplayably weak.\n\nRider of the Mark is also too weak (and can't be used solo).\n\nYou could also add Dark Knowledge to the list of \"weak ways of (not very effectively) dealing with shadow\".\n\nOf the other three, it depends on the deck and the spheres you have (easy) access to. ABB's ability to completely shut down all shadow, for the whole game, is the strongest - but it can take some work to get into play depending who your primary defender is. On Elrohir it is game-winning.\n\nDunedain Watcher is expensive but in some ways I prefer it to HS, as it is actually on the table doing other useful things rather than sitting waiting in your hand and forcing you to keep a resource free to pay for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644614","commentId":644614,"userName":"lleimmoen","timestamp":1339683792,"content":"Funny, it is very similar to my view. The Rider is not bad on its own but I dislike the ability. I love the art of Dawn Take You All but the card is very weak, maybe in a 4-player it has a place but still not great. And I love the Brand but it may be harder to get going unless you play Denethor or Bilbo (and Denethor is often busy peaking). But the effect is still a bit different from the other two which are outright the same: HS and DW. And I too seem to favour the latter lately, although it is so much harder to put on table and you can play HS on round one, I like the fact DW can actually do something when you don't need to cancel shadow (of which I am trying to avoid anyways)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644616","commentId":644616,"userName":"jjeagle","timestamp":1339684091,"content":"Yes, I think DW is better in those scenarios where there are a small number of shadow effects that will bust you utterly, perhaps later in the game (eg RTR). HS is better when you will want to cancel shadow more frequently and from the outset."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644626","commentId":644626,"userName":"Mr Coffee","timestamp":1339685083,"content":"Seems to be a healthy amount of consideration bewteen HS and DW.  I tend to include HS mostly, probably due to most of my decks having Spirit in them, and its low cost (and the possibility of recycling back into my deck with Will of the West).  My ally-heavy decks usually rely on all the resources I generate to get out the allies whose abilities I need to use, so it would be pretty hard for me to cough up 3 resources to plink out a \"throw-away\" ally (unless running an Eagle/Imrahil deck, I suppose, in which case he fits perfectly).."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644702","commentId":644702,"userName":"lleimmoen","timestamp":1339696260,"content":"jjeagle said:\n\nYes, I think DW is better in those scenarios where there are a small number of shadow effects that will bust you utterly, perhaps later in the game (eg RTR). HS is better when you will want to cancel shadow more frequently and from the outset.\n\n\n\nIt is usually the case when the shadow cancelation is most needed. In the times of the core set, you pretty much knew that if you defend the worst thing that can happen is that the enemy gets +1 (or you could lose an attachment or raise your threat instead). That was the time when I stopped playing shadow cancelation altogether as I thought I can fill my decks with more useful cards which will in total make the petty shadow effects quite redundant.\n\nAll changed suddenly when the \"you lose\" shadow effects appeared. Well, first there was Osgiliath, the shadows weren't of that category quite yet but it was most useful not to get totally unlucky - like the undefended Nazgul as opposed to him being blocked by Snowbourn Scout. The two effects removing or killing the defender seemed most brutal. And there I acutally reconsidered Dark Knowledge but ultimately refused it nonetheless. But I to an extend used and am sometimes using Henamarth Riversong quite successfuly.\n\nBut the Elf scout is of no avail against the madness that was brought with Khazad and Dwarrodelf, it was then where the terror of shadow have fully crept upon me and I started looking desperately for salvation. And I am still quite torn between the Brand, Watcher and Stroke and hence I began this thread. It is obvious the designers have once again struck gold (mostly) here as there are no easy answers. I just hope we shall one day see a similar dilemma with \"when revealed\" cancelation as opposed to the boring A Test of Will in every game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644720","commentId":644720,"userName":"DevastazioneH88","timestamp":1339700910,"content":" If I have to choose from the list I'd say Dunedain Watcher…but my way is to use feint on big enemies and quick strike on smaller ones ( if done with Hama it becomes an addiction)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644747","commentId":644747,"userName":"booored","timestamp":1339709502,"content":"lleimmoen said:\n\nA Burning Brand, Lore Attachment Cost 2\n\nHow is this even a question.. aBB is easily the best option for dealing with shadows. Ther eisn;'t a single card that even comes close. Yes the card is a little hard to get running if your blocker is not a Lore toon, but that is like saying fiet is not a great card as you need a tactic hero icon. I just do not even understand the point of this thread..\n\nThe ideal / best way to deal with shadows is A Burning Brand..\n\n/end of thread"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644790","commentId":644790,"userName":"jjeagle","timestamp":1339719624,"content":"booored said:\n\n \n\nlleimmoen said:\n\nA Burning Brand, Lore Attachment Cost 2\n\n \n\nHow is this even a question.. aBB is easily the best option for dealing with shadows. Ther eisn;'t a single card that even comes close. Yes the card is a little hard to get running if your blocker is not a Lore toon, but that is like saying fiet is not a great card as you need a tactic hero icon. I just do not even understand the point of this thread..\n\nThe ideal / best way to deal with shadows is A Burning Brand..\n\n/end of thread\n\n \n\n \n\nABB is strongest, certainly. But the difficulty of playing ABB (as compared to HS) can be more of a problem in-game than you suggest. If you need to cancel Shadow turn one or face defeat, ABB may not suffice. Example: Massing, where the Shadow effect of Wolves from Mordor or Captured Watchtower flipping on Wolves attacking a chump blocker first turn [probability roughly 1/7] likely means you lose a hero and probably the game. You won't have played ABB first turn if you are running it via a Song.\n\nThere is also the situation where you are being attacked by more than one enemy. If it is essential that you are able to cancel Shadow, again ABB is inferior to HS (unless ABB is on, say, Elrohir, or a Fast-Hitched Bilbo).\n\nMy point being that, overall ABB is the strongest counter-measure to Shadow, but there are nuances here. Depending on the problems that you are likely to encounter in a particular quest (and also your choice of heroes and spheres), other options may be superior."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644806","commentId":644806,"userName":"Dam the Man","timestamp":1339723616,"content":"jjeagle said:\n\nABB is strongest, certainly. But the difficulty of playing ABB (as compared to HS) can be more of a problem in-game than you suggest. If you need to cancel Shadow turn one or face defeat, ABB may not suffice. Example: Massing, where the Shadow effect of Wolves from Mordor or Captured Watchtower flipping on Wolves attacking a chump blocker first turn [probability roughly 1/7] likely means you lose a hero and probably the game. You won't have played ABB first turn if you are running it via a Song.\n\nHS also can save your bacon against an undefended Snaga getting Cut Off (+3 attack) after you've drawn Cut Off as Treachery the same turn demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] . And any other undefended stuff you have to let through."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644848","commentId":644848,"userName":"lleimmoen","timestamp":1339736380,"content":"booored said:\n\nlleimmoen said:\n\nA Burning Brand, Lore Attachment Cost 2\n\n \n\nHow is this even a question.. aBB is easily the best option for dealing with shadows. Ther eisn;'t a single card that even comes close. Yes the card is a little hard to get running if your blocker is not a Lore toon, but that is like saying fiet is not a great card as you need a tactic hero icon. I just do not even understand the point of this thread..\n\nThe ideal / best way to deal with shadows is A Burning Brand..\n\n/end of thread\n\n\n\nThe point of this thread is too see different takes on the matter. Which it clearly showed. As much as your arrogance can think it, your opinion is not the only one valid. And as you can see, if you care to read other opinions, they sometimes seem to differ from yours."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644851","commentId":644851,"userName":"jjeagle","timestamp":1339736984,"content":"lleimmoen said:\n\nIt is obvious the designers have once again struck gold (mostly) here as there are no easy answers. I just hope we shall one day see a similar dilemma with \"when revealed\" cancelation as opposed to the boring A Test of Will in every game.\n\nI agree that this is a good example of more effective design vs less effective design.\n\nAny deck needs to have some answer to shadow and to treachery.\n\nThere are a range of ways of dealing with shadow, some better than others, some better in different situations than others, and most decks can reasonably access at least one of them.\n\nThere is only really one effective way of dealing with treachery, and the designers set the initial bar too high by introducing a flat-out cancellation with no down sides [eg the cancelled card being replaced, as with Eleanor] in the first set. That has really given them little room to manoeuvre in developing further anti-treachery cards. The result: you are forced to run some Spirit, or (the only alternative, I think) to try your best to work around treacheries with the relevant Lore cards (Denethor, Henamarth, Rumour). This is a serious and (I find) annoying constraint on deck construction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644857","commentId":644857,"userName":"lleimmoen","timestamp":1339738243,"content":"I agree the Brand has a great potential. Mr jjeagle mentioned Elrohir, I find Boromir at least as convinient (for the \"readiness\") although of course the extra point of defence is very valuable. The problem becomes the need of the Song."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644860","commentId":644860,"userName":"jjeagle","timestamp":1339738827,"content":"lleimmoen said:\n\nI agree the Brand has a great potential. Mr jjeagle mentioned Elrohir, I find Boromir at least as convinient (for the \"readiness\") although of course the extra point of defence is very valuable. The problem becomes the need of the Song.\n\n\n\nGood point. I think this strategy becomes much more solid in two-player, when the other player can (hopefully) cover early Shadow with HS while you set up your immune-to-shadow unbowing super-defender (Elrohir, Boromir, or whoever). I've had good success 2P in this line with Elrohir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=644869","commentId":644869,"userName":"lleimmoen","timestamp":1339741602,"content":"It is also easier in coop to have such a defender. I am yet to think of a good solo deck with the Brothers. I remember people posting about them together with Strider. Maybe…\n\nAnd as much as I think Boromir is great, it is again complicated (not impossible) to have a great solo deck containing a Tactics hero. And if nothing else, you are bound to have Spirit in it but that is the same old song.\n\nBeside Denethor and Bilbo who I think are still be candidates for the Brand (without Song), Strider seems super fit for it but with his questing skills, supported by the Stone and Sword, it is hard to leave him home to defend the fort. Courage is of course handy but then we run to the same problem as with the Song, another card is needed, and of the different sphere even, unlike the Neutral Song.\n\nAs for the treacheries, I hear the scream for another \"when revealed\" cancelation from many corners. I think it is inevitable we get one. But just as you say, what shall it be? I am thinking something along the lines of the Dúnedain Watcher would be reasonable.\n\nAnd as for the Lore cards you mentioned, whilst I can see a good use for all of them, only Denethor can really do something about the treacheries, unless you find a way to get rid of the top card in a different way, like in the Long Dark you may. The Rumour and Henamarth can combo quite well with the Brand I think, so you know whether you can take the next shadow card easy or not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=645053","commentId":645053,"userName":"hildargo","timestamp":1339765111,"content":"jjeagle said:\n\nlleimmoen said:\n\n \n\nThere is only really one effective way of dealing with treachery, and the designers set the initial bar too high by introducing a flat-out cancellation with no down sides [eg the cancelled card being replaced, as with Eleanor] in the first set. That has really given them little room to manoeuvre in developing further anti-treachery cards. The result: you are forced to run some Spirit, or (the only alternative, I think) to try your best to work around treacheries with the relevant Lore cards (Denethor, Henamarth, Rumour). This is a serious and (I find) annoying constraint on deck construction.\n\n\n\nIn my opinion, this is a huge issue. To have success in the solo game, you either a) have to be extremely lucky and not draw any nasty treachery or shadow cards, or b) like stated above, run either Lore or Spirit. I think a good direction for this game to go in would be to provide some way to deal with these cards in all spheres. Obviously some cards would be better than others, but as a solo player, I don't like having to run 4 spheres for those \"get out of jail free\" cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=645054","commentId":645054,"userName":"hildargo","timestamp":1339765134,"content":"jjeagle said:\n\nlleimmoen said:\n\nIt is obvious the designers have once again struck gold (mostly) here as there are no easy answers. I just hope we shall one day see a similar dilemma with \"when revealed\" cancelation as opposed to the boring A Test of Will in every game.\n\n \n\nI agree that this is a good example of more effective design vs less effective design.\n\nAny deck needs to have some answer to shadow and to treachery.\n\nThere are a range of ways of dealing with shadow, some better than others, some better in different situations than others, and most decks can reasonably access at least one of them.\n\nThere is only really one effective way of dealing with treachery, and the designers set the initial bar too high by introducing a flat-out cancellation with no down sides [eg the cancelled card being replaced, as with Eleanor] in the first set. That has really given them little room to manoeuvre in developing further anti-treachery cards. The result: you are forced to run some Spirit, or (the only alternative, I think) to try your best to work around treacheries with the relevant Lore cards (Denethor, Henamarth, Rumour). This is a serious and (I find) annoying constraint on deck construction.\n\n\n\njjeagle said:\n\nlleimmoen said:\n\n \n\nThere is only really one effective way of dealing with treachery, and the designers set the initial bar too high by introducing a flat-out cancellation with no down sides [eg the cancelled card being replaced, as with Eleanor] in the first set. That has really given them little room to manoeuvre in developing further anti-treachery cards. The result: you are forced to run some Spirit, or (the only alternative, I think) to try your best to work around treacheries with the relevant Lore cards (Denethor, Henamarth, Rumour). This is a serious and (I find) annoying constraint on deck construction.\n\n\n\nIn my opinion, this is a huge issue. To have success in the solo game, you either a) have to be extremely lucky and not draw any nasty treachery or shadow cards, or b) like stated above, run either Lore or Spirit. I think a good direction for this game to go in would be to provide some way to deal with these cards in all spheres. Obviously some cards would be better than others, but as a solo player, I don't like having to run 4 spheres for those \"get out of jail free\" cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=645055","commentId":645055,"userName":"hildargo","timestamp":1339765186,"content":"How the heck did that happen?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/65979-your-favourite-way-of-dealing-with-shadow/?do=findComment&comment=645070","commentId":645070,"userName":"richsabre","timestamp":1339768036,"content":"hildargo said:\n\nHow the heck did that happen?\n\n\n\nbloody aweful forum software is how gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"}]}