{"url":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/","title":"The Future of LOTR LCG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644937","commentId":644937,"userName":"Butterburr","timestamp":1339750340,"content":" \n\nHi guys! I'm brand new to the boards, so please forgive me for the heavy topic ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nA little background…. I've been watching this game for about a year now, and finally decided to jump in and pick up the core set. In short, I absolutely love the single player game and I'm quite excited to share the game with a few friends of mine. I'm thrilled that its a cooperative game, the card art and production values are incredible, and the system seems rock solid.\n\nHowever, I decided to tune in to the Cardboard of the Rings podcast, and they brought up a really great point that I wanted to put out there for the more experienced FFG fans;the actual future and potential for FFG to continue supporting the game.\n\nI'm almost certainly going to purchase all of the quest packs, the deluxe Khazad-Dum pack, and the Legacy pack when it comes out. I certainly see the value there…however, part of the appeal of the game, in my eyes, is the Living format of it.\n\nThe continual expansion of new adventure packs is really what has me excited for the future, and the idea of having a tremendous library of adventures to play through with a variety of different deck combinations is enthralling. However, due to the cooperative nature of the game, the podcast remarked that its improbable that FFG will support any sort of community events (tournaments, etc.) …and in my eyes, I can't really see how those would work anyhow.\n\nWithout that foundation of community support, what is the likelihood that FFG will continue to support the game (through new adventure packs, deluxe packs, etc.) onward into the foreseeable future?\n\nI know Cthulhu is still being updated (havent played it, but its certainly less mainstream than LOTR), so is it likely that their plan might be to keep the LCG's running indefinitely? Or do you think there might be a finite life cycle for these games?\n\nEither way, I'm excited about playing through this game over (hopefully) the coming years, so I'll look forward to chatting with you folks.\n\nCheers\n\n-BB\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644942","commentId":644942,"userName":"richsabre","timestamp":1339751040,"content":"interesting- well ive been playing since release, and ive certainly seen this game grow, actually quite alot since christmas when i think about it\n\ni cant comment on any other games history,  but if you think how 'big' the lotr is, then i can see this continuing for several years to come- i certainly will be here until it stops, and well after\n\nLONG LIVE LOTR LCG!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644943","commentId":644943,"userName":"jjeagle","timestamp":1339751324,"content":"richsabre said:\n\ninteresting- well ive been playing since release, and ive certainly seen this game grow, actually quite alot since christmas when i think about it\n\ni cant comment on any other games history,  but if you think how 'big' the lotr is, then i can see this continuing for several years to come- i certainly will be here until it stops, and well after\n\nLONG LIVE LOTR LCG!\n\n\n\nSeconded. You'd have to assume that the Hobbit films will give the game a boost too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644948","commentId":644948,"userName":"richsabre","timestamp":1339752069,"content":"yes and then (hold you breath…..) perhaps the silmarillion will get film rights????? will our mr christopher tolkien allow it? alot of people say no- however when the hobbits done, and he sees the potential for the amount of money to be made……."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644951","commentId":644951,"userName":"lleimmoen","timestamp":1339752475,"content":"Same here, all the positive about this game has far surpassed my all previous gaming experience. But I come for Tolkien in the first place but even then I must have played like 10 different Tolkien games and dropped most of them very quickly, this one I have experienced since (and before) the day 1 and it has probably only grown on me. The excitement builds especially as the packs begin to arrive in frequent intervals - as opposed to the break of several months between the core and Hunt. I just hope we'll see Foundations next week, Shadow and Flame at the end of June / early July and the Hobbit saga in July still, just as they said we would."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644952","commentId":644952,"userName":"DevastazioneH88","timestamp":1339752571,"content":"  I think this is a great game, possibly one of the best card/board game I've ever played (no, the absolute best) and the lord of the rings theme attracts an absurd amount of fans all over the world ( my girlfriend and I started playing it because of it). Therefore I guess FFG is selling A LOT with this LCG and I see no reason for them to stop. Think on how very \"unknown\" A Game of Thrones is when compared to The Lord of the Rings…yet AGOT LCG has 6 deluxe expansions and 8 cycles of chapter packs…Moreover, though true that it's difficult to see a regular tournament of this game, I think that's what will call even more attention to it (I play AGOT with my girlfriend and a few friends, but since I live in Italy it's impossible to participate in tournaments and the likes because agot is starting to be known only now thanks to the tv show and the card game is utterly unexistent). My point is that LOTR LCG is an absolutely fun game that everyone (fan or not) can play at home, with friends etc…without even starting to worry how to make it competitive…but just for the fun ! I don't even use the actual scoring system because I find the new 10 points per round rule is stupid….I use the original scoring system…..ah I was forgetting to mention the artwork….absolute best in a \"printed\" game…I think I'd still buy it just for the art…even if it was poor….and it's not !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644955","commentId":644955,"userName":"Style75","timestamp":1339752631,"content":"The answer to \"How long will FFG continue to support LotR LCG?\" is very simple….   as long as they keep making money.  I know that's a cheap answer, but I think it's important becuase so far FFG has made a TON of money off of this game without any public play program at all. Think about it… The game's been out for over a year without any public play support and the adventure packs are still selling out and the core set has been reprinted at least once. That shows there's a huge fan base who don't really care about public play.\n\nFurthermore, I think the coop vs. scenario feature of the game is a strength that will give it longevity far beyond a traditional head to head competitive game. The Tolkien universe is DEEP in stories that can be mined indefinitely for new scenarios. Furthermore, Tolkien's lore is probably the deepest that's ever been done except for maybe D&D's Forgotten Realms. This means there's plenty of material for player cards, monsters, and locations that will keep the Tolkien fans coming back for me. In a typical head to head card game, a lot of players burn out and quit buying once they hit a large number of cards for their decks, but the coop vs. scenario format means that there will always be a steady stream of encounter cards to fight against.\n\nThe other thing is that the game can be played solo. How many CCG's have a solo play variant that is truly compariable to the multi-player version? Not many.\n\nI really think they've hit on a winning combination with this game. Tolkien + coop play + scenario + LCG format = cash cow for FFG.\n\nThe only way they could screw this up is if the fan base turns on them for some reason. Either they mess with the lore too much (alienating the Tolkien fans) or they seriously change game mechanics or balance. I think they're smart enought to do neither which makes me think we'll be playing this game for many years to come."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644958","commentId":644958,"userName":"DevastazioneH88","timestamp":1339752853,"content":" totally agree with style 75 !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644959","commentId":644959,"userName":"Style75","timestamp":1339752914,"content":"Sorry to double post, but another piece of evidence is the fact that they chose to go with coop play instead of head to head play for the new Star Wars LCG. If they thought they could only make money through competitive public play tournaments, they would have made star wars head to head. I think it's obvious they think that coop play is a money maker. That's a good sign for the longevity of the LotR LCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644967","commentId":644967,"userName":"lleimmoen","timestamp":1339753684,"content":"Sorry to sidetrack but I just have to respond to what mr devastazione said, I too dislike the new scoring system. I think it kinda makes sense for competitive play - it would be easy to abuse the original one but unless I want to report my game I never keep track of rounds. I hate to rush things to get a better score, I like it far more when I can bring in more allies, get rid of enemies, heal characters, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644969","commentId":644969,"userName":"DevastazioneH88","timestamp":1339754061,"content":" You're right…but even in a competitive game it's nonsense. In this game most of the times if you rush you lose (unless you play rohan with lots of cancel) I think the whole idea is misguided. If you are in a forest and you see a giant spider do you wait for the best moment to kill it (maybe after having found a sharp chop of wood or an elf passing by willingful to help you) or do you just run at it naked ?…I think the Threat Counter is a great system to remind player they have to hurry (because obviously you can't take all the time in the world or you just die)…but really no need to add another reminder…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644973","commentId":644973,"userName":"jjeagle","timestamp":1339754971,"content":"Style75 said:\n\nEither they mess with the lore too much (alienating the Tolkien fans) or they seriously change game mechanics or balance. I think they're smart enought to do neither which makes me think we'll be playing this game for many years to come.\n\nThis risks side-tracking into a different debate which has already been thrashed out pretty thoroughly (see the thread on The Long Dark), but I do think the designers have some work to do in terms of balancing the game effectively for both newer players and the more experienced players with access to the full card pool. This problem will get more acute as the card pool continues to expand and as (hopefully) waves of new players join the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644975","commentId":644975,"userName":"Style75","timestamp":1339755134,"content":"I expect that if they ever come up with a public tournament system (highly unlikely due to the need of highly trained judges) they will use pre-made encounter decks like \"Massing at Osgiliath\" that are purpose built with the new scoring system in mind. The goal will be to burn through the scenario as fast as possible. The Print-on-demand system makes this sort of tournament encounter deck a snap to publish. They can also then sell them afterwards through their PoD store just like they did with Osgiliath.\n\nThe other advantage of standalone encounter decks for public play is that they don't have to mess with the main game as it's currently being published to try to shoehorn it into a public play format. I don't think they want to mess with a good thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644976","commentId":644976,"userName":"Style75","timestamp":1339755285,"content":"jjeagle said:\n\nStyle75 said:\n\nEither they mess with the lore too much (alienating the Tolkien fans) or they seriously change game mechanics or balance. I think they're smart enought to do neither which makes me think we'll be playing this game for many years to come.\n\n \n\nThis risks side-tracking into a different debate which has already been thrashed out pretty thoroughly (see the thread on The Long Dark), but I do think the designers have some work to do in terms of balancing the game effectively for both newer players and the more experienced players with access to the full card pool. This problem will get more acute as the card pool continues to expand and as (hopefully) waves of new players join the game.\n\n\n\nI think the solution to this problem is to ensure that there are easy chapter packs released as well as hard ones. If one out of six chapter packs are aimed at newer players, they could accomplish this goal easily and still keep the skilled players in the game. OR they could put out the easier packs as PoD standalone encounter sets. Easy to do with the way the game is designed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=644988","commentId":644988,"userName":"jjeagle","timestamp":1339756461,"content":"Style75 said:\n\njjeagle said:\n\n \n\nStyle75 said:\n\nEither they mess with the lore too much (alienating the Tolkien fans) or they seriously change game mechanics or balance. I think they're smart enought to do neither which makes me think we'll be playing this game for many years to come.\n\n \n\nThis risks side-tracking into a different debate which has already been thrashed out pretty thoroughly (see the thread on The Long Dark), but I do think the designers have some work to do in terms of balancing the game effectively for both newer players and the more experienced players with access to the full card pool. This problem will get more acute as the card pool continues to expand and as (hopefully) waves of new players join the game.\n\n \n\n \n\nI think the solution to this problem is to ensure that there are easy chapter packs released as well as hard ones. If one out of six chapter packs are aimed at newer players, they could accomplish this goal easily and still keep the skilled players in the game. OR they could put out the easier packs as PoD standalone encounter sets. Easy to do with the way the game is designed.\n\n\n\nGood ideas. Another solution would be to incorporate (two) difficulty levels into each chapter pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=645012","commentId":645012,"userName":"Style75","timestamp":1339758603,"content":"The nice thing about co-op play is that you can turn an easy scenario into a hard one by simply agreeing to play sub-optimal decks. Because you are not competing against each other it doesn't create any animosity. Try playing Emyn Muil without Eowyn or Northern Trackers (or spirit sphere for that matter).\n\nLevels of difficulty within the same scenario should be easy to achieve. Just say on the deck insert \"For a harder game experience, increase monster attacks and/or defenses by 2\"  Easy to do when it's co-op vs. scenario. Because of the modular scenario design, there's a huge amount of design space for FFG to customize this game in many different directions which I think will increase its longevity greatly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66026-the-future-of-lotr-lcg/?do=findComment&comment=645018","commentId":645018,"userName":"lleimmoen","timestamp":1339759298,"content":"I personally do not mind if they release one or two easy to very easy quest in each cycle, as long as they keep the player cards interesting within, and I say interesting I don't mean super powerful. It would be nice if we can get one pack that is very hard and yet not very specific, so like Osgiliath and unlike Rhosgobel. I mean a quest that is not only terribly challenging but it challenges the player on different levels."}]}