{"url":"https://community.fantasyflightgames.com/topic/66041-first-expansions/","title":"First expansions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645102","commentId":645102,"userName":"MyNeighbourTrololo","timestamp":1339772955,"content":"I recently got the core game and since this we enjoyed it very much.\nWhat expansions would you recommend for me to get in the first place?\nWe're looking forward for new exciting scenarios and more options for our decks.\n\nI'm looking at the Khazad-dum expansions and Watcher in the Water and Shadow and Flame adventure packs(I like the theme).\n\nThank you. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645117","commentId":645117,"userName":"Brownmantle","timestamp":1339774823,"content":"It really depends on tase and finances. I own all the expansions and two of the core set, as well as the Print on Demand encounter deck Massing at Osgiliath. Having tried them all, I would recomend purchasing  Khazad-dum and coundations of stone first, then adding the expansions in that cycle, playing them in order. I've found that playing the expansions as an unfolding story adds a great deal of enjoyment to the game, but then, I'm a Middle Earth fanatic. You may not be. If that's the case then you had best ignore my advice altogether.\n\n \n\nI also recomend being friends with benhanses and rich sabre. They could give you a more compehensive answer.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645118","commentId":645118,"userName":"richsabre","timestamp":1339774970,"content":"EDIT - hey i got recommended - im flattered happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nhi\n\ni would not reccommend getting khazad dum or later unless you have some experience and also some mirkwood cycle packs\n\nthe mirkwood packs go in order\n\nhunt for gollum (nice balance)\n\nconflict at the carrock (fighting)\n\njourney to rhosgobel (healing, lots of bad treacheries)\n\nemyn muil (TRAVELLINGGG!!!lots and lots of travelling)\n\nthe dead marshes (questing)\n\nreturn to mirkwood (very hard……very fast quest)\n\nyou can pretty much get these in any order however if you want theme go for the order above as that is how the storyline progresses- now dont think if you skip a pack you will get confused- the storyline isnt that 'core' to the quests\n\nit also depends on what type of quests you want….see in the brackets for the main theme on each\n\nalso take a look on cardgamedb for the player cards you get in each as this may influence your decision\n\nalso hero choices….take alot on the site above for which one you get- some are great….in fact most are great, but some arent that great for solo play\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645137","commentId":645137,"userName":"Mr Coffee","timestamp":1339778610,"content":"Brownmantle said:\n\nIt really depends on tase and finances. I own all the expansions and two of the core set, as well as the Print on Demand encounter deck Massing at Osgiliath. Having tried them all, I would recomend purchasing  Khazad-dum and coundations of stone first, then adding the expansions in that cycle, playing them in order. I've found that playing the expansions as an unfolding story adds a great deal of enjoyment to the game, but then, I'm a Middle Earth fanatic. You may not be. If that's the case then you had best ignore my advice altogether.\n\n \n\nI also recomend being friends with benhanses and rich sabre. They could give you a more compehensive answer.\n\n \n\n \n\n\n\n \n\nBrownmantle spins lies and falsehood…. I have no good answers to offer. Wait, he didn't say \"good\", he said \"comprehensive\". I think that means I talk a lot… THAT I can do!\n\nActually, Rich touched on a lot of what I was thinking. It really comes down to what you are looking for in your game-playing. I happen to know that Brownmantle gets really excited about the encounter decks and challenges that they each offer, so if you are like him, then I would suggest looking at Rich's list and seeing what interests you from those challenges.\n\nMyself, I would suggest that you take a look at what kind/sphere of deck you are interested in building around/playing, and pick up some of the AP's that will feed that sphere or deck. This game hasn't built up the card base that some older games have established, so it shouldn't be hard to piece something together if you are not looking to purchase everything outright (which is what I did once I decided to take the plunge).\n\nIf you decide to use your deck as the basis for which AP's you would buy first, one method could be to use one of the many card-databases out there to find out what cards you want for your deck, then purchase the AP's that will get you the card you are looking for.\n\nwww.kaybee.org/kirk/LoTR_LCG_Cards_and_FAQs.pdf\n\nThe above is a downloadable PDF I like to use regularly (great for searching keywords, titles, wrods, phrases etc) that has proved helpful to me for putting together decks.  It's current through \"Watcher in the Water\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645143","commentId":645143,"userName":"jjeagle","timestamp":1339780046,"content":"Just to state a vital point that you may not be aware of: without the Khazad-dum expansion, you cannot play any of the quests in the current cycle (The Redhorn Gate, Road to Rivendell, The Watcher in the Water, The Long Dark, and the two that are forthcoming)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645178","commentId":645178,"userName":"richsabre","timestamp":1339786772,"content":"ah yes i forgot to mention that- i suppose it wouldnt be too extreme for you to buy khazad dum and all the current dwarrfowdelf cycle packs so far- this should give you some great cards- the only problem with this is that you are missing 4 very key cards that are in the mirkwood packs - those being the 'song' cards….song of wisdom,kings,battle and travel- you will need these to help with multi sphere deck building"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645194","commentId":645194,"userName":"Bullroarer Took","timestamp":1339793092,"content":" I recently went back through all of the Mirkwood cycle with my new Loragorn & the Ninja twins deck.  I have access to all of the cards so far and am not afraid to use proxies.  Rhosgobel was the most challenging at the end of the day except for Return to Mirkwood, which was basically a crap shoot playing solo.  I don't have a problem with that at all as I think they have done an excellent job overall of balancing solo vs multi etc.  The only place where I think they have failed is sphere balance: Spirit had the Silver Spoon from the get go and still does.\n\nI think it's an excellent game for the solo player, but it's hard to advise since there are many different playing styles that the game can support.  (I'm not so silently protesting Spirit dominance.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645241","commentId":645241,"userName":"jjeagle","timestamp":1339814127,"content":"richsabre said:\n\nah yes i forgot to mention that- i suppose it wouldnt be too extreme for you to buy khazad dum and all the current dwarrfowdelf cycle packs so far- this should give you some great cards- the only problem with this is that you are missing 4 very key cards that are in the mirkwood packs - those being the 'song' cards….song of wisdom,kings,battle and travel- you will need these to help with multi sphere deck building\n\n\n\nGood point. Also, if you followed this approach, you would find that you had a lot of Dwarf cards and Dwarf support cards, but you would be lacking the key hero to make dwarves work effectively. This is Dain, and he is printed in the last Mirkwood pack (Return to Mirkwood)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645250","commentId":645250,"userName":"Style75","timestamp":1339821289,"content":"It's not just the player cards you should thinking about but also the heroes. These are the heart and soul of every deck and you should think carefully about which ones you'd like to have. Use the website that was recommended and check out which heroes come with each AP. I find that I like to build decks around certain groups of heroes.\n\nThe songs are nice, but not essential depending on your build strategy. I'd recommend taking a look at the deck lists that have been posted in the strategy sub-section to get a feel for what you're looking for and then buy accordingly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66041-first-expansions/?do=findComment&comment=645552","commentId":645552,"userName":"MyNeighbourTrololo","timestamp":1339905242,"content":"Thanks for the useful intel.\n\nI browsed card game db and found many useful cards in the mirkwood expansion series…\n\nBut the thing is, I want this Watcher in the Water expansions badly, because I checked it's encounter cards too and really liked them.\n\nAlso, Watcher in the Water brings new Lore Aragorn with threat reset feature which I also like(I'm a Spirit player).\n\nWhich means I'll need to buy Khazad-dum with the Watcher, and then I can start gathering Mirkwood series for their cards. "}]}