{"url":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/","title":"Spirit&#039;s Silver Spoon","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645299","commentId":645299,"userName":"Budgernaut","timestamp":1339836032,"content":" Okay, I've heard a lot lately about Spirit having the \"silver spoon\" from the very beginning. I want out with this. What exactly do you all have in mind when you say this?\n\nAs for me, from day 1, Spirit has been my favorite sphere. When I played multiplayer those first dozen plays, I liked being Spirit because I liked the feeling of being in charge of exploring locations and trying to make sure the other players didn't have to increase their threat. My brother took on the role of Tactics, trying to keep all our heroes and allies alive. But I never felt like Spirit had any sort of preferential treatment from the core. (My second favorite sphere was leadership because I liked being able to buff up the other players - it makes you feel wanted gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif].)\n\nThose of you saying Spirit is pretty well-off at the moment, are you referring to its ability to deal with various threats in solo, multiplayer, or just because of the types of cards they have access to?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645303","commentId":645303,"userName":"lleimmoen","timestamp":1339837137,"content":"I've never used the expression but what I think people mostly mean is that the Spirit sphere is special. It's the only sphere that can directly counter \"when revealed\" effects. And many quests are hard to win without cancelling at least one of those, and it's certainly easier the more you achieve to negate.\n\nThen you've got the questing. Of the three attributes (willpower, attack, defence), willpower is likely the most important. Just look at the Dúnedain signals, adding 1 point of attack or defence costs 1, willpower costs 2 (i know this is not the most sophisticated argument but still). And if you look at the willpower of heroes and allies, Spirit will easily top the four spheres.\n\nThen you have threat reduction. Spirit is again the primary force. More so, Spirit also has the lowest threat cost of their heroes - by some margin now that Glorfindel's around the corner. When you sum that all up you get something odd, why does the sphere with lowest threat cost get the best threat reduction (the other threat reducing cards are Needful to Know - very feeble in that respect - and Strider)? I guess the answer goes with the theme, being Spirit means you're cheap (on threat).\n\nAn interesting example is the previewed Gandalf from the Hobbit saga, you would think that it being Neutral, Tatics can get a great advantage out of Gandalf's great questing. But alas! it comes with the price of raising threat, not only Tactics can afford that least of all, it also has no means to counter that.\n\nSo yes, Spirit is in my opinion far ahead of others. While I don't think it's good yet to play a mono-sphere Spirit deck, it's the only mono-sphere deck which has a decent to good chance against many quests. I would go as far as saying it's quite hard to beat majority of the quests (solo or coop) without Spirit, while it's perfectly doable without Tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645327","commentId":645327,"userName":"Titan","timestamp":1339843167,"content":"I don't use the \"silver spoon\" term either. However, it brings to mind an interesting question: When creating the game, did the designers realize that certain attributes from a given sphere would make it far more powerful than the others? In other words, if Spirit is good at questing and managing threat and Tactics good at killing enemies, was it evident to them, at that time, that Spirit would be far more useful? I tend to imagine not, since I believe that their aim is to make all the spheres as equally playable as possible. \n\nThat also brings the question of what to do to even out the score. I'm going to use Tactics as the most obvious example. In my opinion, Tactics has been pigeonholed as fighting and little else. That needs to change. I'm not saying change it's emphasis away from combat, far from it, but widen it's horizons a little bit. All the other spheres have some all around goodness that helps them to be more playable. Tactics on the other hand is very, very one dimensional. Change that a bit. Don't be afraid to have a 3 willpower Tactics character, even a hero, it won't destroy the sphere. Don't be afraid to have a some cards here and there that can do something other than kill stuff. Other spheres have cards that break their norm. Spirit does have some good fighters, just look at the new Glorfindel. No reason why Tactics can't have some good questers.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645335","commentId":645335,"userName":"Bullroarer Took","timestamp":1339845492,"content":" I have used the term Silver Spoon and I feel strongly about it.  Here's what I wrote at BGG:\n\n \n\nSpirit has been the “King” since the game’s inception. Consider that there are three basic types of cards that come out of the encounter deck in turn:\n\nTreachery Cards – Spirit is the only sphere that can directly deal with treachery cards either through Eleanor or through A Test of Will.\n\nLocation Cards – Location cards bring two obstacles to the player, the Threat that must be dealt with while the card is in the staging area, and the progress tokens that must be placed on the card in order to overcome the card when it is the active location. Once again, Spirit is the best sphere to deal with both of these problems. In solo play Eowyn quests so well that she can deal with most threat problems by herself and once there are a few Northern Trackers on the board location cards can disappear without even having to travel to them. Double win for Spirit here.\n\nEnemy Cards – Like location cards, enemy cards bring two obstacles. Spirit handles the Threat portion best, but then the enemy actually needs to be faced. Or does it? Dunhere can handle many low defense enemies while they are still in the staging area without the enemy even being able to fight back. Stronger enemies will probably have to be engaged however and here we find Spirit’s only weakness.\n\nSo in conclusion, Spirit handles three of the four major obstacles a player faces – Treachery, Threat and Travel – better than any other sphere, while it is merely adequate in the fourth, Combat. This imbalance is the game’s biggest downfall in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645337","commentId":645337,"userName":"lleimmoen","timestamp":1339845653,"content":"I agree, on many levels.\n\nFirst, I think they did want it equal. It's not equal now but that is not to say it won't be in a while (as much as it is hard to imagine).\n\nThen, they shouldn't equal it out in terms of giving every sphere similar tools, surely not. If we stick to the Tactics example (comparison), as I began and you followed, there are certain cards that have that potential, I believe. Perhaps most of all it is Hail of Stones, beside the somehow awful art, this is a perfect design I'd say. The theme fits the Tactics sphere perfectly and what it does is to lower the threat in the staging area - possibly before the quest resolution.\n\nIn a similar way, there could be a character who can storm the staging area… wait there's one but he's Spirit. sorpresa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sorpresa.gif] No I like it.\n\nThen you've got Legolas, he can make progress, more cards like him please. Also, one can see from the Hobbit preview a Tactics Event that in result (probably after killing and subsequently exhausting a Weapon - which is quite a requirement though) draw cards. Again, I think this is a nice design. In a similar fashion, Tactics could gain a hero who would lower threat… but then Spirit got that one. partido_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/partido_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645346","commentId":645346,"userName":"bollywongaloid","timestamp":1339848373,"content":" I remember when I first got the game I started with the core Tactics deck and started thinking 'this game is impossible!' because I never quested successfully.  Now I rarely use Tactics solo but find it incredibly handy in 2P games with all the eagles in play.  I know there's already a thread on this but a Tactics Eowyn would be nice I guess.  Same stats but with a different action or response maybe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645351","commentId":645351,"userName":"Titan","timestamp":1339849464,"content":"Good point about Dwalin, his ability is tailor-made for Tactics. Yet, it was given to Spirit. I really do think that some better questing characters should be the answer. Again, a comparison, every other sphere has multiple 2 willpower allies. Tactics only one. And it is only used in an eagles deck, anyway. If it doesn't take away from what other spheres do, why not allow Tactics to have some of them, as well? And to have a hero that is primarily a quester? Spirit has Dunhere and Dwalin, who are fighters, primarily. And that takes nothing away from it's flavor. Tactics could have a hero who is primarily a quester and not have anything taken away. Would make sense anyway. Every fighting force worth anything always sends out scouts before engaging in a fight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645361","commentId":645361,"userName":"lleimmoen","timestamp":1339851705,"content":"Whilst I agree again I have to play a devil's (read \"designer's\") advocate. Tactics have 2 heroes with 2 willpower (Elladan, Gimli) and they have a hero who is a quester primarily, Thalin, though with willpower of 1.\n\nTo broaden the comparison to other spheres, Spirit is really the only sphere with low threat cost heroes: 5, 7, 7, 8, 9, 9. Lore comes closest with 7, 8, 9, 10, 12, 12 but it's hardly a competition. Tactics is further behind with 9, 9, 9, 10, 10, 11, 11. Leadership goes all the way with 8, 9, 10, 11, 11, 12.\n\nI know the majority of readers here knows this all but well, still I had some fun writing it up from the top of the head. Hope I haven't forgotten someone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645401","commentId":645401,"userName":"Dam the Man","timestamp":1339860934,"content":"lleimmoen said:\n\nWhilst I agree again I have to play a devil's (read \"designer's\") advocate. Tactics have 2 heroes with 2 willpower (Elladan, Gimli) and they have a hero who is a quester primarily, Thalin, though with willpower of 1.\n\nHehe, is Brand so hideous looking you overlooked him lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645408","commentId":645408,"userName":"lleimmoen","timestamp":1339862146,"content":"And I thought I knew the game well. Oh well, never too old to learn. So they've got three but it's true that none of them are meant to quest really, at least all three have abilities that deals with attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645462","commentId":645462,"userName":"booored","timestamp":1339879047,"content":"Bullroarer Took said:\n\nLocation Cards – Location cards bring two obstacles to the player, the Threat that must be dealt with while the card is in the staging area, and the progress tokens that must be placed on the card in order to overcome the card when it is the active location. Once again, Spirit is the best sphere to deal with both of these problems. In solo play Eowyn quests so well that she can deal with most threat problems by herself and once there are a few Northern Trackers on the board location cards can disappear without even having to travel to them. Double win for Spirit here.\n\nThis isn't true. Lore is the sphere that has the cad types witch deal with instant removal of locations. Eowyn is the most over rated hero ever, the sooner you stop using her the sooner you will be playing with more powerful decks. Tracker is powerful…but Lore is the sphere that has the location control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645495","commentId":645495,"userName":"DurinIII","timestamp":1339885388,"content":"lleimmoen and Titan, I agree with you guys quite whole-heartily.  I would also love to see the designers broaden the horizon of Tactics cards; balance the spheres out a bit more.  I, like many others here, think that Spirit is in a once sense the \"best\" sphere.  It's ability to lower threat, draw cards (Ancient Mathom for only 1 resource), quest extraordinarily and provide cheap cards with powerful abilities; Elrond's Council, Arwen, A Test of Will, and Frodo to name just a few).  This is not to say that the other spheres do not have there very powerful cards. It just seems that Spirit is more handy in most situations over the other spheres.  I typically mix what I consider the most powerful Spirit cards into my decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645527","commentId":645527,"userName":"booored","timestamp":1339894492,"content":"DurinIII said:\n\n balance the spheres out a bit more.\n\n\n\nno… the entire point of this game si to encourage operation… if the spheres were balanced then the entire co-op side of this game would fall apart."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645542","commentId":645542,"userName":"bollywongaloid","timestamp":1339901581,"content":"booored said:\n\n \n\nThis isn't true. Lore is the sphere that has the cad types witch deal with instant removal of locations. Eowyn is the most over rated hero ever, the sooner you stop using her the sooner you will be playing with more powerful decks. Tracker is powerful…but Lore is the sphere that has the location control.\n\n\n\nThis is so true I used to use éowyn all the time. Good comment"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645572","commentId":645572,"userName":"DurinIII","timestamp":1339917753,"content":"It would appear that that balance comment was more directed at solo play, and clearly yours at multi. Let's face it, if someone plays predominantly solo, then if they want to win more frequently against the most Quests, then they need to play Spirit in there deck.  You are right though booored, in multiplayer the spheres work just fine. Spirit still wins the day though in my opinion. I like Lord the most however."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645579","commentId":645579,"userName":"lleimmoen","timestamp":1339919877,"content":"And what I think we mean by balance is to make them equally strong, not equal in substance, I find it quite clear from the thread. And then if each sphere does a different thing, cooperation will naturally follow. Actually much more so than if one sphere can be self-efficient (I'm not saying that's the case right now) and others only secondary."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645606","commentId":645606,"userName":"Bullroarer Took","timestamp":1339928637,"content":"booored said:\n\nBullroarer Took said:\n\nLocation Cards – Location cards bring two obstacles to the player, the Threat that must be dealt with while the card is in the staging area, and the progress tokens that must be placed on the card in order to overcome the card when it is the active location. Once again, Spirit is the best sphere to deal with both of these problems. In solo play Eowyn quests so well that she can deal with most threat problems by herself and once there are a few Northern Trackers on the board location cards can disappear without even having to travel to them. Double win for Spirit here.\n\n \n\nThis isn't true. Lore is the sphere that has the cad types witch deal with instant removal of locations. Eowyn is the most over rated hero ever, the sooner you stop using her the sooner you will be playing with more powerful decks. Tracker is powerful…but Lore is the sphere that has the location control.\n\n\n\nWe disagree, which is fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645625","commentId":645625,"userName":"booored","timestamp":1339931292,"content":"no its not.. that is like saying it is fine to teach creationism as a science subject. believe whatever you like.. but facts are facts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645647","commentId":645647,"userName":"jjeagle","timestamp":1339936482,"content":"booored said:\n\nno its not.. that is like saying it is fine to teach creationism as a science subject. believe whatever you like.. but facts are facts.\n\n\n\nbooored said:\n\nEowyn is the most over rated hero ever, the sooner you stop using her the sooner you will be playing with more powerful decks.\n\nThis is an opinion, not a \"fact\".\n\nbooored said:\n\nLore is the sphere that has the cad types witch deal with instant removal of locations.\n\nSpirit also has cards which remove locations from the staging area (Northern Tracker, Ride to Ruin, Riddermark's Finest), as Bullroarer Took stated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645814","commentId":645814,"userName":"leptokurt","timestamp":1339986428,"content":"Spirit is indeed the best sphere that is cardwise, but lore is only close behind. However, lore has the better heroes by far, so it's hard to say which of these two is better. Both combined are very strong, that's sure.\n\n \n\nAs for Èowyn, sure she is one hell of a strong hero, especially if you compare her to the remaining spirit heroes. Dwalin is fine, but he shines only against certain decks and when used together with Dáin. Frodo is awesome, no question, but he still has \"only\" 2 WP.\n\nSo, is Éowyn overrated? Yes, she is. She is strong, but not that strong so that you desperately need her to win or to get a good score. She makes deckbuilding easier, as she gives a player access to the spirit sphere and covers one main aspect of the game - questing. But this is also her weakness. As we get better cards that improve the ways a player can create progress, Éowyn's WP becomes a less and less powerful tool. And finally, her 3 HP make her  fragile which is always a certain risk when you face some bad encounters. Frodo OTOH is able to thwart some nasty surprises and to ensure an excellent win/loss ratio."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645855","commentId":645855,"userName":"booored","timestamp":1340000391,"content":"jjeagle said:\n\nbooored said:\n\nLore is the sphere that has the cad types witch deal with instant removal of locations.\n\n \n\nSpirit also has cards which remove locations from the staging area (Northern Tracker, Ride to Ruin, Riddermark's Finest), as Bullroarer Took stated\n\nWhile tracker has been discussed already.. I had forgotten about those 2.. for some reason I though they were leadership.\n\nleptokurt said:\n\nAs for Èowyn, sure she is one hell of a strong hero, especially if you compare her to the remaining spirit heroes. Dwalin is fine, but he shines only against certain decks and when used together with Dáin. Frodo is awesome, no question, but he still has \"only\" 2 WP.\n\nSo, is Éowyn overrated? Yes, she is. She is strong, but not that strong so that you desperately need her to win or to get a good score. She makes deckbuilding easier, as she gives a player access to the spirit sphere and covers one main aspect of the game - questing. But this is also her weakness. As we get better cards that improve the ways a player can create progress, Éowyn's WP becomes a less and less powerful tool. And finally, her 3 HP make her fragile which is always a certain risk when you face some bad encounters. Frodo OTOH is able to thwart some nasty surprises and to ensure an excellent win/loss ratio.\n\n\nThis is pretty much the key to it. While she is great at teh start of the game as the game continues her ability becomes less and less relevant. ANY player that runs her and is honest with the forum will have to admit that by mid to late game they are usually massively over questing. Not only is this bad for encounter control as you have less ability to sculpt your willpower to your needs and can advance the quest to fast you also now have a wasted hero slot. I mean if by mid to late game 2 will power is an issue there is something wrong… is 2 willpower worth sacrificing an entire hero slot taht could contain some ubr effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=645861","commentId":645861,"userName":"lleimmoen","timestamp":1340001791,"content":"Whilst I do agree Éowyn is nowhere near as essential as in the times of the core set probably although I hadn't myself played her much then either, I cannot really agree with the over-questing idea. Instead of building a questing army (and thus filling valuable card slots) you can fill the deck with other \"mechanisms\" since Éowyn gives you that questing \"freedom.\" I really think it works both ways, I am not here to defend the character, I don't think she's that fun to play but I still think she's very good. The opening rounds are usually the most crucial ones, hence she can be as well. And the ability to \"use\" otherwise useless cards (for decks that have a lot of uniques and no other way of getting them rid of) is nice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646123","commentId":646123,"userName":"Beano","timestamp":1340044354,"content":"Spirit rules with ease and Eowyn rocks. Not saying there aren't other good options, but I could easily argue that Eowyn, Frodo, and/or Spirit Glorfindel are just as good or better than almost any other hero in the game. The game is usually won or lost in the early rounds, and these guys are early round studs (even better than Beravor the first 2-3 turns). Mid to late game uber engines are nice if you can survive long enough to get them out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646176","commentId":646176,"userName":"gatharion","timestamp":1340051460,"content":" When it comes to mono-sphere decks, Spirit is pretty unquestionably the best for many of the quests. I've found Hills of Emyn Muil and the Dead Marshes to be laughably easy with Spirit.\n\n \n\nHowever! I think Boored has a point. Lore won't just power you through a quest like Spirit, but I think it is by FAR the most versatile. Lore gives you some good questers and events to help eliminate Staging area threat and it has good attackers and it gives you card draw and it's your ONLY source of healing. Spirit can power through some quests, but for some quests, high Spirit and threat reduction isn't enough. I'd pick Lore as the sphere most likely to get through any randomly selected quest with more reliability than any other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646299","commentId":646299,"userName":"Serazu","timestamp":1340082566,"content":"I 'd still go with Spirit. Especially now, with the new Glorf and the new Gandalf, it's able to deliver some hard damage as well. Yeah, Gandalf is neutral, only Spirit can handle him though (the new Aragorn can be extremely valuable as well, but that's it) and, of course, Spirit resources can pay for him. As far as I see it, by summer's end, Spirit will have absolutely no drawbacks at all, save healing. Questing? Check. Defending? Check. Attacking? Check. The best out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646335","commentId":646335,"userName":"Beano","timestamp":1340088089,"content":"While I certainly like having healing handy, I don't tend to view it as requisite. Plus Spirit has at least two options that are just as good or better than healing. You can use Fortune or Fate to bring a hero back if they die. Or Frodo can simply take damage as threat and hence never needs to be healed - I prefer this to healing, especially if you have threat reduction to back it up.\n\nIn the end the argument between Lore and Spirit is probably not necessary. They have numerous high impact 2 card combos that cross the sphere boundary that they are a great pair of spheres to play together. Fast Hitch/Frodo, Asfaloth/Glorfindel, UC/Beravor, Hammersmith/Mathom, and Ziggy/Gildor. come to mind off the top of my head."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646338","commentId":646338,"userName":"lleimmoen","timestamp":1340088543,"content":"Yes, whilst I agree totally that Spirit is the strongest sphere at the moment I would not hesitate that Lore-Spirit is much better than Spirit-mono."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646448","commentId":646448,"userName":"leptokurt","timestamp":1340101828,"content":"lleimmoen said:\n\nYes, whilst I agree totally that Spirit is the strongest sphere at the moment I would not hesitate that Lore-Spirit is much better than Spirit-mono.\n\n\n\nYep, but that doesn't stop me from playing tactics-leadership (Háma, Brand, Théodred) right now. Have to say that Háma/The Eagles Are Coming is a nice combo. Especially when you also have Radagast and Steward of Gondor in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646460","commentId":646460,"userName":"lleimmoen","timestamp":1340102753,"content":"Oh, I love to play Tactics-Leadership as well. But I have little success with it solo; much more in coop, of course.\n\nDo you really take these three around for solo play? That's brave. Especially if Brand's abilities only work coop. I guess you have him there for some initial questing or defence (using Steward and For Gondor! to make him a 3 defender)? Still, how do you manage questing, threat, locations? I would say Legolas could add a bit more to the party."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646571","commentId":646571,"userName":"gatharion","timestamp":1340119699,"content":"Healing is not the only thing that Lore can do that Spirit cannot. Lore is much better at drawing cards and at manipulating the Encounter Deck. \n\n \n\nIMO, for solo games with a mono-sphere deck, (although heaven knows why anyone would limit themselves to that) the best for many of the quests is Spirit. The one that can more reliably handle a variety a of quests is Lore. With some good card draws, an Eagle-centric Tactics deck can scrape by some quests, but has too hard a time getting the questing strength to reliably beat most of them. As for Leadership, I dunno. Leadership has some nice cards, but they seem to lack in a cohesive theme; it's never occurred to me to make a mono-sphere Leadership deck. Instead I very often have Leadership as the third leg of a bi-sphere deck.\n\nOf course, since this isn't a competitive game and you needn't just build your decks from a single sphere, I'm not entirely sure what the point of this all is. I don't feel the game is any worse because it's hard to play a solo game with a mono-sphere Tactics deck. Instead, I'm generally glad that is the case as the more the sphere's overlap, the more they lose their uniqueness. Is there anything wrong with only using Tactics in multi-sphere decks or multi-player games?\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646573","commentId":646573,"userName":"gatharion","timestamp":1340119950,"content":"leptokurt said:\n\nlleimmoen said:\n\n \n\nYes, whilst I agree totally that Spirit is the strongest sphere at the moment I would not hesitate that Lore-Spirit is much better than Spirit-mono.\n\n \n\n \n\nYep, but that doesn't stop me from playing tactics-leadership (Háma, Brand, Théodred) right now. Have to say that Háma/The Eagles Are Coming is a nice combo. Especially when you also have Radagast and Steward of Gondor in play.\n\n\n\nI almost always have a Tactic/Leadership deck on hand as well. Right now, mine is also an Eagle-centric deck with Hama, Brand, and Theodred. Although, I'd swap out Brand for Legolas right away if I was trying to use it in a solo game.* Previously, my best Tactics/Leadership deck for solo play was Legolas, Elrohir, and Elladan. I really like the brothers for solo decks as their special abilities help make up for your action deficit. It would be nice if we got some cards that keyed off of the Ranger keyword; I'd like to make a deck with Aragorn, Elrohir, and Elladan, but right now, neither version of Aragorn really offers anything especially useful to those two.\n\n \n\n*There's only even a few quests I would try this deck with in solo, and I'd almost certainly mulligan if I didn't get Radagast or Stewart of Gondor in my opening hand. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66067-spirits-silver-spoon/?do=findComment&comment=646889","commentId":646889,"userName":"armakis","timestamp":1340183832,"content":"Spirit sphere: easy questing, \"counterspell\", menace reduction, draw,…what is missing ?\n\nin solo games it is The color, I usaully build my game blue +  another…."}]}