{"url":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/","title":"One Deck to Rule them All or Tailored to the Particular Quest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646575","commentId":646575,"userName":"Ranger of the Force","timestamp":1340120355,"content":"Hello all, I have been playing this game for a few months and am loving it.  I got into the game when my friend purchased a core set to see what this whole solo/co-op thing was about while we waited for Star Wars: The Card Game.  We are veteran gamers who have tired of competing against each other and this game suits us very well, though we both hope that the Star Wars game is similar (Star Wars is our first love and we will move on to that one suits our fancy).  Anyway, after playing many a game, I wondered if most players tried to build one deck to deal with all of the quests or they tailored thier decks to the particular quest?  Is it even possible to build \"one deck to rule them all\" as they say? \n\nThanks\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646586","commentId":646586,"userName":"richsabre","timestamp":1340121121,"content":"hi\n\nyour question is a good one, and one that crops up now and again- the basic answer is the forum is split into two\n\n- people who mostly tailor their decks per quest\n\n-people who keep decks constructed\n\nthe former is far more common than the latter, as the quests tend to naturally push you into making different deck, some people dislike this, however i think its all part of the fun\n\nas for one deck to rule them all….no i dont think there is- there are decks that are great all rounders, but in all cases they wont  be as good as specific decks\n\nthis is also complicated by different races having different amounts of powerful cards- take dwarves for instance, they are currently one of the (or the?) most powerful race so far, because we are in the dwarrowdelf cycle…..so its sort of hard to say deck A is better than deck B and always will be, as things obviously change\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646588","commentId":646588,"userName":"lleimmoen","timestamp":1340121227,"content":"I am building general decks. But I try to build more at once, three or four, each with a different strength and focus. Then pick one (or more likely two (or even more rarely) as I play more coop than solo) which I find most fit for the quest.\n\nWith more and more quests coming, and with very specific quests like A Journey to Rhosgobel*, it is nigh impossible to have a deck that can win against them all. A bit easier for two deck in a 2-player mode.\n\n* Lore of Imladris makes beating this quest much more probably, yet I would never include it in my deck as I find it almost useless in every other quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646599","commentId":646599,"userName":"Bullroarer Took","timestamp":1340123029,"content":" I feel that if they ever do make the player cards powerful enough that one deck can rule them all then they have failed in quest development."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646603","commentId":646603,"userName":"richsabre","timestamp":1340123741,"content":"Bullroarer Took said:\n\n I feel that if they ever do make the player cards powerful enough that one deck can rule them all then they have failed in quest development.\n\n\n\nthats a good point"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646606","commentId":646606,"userName":"plueschi2","timestamp":1340124146,"content":"Bullroarer Took said:\n\n I feel that if they ever do make the player cards powerful enough that one deck can rule them all then they have failed in quest development.\n\n\n\nI am not sure about others, but I think we are almost already there. As long as you don't care about score, you can build decks that are viable against all scenarios, especially with 2+ players. Or in other words: A \"tandem\" of decks to rule them all is already possible imo (solo play will very likely always struggle against Escape from Dol Goldur).\n\nBut I guess the devil is in the details there: Each person probably has a different definition of \"viable\", do you want your \"decks to rule them all\" to have a certain win percentage against each scenario? An average win percentage across the board? A certain score against each scenario? And how high are these values for different people? Depending on how strongly you want to \"rule\", the answer might be yes, no or maybe ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646611","commentId":646611,"userName":"lleimmoen","timestamp":1340124665,"content":"Yes. I think I have a deck or two that will beat every quest at least once in ten games, with the ever exceptional Dol Guldur. And I think I have two decks that will in coop beat every quest more than 50% (with a possible exception of Osgiliath).\n\nBut the winning itself is little important to me in a way. I do like it when it plays well but I like it far more when it looks good, has synergies and combos, follows a certain theme, to correspond with the story. I think that's an important division among the players here, some come for the mechanics and some for Tolkien in the first place. I'm among the latter and (to come back to the OP) thus it's no fun for me to take the best cards to beat certain scenario, I rather have a deck that has some style."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646616","commentId":646616,"userName":"Mattr0polis","timestamp":1340125209,"content":"Our group always builds general decks instead of tailored-to-quest ones. Not that I think there's anything inherently wrong with either method, but because we'd rather knock out 10 or 15 quests each Saturday instead of spending most of that time building decks.\n\nSo we usually will build decks as soon as we get together Saturday morning and then win through as many quests as we can. There is definitely some quests you will struggle on doing it this way, but it's far from unmanageable and you learn other tricks to work through those. We've found many great decks that can go through the entire cycle of every quest pretty well.\n\nOne thing we do that is kind of a good compromise between the two methods, is we'll sometimes use a side-deck. We'll just build our decks and then set like 5-10 extra possibly useful cards each in the side-deck. That way we can deal with some overly-specific quests like Rhosgobel by quickly subbing in extra healing cards but not spend too much extra time fully rebuilding decks for each quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646623","commentId":646623,"userName":"Ranger of the Force","timestamp":1340126289,"content":"lleimmoen said:\n\nYes. I think I have a deck or two that will beat every quest at least once in ten games, with the ever exceptional Dol Guldur. And I think I have two decks that will in coop beat every quest more than 50% (with a possible exception of Osgiliath).\n\nBut the winning itself is little important to me in a way. I do like it when it plays well but I like it far more when it looks good, has synergies and combos, follows a certain theme, to correspond with the story. I think that's an important division among the players here, some come for the mechanics and some for Tolkien in the first place. I'm among the latter and (to come back to the OP) thus it's no fun for me to take the best cards to beat certain scenario, I rather have a deck that has some style.\n\n\n\n \n\nI am with you, I tend towards not tailoring a deck to meet a specific quest.  I can do that, but its not as much fun as taking a deck that you like because of its theme or synergy and pressing forward despite its weaknesses.  I play mostly solo (until my friend and I can get together more often), but the deck I currently use I simply love, but it struggles against certain quests (Anduin) due to its high threat.  It can beat 3 out of the first 4 quests (save Escape from Dol Gulder) but not consistently save the Passage Through Mirkwood.  So for those of you who call yourselves \"generalists,\" what win percentage say out of 10 plays would you consider that type of deck successful or to your liking?\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646766","commentId":646766,"userName":"jjeagle","timestamp":1340154863,"content":"plueschi said:\n\n \n\nBullroarer Took said:\n\n \n\n I feel that if they ever do make the player cards powerful enough that one deck can rule them all then they have failed in quest development.\n\n \n\n \n\nI am not sure about others, but I think we are almost already there. As long as you don't care about score, you can build decks that are viable against all scenarios, especially with 2+ players. Or in other words: A \"tandem\" of decks to rule them all is already possible imo (solo play will very likely always struggle against Escape from Dol Goldur).\n\nBut I guess the devil is in the details there: Each person probably has a different definition of \"viable\", do you want your \"decks to rule them all\" to have a certain win percentage against each scenario? An average win percentage across the board? A certain score against each scenario? And how high are these values for different people? Depending on how strongly you want to \"rule\", the answer might be yes, no or maybe ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\n \n\nI agree - I think we are quite close to being able to make decks that can beat all scenarios solo, Dol Guldur and Rhosgobel being the biggest stumbling blocks. There is, as you rightly note, however, a significant gap between \"can beat\" and \"will beat reliably\", and the question of what the latter means.\n\nThe One Deck to Rule Them All tourney here [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=286&efcid=4&efidt=658493&efpag=0] is an interesting challenge on this front, although not many people have yet participated. I managed to go 14-2 against the existing quests to date. Although the tournament rules allow a 5 card sideboard (so not strictly ODTRTA), I only really used mine to bring in Lore of Imladris for Rhosgobel.\n\nI haven't yet attempted this properly with two players but my belief is that \"two decks to rule them all\" is already viable.\n\nWhen the game first came out, I did think that a major part of the challenge would the \"puzzle solving\" task of building decks to overcome the different challenges of each specific quest. However, this hasn't really turned out to be the case, because the difficulty level of most quests has been such that they can be quite readily beaten by \"general\" decks. The main exceptions seem to be Rhosgobel (where the \"puzzle\" isn't very hard to solve - run Lore of Imladris) and Dol Guldur."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646795","commentId":646795,"userName":"DevastazioneH88","timestamp":1340165265,"content":" I build one non-specific deck and then I try to replace cards for specifc quests (not the heroes anyway), to see how they work in every situation. (Now I've gone through all the dwarrodelf A.P. using a Rohan based deck with Theodred, Hama and Eowyn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646908","commentId":646908,"userName":"Titan","timestamp":1340188033,"content":"Early on, I think you were more likely to build decks to beat a particular quest. With the advent of more themed decks, I. E. dwarves, Rohan, Zigil Miner, etc, I've found myself sticking to archetypes already built and using those that seem better suited to a quest. That means that, at this point, I would only build a scenario specific deck in the case of a Rhosgobel-type quest or if a quest was so difficult that existing archetypes could not tackle it efficiently. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66206-one-deck-to-rule-them-all-or-tailored-to-the-particular-quest/?do=findComment&comment=646932","commentId":646932,"userName":"Bohemond2","timestamp":1340191498,"content":"I don't like tailoring decks to specific quests.  I have 5 decks that I keep constructed, and play them against all scenarios.  I generally play two player; only one of the five decks excels at solo play.  I posted it in another thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=669747] so it didn't bog down this discussion"}]}