{"url":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/","title":"Old quests; still challenging of outdated?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647028","commentId":647028,"userName":"mr.thomasschmidt","timestamp":1340203706,"content":"Just wanted to know what people thinks about the older quests compared to the ever growing card pool.\n\n- Is the older quest from the core set and Mirkwood cycle getting outdated as newer stronger cards are released?\n\n- How do you deal with that? (excluding ex. dwerowdwelf cards from the Mirkwood quest maybe?)\n\nWhat are people's thoughts on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647031","commentId":647031,"userName":"jjeagle","timestamp":1340204187,"content":"mr.thomasschmidt said:\n\nJust wanted to know what people thinks about the older quests compared to the ever growing card pool.\n\n- Is the older quest from the core set and Mirkwood cycle getting outdated as newer stronger cards are released?\n\n- How do you deal with that? (excluding ex. dwerowdwelf cards from the Mirkwood quest maybe?)\n\nWhat are people's thoughts on this?\n\n\n\n1. In general, yes - but Escape from Dol Guldur and Return to Mirkwood are, I think, still two of the stiffest challenges. Many of the Mirkwood quests were pretty easy first time round.\n\n2. Another option that I've been following is to build decks that try out (inferior) cards I've never really used before, or similarly build to theme rather than strength."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647087","commentId":647087,"userName":"richsabre","timestamp":1340210590,"content":"yeah i go for theme decks to keep the challenge going"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647108","commentId":647108,"userName":"Bohemond2","timestamp":1340213242,"content":"I think that the new cards allow you to make a highly focused deck that runs roughshod over the old quests.  If you want additional detail, take a look at this thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=669747].  Their still fun, but the new cards make them less challenging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647180","commentId":647180,"userName":"souhei719","timestamp":1340236921,"content":"I still consider Journey Down the Anduin pretty challenging, but then again it may depend on everybody's threshold of challenge.  I tend to think if I'm not achieving over 80% wins against a quest, then there can still be a lot of improvement.  You never know when you just pull some first cards in a quest that will instantly ruin your chances of winning.  However if your deck is really that great, it should be able to combat those terrible draws.\n\nHowever if you feel that quests are still too easy for you, the general way I think that you should complete quests is to only be able to use cards that have been released up to the quest you're playing.  For example if you're playing CatC, only use cards from the core set, THfG, and CatC.  I would also recommend only using one core set if you have more than one.  Theoretically speaking no quest should be so difficult that this would make any quest undefeatable, but it will certainly lower your chances of success."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647450","commentId":647450,"userName":"jjeagle","timestamp":1340286952,"content":"These are three good points. I agree with you that, if we think quests are easy, then we should raise our success criteria to \"winning (almost) all the time\".\n\nUsing cards only from that pack and earlier ones: this is a good idea, though perhaps you could extend this to \"cards from that cycle\" - since the cards from a cycle are allegedly all designed and tested together, and cards for a theme or synergy spread out across the packs.\n\nDropping to one core set: again, a nice way to increase the challenge, but personally I would find it an annoying anomaly to have playsets of all the other cards but not those from the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647508","commentId":647508,"userName":"lleimmoen","timestamp":1340294175,"content":"What I primarily notice is how much more slick one can be in dealing with certain obstacles. The Nazgul of Dol Guldur is a good example, I remember him being a real pain that often required Gandalf to hit and defend and pray for no shadow. Now Dúnhere often takes one or two rounds to finish him off without ever engaging, defending, cancelling the shadow.\n\nBut the games can still be lost in the opening rounds. Less so perhaps but I don't think we got many more options to deal with those early hurdles. Perhaps Fresh Tracks is one of such. We haven't got neither a new Feint nor A Test of Will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66246-old-quests-still-challenging-of-outdated/?do=findComment&comment=647667","commentId":647667,"userName":"guciomir","timestamp":1340327527,"content":"Still challenging, but of course it depends on certain factors.\n\nIt is easier to build a deck designed to beat particular scenario. You have a wider card pool and encounter deck does not get any reinforcements. Some quests become really easy this way.\n\nHowever, if you build a deck which you use against ALL existing scenarios, than some of the earlier quests become harder. Very generally: you used deck with tons of location hate cards, so location heavy quests (like Emyn Muil or Hunt for Gollum) were very easy for you. But now, after playing Khazad quests, you change your deck so it is more balanced. It consists of cards that help you with killing enemies now and number of high willpower allies is lower, you also have less cards that kill locations. Suddenly, location heavy quests become slightly harder. As I said, this was very general comment, but you can really feel such details when you play a lot. Switching one card in a deck can make some scenarios harder and some easier. Consider Lore Of Imladris, many players are using it only because Rhosgobel quest, but in most other quests, the card is not as useful (so it slightly weakens the deck).\n\nAnd then, finally, we have Foundations of Stone with new Spirit Glorfindel. This hero turns world upside down, opens a LOT of new possibilities (for example, creating a secrecy deck or 3 hero deck with starting threat below 30 become MUCH easier) . And suddenly, with this hero, all quests become easier. Even Dol Guldur quest.\n\n "}]}