{"url":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/","title":"Tactics, or: getting the short end of the stick","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647079","commentId":647079,"userName":"leptokurt","timestamp":1340209598,"content":"When reading the thread about spirit getting the silver spoon in this game, I got the idea to proof that spirit might be the greatest sphere there is, but that tactics can stand its ground, too. Even in solo mode. Even against a tough scenario. All these cool new cards, eagles and stuff - hey, the must be good for something, right? So I decided to build a deck around two tactics heroes (Háma and Brand). I added Théodred as my third hero. As my opponent I chose Journey Down the Anduin and… hey, can I hear some of you laughing already? Yes, Tactics vs Anduin! AND WHY NOT?\n\n \n\nThat's why:\n\nloosewinlooselooselooselooselooselooselooselooselooselooselooselooselooselooseloose (1-16)\n\nIn half my games my fellowship was already wiped out after three or four turns, and they reached stage 2 in only 3 games.\n\n \n\nOk, so perhaps this was all Theo's fault. So, Théodred out, enter Bifur and his fantastic lore friends. Result:\n\nlooselooselooselooselooselooseloose (0-7)\n\n \n\nAfter having one core set, all Mirkood expanison, KD and everything until The Long Dark, I am not able to get a win ratio of 10 percent against Anduin? I had not expected this, and it shows that they still have to improve tactics a lot. I mean, if it cannot defat one of the earlier adventures after almost 2 cycles, something is clearly wrong. The main problem seems to me that either you have two tactics heroes and thus not enough WP and flexibility (plus a rather high starting threat), or you have only one tactic hero and you're not able to pay for all these expensive tactics allies.\n\nOr you have no tactic hero and no problems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647088","commentId":647088,"userName":"lleimmoen","timestamp":1340210638,"content":"I will address more of this. But I ask you first (and I did elsewhere but got no answer) why do you use Brand in solo? For his willpower, his defence? I think Legolas would do better for his ability (and a bit lower threat cost)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647089","commentId":647089,"userName":"lleimmoen","timestamp":1340210744,"content":"And yes, the only winning way with Tactics solo seems to run one hero only. And then you're indeed not able to pay for much but the events are still good. Háma or Boromir can play this one Tactics hero role quite well even in solo I'd say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647090","commentId":647090,"userName":"richsabre","timestamp":1340210905,"content":"i think the problem is, that in solo play especially, tactics is naturally going to be the weakest- after all when it comes to it, questing is the main thing you need to do, and tactics sucks at this, so by including tactics in your deck you are making it weaker\n\nand yeah of course you need to defend and attack, but everyone must agree this is secondary……..in fact my strategies rarely include 'tactics' style attacking, there are far more efficient ways to deal with enemies using the other spheres"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647106","commentId":647106,"userName":"leptokurt","timestamp":1340212685,"content":"lleimmoen said:\n\nI will address more of this. But I ask you first (and I did elsewhere but got no answer) why do you use Brand in solo? For his willpower, his defence? I think Legolas would do better for his ability (and a bit lower threat cost).\n\n\n\n \n\nOh, sorry for not answering that! Brand has 2 WP (main reason) and 3 ATT when it comes down to kill Mr Troll. His 2 DEF can be handy when you're in stage 2 (can't really tell, because I haven't been thee too often). Gimli's and Boromir's threat are both too high and Legolas'  WP too low. Elladan need his family to get his stuff together and Thalin - well he's better underground.\n\n \n\nIn JdtA you have to face 3 threat at least in round 1, so I wanted to make sure to have enough WP to balance this out, Otherwise the troll would attack me too soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647107","commentId":647107,"userName":"leptokurt","timestamp":1340212880,"content":"richsabre said:\n\ni think the problem is, that in solo play especially, tactics is naturally going to be the weakest- after all when it comes to it, questing is the main thing you need to do, and tactics sucks at this, so by including tactics in your deck you are making it weaker\n\nand yeah of course you need to defend and attack, but everyone must agree this is secondary……..in fact my strategies rarely include 'tactics' style attacking, there are far more efficient ways to deal with enemies using the other spheres\n\n\n\nThere is a lot of fighting in JdtA, but these locations - well, they are actually dangerous, unlike most of the new ones. Necromancer's Pass or Gladden Fields during the setup is like a death sentence for every tactics driven deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647111","commentId":647111,"userName":"lleimmoen","timestamp":1340213639,"content":"But -1 initial threat will eagual out the +1 questing. It is really of matter on round one staging. And Legolas can get you rid off a location. But I see what you're saying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647117","commentId":647117,"userName":"wellist","timestamp":1340214881,"content":" I have been having a moderate amount of success with a Boromir/Theodred/Glorfindel(spirit) deck. It is designed around lowering threat, and relying on Boromir to bash stuff.  Though the deck runs into trouble if I shuffled badly (stupid fingers!) and don't get an early Light of Valinor.  Good luck and shuffle well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647183","commentId":647183,"userName":"souhei719","timestamp":1340237487,"content":"I understand this is about solo, but I think tactics really stands out in 2-player.  Early on during the core only days, I really enjoyed using Legolas and often considered him a star hero in our games.  I still haven't beat MaO yet but the closest I got was with Legolas and Brand taking down everything.  2-player also allows for higher survivability though and I think the longer a game goes, the more powerful tactics gets from sheer allies.  In terms of scoring though, no I don't think they can be as effective but after you reach a certain point, at least the allies can serve you with a bit of survivability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647210","commentId":647210,"userName":"lleimmoen","timestamp":1340244272,"content":"Oh yeah, I think for 2-player, it would be almost foolish to go without a Tactics hero, especially as they're so good, Boromir, Háma, Legolas, Brand but I finally got even the Brothers going (and Dwarves are strong as a team naturally).\n\nBut this was obvioulsy about solo. And Tactics-major which really is a big problem at the moment. I haven't even tried that out that many times but I am totally convinced by the OP about the results. I think it doesn't stand a chance in MOST quests. Actually I might try out the Long Dark as I find that one almost hard to lose with the current pool. If I pick two Tactics heroes and make as good a deck I can (with all the cards available) and still stand no chance, there certainly is an issue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647444","commentId":647444,"userName":"Boris_the_Dwarf","timestamp":1340285757,"content":" I've had quite a bit to say on this subject over the last few months, so I won't bother repeating it all here. Essentially, it comes down to two problems in design with this game:\n\n \n\n1. The designers don't understand (or perhaps don't care) that the ability to place progress tokens on quest cards is the key to victory, and most of the time that means questing. By intentionally creating characters in the Tactics sphere that are incapable of doing that due to the lack of Willpower, they are hosing the sphere out of the solo game. For people who primarily play solo, FF is essentially creating worthless, unuseable elements as part of the game.\n\n2. In an effort to make other spheres more able to handle the solo game, FF has (perhaps unknowingly) created Tactics cards that are actually part of a different sphere. For example, the Mirkwood Runner."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647633","commentId":647633,"userName":"schmoo34","timestamp":1340317786,"content":"I am not going to proclaim tactics to be the one deck to rule them all, however I feel tactics is a mental style that playing spirit/lore decks don't use.  Spirit/Lore players use finesse to win games and they rely on event cards and their heroes to do most of the work along with well timed allies.\n\n \n\nTo win with a tactics deck, you need attachments, attachments, attachments, and allies, allies, allies.  I read another poster in a different thread comment that tactics can be powerful but you are at the mercy of your deck.  I agree with that.\n\n \n\nFor starters, Legolas is a required member because the sylvan bows and sylvan swords allow him to slice through enemies, and he gets to automatically put two progress tokens on locations and quests.  Doesn't sound like much, but every little bit helps especially when folks complain about questing being the primary component of the game.\n\n \n\nNow, on to the eagles.  There are eagles and allies who contribute more willpower than the heroes do…and that is precisely what you are supposed to use and do.  The heroes are for bashing, the eagles are for questing.  Gimli can absorb damage and dish out attack unlike any other hero…but if he isn't needed, he can also add two willpower…and if you get that surprise enemy attack, Gimli can likely absorb the damage undefended…or there are eagles with 4 defense and so on and so on.\n\nPut Radagast in your deck…he will earn money alongside your heroes, he will also do questing for you so your heroes can focus on other things.  He can heal your eagles or buy them so you can spend your $$ on attachments.\n\nIn the end, you rely heavily on your deck to win with tactics…but doesn't a spirit player also rely heavily on theirs?  The issue is that your heroes are not the questers, the allies are.  Some quests which limit your allies or certain treachery cards can be devastating. \n\n \n\nMy gripe with the eagles is that they are expensive.  If you don't get Radagast early, you could be sitting on great cards which you can't bring into play. \n\n \n\nNow that I spent all of this time defending the tactics deck…I do admit that my favorite deck is Legolas, Gimli, and Dain.   By having Dain in the midst, you get access to more attachments and heroes, plus some interesting events but more imortantly you get Dain's bonus to willpower which allows the completion of questing to be a bit easier.\n\n \n\nMy largest bane with this deck…locations.  It is easy to get mired in locations with this deck…the fine balance is can you accumulate the allies quick enough.  I feel many will argue the spirit/lore route offers you higher consistency.  I'm not sure I can argue with that…I just like the brute force approach.  It is more enjoyable for me.  If I can ever find a 2nd player, I enjoy it even more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647702","commentId":647702,"userName":"leptokurt","timestamp":1340334989,"content":"schmoo34 said:\n\nI am not going to proclaim tactics to be the one deck to rule them all, however I feel tactics is a mental style that playing spirit/lore decks don't use.  Spirit/Lore players use finesse to win games and they rely on event cards and their heroes to do most of the work along with well timed allies.\n\n \n\nTo win with a tactics deck, you need attachments, attachments, attachments, and allies, allies, allies.  I read another poster in a different thread comment that tactics can be powerful but you are at the mercy of your deck.  I agree with that.\n\n \n\nFor starters, Legolas is a required member because the sylvan bows and sylvan swords allow him to slice through enemies, and he gets to automatically put two progress tokens on locations and quests.  Doesn't sound like much, but every little bit helps especially when folks complain about questing being the primary component of the game.\n\n \n\nNow, on to the eagles.  There are eagles and allies who contribute more willpower than the heroes do…and that is precisely what you are supposed to use and do.  The heroes are for bashing, the eagles are for questing.  Gimli can absorb damage and dish out attack unlike any other hero…but if he isn't needed, he can also add two willpower…and if you get that surprise enemy attack, Gimli can likely absorb the damage undefended…or there are eagles with 4 defense and so on and so on.\n\nPut Radagast in your deck…he will earn money alongside your heroes, he will also do questing for you so your heroes can focus on other things.  He can heal your eagles or buy them so you can spend your $$ on attachments.\n\nIn the end, you rely heavily on your deck to win with tactics…but doesn't a spirit player also rely heavily on theirs?  The issue is that your heroes are not the questers, the allies are.  Some quests which limit your allies or certain treachery cards can be devastating. \n\n \n\nMy gripe with the eagles is that they are expensive.  If you don't get Radagast early, you could be sitting on great cards which you can't bring into play. \n\n \n\nNow that I spent all of this time defending the tactics deck…I do admit that my favorite deck is Legolas, Gimli, and Dain.   By having Dain in the midst, you get access to more attachments and heroes, plus some interesting events but more imortantly you get Dain's bonus to willpower which allows the completion of questing to be a bit easier.\n\n \n\nMy largest bane with this deck…locations.  It is easy to get mired in locations with this deck…the fine balance is can you accumulate the allies quick enough.  I feel many will argue the spirit/lore route offers you higher consistency.  I'm not sure I can argue with that…I just like the brute force approach.  It is more enjoyable for me.  If I can ever find a 2nd player, I enjoy it even more.\n\n\n\nTwo weeks ago I would have agred with you. Howeverm, after my experience against Anduin (I had 7 more losses with an all tactics deck,although this one fared better than the other two) I have to say that tactics is still not playable. Even with Legolas I would have lost all those games. My hand was ful of eagles, but I lacked the resources to play them all (even with Radagast, but then Anduin is a special scenario). Perhaps tactics need some more cards like \"Horn of Gondor\", for example an attachment that produce a resource for each slain enemy. Or something like \"Ancient Mathom\".\n\nIn conclusion, after 30 losses, and being a somewhat experienced player, I can say that tactics is not fit for solo play. The only thing tactics can do better than any other sphere is attacking. They're not even outstanding at defending, as lore and leadership offer simpler and cheaper ways to build a wall (Bilbo the Wall, Dáin, Dúnedain Warnings) against your enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647732","commentId":647732,"userName":"Budgernaut","timestamp":1340344891,"content":" I think the true point comes down to solo vs. coop play. We've seen debates on and off about cards being made that are tailored to one play setting or the other. Is it too much of a jump to just say that this is an entire sphere that's optimized for solo play? Sure, that means that Tactics really is getting the short end of the stick for solo play, but maybe that's like trying to force the wrong piece in a puzzle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647771","commentId":647771,"userName":"gatharion","timestamp":1340355439,"content":" I'm sorry, but this is such malarky.\n\nYeah, you're not going to beat every quest with a solo tactics deck. So what? WHY DOES THAT MATTER???\n\nAnd tactics isn't at all useless in solo, not when it isn't your only focus. I most recently beat Journey down the Anduin with an eagle-heavy deck with Eowyn, Elrohir, and Elladan and also with a Dwarf deck using Dain Ironfoot, Bifur, and Gimli.\n\n \n\nIn each of those cases the Tactics elements were very crucial to my success, but that's the nice thing about this game…you don't have to rely on just one sphere.\n\nJourney Down the Anduin is a tough quest in solo play. Period. I'm having a hard time thinking of a pure Leadership deck that could reliably beat it and Spirit and Lore would really require getting the perfect combination of cards at the beginning.\n\n \n\nI VEHEMENTLY disagree that there is a flaw in the game design because it's hard to win solo games with just Tactics. When you start asking for Tactics to have more Willpower, have more card drawing, etc, you're basically asking for the theme of each sphere to become more diluted. If there was no functional difference between what you can do with each sphere, then you lose a major component of this game. Unless you're playing four player, you are generally better served trying to find a way to balance the abilities of each sphere in your decks (part of the challenge of the game).\n\n \n\nI'm not trying to say Tactics couldn't have a bit more variety, and Ancient Mathom is a nice example of a card that uses the strength of that sphere to get an affect generally associated with another sphere, but i think Tactics is a good and powerful Sphere as is too. Just not for mono-sphere solo-play, which is one tiny aspect of this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647781","commentId":647781,"userName":"leptokurt","timestamp":1340356685,"content":"gatharion said:\n\n I'm sorry, but this is such malarky.\n\nYeah, you're not going to beat every quest with a solo tactics deck. So what? WHY DOES THAT MATTER???\n\nAnd tactics isn't at all useless in solo, not when it isn't your only focus. I most recently beat Journey down the Anduin with an eagle-heavy deck with Eowyn, Elrohir, and Elladan and also with a Dwarf deck using Dain Ironfoot, Bifur, and Gimli.\n\n \n\nIn each of those cases the Tactics elements were very crucial to my success, but that's the nice thing about this game…you don't have to rely on just one sphere.\n\nJourney Down the Anduin is a tough quest in solo play. Period. I'm having a hard time thinking of a pure Leadership deck that could reliably beat it and Spirit and Lore would really require getting the perfect combination of cards at the beginning.\n\n \n\nI VEHEMENTLY disagree that there is a flaw in the game design because it's hard to win solo games with just Tactics. When you start asking for Tactics to have more Willpower, have more card drawing, etc, you're basically asking for the theme of each sphere to become more diluted. If there was no functional difference between what you can do with each sphere, then you lose a major component of this game. Unless you're playing four player, you are generally better served trying to find a way to balance the abilities of each sphere in your decks (part of the challenge of the game).\n\n \n\nI'm not trying to say Tactics couldn't have a bit more variety, and Ancient Mathom is a nice example of a card that uses the strength of that sphere to get an affect generally associated with another sphere, but i think Tactics is a good and powerful Sphere as is too. Just not for mono-sphere solo-play, which is one tiny aspect of this game.\n\n\n\nI'm not talking about \"a deck\", but about (almost) a whole sphere apparently not working in solo mode. After 30 devastating losses in a row (incl. decks feat. spirit and Éowyn) I can say that tactics/eagles simply doesn't work. Tactics/dwarfs gets the job done better because of Dáin, but those eagles suck completely. I expected tactics to be a tough challenge, but I didn't expect to have no chance at all. Which is a flaw in game designing.\n\nI'm also not talking about a deck having difficulties to beat a difficult quest, but about a whole sphere not being able to beat a difficult quest at all. Give me some random two heroes from the other three spheres, and I will built a deck around them that beats Anduin at least 3 out of 10 times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647809","commentId":647809,"userName":"gatharion","timestamp":1340360636,"content":"leptokurt said:\n\n \n\n \n\nI'm not talking about \"a deck\", but about (almost) a whole sphere apparently not working in solo mode. After 30 devastating losses in a row (incl. decks feat. spirit and Éowyn) I can say that tactics/eagles simply doesn't work. Tactics/dwarfs gets the job done better because of Dáin, but those eagles suck completely. I expected tactics to be a tough challenge, but I didn't expect to have no chance at all. Which is a flaw in game designing.\n\nI'm also not talking about a deck having difficulties to beat a difficult quest, but about a whole sphere not being able to beat a difficult quest at all. Give me some random two heroes from the other three spheres, and I will built a deck around them that beats Anduin at least 3 out of 10 times.\n\n\n\nI really don't understand what you mean by \"a whole sphere\"? You don't find Tactics cards helpful in your decks?\n\nI don't buy it. Tactics can be incredibly useful in solo, just not as the tentpole of your whole deck.\n\nThis is also the first time I have EVER heard someone say that the Eagles don't work. Which I don't get, cause they rock!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647815","commentId":647815,"userName":"gatharion","timestamp":1340361362,"content":" Would someone please post an example of a Leadership deck that can beat Journey Down the Anduin with some regularity?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647906","commentId":647906,"userName":"MyNeighbourTrololo","timestamp":1340369848,"content":"I think, tactics is pretty good for duo play. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=647915","commentId":647915,"userName":"Dam the Man","timestamp":1340370209,"content":"gatharion said:\n\n Would someone please post an example of a Leadership deck that can beat Journey Down the Anduin with some regularity?\n\n\n\nWith 3x Sneak Attack, Gandalf will be making a LOT of visits, then you have Faramir to race through 2B, while Steward of Gondor fuels the economy (not to mention Theodred if you use him). Unless you're talking pure Leadership, Coragorn + Stone could even add Will of the West to deal with running out of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648017","commentId":648017,"userName":"Boris_the_Dwarf","timestamp":1340379180,"content":"gatharion said:\n\nI VEHEMENTLY disagree that there is a flaw in the game design because it's hard to win solo games with just Tactics. When you start asking for Tactics to have more Willpower, have more card drawing, etc, you're basically asking for the theme of each sphere to become more diluted. If there was no functional difference between what you can do with each sphere, then you lose a major component of this game. Unless you're playing four player, you are generally better served trying to find a way to balance the abilities of each sphere in your decks (part of the challenge of the game).\n\n \n\nWhat major component of the game is lost by making Tactics more playable in solo? Besides, haven't they just dilluted the game with cards that mirror Tactis for other spheres? In the last adventure pack, there was a Spirit card that prevent all enemies engaged with a player from attacking. This is an improvement over a Tactics version from the core set, which requires the cost to be paid by 3 different Tactics characters. It's almost like the designers don't want Tactics to be playable in solo games. There are so many other cards that are far less blatant as well. Mirkwood Runner is the best example. Dunhere, as a hero, should have had the Tactics icon. I'm not saying all the factions should be carbon copies because, yeah, that does dilute the game and makes it stale. But what I'm saying is that EVERY sphere should have a way to win, not be forced to take a back seat to other spheres just because it is missing a fundamental element of the game (Willpower).\n\nThe only time I use tactics is when I am in a 2-player game, and frankly, if I could justify buying 2 copies of every adventure pack, I wouldn't even use it then. I'd just run a second Spirit/Lore deck instead. As more sets come out, if something doesn't change, soon the day will come when it won't be worth looking at the Tactics cards at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648038","commentId":648038,"userName":"gatharion","timestamp":1340380622,"content":"Dam said:\n\ngatharion said:\n\n \n\n Would someone please post an example of a Leadership deck that can beat Journey Down the Anduin with some regularity?\n\n \n\n \n\nWith 3x Sneak Attack, Gandalf will be making a LOT of visits, then you have Faramir to race through 2B, while Steward of Gondor fuels the economy (not to mention Theodred if you use him). Unless you're talking pure Leadership, Coragorn + Stone could even add Will of the West to deal with running out of cards.\n\n\n\n \n\nThere are some good cards in Leadership, but unless you draw like two Sneak Attacks and Gandalf right away, I'm not sure how you're going to avoid being Troll food."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648044","commentId":648044,"userName":"gatharion","timestamp":1340381087,"content":"Boris_the_Dwarf said:\n\ngatharion said:\n\nI VEHEMENTLY disagree that there is a flaw in the game design because it's hard to win solo games with just Tactics. When you start asking for Tactics to have more Willpower, have more card drawing, etc, you're basically asking for the theme of each sphere to become more diluted. If there was no functional difference between what you can do with each sphere, then you lose a major component of this game. Unless you're playing four player, you are generally better served trying to find a way to balance the abilities of each sphere in your decks (part of the challenge of the game).\n\n \n\n \n\nWhat major component of the game is lost by making Tactics more playable in solo? Besides, haven't they just dilluted the game with cards that mirror Tactis for other spheres? In the last adventure pack, there was a Spirit card that prevent all enemies engaged with a player from attacking. This is an improvement over a Tactics version from the core set, which requires the cost to be paid by 3 different Tactics characters. It's almost like the designers don't want Tactics to be playable in solo games. There are so many other cards that are far less blatant as well. Mirkwood Runner is the best example. Dunhere, as a hero, should have had the Tactics icon. I'm not saying all the factions should be carbon copies because, yeah, that does dilute the game and makes it stale. But what I'm saying is that EVERY sphere should have a way to win, not be forced to take a back seat to other spheres just because it is missing a fundamental element of the game (Willpower).\n\nThe only time I use tactics is when I am in a 2-player game, and frankly, if I could justify buying 2 copies of every adventure pack, I wouldn't even use it then. I'd just run a second Spirit/Lore deck instead. As more sets come out, if something doesn't change, soon the day will come when it won't be worth looking at the Tactics cards at all.\n\n\n\nWhat's to gain? Why does it matter if you can play solo tactics?\n\nWhy are you dismissive of so many great tactics cards? Feint is still one of the best events in the game, Hail of Stones, Erebor Battle Master, the synergy found in the Eagles cards…there is some REALLY good stuff there.\n\n \n\nHere's the other thing though. You CAN play solo Tactics. It's harder, then most, but actually pretty doable on a few quests. All of these cards I'm hearing being dismissed so casually can get pretty powerful. With my Eagles deck, if I get Radagast and an Eagles of the Misty Mountains out within the first few turns, then I'm usually pretty solid! Yeah, it's not sure fire, and I have to be kinda lucky with my draws, but that's sorta how this game goes!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648410","commentId":648410,"userName":"Titan","timestamp":1340450649,"content":"Frankly, I'm surprised that it took this kind of an exercise for an experienced player(the OP) to figure this out. I could have predicted a pretty similar result without going through with it. \n\nHere's the problem Tactics has in solo: whatever it is you are taking out to put Tactics in, whether it is Leadership, Spirit or Lore, you are making the deck weaker. It isn't about the good cards Tactics has, which there are a number of them. It is about the fact that you just made your deck worse because all Tactics can really do is fight, whereas all the other spheres offer far more flexibility. Many a time I've wished to use a Tactics hero and some Tactics card in a deck. However, I simply can't justify doing so, as I'll be making an inferior deck by force feeding a sphere that I want to use, but that brings no improvement over what I took out to make room for it.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648419","commentId":648419,"userName":"richsabre","timestamp":1340451947,"content":"i agree- though perhaps tactics will come into its own when there are really fighting based quests- and im not talking carrock here- im talking a full blown fields of the pelennor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648426","commentId":648426,"userName":"Titan","timestamp":1340452948,"content":"Perhaps, which brings me to something I forgot to mention: another drawback in solo is that, since you only reveal one encounter card per turn, that makes it less likely that you will have enemies to fight. And if you aren't going to fight that much, Tactics is really doing nothing for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648458","commentId":648458,"userName":"richsabre","timestamp":1340460069,"content":"personally, i can never get on with tactics, i have tried, but as titan says there are other methods that have other good benefits also- such as running 3 mirkwood runners in khazad can clear goblins out like skittles, and for the real bad guys forest snare is always a winner\n\nnot that im saying i dont see gimli with 6 damage, citadel plate and 2 axes an absolute beast- which he is, so im not knocking tactics as much as some, but nor am i defending it\n\ni guess as ive said above- time will tell, perhaps a cycle will bring as many tactics cards as mirkwood brought us spirit- perhaps gondor wil be full of excellent tactics cards that will have us looking back red faced at this thread- who knows"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648484","commentId":648484,"userName":"lleimmoen","timestamp":1340466182,"content":"I think what they can (and should) do, at least sometimes, is to have more fighting oriented quests, as suggested above. With no terrible treacheries besides perhaps adding more enemies into play. And with shadow effects only boosting attack by two or so, so that you need a good fighter to deal with that (and even more of those enemies that cannot be blocked by allies), yet the best blocker in the game is probably a Leadership hero. At least he requires a Tactics hero to be in play. And you would need many VPs to win, all of those coming from enemies, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648506","commentId":648506,"userName":"gatharion","timestamp":1340472871,"content":" The more players you have, the more encounter cards get revealed, which means more enemies are likely to come off. That's when Tactics can really shine. \n\nThat's why I don't feel they get the \"short end of the stick\". The game is not just about playing solo games with mono sphere decks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648508","commentId":648508,"userName":"gatharion","timestamp":1340473371,"content":"Titan said:\n\nHere's the problem Tactics has in solo: whatever it is you are taking out to put Tactics in, whether it is Leadership, Spirit or Lore, you are making the deck weaker. It isn't about the good cards Tactics has, which there are a number of them. It is about the fact that you just made your deck worse because all Tactics can really do is fight, whereas all the other spheres offer far more flexibility. Many a time I've wished to use a Tactics hero and some Tactics card in a deck. However, I simply can't justify doing so, as I'll be making an inferior deck by force feeding a sphere that I want to use, but that brings no improvement over what I took out to make room for it.   \n\n\n\n \n\nI don't get this at all.\n\nThere are lots of cards that only have a single function. I can use Dunhere or Legolas, they both quest equally well, but are mostly get used for fighting with different special abilities, which is more benefical depends on what you're facing. I completely agree that all of the Spheres are generally more flexible, but there are also always enemies in every quest. I've lost plenty of games because I've been swarmed by enemies and my handful of cards that could let me dump bunches of progress tokens weren't doing me a lick of good. Not to mention, the single most flexible hero in the whole game is unquestionably Boromir, a Tactics hero.\n\nYou don't *need* Tactics to win, but you can make a deck that is plenty \"strong\" with them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648510","commentId":648510,"userName":"gatharion","timestamp":1340473448,"content":"double post"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648580","commentId":648580,"userName":"Titan","timestamp":1340490005,"content":"gatharion said:\n\nTitan said:\n\n \n\nHere's the problem Tactics has in solo: whatever it is you are taking out to put Tactics in, whether it is Leadership, Spirit or Lore, you are making the deck weaker. It isn't about the good cards Tactics has, which there are a number of them. It is about the fact that you just made your deck worse because all Tactics can really do is fight, whereas all the other spheres offer far more flexibility. Many a time I've wished to use a Tactics hero and some Tactics card in a deck. However, I simply can't justify doing so, as I'll be making an inferior deck by force feeding a sphere that I want to use, but that brings no improvement over what I took out to make room for it.   \n\n \n\n \n\n \n\nI don't get this at all.\n\nThere are lots of cards that only have a single function. I can use Dunhere or Legolas, they both quest equally well, but are mostly get used for fighting with different special abilities, which is more benefical depends on what you're facing. I completely agree that all of the Spheres are generally more flexible, but there are also always enemies in every quest. I've lost plenty of games because I've been swarmed by enemies and my handful of cards that could let me dump bunches of progress tokens weren't doing me a lick of good. Not to mention, the single most flexible hero in the whole game is unquestionably Boromir, a Tactics hero.\n\nYou don't *need* Tactics to win, but you can make a deck that is plenty \"strong\" with them.\n\n\n\n\n \n\nWe have all been overwhelmed by enemies at one point or another. It happens. But by and large, enemies in solo can be handled without Tactics. And once you can do that, you have the added flexibility of whatever else you are running. It is a sphere that specializes in something that all the other spheres have their own way of handling, meaning that too often it brings very little to a deck. Can a deck be strong with Tactics in it? It can do ok, but it will almost certainly get stronger the moment Tactics is taken out of it, and that is the problem."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648619","commentId":648619,"userName":"leptokurt","timestamp":1340506386,"content":"Titan said:\n\nFrankly, I'm surprised that it took this kind of an exercise for an experienced player(the OP) to figure this out. I could have predicted a pretty similar result without going through with it. \n\nHere's the problem Tactics has in solo: whatever it is you are taking out to put Tactics in, whether it is Leadership, Spirit or Lore, you are making the deck weaker. It isn't about the good cards Tactics has, which there are a number of them. It is about the fact that you just made your deck worse because all Tactics can really do is fight, whereas all the other spheres offer far more flexibility. Many a time I've wished to use a Tactics hero and some Tactics card in a deck. However, I simply can't justify doing so, as I'll be making an inferior deck by force feeding a sphere that I want to use, but that brings no improvement over what I took out to make room for it.   \n\n\n\nI knew that tacticts is the weakest sphere by far, but what I didn't expect is that it's not playable at all.\n\n \n\ngatharion said:\n\nTitan said:\n\nHere's the problem Tactics has in solo: whatever it is you are taking out to put Tactics in, whether it is Leadership, Spirit or Lore, you are making the deck weaker. It isn't about the good cards Tactics has, which there are a number of them. It is about the fact that you just made your deck worse because all Tactics can really do is fight, whereas all the other spheres offer far more flexibility. Many a time I've wished to use a Tactics hero and some Tactics card in a deck. However, I simply can't justify doing so, as I'll be making an inferior deck by force feeding a sphere that I want to use, but that brings no improvement over what I took out to make room for it.\n\n \n\nI don't get this at all.\n\nThere are lots of cards that only have a single function. I can use Dunhere or Legolas, they both quest equally well, but are mostly get used for fighting with different special abilities, which is more benefical depends on what you're facing. I completely agree that all of the Spheres are generally more flexible, but there are also always enemies in every quest. I've lost plenty of games because I've been swarmed by enemies and my handful of cards that could let me dump bunches of progress tokens weren't doing me a lick of good. Not to mention, the single most flexible hero in the whole game is unquestionably Boromir, a Tactics hero.\n\nYou don't *need* Tactics to win, but you can make a deck that is plenty \"strong\" with them.\n\n\nI am talking about solo play here. I am fully aware that tactics is shining as a supporting sphere in multiplayer games.\n\nFYI, I just build a mono leadership deck around Gimli, Dáin and Théodred. To make things even harder, I don't use any songs nor Narvi's Belt. So far my record is 1-4, with one game being lost to a nasty shadow effect (\"Despair\") and one to \"Pursued by Shadows\" during setup. I am confident that I will achieve a long term 20-30 percent win ratio with this deck. The main problem so far is to survive the first couple of rounds without being eaten by the troll. Of course I am always hoping for Gandalf to do the job, but some Dúnedain warnings plus Erebor Boots or Durin's Song enable Dáin to defend twice against the troll. That's how I won my only game so far btw.\n\nAnyway, this deck is already doing a better job than tactics. If I'd add a spirit or a lore hero, things would even get better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648628","commentId":648628,"userName":"lleimmoen","timestamp":1340508941,"content":"You meant Glóin, right?\n\nNow, I quite agree with those saying Tactics don't stand a chance in solo. But as I said before, don't you think one way to mend this problem is to make quests more oriented toward fighting. I mean there is the Carrock but Tactics will still struggle their as their threat will rise quickly and the Trolls will attack at once. What I mean is quests with few treacheries, locations of low threat (thematic to battlefields) and many enemies of different strength that require a varied approach in getting rid of them. I would also like to see such a quest that would require a lot of healing but not in a way of Rhosgobel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648779","commentId":648779,"userName":"leptokurt","timestamp":1340531097,"content":"lleimmoen said:\n\nYou meant Glóin, right?\n\nNow, I quite agree with those saying Tactics don't stand a chance in solo. But as I said before, don't you think one way to mend this problem is to make quests more oriented toward fighting. I mean there is the Carrock but Tactics will still struggle their as their threat will rise quickly and the Trolls will attack at once. What I mean is quests with few treacheries, locations of low threat (thematic to battlefields) and many enemies of different strength that require a varied approach in getting rid of them. I would also like to see such a quest that would require a lot of healing but not in a way of Rhosgobel.\n\n\n\nYeah, I meant Glóin, of course.\n\n \n\nI completely agree with you about the rest. I already mentioned this in another thread, but the most enjoyable thing about this game is the fighting. More enemies is something I am waiting for (KD made a good job there). Best would be enemies with a high threat but an even higher threat level to engage you. Say, threat 2 and threat level 35 or more. That way a spirit player can choose to avoid fighting them by adding more WP in the quest phase, while a tactics player would rather engage this enemy in battle.\n\nI'd love to see a tactics healer or  healing attachment. Doesn#t have to be as powerful as lore healers, but something like Glorfindel's ability for tactics would be great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648790","commentId":648790,"userName":"lleimmoen","timestamp":1340532946,"content":"One thing (of many of course) we haven't got any of yet is the shields. I believe they may become a great thing with Gondor perhaps. I can imagine Boromir's shield being the most iconic of those.\n\nWhy I'm saying this is since you brought a Tactics healing card, I know shield may be more of a defence thing, or either defence or hp (or both) but maybe Tactics will get a first aid kit, too.\n\nAnd since I brought up Boromir's shield, I hope most of the iconic characters will get \"their\" attachments, Aragorn's got two, Glorfindel has one, Boromir doesn't have the Horn surprisingly, what happened there? But he may get the shield. Of course there are all sorts of weapons and artifacts for others too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648795","commentId":648795,"userName":"Titan","timestamp":1340533466,"content":"Something else that will help Tactics would be the possibility of multiple sphere heroes. Or heroes whose abilities allow them to play more than one sphere. However, that won't be a true cure as this will be more like \"splashing\" Tactics rather than actually playing it outright. That is, of course, assuming that we ever see something like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648813","commentId":648813,"userName":"richsabre","timestamp":1340536374,"content":"lleimmoen said:\n\nOne thing (of many of course) we haven't got any of yet is the shields. I believe they may become a great thing with Gondor perhaps. I can imagine Boromir's shield being the most iconic of those.\n\nWhy I'm saying this is since you brought a Tactics healing card, I know shield may be more of a defence thing, or either defence or hp (or both) but maybe Tactics will get a first aid kit, too.\n\nAnd since I brought up Boromir's shield, I hope most of the iconic characters will get \"their\" attachments, Aragorn's got two, Glorfindel has one, Boromir doesn't have the Horn surprisingly, what happened there? But he may get the shield. Of course there are all sorts of weapons and artifacts for others too.\n\n\n\nwill they release the horn again?- i thought that was the horn of gondor?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648823","commentId":648823,"userName":"lleimmoen","timestamp":1340537562,"content":"richsabre said:\n\n \n\nlleimmoen said:\n\n \n\nOne thing (of many of course) we haven't got any of yet is the shields. I believe they may become a great thing with Gondor perhaps. I can imagine Boromir's shield being the most iconic of those.\n\nWhy I'm saying this is since you brought a Tactics healing card, I know shield may be more of a defence thing, or either defence or hp (or both) but maybe Tactics will get a first aid kit, too.\n\nAnd since I brought up Boromir's shield, I hope most of the iconic characters will get \"their\" attachments, Aragorn's got two, Glorfindel has one, Boromir doesn't have the Horn surprisingly, what happened there? But he may get the shield. Of course there are all sorts of weapons and artifacts for others too.\n\n \n\n \n\nwill they release the horn again?- i thought that was the horn of gondor?\n\n \n\n \n\nNo it was. I was just wondering why the card has no connexion to Boromir. I think it's more connected to the character than Celebrian's Stone is to Aragorn. But I guess since they wanted to release Horn of Gondor in the core set but not Boromir, they wouldn't want to do that connexion. However, I think it was still a fault, as we really didn't need Horn of Gondor in the core set since we hadn't got the combos (Rohan allies, Eagles) for it anyways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=648983","commentId":648983,"userName":"leptokurt","timestamp":1340557372,"content":"After 12 games with my leadership mono deck I'm at 3-9. Lots of Necromancer's Passes in the setup which is almost every time an auto-loss for a deck with a starting threat of 28. If I get my three rounds to prepare the fight against the troll, things look much better and I get to stage 2 easily. In my earlier games I probably hurried to much and didn't have enough allies out to racedwon the Anduin. My last three games looked much better, the last two being wins.\n\nBiggest complaint about leadership so far: Allies suck! When did I last have \"Guard of the Citadel\" in my hand? Can't remember! And where have all the dwarfs gone? Dáin was not too happy about that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649112","commentId":649112,"userName":"lleimmoen","timestamp":1340584243,"content":"Yes, Leadership has got the worst allies to be sure. But the sphere's strengths lie elsewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649118","commentId":649118,"userName":"gatharion","timestamp":1340586074,"content":" Much like Tactics, I only use Leadership in conjunction with other Spheres. Spirit and Lore are the only ones I ever build as mono-sphere decks.\n\n \n\nRight now though, I'm feeling kinda inspired to try a mono-sphere Tactics deck. (I'm thinking Hama, Legolas, and Gimli.)\n\nI guess my whole reaction to this thread is that up until reading it, it never OCCURRED to me that I should make a mono-Tactics deck for solo play. It just seemed obvious to me that that sphere wasn't designed for that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649190","commentId":649190,"userName":"lleimmoen","timestamp":1340601080,"content":"I think any mono-sphere is worse than multi-sphere for solo, even Spirit.\n\nBut what \"we're saying\", I guess, is that the issue goes deeper. That Tactics-major (meaning 2 heroes) is hard to win with in solo play. And even perhaps that as a rule it is better to play without a Tactics hero altogether. And the latter I find an issue.\n\nI think the idea of your deck may be fun to play with. Háma certainly seems a hero to build such a deck around. And Legolas might go well in there too. Overall I think Boromir is clearly the best Tactics hero but I know he doesn't fit every deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649226","commentId":649226,"userName":"monkeyrama","timestamp":1340605102,"content":"lleimmoen said:\n\nBut what \"we're saying\", I guess, is that the issue goes deeper. That Tactics-major (meaning 2 heroes) is hard to win with in solo play. And even perhaps that as a rule it is better to play without a Tactics hero altogether. And the latter I find an issue.\n\n\n\nI don't know if I'd go so far as to say it's better not to use Tactics heroes, since some are very powerful, but the problem is that you have to build around the one you do include. For instance, I have a deck with Loragorn, Boromir and the Prince, mostly to test a stupidly high threat start with good stats. Boromir is the key to the deck, because he can auto-refresh etc, but generally doesn't buy any cards except Gandalf and Feint, so the rest of the deck is built around supplying him with threat reduction and stuff. It's oddly effective, but it's true that I never feel like I can just throw a Tactics hero in without thinking about it; and using two…can't imagine how that'd work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649234","commentId":649234,"userName":"monkeyrama","timestamp":1340605846,"content":"Which reminds me (although this is a bit off topic) that while there has been some criticism of the new Gorlfindel, having finally played with the new Aragorn, I think FFG absolutely nailed designing his character. He's still 12 threat and all, but his ability opens up some completely new game styles reducing the emphasis on threat control through Galadhrim's Greeting or Elrond's Counsel. I'm really impressed with the simplicity of the concept, and the glorious possibilities it opens up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649235","commentId":649235,"userName":"gatharion","timestamp":1340605930,"content":" There's also a whole thread about how powerful and effective the combo of Elladan and Elrohir is. One of which is a tactics hero.\n\n \n\nI'm just going to have to agree to disagree with those saying a deck is weaker just for having Tactics in it. I've kicked far too many encounter decks in their metaphorical rear with my dwarves and/or eagles to buy that line of reasoning. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649345","commentId":649345,"userName":"leptokurt","timestamp":1340624685,"content":"gatharion said:\n\n There's also a whole thread about how powerful and effective the combo of Elladan and Elrohir is. One of which is a tactics hero.\n\n \n\nI'm just going to have to agree to disagree with those saying a deck is weaker just for having Tactics in it. I've kicked far too many encounter decks in their metaphorical rear with my dwarves and/or eagles to buy that line of reasoning. \n\n\n\nThat's not exactly what I was saying. I was talking about tactics-driven decks, which are decks with more than one tactics ally. However, when I find myself using tactics I do this mainly for using the hero's ability (Elladan, Thalin, Boromir), but not for the tactics cards in my hand. Usually I put only a dozen of them in my deck. Tactics still can't hold the ground on its own. In the beginning, each one of us tried to use the core set's tactics mono-sphere deck against Passage through Mirwkood anf failed. And each time we saw a beginner doing this, we kept saying \"wait until there are more and better cards out there\". And now, after the second cycle is almost finished, we're still waiting for that to happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649351","commentId":649351,"userName":"leptokurt","timestamp":1340624940,"content":"monkeyrama said:\n\nWhich reminds me (although this is a bit off topic) that while there has been some criticism of the new Gorlfindel, having finally played with the new Aragorn, I think FFG absolutely nailed designing his character. He's still 12 threat and all, but his ability opens up some completely new game styles reducing the emphasis on threat control through Galadhrim's Greeting or Elrond's Counsel. I'm really impressed with the simplicity of the concept, and the glorious possibilities it opens up.\n\n\n\nYes, they did a great job with Aragorn. And he also helps to use tactics heroes like Boromir or Gimli, because his ability reduces the risk of running out of threat to a minimum. Playing TWitW with these two is insane!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66250-tactics-or-getting-the-short-end-of-the-stick/?do=findComment&comment=649458","commentId":649458,"userName":"gatharion","timestamp":1340638844,"content":"leptokurt said:\n\ngatharion said:\n\n \n\n There's also a whole thread about how powerful and effective the combo of Elladan and Elrohir is. One of which is a tactics hero.\n\n \n\nI'm just going to have to agree to disagree with those saying a deck is weaker just for having Tactics in it. I've kicked far too many encounter decks in their metaphorical rear with my dwarves and/or eagles to buy that line of reasoning. \n\n \n\n \n\nThat's not exactly what I was saying. I was talking about tactics-driven decks, which are decks with more than one tactics ally. However, when I find myself using tactics I do this mainly for using the hero's ability (Elladan, Thalin, Boromir), but not for the tactics cards in my hand. Usually I put only a dozen of them in my deck. Tactics still can't hold the ground on its own. In the beginning, each one of us tried to use the core set's tactics mono-sphere deck against Passage through Mirwkood anf failed. And each time we saw a beginner doing this, we kept saying \"wait until there are more and better cards out there\". And now, after the second cycle is almost finished, we're still waiting for that to happen.\n\n\n\nTitan was saying that any Tactics at all made your deck weaker."}]}