{"url":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/","title":"Elladan and Elrohir","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647273","commentId":647273,"userName":"lleimmoen","timestamp":1340258360,"content":"I am waiting till the cycle is over to have a new article ready but I just wanted to share a few thoughts about the Sons of Elrond.\n\nInitially I was pretty disappointed but I grew to like them of course (after having made much effort to deckbuild around them).\n\nWhat I find interesting is how different their effects can be. I mean they look similar on paper but in practice I tend to think Elrohir's is much more useful, especially in conjunction with Arwen. Of course you still have to overcome some terrible shadow lurking but Elrohir really is a wonderful defender. It is a very satisfactory feeling to block so many enemies without being hit. And to do so against a Troll without Protector or Warning (just with the help of his Sister, or a mere Blade Mastery) is great. And when I finally succeeded (upto a point) in making a good deck around the Brothres, I tried to go as easy on Leadership cards (and their cost) as possible just to be ready to do more defending on an average round without the need to put any resource acceleration on Elrohir. For the ability to ready is good even when he doesn't need to defend twice, just to hit back at the enemy.\n\nWell, Elladan isn't that flexible. So when I need to quest with either of them, he's always the one. But then again, when I have a Courage at hand, I often play it on Elladan, so that he quests and is ready to deal blows. Also, Elladan is the one with the card synergies of the likes of Rivendell Blade, Bow but even cards like Quick Strike. Of course Elrohir can make use of the Signals but I really find the Warning not a good choice to fill a valuable card slot.\n\nAs for the art, I think Elrohir looks much cooler.\n\nAs a subplot to this thread, I like how the Watcher of the Bruinen and Trollshaw Scout are made in a similar way to the Brothers. Not that I would probably play them in the same deck but they resemble the more powerful heroes in their opposing abilities. And contradictory to the above, from the two allies I much prefer the attacker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647284","commentId":647284,"userName":"Glaurung","timestamp":1340260529,"content":"lleimmoen said:\n\nI am waiting till the cycle is over to have a new article ready but I just wanted to share a few thoughts about the Sons of Elrond.\n\nInitially I was pretty disappointed but I grew to like them of course (after having made much effort to deckbuild around them).\n\nWhat I find interesting is how different their effects can be. I mean they look similar on paper but in practice I tend to think Elrohir's is much more useful, especially in conjunction with Arwen. Of course you still have to overcome some terrible shadow lurking but Elrohir really is a wonderful defender. It is a very satisfactory feeling to block so many enemies without being hit. And to do so against a Troll without Protector or Warning (just with the help of his Sister, or a mere Blade Mastery) is great. And when I finally succeeded (upto a point) in making a good deck around the Brothres, I tried to go as easy on Leadership cards (and their cost) as possible just to be ready to do more defending on an average round without the need to put any resource acceleration on Elrohir. For the ability to ready is good even when he doesn't need to defend twice, just to hit back at the enemy.\n\nWell, Elladan isn't that flexible. So when I need to quest with either of them, he's always the one. But then again, when I have a Courage at hand, I often play it on Elladan, so that he quests and is ready to deal blows. Also, Elladan is the one with the card synergies of the likes of Rivendell Blade, Bow but even cards like Quick Strike. Of course Elrohir can make use of the Signals but I really find the Warning not a good choice to fill a valuable card slot.\n\nAs for the art, I think Elrohir looks much cooler.\n\nAs a subplot to this thread, I like how the Watcher of the Bruinen and Trollshaw Scout are made in a similar way to the Brothers. Not that I would probably play them in the same deck but they resemble the more powerful heroes in their opposing abilities. And contradictory to the above, from the two allies I much prefer the attacker.\n\n\n\nYes they are quite cool. I made the deck with them and have some good results with in but…….. the big problem of brothers is: If one is dead another one from this point is almost useless cose lose all his benefit. And this is deadly a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647362","commentId":647362,"userName":"Bullroarer Took","timestamp":1340275037,"content":" One major reason I like playing with the Ninja Twins is that they are so good at what they do: defending and attacking.  Elrohir is a little better because after the last defense he can ready and then get in one attack, but if there are no enemies in the staging area you can quest with Elladan for 2 WP which isn't all bad.  Also, don't forget that Elladan can remove a card like Wrapped! after finishing all of his attacks.  I try to get a Song of Wisdom and a Burning Brand on Elrohir, along with Arwen in play.  For Elladan a Rivendell Blade (or two) and a Dunedain Mark (or two).\n\nThis is a personal thing, but one of the niggles I have about the game is that it doesn't really reward heroism as much as it rewards sacrifice - by your allies!  I recently took the twins and Loragorn up against Carrock and didn't lose a single ally.  When I was ready to face the trolls I had Loragorn drop our threat back to the starting level (32) and took on the trolls two by two.  Aided by Feints and Unseen Strikes it was over quickly although the Warden of Healing used a lot of bandages.  Think about it for a second: shouldn't your score be better if Grimbeorn doesn't die compared to if he does?\n\nIt probably won't happen, but I think there should be some type of reward for not throwing your allies into the proverbial Mt. Doom.  Maybe the scoring system could be adjusted so that 5 points are added for each ally lost.  I know that runs counter to cards like Horn of Gondor and Valiant Sacrifice.  I haven't really thought it through very much because it seems like throwing allies away is so deeply ingrained into the game and that such an adjustment could never work, but something like this could actually help Tactics when (!) a tournament scoring system is put into place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647375","commentId":647375,"userName":"Mattr0polis","timestamp":1340276399,"content":"Bullroarer Took said:\n\nIt probably won't happen, but I think there should be some type of reward for not throwing your allies into the proverbial Mt. Doom.  Maybe the scoring system could be adjusted so that 5 points are added for each ally lost.  I know that runs counter to cards like Horn of Gondor and Valiant Sacrifice.  I haven't really thought it through very much because it seems like throwing allies away is so deeply ingrained into the game and that such an adjustment could never work, but something like this could actually help Tactics when (!) a tournament scoring system is put into place.\n\n\n\nOr hurt Tactics because cards like Horn of Gondor and Eagles of Misty Mountains are two of Tactics' best strategies.\n\nAnd Gandalf would suck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647377","commentId":647377,"userName":"lleimmoen","timestamp":1340276859,"content":"I don't like to sacrifice allies. I rarely do even if it indeed is not rewarded by scoring that you kept your characters alive.\n\nAs I said elsewhere I would like more Victory Points - to award Tactics, for instance. Also, objectives, like Grimbeorn, could have them two and you would score them if they were under your control at the end of the game, for instance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647391","commentId":647391,"userName":"richsabre","timestamp":1340278132,"content":"i have made two decks with the brothers- one with eowyn, the basic strategy was that the brothers dealt with attacking and defending and i let eowyn deal with questing\n\nthe other was lore aragorn, but i wasnt really feeling it- mainly becuase it involves tactics without spirit which i find hard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647395","commentId":647395,"userName":"Captain Poe","timestamp":1340279243,"content":"I want to play these guys. I like them, but can't seem to figure out a deck I like with them. Not sure if I should play secrecy or not. Its rough, since they seem like they should play nicely with secrecy;  they can fill in the role of multiple blockers/attackers, and could really put resourceful to good use to do so. But I've yet to pull it off. The starting threat means you'd have to really get a song of travel out fast, and then also have access to threat reduction .  That becomes difficult, because right now, the only reliable way to get a song of travel out is through Lore cards, which… they can't access without a song of wisdom. I guess you could run them with theodred, but then you're basically crossing Secrecy off as an option, and you're stuck with crappy questing options, as you're restricted to Tactics/Leadership heroes, unless you again want to go with songs, which again are hard to pull off well with that card combo.\n\nYou could stick with loreagorn… which is probably how i'll end up playing this, but that seems like it lacks the resources to really get consistent use from the twins special abilities.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647405","commentId":647405,"userName":"lleimmoen","timestamp":1340280297,"content":"I've never played them solo. I will have to try that out soon. The supporting deck which I run has Dúnhere and is much fun to play. But it has little willpower so the other deck has to do the majority of questing. But as a second deck, for fighting purposes, this is a lot of fun. And it has an easy access to Elrond's Counsel to keep the threat low (together with Wandering Took) and allow for frequent Quick and Unseen Strike."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647567","commentId":647567,"userName":"Beano","timestamp":1340301008,"content":"I also struggle getting them to make the cut. Part of the problem is that Leadership and Tactics are the weakest two spheres, so it is rough starting a deck with both represented. And then they are resource hungry to be used properly so that is an added restriction off of the bat - especially since threodred and gloin are a lot harder to fit in - and you can't get in two spirit heroes for easy access to Ziggy/Gazer. Elrohir is by far the best of the pair though. In fact I prefer the rivendell blade on him since I often need Elladan available for questing - and Elrohir can defend and attack one enemy.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647712","commentId":647712,"userName":"monkeyrama","timestamp":1340339562,"content":"I ran the twins with Frodo for a while, using recurring Elrond's Counsel to drop threat, and the obvious resource engine (SoG), but mostly running a Spirit deck. I thought they were excellent, especially once even slightly buffed in any way, because they have such stupidly good stats. I also liked the in-built action advantage they bring. Totally agree that Elrohir is the better bro though, as he is a stupidly good hero to have hanging back from questing in case of enemies in solo play. Defends well, and with a Rivendell Blade, can cut down a lot of enemies pretty easy. What I enjoyed most about them is that I find them really fun to play, because they're dynamic in how they can act, but not border-line (or depending on opinion, over the border) broken like Beravor and the new Glorfindel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647777","commentId":647777,"userName":"gatharion","timestamp":1340356147,"content":" Yeah, they're really good. Especially for solo play where you're more likely to have an action deficit.\n\nI made a Rohan & Eagles deck with Eowyn, Elladan, and Elrohir and it was able to pretty easily defeat almost every quest that had come out by that point. I definitely went light on the Leadership cards as Elrohir was the brother most likely to spend his tokens for his special ability.\n\n \n\nOnce I get the new Glorfindel, I'll need to make a Noldor deck. And I'll need to sprinkle some Lore in there so Glorfindel can get Asfalth anf Elrohir can get a Burning Brand, because that sounds amazing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66281-elladan-and-elrohir/?do=findComment&comment=647824","commentId":647824,"userName":"lleimmoen","timestamp":1340363371,"content":"Yeah, I was thinking right away about the Noldor trio. Asfaloth is really what bothers me. I don't have a good experience with cards from different spheres, especially if they're Lore and I cannot use the Minstrel nor many of Lore drawing cards."}]}