{"url":"https://community.fantasyflightgames.com/topic/66373-dunhere-is-done-here/","title":"Dunhere is done here!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66373-dunhere-is-done-here/?do=findComment&comment=648026","commentId":648026,"userName":"Boris_the_Dwarf","timestamp":1340379904,"content":" Played four games with the new Glorifindel/Azaloth/Light of Valinor combo, slotting him into the hero position next to Eowyn and Bifur. After the first game I took out Light and played 3 more times. My threat got up to 30 once and then went all the way back down to 16. Dealing with enemies in the staging area that couldn't be pulled down was a little tougher and the games took a little longer than they did with Dunhere, but overall I felt far more comfortable about my game position from turn to turn. A starting threat of 21 and an attacker that can cut through enemies Dunhere cannot (unless they are in the staging area) coupled with being able to quest for 7 on turns where I know I won't be facing any serious threats was fantastic. In a 2 player game where my partner brings Legolas with the Tactics blade that reduces defense by 2, I can't see how we will lose ever again - unless we just have a run of bad luck or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66373-dunhere-is-done-here/?do=findComment&comment=648035","commentId":648035,"userName":"gatharion","timestamp":1340380428,"content":"Boris_the_Dwarf said:\n\n an attacker that can cut through enemies Dunhere cannot (unless they are in the staging area) \n\n\n\nTHAT is why Dunhere isn't worthless. He can do something that NO other hero in the game can.\n\nThis does not in any way mean that he's not more generally useful than the new Glorfindel. Not  even close. But sometimes it's fun or even really useful to be able to take advantage of Dunhere's unique ability. *cough*Hummerhorns*cough*goblinsniper*cough*\n\n \n\nPlus Dunhere is Rohan, hence he'll go in my Rohan decks and Glorfindel will not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66373-dunhere-is-done-here/?do=findComment&comment=648049","commentId":648049,"userName":"lleimmoen","timestamp":1340381616,"content":"And Glorfindel makes Dúnhere better in a way as you can start with a much lower threat. But the questing may then become an issue, yes you can bring another Spirit quester but then you won't have any easy access to cards that boost Dúnhere's attack.\n\nAlso worth noting perhaps that if you swtiched Éowyn for Frodo, you'd be starting in secrecy. And if for nothing else, Resourceful would be a very nice card to have (and play for 1) in the beginning."}]}