{"url":"https://community.fantasyflightgames.com/topic/66408-a-formula-i-made-for-you-to-work-out-card-draw-chances/","title":"a formula i made for you to work out card draw chances","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66408-a-formula-i-made-for-you-to-work-out-card-draw-chances/?do=findComment&comment=648319","commentId":648319,"userName":"richsabre","timestamp":1340441578,"content":"having to work with equations every day through my studies i thought i would have a go at creating a simple formula to work out the chances of drawing various cards as an ONGOING process- what i mean by this will be explained below, as it differs from simply saying you have a 3/50 = 6% chance of drawing a certain card with 3 copies in a deck of 50…………….\n\ni know alot of you will already know this but i just thought id share it and someone may find it useful………also im working on how to include the mulligan it it\n\n \n\nso i know that basically speaking chance is usually    AMOUNT OF COPIES OF DESIRED CARD\n                                                                                               ___________________________________\n\n                                                                                                         AMOUNT OF CARDS IN DECK\n\nso if i had 3 gandalfs in a deck of 50 cards it is      3        which = 6%\n                                                                                         __\n                                                                                         50\n\nand if we draw 6 cards in our opening hand it is          3                which = 36%\n                                                                                               __     X 6\n                                                                                               50\n\nhowever the problem with this is that it doesnt address the fact that after each draw you lose 1 card from your deck and you also may draw a gandalf- taking these into consideration i came up with this:\n\n          P- ®\nN = _______\n       Q - (S+T)\n\nN = the chance we are looking for\nP = the number of copies of the desired card in your start hand\nR = the number of that specific card that you have actually drawn\nQ = the number of cards in your start deck\nS = the number of cards in your hand\nT = the number of cards in the discard pile\n\nso in other words you take away R from P to get the number of copies left to draw, and you take away S and T from Q to find the number of cards actually left in your deck…..using an example\n\nyou have 3 gandalfs at the start of the hand draw- the chances of drawing it are    3 - (0)\n                                                                                                                                                  _____         = 3 over 50 = 6% as we already know\n                                                                                                                                                 50 - (0+0)\n\nnow the next card you draw (assuming you didnt draw a gandalf first) is         3 - (0)\n                                                                                                                                       ______    = 3 over 49 = 6.1% (to 2 sig.fig)\n                                                                                                                                       50-(1+0)\n\n \n\nnow assume you just drew a gandalf at the 2nd draw, the 3rd draw is now           3 - (1)\n\n                                                                                                                                              _______          = 2 over 48 = 4.2%\n                                                                                                                                               50 - (2+0)\n\n \n\nanother simplified example could be you have a deck of 10 cards with 3 fast hitches in, first draw you have  3 - (0)\n\n                                                                                                                                                                                     _____        = 30%\n\n                                                                                                                                                                                      10 - (0+0)\n\nthen assume you draw a fast hitch, now the 2nd draw is  3 - (1)\n\n                                                                                                       ____               = 2/9 = 22%  \n\n                                                                                                      10 - (1+0)\n\nthen assume you get to the point where you have drawn 5 cards, and are about to draw the 6th - you have two fast hitches in your hand  \n\n          3 - (2)\n\n         _______    =   1/5  =20%  \n\n         10 - (5+0)               \n\n \n\nso as you can see the formula takes into account not only how many times you draw, but also whether you draw your card\nso hopefully this all correctly takes into account the variable and on going process of card draw. it (with some modification i think) could be used for drawing cards once the game has properly started- you would need to keep track of your cards in the discard pile as well as your hand (S+T)\n\nanyways,let me know your thoughts and i hope someone may find this useful\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66408-a-formula-i-made-for-you-to-work-out-card-draw-chances/?do=findComment&comment=648325","commentId":648325,"userName":"jjeagle","timestamp":1340442699,"content":"I'm not competent to judge your maths (my brother and playing partner is a mathematician and he does that part of the brainwork for us), but I've found a few deck calculating tools online which I think are helpful.\n\nFor example, this one [http://www.implair.com/deckulator/mana.html], although it uses MTG vocabulary, can perform the sort of calculations you are talking about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66408-a-formula-i-made-for-you-to-work-out-card-draw-chances/?do=findComment&comment=648326","commentId":648326,"userName":"richsabre","timestamp":1340442864,"content":"while that is probably more efficient and reliable- i dont know what 'mana' means so i found that bit confusing, but i guess most people understand mtg lingo\n\npersonally i find doing long hand maths easier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66408-a-formula-i-made-for-you-to-work-out-card-draw-chances/?do=findComment&comment=648329","commentId":648329,"userName":"jjeagle","timestamp":1340443174,"content":"The calculator listed as \"Example 2\" on the link I gave will give the probabilities of drawing X copies of a card you run Y of, in a 50 (or whatever) sized deck, in the first Z cards drawn - which I think is the most important number to be aware of in deck construction.\n\nIt's quite a bit trickier to factor the mulligan into these calculations though.\n\nThis article [http://www.kibble.net/magic/magic10.php] breaks down the maths involved."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66408-a-formula-i-made-for-you-to-work-out-card-draw-chances/?do=findComment&comment=648334","commentId":648334,"userName":"richsabre","timestamp":1340443651,"content":"oh well if no one finds it useful at least it filled in 5 minutes of my time, and i was aware of being able to google a better verison of it (which i am still working on), but if we let google do all our work wheres the fun in that? haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66408-a-formula-i-made-for-you-to-work-out-card-draw-chances/?do=findComment&comment=648380","commentId":648380,"userName":"lleimmoen","timestamp":1340447499,"content":"Thanks for the post!"}]}