{"url":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/","title":"Passage through Mirkwood","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=648575","commentId":648575,"userName":"schmoo34","timestamp":1340488887,"content":"My question is in regards to the Ungoliath Spawn (Not sure I spelled that correctly).  When I get the 3B card which states that the quest is not completed until the spawn is found and defeated;\n\n \n\nTwo questions.\n\n \n\n1) If I had already found and defeated him while on quest 2B or 1B, does that count?\n\n \n\n2) If the spawn was in the discard pile due to a shadow effect, must I exhaust the remainder of the active encounter deck before the spawn can be reshuffled back into the encounter deck or can I immediately shuffle him into the deck?  It seems rather silly to have to exhaust the encounter deck just to reshuffle him in, but from a purist perspective, this seems to be the only choice.  I was hoping there was a FAQ or generally accepted rule others play by."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=648578","commentId":648578,"userName":"schmoo34","timestamp":1340489669,"content":"I think I answered one of my questions….the 3B quest allows each player to pick a spider of their choice…so obvioiusly, if the spawn was not found as of yet, or was in the discard pile due to being a shadow, the player can just pick the spawn and, voila, no need to exhaust the encounter deck  etc. etc.\n\n \n\nSo that leaves only one question…if the spawn was defeated in 1B or 2B, do you automatically win in 3B?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=648681","commentId":648681,"userName":"richsabre","timestamp":1340518467,"content":"nope sorry you have to kill her again\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=650248","commentId":650248,"userName":"Carbolicious","timestamp":1340746456,"content":"I have a question about this quest.  Why are there two #3 cards, and which do we play first?  I guess that's two questions.  Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=650286","commentId":650286,"userName":"starhawk77","timestamp":1340755565,"content":"Once you complete Stage 2B, you randomly select one of the Stage 3 cards. Basically, the scenario can have two different endings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=650791","commentId":650791,"userName":"Carbolicious","timestamp":1340833153,"content":"Interesting.  I never saw it mentioned in the rule book.  I'm finding a lot of stuff that isn't really explained very well.  I guess that's why this forum exists."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=650798","commentId":650798,"userName":"Angus Lee","timestamp":1340834397,"content":"It is instructed in the quest card 2B, if you read it carefully, you don't have to look for it in the rulebook."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=740384","commentId":740384,"userName":"rfox01","timestamp":1356829581,"content":"I know I'm replying to this thread late so it's probably dead, but I'm starting this game new and I'm scanning these forums to pick up answers to my questions and thought I'd comment to the two Stage 3 cards in Passage through Mirkwood. I too was confused at first. Since I didn't want to spoil the game by reading through the cards first and side 3A say the same thing on both cards, I thought I got a duplicate until I flipped them over to see that they were different and guessed that maybe they are alternate endings. It wasn't until I actually go to Stage 2 during the gameplay that I read the text to confirm my suspicion.\n\nSince this is the first quest new players play, and the rulebook does specificically tell you to start with this quest, and for people like me that don't want to read through all the cards to spoil the game, the rulebook could have included a simple statement to assure the new player that, yes, there are two Stage 3 cards in this quest.\n\nEDIT: I guess the rulebook does tell you there are 4 cards in the first quest. But it says Quest cards 120-123, whereas my Passage of Mirkwood quests cards are numbered 119, 120, ???, ???."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=742748","commentId":742748,"userName":"Laco","timestamp":1357302600,"content":"hi. I have a question. quest card core 121. A Chosen Path - \"Don't Leave the Path!\". when i search the encounter deck and discard pile for 1 Spider card and Ungoliant's Spawn i must shuffle encounter deck and/or discard pile? thx"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=742757","commentId":742757,"userName":"CJMatos","timestamp":1357303934,"content":"Laco said:\n\nhi. I have a question. quest card core 121. A Chosen Path - \"Don't Leave the Path!\". when i search the encounter deck and discard pile for 1 Spider card and Ungoliant's Spawn i must shuffle encounter deck and/or discard pile? thx\n\n\n\n \n\nYou only shuffle encounter deck. Discard pile is never shuffled in itself.\n\n \n\nIf you are playing solo, you only reveal 1 spider card…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=742888","commentId":742888,"userName":"Laco","timestamp":1357318702,"content":"thank you for your answer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=745239","commentId":745239,"userName":"Gutzwald","timestamp":1357742304,"content":"Lots of good information.  But I didn't see this covered.\n\n \n\nWhat if boss spider (Ungol***) is already on the table when the quest card is revealed that she has to be Found and killed.\n\n \n\nWhen playing the Lore deck, I have used the Forest Snare Attachment card to make it so she cannot attack.  Then hit her for a few points as the occassion allows.  Wait for the Quest to advance, and then kill her off.\n\n \n\nAre we really expected to kill her, exhaust the encounter deck, shuffle her back in anc continue.  It seems that you are almost guaranteed to lose the game since the Threat dial is advanced at least one each and every turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=745345","commentId":745345,"userName":"CJMatos","timestamp":1357753429,"content":"No. If Ungoliant Spider is in play (staging area or engaged) when you revel the quest card 3b Don't Leave the Path, you need to search for another spider enemy and kill only Ungoliant to win the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=769725","commentId":769725,"userName":"SOGra","timestamp":1362354710,"content":"The one 3B quest card says the quest is not complete until you kill Ungoliath Spawn. \n\nWe have been playing under the assumption that there is only one Ungoliath Spawn. And if it was killed earlier, you have already fulfilled 3B to complete the quest. We assumed it is a completely unique Boss, and there are not two to defeat. If already defeated, you win, (after you kill a spider you must find in the deck to finish the quest.\n\nIf you kill Ungloiath Spawn and your fork in the road is more questing (10 progress tokens needed) then the killing of Ungoliath Spawn is just an incidental accomplishment along the way to that particular quests end. \n\nThat was our interpretation.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=769740","commentId":769740,"userName":"Alex de la Fang","timestamp":1362358330,"content":"Your interpretation is wrong, sorry. \n\nThere is a lot of Ungoliath's Spawns (one of them is living near Minas Morgul), so you have to find and kill one more. You have to add one Spider from encounter deck or discard, so there is no problem to find it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=769799","commentId":769799,"userName":"GrandSpleen","timestamp":1362373300,"content":"There's a parallel to this situation in The Redhorn Gate adventure pack.  There, the climax of the quest is when players reach the summit of Caradhras, a location card.  Caradhras is on the table throughout the whole game, but you aren't allowed to travel there until the 3rd stage of the quest.  Clever players, however, can remove it from the game before you're actually intended to.  \n\nWhen this happened, people were asking if you had to RETURN to Caradhras when you got to the 3rd stage of the quest.  This is similar to having to kill Ungoliant's Spawn a second time in the Passage through Mirkwood quest.  People were saying the same things: doesn't make sense, isn't fair, etc.  Nonetheless, the developers clarified in an older release of the official FAQ: you do indeed have to return to Caradhras on stage 3B even if you have already placed it in your victory display.  \n\nThe lesson here is that you have to follow card text to the letter.  The game has no 'memory,' for better or for worse.  The victory display is the closest thing the game has to a memory, but even cards in that display can be pulled back out.  To satisfy the conditions on quest card 3B in PtM, you have to defeat Ungoliant's Spawn while 3B is the active quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=941979","commentId":941979,"userName":"Smiticus","timestamp":1388507493,"content":"I just played my first two games, and this was one of my questions. So thank you for the responses!\n\n \n\nHere is my summary for the \"Don't Leave the Path!\" quest stage (I hope I got this right!):\n\n * If Ungoliant's Spawn is in play (staged or engaged), then search the encounter deck or discard pile for a different spider and put it in the staging area\n * If Ungoliant's Spawn is not in play (in deck or discard pile), then search the encounter deck or discard pile for Ungoliant's Spawn and put it in the staging area\n * Live dangerously :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png] :  If U.S. is not in play, stage a different spider and wait for U.S. to get revealed in a later round"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=942389","commentId":942389,"userName":"GrandSpleen","timestamp":1388561459,"content":"Yep, you've got it right.  Typically if US is revealed before stage 3, it is a good idea to keep it alive until you get to 3.  Put a bunch of damage on to it, but leave it alive (if your deck can handle having him around for awhile) so that once you get to 3, all you have to do is breathe on him to win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=1240151","commentId":1240151,"userName":"fredericklaiwl","timestamp":1409479055,"content":"When I search the deck or discard pile for Ungolian Spwan, do I need to reshuffle the deck after I place U.S. in the staging area?  Yes, I know the rule does not ask me to reshuffle the deck, but now I can see the order of the cards in the deck.  This can give me some advantages (e.g, I can predict some shadow effects).  So, do I have to reshuffle the deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=1240262","commentId":1240262,"userName":"Laco","timestamp":1409485379,"content":"You always have to shuffle the encounter deck when looking at cards and you don't shuffle encounter discard pile. You can't change the order of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=1240335","commentId":1240335,"userName":"GrandSpleen","timestamp":1409489258,"content":"Laco's correct, and the answer comes from the official FAQ:\n\n \n\n(1.21) Search Effects\nWhenever a player searches through a deck, that player\nshuffles the deck after searching it unless a card effect\nsays otherwise. Players do not shuffle or change the\norder of a discard pile after searching it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=1240338","commentId":1240338,"userName":"jennifer255","timestamp":1409489499,"content":"We are the best producers of high QUALITY fake and Real diplomatic documents. With over a millions of our documents circulating around the world.We produce documents of all countries and all sorts and types of documents. We offer only original high-quality passports, driver’s licenses, birth certificates,Marriage certificate,stamps, visas,SSN,universities diploma,ID cards our fake IDs include all security features such as genuine holograms, ultraviolet watermarks, intaglio printing, special paper, fluorescent dyes, RFID chips, bar-codes corresponding to your details and more. and same with all other documents for a number of countries.\nWE ALSO REVOKE ALL SUSPENDED LICENSE AND PASSPORT ETC.\nDO NOT HESITATE TO CONTACT U.S. BY EMAIL FOR MORE INFORMATION AND TO PLACE YOUR ORDERS FOR YOUR VARIOUS PASSPORTS , VISAS , IDENTITY CARDS DRIVER'S LICENSE , BIRTH AND MANY OTHER DOCUMENTS AT email;(jinnifer.morrison@gmail.com)\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=1242809","commentId":1242809,"userName":"Cobramech","timestamp":1409620962,"content":"I have a question, while playing passage through mirkwood I encountered a card that attached to one of my heros that said he could not refresh during the refresh step. But I drew a card that said exhaust 1 hero card to ready another hero, which takes presidence? The attachment card or the event card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=1243208","commentId":1243208,"userName":"Jban","timestamp":1409640914,"content":"Cobramech, first it might be more convenient to start your own topic for these questions instead of posting them at end of an allready existing one.\n\n \n\nBut let me answer it:\n\nYou refer To the next card:\n\nffg_caught-in-a-web-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_caught-in-a-web-core.jpg]\n\n \n\nThe card only states that your hero doesn't ready during refresh phase. So all other readying effects can still be used on him. I'm thinking about \"Unexpected Courage\" or \"Common Cause\". \n\nHope this answered your question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66440-passage-through-mirkwood/?do=findComment&comment=1243220","commentId":1243220,"userName":"GrandSpleen","timestamp":1409642306,"content":"Am I the only one here who suddenly has a desire to acquire a high quality fake diplomatic document?"}]}