{"url":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/","title":"Multiplayer is much easier than solo?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648741","commentId":648741,"userName":"MyNeighbourTrololo","timestamp":1340526771,"content":"What I mean is I lost most of my solo games. I lost two times before I was able to beat first scenario in solo, I lost many times and never beated second scenario and I didn't even attempted to beat third because I'm pretty sure I will fail.\n\nBut every time I played with friend - we won.\n\nWe won first scenario together like no a big deal, we won secon scenario instantly. Today we tried to beat 3rd scenario with 3 players and got it from our first attempt. Are we just lucky or is it really that easy?\n\nFor clarification, I only have a core set and we only used starting decks, no deckbuilding or stuff. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648750","commentId":648750,"userName":"richsabre","timestamp":1340528105,"content":"dont worry- what you feel has been felt by all of us at some point…..\n\nsome quests yes, some no- generally it has been known from the start this game is harder solo (and please people, lets not get into the arguement of whether this game is designed for solo players or not- its been argued to death by now)\n\nthe bottom line is that with the increasing card pool solo play is much much easier than when core was released\n\nit all comes down to scaling - some quests scale better from 1 - 2 players better than others, some like return to mirkwood make it nigh on impossible for solo play\n\nbut you are making it harder for youself- i would urge you to start deck building as this will increase your win rate\n\nthe quest packs if you buy them will vary as ive said, but all but return to mirkwood are fine for solo play, and most are actually easier than journey down the anduin, and are certainly all easier than dol guldur\n\nthe main reason you win with multi player is that you are using single sphere decks, therefore in multiplay you have multi spheres but in solo play you have single spheres which are hard to use, especially with a low card pool\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648751","commentId":648751,"userName":"MyNeighbourTrololo","timestamp":1340528291,"content":"Can there be a challenge in multiplayer using only core set? It's still weeks until da expansions arrive. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648753","commentId":648753,"userName":"richsabre","timestamp":1340528450,"content":"i certainly dont want to de value your wins but it shouldnt be that easy to win the last scenario especially- make sure you are playing correctly- for instance are you drawing extra cards in the staging step to scale the quest? if you find you definatly are then i would say you have got some nice luck going  for you happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\ntry the 2nd and 3rd again and see if your luck holds"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648763","commentId":648763,"userName":"MyNeighbourTrololo","timestamp":1340529729,"content":"What do you mean?\n\nI draw one encounter card per player during the quest stage step. So this game it was 3 encounter cards per quest phase.\n\nI ran core Spirit deck, my friends ran core Lore and Leadship deck.\n\nGlorfindel was imprisoned.\n\nLeadrship player attached Steward of Gondor to Beravor of the Lore player, as he was down one hero.\n\nI claimed Gandalf's map and attached it to Eowyn, as she never attacks or defends anyway.\n\nLater on, Lore player attached Self Preservation to Gloin, and Gloin claimed the Shadow Key, effectively generating 1 additional resource during every refresh phase at no risk. We restrained from claiming torch until it was very end of second part of the quest. And then we made all-out move, finishing third stage of the quest in one turn.\n\nI, as a Spirit player, tried to keep everyone at low threat to prevent Nazgul descending. We killed Nazgul by summoning Gandalf twice(8 damage) and then delivering finishing blow with Dunhere, affected by For Gondor! \n\nI also explored all dangerous locations with a Northern tracker, so we can discard them from play without taking their negative \"travel\" effects, like discarding 2 cards from hand at random, exhausting one hero of each player or placing one card from your deck infront of you as an orc with 1 at/ 1 def/ 1hp.\n\nI also killed Hummerhorns and one Dol Guldur Beastmaster with Dunhere at the first turns of the game while threat was low enough for them to not descend.\n\nUngoliant's Spawn(by the way, can someone tell me, please, what's \"Ungoliant\"?) and Chieftan Ufthak got snared by Forest Snare the next planning phase after their descent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648774","commentId":648774,"userName":"lleimmoen","timestamp":1340530642,"content":"In the core set? Yes! All three are probably easier coop. Anduin may get easier (in a way) to execute solo if you play the right deck (ie low starting threat and Dúnhere dealing with the staging area). But Dol Guldur gets much easier with every player. Solo is madness (I say), 2 player is about right for DL7, four player is surelly easier than Anduin with four.\n\nThe matter is different in other scenarios.\n\nAlso, the pre-constructed decks are bad for solo but can work to some extent in coop."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648798","commentId":648798,"userName":"richsabre","timestamp":1340533725,"content":"no that seems fine- i was just checking there wasnt anything mistakes as ive seen this often before, where players have missed a rule or two and its made it easier, but i dont think this is the case here -\n\ni just think it comes down to core set (especially dol guldur) scaling badly\n\nthe packs get better and will offer a challenge, i guess its just a case of waiting\n\nUngoliant was a massive spider that dwelt in the first age of middle earth and is featured in the silmarillion- shelob from the return of the king was but a spawn of her, as were the many spiders in mirkwood- so ungoliants spawn is just another shelob really\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648803","commentId":648803,"userName":"MyNeighbourTrololo","timestamp":1340534334,"content":"I'm now thinking about the Nightmare level of challenge, offered in the core rulebook.\n\nBut I have a big doubts about our ability to beat it. Starting with the hight threat at the Anduin is just mad, all 35+ treacheries hit you and troll descends immediately, crhushing your already wounded heroes… "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648809","commentId":648809,"userName":"lleimmoen","timestamp":1340536046,"content":"richsabre said:\n\n \n\nUngoliant was a massive spider that dwelt in the first age of middle earth and is featured in the silmarillion- shelob from the return of the king was but a spawn of her, as were the many spiders in mirkwood- so ungoliants spawn is just another shelob really\n\nrich\n\n \n\n \n\nWhilst you're right, of course, you got a bit \"Jacksoned\" there, as Shelob actually appears in the Two Towers. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648811","commentId":648811,"userName":"richsabre","timestamp":1340536281,"content":"lleimmoen said:\n\nrichsabre said:\n\n \n\nUngoliant was a massive spider that dwelt in the first age of middle earth and is featured in the silmarillion- shelob from the return of the king was but a spawn of her, as were the many spiders in mirkwood- so ungoliants spawn is just another shelob really\n\nrich\n\n \n\n \n\nWhilst you're right, of course, you got a bit \"Jacksoned\" there, as Shelob actually appears in the Two Towers. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n\n\ncrap- i will now issue myself 50 whip lashes to punish myself- im seriously tired of being mind raped by that film haha…….next ill be saying the elves turned up at helms deep…….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648863","commentId":648863,"userName":"mr.thomasschmidt","timestamp":1340545259,"content":"richsabre said:\n\nlleimmoen said:\n\n \n\nrichsabre said:\n\n \n\nUngoliant was a massive spider that dwelt in the first age of middle earth and is featured in the silmarillion- shelob from the return of the king was but a spawn of her, as were the many spiders in mirkwood- so ungoliants spawn is just another shelob really\n\nrich\n\n \n\n \n\nWhilst you're right, of course, you got a bit \"Jacksoned\" there, as Shelob actually appears in the Two Towers. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\n \n\n \n\ncrap- i will now issue myself 50 whip lashes to punish myself- im seriously tired of being mind raped by that film haha…….next ill be saying the elves turned up at helms deep……..\n\n\n\nI just know I'll be punished one late evening and this thred will explode with answers but here goes. Didn't the elves turn up at Helm Deep?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648868","commentId":648868,"userName":"richsabre","timestamp":1340545619,"content":"no they werent - in the end the orcs attacking helms deep were caught in a trap between gandalf and a thousand footed rohan warriors led by erkenbrand, a charge of cavalry from the fortress itself, and the huorns in the deep behind them….i believe thats all correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648892","commentId":648892,"userName":"lleimmoen","timestamp":1340548027,"content":"I belive it's correct too. But I'm never too sure about details.\n\nIt brings me to a totally different point. It's quite interesting that so far we have only touched Gondor very lightly on synergies, For Gondor! and a few allies that don't quite match together. But have already got 4 biggest characters from the book: Denethor, Boromir, Faramir, Imrahil. All the major ones basically.\n\nAnd that goes quite in contradictory to Rohan where we have got many more cards and allies but are still waiting for Théoden and Éomer, plus the minor book characters like Grimbold or Erkebrand.\n\nI know this is not much of a point but I felt like sharing it anyways. What seems really strange to me is why we got all 4 major Gondorians and none were saved for the inevitable Gondor deluxe expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648904","commentId":648904,"userName":"richsabre","timestamp":1340548865,"content":"i never really thought of it that way but yes i agree- it is strange, perhaps more re-releases come the gondor pack? i hope not, and how can you get a better boromir, his version is great as it is, so if denethor, imrahil is ok, though i dont use him that often, and i guess we shall get faramir as a hero…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=648952","commentId":648952,"userName":"Glaurung","timestamp":1340553450,"content":"Yes this is a biggest problem of this game: even with 2 players game is going to be more  easier. But when you start to play better and make 2 strong decks working with good  synergy  together the game not challenge anymore at all. You will win 8  from 10 games.\n\nOnly Massing in Osgiliath still very hard.\n\nAnother thing  if you wont to make game more difficult play each sphere only once among all players. this also make game more challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=649245","commentId":649245,"userName":"gatharion","timestamp":1340608662,"content":"Yeah, what they've said. The core scenarios really work best as two player games, and that's when their difficulty levels feel the most appropriate. So much of those quests revolve around defeating a single particular foe/obstacle (Ungoliet Spawn, Hill Troll, losing a Hero as prisoner, the Nazgul) that that *single* obstacle becomes less and less of a real danger with more players. I'd put Journey down the Anduin as a diff 7 for solo play and Escape from Dol Goldur as a 9.\n\nI do feel that, in general, all of the subsequent quests have scaled better. A few even get noticeably harder with more players. Hills of Emyn Muil and Dead Marshes for instance, I walloped the heck out of those in my first solo games, but found I'd often get bogged down in multi-player games.\n\n \n\nrichsabre said:\n\ni never really thought of it that way but yes i agree- it is strange, perhaps more re-releases come the gondor pack? i hope not, and how can you get a better boromir, his version is great as it is, so if denethor, imrahil is ok, though i dont use him that often, and i guess we shall get faramir as a hero….\n\n\n\nYeah, it is pretty weird. As soon as we got Boromir I made a \"Gondor Deck\" and it was probably the worst deck I've ever made for this game. sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]\n\n \n\nGondor has some GREAT cards, but there just aren't enough of them and they don't synergize well. Prince Imrahil, for instance has generally been hanging out over in Rohan as he synergizes best with them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=649249","commentId":649249,"userName":"lleimmoen","timestamp":1340609351,"content":"Exactly, Imrahil has been made for Rohan. Horn of Gondor though works well with him (and Rohan or Eagles) but it's not a good solo card, is it?\n\nWe might wait long till we get Gondorian synergies going?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=649844","commentId":649844,"userName":"Budgernaut","timestamp":1340694640,"content":" Yeah, it would have been neat to see Horn of Gondor have the clause, \"If attached hero is Boromir, produce 1 additional resource.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/66460-multiplayer-is-much-easier-than-solo/?do=findComment&comment=650018","commentId":650018,"userName":"gatharion","timestamp":1340714166,"content":"Budgernaut said:\n\n Yeah, it would have been neat to see Horn of Gondor have the clause, \"If attached hero is Boromir, produce 1 additional resource.\"\n\n\n\nI'd have just gone with giving Boromir the Leadership icon."}]}