{"url":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/","title":"Objective Cards…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/?do=findComment&comment=649033","commentId":649033,"userName":"91Vaapad013","timestamp":1340564705,"content":"Is there anyway (other than a card text) to detach an objective card? It seems that in the final scenario of the core set, threats would mount up very quickly (i.e. Dungeon Torch). It would appear to me that the player who has this attached would increase his/her threat by 3 every round. Maybe I am wrong though. Could someone give an example on how it could be detached?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/?do=findComment&comment=649038","commentId":649038,"userName":"muemakan","timestamp":1340566063,"content":" For Escape from DG only Driven by Shadow as a shadow card while defending with the character who has the torch attached works.\n\n Or let the Hero die. No other way.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/?do=findComment&comment=649044","commentId":649044,"userName":"91Vaapad013","timestamp":1340567026,"content":"Okay, that's rough. So a follow-up question: Is there no way to detach \"Gandalf's Map\"? Since the text reads attached character cannot attack or defend. If I am correct, the bearer of that objective can never get rid of it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/?do=findComment&comment=649050","commentId":649050,"userName":"starhawk77","timestamp":1340568333,"content":"Objectives will remain attached unless a card effect specifically detaches them. Like muemakan said, the shadow effect on Driven by Shadow is the only effect in EfDG that discards attachments, and there are situations in which you might use it to detach the Shadow Key or the Dungeon Torch. But the shadow effect only interacts with defending characters, and Gandalf's Map prevents its bearer from attacking or defending. Basically, you're stuck with the Map unless its bearer dies from direct damage (e.g., The Necromancer's Reach) or from undefended attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/?do=findComment&comment=649054","commentId":649054,"userName":"91Vaapad013","timestamp":1340568744,"content":"Wow, that's a tough scenario! We are playing multiplayer, however, and not customizing decks. Only using the preconstructed decks contained in the Core Set. Very challenging.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/?do=findComment&comment=649058","commentId":649058,"userName":"91Vaapad013","timestamp":1340569386,"content":"Sorry for all the questions, but I have another.\n\nIf a Hero HAD one objective (i.e. Gimli bears the Dungeon Torch) and dies. The Torch goes back to the staging area. Now onto 2b, to succesfully quest that stage, you must rescue your Hero and have all 3 objectives. Does it count that Gimli, at one time (1b), had the objective but lost it? Or does someone else have to take possession of it during 2b?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66491-objective-cards%E2%80%A6/?do=findComment&comment=649104","commentId":649104,"userName":"Angus Lee","timestamp":1340582095,"content":"91Vaapad013 said:\n\nSorry for all the questions, but I have another.\n\nIf a Hero HAD one objective (i.e. Gimli bears the Dungeon Torch) and dies. The Torch goes back to the staging area. Now onto 2b, to succesfully quest that stage, you must rescue your Hero and have all 3 objectives. Does it count that Gimli, at one time (1b), had the objective but lost it? Or does someone else have to take possession of it during 2b?\n\n\n\nNo, it does not count, so you have to have another hero to claim it to advance to next level.\n\nBesides, concerning getting rid of the objectives in this scenario, since they have the Restricted keyword, if you can attach two other Restricted attachment to that hero, you can choose to get rid of the objective attachment which you don't need in stage 3B."}]}