{"url":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/","title":"Where&#039;s our news?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=649443","commentId":649443,"userName":"Cunir","timestamp":1340637754,"content":"okay… so its been more than 2 months since we last heard anything about the hobbit expansion, and total silence about the next adventure cycle -- even though we are just a few weeks away from the last chapter of this one coming out\n\ni like reading all those news articles they do. when i think back to the shadows of mirkwood and khazad-dum cycles, i think they trailed as much as 3 or 4 adventure packs in advance before they even had the first one out. but now we are up to the last one and there is still no news!\n\ni guess we are going to have to wait for them to get the hobbit in the shops before we hear about the next cycle. i suppose they are thinking that is going to be their big seller, with the movies coming out, and they dont want to put people off buying it by putting thoughts in their head about the next set.\n\nmaybe they are concentrating on getting star wars out as well.\n\nit would be nice if they teased us with something about the next cycle though. even if it's just a hint"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=649459","commentId":649459,"userName":"lleimmoen","timestamp":1340638955,"content":"Hopefully we get one today. I would welcome some serious spoilers, either of the Shadow and Flame (more probable) or the Hobbit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=649496","commentId":649496,"userName":"Bullroarer Took","timestamp":1340643279,"content":" http://www.fantasyflightgames.com/edge_news.asp?eidn=3374 [http://www.fantasyflightgames.com/edge_news.asp?eidn=3374]\n\n \n\nWell he looks nasty to me!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=649497","commentId":649497,"userName":"richsabre","timestamp":1340643402,"content":"ouch- thats one nasty SOB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=649515","commentId":649515,"userName":"muemakan","timestamp":1340644788,"content":" Meh, just lower your threat to 0 and you´ll be safe.\n\n \n\nAnd Magali again. Nice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659644","commentId":659644,"userName":"Cunir","timestamp":1342496863,"content":"another month gone… and there's still no more news about the hobbit box or the next cycle. anyone else getting worried about the long-term future of this game? We're probably only two weeks away from the last adventure pack now… and still no news! i've actually stopped catching up on the adventure packs now, until i know for sure whether there's going to be another one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659674","commentId":659674,"userName":"richsabre","timestamp":1342502016,"content":"Cunir said:\n\nanother month gone… and there's still no more news about the hobbit box or the next cycle. anyone else getting worried about the long-term future of this game? We're probably only two weeks away from the last adventure pack now… and still no news! i've actually stopped catching up on the adventure packs now, until i know for sure whether there's going to be another one.\n\n\n\nwhen the game first came out the news was like clock work- and good previews, but im not really concerned…..perhaps theyre too busy with getting the hobbit pack together, rather they spent more time getting the packs right than anything else…..having said that it only takes about 10 minutes to type out a quick 800 word news preview and i think its important they keep dropping us juicy news as it keeps the forum going and debate high\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659675","commentId":659675,"userName":"Hannibal_pjv","timestamp":1342502256,"content":"Hard to say. In anyway the new treasure systems needs a lot testing and balancing if I have to gues, so it takes some time do it correctly. Oter thing is that we have a guite a lot cards at this moment, so it is not so big problem if there is some gap between this cycle and the next!\n\nThe LOTR lcg has been guite popular, so I think that there will be more sets coming in the future. Why to kill the milking cow ;-)\n\nIt is much better that they plan carefully what new mechanics they will bring to the game. This is a co-op so there is not so huge need to make a lot of new cards. Even at this moment there are a guite a lot of them. Ofcourse we need to have all the hobbits and so other stuff. And there are a lot of interesting plases to wisit in the Middle Earth so I am allso waiting for any news of where are we going to go next. But it is guite easy to see that the Hobbit: There and back again expansion is guite demanding and it is possible that making it can take some time, that would normally be used to make new cycles. After the Hobit is released, I am guite sure that we will start hearing rumours abot the next expansion set :-)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659692","commentId":659692,"userName":"Budgernaut","timestamp":1342505588,"content":" If you think this game is starved for previews, check out Star Wars: The Card Game. We've only had one update which was to say the game is going back into development. That was in February. I've been checking out a lot of the preview schedules of their games over the past months and it seems that all the games are seeing a drop in previews until about a month or two before release. If the hobbit expansion is coming out close to when The Hobbit hits theaters, I'd say we have a while to go before we see another preview."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659743","commentId":659743,"userName":"lleimmoen","timestamp":1342515356,"content":"Yes, but as Rich says, it is really really easy to make a preview. And it is not like us people here are not their customers. I have spent a lot of money buying their products. Of course, I will buy them anyways even if they don't give me previews every week. It is just nice to treat a customer in a good way.\n\nAnd I think they have in general. I really enjoy the articles, the previews, the way they do it. The last one, with no card preview, was a bit lame in my harsh opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659748","commentId":659748,"userName":"Cunir","timestamp":1342515978,"content":"i actually think they do a huge amount of previews -- because what other kind of games get as many as we do… one preview a week? all you get for computer games is one a month, in the magazines. and we get four a month all containing new information and card pictures. so respect for them for the amount that they do\n\nbut when i look and compare when the previews came out for the core set, the first cycle, the khazad-dum box, the second cycle, and even the hobbit box, they were a LONG way in advance of the release date. and here we are just 2 weeks away from the final adventure and there's not even a hint of what is coming. not a peep. it just makes me think that things are slowing down and there's not much point being a completist and buying up all the boxes now, if the card pool isn't going to grow much bigger than the hobbit boxes.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659820","commentId":659820,"userName":"Narsil0420","timestamp":1342525244,"content":"Cunir said:\n\ni actually think they do a huge amount of previews -- because what other kind of games get as many as we do… one preview a week? all you get for computer games is one a month, in the magazines. and we get four a month all containing new information and card pictures. so respect for them for the amount that they do\n\n\n\n \n\nI totally agree even though I'm frantic with impatience like everyone else :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659883","commentId":659883,"userName":"player2052423","timestamp":1342531898,"content":"The Saga expansion had a due date of 3rd quarter 2012.  I must admit, I expected it to be released at Gencon.  However, with news that Shadow is due \"in a few weeks\" and the Battle of Laketown announced for an event at GenCon, I feel that we will not see it until later in the year. \n\nToo bad, it would have been fun to play it GenCon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=659885","commentId":659885,"userName":"player2052423","timestamp":1342532237,"content":"Budgernaut said:\n\n If you think this game is starved for previews, check out Star Wars: The Card Game. We've only had one update which was to say the game is going back into development. That was in February. I've been checking out a lot of the preview schedules of their games over the past months and it seems that all the games are seeing a drop in previews until about a month or two before release. If the hobbit expansion is coming out close to when The Hobbit hits theaters, I'd say we have a while to go before we see another preview.\n\nI previewed this game at GenCon last year and liked the coop idea.  Thats what drove me to try LOTR.  Who knows what is happening to it now and I wonder if they will have anything happening at GenCon this year.  I see that the X wing game is ready to go but after demoing the game last year and having played the WOTC version (that floped), I not that interested.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=675528","commentId":675528,"userName":"Cunir","timestamp":1345214112,"content":"okay… now i'm getting worried.\n\nstill no news about the next cycle, and dwarrowdelf is totally finished.\n\nand we have had no news at all this week - about anything. i can't even remember the last time that happened.\n\nand the hobbit box is supposed to be released today as well (i can see that it's already on sale and being shipped out at amazon.co.uk) and they haven't even posted any news about that! they haven't even updated the hobbit box info page, to say that it's on sale.\n\ni'm starting to think that this game is slowly winding up. maybe the hobbit boxes are going to be the last big thing, to cash in on the movies, and that will be it.\n\n \n\nand i've just seen it announced in another thread that the new Star Wars game is definitely going to be PvP now. so maybe LOTR's solo play and co-op wasn't as sucessful as we all thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=675543","commentId":675543,"userName":"Cunir","timestamp":1345214856,"content":"I take all that back…. ignore my rant… i've just seen something great on the cardboard of the rings page -- www.facebook.com/CardboardOfTheRings [https://www.facebook.com/CardboardOfTheRings]\n\nIt looks like our new expansion -- the Heirs of Numenor!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66541-wheres-our-news/?do=findComment&comment=675546","commentId":675546,"userName":"John85","timestamp":1345215024,"content":"check the other thread, lots of news; second saga announced (The Hobbit: On the Doorstep), also new cycle and Deluxe Exp. announced, to be set around Gondor, release in January or February after release of Hobbit 2 Exp. Also Battle of Lake-Town will presumably be released POD in the interim…"}]}