{"url":"https://community.fantasyflightgames.com/topic/66585-totally-new-kinds-of-card-that-wed-like-to-see-what-about-stance-cards/","title":"Totally new kinds of card that we&#039;d like to see -- What about stance cards?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66585-totally-new-kinds-of-card-that-wed-like-to-see-what-about-stance-cards/?do=findComment&comment=649876","commentId":649876,"userName":"Cunir","timestamp":1340699385,"content":"now that the game has been around for a while, i am hoping that they might start introducing some totally new kinds of card.\n\nWhen they first mentioned the mounts, i was hoping that they would add a new dimension to the game, but they've turned out to be just like attachments.\nand then they mentioned treasures in the hobbit expansion, and that is more like it -- but it's still basically just an attachment, that you can carry forward onto the next game.\n\none idea that i have had, is for them to introduce cards that affect your entire group at once… sort of like a stance.\n\ni was thinking maybe we could have a \"rest\" card, where you can basically just hold up for an entire round if there are no enemies in play, collect resources and cards like normal, but you dont have to commit anyone to questing. and you dont have to attack or defend either (because there are no enemies in play). and you can stay like that, building up your cards and resources, until an enemy card comes off the encounter deck. at which point your group has to stop resting and go back into normal play again.\ni dont think that would be too powerful, because in practice you are only going to go one or two rounds until an enemy appears, and you still have to increase your threat every round. maybe they could make it so you have to remove all progress from your current quest as well, if you choose to stop and rest.\n\nsome other 'stance cards' that we could apply to our entire group could be things like 'fortify' (+1 extra defence for everyone, but -1 will? and you cant travel to locations?) and 'stealth' (-2 threat for your heroes, but -1 will?)\n\nand what about an 'attack' stance, where we could swap the defend/attack phases round so we can attack the enemies before they attack us… but at a massive cost of +5 threat, or something like that\n\nbut my idea is that these stance cards work in a different way --- they aren't just event cards. they actually hang around over several rounds until you choose to cancel them, or change your stance"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66585-totally-new-kinds-of-card-that-wed-like-to-see-what-about-stance-cards/?do=findComment&comment=649879","commentId":649879,"userName":"richsabre","timestamp":1340699954,"content":"yes, i like those, and i dont suppose it will be too long before ffg start mixing it up and doing something like you said, i dont think they will just yet as we're only in the 2nd cycle, but maybe in the 4th.\n\nbut saying that we had secrecy which was pretty major (though they havnt really expanded on it as much as i hoped) in this cycle, so maybe next cycle we shall see new types\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66585-totally-new-kinds-of-card-that-wed-like-to-see-what-about-stance-cards/?do=findComment&comment=650022","commentId":650022,"userName":"Cunir","timestamp":1340714711,"content":"Similar to your \"stance\" effect, something to do with weather. A weather deck could be introduced in an expansion. It could be shuffled into any encounter deck to provide either positive/negative effects (would be dependent to a degree on the active location). New adventure packs could have specific weather cards in?\n\n…that was an idea by nssxxx on BGG (www.boardgamegeek.com/article/9479565 [http://www.boardgamegeek.com/article/9479565])\n\nand how about this… similar to the weather idea. 3 cards, which you can use in any existing quest. \"Dawn\", \"Dusk\" and \"Night\"\n\nwhat you do is pick one of the 3 cards at random at the start, and place it to one side, and shuffle the other two cards into the encounter deck.\nit will then stay that time of the day until the end of the quest (applying its effect every round), or until you draw one of the others from the deck to replace it\n\n\"Dawn\" -- neutral\n\"Dusk\" -- add 1 to the combined threat in the staging area\n\"Night\" -- add 1 to the combined threat in the staging area, and reduce each characters defence by 1\n\nif you stick in the some of the weather cards as well, with similar kind of global effects, then that might by a way to make all those existing quests play a little bit different\n\n\"Clear skies\" -- neutral\n\"Sunny skies\" -- add 1 to your combined will during the quest phase\n\"Snowstorm\" -- players cannot travel to locations\n\"Howling wind\" -- players must discard 1 card from their hand at the end of every round\n\"Pouring rain\" -- remove 1 progress token from the quest/active location at the end of the quest phase\n\neach weather effect stays in play until it is replaced by another one from the encounter deck. you could put in some event cards as well, which could counter them (if you play a \"Shelter\" card then you can discard a \"Howling wind\" or \"Snowstorm\")"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66585-totally-new-kinds-of-card-that-wed-like-to-see-what-about-stance-cards/?do=findComment&comment=650096","commentId":650096,"userName":"jjeagle","timestamp":1340723574,"content":"I like the weather idea. It reminds me of a similar aspect of the old Middle-earth CCG, which I think picked up nicely on an important thematic element from the book. In MECCG there were an array of Environment cards (Gates of Morning, Doors of Night, Twilight, Fog, Snowstorm, Sun, Moon, Stars, Morgul Night and so on), and players could contend to make the environment more or less \"evil\" according to what would favour their strategy."}]}