{"url":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/","title":"&#039;Locking&#039; the encounter deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=650169","commentId":650169,"userName":"Bohemond2","timestamp":1340732538,"content":"In one of my recent games, I established a lock on the encounter deck. I wanted to share what a lock is, discuss how my deck sets up a lock, and then ask the community if anyone else had discovered other locks.\n\n\nThe idea of the lock is to establish a set of conditions that ensure the encounter deck cannot produce a card capable of hurting you, and to repeat those conditions indefinitely. Once you have an advantage over the board (you are making progress questing every turn, you aren't taking damage, etc.), setting up the lock ensures your path to victory. Of course certain scenarios have quest cards that break an encounter lock (generally by drawing additional quest cards), but, in general, setting up a lock does wonders for winning the game.\n\n\nThis particular lock uses the deck I discussed in this thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=669747]. You use some combination of Beravor, Unexpected Courage, Gleowine and Daeron's Runes to draw all or most of your deck (which can often happen around turn 7ish). You then look for an innocuous encounter card, normally a treachery with minimal effect, a location that you can clear without traveling, or even a foe you can kill without being attacked. Once you have those conditions, you can begin the lock. You cast Shadows of the Past. On the following turn, cast Shadows of the Past again. Then you use Will of the West, followed by Dwarven tomb to redraw Will of the West.\n\n\nRepeat those stages indefinitely. It costs 6 resources, but you generate that over two turns. Assuming you are playing with a deck that uses Elrond’s Counsel, you net -7 threat over those same three turns. As long as you have enough willpower to make progress, you continue this pattern until you win the game, or you get a quest card that breaks your lock.\n\n\nObviously, this plan isn’t fool proof. Certain quests make you draw additional cards. You only get it set up in the turn 6-8 range, around the time many games are coming to a close. Also, certain scenarios require you to work your way through the encounter deck for Objectives, or draw the encounter deck for specific types of tests. However, it’s a powerful strategy for many quests. I am curious to know if other players use this tactic, or have built other types of ‘locks’\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=650210","commentId":650210,"userName":"muemakan","timestamp":1340738152,"content":"Well, Shadow of the Past can make every BeravorUC deck lock the encounter deck.\n\nI tried such a deck a long time ago. ( not very often, because it´s boring as hell to play it)\n\nIt was likely to draw most of my deck in 4 or 5 turns…..I´ll guess with all those new cards it´s becoming more and more quicker.\n\nIf you establish your lock it only takes 3 resources to do it. 2 for SotP and 1 for WotW. ( you need two WotW if you play it like this)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=650314","commentId":650314,"userName":"plueschi2","timestamp":1340762813,"content":"Infinite usage of Out of the wild also sounds like fun ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=650896","commentId":650896,"userName":"Mighty Jim 83","timestamp":1340856582,"content":" presumably this is solo only?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=650933","commentId":650933,"userName":"DurinIII","timestamp":1340864720,"content":"That was exactly my thought MightyJim! It would have to be. I like it though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=650980","commentId":650980,"userName":"plueschi2","timestamp":1340872075,"content":" You should be able to do the same shenanigans in a 2P game though, either via 2x Shadows of the Past or Gildor's Counsel + Shadow of the past."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=651650","commentId":651650,"userName":"Runix","timestamp":1340972372,"content":"For scenarios that have the Anduin set, you can do a \"soft\" lock on the Encounter deck by cycling Banks of the Anduin through.  Requires waiting for the Banks to come out and some careful play on top of that - e.g., making sure Anduin doesn't get played out as a Shadow card.  Also, you can't cycle it every turn without very clever play, but you can dramatically cut the number of new Encounter cards that you have to deal with.  I call it \"follow the river\", a very handy strategy for the scenarios that have it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66612-locking-the-encounter-deck/?do=findComment&comment=651718","commentId":651718,"userName":"Glaurung","timestamp":1340980117,"content":"Runix said:\n\nFor scenarios that have the Anduin set, you can do a \"soft\" lock on the Encounter deck by cycling Banks of the Anduin through.  Requires waiting for the Banks to come out and some careful play on top of that - e.g., making sure Anduin doesn't get played out as a Shadow card.  Also, you can't cycle it every turn without very clever play, but you can dramatically cut the number of new Encounter cards that you have to deal with.  I call it \"follow the river\", a very handy strategy for the scenarios that have it.\n\n\n\nWhen i play i always remove those cards from the encounter deck cose in my opinion those trick sound like cheeting for me and make game much more easy.\n\nSame with locations from another encounter deck KD Mountain root i suppose. Threat and progress tokens X and X is number players in the game. If i play solo or 2 players game i always remove them from the deck cose those card make sense only 3 or up players game."}]}