{"url":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/","title":"Tom Bombadil","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650406","commentId":650406,"userName":"bollywongaloid","timestamp":1340783388,"content":"Hi all,\n\nVisiting richsabre's excellent website and reading his article on Tom Bombadil it got me thinking… are we ever likely to see Tom as a card?  Thing is, FFG will have a hell of a job to get this one right as a lot of people can't even agree on what he is.  Would he be an ally, or a hero?  Perhaps even an enemy (for those of you who believe he is the witch king, though I personally think this is nonsense) or maybe a separate entity altogether?  Just wondered your thoughts on the matter.\n\nThanks in advance for the replies\n\nbtw brilliant website rich! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650412","commentId":650412,"userName":"richsabre","timestamp":1340784160,"content":"thank you kindly. i am flattered sonrojado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sonrojado.gif]\n\ni think we will certianly see bombadil- he's one of the most colourful of tolkiens creations, all the more so as he was created well before the lord of the rings in seperate tales\n\ni think he will be an ally - he's too powerful and complex to be a hero, i think we'll see him as a gandalf type of ally.\n\nthe problem is though he doesnt leave his bounds ie the old forest and downs area, so perhaps he would just be an objective. that would be dissapointing but more lore correct. i would rather in this case they loosened up on the lore (yes coming from me!) and gave him as a really restricted ally\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650428","commentId":650428,"userName":"bollywongaloid","timestamp":1340786004,"content":"Yea I agree a restricted, powerful ally sounds good.   Perhaps with an effect along the lines of:\n\n'Cannot commit to a quest or attack. Indestructible.\n\n Response: After Tom Bombadil enters play, remove an enemy (considered defeated) or a location (considered travelled) from the game.\n\nForced: Discard Tom Bombadil at the end of the round.'\n\nhmmmmm….. now I've read what I've written I'm not sure if that effect is too powerful or not powerful enough to do him justice lol.  However, I think it'll be important to keep him as a 'pacifist/neutral' type of character (hence the no commiting or attacking), and it makes sense for him not to be kill-able either (so I took the liberty to use the keyword Indestructible), as in my opinion he is definitely some sort of 'upper-being' or valar-like character.  It also feels right for him to be able to nullify a huge chunk of threat from locations and I know from the books he can command things such as barrow-wights as well so removing enemies as an effect makes sense.\n\nIn any case, I'd be happy to see him in a future saga series as an objective card as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650431","commentId":650431,"userName":"lleimmoen","timestamp":1340786103,"content":"I very much hope so we shall see Tom Bombadil. I would say ally fits best surely. But we could also see more thematic cards, connected to the power of Tom's words. Based on the last ffg article, we can assume the designers read these boards, so let's hope others will second the sentiment and we shall get the card rather sooner than late. I agree though this one may one of the hardest to create. I would not have a clue what ability (and stats) such card should have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650436","commentId":650436,"userName":"richsabre","timestamp":1340786966,"content":"i think its safe to say it will give the designers a bad head- imagine having to decide the trait word for him….i spent about 2000 words trying to do that and still couldnt, and so have many more before me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650441","commentId":650441,"userName":"bollywongaloid","timestamp":1340787286,"content":"Maybe his trait word could be simply 'Enigma' lol.  I don't think there's another everyone would agree on"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650443","commentId":650443,"userName":"gatharion","timestamp":1340787473,"content":" I'm 98% sure that we'll see Bombadil as an objective card when/if we get an encounter based around the Old Forest. (Possibly the Barrow Downs too, but Old Forest is more where he tends to be found.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650462","commentId":650462,"userName":"richsabre","timestamp":1340789831,"content":"i would like to see a cycle based around the locations of the first book of the fellowship (for those who havent read the books the 1st book of the fellowship goes from the start of the book to the flight to the ford)\n\nthis was always the best of the trilogy by far, the book that had all the magical places in, and is the one i go back to most\n\nout of the 6 packs it could go\n\nhobbiton (i dont know what dangers- but the only real danger to the shire in history was wolves and the nazgul, orcs once, but it would be a push to have them attack again)\n\nthe old forest\n\nbarrow downs\n\nweathertop area/ lone lands\n\nthe trollshaws\n\nsomething to do with rivendell, though i guess we've already had that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650463","commentId":650463,"userName":"lleimmoen","timestamp":1340789990,"content":"What makes you think so? Or even be sure? His role in the story was very much like that of an ally… and some of the objectives were still branded allies, Grimbeorn, Wilyador, Arwen… maybe that's what you think. And you think that be best so that players won't be able to use him in their decks? Maybe; but I for one would be disappointed and I think I'd be far from alone in that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650465","commentId":650465,"userName":"bollywongaloid","timestamp":1340790055,"content":"richsabre said:\n\nhobbiton (i dont know what dangers- but the only real danger to the shire in history was wolves and the nazgul, orcs once, but it would be a push to have them attack again)\n\n\n\n \n\nFarmer maggot's dogs could be a danger perhaps happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650490","commentId":650490,"userName":"richsabre","timestamp":1340793252,"content":"it funny in that tolkien originally had maggot as a right murdering S.O.B., who hated frodo (well the character who became frodo) for some grudge when he was younger, and threatened to kill him if he came onto his land. frodo placed the ring on and went in with the other hobbits and, if i remember rightly, stole a mug of beer and ran out!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650654","commentId":650654,"userName":"DarthJalapeno","timestamp":1340812366,"content":"richsabre said:\n\ni would like to see a cycle based around the locations of the first book of the fellowship (for those who havent read the books the 1st book of the fellowship goes from the start of the book to the flight to the ford)\n\nthis was always the best of the trilogy by far, the book that had all the magical places in, and is the one i go back to most\n\n\n\nThis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650810","commentId":650810,"userName":"gatharion","timestamp":1340836913,"content":"lleimmoen said:\n\nWhat makes you think so? Or even be sure? His role in the story was very much like that of an ally… and some of the objectives were still branded allies, Grimbeorn, Wilyador, Arwen… maybe that's what you think. And you think that be best so that players won't be able to use him in their decks? Maybe; but I for one would be disappointed and I think I'd be far from alone in that.\n\n\n\nBecause he was so very specific to one location. It wouldn't be true to the character of Tom Bombadil to have him at your side as you venture into Moria or Mirkwood. Partially because he's so powerful, partially because he's so enigmatic, but mostly because they made it clear that he never leaves his home.\n\n \n\nI never said he wouldn't be an objective ally though, like Grimbeorn. I think that would make perfect sense.\n\nI just said \"objective\", I didn't say \"not ally\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66636-tom-bombadil/?do=findComment&comment=650884","commentId":650884,"userName":"lleimmoen","timestamp":1340851741,"content":"I know you did. And the logic is fair.\n\nBut that characteristic holds true for so many Middle-earth characters, I wonder Beorn had ever ventured far from the Carrock, nor the likes of Denethor or Elrond could in their latter days (in which the game is set to take place). And what of the Hobbits? Even the most Wandering Took could not have wandered as far as Moria. Such restrains have been a rule to be breached, and frankly, it does make sense because if we stuck to them, the game would suffer greatly.\n\nYet, you may of course be right but unless you know the designers personally, I would not be too sure."}]}