{"url":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/","title":"The scoring system","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=650911","commentId":650911,"userName":"bollywongaloid","timestamp":1340859881,"content":"I apologise if I'm repeating old topics here but I feel like having a whinge so the hell with it….\n\nI hate the +10 points per round scoring system!  I'm quite a conservative player.. I prefer to tread carefully through a quest, avoiding damage unless its necessary and anticipate what could possibly come up from the encounter deck and only commit the maximum amount of characters I feel it's safe to.  If I'm trying to get a good score however with this scoring system, I find myself taking risks more frequently e.g. engaging an enemy I can defend but not deal damage to, and more often than not they end up back-firing.  Besides, simply trying to sprint through the quest doesn't fit all the scenarios.\n\nI think I could maybe live with +5 points per round but 10 seems a bit slap-dash and excessive.  After so many rounds, the Victory points system becomes a bit redundant.\n\nAnyway, whinge over. Thanks for listening happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=650925","commentId":650925,"userName":"richsabre","timestamp":1340862912,"content":"were you around for the old scoring system? it didnt have the round points, so the new scoring system was brought in to stop people hanging around at the end of the game to score more points\n\npersonlly i just dont bother scoring\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=650951","commentId":650951,"userName":"Bohemond2","timestamp":1340867074,"content":"I will start for also voicing my displeasure with the scoring system.  That being said, +5 points a turn for solo play would allow you to set up loops where you are become incentivized to prolong the game simply to drop your threat to 0. If you have a scoring system, you need to construct it in such a way that encourages players to actually finish scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=650971","commentId":650971,"userName":"bollywongaloid","timestamp":1340869877,"content":"I wasn't around for the old scoring system and I can see what they were trying to do by introducing the new scoring system, but surely there's got to be another solution to prevent people from prolonging the game?  Maybe introduce a rule or something but I can't see something like that being implemented easily.\n\nIn any case, I can't see them changing it again in the near future so this thread is probably all in vain lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651013","commentId":651013,"userName":"leptokurt","timestamp":1340875439,"content":"bollywongaloid said:\n\n \n\nI wasn't around for the old scoring system and I can see what they were trying to do by introducing the new scoring system, but surely there's got to be another solution to prevent people from prolonging the game?  Maybe introduce a rule or something but I can't see something like that being implemented easily.\n\nIn any case, I can't see them changing it again in the near future so this thread is probably all in vain lol.\n\n \n\n \n\nIn Juicebox's tournaments we try to balance both approachs by including a win-loss ratio. You play three games, and the average result gets multiplied with the win-loss ratio.\n\nExample: player A has 100, 120 and a 170 points - makes 100+120+170 = 390, divided by 3 = 130 points\n\nplayer B has 80, 100 and a loss - makes 80 +100 = 180, divided by 2 = 90, multiplied with 1.5 = 135 points"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651019","commentId":651019,"userName":"Mattr0polis","timestamp":1340876205,"content":"The new system's not bad once you get used to it. The old system was definitely abusable as would +5 pts.\n\nThe best advice I can give is that wins should still be the most important thing, so I still wouldn't rush faster than your deck can handle or take too big of risks just for a chance at a better score. If your deck is good and you are playing smartly, good scores will come.\n\nI'd much rather have 50 wins with a slightly higher average score than 15 wins with a great average."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651045","commentId":651045,"userName":"Troymk1","timestamp":1340878121,"content":"richsabre said:\n\nwere you around for the old scoring system? it didnt have the round points, so the new scoring system was brought in to stop people hanging around at the end of the game to score more points\n\npersonlly i just dont bother scoring\n\nrich\n\n\n\n \n\n+1    I really don't 'get' scoring this game. Some of the best games you will play will be where you squeak through at the end, probably having lost a hero or two and damage counters like confetti across the table.  These will score badly….. :/\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651203","commentId":651203,"userName":"Captain Poe","timestamp":1340898962,"content":"I can see the problems with the old scoring, where you hang around, lower your threat, get victory points, etc, so, it was imperfect. I hate the newer one ever more though… personally, I find it a burden to track rounds. Ive only ever scored one game, and posted it on these forums only to learn the scoring system had been updated to the +10/round version… haven't bothered since."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651215","commentId":651215,"userName":"Bullroarer Took","timestamp":1340900054,"content":" The problem with any scoring system right now is that it is going to reward a certain style of play.  There simply aren't enough cards out there for different play styles to compete on an equal footing.  Maybe someday, but not for a while.  (And I really doubt it since the game is so Quest driven.  Now that is not to say that a fair tournament system can't exist: it can.  But you will be seeing a lot of the same play styles/heroes/cards.  Maybe that's the way it always is, I don't know.  This is my first card game.  (Just to be clear, I'm okay with it the way it is.  I play to have fun with the heroes I like and don't keep score.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651428","commentId":651428,"userName":"lleimmoen","timestamp":1340936676,"content":"The scoring still seems to be a major problem.\n\nFor those who don't keep the score, the older way still sort of applies, as it is easy to look over the board, see the threat dials and damage, and even if you're not going to count, you kinda know the less damage and less threat the better. In that way, I find the older system much more adequate, for counting the rounds just seems silly. I recognize (and had done before) however that stalling the game would be a problem in a tournament setting and thus introducing the round count makes sense but for personal purposes I much prefer the initial system (and no stalling)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651438","commentId":651438,"userName":"bollywongaloid","timestamp":1340941197,"content":"yea, I feel as though the new system was put there to prevent me for something I never did, and would never consider doing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651439","commentId":651439,"userName":"bollywongaloid","timestamp":1340941268,"content":"prevent me from doing something sorry lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651484","commentId":651484,"userName":"Glaurung","timestamp":1340950521,"content":"the scoring system is pointless cose there is no tournament system. This make sense only on tournaments to prevent players play to long and make them play quickly as possible.But there is still no tournament system and looks like there will be no tournament for this game.\n\nSo who really cares about this scores if you play home and allowed to do what you want anyway??? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651514","commentId":651514,"userName":"MyNeighbourTrololo","timestamp":1340956366,"content":"I think things got messed up when they introduced new scoring system, while Victory points for villians and stuff were left untouched. They were clearly designed for first scoring sysem, now this 4 victory points doesn't compensates the time or resources(or both) you wasted to deal with it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651520","commentId":651520,"userName":"lleimmoen","timestamp":1340957771,"content":"Oh yeah, I agree whole-heartedly and will repeat: We need more VPs! Beside staying away from harm and keeping threat low, this is another clear indicator how the game went."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651560","commentId":651560,"userName":"Captain Poe","timestamp":1340963538,"content":"I think the problem could have been fixed if they just stated that you add any threat AFTER your initial starting threat against your score. The problem was, I  think, lowering your threat and then winning for an extra high score, which is not available really to anyone but spirit and a bit to lore outside of gandalf. I think, that if you want to risk victory to explore the encounter deck for extra victory points… well, shouldn't you be rewarded for that? Many of the enemies that give you victory points can easily screw you out of a win… i think if you want to take that risk, you should be rewarded with a higher score.\n\n \n\nThat said, i think the scoring system as it is now may work ok IF there were a competitive play… where the idea of short games are ideal because you don't want to wait for the one table that is pumping the victory display for 3 hours.\n\nI see this being a bigger problem with the hobbit expansion, which seems counter intuitive here… as it sounds like you have to stretch out the game and search the encounter deck if you want to collect all the special items… I think that it sounds awesome, but shows a flaw in the grading system where you're penalized for completion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651596","commentId":651596,"userName":"Mattr0polis","timestamp":1340967097,"content":"Captain Poe said:\n\n \n\nI see this being a bigger problem with the hobbit expansion, which seems counter intuitive here… as it sounds like you have to stretch out the game and search the encounter deck if you want to collect all the special items… I think that it sounds awesome, but shows a flaw in the grading system where you're penalized for completion.\n\n \n\n \n\nI wouldn't say penalized. If the treasures work how it sounds like they will work (which is yet to be seen) then it just gives you interesting choices: do you spend a couple extra turns trying to find the treasure that will increase your chance of wins, possibly even quicker wins/better scores for the other remaining scenarios? Or do you skip the treasure and go for quicker scores, though the following scenarios might be a bit harder without a power treasure?\n\nBtw, happy birthday, Captain Poe! (If that is indeed what that cake symbol means.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651601","commentId":651601,"userName":"Captain Poe","timestamp":1340967393,"content":"Mattr0polis said:\n\nBtw, happy birthday, Captain Poe! (If that is indeed what that cake symbol means.)\n\n\n\n \n\nThanks, i'm officially a hundred and eleven."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651614","commentId":651614,"userName":"Vyron2","timestamp":1340968726,"content":" I don't bother scoring… it is pointless and just keeps me calculating while I could be playing another round of the game… without a league or a tournament, it doesn't make any sense!\n\n \n\nI could see this game as a sort of LEAGUE-style competition, where you regularly play games, establish a win/loss ratio, and then the best play a new custom-designed scenario (later available via POD)… a real one day tournament is just unimaginable for me and pointless… you're kind of playing WITH your friends… idk…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651947","commentId":651947,"userName":"Budgernaut","timestamp":1341025782,"content":" You know what's funny? I played a few times in the tournaments, but then I stopped writing scores down. Nowadays I just play for the fun of beating a scenario. But despite that, (and I only just realized it because of this thread) I have been playing with two threat trackers (one for threat, one for rounds) for months."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=651970","commentId":651970,"userName":"mr.thomasschmidt","timestamp":1341031485,"content":" Okay, I personaly couldn't care less about the scoring system as I live in Norway, got no one to play with but my self and no organised groups in anyway :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nBUT as I just read this tread I got 2 ideas that I wanted to share. They are just suggestions and could be totally wrong but se what you think of this.\n\n1. Regarding victory points. Could the answer be as simple as just ad a zero to the point on the card? Ex. 4 vic. points = 40 points. How well would that work?\n\n2. Regarding tournament scoring. How about making some point criteria instead of just make the one with less point win? I'm not totally sure what I'm fishing after here but something along the lines of maybe,\n\n1-5 rounds = 10 points\n\n6-10 rounds=25 points\n\n11 or more rounds=50 points\n\nThen you use these points instead of the round points in the system.\n\nEx. Down the Anduin yesterday, \"solo 2 player game\":\n\nP1Final threat:42, Tread cost dead hero:12 (Glorfindel core), damage on remaining heroes: 4 (Gimli)\n\nSubtotal: 58\n\nP2 Final threat:40, Tread cost dead hero: 0 (no dead), damage on remaining heroes: 4 (3 on Aragon core, 1 on Éowyn)\n\nSubtotal: 44\n\nCombined player subtotal: 102\n\nMinus victorypoints: -17\n\nPlus rounds: 90 (9 rounds)\n\nTotal quest score: 175 points\n\nNew score would instead be: 102-17+25=110\n\n \n\nDont know if this maybe could spawn some new ideas :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=652723","commentId":652723,"userName":"mr.thomasschmidt","timestamp":1341228257,"content":" So, any comments on my suggestions above? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66695-the-scoring-system/?do=findComment&comment=659653","commentId":659653,"userName":"Tromdial","timestamp":1342498591,"content":"I feel the updated scoring works well enough; simply, I list mine as total points at end and rounds it took to win as separate, being faithful both to old and new scoring at same time.\n\nThus leads me to a question that may have already been answered: can threat level ever go below 0, or does the counter officially limit the minimum threat you can reduce yourself to during gameplay?\n\n "}]}