{"url":"https://community.fantasyflightgames.com/topic/66892-im-done/","title":"I&#039;m done","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652688","commentId":652688,"userName":"MyNeighbourTrololo","timestamp":1341223484,"content":"I'm done trying. I tried this god dam journey down the Anduin too many times and every time was a file. I tried it with diffirent starter decks, I tried it with tournament-legal contructed decks, today I tried it with a really deeply thought deck 3 friggin times and all 3 friggin times I was crushed to wrecks, just not as fast as previous times. Get past the troll two times of three and everything seemed well, but then again this **** come up and it was over. And whats most frustrating is now when I look back, knowing what was coming to me - even with this knowledge I wouldn't prevent the loss, because I didn't has the means to. Why include scenarios into the core set with so badly suited player cards against them? In the end it's all just up to random and player has a very little impact on whats going on.\n\nYes, I always can just call a friend and we could faceroll through all the high-\"difficulty\" quests, because multiplayer is like x10 times easier than solo, but whats the point? \"You could always buy the expansions\" - I already did, but it takes months for them to ship into my country and shelving the game until they arrive is something I wish I'd didn't had to do, but I just see no other way. It's not fun anymore to me.\n\nSorry for the garbage I just posted here, just frustrated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652699","commentId":652699,"userName":"booored","timestamp":1341224549,"content":" this is a extremely common reaction, and there is no defence for the game.. people either put up with it and like a battered wife just start to believe it is normal.. or they spit the dummy and stop playing. For me the game is fun, but I mainly play 2 player and 3 player.\n\nPeople will prob post all sorts of crap in here about how it is not that hard and all that but what these people are not telling you is that they either have a low win %.. or they do not know how to play correctly, so their \"wins\" are invalid, or they are lying. I mean look at those cardboard of the rings guys, very high profile players of this game, and even they play so badly rule wise that unless they WHERE playing so badly they wouldn't be winning. I once held a competition across 5 forums a while back for people to play and win, I think if was 3 out of 5 games of solo Journey to Rasgobel (just after Khaz was out but b4 darrowdelf I think it was). Anyway, I was offering a prise of the next adventure pack.. I had over 30 people attempt, some regular posters here.. I will not name.. but you know who you are.. vocal guys too.. and EVERYONE failed.\n\nThe bottom line is, If your not having fun.. then stop playing that simple.. Still high win percentages are not important to some, and I can respect that. . I mean when the game was younger I played a lot of solo, as I felt that this game was kind of like a puzzle. Build a deck that is able to win the scenario at a decent win%. The truth is though, that no matter how deep and thoughful your deck building, there is the random luck angle that this game can not recover from. On a single turn of the card you can loose it all, regardless of what you do in game, or in deck building…  so the game is more about getting a good encounter deck draw than deck building.\n\nBUT.. they have improved their quest design form the core set, and while the \"flip a card form the encounter deck, game over\" frustration has yet to be ironed out, the quests are defiantly MUCH better designed.\n\nStill, I hear you… and sympathise but hey, this is the game.. This is Lord of the Rings LCG…  take it or leave it. Like it or don't like it.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652707","commentId":652707,"userName":"mr.thomasschmidt","timestamp":1341225515,"content":" I hear you. I have been there myself. Then one guy, can't remember who, suggested me usin a single sphear deck, spirit+3 Gandalf. I thought \"yeah, RIGHT!!\" untill I tried it. I beat the dang quest the first or second time using that deck. BUT this only apply if you don't care at all about the scoring system. I snailed my way through and it worked nice for me. Next time I tried that quest was some days ago, about half a year later, here I beat it with a 2 player run. I played 2 player by myself.\n\nBut as stated above, if you don't have fun, give it up. That's after all what it's all about :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652712","commentId":652712,"userName":"MyNeighbourTrololo","timestamp":1341226142,"content":"You know, I had fun. Before I lost 20 times in a row without a slighest chance of winning. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652713","commentId":652713,"userName":"richsabre","timestamp":1341226422,"content":"whilst i dont take the extreme opinion that booored states, i am a 'guy who puts up with it' ….i dont lose this game half as much as i did- and i do play correctly. however i used to win about 1 in 10 games. admitedly ive just about got every rule wrong at some time in the last year or so, but i now play to the rules and funnily enough the game got easier…perhaps my card pool just coincided with me getting the rules right…anyhow i digress\n\nif the theme is enough for you, as it is for me, its worth sticking with it. if you like the feel of the game and are not bothered about the theme so much then again perhaps its still worth sticking with it….otherwise perhaps not. all depends why you play.\n\nif you can stand to keep loosing at the rate you are (which is understandable) then perhaps set it to one side until the packs arrive in your country? that way you dont frustrate yourself even more\n\ni know the exact position you are in, even with all the packs available now i remember the first 3/4 months of the game- they were tough on solo players especially, but the game was new and it had all its new packs coming up- it was worth sticking around, an still is in my opinion\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652719","commentId":652719,"userName":"MyNeighbourTrololo","timestamp":1341227535,"content":"Yes, I like the LotR theme but I'm not that huge fan of it. Yes, I like how the game plays, but then again, the main point of fun for me is challenge. \n\nThere is no challenge. You're absolutely going to lose, unless encounter deck/your deck will get insanely lucky, which fact you can't influence in any way by core set means. Challenge is when you know when it's gonna be hard, but you know you have an opportunity to overcome it too, maybe not big, but still opportunity(depends on level of challenge). In case of this quest, I tried it and lost so many times I'n confident enough to assume the two reasons: 1) I was incredibly unlucky all of these times; 2) Second quest is just unbeatable in terms of the core set. There is also third reason which I also assuming: I'm very, very bad and every deck variant I built for this quest sucks big time. And this is only second quest. I imagine the solo for third, where you're lose one random hero at the beggining of the game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652756","commentId":652756,"userName":"booored","timestamp":1341231398,"content":"yeah the theme is defiantly the weakest part of the game for me… elves and magical woodland critters are lame as hell.. I mean the theme is ok, and the card art is great.. but as a whole i find it pretty dull and restrictive.. I mean we are already running our of stuff with 5 billion different types of orcs and trolls and stuff.\n\nLucky there is a scifi lcg co-op game coming soon.. Still LoTR is defiantly the best deck construction game around for co-op."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652767","commentId":652767,"userName":"MyNeighbourTrololo","timestamp":1341233245,"content":"I want to make a little research just for the sake of it. Sort of experiments.\n\nIf it wouldn't bother anyone from the pro-players around here, can you suggest me best tournament-legal deck, build only from a single core set against the Journey down the Anduin? The cards, the heroes, the way I should play it. What this experiment is that I will play the second scenario with this deck 10 times in a row(or until I win) and then post the results there, giving a brief description of every game I went through.\n\n \n\nMy best shot was Spirit/Tactics hybrid, as I realized this quest needs both heavy fighting and questing. Hero setup was Eowyn, Legolas and Gimli. Eowyn as a best solo quester, Legolas as a strong attacker which can make a decent progress and a Gimli as all-round good defender, attacker and quester when forecast is clear. 3 Gandalfs for obvious reasons. Feints as a timely counter against trolls, which actually worked well. With some light-cost cards from the Spirit(up to 3). 2 of 3 games I got past the troll and get pretty far at the second stage, but got toally overwhelmed. Third time I got second troll coming out of encounter deck the 2nd turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652768","commentId":652768,"userName":"muemakan","timestamp":1341233295,"content":"MyNeighbourTrololo said:\n\n \n\nI'm done trying. \n\n \n\n \n\n \n\nCould you remind me what Expansions you have?\n\nAnd in which country do you live?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652782","commentId":652782,"userName":"MyNeighbourTrololo","timestamp":1341235118,"content":"I have no expansions and I live in Ukraine. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652795","commentId":652795,"userName":"muemakan","timestamp":1341237177,"content":" I made a tri sphere deck with Gimli, Theodred and Eowyn and tried it twice with OCTGN. Won both times, could be a deck that got lucky.\n\n If you want to, I will post it. \n\n \n\nWhat do you pay for your packs? Maybe someone can send you the pack so you don´t have to wait that long..\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652798","commentId":652798,"userName":"MyNeighbourTrololo","timestamp":1341237400,"content":"Whats OCTGN?\n\nI already ordered some packs in the online store and waiting for them to arrive. I don't have the resources right now to afford another ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652803","commentId":652803,"userName":"Captain Poe","timestamp":1341237568,"content":"Out of the 4 premade decks, I was only ever able to beat it with the spirit deck. The key is keeping your threat low and beating on the trolls very slowly and safely with dunhere. Use gandalf to lower your threat to keep them off of you, or his direct damage if you can manage to pull it off without your threat raising too much after the fact.\n\nI beat it the other day in a second play through, though at this time, i own every set, so i wanted to see how bad it was this time around with all the new cards. I was able to beat it with relative ease.\n\nTry something like this:\n\nEowyn\n\nDunhere\n\nTheodred\n\nYou're using the core set only, so you are somewhat limited on build options, but include 3x gandalfs, 2 sneak attacks, dwarven tomb, and galadrims greeting. That will keep you at a low enough threat to keep the trolls off of you. Use unexpected courage on dunhere to allow him to attack 2 monsters per turn. For gondor! is kind of a crap card, but in this point, its one of your few options to boost your attack. I think if you go this route, you should be able to pull off a victory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652807","commentId":652807,"userName":"MyNeighbourTrololo","timestamp":1341237870,"content":"I tried to do it the way you describe, the thing is Dunhere just can't get through troll's 3 armor and there is almost no options to boost his attack with a spirit/leadership deck. Spirit has a very weak fighting potential, Leadership has a slightly better but still weak figthing potential, and once troll descended - I had no means to hurt him. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652826","commentId":652826,"userName":"mr.thomasschmidt","timestamp":1341240991,"content":" I did it like Captain Poe described. Hm, I think I used Dunhere to take out all the smaller Enemies in the staging area. A couple of northern tracker (or the other guy, something with guide) the one that puts progress tokens on all locations in the staging area. And if remember correct I used Gandalf to hurt the troll and then defend against it. I used the card that lets you lower your threat by 6 (not good at names) and after a little while I used the card that lets you shuffle your discard pile back into the deck. It requires a little luck I'll agree but this is a very usefull tactic :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] have you tried to play a single player \"2 player\" game? This way you have 2 decks and are able to use 6 heroes in total.\n\nI should also mention that this quest almost killed the pleasure for me too. I own every pack to date except the latest one BUT I haven't opened anyone yet. I know, I'm strange :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] but the reason is that I wanna beat every quest in order and only using the cards existing at that quests time. Later I plan to use all the best cards and try it out again but my first run must be limited to the current cards at that time. I have had the game for about a year now but haven't played it the last half a year or so. The reason was too little time AND I was a little tired after all the failed attempt to Anduin. After I beat it I just sort of lost the interest for a while. But now I've picked it up again and it's better than ever :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] the last couple of days I have beaten the 3 core quests with dou decks and today I opened Hunt for Gollum. I'll give it a go tomorrow :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nRegarding OCTGN, it's a windows based software that lets you play this game and some other card games online. OCTGN and LACKEYCCG are the two hottest ones. Since I have a mac I use lackeyccg. This really gives me the time to play whenever I have a little time since I don't need to unpack all my cards and put up a big game. You can check it out if you want, just google it. However, if you decide to use one of these program's I'd strongly recommend you to only use the cards you have physically. This way you won't make decks that you can't play yet with your friends. AND off cause, if everyone stopped buy the packs and just used the \"free\" online software editions the game would die ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] sorry for this novel of a text. Just felt I wanted to tell you that you weren't alone in your frustrations and that it's possible to beat the Anduin…once in a while ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652838","commentId":652838,"userName":"MyNeighbourTrololo","timestamp":1341242483,"content":"Well, I've already beaten second and third scenarios in multiplayer, so now I'm up to beating them in solo mode, which I'm stuck in. \n\nWhile using only Spirit in solo, clearing enemies with Dunhere is very problematic as most of them have threat threshold lower than Spirit's starting 24 or something around it. And when they reach for you - spirit has a few means to defend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652840","commentId":652840,"userName":"Ranger of the Force","timestamp":1341243142,"content":"For what its worth, I had some luck with Eowyn, Dunhere, and Denthor againt Anduin.  I primarily used Forest Snare to tackle the troll. If I didn't get it in my first 6, I mulliganed to see if I could get it that way.  The low starting threat plus Gandalf, Galdrium's greeting etc. should bye some time until you can draw the snare, or get a Gelowine to help draw for it.  Denthor can be used to syphon away some bad guys so you can concentrate on the troll as well once you have snared him and brought him down from the staging area, gang up on him with your allies etc..  I have not beaten Anduin often, but when I have, Spirit and Lore has been in my deck.  All I had at the time was a single core.  It is possible, just keep plugging away."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652850","commentId":652850,"userName":"CaffeineAddict","timestamp":1341244823,"content":" I pretty much just play solo, and i've tried lots of decks against all the quests - my experience is generally that any deck running tactics doesn't work at all (tactics may be good for support in multiplayer, but for solo they aren't even worth thinking about), leadership only works as a support to lore or spirit, and the best decks are spirit/lore . \n\nI've tried a variety of spirit/lore decks, from \"control\" with denethor, burning brand, and similar cards, speedy-Rohan, to my current build with Frodo, Glorfindal (spirit) and Aragorn (Lore), which just runs rings round every quest except Dol Guldur and Rhosgobel. \n\nI'd suggest that the game is very playable, and very enjoyable, for a solo player - but pretty much only if you go Spirit/Lore. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652865","commentId":652865,"userName":"leptokurt","timestamp":1341246390,"content":"One big problem I had in the beginning was that I was too afraid of the troll and the extrat threat he causes when killing a low stat enemy. However, sometimes it's better to take this deal if this enables you to take down the troll.\n\nThe other mistake was to enter stage 2B too early. A player should be sure that he was gathered enough WP to make it down the Anduin in 2-3 rounds. Otherwise he gets overwhelmed by the risning threat or there will be too many enemies waiting at the banks.\n\nIn the first two expansions there will be some cards which help to make Anduin easier to travel. Rivendell Minstrell, Strider's Path and, most importantly, Longbeard Mapmaker. The first expansion also includes the Dúnedain Marks that give + 1 ATT to a hero (=Dunhere)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652884","commentId":652884,"userName":"MyNeighbourTrololo","timestamp":1341248730,"content":"Yes, yes, and yes. I tried everything stated above more than one time and everytime it failed. Spirit and Lore of a core have one flaw in common - lowest attack. When you snare Troll - you can't advance until you kill it, and you just have nothing to kill it with if you didn't happen to draw Gandalf. And while you're trying to - your threat grows, staging area gets crowded, more and more enemies descend, taking away your weak attackers and stuff.\n\nI got it pretty decent with tactics. My personal record - 11 prgoress token on the 2B stage of the quest. My threat was 35. And I drew this card which damages all characters of a player with 35 threat or higher. And it was instant death to all my wounded allies(and unwounded with 1 maximum health), leaving me down with 3 1 health left heroes. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652909","commentId":652909,"userName":"hildargo","timestamp":1341252652,"content":"Beating that quest solo is one of the more satisfying victories I have had in this game. Even with an expanded card pool, that quest still gives me fits. One combo that might be feasible for you since you only have the Core set is Son of Arnor and Forest Snare. The Son of Arnor can let you engage the Hill Troll in the Planning Phase and then you can Forest Snare it. That might be a bit tricky though, since that requires 6 resources across two different spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652910","commentId":652910,"userName":"Ranger of the Force","timestamp":1341252690,"content":"Perhaps you should try a Spirit/Tactics deck with Eowyn, Dunhere, and Thalin.   Thalin gives you access to Veteran Axhand (2atk) and Gondorian Spearman.  Spearman in combo with Thalin can really put a dent into enemies and makes those crows (and surge) irrelavent.  You could put Dwarven ax on Dunhere to bump up his attack against the troll and deal with him in the staging area. \n\nI assume you are playing with 30 card decks?  Putting two spheres together in a 30 card deck will give you better opportunities to draw the cards you need and see how your deck can perform until you get a larger card pool.  Hope this helps.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=652998","commentId":652998,"userName":"MyNeighbourTrololo","timestamp":1341276282,"content":"I construct tournament-legal 50 minimum card decks. Well, Dunhere will need something about 9 turns to kill the troll in staging area, if I'll get lucky with starting hand and one axe in it. Troll will engage because of threat or I'll get overwhelmed by things from the encounter deck, constantly coming at me. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653004","commentId":653004,"userName":"mr.thomasschmidt","timestamp":1341277146,"content":"MyNeighbourTrololo said:\n\nYes, yes, and yes. I tried everything stated above more than one time and everytime it failed. Spirit and Lore of a core have one flaw in common - lowest attack. When you snare Troll - you can't advance until you kill it, and you just have nothing to kill it with if you didn't happen to draw Gandalf. And while you're trying to - your threat grows, staging area gets crowded, more and more enemies descend, taking away your weak attackers and stuff.\n\nI got it pretty decent with tactics. My personal record - 11 prgoress token on the 2B stage of the quest. My threat was 35. And I drew this card which damages all characters of a player with 35 threat or higher. And it was instant death to all my wounded allies(and unwounded with 1 maximum health), leaving me down with 3 1 health left heroes. \n\n\n\nYou are probably aware of this but just in case. when you attack an engaged enemy you can attack with more characters at the same time adding the attack value together thus easier get past the troll than just relying on attachments for +1 attack strength.\n\nYou could eventually go for the spirit/lore suggested by another but instead of using Denethor for a low starting threat go for Glorfindel. You can use him to fight in stage 1 and 3 of the quest and questing in stage 2.\n\nPiaf you are up to it give some of all this a second chance and then report back how it went. People here at the forum are famous for supporting each other and there's a LOT of experience and helpfulness between my fellow LOTR LCG players :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653014","commentId":653014,"userName":"player543086","timestamp":1341279207,"content":"I had a bit more luck with Anduin and managed to beat it even before I got second core set and expansions.\n\nI had just one strategy - start with a low threat and field as many allies as possible before taking on the troll. Many times I had Gandalf ready to defend against it at least once to minimize the threat increase. As far as I remember I was planing spirit/tactics deck back then.\n\nStill I only won once back then (and tried 10 or more times) and I was getting annoyed at this quest. Then I decided that since FFG is not giving me enough cards in the box to build decent tournament legal deck so I stopped using the \"rule\" requiring me to use 50 card decks - I went for 30-35 decks and my win ratio against Anduin went up (not as far as being able to beat it 50% of the time but close to 30%). Then at least I had a felling I had a shot at winning.\n\nBTW: I don't know where do you order the game from (since you have to wait such a long time) but you might have a look at a Polish shop rebel.pl (http://www.rebel.pl/category.php/1,1619/Lord-of-the-Rings-LCG.html [http://www.rebel.pl/category.php/1,1619/Lord-of-the-Rings-LCG.html]) - they carry LOTR:LCG in English and are well respected in Poland (you can contact them at: sklep@rebel.pl in English and they should be able to calculate the shipping to Ukraine and it should be much faster then from say USA)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653022","commentId":653022,"userName":"mr.thomasschmidt","timestamp":1341281815,"content":" Heh, your situation is so like mine back then :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I felt like going back and read the advises people gave me back then and they are still valid. Much has been said here as well but you could always take a look if you want. Maybe you get some fresh ideas ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] here's the link to the thread.\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=550690&efpag=0#551542 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=550690&efpag=0#551542]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653031","commentId":653031,"userName":"cirroid","timestamp":1341283420,"content":"MyNeighbourTrololo said:\n\nI construct tournament-legal 50 minimum card decks.\n\nThen you're making this hard for yourself IMO. There's no reason to build 50-card decks with such a limited cardpool, you'll only end up with subpar decks. JDtA was definitely not intended to play solo with a tournament legal deck if you only have 1 Core Set and nothing else. You'll get that later, when you'll have a lot of expansions.\n\nTo beat Journey Down the Anduin solo, I think tri-sphere is the way to go. Théodred + Beravor + Éowyn is a very good team here.\nI also beat the quest with my best deck so far using Legolas + Beravor + Glóin (I have a 2/2 winning record against Massing at Osgiliath with the same deck, only I used Gimli there instead of Legolas).\nBoth decks have around 40 cards.\n\nHave to say though, I'm not that big of a fan of solo JDtA myself. Not that it's impossible, but it just limits your deckbuilding options too much. You need crazy card draw -> auto-include Beravor + 2 copies of Gléowine don't hurt. Beside Steward of Gondor you'll also need a hero that generates resources -> include Théoden or Glóin. You need heroes to have a starting threat below 30 etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653033","commentId":653033,"userName":"cirroid","timestamp":1341283579,"content":"cirroid said:\n\nYou'll get that later, when you'll have a lot of expansions.\n\n\nSorry, I meant \"You'll get there later\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653037","commentId":653037,"userName":"cirroid","timestamp":1341284280,"content":"Hm, to be honest, now I'm intrigued by this challange :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png], I think I'm going to try to stretch my Anduin-beating decks to 50 cards (using only Core Set cards, of course). Shouldn't cause too much problem with Beravor there.\nBut I really suggest for you to try completing the quest with a smaller deck first, to get the hang of it.\n\nSorry for the triple-post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653039","commentId":653039,"userName":"plueschi2","timestamp":1341284567,"content":"My advise would be this:\n\n1. Build a tri-sphere deck without tactics.\n\n2. Choose Eowyn, Thodred and either Denethor or Beravor\n\n3. Include all possible threat reducers in your deck (2x Greetings, 3x Gandalf, 2x Sneak Attack)\n\n4. Mulligan, if you have no threat reducers in your opening hand (unless its totally good anyway, like Steward of Gondor + other nice cards)\n\n5a. If you chose Denethor, stall stage 1 until the end of days. Use him at the end of your turn to see what's coming and then commit exactly the amount of willpower to break even on the next quest phase.\n\n5b. If you chose Beravor, try to use her for card draw and build up during stage 1 as long as your threat is below 30.\n\n6. Use For Gondor! to kill the Troll in one turn.\n\n7. Use Faramir to finish stage 2 in ONE turn. Do not enter stage 2 unless you can pull that off.\n\n8. Stage 3 is actually cake, if you were able to follow point 7.\n\n \n\nHope this helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653052","commentId":653052,"userName":"MyNeighbourTrololo","timestamp":1341287595,"content":"plueschi said:\n\nMy advise would be this:\n\n1. Build a tri-sphere deck without tactics.\n\n2. Choose Eowyn, Thodred and either Denethor or Beravor\n\n3. Include all possible threat reducers in your deck (2x Greetings, 3x Gandalf, 2x Sneak Attack)\n\n4. Mulligan, if you have no threat reducers in your opening hand (unless its totally good anyway, like Steward of Gondor + other nice cards)\n\n5a. If you chose Denethor, stall stage 1 until the end of days. Use him at the end of your turn to see what's coming and then commit exactly the amount of willpower to break even on the next quest phase.\n\n5b. If you chose Beravor, try to use her for card draw and build up during stage 1 as long as your threat is below 30.\n\n6. Use For Gondor! to kill the Troll in one turn.\n\n7. Use Faramir to finish stage 2 in ONE turn. Do not enter stage 2 unless you can pull that off.\n\n8. Stage 3 is actually cake, if you were able to follow point 7.\n\n \n\nHope this helps.\n\n\n\nThat's a good point. Though I tried something familliar(Eowyn, Denethor, Theodred), I pursued entirely diffirent tactcs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653059","commentId":653059,"userName":"lleimmoen","timestamp":1341290889,"content":"Yes, good advice about Beravor or Denethor, both strategies when combined with Théodred and Éowyn should guarantee at least fifty percent winning chance after you get familiar with the deck and quest (I mean the winning ways). First time I done it solo (with core only) I had Beravor, Éowyn and Dúnhere, my final threat was 0. Dúnhere rocks in this one but without expansions, Théodred might be a much better option still, For Gondor! will take you past the troll(s) like nothing. One just really needs to stay low on threat, starting at 29+ is a bad idea here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653078","commentId":653078,"userName":"Budgernaut","timestamp":1341295506,"content":" I beat it my first time with the combination that Ranger of the Force mentioned. I used Eowyn, Dunhere, and Thalin. Thalin let me put Dwarven Axes on Dunhere, giving him +1 attack each. Thalin also killed the crows and I wouldn't have won without killing them before their Surge effect kicked in. Tactics was a good choice for this quest, in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653098","commentId":653098,"userName":"Budgernaut","timestamp":1341298959,"content":" I just put a deck together to try it out again and won! I'm so excited my deck still worked. I used Eowyn, Dunhere, and Thalin with the 29 Spirit cards, 3 Gandalf cards, and the following Tactics cards:\n\n2x Dwarven Axe\n3x Gondorian Spearman\n3x Veteran Axehand\n3x Blade Mastery\n1x Stand Together\n1x Horn of Gondor\n2x Feint\n2x Quick Strike\n1x Swift Strike\n\nI never did get any attack buffs on Dunhere, but I did get Unexpected Courage on him which was instrumental during stage 2. We took care of the troll on round 6 or 7 by playing Gandalf to deal 5 damage and then defend against the troll. I had enough attack power with Dunhere, Gondorian Spearman, Thalin, and Northern Tracker to finish the Hill Troll off. I used a Galadhrim's Greetings on turn 2 to keep the troll at bay, but two treacheries raised my threat by 2 and I ended up engaging him with 29 threat. Thalin pulled his weight because on what I thought would be the last round of the river section we drew two crows. He wiped them out, cleaning the staging area in preparation for the final stage which revealed Driven By Shadow, which surged another Eastern Crow, which surged a Dol Guldur Orc, and finally we drew The Brown Lands. My two Gondorian Spearmen defended against the two enemies and Dunhere finished them off using Unexpected Courage.\n\nConclusion: This quest is beatable, but I will not hesitate to admit that I did get decently lucky by getting a fair mix of Treachery, Enemy, and Location cards. If I had just Enemies or just Locations, it could have been totally different.\n\nEdit: I forgot to mention that it was close because Eowyn and Thalin each had two damage on them from The Necromancer's Reach."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653109","commentId":653109,"userName":"MyNeighbourTrololo","timestamp":1341300652,"content":"Just tried  plueschi's suggestion. And won. But, this victory was too lucky.\n\nMy final score was 103.\n\nFinal threat level: +15.\n\nDamage tokens on remaining heroes: +5.\n\nVictory points: -7.\n\nNumber of rounds: 9(+90).\n\nI drew extremely good starting hand, and most of first encounter cards drawn from the encounter deck was event which didnt affecteds me in any way(like removing 4 progress tokens from 0 progress tokens on the current quest at the beggining of the game), the only enemy which engaged me during the first part of the quest was crows and goblin, both got swiftly dealt with and produced almost no harm. \n\nFinally, I got Son of Arnor and Forest Snare combo, and all required resources to execute it. Snaring troll, I dealt 3 damage each turn to him, while adding more and more allies on the board(Faramir was in my starting hand and was already waiting for the second stage). \n\nAs soon as troll was dead, I committed most of my characters to the quest and exhausted Faramir to support them. As a result I got 18 combined willpower against 3 threat in the staging area. Discarded one card from my enourmous hand by Eowyn's ability, increasing total willpower to 19, making it into 16 progress tokens and instant passage of second stage. By the forced effect of third stage was revealed only 2 locations. Remaining enemies was Wargriders and Crows. Destroyed them in last turn, and won. **** random."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653163","commentId":653163,"userName":"plueschi2","timestamp":1341309017,"content":"Pff, you played 20+ games without winning once, now you play one game and win and complain that you got lucky?? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nAssuming not all 20+ plays were unlucky before, I dare say the strategy made a difference lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653257","commentId":653257,"userName":"MyNeighbourTrololo","timestamp":1341321093,"content":"Well, I wish I'd get ton of empty treacheries instead of second troll/marsh adder/two goblin snipers/etc. before. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653264","commentId":653264,"userName":"muemakan","timestamp":1341321947,"content":" Tried the try sphere deck and got 5 wins out of six. Twice I got a sniper at start…..actually quite nice to pump up Gimli."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653274","commentId":653274,"userName":"plueschi2","timestamp":1341323075,"content":"MyNeighbourTrololo said:\n\nWell, I wish I'd get ton of empty treacheries instead of second troll/marsh adder/two goblin snipers/etc. before. \n\n\n\nA 2nd hill troll is really not that big of a deal as long as your threat remains under 30. Under those circumstances he only contributes 1 threat, no problem.\n\nWhat's so bad about Goblin Snipers? Either Gandalf deals with them or you just let them sit there. 1 dmg, 2 dmg, activate Daughter of the Nimrodel, 1 dmg, 2 dmg, daughter ….\n\nThe marsh adder might be the more annoying card out of those, but you won't see her each game anyway.\n\nBut as far as enemies go, I would worry much more about the ones capable of engaging you, than the ones that clog up the staging area while you stall the game. Luckily those low engagement enemies don't live too long.\n\nAnd there should be a reasonable amount of \"empty\" treacheries in each game. Despair, Evil Storm, Treacherous Fog and Driven by Shadow all do practically nothing anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653298","commentId":653298,"userName":"lleimmoen","timestamp":1341328011,"content":"Yeah, I think the Wargs are by far the worst in general (and unless you own Dúnhere)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653304","commentId":653304,"userName":"plueschi2","timestamp":1341328505,"content":"lleimmoen said:\n\nYeah, I think the Wargs are by far the worst in general (and unless you own Dúnhere).\n\n\n\nTotally agree"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653323","commentId":653323,"userName":"MyNeighbourTrololo","timestamp":1341330755,"content":"There were plenty of wargs in my previous runs and not a single(!) in this one. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653345","commentId":653345,"userName":"Runix","timestamp":1341332854,"content":"I've said it before and I will say it again:  the base scenarios included in the Core Set are obviously designed and balanced for two-player, and are a terrible introduction to the game for solo players.  This is a very difficult game overall, and the design of the core set does nothing to mitigate that, but rather makes it worse by dumping the new player into scenarios that are particularly luck-heavy and unforgiving.\n\nI repeat what I wrote over at BGG - we need better scenarios for introducing new players to the game, softball scenarios that can easily be beat, but allow the player a chance to fine-tune decks before tackling more difficult scenarios.  Opening up the Core Set and finding a nasty two-player-only scenario in Dol Guldur, a very luck-dependent scenario in Journey Down the Anduin, and a sometimes-super-easy-sometimes-super-hard (Turn 1 Encounter:  King Spider, good luck, you're going to need it) scenario in Mirkwood, and I feel like we're getting trolled by FFG.\n\n Every time I read a thread like this - and I have read many, including my first unhappy post at BoardGameGeek - I have to wonder, how many players had the same experience but instead of going to the forums, just threw it out and swore they would never waste another minute on it?  I think FFG should seriously consider re-designing the Core Set if they want to have any hope of retaining new players, with an eye toward scenarios that introduce players to the game concepts without being severely punishing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653351","commentId":653351,"userName":"richsabre","timestamp":1341333417,"content":"yeah i agree here- in over a year ive probably seen about 15 posts that voice peoples worries over the difficulty of this game for a solo player, some of these people stuck around, some were never seen again which is a shame"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653377","commentId":653377,"userName":"lleimmoen","timestamp":1341336860,"content":"In a way, the remedy has been done with the expansions, some of their quests being rather easier for solo play, in my opinion. However, this is really not a remedy as you \"have to\" start with the core set anyways. What was a great help for me was that from the start even when playing alone, I learned to play with 2 decks. And only after gaining that experience, I began to pursue the solo mode. I know some players, like Richard, aren't big fans of the two-hand variant, and I understand their point of view, but it can be helpful to learn new ways about the game, and even discover some mechanics which cannot be experienced in solo games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653526","commentId":653526,"userName":"mr.thomasschmidt","timestamp":1341360156,"content":"Runix said:\n\nI repeat what I wrote over at BGG - we need better scenarios for introducing new players to the game, softball scenarios that can easily be beat, but allow the player a chance to fine-tune decks before tackling more difficult scenarios.  Opening up the Core Set and finding a nasty two-player-only scenario in Dol Guldur, a very luck-dependent scenario in Journey Down the Anduin, and a sometimes-super-easy-sometimes-super-hard (Turn 1 Encounter:  King Spider, good luck, you're going to need it) scenario in Mirkwood, and I feel like we're getting trolled by FFG.\n\n\n\nHm, I partly agree. You description for the 3 quests are very fit but I have to admit that it really is the most fair in order to make the game interesting for both the single player, the 2 player and the more experienced 2 players. This is after all also a game designed for those who only wish the core set and play a few times once in a while..BUT I also admit that it can be unfair to the new solo player only, that want to invest time nd money in the game and more cards. I think FFG should have made a single adv pack before the RtW circle with only quests. Maybe 6-9 quests in the same difficulties af the core set. (or even better, 3 quests and cards adding up sothere would be 3x of all cards ;P) either that or at least include 3 more question the core set with very easy, easy and medium difficulties."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653549","commentId":653549,"userName":"player543086","timestamp":1341364530,"content":" I dare to say that FFG knows what they are doing and the core set is a carefully constructed beast. We (including me) often complain about:\n1. Difficulty level for solo plays\n2. Not all cards included in 3 copies\n3. Only 3 quests\nAs far as I see it though there were some decent decisions made for each of those I will talk only about the difficulty level here.\nPRO: If you want to play this game solo for an extended period of time you need challenge and you want an \"opponent\" that will do his best to trounce you. What is even more important FFG is reaching with LOTR:LCG to really dedicated players (who else will buy monthly packs?) that will tweak their decks time and time again to finally beat the scenario, players that will develop new strategies, synergies just to increase their chances (or enjoyment in case of theme decks). Would you be really interested in the game if anyone could beat all scenarios by say 6th play?\nCON: I agree that FFG is loosing more casual solo players by not including simpler scenarios … but are those casual solo players a core audience? I am afraid they would play, win scenarios and forget about the game. There might be a few of them that would seek more challenging quests but most of them (when I read reviews or talk on polish boards) do not seem to be interested in constantly improving their skill and decks - they want to win and that is all.\nSolution?: I would steer those players to excellent NinjaDorg's scenarios. I think they are much better at gently applying pressure (or spreading it throughout the quests). I think they loose some of the replay value due to that by giving you time to build up but maybe this is what casual players want.\n\nSIDE NOTE: I think that many players make mistakes in the rules that make this game so hard but those can be only caught through extended discussions on the forums which rarely takes place (as in this case)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653555","commentId":653555,"userName":"MyNeighbourTrololo","timestamp":1341366948,"content":"Well, as far as I'm concerned, I did no rule mistakes in my play. I'm very careful.\n\n \n\nAlso, what I think, is that would be nice if core set featured 5 scenarios instead of 3, one of them was between first and second in terms of difficulty, and one of them was between second and third in same terms. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653576","commentId":653576,"userName":"player543086","timestamp":1341375651,"content":" I do not claim you play it wrong, although it is still a possibility, this was just a general comment.\n\nAs for difficulty level of the quests I mostly agree with you that FFG missed some oprotunity here but as I wrote before there are NinjaDorg's excelent scenarios that fill the void you are talking about. I think FFG was paranoid about realeasing game that was too easy that is why they decided to go for 1 easy and 2 difficult 1 dificult and 1 near-impossible one) quests in ordder not to loose hardcore players that would quit playing after second easy scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653877","commentId":653877,"userName":"booored","timestamp":1341437942,"content":"wojo said:\n\nPRO: If you want to play this game solo for an extended period of time you need challenge and you want an \"opponent\" that will do his best to trounce you. What is even more important FFG is reaching with LOTR:LCG to really dedicated players (who else will buy monthly packs?) that will tweak their decks time and time again to finally beat the scenario, players that will develop new strategies, synergies just to increase their chances (or enjoyment in case of theme decks). Would you be really interested in the game if anyone could beat all scenarios by say 6th play?\n\nI do not buy that argument at all. The point of a game is to be entertaining. If it isn't fun from the start no one is going ot put the time in. You can not make a game and then say.. well if you play it for 20 hours it will start to get fun. The game needs to be fun the momnet you start playing, they can ramp the dificulty in the APs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653929","commentId":653929,"userName":"mr.thomasschmidt","timestamp":1341449193,"content":"booored said:\n\nwojo said:\n\nPRO: If you want to play this game solo for an extended period of time you need challenge and you want an \"opponent\" that will do his best to trounce you. What is even more important FFG is reaching with LOTR:LCG to really dedicated players (who else will buy monthly packs?) that will tweak their decks time and time again to finally beat the scenario, players that will develop new strategies, synergies just to increase their chances (or enjoyment in case of theme decks). Would you be really interested in the game if anyone could beat all scenarios by say 6th play?\n\n \n\nI do not buy that argument at all. The point of a game is to be entertaining. If it isn't fun from the start no one is going ot put the time in. You can not make a game and then say.. well if you play it for 20 hours it will start to get fun. The game needs to be fun the momnet you start playing, they can ramp the dificulty in the APs.\n\n\n\nI have to agree on that. Actually what I think it comes down to is that the biggest mistake FFG ever made with this game was to include that tiny section about tournament rules. If they hadn't we wouldn't have had this discussion at all :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nCompared to CoC, aGoT and W:I I find this as a co-op game not really suitet for competition. One could always make all games regardless of the intentions and rules into competition, but I just don't buy it for this game. AND even if there has been/is much talk about tournaments from FFG I hornestly doubt we will ever see anything but fan made tournaments. We'll see at the upvcoming game con but I doubt it. I think it would be best to just let the idea of a LOTR LCG tournament have a peacefull death ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] now take the fire and run with it :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653958","commentId":653958,"userName":"player543086","timestamp":1341455895,"content":"booored said:\n\nI do not buy that argument at all. The point of a game is to be entertaining. If it isn't fun from the start no one is going ot put the time in. … The game needs to be fun the momnet you start playing, they can ramp the dificulty in the APs.\n\nI agree with you and stand by my statement at the same time :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The whole difference between our opinions is summarized in you statement:\n'The point of a game is to be entertaining.'\nSo far no one created a game that is entertaining for everyone and I even think that it will never be done. So as a designer/publisher you have to ask yourself who (what kind of players) do you want to entertain with your product? I think that FFG decided to go for dedicated/hardcore solo players (more casual in case of 2 or more). That is why they included challenging quests in base game.\n\nIs it a business mistake on their part not to go far casual players? I don't know but my gut felling tells that no: they could gain sales on the base set but might loose sales on APs (I think casual gamers would not buy them and some hardcore players would be turned of by easy time they had with the core)\n\nAs for tournaments:\nI would love to be wrong but I think it will never happen - agree with mr.thomasschmidt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=653976","commentId":653976,"userName":"MyNeighbourTrololo","timestamp":1341462076,"content":"I think they'll launch tournament when there'll be plenty of space for deckbuilding.\n\nThere is some space for it now, yes, but there is also many unfinished stuff that needs to be taken care of before. For example - Secrecy needs more card, Rohan and Gondor theme is not uncovered, Hobbits'd enjouy some additional cards'n'heroes for them, elves too, I bet. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654083","commentId":654083,"userName":"Glaurung","timestamp":1341485170,"content":"Yes sound like we can forget about tournaments for this game. But then what the point of scores system? Only for the quest Log?\n\nSounds like they have idea to make tournaments system but after they release the game they change they minds. Maybe we will see it in the future…..just maybe. But for now is buried for sure.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654101","commentId":654101,"userName":"mr.thomasschmidt","timestamp":1341488172,"content":"Glaurung said:\n\nYes sound like we can forget about tournaments for this game. But then what the point of scores system? Only for the quest Log?\n\nSounds like they have idea to make tournaments system but after they release the game they change they minds. Maybe we will see it in the future…..just maybe. But for now is buried for sure.\n\n \n\n\n\nExactly. The victory points could be used to just measure your own progress, like beating ones own high score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654126","commentId":654126,"userName":"booored","timestamp":1341490451,"content":"mr.thomasschmidt said:\n\nExactly. The victory points could be used to just measure your own progress, like beating ones own high score.\n\nVictory points have a gameplay function. It is really a exile zone for the encounter deck, and while there are only a few cards that utilise it so far we have already seen , wel la few cards. So while yes the tournament scene will nvr happen, and the score and quest log is a total farce, the victory pile itself, as a game mechanic is a good thing.. as it just gives the designers one more thing to play about with when designing card effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654144","commentId":654144,"userName":"Tromdial","timestamp":1341492718,"content":"I use the scoring system merely as a means to measure success between friends and/or myself (solo play) and also to show off how you managed to fair in an insanely difficult quest. Half the time it's a slaughter house, but we'll see if the Dwarrowdelf cycle that I just ordered improves my odds. Thus far I've beaten Passage through Mirkwood several times, Hunt for Gollum, Hills of Mull Duil (?), and barely defeated once with friends Down the Anduin.\n\nTrololo, try using a purple/green combination, and maybe throw blue in if you can fit it, as Dunhere is very handy on picking off the snipers.\n\nI use the two green snares, 3 gandalfs, 2 sneak attacks, and 2 steward of Gondor cards, at least. Anything with heal is a bonus. Use the hero Berevor for sure, as you want good card draw to feed the attachment that buffs your questing via discard. I also use Gloin and heal him typically with Glorfindel (but if you are splashing blue, I might try another tactic).\n\nOn a side note, also a Dunhere (blue), Thalin (red) combo is very nice in killing lots of the enemies in the staging area. Then use also Quick Strike with Dunhere, untap him with Unnatural Swiftness attachment and do a normal attack with him later is also a good red/blue tactic.\n\nJust using the core, that's the best advice I can give you. As advertized as a Living Card Game, I believe they made the 2 scenarios so hard so that you would purchase upcoming adventure decks and expansions. It wouldn't be a living card game if even just the Anduin was more easily beatable, as people would probably just settle for the core box and treat it as any other board game. This one was meant to be collected. Still, with solo play, I haven't yet beat Anduin but that could be I don't have the time, as I work 12 hours a day usually, 7 days a week. Good luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654156","commentId":654156,"userName":"Tromdial","timestamp":1341494627,"content":"Knowing your limited resources, I'd consider maybe the box expansion of Khazad Dum. Reason being is it has one level 3 difficulty scenario, so you'd get more money for you buck, Zigil Miners, which give you a resource buff if you can figure out how best to utilize them. The box also gives you a green hero named Bifur. Specifically for beating the Anduin a little easier, if you are using him, one other green hero (i.e. Beravor) and Dunhere, you can steal Dunhere's resource into green, meaning you can Snare the troll right off the first round and build your deck slowly up with Zigil Miners and other cards. Make sure that once you quest, you can defeat within two rounds the second stage card of Anduin. Also, be sure to utilize mulligan rule if that opening hand doesn't draw you what you need the first time.\n\nIf using purple, use Gandalf and Sneak Attack during the Combat Phase immediately after your enemies receive their facedown shadow cards. This way when Gandalf shows up, he blasts one for 4 (hopefully a kill) and is ready to block or attack for the phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654166","commentId":654166,"userName":"Runix","timestamp":1341497033,"content":"wojo said:\n\nI think that FFG decided to go for dedicated/hardcore solo players (more casual in case of 2 or more). That is why they included challenging quests in base game.\n\n\n\nI agree that that would appear to be the intent, but I think that it was a big mistake.\n\nFFG had the perfect opportunity to create an entry-level customizable card game.  The existing powerhouses in the industry - Magic and a couple of its close competitors - already have a firmly established reputation for being expensive treadmills that require a lot of money on an ongoing basis to have any chance of being competitive.  FFG very intelligently countered that by designing a system where players could get in quickly with a full starter set, while controlling costs due to fixed card distribution.  It was a great idea, and long overdue.\n\nUnfortunately, they dropped the ball by not targeting players new to this type of game.  Lord of the Rings would have been the perfect introduction - it is a popular theme, with accessible and straightforward gameplay, and perfectly suited for solo play.  It's the one title a brand new player will be most likely to pick up off the shelf.\n\nInstead, the brand new player opens up the box, gets hit with scenarios that are clearly designed for players with a lot more experience and a lot of expansion packs, gets frustrated, and gives up.\n\nIt's a mystery to me why FFG decided to use this title to compete for the money of very serious veteran gamers, when they already have a vast array of products to choose from - including several other titles in FFG's own library.  Where does the new player get started?  Certainly not here, nor in their other LCGs which have more or less followed the approach of catering to veterans.\n\nIt's been a huge misstep from a marketing perspective, and a missed opportunity to add a lot of new gamers to the scene."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654237","commentId":654237,"userName":"HilariousPete","timestamp":1341509130,"content":"Runix said:\n\n \n\nInstead, the brand new player opens up the box, gets hit with scenarios that are clearly designed for players with a lot more experience and a lot of expansion packs, gets frustrated, and gives up.\n\n \n\n \n\nYes, I guess that happens often for solo players if they want to use tournament-compliant decks.\n\nRunix said:\n\n \n\nIt's a mystery to me why FFG decided to use this title to compete for the money of very serious veteran gamers\n\n \n\nI don't think this is intentional by FFG. Dol Guldur is designed to be hard, that's true, but I think they wanted Journey Down the Anduin to have medium difficulty. (In a 2 player game, when you play with non-tournament decks, that quest is doable.)  But at that time, they hadn't developed methods to achieve proper scaling. Take 1st quest card for example: 1 card plus Hill Trill if you're solo - pretty difficult - but 4 cards and 1 Hill Troll in a 4 player game (-> 12 heroes): doable. Scaling is even worse in Dol Guldur. But FFG is improving on scaling, in KD there is a location that requires X progress tokens, where = number of characters in play, and so on…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654352","commentId":654352,"userName":"mr.thomasschmidt","timestamp":1341534295,"content":"Runix said:\n\nwojo said:\n\n \n\nI think that FFG decided to go for dedicated/hardcore solo players (more casual in case of 2 or more). That is why they included challenging quests in base game.\n\n \n\n \n\nI agree that that would appear to be the intent, but I think that it was a big mistake.\n\nFFG had the perfect opportunity to create an entry-level customizable card game.  The existing powerhouses in the industry - Magic and a couple of its close competitors - already have a firmly established reputation for being expensive treadmills that require a lot of money on an ongoing basis to have any chance of being competitive.  FFG very intelligently countered that by designing a system where players could get in quickly with a full starter set, while controlling costs due to fixed card distribution.  It was a great idea, and long overdue.\n\nUnfortunately, they dropped the ball by not targeting players new to this type of game.  Lord of the Rings would have been the perfect introduction - it is a popular theme, with accessible and straightforward gameplay, and perfectly suited for solo play.  It's the one title a brand new player will be most likely to pick up off the shelf.\n\nInstead, the brand new player opens up the box, gets hit with scenarios that are clearly designed for players with a lot more experience and a lot of expansion packs, gets frustrated, and gives up.\n\nIt's a mystery to me why FFG decided to use this title to compete for the money of very serious veteran gamers, when they already have a vast array of products to choose from - including several other titles in FFG's own library.  Where does the new player get started?  Certainly not here, nor in their other LCGs which have more or less followed the approach of catering to veterans.\n\nIt's been a huge misstep from a marketing perspective, and a missed opportunity to add a lot of new gamers to the scene.\n\n\n\nI respect that but I couldn't disagree more :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] and I'm not a veteran neither hard core gamer. Just love the game anyway :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654356","commentId":654356,"userName":"booored","timestamp":1341534665,"content":"HilariousPete said:\n\nRunix said:\n\n \n\nInstead, the brand new player opens up the box, gets hit with scenarios that are clearly designed for players with a lot more experience and a lot of expansion packs, gets frustrated, and gives up.\n\n \n\n \n\nYes, I guess that happens often for solo players if they want to use tournament-compliant decks.\n\nThis is a really good point. As the decks are \"supposed\" to be 50 card min, people naturally want to play like that, and it is a good size for a deck building game imo.. but if you only have the core set… you should really be using the smaller deck size .. not a 50 card deck. The smaller deck you have the faster and more reliable it is to pull the card you need.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654376","commentId":654376,"userName":"mr.thomasschmidt","timestamp":1341538810,"content":"booored said:\n\nHilariousPete said:\n\n \n\nRunix said:\n\n \n\nInstead, the brand new player opens up the box, gets hit with scenarios that are clearly designed for players with a lot more experience and a lot of expansion packs, gets frustrated, and gives up.\n\n \n\n \n\nYes, I guess that happens often for solo players if they want to use tournament-compliant decks.\n\n \n\nThis is a really good point. As the decks are \"supposed\" to be 50 card min, people naturally want to play like that, and it is a good size for a deck building game imo.. but if you only have the core set… you should really be using the smaller deck size .. not a 50 card deck. The smaller deck you have the faster and more reliable it is to pull the card you need.\n\n \n\n \n\n\n\nExactly. This is one of the reasons behind my statement earlier in this thread that the biggest mistagke about the game is the little info in the rules regarding tournament. With all respect for those who want to play for the competition of it I think this should never have been the path for this game. It would have created less problems that way :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] No wonder new players get confused. Everyone wanna play the \"right\" way and the small part about the tournament rules just weight so much so most think this is how you need to play in case you want to play with others. But it's perfectly ligimit to play a less than 50 cards deck. I myself feel a little like cheating if I play the core spirit deck and beat JdtA quest not really caring about rounds. But it's a really good and fun strategy. But if you then compare to others you feel inadequate cause \"everyone\" else is going for the fewest amount of rounds and strict 50-cards- no-less-decks.\n\nAs said, FFG should never have mentioned anything about tournament rules, since those that are around are getting debated night and day, and if they hadn't included it hard core fans would have developed their own tournament rules. And with all respect for FFG, the fans would probably have made a better job ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654532","commentId":654532,"userName":"Runix","timestamp":1341567264,"content":"I suppose I agree on that point.  Having a recommendation that players start with a 30- or 40-card deck would be a welcome change to the rules.  Right now the \"easy mode\" recommendation is to skip playing out Shadow cards.  I'd recommend forgetting that and just going with a smaller deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654737","commentId":654737,"userName":"schmoo34","timestamp":1341604653,"content":"I win this mission half as much as I'd like to and I lose it twice as much as I should."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66892-im-done/?do=findComment&comment=654802","commentId":654802,"userName":"mr.thomasschmidt","timestamp":1341624433,"content":"schmoo34 said:\n\nI win this mission half as much as I'd like to and I lose it twice as much as I should.\n\n\n\nEpic!!! I laughed my but off when I read that one gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]"}]}