{"url":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/","title":"Elven Ring of Power","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=652927","commentId":652927,"userName":"Sprenger","timestamp":1341255242,"content":"When they first mentioned the ring, my first thought was that is will be a player card attachment rather than a quest objective because the group would already have said Ring so there would be no reason to search for it. With SaF coming out in the following weeks, now I wonder if it is going to be a unique neutral attachment or will it fall into a sphere. \n\nI guess it could be like the cave torch but it seems like only an Elf character would be able to use it. \n\nAlso what do you think it will actually do?  And if it is discarded from play does it make the quest unbeatable….so many questions "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=653045","commentId":653045,"userName":"lleimmoen","timestamp":1341284982,"content":"Yes, so many questions which bother (or interest) me also and to which I only have vague answers.\n\nWell, I assume it is a player card, objective making no sense to me at all. The sphere should be Lore, what else right? Further, I would guess the bearer would have to be unique Noldor or Istari. But as for the cost and ability, I am puzzled. It would have to be useful generally but the article implies toward a specific use in this quest. At least I see a hint that Indistructable doesn't always have to mean the word."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=653084","commentId":653084,"userName":"richsabre","timestamp":1341296694,"content":"if they rely on it to beat the quest then it should not be a player card- it sort of kills the deck building. it could be an object that you start the game with, then you have to have the willpower to wield it, so you cant just pick it up and unleash havoc…makes more sense that way\n\nif it is a player card it should be expensive as hell"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=653997","commentId":653997,"userName":"Budgernaut","timestamp":1341468063,"content":" Would a ring of power be a good candidate for a secrecy card? I mean, you don't exactly go around Middle Earth flaunting that you have one of the rings of power, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=653998","commentId":653998,"userName":"richsabre","timestamp":1341468146,"content":"that would make thematic sense- i mean there was only about 3 people in middle earth knew gandalf carried one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654133","commentId":654133,"userName":"lleimmoen","timestamp":1341491076,"content":"Budgernaut said:\n\n Would a ring of power be a good candidate for a secrecy card? I mean, you don't exactly go around Middle Earth flaunting that you have one of the rings of power, right?\n\n\n\nYes, that would be really good. If it gets restricted in attachment (as it must) and gets high cost, say 5 with some 3 secrecy discount, it can be powerful in effect without becoming an obvious pick."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654215","commentId":654215,"userName":"DurinIII","timestamp":1341503783,"content":"Some Elf Ring that reads, Quest Action: \"Exhaust 'Said' Ring to lower the combined threat level in the Staging Area by X. X is the number of players in the game. What do you guys think? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654465","commentId":654465,"userName":"Budgernaut","timestamp":1341557694,"content":" I don't want to sound harsh, but for most people it'd basically be like playing a 1-wp ally that can't take a hit for the team. If it's costly, you might as well play Dunedain Quest or Favor of the Lady. I think the ring you described would definitely pull it's weight in Multi-player, though. I'd play it in a 4-player game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654735","commentId":654735,"userName":"DurinIII","timestamp":1341604429,"content":"Exactly man; Make the card cost 0 and it would be worth it…only then, people would call the card overpowered I think.  In a multiplayer game however, as you rightly noted, such a card would be pretty awesome! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654762","commentId":654762,"userName":"Budgernaut","timestamp":1341612204,"content":" Ah, I see. At a cost of 0, but required to be attached to a Silvan or Noldor hero, it limits when it can be used. That could work. True, it would be powerful, but one of those rings should be more powerful than the cards we've seen so far, don't you think. So even if people call it overpowered, well, by golly it should be! I mean, would totally expect a ring of power to trump the Steward of Gondor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654843","commentId":654843,"userName":"lleimmoen","timestamp":1341636472,"content":"Yeah, whilst I find it a nice idea, I also think the Ring should be very powerful - and thus costly. I also like the secrecy discount as this would really push towards the strategy. Currently I am not sold by it at all yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654924","commentId":654924,"userName":"Cunir","timestamp":1341656405,"content":"i think the ring will be there primarily for one reason, and one reason only -- to defeat the balrog.\n\nmaybe it will be attached to someone like elrond at the start of the quest, and you have to get elrond all the way to the end without him dying, and then use him (and the ring) to defeat the balrog. and that's all we can do with it.\n\nhaving it as an attachment that we can use in normal deck-building would be a bit daft. no one else can carry the ring. even gandalf didnt want it. and what advantage did it give frodo? maybe it helped him out a few times, but most of the time carrying it was a huge disadvantage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/66919-elven-ring-of-power/?do=findComment&comment=654935","commentId":654935,"userName":"Robert McMutton","timestamp":1341657534,"content":"Cunir said:\n\ni think the ring will be there primarily for one reason, and one reason only -- to defeat the balrog.\n\nmaybe it will be attached to someone like elrond at the start of the quest, and you have to get elrond all the way to the end without him dying, and then use him (and the ring) to defeat the balrog. and that's all we can do with it.\n\nhaving it as an attachment that we can use in normal deck-building would be a bit daft. no one else can carry the ring. even gandalf didnt want it. and what advantage did it give frodo? maybe it helped him out a few times, but most of the time carrying it was a huge disadvantage.\n\n\n\n \n\nI was thinking something alike. IIRC, we (me at least) have been thinking in Narya, the Fire Ring that carries Gandalf, but as said in another thread that this last adventure pack could be the moment we are going to see Elrond, maybe is him, and his Air Ring, Vilya, the tools to defeat the Balrog in this quest.\n\nOk, maybe I was the only one thinking in Narya and not in Vilya… and I'm sounding a bit silly… but anyway, I have it just typed, so… publish it goes.\n\nGreetings."}]}