{"url":"https://community.fantasyflightgames.com/topic/67105-unique-attachmentsheroes/","title":"Unique attachments/heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67105-unique-attachmentsheroes/?do=findComment&comment=654626","commentId":654626,"userName":"kennoastic","timestamp":1341582308,"content":" If I read the rules correctly I understand that only one of a unique attachment/hero etc can exist in play at the same time.\n\nSo, in a 4-player game, if one player plays Steward of Gondor, no other player can play this card?\n\nAnd also, all 4 decks need to be fine tuned to make sure that no player uses the same hero as another player?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67105-unique-attachmentsheroes/?do=findComment&comment=654641","commentId":654641,"userName":"plueschi2","timestamp":1341584393,"content":" yes and yes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67105-unique-attachmentsheroes/?do=findComment&comment=654655","commentId":654655,"userName":"CJMatos","timestamp":1341586894,"content":"kennoastic said:\n\nAnd also, all 4 decks need to be fine tuned to make sure that no player uses the same hero as another player?\n\n\n\n \n\nAnd that also means that you cannot have the lore and leadership aragorn in play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67105-unique-attachmentsheroes/?do=findComment&comment=654658","commentId":654658,"userName":"kennoastic","timestamp":1341587176,"content":" I understand for flavor it has to be this way - since two Aragorns existing at the same time would make the universe collapse ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nBut kind of annoying calling all my friends just to agree which heroes to build a deck around… Especially if I change my mind half way through deck building.\n\nOr do you solve this by building all the decks yourself and let your friends borrow your decks?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67105-unique-attachmentsheroes/?do=findComment&comment=654683","commentId":654683,"userName":"plueschi2","timestamp":1341591093,"content":" Depends.\n\nIf you are the only one with a playset, I'd say just go for it and build the decks yourself.\n\nIf your friends also own the game, just have 3+ decks ready for you, there should be likely one without overlap.\n\nOr build decks that do not depend on 3 certain heroes. If they want Eowyn? Np, I take Frodo. Legolas is taken? Brand might do the trick. You maybe have a deck that heavily revolves around one particular hero, but very seldom do you need all three lined up on your side. Lets say you play a deck with lots of draw from Beravor (so you bring Unexpected Courage). Now your buddy wants to play her? Let him. Play UC on Beravor anyway and if you are so dependant on card draw he will very likely make you the highest priority target."}]}