{"url":"https://community.fantasyflightgames.com/topic/67146-resetting-decks/","title":"&#039;resetting&#039; decks?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67146-resetting-decks/?do=findComment&comment=655029","commentId":655029,"userName":"Shurdus","timestamp":1341682383,"content":" Hi all, sorry if this is a bit of a noob question…\n\nI want to start playing this game, and I am just starting to learn how to play. I do want to explain the game to my fiance in the near future as well. The obvious way to do that seems to play the tutorial campaign with a 'default' deck. So my question is this:\n\nIs there an obvious way to filter out the cards that go together in a stock deck, so that I can reset the stock decks after I scrambled them a bit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67146-resetting-decks/?do=findComment&comment=655148","commentId":655148,"userName":"mr.thomasschmidt","timestamp":1341708820,"content":" Hi. Welcome to the forum :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWell, there isn't really any default decks other than the four spheres. The only neutral card without a sphere is Gandalf which there's 4 of, one for each \"default sphere deck\"\n\nYou probably know this but you can distinguish which sphere a card belongs to by the icon in the middle right side.\n\nAnd you are right. The best way to begin or introduce the game to someone is with on of these mono sphere decks. (mono=one sphere pr deck)\n\n( And if you want an advise that seems to be really good, you should forget everything about the tournament rules at least for now. It's quiet ok to play non 50 cards decks. It's actually a challenge that takes away the fun for many beginners trying to live up to the 50 cards decks with only the core set. Many solo players get stuck at the 2nd quest Journey down the Anduin because of this, a quest that is really challenging but absolutely doable if you go for a mono sphere spirit deck ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\nI would play the 1st quest Passage through Mirkwood first when introdusing it to you fiancé. But I think I would line the game up and then before you explain the rules I'd watch the toturial videos from FFG together. You can find them at YouTube. As someone else said here at the forum, that video is actually the real \"rule book\" as it explains better than the rules in the box :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAlso, I would strongly recommend you getting this free great document. It's the UNofficial FAQ and has a small explanation for every card in the game about almost everything that might be questionable or misunderstood. I use that a lot and don't have to wait for someone answer my questions at the forum ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] here's the link\n\nhttp://boardgamegeek.com/filepage/66894/comprehensive-card-reference-unofficial-faq [http://boardgamegeek.com/filepage/66894/comprehensive-card-reference-unofficial-faq]\n\nHope some of this helps :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67146-resetting-decks/?do=findComment&comment=655193","commentId":655193,"userName":"Shurdus","timestamp":1341720455,"content":" It helps a ton! Thanks!\n\nSo I understand that the starter decks are nothing more than a collection of all the cards in a certain sphere. I will take a look through the cards to see for myself, so I can hopefully restore the starter decks once I get the hang of the game myself.\n\nThanks again! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67146-resetting-decks/?do=findComment&comment=655257","commentId":655257,"userName":"mr.thomasschmidt","timestamp":1341734830,"content":"You are welcome :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] don't hesitate if there's more that pops up that needs explanation"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67146-resetting-decks/?do=findComment&comment=655267","commentId":655267,"userName":"Budgernaut","timestamp":1341736617,"content":"Shurdus said:\n\nSo I understand that the starter decks are nothing more than a collection of all the cards in a certain sphere.\n\n\n\nAssuming you are only playing with one Core Set, yes. Once you start buying expansion packs, you can tell which cards came in the Core by looking at the lower right of the card where there is a number and a symbol. The symbol for the Core set is a ring, and the symbol for the first cycle (first six expansions) is a spider web. After adding expansions, you can gather all your ring cards together and separate them be sphere as mr.thomasschmidt said and you will have the starter decks all ready to go.\n\nOf course, by time you get an expansion you'll probably know the Core cards so well that you won't forget which ones go in the starter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67146-resetting-decks/?do=findComment&comment=655296","commentId":655296,"userName":"radiskull","timestamp":1341744234,"content":" If you are playing with the Core Set decks, and you are playing solo, do NOT start with Tactics.  You'll save yourself a lot of frustration.  If you're not playing solo, or you're up for a challenge, Tactics is fun."}]}