{"url":"https://community.fantasyflightgames.com/topic/67578-have-ffg-already-announced-the-next-cycle-without-us-knowing-maybe-it-will-use-the-hobbit-cards/","title":"Have FFG already announced the next cycle without us knowing? Maybe it will use the hobbit cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67578-have-ffg-already-announced-the-next-cycle-without-us-knowing-maybe-it-will-use-the-hobbit-cards/?do=findComment&comment=659110","commentId":659110,"userName":"Cunir","timestamp":1342415835,"content":"Given that we are only a couple of weeks away from the last pack of this cycle coming out, combined with how far in advance they usually release news about upcoming expansions and cycles, i am starting to think that maybe the hobbit box IS the next cycle.\n\ni know that they have already said that the hobbit box is a standalone set. but they have said nothing about the second box being a standalone set… have they? (i dont think they have). and that is probably only about 2 1/2 months away.\n\nthe reason i think the hobbit boxes are going to form the basis of the next cycle, is because the next thing that follows on in the book after this cycle (in the appendicies), is all shire-related. the riders start heading towards the shire and bree looking for 'baggins', and the rangers try and track them down and fight them off at the outskirts. that would make a good cycle… hunting down the riders in the wilds before they can get to hobbiton. and they can use encounter cards from the shire all the way up to rivendell, which is what the hobbit box covers.\n\nand because it will take place in and around the shire, they can start giving us a load more hobbit cards too… tying in with the hobbit boxes and the movies. it all makes sense!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67578-have-ffg-already-announced-the-next-cycle-without-us-knowing-maybe-it-will-use-the-hobbit-cards/?do=findComment&comment=659127","commentId":659127,"userName":"Shiv@n","timestamp":1342417991,"content":"The Hobbit expansions are like \"special events\" because of the movie that will be out later this year. It will be 2 \"stand alone\" (need one core set) which will made a great campaign mode in he end. If you add the POD that will surely be released after the gencon about Laketown, you will have a full cycle for you campaign mode.\n\nThose 2 boxes will be out of the normal way of publishing the game.\n\nI'm pretty confident that FFG will release a new full cycle after (or in the same time) the hobbit. One new expansion box and 6 new adventure packs which will need the encounter sets from the previous expension."}]}