{"url":"https://community.fantasyflightgames.com/topic/67662-is-flight-from-moria-really-level-7/","title":"Is Flight from Moria Really Level 7?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67662-is-flight-from-moria-really-level-7/?do=findComment&comment=660065","commentId":660065,"userName":"flightmaster101","timestamp":1342566426,"content":" So for me I have a house rule to use what is provided until I beat a quest, then if I want to go for a etter score or something I can use everything at my disposal.  This led to solo failures on Dol Guldur and Return to Mirkwood, but flight from Moria seemed way easier than these other two.  Last night I figured I would give flight from Moria a shot, but didn't want to go through creating a deck so I took Aragorn, Eowyn, and Gloin and just shoved the core leadership and spirit decks together with 3 Gandalf cards and came within a gnats @$$ of beating it.  I got the misfortune of back to back trolls and got sunk in the next two turns.  With a substitution of Dwalin for Gloin, and some cards from Mirkwood cycle and the expansion I scored 98 in 7 turns!  It did help that I got the tools on my third turn and escape on my fourth turn, but none the less for a level seven quest it seemed really simple.  Did everyone just rush this like I did or did I just get lucky or did FFG just get this one wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67662-is-flight-from-moria-really-level-7/?do=findComment&comment=660083","commentId":660083,"userName":"hildargo","timestamp":1342574866,"content":"I played this quest 3 times tonight with my brother. The first time, we drew 2 Fouled Wells and Shadow of Fear, and New Devilry in our setup. I then drew Sudden Pitfall. Game over in 5 minutes. The next game was similar. The last game was a slug fest, lasting close to 2 hours. This quest is heavily influenced by luck (or un-luck) of the draw. There are some nast Treachery and Location cards in this quest. I enjoy it though. You definitely get the feeling of getting lost in the mine. The only thing that FFG could have done a bit better is to have The Nameless Fear be more incorporated into the quest. All we felt from it was his threat (which was a lofty 10 at the end of the quest). We didn't draw a single copy of A Foe Beyond, and, with exception of the first couple of rounds, we had the staging area well under control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67662-is-flight-from-moria-really-level-7/?do=findComment&comment=660102","commentId":660102,"userName":"Dam the Man","timestamp":1342579788,"content":"FfM is rather a turkey-shoot when it comes to quest cards and treacheries. Stupid Hasty Council, I don't want you!!! Or getting Abandoned Tools the turn after Escape from Darkness was put to the bottom demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] . Still a lot easier than Dol Guldur or Return the Mirkwood, but not a joke DL7 like Carrock or The Long Dark."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67662-is-flight-from-moria-really-level-7/?do=findComment&comment=660194","commentId":660194,"userName":"Glaurung","timestamp":1342594166,"content":"This quest is manage to be more difficult with number of players. Solo is really easy but 2 players much more difficult and so on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67662-is-flight-from-moria-really-level-7/?do=findComment&comment=660644","commentId":660644,"userName":"flightmaster101","timestamp":1342639970,"content":"Dam said:\n\nFfM is rather a turkey-shoot when it comes to quest cards and treacheries. Stupid Hasty Council, I don't want you!!! Or getting Abandoned Tools the turn after Escape from Darkness was put to the bottom demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] . Still a lot easier than Dol Guldur or Return the Mirkwood, but not a joke DL7 like Carrock or The Long Dark.\n\n\n\n \n\nInteresting to hear that being applied to Carrock.  I couldn't get that one for a long while.  Mostly cause my quester is always Eowyn, so I would hit the trolls before I had allies out.  Haven't tried long dark yet, don't think it will intimidate me now that you've said it's pretty easy."}]}