{"url":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/","title":"Deck building consideration: less than 3 cards?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/?do=findComment&comment=660427","commentId":660427,"userName":"Eyedunno53","timestamp":1342615977,"content":"I've recently picked this game up again after taking some time off for other things. (I collected all the expansions, and they were building up, making me feel guilty for ignoring them in their shiney little boxes.)\n\nI was reviewing old articles and came across the recent ones regarding decks. I noticed that several of these will use less than the max 3 copies of various cards. Now, I've played deck building games for a long time and the general idea I've always gone with is: use the smallest deck possible, with max number of the cards you want to play with in order to increase chances of drawing those cards. This has worked out ok with LOTRLCG, as well. But I'm curious what other people think of this.  When do you choose to use less than 3 copies? How does it affect your draw?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/?do=findComment&comment=660476","commentId":660476,"userName":"booored","timestamp":1342619554,"content":"Your correct, in most deck construction games this is the general rule.. and it is in this game as well.. sorta.\n\nYour right.. having as small a deck as possible guarantees that you have a higher chance of pulling he cards you need faster, and having of that deck more than 1 copy of any given card, you can increase that chance.\n\nHowever there is a number of factors that make this rule more a guide line for LoTR.\n\nCard draw is INSANE in this game and there is no max hand size. There are many draw decks about were it is not even surprising to have 20 cards in hand by mid game. This allows you to bend these rules.. if yo uare drawing 4 cards a turn, then it dosnt matter as much about ensuring your draws as even with less cards you have better ods of getting the cards you want, and with no max card size you do not need to get those cards at the correct time.. you can hold on to them and just cast them when needed.\n\nLoTR decks need to be able to function across a lot of ground. Especially if you are a lowly solo player. Solo decks more than most, but all decks in this game are required to react to a vast amount of situations to ensure a decent win ratio. This can mean as drastic as splashing a colour for a single card.\n\nWhat this means is that say the encounter deck has condition attachments. These are fairly bad in most cases so you may want to run Ironhills. Still you know that there is only going to be a few times this card is in the ecnounetr deck as we know the exact encounter deck contents do we need to have 3 Miners? Sure that guarantees we draw them sooner, but do we NEED him sooner.. There is much more of a chance of the condition IF it is ever draw to be more mid game.. so we can hedge our bets.\n\nA lot of the most successful decks play like this. 3 Gandalfs? Why.. can you cast Gandalf during the 1st 1/2 of the game.. is there any reason to draw3 him quickly?\n\nSo while yes you are right but in LoTR it is more about ensuring your deck engines and combos are drawn quickly and then stacking your deck with cards you need to survive all the various problems the encounter deck could throw. This will often mean that if you only ahve 3 of every card, then you can simply not defend vs some problems and on a single card flip you wil die. So the best decks.. and by best I mean ones with high win ratios.. are usally like that and with card draw so these option cards can be held in hand untill the exact moment they are needed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/?do=findComment&comment=660573","commentId":660573,"userName":"lleimmoen","timestamp":1342629135,"content":"I go with three copies; and try to find ways to use the copies I might not need - it almost never happens I draw a card I wouldn't/couldn't use in one way or another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/?do=findComment&comment=660609","commentId":660609,"userName":"starhawk77","timestamp":1342633345,"content":"I only have one Core Set, so I use fewer than three copies of cards like Unexpected Courage, Steward of Gondor, etc. I've never really minded; in fact, not having a full playset of every card actually forces me to include a more diverse array of solutions to various encounter deck threats. I agree with booored that flexibility is paramount, so it can definitely be worthwhile to include one or two copies of certain \"silver bullet\" cards (whereas three might get a bit unwieldy). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/?do=findComment&comment=660768","commentId":660768,"userName":"lleimmoen","timestamp":1342665791,"content":"I agree with the above also but it would cause me so much headache figuring out which card not to include three times that I gave up on this (so far). As I said though, I don't think I have ever lost a game due to having too many copies of a card (but maybe because of not having a different card instead?)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/?do=findComment&comment=660903","commentId":660903,"userName":"Eyedunno53","timestamp":1342693747,"content":"Thats the same position I'm in. I understand having a wider selection to deal with more diverse situations… but I cant seem to decide which to only include one or two of.  I guess it would be easy if I didn't play with Eowyn. With her, there is never a dead card in my hand (already have an Steward of Gondor?  Just toss the copy to her for extra willpower.) I mean, I guess if a card hung out in my hand half the game and I never considered using it, then I drew another one, that would be an obvious canidate. But what if I typically use every thing in my hand? :S I haven't even delved into the Kazadum and Darrowdelf expansions yet, with will only add to my confusion xD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67695-deck-building-consideration-less-than-3-cards/?do=findComment&comment=660955","commentId":660955,"userName":"lleimmoen","timestamp":1342697911,"content":"Yeah, in each deck I am playing I am either using Éowyn, Protector of Lórien, Zigil Miner + Gildor Inglorion, or Háma. As I said, the cards you won't play still have a meaning. And the probability of getting a card early goes down dramatically between three and two copies; even with a massive card draw, the early rounds are often most important and to have a card or not can make a difference, and so can the third copy.\n\nOur playing group shares all the cards, so we have multiple core sets and having three of which is not a big problem - although we haven't bought any of the expansions more than once. That doesn't mean I'm happy with ffg's decision to have 1 copy of Unexpected Courage in the core set. However, the growing card pool can make even such a greatly powerful card not essential in every (Spirit) deck."}]}