{"url":"https://community.fantasyflightgames.com/topic/67722-gwaihir-hero-or-ally/","title":"Gwaihir, Hero or Ally?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67722-gwaihir-hero-or-ally/?do=findComment&comment=660655","commentId":660655,"userName":"Zdawg88","timestamp":1342642258,"content":"So a while back a link to the artwork for Gwaihir was posted here.  For those who haven't seen it here it is:\n\nhttp://jakemurray.deviantart.com/art/Gwaihir-King-of-the-Eagles-273664009 [http://www.google.com/url?sa=t&rct=j&q=gwaihir%20lord%20of%20the%20rings%20lcg&source=web&cd=3&ved=0CFkQFjAC&url=http%3A%2F%2Fjakemurray.deviantart.com%2Fart%2FGwaihir-King-of-the-Eagles-273664009&ei=fF8HUIb3AeHi0QHP-9HEAw&usg=AFQjCNEhB9oxrzqc1bn3W3TdzSHq_25qrg&cad=rja]\n\nThis was done by the same guy who did the artwork for the Hardy Leadership card that was spoiled a few weeks back and is in the next adventure pack.  One thing I noticed to from the website, it looks like this was posted last year and it hasn't shown up yet in the card game.  Does that mean the Gwaihir will make an appearance in the next adventure pack?  I think it is a possibility, either that or in the Hobbit expansion.  Could he be the next Hero, or jut an Ally?\n\n \n\nSo I thought it would be fun to speculate on whether Gwaihir would be made into a Hero card or an Ally.  I hope that they would make a Hero card for him.  Either stay with the Eagle theme and put him in the Tactics sphere, or I could possibly see Leadership sphere as well seeing as he is the King of the eagles.  I forget where we are with the current breakdown on the amount of Heroes from each sphere, so I'm not sure what's coming next. \n\nI would guess he would have a high threat, maybe somewhere between 10-12.  Maybe 2 willpower, 3 Attack, 3 Def, 4 Hitpoints.  I'm not sure on an ability for him.  In the books the eagles seem to be transporting the main characters around a lot, so maybe have some ability that gives will power bonuses to other heroes or something.\n\n \n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67722-gwaihir-hero-or-ally/?do=findComment&comment=660714","commentId":660714,"userName":"Bullroarer Took","timestamp":1342652942,"content":" My thought is that if we were going to see him as a hero we would have seen him as a hero during Mirkwood when all the eagle allies were coming out.  Now I think the best chance is to see him as an Ally during one of The Hoobit sagas.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67722-gwaihir-hero-or-ally/?do=findComment&comment=660929","commentId":660929,"userName":"Abelard3","timestamp":1342696371,"content":" I can see him having a similar effect to Dain in giving bonus stats to eagle allies.  Otherwise perhaps something to do with lowering the cost of eagle cards.  Whether as a hero or an expensive ally.. who knows."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67722-gwaihir-hero-or-ally/?do=findComment&comment=660986","commentId":660986,"userName":"lleimmoen","timestamp":1342700326,"content":"Ally. I feel it cannot be otherwise.\n\nNice Artwork. Expecting the card in the Hobbit saga."}]}