{"url":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/","title":"how often do you attach on allies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=661795","commentId":661795,"userName":"richsabre","timestamp":1342875379,"content":"i have never really bothered with this, but with new allies such as erebor battle master + dwarrowdelf axe + ~10 dwarf allies its hard to ignore now\n\nhowever i am still wary as there are many effects which can easily get rid of allies if you are out of treachery cancellation, and thus getting rid of all your precious attatchments which would be safer on heros (attatchment discarding effects aside for the time being)\n\nfor instance in my last long dark game i discarded 17 cards as i didnt want the lost effect to trigger as it would kill my battle master and 2 other allies\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=661798","commentId":661798,"userName":"Glaurung","timestamp":1342875825,"content":"I use to attach BBrand to Haldir and Gildor sometimes. Also attach Rivendell Blade to new Troll scout."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=661980","commentId":661980,"userName":"starhawk77","timestamp":1342928810,"content":"Very rarely, for two reasons:\n\n1) There aren't many attachments that can be attached to allies.\n\n2) As you noted, rich, allies are considerably more fragile than heroes, and losing several cards to an ill-timed treachery can be really back-breaking.\n\nI also definitely would NOT put Dwarrowdelf Axe on the Battle Master except in very specific situations. Quite simply, the Battle Master can reach astronomical attack levels without the Axe; it's usually just going to be overkill. Glaurung's Rivendell Blade/Trollshaw Scout example is a good idea, though--great way to get maximum mileage out of the Scout's ability. That's probably one of the only times I might--might--play an attachment on an ally INSTEAD of an eligible hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=661991","commentId":661991,"userName":"richsabre","timestamp":1342935056,"content":"theyre all good points starhawk, and i never really thought about the overkill with the axe (haha no pun intended)……i tend to have a weakness to overpower 1 character instead of trying to round off my entire party….of course the specific situation you refer to is bosses, and then battlemaster really shines\n\ni would like to see some attatchments tailored to allies- maybe a UC or a PoL type attatchments"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=661994","commentId":661994,"userName":"Eric W","timestamp":1342935937,"content":"I do it all the time.  Specially in a dwarf deck where you usually have a lot of fodder allies, making 1-2 of the big allies into a hero like character can win more games than not.\n\n \n\nVeteran of Nanduhirion with a Ring Mail and maybe some boots becomes a very good tankers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=664343","commentId":664343,"userName":"Golden_Nightingale","timestamp":1343334633,"content":"Yesterday I played Foundations of Stone and put not one, but TWO Dwarrowdelf axes on a Veteran Axehand. Dain was an uber defender (5 defense, possibly 7 with Durin's Song). It worked out well for me especially when I pulled out a Battle Master late in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=664480","commentId":664480,"userName":"Budgernaut","timestamp":1343368603,"content":"richsabre said:\n\ni would like to see some attatchments tailored to allies- maybe a UC or a PoL type attatchments\n\n\n\nI like this idea. And also a hero equivalent of Ever Vigilant. But to those with 2 or 3 Core Sets, it's probably overkill. I wouldn't know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=664498","commentId":664498,"userName":"Rapier1","timestamp":1343372580,"content":"Budgernaut said:\n\nrichsabre said:\n\n \n\ni would like to see some attatchments tailored to allies- maybe a UC or a PoL type attatchments\n\n \n\n \n\nI like this idea. And also a hero equivalent of Ever Vigilant. But to those with 2 or 3 Core Sets, it's probably overkill. I wouldn't know.\n\n\n\nI don't think FF should cater to people that bought 2-3 core sets, I'm sure they'll be a minority compared to people that didn't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=664502","commentId":664502,"userName":"plueschi2","timestamp":1343373049,"content":"Glaurung said:\n\nI use to attach BBrand to Haldir sometimes. \n\n\n\nI am really a fan of this. And then spread the love with his sentinel.\n\nOutside of that I often end up with 1 or 2 copies of Born Aloft in my decks, which of course only attach to allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=664506","commentId":664506,"userName":"Rapier1","timestamp":1343373617,"content":" On topic - almost never. Burning Brand on Halidir is about the only time.\n\nThere's plenty of times I've thought, hey I could put Dunidain something on an ally and then remembered I can't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=664637","commentId":664637,"userName":"schmoo34","timestamp":1343390533,"content":"I can't remember the name of the attachment, but it is the one where you can exhaust the card to heal 2 points of damage every round.  I use that on allies a lot but it is certainly situational.  Many quests like journey down Anduin have treachery cards which damage heroes and allies committed to the quest, etc. and I have, at many times given this attachment to an ally in order to keep him/her alive due to these treachery cards.  Obviously, this is for a deck where I am getting most of my willpower from allies and is situational.\n\n \n\nI do agree with others that attachments are usually given to heroes.  On some occasions I've gotten more than one elven sword and after giving the first to Glorfindel, I'll give another to an ally because you need to use it somehow…and -3 defense is quite powerful, especially against trolls and some of the orc cards. As someone else mentioned, the battlemaster is so powerful in his own right, he can usually kill an encounter card all by himself.  In a similar capacity, I'll use attachments like the elven sword to reduce the defense of multiple aggro so it is easier to kill multiple creatures rather than just one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67843-how-often-do-you-attach-on-allies/?do=findComment&comment=664646","commentId":664646,"userName":"booored","timestamp":1343391253,"content":"I do not think there is any real right or wrong about this… depends on your deck..\n\ncharacters are weaker there is no doubt, but there is more and more character attachments and i think it will become more and more attractive to use them. I think the Silvian attachment is pretty cool. The guy that ignores defence + range is VERY nice on that guy. And the blade is nice as well on the other silvians..\n\nStill yeah.. not many cards have this option so it is hard to judge.. basically I think the only reason people do not do it more is that there are so few options still.\n\nschmoo34 said:\n\nI can't remember the name of the attachment, but it is the one where you can exhaust the card to heal 2 points of damage every round.\n\nmed_self-preservation-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_self-preservation-core.jpg]"}]}