{"url":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/","title":"my thoughts on the thematic problems the shire pack will raise","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=661995","commentId":661995,"userName":"richsabre","timestamp":1342936539,"content":"if theres one cycle i am looking forward to its the shire. its my favourite area of middle earth and i cannot wait to see the artwork.\n\nhowever i have been thinking how the designers would takle such a task- the shire is a protected area with very little danger in 3rd age middle earth.\n\nthen i thought well how is the shire so protected in the first place?…….the rangers…..so how about not just having our hobbits as focus in the cycle, but also the dunedain?\n\nthe climax of the cycle for instance could be around holding back enemies at Sarn Ford, that way it gives some real danger to the situation in line with the end packs of the other cycle (though how you top a balrog i dont know)\n\nthe other packs could of course take us through some of our favourite areas- woody end, maggots farm, the old forest and the barrow downs (not technically the shire i know but it doesnt really make a difference) fighting off old man willow (after getting lost in the old forest…cue long dark type pack) and the wights, and perhaps fleeing some nazgul (who could be scouting for a potential invasion) in the the earlier packs to give the 'first book' feel. we could then team up with some rangers who have gotten wind of an approaching army of goblins and wolves and try and hold them back- the fate of the shire lies in our hands……\n\nall this stays in line with the lore and doesnt break any major rules that havnt already been crossed in previous cycles, whilst giving the shire a real sense of danger and peril………..the only major lore breaker is that the nazgul enter the shire earlier which crosses the fact they will search for it later…..but seeing as we have had all sorts of lore breakers that are worse i dont see it as too bad\n\nrich\n\nEDIT- scratch that last point - i think the nazgul is too much lore breaking ….perhaps fleeing from spies?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=661998","commentId":661998,"userName":"lleimmoen","timestamp":1342940634,"content":" I think you have just outlined much of what could (and I hope will) happen. Keeping the borders protected could be a primary story line, potentially stretching the plot further a few miles in any direction. The likes of Buckland or Bree should be naturally included but perhaps Towers Hills or Even Grey Havens may be also. The quests within the Shire could be no less interesting, and I would not mind if they shall be a bit less scary than what is the usual approach. Uncovering spies in Bree could be a lot of fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=662074","commentId":662074,"userName":"Dain Ironfoot","timestamp":1342961966,"content":"did i miss something…are we getting a Shire cycle?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=662092","commentId":662092,"userName":"richsabre","timestamp":1342964902,"content":"Dain Ironfoot said:\n\n \n\ndid i miss something…are we getting a Shire cycle?\n\n \n\n \n\nno this is purely speculation, though i think its a given that we will at some point (personally i think after the hobbit)\n\ni thought given all the arguing going on id try posting an interesting thread where lore orientated players can post their thoughts"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=662122","commentId":662122,"userName":"Cunir","timestamp":1342970502,"content":"i would love there to be a shire cycle as well, if only for the locations.\n\nbut how about a cycle that follows bilbo all the way to rivendell? after his big party he leaves frodo and the shire, and somehow makes it all the way to rivendell without incident. did anything actually happen on that journey?\n\nand that cycle would tie in perfectly with the hobbit expansion that's coming up -- because we'd have bilbo and the new baggins sphere. and we might even get some extra use out of the \"treasures\" that he aquires in the hobbit expansion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=662128","commentId":662128,"userName":"richsabre","timestamp":1342971176,"content":"Cunir said:\n\n \n\ni would love there to be a shire cycle as well, if only for the locations.\n\nbut how about a cycle that follows bilbo all the way to rivendell? after his big party he leaves frodo and the shire, and somehow makes it all the way to rivendell without incident. did anything actually happen on that journey?\n\n \n\n \n\ni cant remember if his journey was talked about, but im pretty sure he was with two dwarves (well thats what i remember from the first drafts in the history series….cant remember now if tolkien changed it)\n\ni think with him taking the roads it was fine….after all frodos journey was only so perilous because he was pursued by ringwraiths and was forced to take some dangerous short cuts…so to follow bilbo we'd miss out all the key locations frodo was forced to take\n\ni like your thinking though….a journey from hobbiton to rivendell would make for an epic cycle\n\n1. the shire\n\n2.the old forest\n\n3.barrow downs\n\n4.breeland/midgewater\n\n5.lone lands/weathertop\n\n6. trollshaws\n\nnice\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=662357","commentId":662357,"userName":"Bohemond2","timestamp":1343037290,"content":"At this point, I would love to get a confirmation of any cycle in the foreseeable future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=662365","commentId":662365,"userName":"richsabre","timestamp":1343038542,"content":"Bohemond said:\n\nAt this point, I would love to get a confirmation of any cycle in the foreseeable future.\n\n\n\nhaha yeah thats a fair point"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=662498","commentId":662498,"userName":"Cunir","timestamp":1343051998,"content":"do we actually know for sure that \"The Hobbit\" expansion won't provide any of the encouunter cards for the next cycle? I'm not sure that we do. A lot of people (including me, before today!) are assuming that the quests will be a standalone set (along with the follow-up box later in the year), and that we will get another expansion soon after which will kick off the next cycle. But I've just had a read through of all the news that has been released about The Hobbit so far, and nowhere does it say that the quests are a standalone set. There is nothing in there to suggest that the encounter cards won't form the core of the next cycle.\n\nI'm starting to think that it will kick off the next cycle -- even if the next cycle is nothing to do with The Hobbit. After all, its just a collection of locations and enemies. Why can't they be used in the next cycle? And that would explain why we haven't had any news about the next expansion yet -- because they've already given us some… we just didn't realise it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=667835","commentId":667835,"userName":"Mr Coffee","timestamp":1343926034,"content":"richsabre said:\n\nif theres one cycle i am looking forward to its the shire. its my favourite area of middle earth and i cannot wait to see the artwork.\n\nhowever i have been thinking how the designers would takle such a task- the shire is a protected area with very little danger in 3rd age middle earth.\n\nthen i thought well how is the shire so protected in the first place?…….the rangers…..so how about not just having our hobbits as focus in the cycle, but also the dunedain?…\n\nrich\n\n\n\n \n\nTo quote a famous movie, \"You had me at 'Dunedain' \"… (or something similar to that).  I hardly read the rest of the post after those magical words…\n\nI say a hearty, \"YES PLEASE!\"  From a gameplay perspective, a little more support for the non-dwarven sects would be much appreciated (I do like my dwarven decks, make no mistake).  And yes, there's been MUCH clamoring for more elven (Noldor/Silvan) support.  But I would give my left dangly appendige for some serious Ranger and Dunedain keyword/race love (hell, I'd even settle for helping the arrogant, usurping Gondorians… lol).   I don't even need a full cycle, but PLEASE, FFG, for the love of all that is holy, give us something in addition to the short, bearded, smorgasboard you seem determined to choke us with…\n\nFrom a personal perspective, the Numenorean blood-line is the most intriguing to me (together with the descendants of Hurin), and I would LOVE for this part of the lore to be delved into by FFG…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=667932","commentId":667932,"userName":"PosterIdol","timestamp":1343949275,"content":"Having played Lord of the Rings online for many years (and only just this week started a brand new Hobbit character questing in The Shire), I dare say that there are a lot of things that could be included in a Shire expansion.\n\n \n\nAs we know, The Rangers became protectors of the Shire for many years, so they would be a natural inclusion. The MMO itself introduces a bandit camp to the west of Bamfurlong (where Farmer Maggots farm is) in a wood area close to Woodhall. That plays a major threat to the Shire early on in the Prologue for the game (and ties into the idea that the bandits are all being pulled together by the mysterious \"Chief\" Sharkey. There is also a threat from a growing band of wolves commanded by a Warg in Budgeford as well as a spider infestation in the mines located in Scary. In no way are these epic quests as such, but they are ideas that could be incorporated. Even having to escort someone from Michel Delving to Bree could come into play, especially when Hobbits have a need to continuously delay everyone with their endless eating.\n\nAlso just East of the Shire, more into Bree-Land itself we have The Old Forest, crawling with creepy crawlies, Old Man Willow and Tom Bombadil! The Old Forest also has links to the Barrow Downs and in the MMO introduces a dungeon area called Othrongroth, the great Barrow which has become home to a powerful Wight called Sambrog. Then to the north of the Shire is the growing threat of Goblins getting closer to the Brokenborings.\n\nOf course a Shire set could include attachments like Pipe Weed, a bunch of food types (and we already have Mathoms) as well as event cards that are all Hobbit themed. Bree-land itself could then introduce SO much more on top of that. Bring it on I say . . imagine a quest where our heroes are protecting the borders of the shire while we have a farming location where we have to scour the quest deck looking for crops to plant in a field or find Rangers to attach to key Shire locations to prevent enemy attacks to an area.\n\nI'm just writing the first things that come to my head - but I'm sure if FFG where to sit down and put their heads together they could come up with something great!\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668216","commentId":668216,"userName":"Mr Coffee","timestamp":1344005313,"content":"PosterIdol said:\n\nHaving played Lord of the Rings online for many years (and only just this week started a brand new Hobbit character questing in The Shire), I dare say that there are a lot of things that could be included in a Shire expansion…. \n\n\n\nSome fun ideas!  I have been a LOTRO player for a while now myself (bought a life-time sub during beta), but since getting both married (to a non-gamer, no less… lol) and having a kid in the last 6 months, I have seen my online time dwindle to practically nothing.. Sad, but true.  Brownmantle on the boards here also plays LOTRO, and we both \"live\" on the Windfola server.  What server do you run?  I do love that game… the sheer size (make WoW look like a little island) and detail of terrain, as well as TONS of lore buried in the game,  is enjoyable just for running around in…. the actual gameplay just adds to the fun!\n\nSorry, shifted momentarily between my card-nerd and digital-nerd personalities…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668222","commentId":668222,"userName":"Cunir","timestamp":1344007172,"content":"i play LOTRO too, and stuff i remember from the shire and breeland area is… Archet getting attacked and being burned down. I cant remember who burns it down though (its in the turtorial, and i havent played that for a couple of years) and there are loads of hoodlums in the woods around Coombe. i'm pretty sure you have to follow the tracks of one of the black riders as well.\n\nthe bit that i think would make a perfect adventure pack is the old forest. the way they used to do it in LOTRO was great. they didnt even have a map to follow (it's all changed now). They had huge moving trees and spiders and wolves in there, with a few friendly places like the Bonfire Glade and Bald Hill dotted around to provide a bit of relief, and meeting a few friendly faces like Goldberry (is that her name?). and it ended with you somehow managing to find and fight your way to Tom Bombadil's house, on the edge of the forest and the barrowdowns (which would be the next quest in the sequence). …They could do it a bit like how they did it for the foundations of stone, where the route changes everytime you play, to simulate the changing paths of the forest, as the trees move about"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668242","commentId":668242,"userName":"richsabre","timestamp":1344009642,"content":"benhanses said:\n\n \n\nPosterIdol said:\n\n \n\nHaving played Lord of the Rings online for many years (and only just this week started a brand new Hobbit character questing in The Shire), I dare say that there are a lot of things that could be included in a Shire expansion…. \n\n \n\n \n\nSome fun ideas!  I have been a LOTRO player for a while now myself (bought a life-time sub during beta), but since getting both married (to a non-gamer, no less… lol) and having a kid in the last 6 months, I have seen my online time dwindle to practically nothing.. Sad, but true.  Brownmantle on the boards here also plays LOTRO, and we both \"live\" on the Windfola server.  What server do you run?  I do love that game… the sheer size (make WoW look like a little island) and detail of terrain, as well as TONS of lore buried in the game,  is enjoyable just for running around in…. the actual gameplay just adds to the fun!\n\nSorry, shifted momentarily between my card-nerd and digital-nerd personalities…\n\n \n\n \n\ni play lotro but i have to say it doenst come anywhere close to this game….for several reasons\n\nfirstly this game doesnt involve computers, and i dont need to mention what a pain they can be…..\n\nmore importantly though, i find lotro very tedious…i mean the whole game revolves around the aptly named 'grinding' of deeds and quests, kill x amount of y to gain z and so on….it doesnt have nearly so much dept as this game…..but i guess thats my opinion.\n\nplus i cannot abide the community….apart from said company of course (gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]) and a few others, most of the forum over on lotro is just a bunch of 'trolls' trolling on other trolls then complaining about it….the community complains when turbine mess up (which in the players defense of course they often do) and the community complains when turbine give them something as a resolution\n\nmy play in lotro is usually smoking pipe weed around the shire haha…i find those areasin the shire to around the end of bree beautiful- the rest in a bit off on the lore side, especially the lone lands which is horrible\n\ni guess i just dont get the immersion in the middle earth that cards give me\n\nif youre interested i play on dwarrowdelf\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668333","commentId":668333,"userName":"Mr Coffee","timestamp":1344020439,"content":"richsabre said:\n\ni play lotro but i have to say it doenst come anywhere close to this game….for several reasons\n\nfirstly this game doesnt involve computers, and i dont need to mention what a pain they can be…..\n\nmore importantly though, i find lotro very tedious…i mean the whole game revolves around the aptly named 'grinding' of deeds and quests, kill x amount of y to gain z and so on….it doesnt have nearly so much dept as this game…..but i guess thats my opinion.\n\nplus i cannot abide the community….apart from said company of course (gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]) and a few others, most of the forum over on lotro is just a bunch of 'trolls' trolling on other trolls then complaining about it….the community complains when turbine mess up (which in the players defense of course they often do) and the community complains when turbine give them something as a resolution\n\nmy play in lotro is usually smoking pipe weed around the shire haha…i find those areasin the shire to around the end of bree beautiful- the rest in a bit off on the lore side, especially the lone lands which is horrible\n\ni guess i just dont get the immersion in the middle earth that cards give me\n\nif youre interested i play on dwarrowdelf\n\nrich\n\n \n\n \n\nThe grinding does get menotenous…  Having a decent group of peeps to run questlines with makes it a lot more tolerable, particular if they jump into the runs frequently.  I have stopped being a part of their forum a LONG time ago…  Going FTP added some positive things, but the wider base of players did NOT bring in a high-quality calibre of fan, for sure.  Fortunately, myself and Brownmantle have a small base of family/friends that are LOTR fans and dabble in the game, as well as a decent mid-sized OLD kin to run around with.  Otherwise, I wouldn't bother…  the Lone Lands are defiitely blah.  I do appreciate their efforts to open up and create storylines for places that didn't receive heavy treatment in the books, movies, or elsewhere (Forochel, etc.).  Moria was exciting at first, but became overly dreery the more time I spent there.  I thought the \"feel\" of Mirkwood was  pretty decent.  I haven't been on in months, so can't speak to Rohan, but as that surrounding area (and it's inhabitants) are at the top of my fav list, I hope to get back into the game and see if it gets anywhere near my expectation.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668379","commentId":668379,"userName":"Budgernaut","timestamp":1344037435,"content":" A few months ago I downloaded the game (LOTRO), created a hobbit character, played for about 5 minutes, and was just done. It didn't hold my interest at all. I really wanted to get to the point where I could play as a spider, but just couldn't get myself to spend the time to do it. I'm glad I didn't pay for it. I much prefer this game. Granted, I didn't really give the game a chance, but as mentioned above, having a family really limits your ability to do online games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668433","commentId":668433,"userName":"Ted Sandyman","timestamp":1344051196,"content":"PosterIdol said:\n\nHaving played Lord of the Rings online for many years (and only just this week started a brand new Hobbit character questing in The Shire), I dare say that there are a lot of things that could be included in a Shire expansion.\n\n \n\nAs we know, The Rangers became protectors of the Shire for many years, so they would be a natural inclusion. The MMO itself introduces a bandit camp to the west of Bamfurlong (where Farmer Maggots farm is) in a wood area close to Woodhall. That plays a major threat to the Shire early on in the Prologue for the game (and ties into the idea that the bandits are all being pulled together by the mysterious \"Chief\" Sharkey. There is also a threat from a growing band of wolves commanded by a Warg in Budgeford as well as a spider infestation in the mines located in Scary. In no way are these epic quests as such, but they are ideas that could be incorporated. Even having to escort someone from Michel Delving to Bree could come into play, especially when Hobbits have a need to continuously delay everyone with their endless eating.\n\nAlso just East of the Shire, more into Bree-Land itself we have The Old Forest, crawling with creepy crawlies, Old Man Willow and Tom Bombadil! The Old Forest also has links to the Barrow Downs and in the MMO introduces a dungeon area called Othrongroth, the great Barrow which has become home to a powerful Wight called Sambrog. Then to the north of the Shire is the growing threat of Goblins getting closer to the Brokenborings.\n\nOf course a Shire set could include attachments like Pipe Weed, a bunch of food types (and we already have Mathoms) as well as event cards that are all Hobbit themed. Bree-land itself could then introduce SO much more on top of that. Bring it on I say . . imagine a quest where our heroes are protecting the borders of the shire while we have a farming location where we have to scour the quest deck looking for crops to plant in a field or find Rangers to attach to key Shire locations to prevent enemy attacks to an area.\n\nI'm just writing the first things that come to my head - but I'm sure if FFG where to sit down and put their heads together they could come up with something great!\n \n\n\n\n\"Pipe Weed\" - \"Attachment\".  \"Attach to Hobbit character.  Attached character is immune to damage due to being spaced out\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668535","commentId":668535,"userName":"richsabre","timestamp":1344079480,"content":"Ted Sandyman said:\n\nPosterIdol said:\n\n \n\nHaving played Lord of the Rings online for many years (and only just this week started a brand new Hobbit character questing in The Shire), I dare say that there are a lot of things that could be included in a Shire expansion.\n\n \n\nAs we know, The Rangers became protectors of the Shire for many years, so they would be a natural inclusion. The MMO itself introduces a bandit camp to the west of Bamfurlong (where Farmer Maggots farm is) in a wood area close to Woodhall. That plays a major threat to the Shire early on in the Prologue for the game (and ties into the idea that the bandits are all being pulled together by the mysterious \"Chief\" Sharkey. There is also a threat from a growing band of wolves commanded by a Warg in Budgeford as well as a spider infestation in the mines located in Scary. In no way are these epic quests as such, but they are ideas that could be incorporated. Even having to escort someone from Michel Delving to Bree could come into play, especially when Hobbits have a need to continuously delay everyone with their endless eating.\n\nAlso just East of the Shire, more into Bree-Land itself we have The Old Forest, crawling with creepy crawlies, Old Man Willow and Tom Bombadil! The Old Forest also has links to the Barrow Downs and in the MMO introduces a dungeon area called Othrongroth, the great Barrow which has become home to a powerful Wight called Sambrog. Then to the north of the Shire is the growing threat of Goblins getting closer to the Brokenborings.\n\nOf course a Shire set could include attachments like Pipe Weed, a bunch of food types (and we already have Mathoms) as well as event cards that are all Hobbit themed. Bree-land itself could then introduce SO much more on top of that. Bring it on I say . . imagine a quest where our heroes are protecting the borders of the shire while we have a farming location where we have to scour the quest deck looking for crops to plant in a field or find Rangers to attach to key Shire locations to prevent enemy attacks to an area.\n\nI'm just writing the first things that come to my head - but I'm sure if FFG where to sit down and put their heads together they could come up with something great!\n \n\n \n\n\"Pipe Weed\" - \"Attachment\".  \"Attach to Hobbit character.  Attached character is immune to damage due to being spaced out\".\n\n \n\n\n\nha! though of course they must get the munchies and have to play good meal every turn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67867-my-thoughts-on-the-thematic-problems-the-shire-pack-will-raise/?do=findComment&comment=668659","commentId":668659,"userName":"PosterIdol","timestamp":1344114682,"content":" After getting all excited about the idea of the Shire and all of the talk about LotRO, I got excited about the idea of making a set of scenarios that take part in the LotRO universe, using locations and creatures and quest lines from the game.  Feonix has done some great work with custom scenarios, so Id be keen to collaborate with someone to create something enjoyable.\n\nI already have a storyline established and an entire set of cards for the first set of quest (out of a three quest chain).  If anyone is even slightly interested, Id be happy to share those ideas here and get some feedback.\n\nIll post some of it on my own blog NerdGasm [http://www.officialnerdgasm.wordpress.com]soon."}]}