{"url":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/","title":"Song of Ereandil, Wandering Took &amp; Loragorn?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662010","commentId":662010,"userName":"Eric W","timestamp":1342945972,"content":"In a 2 player game, if my partner has Aragorn and we keep swapping a wandering took back and forth until he either gets to 49 threat or I get to 0 threat all the while using Song of Ereandil to reduce my threat increase, then he can use Aragorn's ability to reset his threat.  I'd then have an insanely low threat and he'd have his starting threat.\n\n \n\nPossible?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662150","commentId":662150,"userName":"Nerdmeister","timestamp":1342976779,"content":"Wandering Took let´s the current controller reduce his threat by 3 to give the card to another player who raises his threat by 3 and, at the same time gains control with the card.\n\nIf the new controller was to trigger the ability to switch WT back to the original player then he would reduce his own threat by 3 (since he is not the controller of  WT) and increase the original players threat by 3 again. Thus switching WT back and forth between the same players would only make them alternate between threat levels.\n\nAfaik you can´t use WT to keep increasing the same players threat (and continue decreasing the other players threat)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662151","commentId":662151,"userName":"Nerdmeister","timestamp":1342976942,"content":"Just now noticed the part about song of Eärendil.\n\nSeems to me this wasn´t the intention of those cards but can´t remember anything rules-wise to disallow it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662355","commentId":662355,"userName":"CJMatos","timestamp":1343037155,"content":" Keep in mind that using Song of Earendil, will increase 1 threat level to the player who plays the card and will decrease 1 threat level to player who have previosly raised it.\n\nSo when you give control of WT to the other player, you decrease your threat level by 3 and the other player increase his threat level by 3.\n\nIf then you play a Song of Earendil, you will raise your threat by 1 and the other player will decrease his by 1.\n\n \n\nSo, in pratical terms, if you use this combo you will decrease your threat by 2 and your partner increase his by 2.\n\n \n\nIf this combo his used back and forth, it will not have the reduce one player threat to 0 and the other player to 49 and then use Loragorn to reduce his threat to his original threat.\n\n \n\nPratically:\n\n- A has 29 threat and B has 31;\n\n- A gives WT to B and reduces threat to 26 and B increases threat to 34;\n\n- Then A plays Song of Earendil and increases threat to 27 and B reduces threat to 33;\n\n \n\nHope that this long explain let you understand better this combo you described…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662439","commentId":662439,"userName":"Nerdmeister","timestamp":1343047369,"content":"Sounds like you´re describing song of eälendil as an event when it is an attachement.\n\nThe net gain isn´t great but still there and bot SoE and WT can be activated numerous times.\n\nOr did I misinterpret your intented meaning?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662617","commentId":662617,"userName":"CJMatos","timestamp":1343063451,"content":"Nerdmeister said:\n\nSounds like you´re describing song of eälendil as an event when it is an attachement.\n\nThe net gain isn´t great but still there and bot SoE and WT can be activated numerous times.\n\nOr did I misinterpret your intented meaning?\n\n\n\n \n\nBad english of my part.\n\n \n\nWhen said \"play Song od Earendil\", I meant \"used response from Song of Earendil\"\n\n \n\nThanks for the reminder…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662775","commentId":662775,"userName":"Angus Lee","timestamp":1343097411,"content":"CJMatos said:\n\nPratically:\n\n- A has 29 threat and B has 31;\n\n- A gives WT to B and reduces threat to 26 and B increases threat to 34;\n\n- Then A plays Song of Earendil and increases threat to 27 and B reduces threat to 33;\n\n\n\nAnd to continue this example:\n\n- B gives WT to A and reduces threat to 30 and A increases threat to 30;\n\n \n\n- A gives WT to B and reduces threat to 27 and B increases threat to 33;\n\n \n\n- Then A uses the response of Song of Earendil and increases threat to 28 and B reduces threat to 32;\n\n- B gives WT to A and reduces threat to 29 and A increases threat to 31;\n\n- A gives WT to B and reduces threat to 28 and B increases threat to 32;\n\n \n\n- Then A uses the response of Song of Earendil and increases threat to 29 and B reduces threat to 31;\n\n \n\n \n\n \n\n- B gives WT to A and reduces threat to 28 and A increases threat to 32;\n\n \n\n- A gives WT to B and reduces threat to 29 and B increases threat to 31;\n\n- Then A uses the response of Song of Earendil and increases threat to 30 and B reduces threat to 30;\n\n- B gives WT to A and reduces threat to 27 and A increases threat to 33;\n\n \n\nRinse and repeat, so you can see that B's threat is reducing all the time while A's increasing.  And it is all happening in the same action window, as none of the cards used needs to be exhausted.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67870-song-of-ereandil-wandering-took-loragorn/?do=findComment&comment=662791","commentId":662791,"userName":"plueschi2","timestamp":1343102945,"content":" The short answer is: Yes. If you have Song of Earendil (and the Took ofc) you can increase your threat by X and lower your partners threat by X (if he plays along, that is). Then use Aragorn, no problem.\n\nNow if you BOTH have a Song of Ereandil you can freely adjust the threat between the two of you whenever you have an action window. Think of the possibilites: Both decks in secrecy mode during planning phase, both decks below 35 threat during quest phase. then adjust threat during engagement phase for perfect enemy distribution."}]}