{"url":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/","title":"Missing core cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662815","commentId":662815,"userName":"Nerdmeister","timestamp":1343109131,"content":"Would be nice if FFG would release a booster pack (which I would gladly pay for) with extra copies of the cards that came with fewer than 3 copies in the core pack.\n\nFirst of all it just seems so unfinished, with it being allowed by the rules, and like we´re kinda being played with a bit\n\nSecondly it I´ve noticed some of the devs decks being built up with 3 copies of cards that don´t come with a full set in the core game. If we´re not supposed to have more cards than the core game then it would be good to see devs leading deck creation with the cards they themselves have deemed necessary for the game.\n\nAny thoughts on this?\n\nAnd this is not supposed to be a discussion leading down the road of \"just buy more core game copies\" which is a bit of a stale statement. In my opinion the core game should contain enough cards to allow players to design decks by the rules and their own judgement"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662824","commentId":662824,"userName":"DurinIII","timestamp":1343111104,"content":"You are absolutely right. The core set should not have included less than 3 copies of the Free People's cards; very cheesy.  As far as what may be done to correct it though, beyond somehow purchasing extra core sets or simply buying singles (if you can find them), there is not much else to say unfortunately.  I am with you though man, it sucks that the core set didn't include 3 copies of some cards…and of course, many of the cards not included up to 3 are arguably some of the strongest in the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662829","commentId":662829,"userName":"Nerdmeister","timestamp":1343111908,"content":"Found this on answer on boardgamegeek by FFG\n\n---------------------------------------------------------------------------------------------------------\n\nIn our opinion, the core set provides a *great* experience (YMMV) for under $39.95, allowing players like the one above to enjoy the experience without further cost, and allows dedicated players to expand should they choose to do so.\n\n \n\nI realize there are some differing opinions on this. Know this: FFG had a choice of providing a more narrow replay experience (with fewer card types but more of each card) or a broader experience (with more card diversity and re-playability). For our LCG core sets, we choose the latter. There is no conspiracy, it is a choice between a retail price point, diversity, and card counts. Players who want to maximize every option can, at a very competitive cost, by getting additional core sets to increase the player count and number of cards. Casual players, or people who just want to sample the experience, can do so at a very reasonable cost. Since dedicated players are the ones likely to purchase expansions, we make 3 of every player card available in these monthly release.\n\nWith four different spheres, there are many different combinations and abilities to customize decks in the core set alone. Of course it won't yet compare to other LCG's which have years of support. Also, the LOTR LCG gameplay is a very different game style from anything on the market at this point. Yet, it will be supported vigorously and the diversity will quickly increase. We are working on great content for 2012 already, and I think you'll love what we are releasing in 4Q.\n\nIn terms of timing. The LOTR core set hit retail shops towards the end of April, and we expect to ship the first expansion within roughly 60-70 days of that date (barring unforeseen events) and monthly thereafter (with some small gaps between 6-pack cycles). While I understand, and appreciate there are many folks eager for this to happen sooner, I don't think this window is egregiously long or somehow indicative of FFG dropping the ball. In fact, we get severe complaints when we solicit these decks early (i.e. before the core set ships) which is necessary to do in order to properly inform the global wholesale marketplace of the upcoming product as soon as possible. Damned if we do…\n\nThe game is a huge success for FFG (and for our international partners, especially in Germany, Spain, and France) and we're having a ton of fun playing it in the office. We're flying a few hundred \"Hunt for Gollum\" decks into the country early for this event, so that players can see the new cards and quest even earlier than we had planned and meet other enthusiasts in a FLGS. Being angry at this event is quite silly, as it will be great fun, and has no bearing on the main delivery of the expansions.\n\nTake this information as you will. They are the facts as I know them, and decisions made as we see best for everyone.\n\nThanks,\n\nChristian\nFFG\n\n \n\n--------------------------------------------------------------------------------------------------------\n\nThough it does give an interesting insight into the decission making process, it still doesn´t explain why there hasn´t been a print-on-demand booster pack for the mentioned \"dedicated players\" which would mean alot less material waste (and money waste one might think)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662830","commentId":662830,"userName":"Nerdmeister","timestamp":1343111984,"content":"Btw I´ll mention that I do love this game and play it vigerously whenever I can and love finding new card combinations. This issue is just not up to par with the standard I expect from FFG imo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662839","commentId":662839,"userName":"Budgernaut","timestamp":1343114063,"content":" Let's put this in perspective. At one time, all card games were collectible, with randomized packs. FFG's LCG model broke away from that, but at the same time, they're trying to do just as well (money-wise) while pleasing the players. If I remember correctly, there are around 50 cards you would be able to utilize from a second core set (more if you have multiple players).\n\nNow, over at Miniature Market, they sell 15-card booster packs of Magic for $2.75. If you wanted 50 cards, well, 9 packs gets you close (45 cards) and that comes out to $24.75. However, these are all random and there's no guarantee you'll get the cards you want. In fact, I believe it's guaranteed you won't get all the rares that are available. Meanwhile, Miniature Market offers the LotR Core Set for $25.97. You know exactly how many cards you are getting, and you're getting roughly the same number of cards. If you tried to buy singles for Magic, you'd be spending more than $25, I believe. Don't forget, you'll also get the 3rd and 4th threat tracker in case you get a larger group together.\n\nNow, once you try to get a 3rd Unexpected Courage, it's not as cost effective, but it's still quite comparable to rare-seeking in the CCGs, and the people used to spending that sort of money are the ones they expect to purchase the 3rd core set.\n\nWhile it would be more convenient for us, I think it would be difficult for them to make a separate product to just fill out the cards. They'd have to make new packages and juggle between printing more core sets and more core supplements. It's so much simpler for them to just have the customers buy multiple copies of this one product.\n\nHowever, if FFG were ever to make such an expansion for an LCG, TLotR:TCG is the one to do it with since there are so few player cards. A large part of the box is encounter cards and it would be nice not to have those extra cards just sitting around. With pvp games, most of the cards are player cards so I imagine that relatively few will be total wastes (but I've never bought an LCG besides LotR).\n\nEDIT: Personally, I don't see why any cards in the Core Set are in 3x. I wish they were all 1x and 2x so you get even more variety out of the box, and an even better deal from a second core set. Oh well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662844","commentId":662844,"userName":"mr.thomasschmidt","timestamp":1343114837,"content":"Budgernaut said:\n\nWhile it would be more convenient for us, I think it would be difficult for them to make a separate product to just fill out the cards. They'd have to make new packages and juggle between printing more core sets and more core supplements. It's so much simpler for them to just have the customers buy multiple copies of this one product.\n\n\n\nThey did it with the Warhammer Invasion. I think they did it for both the core set and the first cycle of AP's. So it would be a little effort for them to do it. However, I think that since LOtR isn't a competitive game, not yet at least, they might not really see the pont in setting it in motion. But if they do release such a booster Pack I think they will do it either after/under the Hobbit or after the next cycle. Think they did it after the second or third cycle in W:I"},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662849","commentId":662849,"userName":"Budgernaut","timestamp":1343115848,"content":" Whoa! News to me. I've never heard about a booster pack like that. What was it called? I can't seem to find it anywhere. I'll keep looking, though. If there's a precedent for it, I'm crossing my fingers for SW . . . though I'll probably just buy two core sets of that before they release such a thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662887","commentId":662887,"userName":"player543086","timestamp":1343121042,"content":"mr.thomasschmidt said:\n\nThey did it with the Warhammer Invasion. I think they did it for both the core set and the first cycle of AP's. So it would be a little effort for them to do it. However, I think that since LOtR isn't a competitive game, not yet at least, they might not really see the pont in setting it in motion. But if they do release such a booster Pack I think they will do it either after/under the Hobbit or after the next cycle. Think they did it after the second or third cycle in W:I\n\n \n\n \n\nI think you are mistaken. At least in Poland the FFG's partner (Galakta) never released such a product despite the fact that they are up to date with translation and print of battle packs..  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=662943","commentId":662943,"userName":"Nerdmeister","timestamp":1343126567,"content":"I have been assuming FFG would release a LotR core booster pack shortly after the mirkwood releases. Feeling somewhat restless and forgotten seing as nothing seems to be on the horizon.\n\nI do see the point of wanting to publish more different kinds of cards with core release and given the choice it seems more prudent than having 3 copies of each but only a small handfull to choose from. By that same token I´ll still claim, that releasing a core booster after having seen the game is a success, is at least equally prudent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=663095","commentId":663095,"userName":"Quit2","timestamp":1343142400,"content":" what they could have done, and in my opinion should have done, is release an expansion for 3-4 players, including 2 threat trackers, a few more wound, resource and travel tokens and the \"missing\" cards. \n\nIt could have been sold for quite a good price, like only 5 dollars/euros less than the base game and would have sold very well. But now that many have bought a second (and some even third) base game, that ship has sailed. \n\nAnyway, I am one of those people who bought a second game. I can now accomodate 4 player games, I have more cards and more possibilities. With all the other expansions in my collection, I can now keep about 6 or 7 decent decks alive, allowing choice, variation, etc … without having to do deckbuilding all the time. \n\nSome of my decks work well solo, others are made to work well in multiplayer. When I arrive at my local game store, and they start a game, we can always find decks that match. If we'd all have just one deck, we probably would not be able to play, because everyone would have a hero that someone else has already. With only one core set, I would not be able to keep 6-7 decks ready,p but only 3-4. \n\nSo I don't regret buying the second set. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=663328","commentId":663328,"userName":"Nerdmeister","timestamp":1343175149,"content":"quit said:\n\n \n\n what they could have done, and in my opinion should have done, is release an expansion for 3-4 players, including 2 threat trackers, a few more wound, resource and travel tokens and the \"missing\" cards. \n\n \n\nI would be satisfied with a pack containing the missing cards as we tend to use 10-sided die for counting with 3 or 4 players. It is quite a good idea though and also one I´d have been more than satisfied with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=663358","commentId":663358,"userName":"mr.thomasschmidt","timestamp":1343183556,"content":"wojo said:\n\nmr.thomasschmidt said:\n\nThey did it with the Warhammer Invasion. I think they did it for both the core set and the first cycle of AP's. So it would be a little effort for them to do it. However, I think that since LOtR isn't a competitive game, not yet at least, they might not really see the pont in setting it in motion. But if they do release such a booster Pack I think they will do it either after/under the Hobbit or after the next cycle. Think they did it after the second or third cycle in W:I\n\n \n\n \n\nI think you are mistaken. At least in Poland the FFG's partner (Galakta) never released such a product despite the fact that they are up to date with translation and print of battle packs..  \n\n\n\nDang! I stand corrected. Sorry for getting the hopes up. I was so sure I read that they did it with the W:I. That I read about it about a year ago at the FFG forum as I did some research before going into that game. But can't find it either. Not the thread I might have read or at the product site. I ran through the AGoT and CoC also but nothing. Don't know how I got it mixed up that badly. Anyway, sorry guys."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=663551","commentId":663551,"userName":"Rapier1","timestamp":1343218453,"content":" Best you're likely to get is a 3-4 player expansion that comes withe missing 1x and 2x as well as a bunch of new cards in 3x - 2 new threat trackers and some 3+ player specific quests.\n\nThis product would certainly do well and wouldn't really bother people that bought multiple core sets because having more than 3x one card in a 3-4 player version of the game isn't a big deal (you can run 12 copies of the same card in a 4 player game if all 4 people have it in their deck after all - so having 5-6 of some of the best will hardly be a handicap.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=788934","commentId":788934,"userName":"Vardaen","timestamp":1366902245,"content":"Might be way behind the times here, but did anything ever come of this sort of desire from the player base? A \"Second Breakfast\" sort of expansion to the core set. Even a Print on Demand version would make it very easy for FFG to rollout. Anyhow, still haven't been willing to double my investement into the core set and still not get 3 of all the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/67957-missing-core-cards/?do=findComment&comment=788935","commentId":788935,"userName":"richsabre","timestamp":1366902392,"content":"Vardaen said:\n\nMight be way behind the times here, but did anything ever come of this sort of desire from the player base? A \"Second Breakfast\" sort of expansion to the core set. Even a Print on Demand version would make it very easy for FFG to rollout. Anyhow, still haven't been willing to double my investement into the core set and still not get 3 of all the cards.\n\n\n\nnothing as yet….i am daily getting more and more tempted to get a second core set…i need more test of wills!!!"}]}