{"url":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/","title":"few foundations questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664186","commentId":664186,"userName":"richsabre","timestamp":1343316706,"content":"1. 3b- basically you take the discard pile, get rid of locations and join the remaining cards with the foundations encounter deck. all other cards are gotten rid of.?\n\n2.on 3b do i also discard attacthed condition cards from the encounter deck such as the watching eyes card?\n\nthanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664234","commentId":664234,"userName":"muemakan","timestamp":1343321524,"content":" You first discard all encounter cards and then shuffle all of them except locations and the torch with the FoS deck.\n Watchful Eyes also get discarded.\n\n \n\nHope that helps the Loremaster."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664271","commentId":664271,"userName":"richsabre","timestamp":1343325637,"content":"muemakan said:\n\n You first discard all encounter cards and then shuffle all of them except locations and the torch with the FoS deck.\n Watchful Eyes also get discarded.\n\n \n\nHope that helps the Loremaster.\n\n\n\nmy thanks….that clears it up for me\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664328","commentId":664328,"userName":"richsabre","timestamp":1343333270,"content":"ok ive got to ask again as the wording is confusing me……when we are talking about discarding the encounter cards, were only just talking about the ones from play right? so the untouched encounter deck is not used further in the foundations quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664356","commentId":664356,"userName":"ricedwlit","timestamp":1343336683,"content":"Correct: any card that is still in the encounter deck is removed from play.  \n\nObservation: this is one reason it helps to go a little slow in the second stage - you end up diluting the FoS deck for the last two stages (the fewer Nameless things the better)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664433","commentId":664433,"userName":"Doom1502","timestamp":1343359109,"content":"Hm.. are you sure about that? I always thought the quest card instructs me to discard the whole encounter deck and then remove all locations because we are now elsewhere in the mines."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664441","commentId":664441,"userName":"jjeagle","timestamp":1343360613,"content":"  Washed Away reads: \"Discard all Item, Armor, Weapon, Light cards and all encounter deck cards from play, Shuffle all enemy and treachery cards in the encounter discard pile together with the Foundations of Stone encounter set. This deck becomes the new encounter deck. remove all other encounter deck cards from the game.\"\n\nSo what you do with encounter cards is:\n\n1. Discard all that are in play - ie anything in the staging area, engaged enemies, the active location, Watchful Eyes if attached to a hero. In play = not the encounter deck itself.\n\n2. Take out the enemies and treacheries from the discard pile (note that this includes the cards discarded at step 1) and shuffled them with the FOS set to make the new deck.\n\n3. Remove all the other encounter cards from the game [ie everything that was still in the encounter deck when you were washed away + any locations that you have explored/flipped as Shadow cards + Cave Torch]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664454","commentId":664454,"userName":"richsabre","timestamp":1343362952,"content":"right got it, thank you all for your input- i was playing it that way, i was just wanting to make sure\n\nand yes, i agree ricedwlit- i  got through the first couple of stages in only a few rounds, leaving me ending up drawing 3 nameless things when i drew the old ones lair\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68092-few-foundations-questions/?do=findComment&comment=664465","commentId":664465,"userName":"jjeagle","timestamp":1343364913,"content":" Yes, although - if your deck can reduce its threat and keep it low enough - the Nameless Things are innocuous compared to some of the stuff you can carry over from the initial encounter deck (Sudden Pitfall, Crumbling Ruin etc). Even so, all they do is eat an ally per turn.\n\nI think the worst thing the FOS deck has got is Lost and Alone, particularly if you flip more than one at say the Old One Lair. The bats can also be extremely irksome, but again low threat means you can ignore them."}]}