{"url":"https://community.fantasyflightgames.com/topic/68135-duendain-attachment-control-question%E2%80%A6/","title":"DuenDain Attachment Control Question…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68135-duendain-attachment-control-question%E2%80%A6/?do=findComment&comment=664640","commentId":664640,"userName":"booored","timestamp":1343390776,"content":"So, we all know that when you cast a Attachment onto another player they gain control of the attachment.\n\nStill I was wondering is there a ruling on when the DuneDane card use there Action ability. If I cast the attachment on my own heroes.. I control it.. but after I use the action and move it to another hero, dose it change ownership as well?\n\nI think it possibly could, but as far as I can see there is no rule that speaks to this occurrence, it only says when CASTING a attachment on another player it blah blah blah.. this has already been cast and had control set, and now it is moving about… . .\n\nAs I am writting this I suddenly think of Wandering Took and that new Spirit Rohan guy… and there next movement payment IS done by the next player.. so I guess this would apply?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68135-duendain-attachment-control-question%E2%80%A6/?do=findComment&comment=668536","commentId":668536,"userName":"booored","timestamp":1344080215,"content":"< bump > < bump >"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68135-duendain-attachment-control-question%E2%80%A6/?do=findComment&comment=668621","commentId":668621,"userName":"Nerdmeister","timestamp":1344099890,"content":"Couldn´t find anything to directly contradict that assesment. However, to me, it does seem implied if you look at p25 of the rules:\n\n\"Players always assume control of attachments that have been played on their characters. If control of that character changes, so does the control of any attachments on that character\"\n\nBy that same token it seems to me that if only the attachment changes place, that it too would be under the control of the player controlling the character in question.\n\nAs I mentioned, I couldn´t find anything saying so explicitly in the rules but it does seem very much implied. Regardless untill officially ruled, or very compelling arguments are presented, I´ll keep playing it like I´ve done so far: with the attachment under the control of the player controlling attached character"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68135-duendain-attachment-control-question%E2%80%A6/?do=findComment&comment=668644","commentId":668644,"userName":"booored","timestamp":1344110512,"content":"Yeah this is how I am playing it as well.. but I think you are right and it is not really spelled out clear as i would like..\n\n\"Players always assume control of attachments that have been played on their characters. If control of that character changes, so does the control of any attachments on that character\"\n\nAccording to this rule you quoted only control is set as it is \"played\", and if the \"character\" changes control, then the attachment dose as well.. but this is a different situation.\n\nI think it might be safe to assume that whomever has the Duendain attachment on one of his controlled characters at any given time is responsible for the payment cost to attach it to another character? As in the 1 cost payment to move the attachment also move control… ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68135-duendain-attachment-control-question%E2%80%A6/?do=findComment&comment=668714","commentId":668714,"userName":"Nerdmeister","timestamp":1344135342,"content":"booored said:\n\nI think it might be safe to assume that whomever has the Duendain attachment on one of his controlled characters at any given time is responsible for the payment cost to attach it to another character? As in the 1 cost payment to move the attachment also move control… ?\n\n\n\nI concur with that assesment"}]}