{"url":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/","title":"LOTR, AGOT, or W:I?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=664856","commentId":664856,"userName":"sammann11","timestamp":1343428367,"content":"I am \"new\" to the gaming community. Aside from Heroquest over half my life ago, and a recently kindled interest in a very modified version of Lego's Heroica dungeon crawl games, I have no experience with table top gaming, and none whatsoever with LCG (or CCG) or deckbuilding or anything. That said, I'm a huge fan of the fantasy genre and read an average of about 2 or 3 books a month within the genre.\n\nI've been scouring these FFG forums and the internet in general trying to get a feel as to what LCG I want to try to get into. I'm a huge fan of AGOT, LOTR and Warhammer and I really am torn between which one of these (or 2?!) I should dive into. It seems the consensus is that LOTR is good for 1 player/co-op, W:I is best for 2, and AGOT is the most difficult and best when played with 4 people. Is that a fair assesment. Being new, would I (and the guy I may rope into playing with me)be better off with W:I or LOTR?\n\nLOTR does appeal to me because of the 1 player aspect. I spend 2 nights a week on the road for work and that could be a nice activity for me. Does 1 player get boring, or is it too hard - is it better done with 2 decks.\n\nAny input would be appreciated. I'll be posting this in the other 2 brands' forums as well. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=664865","commentId":664865,"userName":"booored","timestamp":1343430935,"content":"Hi, welcome to forum…\n\nAll those games are very different, the biggest difference is that this game (LoTR) can be played solo, and ALL the other ones you mentioned can not. So if you are alone a lot, they will never see play. Personally I think CoC is the best LCG that FFG make at the moment, and the coming Netrunner game is sure to be good as well. BUT, these are pure duel games, and require someone else to play with.\n\naGoTs is a really good game, but again requires people to play with, I haven't played it to much but I hear it is in fact best with 4 players, and games can run into the 2 hour mark. I have only ever played it 2 player and nvr really liked it much.\n\nI have nvr played Warhammer.. so can not comment, but I do know it is a duel game.. so you have to have someone to play with.\n\nLoTR is a really good game, and the solo aspect is inviting, but when you compare a static encounter deck to a real live human making their own decks… well… duel games own LoTR.. but then LoTR is in many ways a class of its own. If you play a lot with other people see what they would like, as you will need them if you choose a duel game. You see to keep LoTR fresh you have to keep buying packs, but in a duel game once you and your friend have a decent card pool you can make zillions of decks and nvr feel that the game is stale. LoTR is kind of like a TV show, or maybe the best comparison is a RPG. To is very thematic and has these great quests.. but after you have done them (or watched that movie or read that book.. same kind of thing) you have played it, and to keep interest you need to buy more LoTR packs. While a duel game is always fresh, well as fresh as your imagination.. Though there is a steady stream of very good custom quests for LoTR made by fans you can get at BBG, some are lame but some are as good if not better than the majority of FFG quests… so you will not stave for LoTR content even if your budget drys up.\n\nOn the other side Duels games can really suck, you can spend a fortune and then nvr ever ever play it, as either no one you knows plays it, or they play it but are not really into it and your decks just crush them in a instant. The LCG duel games are not like Magic the Gathering, even if you give someone a fantastic deck if they do not know how to play they will completely fail.\n\nYou mentioned Heroquest…. are you sure you are after a LCG? There is a few really good BoardGames you might wish to look at… Descent (form FFG) is a great multiplayer game and there is a newish game called \"Mage Knight\" (based on the old miniature game) that is FAN-******-TASTIC.. and it supports solo play as well as co-op and duel. Other great dungeon games are the Dungeons and Dragons games from Wizards and the really neat Dungeon Run from Plad-Hat games.\n\nAnother great card game (though it is a dueling game) might be a good option as unlike a LCG it is strait out of the box… Summoner Wars. It is just a shockingly good game. As is a few of the deckbuilders… Eaten by Zombies, Thunderstone Advance are my favs.\n\nFFG make the cool RunBound and Space Hulk: Death Angel both are card games (with out the collector thing.. just out of the box games) that support multiplayer and solo play.\n\nAll in all.. LoTR is a great game I have been playing it form the launch and nvr looked back.. still with a background in Heroscape.. I have to wonder if a LCG is really what you are looking for?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=664880","commentId":664880,"userName":"Trantor3","timestamp":1343434987,"content":"Those games are very different, and it really depends what you are looking for.\n\nLotR is a very thematic cooperative game. It's often a bit clunky and many rules details aren't exactly clear, and several cards sacrifice clearness and elegance for theme. If you like the LotR universe and enjoy thematic games, you will have a blast. The artworks are incredible, and you will find many locations and characters from the books.\nIt's playable solo, and a lot of people here really enjoy the solo experience. I rarely play it solo because it's so much more fun to me to discuss my plays with a partner. Also, the game doesn't scale too well. It's usually much harder to win solo and becomes easier the more people you add. Two players is the sweet spot in my opinion.\n\nWarhammer: Invasion is a 2 player game only. Of the three games mentioned, it's the easiest to learn. If you delve deeper into it, I think it lacks some of the depth that other, similar games like AGoT or Magic: The Gathering have. But it's probably the best game if you want to try the genre and have access to an opponent.\n\nAGoT is probably the most complex game of the three. It works well as a 2 player game and as a multiplayer game. The games can take a LONG time, especially with 3 or 4 players. If everybody is new, a 4 player game can very well take 3 or 4 hours to complete. To truly get into it, you will need a lot of time and opponents with just as much time. Also, the quality of the artworks is a bit lower than in the other two games if that is important to you.\n\nIn short:\n- LotR is a very thematic coop game that can be played solo, though 2 is better in my eyes.\n- WH:I is the easiest to learn and a great way to try the genre.\n- AGoT is the most complex and requires the most time, but can be the most fun experience in my mind.\n\nAnd I support the suggestion of Summoner Wars. That game is great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=664897","commentId":664897,"userName":"mr.thomasschmidt","timestamp":1343439507,"content":"I second the statements above, however I would steer out of RuneBound since it is a multiplayer game and doesn't support solo play. I have tried all the LCG's and must say I like the LOTR the most. The others are not bad but since I play solo 4/5 of the time the other games didn't got played very often. BUT you need to buy the adventure packs from at least the first cycle to get the best of the game. Then you can choose after that if you want the expansion and the rest :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAlso note that there's solo and there's solo play ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] you can play many quests solo but some you will need two play two deck. The good thing with this game is that you can easily controle two decks at the same time yourself.\n\nBut if you haven't I'd strongly suggest watching the instruction videos on YouTube made by FFG. Just search for fantasyflightstudios and you get the vids for call of Cthulhu, LOTR, aGoT and W:I. And I must say that these videos was what really sold the games to me :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=664945","commentId":664945,"userName":"booored","timestamp":1343457025,"content":"mr.thomasschmidt said:\n\nI second the statements above, however I would steer out of RuneBound since it is a multiplayer game and doesn't support solo play.\n\nIt has solo play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=664965","commentId":664965,"userName":"Budgernaut","timestamp":1343462622,"content":" If you've scoured the forums, you've probably seen this before, but I'll mention it anyway. LotR tends to be hard at first. Everybody starts off and is able to figure out the introductory quest, then they try the second quest, and nearly throw their arms in the air ready to quit the game altogether because the second scenario of the Core Set is so hard. It can be terribly frustrating for some people and some people never get past that and end up selling their game.\n\nOther people stick with it and when they beat the second scenario, it's like they've broken through a wall and they start to understand exactly what deck-building means in this game and they start to understand the kinds of decisions that have to be made in order to win. And then once you expand your card pool with more expansions, it gets even better.\n\nI still lose quite a lot, and there are three reasons:\n\n1) I'm not an experienced CCG player, having always constructed themed decks in the past rather than looking for cool combos, so my deck-building skills constantly need work.\n\n2) I find that I make poor decisions sometimes, so I'm not the best at knowing which moves to make. I tend to gamble too much and end up losing games that way.\n\n3) No matter how you slice the cake, this game has a large element of luck. I suppose all card games do, but the encounter deck has to make up for a lack of intelligence by having some brutal cards. This means that no matter how good you are doing, some encounter card draws will almost always cause your utter annihilation. That also means that some of your successes are soured by the knowledge that you really only won because, say, you never saw the Cave Troll, for instance. The good players here always work to make and play a deck that is ready to confront whatever the encounter deck throws at them, rather than relying on good card draws for you and bad card draws from the encounter deck. I haven't figured out what that means yet - I just try to have fun.\n\nI got this game for the solo experience, and it was great. I've really enjoyed it. But I've played a few multiplayer games here and there, and now that's what I truly yearn for. Solo games are great because when faced with the decision to play or not to play, I choose to play. But this year I've really gained an appreciation for how much more fun gaming is when you have other people to game with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=664974","commentId":664974,"userName":"Glaurung","timestamp":1343464865,"content":"Budgernaut said:\n\n If you've scoured the forums, you've probably seen this before, but I'll mention it anyway. LotR tends to be hard at first. Everybody starts off and is able to figure out the introductory quest, then they try the second quest, and nearly throw their arms in the air ready to quit the game altogether because the second scenario of the Core Set is so hard. It can be terribly frustrating for some people and some people never get past that and end up selling their game.\n\nOther people stick with it and when they beat the second scenario, it's like they've broken through a wall and they start to understand exactly what deck-building means in this game and they start to understand the kinds of decisions that have to be made in order to win. And then once you expand your card pool with more expansions, it gets even better.\n\n\n\nVery good point. When you start is really hard. Then you  learn how to build up a deck and then you start to win. And when you reach certain level you get bored. Cose game is no problem for you anymore. Here is a problem cose game didn provide nothing for the high level players. Only Massing in Osgiliath  still a challenge.\n\nSo normally is should be tournaments system and some restricted list of powerful cards for players who looking for real challenge. But we still didn have it.\n\nThen what we do with my firends? We limit them self with some erratas(make encounter deck more powerfull, take some weak cards out and put more strong cards) and so on. Banned some heroes like Beravur or new Glorifindel, limit 1 Gandalf per deck. This make quests much more interesting.\n\nAnd sure nightmare mode. Which is really cool in my opinion. Game is cool anyway and of you love Tolkien you must buy it!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68165-lotr-agot-or-wi/?do=findComment&comment=665474","commentId":665474,"userName":"sammann11","timestamp":1343572235,"content":"Thanks to all of you for your input and feedback. I'm going to process all of what you said and take the info to a buddy of mine and my brother. They're the two poor saps who I'm going to try to rope into playing with me! I'll see what they think and we'll make a purchase then, I suppose. I'll be back on one of these forums for sure once I have more questions about the ins and outs of these LCG's. Thanks!"}]}