{"url":"https://community.fantasyflightgames.com/topic/68363-does-anyone-else-find-it-lame-that-cards-in-the-victory-display-still-interact-with-the-game/","title":"Does anyone else find it lame that cards in the Victory Display still interact with the game?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68363-does-anyone-else-find-it-lame-that-cards-in-the-victory-display-still-interact-with-the-game/?do=findComment&comment=666734","commentId":666734,"userName":"DurinIII","timestamp":1343766610,"content":" My title pretty much sums up my discussion. I read through the new errata and mostly I agreed with the changes…but, as far as this here rule on cards actually still interacting in the game from a player's Victory Display, I just don't like it. If you have already \"quested\" through that location, as in, I ALREADY WALKED OVER CARADHRAS, then does it not seem the least bit odd that you have to potentially face the same exact card again?  This means I have played the majority of my games for over a year wrong. I challenge this silly ruling FF!\n\nAnyone else sympathetic towards my rant? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n-Joe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68363-does-anyone-else-find-it-lame-that-cards-in-the-victory-display-still-interact-with-the-game/?do=findComment&comment=666741","commentId":666741,"userName":"Golden_Nightingale","timestamp":1343767547,"content":"I completely agree. I've been doing the same thing. It seems that if I work hard to get it out of the staging area and in my victory display than I shouldn't be penalized and forced to travel there again.Come on FFG, this seems lame and frustrating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68363-does-anyone-else-find-it-lame-that-cards-in-the-victory-display-still-interact-with-the-game/?do=findComment&comment=666751","commentId":666751,"userName":"booored","timestamp":1343770187,"content":"not sure what you are getting at… it says right in the new faq…\n\n\"Cards in the victory display are considered to be out of play, but are not considered to be a part of the encounter discard pile\"\n\nThis is exactly what you are saying it should be.. once you cross that location it is GONE and that is it.. \"unless\" there us a specific game effect that is built into the quest. Like say the \"Nameless Fear's\" effect in Khaz. All this \"new\" rule is saying is that YES victory cards are removed fomr the encounter deck and are now out of play… \"BUT\" if we want to design a card in some future quest that can do something with them.. we can…\n\nEnd of story.. this doesn't effect anything… once you Kill a Hill Troll.. it is done..\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68363-does-anyone-else-find-it-lame-that-cards-in-the-victory-display-still-interact-with-the-game/?do=findComment&comment=666848","commentId":666848,"userName":"richsabre","timestamp":1343794305,"content":"i have to agree with booored here- the new ruling is more of a safety feature for future quest designs, just so that when ffg bring out a quest that brings back a victory display card (for whatever reason…perhaps we have to recross the location or the enemies was only knocked out lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]) then we dont yell that it breaks the rules\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68363-does-anyone-else-find-it-lame-that-cards-in-the-victory-display-still-interact-with-the-game/?do=findComment&comment=666854","commentId":666854,"userName":"GhostWolf69","timestamp":1343795022,"content":"I also agree with 'boored' here.\n\nAll it says is Cards \"may\" still interact with them.\n\nShow me a card that does that and we'll see if it make sense. Right now I can't think of any card with this effect.\n\n/wolf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68363-does-anyone-else-find-it-lame-that-cards-in-the-victory-display-still-interact-with-the-game/?do=findComment&comment=666877","commentId":666877,"userName":"DurinIII","timestamp":1343800803,"content":"Yeah, I completely misread the new FAQ on this issue and therefore wasted everyone's time posting this and getting responses. Sorry about that! You guys are right, and it doesn't change a thing. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}