{"url":"https://community.fantasyflightgames.com/topic/68371-new-faq-posted/","title":"New FAQ posted!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68371-new-faq-posted/?do=findComment&comment=666788","commentId":666788,"userName":"radiskull","timestamp":1343779360,"content":" Check my signature for the link.  No timing chart, but a few important clarifications.\n\nIf an enemy or a character is moved mid-battle, it doesn't matter.  The attack still resolves as though they hadn't.  Like, if an enemy was attacking player A, and A defended with Wandering Took, then moved the Took to player B, the Took still defends, and player A is still the defending player.\n\nAlso, a few people (cough…Glaurung) should be happy:\n\nBeravor is once per round.\nProtector of Lorien is 3x per round.\nZigil Miner grants 1 resource for guessing the number correctly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68371-new-faq-posted/?do=findComment&comment=666844","commentId":666844,"userName":"richsabre","timestamp":1343793957,"content":"who thinks a sticky is in order ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68371-new-faq-posted/?do=findComment&comment=666851","commentId":666851,"userName":"Emrad","timestamp":1343794685,"content":"\"Oh come on !\" is the first thing that comes to my mind right now :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nAfter a few month of play, it does look like Zigil Miner was a bit overpowered, and with the help of the new Seer, it is so easy to set up a combo that I guess an Errata was necessary. All in all, I'm not unhappy of this change.\n\nBeravor… mmmh. I guess it makes sense since we now finally have decent draw cards (draw 2 discard 1 for {0}, draw 5 exhaust 2 heroes for {1}). Unexpected Courage has just become a completely other card.\n\nFor Protector of Lorien, I don't really think the change was necessary. Generally placed on Eowyn or a good defender hero, it was uncommon to discard more than 3 or 4 times. Although discarding an entire hand drawn thanks to BERAVOR (yes, I'm looking at you FFG) felt sometimes like cheating, it still meant that you put all your cards in the trashbin.\n\n \n\nIt had to happen I guess! In a whole new game system like this one, some cards have to be broken or become broken at some point."}]}