{"url":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/","title":"Whats your epic play?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=666834","commentId":666834,"userName":"Eyedunno53","timestamp":1343790577,"content":"My girlfriend and I were playing the other day, and I played cards in a way I had not before, for a pretty epic turn around.  We were playing The Seventh Level. It should have been easy enough (difficulty 3) but we were having terrible luck, and goblin after goblin just kept popping up. At one point we were each enguaged with two, both of those pulled Goblin spearmen and swordsmen as shadow cards which added more. Then on the next turn a few more flipped. Add that to the sniper that was harassing us… thing looked pretty bad. At the end of a round we were each down to one ally. She had a two dead heroes. I was holding a Gandalf and a Sneak attack. Simple enough combo thats been around forever… and I almost played it… then I realized I was holding a Longbeard Orc Slayer as well. Now, I just tossed him in because he was a dwarf, and I always appriciated the extra damage or two on an enemy. Now I dont know why it never occured to me to sneak attack something in the Resource phase before, but it just clicked for me. I sneak attacked using one of the two resource Dain had. BAM one damage to all orcs in play. Then Bifur stole Dain's last resource, turned the four he now had into leadership (thanks to Navi's belt) then played the Longbeard Orc Slayer during the planning step… The board cleared except for one enemy. 5 total resource and what is usually considered a sub-par card, just killed nearly a dozen enemies.  We won the game two rounds later.\n\n \n\nAnybody else have awesome stories using less popular cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=666842","commentId":666842,"userName":"richsabre","timestamp":1343793215,"content":"nothing clever on my behalf really- just something that gave me alot of satisfaction ….\n\nreturn to mirkwood had just came out and for solo play it was a horror….i had been playing it with my standard decks and losing by threat increase in just a handful of turns\n\nbut then i thought why not just throw in every rohan card and make an all spirit super-fast deck? so i did, and walked it……complete and utter luck of course, but winning that for the first time, against all the odds was very 'epic' in my eyes.\n\nthat deck got called the rabbit run deck afterwards, i just like to call it the epic-rohan-deck-that-only-ever-won-me-1-game-deck\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=666904","commentId":666904,"userName":"booored","timestamp":1343803758,"content":"I think my most \"amazing\" game was 3 player Journey down the Audin were we had a Hill Troll drawn in our first quest so we had both out in turn 1 and thne next turn an archer… I kind of forget the order but it went even worse but we hung in there and didn't scoop.. and made it across teh river alive.. extremely satisfying game and a great example for me of how great this game can be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=666917","commentId":666917,"userName":"muemakan","timestamp":1343805324,"content":"Massing at Osgiliath solo:\n\n\nCan´t remember my exact hand, but there were 2 Gandalfs and Riversong in it.\n\n\n \n\n\nThe encounter card was Cut off , Eleanor canceled it to get Ranger of Ithilien, those two surge into Massing at Osgiliath and Dark Pursuit and then MaO surges into another Version of Massing, that surges into a Snaga Scout, with Emyn Arnen Overlook as the active location there came another Snaga.\n\n\n \n\n\nLuckely I had not crossed the Anduin yet.\n\n\n \n\n\nSo this resulted in a threat gain of 10 because of all the dommed stuff.\n\n\nDid not win……."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=667241","commentId":667241,"userName":"Dain Ironfoot","timestamp":1343834481,"content":"was playing a dwarf deck last night (solo) on Passage through Mirkwood for old times sake and the hummerhorns came out and I had no way to deal with it in the staging area. I get to the final quest card and have to kill Ungoliant's Spawn. Hummerhorns engage, deal 5 damage to gimli (who, thank goodness, had Boots from Erebor). Gimli then is able to swing for the win against Ungoliant (with a little help from Bifur and Dain), totally bypassing the other 3 enemies in the staging area for the win! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nNot \"epic\" but I thought it was pretty sweet that the hummerhorns actually came in handy instead of being devastating. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=667374","commentId":667374,"userName":"schmoo34","timestamp":1343856317,"content":"Dain Ironfoot said:\n\nwas playing a dwarf deck last night (solo) on Passage through Mirkwood for old times sake and the hummerhorns came out and I had no way to deal with it in the staging area. I get to the final quest card and have to kill Ungoliant's Spawn. Hummerhorns engage, deal 5 damage to gimli (who, thank goodness, had Boots from Erebor). Gimli then is able to swing for the win against Ungoliant (with a little help from Bifur and Dain), totally bypassing the other 3 enemies in the staging area for the win! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nNot \"epic\" but I thought it was pretty sweet that the hummerhorns actually came in handy instead of being devastating. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\n \n\nJust don't tell booored that you used \"Heavy Stroke\" card to do the final blow…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=667460","commentId":667460,"userName":"mr.thomasschmidt","timestamp":1343875142,"content":"schmoo34 said:\n\n \n\nJust don't tell booored that you used \"Heavy Stroke\" card to do the final blow…\n\n\n\nEpic! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=667469","commentId":667469,"userName":"Dain Ironfoot","timestamp":1343877282,"content":"mr.thomasschmidt said:\n\nschmoo34 said:\n\n \n\n \n\nJust don't tell booored that you used \"Heavy Stroke\" card to do the final blow…\n\n \n\n \n\nEpic! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n\n\n \n\nhahaha. phew! it wasn't in my deck. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68378-whats-your-epic-play/?do=findComment&comment=668174","commentId":668174,"userName":"MADG0BLIN2","timestamp":1343999015,"content":" i have been playing the dead marshes for about 7 times now. Twice it ended in almost the same way. I had 3 tokens on gollum and  was ready for the final test Both times I committed 7 willpower and both times I drew The Lights of the Dead with Escape: 5 + another zero and one with Escape: 2…\n\nHow unlucky can you be. sad.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sad.gif]"}]}