{"url":"https://community.fantasyflightgames.com/topic/68387-playing-a-second-unique-card/","title":"Playing a second unique card","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68387-playing-a-second-unique-card/?do=findComment&comment=666891","commentId":666891,"userName":"Emrad","timestamp":1343802514,"content":"Reading the latest FAQ, I found this:\n\n\"Q: When players have separate staging areas at stage 4 of Foundations of Stone, can there be multiple copies of unique cards in play?\n\nA: No. Players must still respect the rules for playing unique cards when they are split up. For example, if a player has Gandalf (CORE 73) in play, then no other player can play Gandalf.\"\n\nI'm only interested in the last part. Was the last sentence correctly written? Player really cannot play a unique card if another card with the same title is already in play? I always thought the most recent copy remained and the other one was discarded. I may have been incorrectly influenced by other games, though.\n\nIf this is correct, what happens with an effect such as Sneak Attack? Can I put a Gandalf from my hand if one is already in play? What if I can, what happens to the other one?\n\n \n\nThanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68387-playing-a-second-unique-card/?do=findComment&comment=666892","commentId":666892,"userName":"richsabre","timestamp":1343802620,"content":"if a unique character is in play then the card cannot enter play….so you cannot sneak gandalf in play if another copy is already there\n\nrulebook page 8 says any attempt to put it into play will fail and it will stay in its current area ie your hand\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68387-playing-a-second-unique-card/?do=findComment&comment=666907","commentId":666907,"userName":"Emrad","timestamp":1343804263,"content":"Thanks rich, I didn't have my rulebook with me right now :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}