{"url":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/","title":"How has the game turned out since the Core set?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669306","commentId":669306,"userName":"Rathmaker","timestamp":1344247988,"content":"Hello ladies and gentlemen.\n\nI have been a huge fan of Middle Earth since reading the books as a teenager.  So, naturally I was extremely interested in the LOTR LCG when I heard about it, and purchased 3 copies of the Core set when the game first released.  The time I spent playing the game was almost exclusively solo, but I was able to play it co-op with friends a few times (when we could all get free time!).  The concept and gameplay of the the game was extremely fun, but after seeing each scenario a few times the game began to get a stale.  Possibly a worse problem was the game was extremely brutal for someone trying to play solo with what was available in just the core set.  I decided to set the game aside, and look it up again after it had expanded.\n\nWell time has passed, and I see the game has expanded quite a bit since.  So, I am wondering as a person who will play the game almost exclusively solo how has the game turned out?  Does the game manage to stay fresh?  And has the game gotten more \"solo-friendly\" than it was in the core set?  I am also curious how players think the game has turned out with multiple expansions under its belt.  Does the game run smooth still, or is it just one convoluted mess with new card types and rulings?\n\nAny insight from people that have been playing LOTR LCG since release would be greatly appreciated!  Insights on the solo experience in the game's current state are extremely appreciated!\n\n~Rathmaker~"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669318","commentId":669318,"userName":"richsabre","timestamp":1344249070,"content":"hello\n\nim a gamer playing since release with just 1 core set and all the current packs- i play only solo\n\n \n\nthe game has not lost its magic in my opinion- it has got only better. this is coming from a tolkien lore freak though….so id buy this game either way. but i think the main point you need to know is that us solo players have it MUCH easier now…..i can walk a good amount of the quests (though some thankfully remain a challange…but in a good way, not a dol guldur way) and with powerful new cards such as elrond and dain and glorfindel….well the list goes on, so many great cards for solo play\n\ni cant stress enough how much better this has become on the scaling side- there has only been 1 solo-terrible quest and that is return to mirkwood which i remain convinced to this day that the designers forgot the game has 1 player\n\nthe art has got better, or at least stay the same, the game won an award for it recently i think\n\nthere is a new card mechanic called secrecy which offers cost discounts if you keep threat low\n\ndwarves are currently the most powerful and it is quite easy to win most quests with them\n\nnoldor is a close second\n\nthe hobbit saga pack is soon to be out, quite an exiting time for a tolkien fan really!\n\nthe designers really have done a sterling job on getting the feel for middle earth- and i take alot of convincing that way. i know plenty of peopel who will back me up on this, and i think the game's fanbase speaks for itself\n\nany q.s just ask\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669383","commentId":669383,"userName":"schmoo34","timestamp":1344253934,"content":"I'm the antithesis of Rich but enjoy chatting with him a lot on the forums!  I could care less about the lore or about the artwork.  I just want a game that is fun to play…period.\n\n \n\nWith the core set, the only way I could enjoy the game solo was to pretend I was two players and play it as if there were two players at the table.  I even went as far as simulating four players but it is a lot of work and energy so I only mustered that a few times.   I also adopted a ruleset (custom, not official) submitted by someone else but tweaked by myself where I played solo, with one deck but used six heroes and the rest of the rules remained as if two players were in play.  (i.e., I turned over two cards during encounter phase, and X = 2 in all card calculations, etc. etc.)   This custom ruleset was by far the most fun for me.\n\n \n\nAs the expansions have come out (I didn't start until Darrowdelf so when I purchased the game, I had all of the mirkwood expansions with it and actually played for a month without the expansions and then slowly started adding them in and eventually catching up…I've found solo play to become more and more doable without a custom ruleset.\n\n \n\nSo to answer your question, the game IMPROVED for me.  I felt solo was extremely difficult in the beginning and it is becoming much more feasible as each release goes by.  Whether it be more powerful cards or just simply cards that suit my playstyle, I do not have an exact answer for you but I've settled on a Loragon, New Glorfindel, Frodo combo that is quite powerful.  Cards like \"Light of Valinor\", \"Fast Hitch\" or any of those three heroes didn't exist in the core set (or I'm pretty sure they didn't) so my entire solo deck is built off of expansion cards.\n\n \n\nSo I guess I'm trying to say that the developers of this game did a good job…not only are they keeping people like Rich happy, they are keeping me happy as well, and neither of us are into this game for the same reasons.\n\n \n\nI've said it before, but I want the game to get more epic.  I want to control 12 heroes and have epic decks and be up against epic battles.  I want Helm's Deep to feel like Helm's deep.  I don't want to go on secret quests anymore, I want the game to open up and be epic!  That is something it hasn't done nor would I ever say it said it would ever do.  I just see potential there…and with so many good cards coming, it is actually more difficult to limit your deck and I want to use them all!  In an epic way!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669389","commentId":669389,"userName":"richsabre","timestamp":1344254446,"content":"schmoo34 said:\n\nI've said it before, but I want the game to get more epic.  I want to control 12 heroes and have epic decks and be up against epic battles.  I want Helm's Deep to feel like Helm's deep.  I don't want to go on secret quests anymore, I want the game to open up and be epic!  That is something it hasn't done nor would I ever say it said it would ever do.  I just see potential there…and with so many good cards coming, it is actually more difficult to limit your deck and I want to use them all!  In an epic way!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nthis is an interesting point-(and sorry to side track) but i actually think you will get your wish here, and i actually hope the same. afterall i think we'd all be dissapointed if we went to gondor and didnt get to defend a mass siege on osgilliath, or as you say went to rohan and didnt get a battle on the plains on in the deep.\n\ni would hope this would be on the list of things for the designers to work as on, as it keeps both the theme players happy (great battles being part of the books) and the player-players (doesnt quite sound right does it?) happy, battles obviously giving some epic games\n\neither way i think we're in for a treat when we get to gondor and rohan…..or even to the black gate (key ominous music…dum dum, dum dum)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669408","commentId":669408,"userName":"Rathmaker","timestamp":1344255526,"content":"Thanks to both of you for the replies!\n\nI am actually a mixture of both of you.  Like Schmoo, I enjoy games that have great mechanics.  But, like Richsabre I have been a Tolkien fanatic since I began to read the books.  I have read The Hobbit and The Lord of the Rings once a year since 16 years of age (I begin reading it every year on September 22nd, Bilbo and Frodo's birthdays…and Hobbit Day!).  So the lore references in the game are extremely important to me.\n\nIt is comforting to hear from both perspectives that the game has improved since the core set.  The game itself is beautiful in many ways, and was hoping to hear replies like these.  Looks like it is time to delve back in!\n\n~Rathmaker~"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669421","commentId":669421,"userName":"Quit2","timestamp":1344256396,"content":" what I find even more remarkable is that while the expansions have made the game better, they did not make the base game cards obsolete. \n\nExpansion player cards did not make base game quests unplayably easy, and the expansion quests did not make the base game cards powerless. Nothern tracker is still good, so is sneak attack, gandalf, unexpected courage, feint, steward of gondor, … just to name a few. Dol guldur is still hard, even with all the new cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669430","commentId":669430,"userName":"richsabre","timestamp":1344256657,"content":"quit said:\n\n what I find even more remarkable is that while the expansions have made the game better, they did not make the base game cards obsolete. \n\nExpansion player cards did not make base game quests unplayably easy, and the expansion quests did not make the base game cards powerless. Nothern tracker is still good, so is sneak attack, gandalf, unexpected courage, feint, steward of gondor, … just to name a few. Dol guldur is still hard, even with all the new cards.\n\n\n\nexcellent point there and i agree- steward and UC will always be good!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669457","commentId":669457,"userName":"John85","timestamp":1344259287,"content":"richsabre said:\n\n…afterall i think we'd all be dissapointed if we went to gondor and didnt get to defend a mass siege on osgilliath, or as you say went to rohan and didnt get a battle on the plains on in the deep.…\n\nrich\n\n\n\nOh my, I just realized we will at some point get an Erkenbrand (who got hosed by Peter Jackson). What about the siege of Isengard with Treebeard and Ents (I shouldn't get too hasty). I wonder if we may even get a pre-corrupted Saruman?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669463","commentId":669463,"userName":"John85","timestamp":1344259603,"content":"quit said:\n\n what I find even more remarkable is that while the expansions have made the game better, they did not make the base game cards obsolete. \n\nExpansion player cards did not make base game quests unplayably easy, and the expansion quests did not make the base game cards powerless. Nothern tracker is still good, so is sneak attack, gandalf, unexpected courage, feint, steward of gondor, … just to name a few. Dol guldur is still hard, even with all the new cards.\n\n\n\nThe last FAQ released (1.3) noted that they are making these changes to allow for the continued viability of the game. They are making a great effort to keep the older cards useable which I really appreciate. I'd like to see some continued use of older Encounter sets too, but that's another topic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669481","commentId":669481,"userName":"richsabre","timestamp":1344260820,"content":"John85 said:\n\nrichsabre said:\n\n \n\n…afterall i think we'd all be dissapointed if we went to gondor and didnt get to defend a mass siege on osgilliath, or as you say went to rohan and didnt get a battle on the plains on in the deep.…\n\nrich\n\n \n\n \n\nOh my, I just realized we will at some point get an Erkenbrand (who got hosed by Peter Jackson). What about the siege of Isengard with Treebeard and Ents (I shouldn't get too hasty). I wonder if we may even get a pre-corrupted Saruman?\n\n\n\ni would expect all of those….and i cannot wait for them. saruman will definately be an interesting character, powerful but most likely at a price. and i expect we shall see an enemy version as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669506","commentId":669506,"userName":"John85","timestamp":1344263231,"content":"richsabre said:\n\n \n\ni would expect all of those….and i cannot wait for them. saruman will definately be an interesting character, powerful but most likely at a price. and i expect we shall see an enemy version as well\n\n\n\nI didn't bother mentioning Saruman the Baddie, I thought it was assumed, I just  thought an earlier, truly \"White\" Saruman would be interesting. Is their anything (I'm sure there's something) about Saruman before he turned in Tolkien's writings? Lore-master Rich?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669514","commentId":669514,"userName":"booored","timestamp":1344263910,"content":"As for how it is.. well I think it is getting better and better, I mean that is the trap in these type of games.. new cards are better than old ones, you find new combos.. etc etc.. so you feel a constant progression. So it is an easy trap to fall into to just buying everything that gets released regardless.\n\nThe thing is though that this is a co-op game witch some choose to play solo, and while the solo play is great imo co-op is really were it shines.. I kinda feel bad for people that haven't eve tried the co-op.. it is just an entire new dimension. Still the thing is that as a solo or a co-op game what this is really is a board game that uses cards.. and after you have Khaz and 2 cycles you have a more quests that a game group can comfortably play.\n\nWhat I mean is that if you have a mate over and they want to play this you have a great selection already. I have over 18 Quest and another 8 or so top notch custom quest that are as good or in some cases better than the official ones. That is a BUTT load of quests. I know gamer groups that only play a quest 1 time and move on.. seams expensive.\n\nYou need to ask what you want form this game. Many people are starting to think that there isn't much more to offer.. just more player cards and more quests. What am I going ot get out of this for my game group that it doesn't already do? Would I like to buy yet another expansion and add a new quest, or would I like to buy a completely new game and try something new and just come back to this latter and play one of the zillion LoTR-LCG quest I already have that I have only played a few times?\n\nSo while // YES // the game is very good, and it IS getting better… it is also starting to buckle under its own weight were the active reasoning for buying new quest is changing. With Netrunner and Star Wars (co-op like this one) coming out form FFG and the mass of other games in the world.. people have to ask. is this game going to really add anything to my play group..\n\n \n\nschmoo34 said:\n\nI'm the antithesis of Rich but enjoy chatting with him a lot on the forums!  I could care less about the lore or about the artwork.  I just want a game that is fun to play…period.\n\nThis is exactly what I am as well. Lore means nothing to me.. but the game itself is good imo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669517","commentId":669517,"userName":"booored","timestamp":1344264102,"content":"quit said:\n\nwhat I find even more remarkable is that while the expansions have made the game better, they did not make the base game cards obsolete.\n\nThis is true in all the LCGs… the base set cards are found in CoC decks years and years after they were released… very good of ffg imo. I think there has been over 10 cycles and 3 Major expansions in that game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669536","commentId":669536,"userName":"richsabre","timestamp":1344265593,"content":"John85 said:\n\n \n\nrichsabre said:\n\n \n\n \n\ni would expect all of those….and i cannot wait for them. saruman will definately be an interesting character, powerful but most likely at a price. and i expect we shall see an enemy version as well\n\n \n\n \n\nI didn't bother mentioning Saruman the Baddie, I thought it was assumed, I just  thought an earlier, truly \"White\" Saruman would be interesting. Is their anything (I'm sure there's something) about Saruman before he turned in Tolkien's writings? Lore-master Rich?\n\n \n\n \n\nyes, a little, specifically in the appendices and unfinished tales….if i remember rightly they mostly account how he tried halting the white council's progress in attacking the necromancer in dol guldur and his searching for the ring. the unfinished tales has an entire chapter on the istari and their background which is a good read\n\ntheres also a good few hints within the trilogy text, especially the conversation between gandalf and saruman as recounted in the council of elrond chapter\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669543","commentId":669543,"userName":"Dain Ironfoot","timestamp":1344265994,"content":"booored said:\n\nSo while // YES // the game is very good, and it IS getting better… it is also starting to buckle under its own weight were the active reasoning for buying new quest is changing. With Netrunner and Star Wars (co-op like this one) coming out form FFG and the mass of other games in the world.. people have to ask. is this game going to really add anything to my play group..\n\n \n\ntotally off topic, but i would be very surprised if Star Wars remains co-operative. With all of the outrage on the SW forums about it being cooperative and FFG \"going back to the drawing board\" my guess is that it will now be competitive. of course, we've had no update whatsoever since February, but I really expect it to be competitive now.\n\nI think co-op games are probably a larger challenge to design in the LCG format than the designers expected, while it is \"easier\" to design a competitive game and that more easily facilitates tournaments, etc. either way, we shall see!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669563","commentId":669563,"userName":"booored","timestamp":1344267651,"content":"Dain Ironfoot said:\n\nbooored said:\n\n \n\nSo while // YES // the game is very good, and it IS getting better… it is also starting to buckle under its own weight were the active reasoning for buying new quest is changing. With Netrunner and Star Wars (co-op like this one) coming out form FFG and the mass of other games in the world.. people have to ask. is this game going to really add anything to my play group..\n\n \n\n \n\ntotally off topic, but i would be very surprised if Star Wars remains co-operative. With all of the outrage on the SW forums about it being cooperative and FFG \"going back to the drawing board\" my guess is that it will now be competitive. of course, we've had no update whatsoever since February, but I really expect it to be competitive now.\n\nI think co-op games are probably a larger challenge to design in the LCG format than the designers expected, while it is \"easier\" to design a competitive game and that more easily facilitates tournaments, etc. either way, we shall see!\n\n\n\nWe will find out.. but I see no evidence either way and FFG is just about to release Netrunner a dueling scifi game … . There is no info form FFG so the threads in the Star Wars forums are the worst examples of rumourmongering I have see in a long time.. there is simply no info either way Some people point to that \"new\" box that has 2-6 on it.. others point to that it still says co-op in the game description at the ffg site.. There is simply not enough info to make any kind of suspicion.. so with out any info to the country I see no reason to expect it to be different form the original announcement. Especially with Netrunner filling the scifi duel game need.\n\nAlso worth noting that I follow that forum pretty close and the massive thread of pvp vs coop.. has more people looking for co-op than pvp.. So the \"outrage\" is a myth as well. PvP players ar just vocal minority on that forum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669594","commentId":669594,"userName":"Dain Ironfoot","timestamp":1344269326,"content":"you're absolutely right, there is no info one way or the other. my point was simply i can't see them \"going back to the drawing board\" and keeping the same basic description we've seen thus far. i expect it to be vastly different.\n\nwith that said, i don't think netrunner fits the \"sci-fi\" competitive niche, at all. (gah! highjacking the thread again!). while i've not read the boards for that game, i have no interest in that game whatsoever, no one in my play group does, either (totally anecdotal, i know). it's a \"dead\" CCG being brought back to life about….hacking a corporation. nothing could interest me less (no offense if people are stoked!). on the other hand, everyone i know is super excited for the SW LCG, so i just don't see netrunner really filling a niche for most of the players i know.\n\nwith that said, is anyone looking forward to that game? (again, highjacking!). of course, i'm sure there are. but the property just seems so \"bland\" to me and I see SW being probably their biggest money maker, as it is their highest profile license."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669609","commentId":669609,"userName":"John85","timestamp":1344270601,"content":"I used to really enjoy SW universe as a kid and even through to Undergrad, but I've soured on it in the past few years (I enjoyed the prequel trilogy). I think that at some point I just decided to give up SW (and John Williams) for Tolkien, Middle Earth (and Howard Shore aplauso.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/aplauso.gif]), Narnia, and CS Lewis. Some would argue there is room for both (there probably is), but I just don't get much out of SW anymore. In hindsight I actually find myself wishing I'd come to The Hobbit, Chronicles of Narnia, The Lord of the Rings, and the Space Trilogy (sorry for the inverted titles there) much earlier in life. Sorry, more hijacking….\n\nI guess I'm trying to say, with NO intended offense to the other members here, I couldn't care less how the new SW:LCG functions, plays, looks like, performs, etc. I'm quite happy with LOTR:LCG at the moment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669610","commentId":669610,"userName":"John85","timestamp":1344270681,"content":"All that being said, I think Dain is right\n\nDain Ironfoot said:\n\n…\n\nwith that said, is anyone looking forward to that game? (again, highjacking!). of course, i'm sure there are. but the property just seems so \"bland\" to me and I see SW being probably their biggest money maker, as it is their highest profile license.\n\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=669686","commentId":669686,"userName":"Rheingold","timestamp":1344281254,"content":" I am most definitely interested in Netrunner.  The SW property for gaming I think is a hindrance these days to me and mine.  The art and style of Netrunner look phenomenal, and huzzah for any original IP these days (by which I mean not one of the major sci-fi/fantasy franchises that have been with us forever).  When they re-booted Star Trek (not that I am a big fan) I thought \"what a waste.\"  All those resources could have gone to a new IP, perhaps some bad-ass Sci-Fi novel that hasn't received it's due.  Pity.  \n\nAnyhoo:\n\nI only have Khazad-Dum and some packs plus core, but thusfar LOTR has been a breathe of fresh air.   It may \"buckle under it's own weight\" as was mentioned previous, but by the time all is said and done, one could have a massive collection of quests and challenges at their disposal, and the tweaking of decks to carry them on for a few years, even with the quests they have.  Any given quest can play out a bit differently - I am one who tries to play it multiple times, in \"best-of\" formats.  Games like this are near the highest point on the cost curve though to get the \"most\" out of them, so always something to consider.\n\n \n\nRheingold"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=671363","commentId":671363,"userName":"booored","timestamp":1344538840,"content":"Rheingold said:\n\nAnyhoo:\n\nI only have Khazad-Dum and some packs plus core, but thusfar LOTR has been a breathe of fresh air.   It may \"buckle under it's own weight\" as was mentioned previous, but by the time all is said and done, one could have a massive collection of quests and challenges at their disposal, and the tweaking of decks to carry them on for a few years, even with the quests they have.  Any given quest can play out a bit differently - I am one who tries to play it multiple times, in \"best-of\" formats.  Games like this are near the highest point on the cost curve though to get the \"most\" out of them, so always something to consider.\n\nI am not saying the game isn't good .. it IS good.. and it IS getting better… But this is in reality a board game that uses cards and not a traditional card game like the other LCGs that FFG have released. What I am trying to get at with the buckle under its own weight idea is that if you are involved in the board game /card game scene and meet with your mates, say twice a month for a game night.. already you need to play this game constantly for like nearly 20 sessions (read 10 months.. nearly a year) Maybe less if you play more than one quest a night.. and even more if you fail anything and need a new day to re-attempt it.\n\nThis is a BUTT load of quest and time. Most game groups like playing new stuff and trying new games and the like and at the moment LoTR provides a great experience and has a decent card pool so there are some variety in the decks you can construct.. meaning that any group can (with just whats available) play this game (along with others they pick up here and there) for over a year easy with out ever playing the same quest twice.\n\nI know many game groups that have moved on to other games as people just do not want to play the same game every time they meet up. I also know others (min included) were we have played some quests only once, and a few we haven't ever played.\n\nI think the new Expantions are a really good idea for this game. Instead of a constant stream of quest that overwhelm the users we can choose to pick up a large expantion now and then that has a contained experience (and new player cards)\n\nSo a few months latter we go.. hey wan play more LoTR.. lets get those 2 hobbit expansions… we now have a \"new\" game that is contained we can play it over a few sessions then move on to another neat game (relic is in my sights for example)\n\nAgain this isn't really a criticism of LoTRlcg itself… they game is good and die hard fanatics will buy the new packs every month no matter what and pretty much play this and nothing else ever.. but I would suspect more gamers are in this other boat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=671539","commentId":671539,"userName":"DurinIII","timestamp":1344579915,"content":"@Booored. As you probably know already, I used to spend most of my time soloing. Now, I play primarily multi player with a group of people and it is much more interesting and the cards interactions shine more than in solo! Because, like you said, this game is maximally designed for 2 or more players. I have to agree with you man!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=671540","commentId":671540,"userName":"richsabre","timestamp":1344580071,"content":"DurinIII said:\n\n \n\n@Booored. As you probably know already, I used to spend most of my time soloing. Now, I play primarily multi player with a group of people and it is much more interesting and the cards interactions shine more than in solo! Because, like you said, this game is maximally designed for 2 or more players. I have to agree with you man!\n\n \n\n \n\nhey man- check out my player amount poll- it wil be interesting to see how the amount of solo players vs multiplay players turns out\n\nSolo play is in the lead….but i need alot more players to vote to see real results\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=671543","commentId":671543,"userName":"Glaurung","timestamp":1344581364,"content":"DurinIII said:\n\n@Booored. As you probably know already, I used to spend most of my time soloing. Now, I play primarily multi player with a group of people and it is much more interesting and the cards interactions shine more than in solo! Because, like you said, this game is maximally designed for 2 or more players. I have to agree with you man!\n\n\n\nI also agree solo game is more boring then coop game for sure. But sometimes problem of coop game it can be much more easy which is also make game boring. But is easy to fix doesn use some certain powerful player cards and then coop game is really shining!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=674699","commentId":674699,"userName":"Dain Ironfoot","timestamp":1345112328,"content":"booored said:\n\n \n\nDain Ironfoot said:\n\n \n\nbooored said:\n\n \n\nSo while // YES // the game is very good, and it IS getting better… it is also starting to buckle under its own weight were the active reasoning for buying new quest is changing. With Netrunner and Star Wars (co-op like this one) coming out form FFG and the mass of other games in the world.. people have to ask. is this game going to really add anything to my play group..\n\n \n\n \n\ntotally off topic, but i would be very surprised if Star Wars remains co-operative. With all of the outrage on the SW forums about it being cooperative and FFG \"going back to the drawing board\" my guess is that it will now be competitive. of course, we've had no update whatsoever since February, but I really expect it to be competitive now.\n\nI think co-op games are probably a larger challenge to design in the LCG format than the designers expected, while it is \"easier\" to design a competitive game and that more easily facilitates tournaments, etc. either way, we shall see!\n\n \n\n \n\nWe will find out.. but I see no evidence either way and FFG is just about to release Netrunner a dueling scifi game … . There is no info form FFG so the threads in the Star Wars forums are the worst examples of rumourmongering I have see in a long time.. there is simply no info either way Some people point to that \"new\" box that has 2-6 on it.. others point to that it still says co-op in the game description at the ffg site.. There is simply not enough info to make any kind of suspicion.. so with out any info to the country I see no reason to expect it to be different form the original announcement. Especially with Netrunner filling the scifi duel game need.\n\nAlso worth noting that I follow that forum pretty close and the massive thread of pvp vs coop.. has more people looking for co-op than pvp.. So the \"outrage\" is a myth as well. PvP players ar just vocal minority on that forum.\n\n \n\n \n\nSW:LCG is now going to be competitive, has been verified by FFG employee, and will be on sale at the end of the year! It's being demo'd at GenCon.image.jpg [http://s19.postimage.org/7eqpqqwr7/image.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68648-how-has-the-game-turned-out-since-the-core-set/?do=findComment&comment=675996","commentId":675996,"userName":"shoreless","timestamp":1345282688,"content":" \n\n \n\n> I am not saying the game isn't good .. it IS good.. and it IS getting better… But this is in reality a board game that uses cards and not a traditional card game like the other LCGs that FFG have released. What I am trying to get at with the buckle under its own weight idea is that if you are involved in the board game /card game scene and meet with your mates, say twice a month for a game night.. already you need to play this game constantly for like nearly 20 sessions (read 10 months.. nearly a year) Maybe less if you play more than one quest a night.. and even more if you fail anything and need a new day to re-attempt it.\n> \n> This is a BUTT load of quest and time. Most game groups like playing new stuff and trying new games and the like and at the moment LoTR provides a great experience and has a decent card pool so there are some variety in the decks you can construct.. meaning that any group can (with just whats available) play this game (along with others they pick up here and there) for over a year easy with out ever playing the same quest twice.\n\nMan, this forum is rough on an iPad!\n\nAnyways, I see what you're saying here and I kind of agree. I just have the core set and the first two adventure packs  (and the money/time to buy only one new pack a month or so) and I feel overwhelmed. I want all the cards but I won't enjoy them all if I just runout and buy everything at once. It's a bit of a dilemma. "}]}