{"url":"https://community.fantasyflightgames.com/topic/68710-toning-the-difficulty/","title":"Toning the difficulty","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68710-toning-the-difficulty/?do=findComment&comment=669940","commentId":669940,"userName":"MyNeighbourTrololo","timestamp":1344332008,"content":"If you're feeling like your encounter deck smashes you into pieces, you can somewhat ease things for you if you follow this though I got here.\n\nThe thing is you can regulate the level of \"challenge\" it offers if you divide the encounter deck into two parts: moderate and hard. And the game will look like it starts with less pressure on you, but it eventually will grow.\n\nLet me make an example for you using the encounter deck of very first quest - the Passage through Mirkwood.\n\nThis deck consists of:\n\n(Goblin Symbol):\n\n1xChieftan Ufthank\n\n 2xDol Guldur Beastmaster\n\n3xDol Guldur Orcs\n\n2xNecromancer's Pass\n\n2xEnchanted Stream\n\n3xThe Necromancer's Reach\n\n1xDriven by Shadow\n\n(Tree Symbol):\n\n1xEast Bight Patrol\n\n4xForest Spider(3x actually, because of setup)\n\n1xBlack Forest Bats\n\n2xForest Gate\n\n2xOld Forest Road(1x actually, because of setup)\n\n(Spider Symbol):\n\n1xUngoliant's Spawn\n\n1xHummerhorns\n\n2xKing Spider\n\n2xGreat Forest Web\n\n3xMountains of Mirkwood\n\n1xEyes of the Forest\n\n2xCaught in the Web\n\n \n\nWhat we do now is create Moderate and Hard parts of the deck.\n\nFor this one I include in Hard part of the deck:\n\nUngoliant's Spawn, Hummerhorns, Chief Ufthank, Dol Guldur Beastmaster(1), King Spider(1), Forest Spider(1), Dol Guldur Orc(1), Great Forest Web(1), Enchanted Stream(1),  Necromancer's Pass(1), Eyes of the Forest, The Necromancer's Reach(2).\n\nFor Moderate part of the deck I put it:\n\nForest Spider(1), Black Forest Bats, Dol Guldur Orcs(1), East Bight Patrol, Old Forest Road(1), Forest Gate(1), Mountains of Mirkwood(2), Driven by Shadow, Caught in a Web(1).\n\n \n\nNow, after I created two parts of the deck, I have some cards left. Those are \"libmo\" cards. I shuffle them and divide into two even(as close to even as possible) parts, not looking on them, and then randomly add one of the parts to moderate part, and the second one to the hard part of the deck. Then I shuffle both moderate and hard parts, and place finally putting them together(moderate part above the hard) to create an encounter deck for the quest.\n\n \n\nWith this done, I'm sure I won't be stomped by Ungoliant's spawn on my first turn and overwhelmed by necromancer's reaches too, decreasing the overall difficulty, but deck is still random and I still can't be sure whats waiting for me at the next corner. Same can be done for any quest. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68710-toning-the-difficulty/?do=findComment&comment=669949","commentId":669949,"userName":"schmoo34","timestamp":1344333059,"content":"Or how about this?\n\nTake all of the time you invested to analyze the encounter deck, divide them, and figure out an easy vs. medium/hard tier.\n\nReinvest that time to invest in analyzing the player deck/cards, build the deck and figure out a hero/card combination which is effective.\n\n \n\nThen you will defeat the quest even if Ungoliant's spawn appears on turn 1…and you will be well equipped to handle the remainder of the quests without all the stress and worry of evaluating the encounter cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68710-toning-the-difficulty/?do=findComment&comment=669958","commentId":669958,"userName":"MyNeighbourTrololo","timestamp":1344334179,"content":"I'm a happy only-core-set owner, so no much space for deckbuilding.\n\nAnd even with this core set, I won with spawn popping out on first turn. This is not the matter of better deck strategy. This is matter of getting comparedly easy start with harder finish. "}]}