{"url":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/","title":"Durin&#039;s Bane, Dark Pit, OEG [S&amp;F SPOILERS]","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=670310","commentId":670310,"userName":"jjeagle","timestamp":1344389172,"content":" Durin's Bane \"cannot leave the staging area\" (by its own text).\n\nI presume this means that O Elbereth Gilthoniel will not work on Durin's Bane (since putting DB on the bottom of the encounter deck would involve it \"leaving the staging area\"). This seems fair enough.\n\nHowever, the same reasoning suggests that Dark Pit will not work on Durin's Bane, as it \"discards DB from play\" (= \"leaving the staging area). This would obviously be absurd as DP appears to be the way that the quest requires you to overcome Durin's Bane.\n\nGiven this, what reason is there to say that OEG does not work on DB, but that Dark Pit does? (other than perceived designer intent, a very poor basis for rulings)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=670322","commentId":670322,"userName":"starhawk77","timestamp":1344391148,"content":"None, unless the scenario rules say something like \"Durin's Bane can never leave the staging area, except via the effect on Dark Pit.\" Absent that, either OEG and Dark Pit both work or neither one of them can affect DB. Strictly speaking, I think the latter option is more consistent with the printed cards…but that makes the scenario virtually impossible. \n\nIf it's not addressed in the rule sheet, it needs to receive official errata/clarification. Otherwise, a 0-cost card--and it WILL be 0, since the scenario rules reduce each player's threat to 0 at the start of the game--trivializes the scenario and likely makes many of the encounter cards irrelevant (since they key off Durin's Bane).\n\nNow that I've outlined my concerns, that exact rule is bound to show up in the rule sheet, just to make me look like Chicken Little lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=670325","commentId":670325,"userName":"jjeagle","timestamp":1344391933,"content":" I'm not optimistic that this will happen - similarly FOS left major unresolved rules questions hanging. My impression is that card wording and so on was tightened up significantly from KD onwards but has lapsed back into frequent sloppy templating from FOS onwards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=670328","commentId":670328,"userName":"starhawk77","timestamp":1344392941,"content":"Yeah, the track record isn't particularly encouraging. At worst, though, we'll have to rely on what should be a pretty simple official clarification. Unlike some of the FoS questions, the \"correct\" solution in this case at least seems intuitive (i.e., you must be able to win, but you probably shouldn't be able to just negate the uber boss monster with one free event). \n\nI'll pick up the AP tomorrow, so I'll check then. Either way, it looks to be a fun scenario if all the above cards interact as they \"should.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=674144","commentId":674144,"userName":"pinkbatgirl","timestamp":1345018003,"content":" Has Starhawk or anyone picked up the AP yet to see if this is clarified in the insert??\n\n(It takes longer to get to our shops here in the UK!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=674265","commentId":674265,"userName":"Valyrian Steel","timestamp":1345031077,"content":" There is no clarification in the rules insert. While this is again sloppy writing I think it seems pretty clear from the quest card and the location that using the dark pit successfully gets rid of the Balrog. The location says, \"If all discarded cards have a higher combined printed cost than the remaining hit points of Durin's Bane, discard Durin's Bane from play.\". The quest card says, \"If Durin's Bane leaves play by the effect on Dark Pit, the players have won the game.\" \n\nThe only real problem here is the use of \"cannot\" on the Balrog which we all know to mean is not able to be overridden by any card. Starhawk is right on what the wording probably should have been. I do not believe any other card than Dark Pit is able to remove the Balrog from the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=674308","commentId":674308,"userName":"pinkbatgirl","timestamp":1345037338,"content":" Thanks VS for the extra info on the other cards' wordings, I believe that confirms that the text on the balrog should have said cannot leave the staging area except through the effect of Dark Pit.  Would be good if FFG could officially confirm & errata that though of course!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=680032","commentId":680032,"userName":"lexlloyd","timestamp":1345679946,"content":"You guys have covered this topic pretty well but let me add a thought or two.  I believe that Dark Pit is substantively different from OEG because of the specificity of the language on the card.  I generally abide by the maxim that where two rules or effects contradict, the more specific rule takes precedence.  Dark Pit is VERY specific, actually naming Durin's Bane and telling you to discard it.  OEG is more general.  And too, Dark Pit is completely non-sensical if it cannot discard Durin's Bane but that's a different argument.\n\nWhile I'm comfortable in saying that Dark Pit trumps Durin's Bane, I have to admit that the above logic doesn't answer the question of whether OEG trumps Durin's Bane.  Neither card includes specific language suggesting it is superior to the other.  However, I intend to give the balrog precedence because otherwise OEG turns this scenario into a cake-walk. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=680187","commentId":680187,"userName":"starhawk77","timestamp":1345704620,"content":"lexlloyd said:\n\nWhile I'm comfortable in saying that Dark Pit trumps Durin's Bane, I have to admit that the above logic doesn't answer the question of whether OEG trumps Durin's Bane.  Neither card includes specific language suggesting it is superior to the other.  However, I intend to give the balrog precedence because otherwise OEG turns this scenario into a cake-walk. \n\n\n\nYeah, I don't have any doubt that Dark Pit SHOULD work on DB. We can all see what is supposed to happen. Heck, the third quest card specifically mentions it. But the FAQ is clear that \"cannot\" is an absolute term. It doesn't say \"Cannot is absolute, except in cases where an effect names a specific card title.\" FFG could have written \"Durin's Bane cannot leave the staging area except through encounter card effects,\" and that would have solved the whole issue. I realize it seems like a minor distinction, but I'm kind of being a stickler about it because I'd just like to see clear, consistent wording as often as possible.\n\nOEG, to me, clearly does NOT work on the Balrog. It lacks the specific reference, which is the only thing that could conceivably allow Dark Pit to work as currently worded. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=680255","commentId":680255,"userName":"leptokurt","timestamp":1345711875,"content":"Wouldn' t this be a stupid scenario if OEG would work on Durin's Bane? I really don't care if it does, cause even if it would I wouldn't use it in this scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=680566","commentId":680566,"userName":"starhawk77","timestamp":1345732521,"content":"leptokurt said:\n\nWouldn' t this be a stupid scenario if OEG would work on Durin's Bane? I really don't care if it does, cause even if it would I wouldn't use it in this scenario.\n\n\n\nWell, it wouldn't be an automatic victory (since the only victory condition on Stage 3B involves pushing DB into the Dark Pit). Assuming you could put DB on the bottom of the encounter deck, you'd still have to eventually cycle through the whole thing, find the Balrog, and discard him from play with Dark Pit. However, if you weren't too concerned about your score, it would give you perhaps dozens of turns to play your cards and set up a force able to swat the thing when it reappeared. It would also cause about half of the encounter deck cards to fizzle, since they all key off DB.\n\nSo, I think it would make for a very boring experience, and I would likewise be disinclined to play OEG even if it could work. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=682556","commentId":682556,"userName":"player1761766","timestamp":1345997348,"content":"I've had to send FFG an email to try and put my own mind at rest on this. \n\nThematically, I'd explain the playing of OEG as my little band, now aware of what they're up against, manage to give the balrog the slip and go off somewhere to regroup, still coming up against orcs in the meantime. They then muster enough allies to go back for one final assault when the encounter deck eventually spits him back out. \n\nThinking about it, doesn't this scenario have cards that shuffle the discard pile back into the encounter deck? So he may not remain on the bottom for long, anyway…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=682813","commentId":682813,"userName":"leptokurt","timestamp":1346038863,"content":"starhawk77 said:\n\nleptokurt said:\n\n \n\nWouldn' t this be a stupid scenario if OEG would work on Durin's Bane? I really don't care if it does, cause even if it would I wouldn't use it in this scenario.\n\n \n\n \n\nWell, it wouldn't be an automatic victory (since the only victory condition on Stage 3B involves pushing DB into the Dark Pit). Assuming you could put DB on the bottom of the encounter deck, you'd still have to eventually cycle through the whole thing, find the Balrog, and discard him from play with Dark Pit. However, if you weren't too concerned about your score, it would give you perhaps dozens of turns to play your cards and set up a force able to swat the thing when it reappeared. It would also cause about half of the encounter deck cards to fizzle, since they all key off DB.\n\nSo, I think it would make for a very boring experience, and I would likewise be disinclined to play OEG even if it could work. \n\n\n\n \n\nI stand corrected. I only remembererd that DB had to out of play to win the game and forgot about the condition that  Dark Pit's effect has to be triggered to win the game.\n\n \n\n@ spalanzani:\n\n \n\nQuest card 3B has a when revealed effect that says that the Balrog immediatly attacks the starting player. I guess that means that you have to bring him back into play at that point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=683213","commentId":683213,"userName":"player1761766","timestamp":1346087291,"content":"Well, here we have it:\n\nDurin's Bane cannot leave the staging area, so O Elbereth! Gilthonial! will not send it to the bottom of the encounter deck. This does create a problem with the text on Dark Pit. That card will receive an erratum in the next FAQ to explain that its ability supersedes the game text on Durin's Bane, making it possible for players to defeat the scenario the way it was intended. In the meantime, please play the scenario as if the last line of Dark Pit reads \"This effect supersedes the game text on Durin's Bane.\"\nThanks,\nCaleb\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68756-durins-bane-dark-pit-oeg-sf-spoilers/?do=findComment&comment=683216","commentId":683216,"userName":"starhawk77","timestamp":1346087493,"content":"spalanzani said:\n\nWell, here we have it:\n\nDurin's Bane cannot leave the staging area, so O Elbereth! Gilthonial! will not send it to the bottom of the encounter deck. This does create a problem with the text on Dark Pit. That card will receive an erratum in the next FAQ to explain that its ability supersedes the game text on Durin's Bane, making it possible for players to defeat the scenario the way it was intended. In the meantime, please play the scenario as if the last line of Dark Pit reads \"This effect supersedes the game text on Durin's Bane.\"\nThanks,\nCaleb\n \n\n \n\n \n\n\n\nExcellent. Thanks for submitting the question."}]}