{"url":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/","title":"Shadow and Flame is AWESOME (spoilers)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=671944","commentId":671944,"userName":"leptokurt","timestamp":1344620236,"content":"I got my copy of SaF today, and after playing some games I can say it's a fitting end to the Dwarrowdelf. For those of you who are still waiting for SaF but want to know how the scenario works, here is a little summary of the quest cards:\n\n \n\nStage 1:\n\nDurin's Bane is put into the staging area plus X cards (X is the number of players minus 1). For solo players like me that means no additional card. The really cool thing is that all players start with a threat of 0 (!!!), so it is possible (and neccessary) to avoid an attack by Durin's Bane in turn 1. This means of course that you don't have to worry about your starting threat, but you can take all these expensive heroes - you'll need them! It's certainly a new gaming experience, as it allows you to loose some quest stages without loosing control of your threat level.\n\n \n\nStage 2:\n\nHere the players have to make 16 progress. This is not as hard as it sounds, as the players together can place 4 progress on the quest card (bypassing all locations) if at least one hero was committed to the quest. This stage also ends when Durin's Bane has 0 HP left.\n\n \n\nStage 3:\n\nOnly 1 progress token has to be placed on the quest card, but the players also have to pass The Dark Pit (11 progress). You have to be careful that you defeat the Balrog before you explore the pit! Durin's Bane attackes immediatly when the quest card is revealed, which means it attacks twice in tat round.\n\n \n\nPlayers will spent most of their time in stage 1, as it is very hard to make progress at all, if you don't run a Rohan deck. It doesn't helpt to hurry to stage 3 though if you're not able to defat the Balrog. In my two wins it took me 13 and 18 turns to complete the scenario.\n\n \n\nWhat's inside the encounter deck?\n\n \n\nA lot of mean stuff, of course:\n\n- weapons for the Balrog that increase its ATT to 9 points and force you to discard a card each time it attacks you\n\n- nasty shadow effects that again increase the ATT value of Duri's Bane or dicard a character\n\n- an attachment for Durin's Bane that makes it very dangerous to play event cards (which is why Hama sucks in this scenario); the attachment nullifies the event and forces a player to discard his whole hand if a treachery card is revealed as a response\n\n- plus all the nasty cards from the KD expansion\n\n \n\nLocations and other enemies aren't too hard. The whole scenario is centred around Durin's Bane, and once you're able to deal with his attacks you're close to winning the scenario. Secrecy cards are obviously helpful, as is every card that can heal your heroes or boost their defense. Quite funny that I recently started a thread about Gimli + Ctadel Plate being obsolete or some other players who thought that Daughter of the Nimrodel would go to retirement with all the new healing cards. I haven't playeed with Gimli yet, but he is certainly an option. DotN absolutely rocks this scenario, together with Elrond's ability she can heal 3 damage each round.\n\n \n\nAll in all the difficulty rating of 8 is justified. I got some hard beatings in my first games, but I'm getting better (hint: use the new cards!) with my recent deck. Like I said, it feels like a proper end to the second cycle. The hardest solo adventure so far (besides Dol Guldur, that is)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=671955","commentId":671955,"userName":"starhawk77","timestamp":1344621750,"content":"Agree with most of your sentiments. I really enjoy this scenario. There are ways you can exploit the mechanics to make it easier, but the Balrog is a pretty fearsome opponent. Counterspell is an awesome encounter card design, and the two weapon attachments are also neat. I think the most devastating card in the set is Leaping Flames (the treachery that triggers an immediate attack from Durin's Bane). I haven't found this quest as difficult as some of the other high-end scenarios, but it's definitely a challenging and entertaining addition."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=671978","commentId":671978,"userName":"richsabre","timestamp":1344624484,"content":"thanks for this- really cant wait now!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672083","commentId":672083,"userName":"Glaurung","timestamp":1344646538,"content":"Sounds good. I will get it in couple of days. Really want to play Elrond in my deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672084","commentId":672084,"userName":"starhawk77","timestamp":1344647598,"content":"Glaurung said:\n\nSounds good. I will get it in couple of days. Really want to play Elrond in my deck.\n\n\n\nSpoiler: he rocks. Vilya is his main asset, but don't overlook his ability to amplify healing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672150","commentId":672150,"userName":"DurinIII","timestamp":1344666426,"content":"Yeah, Elrond is so awesome! I like his abilities more than putting Vilya on him, though, Vilya is of course an extremely powerful card!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672152","commentId":672152,"userName":"leptokurt","timestamp":1344667759,"content":"Vilya + Light of Valinor as a combo make Elrond an allrounder - 3 WP plus the healing bonus plus one free card each round plus the ability to play allies from eachs sphere - wow! And he's also a great defender and a good attacker.\n\nA threat level of 13 is of course something to consider, but every single point is worth its cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672589","commentId":672589,"userName":"Pharmboys2013","timestamp":1344773767,"content":" Got my pack in the other day; I've played thru the scenario 4 times so far (all solo) and have yet to win.  Regardless, its still a really fun scenario and quite different from the other quests we've had thus far.  I feel like you need the tactics sphere to really stand a chance in this quest as you need to be constantly dealing significant damage to the balrog each turn since he has regenerate 3.\n\nElrond is great although Vilya hasnt been as useful as I'd anticipated; unless you have Stargazer or Gildor you can risk wasting an otherwise necessary event.  Its also hard to decide when to exhaust Elrond for Vilya's effect or have him attack or defend considering his stats are all around quite good. (also assuming you have Light of Valinor attatched)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672638","commentId":672638,"userName":"leptokurt","timestamp":1344780748,"content":"Pharmboys2013 said:\n\n \n\n Got my pack in the other day; I've played thru the scenario 4 times so far (all solo) and have yet to win.  Regardless, its still a really fun scenario and quite different from the other quests we've had thus far.  I feel like you need the tactics sphere to really stand a chance in this quest as you need to be constantly dealing significant damage to the balrog each turn since he has regenerate 3.\n\nElrond is great although Vilya hasnt been as useful as I'd anticipated; unless you have Stargazer or Gildor you can risk wasting an otherwise necessary event.  Its also hard to decide when to exhaust Elrond for Vilya's effect or have him attack or defend considering his stats are all around quite good. (also assuming you have Light of Valinor attatched)\n\n \n\n \n\nI think Vilya is one key to win this scenario. When you combine it with Light of Valinor, Elrond can both quest and play an extra card, but even without that combo - once I have enough WP (6-7 points) I use Elrond/Vilya to play an extra card each round. As my deck is full of attachments and allies, I can either boost my heroes or add another ally. That way I am able to play more than one ally each round which enables me to sacrifice some allies in midgame to the Balrog or to increase my WP.\n\nSay you exhaust Vilya two times and you get Erebor Record Keeper and Arwen - that means plus 4 WP each round in case you have Dáin. In the long term Vilya adds so much to your fellowship that the loss of 3 WP each round is not hurting you a bit.\n\nIf you have Stargazer you can even set up your deck to choose the ally you want to bring in play - FOR FREE!\n\n \n\nEdit:\n\nJust checked my deck - it has only nine events. And three of these copies are \"Timely Aid\". The others are 2x Feint, 3x \"Risk some Light\" and 1x \"Peace and Thoughtful\" (hope that's the right name). The only wasted card here is Feint."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672694","commentId":672694,"userName":"Zdawg88","timestamp":1344791482,"content":" I finally got a win against this scenario playing solo. It took a couple of tries to experiment with some decks to see what would work, but finally found something that worked. The first couple play throughs saw my Heroes get killed by the balrog after a few turns, so trying to defend against the balrog's constant attacking was a key. So my hero choices were as followed:\n\nElrond, lAragorn, and Frodo\n\nObviously Frodo was key to take hits from the Balrog at times. Starting at a 0 threat gets you many turns of adding threat as damage. I also took the lore Aragon to reset my threat to 32, just in case I needed to buy a few more turns. The stargazer and Elrond's ring were also key for getting out key cards. I took some heavy hitters like Beorn, and some other 5 cost allies since they could be free to put into play.  As my allies started to build, chump blockers started taking hits from the balrog, and my heavy hitters started taking down the balrog. I thing I was averaging about 12 damage a turn. Stargazer made it pretty easy then with the pit location to banish the balrog, which had 3 hit points on it when I finished. I didn't keep track of score but my ending threat was around 40 and I did use Aragorn's power. Overall a fun quest, but not as hard as Dol Goldur Solo, which I've yet to beat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/68914-shadow-and-flame-is-awesome-spoilers/?do=findComment&comment=672794","commentId":672794,"userName":"Pharmboys2013","timestamp":1344811457,"content":"Zdawg88 said:\n\n I finally got a win against this scenario playing solo. It took a couple of tries to experiment with some decks to see what would work, but finally found something that worked. The first couple play throughs saw my Heroes get killed by the balrog after a few turns, so trying to defend against the balrog's constant attacking was a key. So my hero choices were as followed:\n\nElrond, lAragorn, and Frodo\n\nObviously Frodo was key to take hits from the Balrog at times. Starting at a 0 threat gets you many turns of adding threat as damage. I also took the lore Aragon to reset my threat to 32, just in case I needed to buy a few more turns. The stargazer and Elrond's ring were also key for getting out key cards. I took some heavy hitters like Beorn, and some other 5 cost allies since they could be free to put into play.  As my allies started to build, chump blockers started taking hits from the balrog, and my heavy hitters started taking down the balrog. I thing I was averaging about 12 damage a turn. Stargazer made it pretty easy then with the pit location to banish the balrog, which had 3 hit points on it when I finished. I didn't keep track of score but my ending threat was around 40 and I did use Aragorn's power. Overall a fun quest, but not as hard as Dol Goldur Solo, which I've yet to beat. \n\n\n\nAny chance you could post the decklist?"}]}