{"url":"https://community.fantasyflightgames.com/topic/68994-word-of-command/","title":"Word of Command","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/68994-word-of-command/?do=findComment&comment=672609","commentId":672609,"userName":"Memetix","timestamp":1344776618,"content":"This card is one a few cards that says \"Exhaust X to do Y\".\n\nMy question is: Are you limited to exhausting a character controlled by yourself or can you exhaust another player's character?\n\nI can't find anything in the rules or FAQ to say that you can only exhaust cards controlled by yourself. If there is, can someone tell me where this point is clarified please?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68994-word-of-command/?do=findComment&comment=672618","commentId":672618,"userName":"Dam the Man","timestamp":1344777559,"content":"\"Paying Costs\n\nMany cards are written in a “pay or exhaust X to do\nY” manner. When confronted with such a construct,\neverything before the word “to” is considered the cost,\nand everything after the word “to” is considered an\neffect.\n\nCosts can only be payed with cards or resources that a\nplayer controls. If an effect is canceled, the cost is still\nconsidered to have been paid.\" (p. 25)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/68994-word-of-command/?do=findComment&comment=672654","commentId":672654,"userName":"Memetix","timestamp":1344782627,"content":"Perfect - thanks, that was the answer I was looking for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68994-word-of-command/?do=findComment&comment=672703","commentId":672703,"userName":"MyNeighbourTrololo","timestamp":1344793692,"content":"I would argue there. Of course, it makes more sense rulewise what you said, BUT there is something in the wording of cards, that makes me think otherwise(perhaps it's just poor wording, who knows).\n\n \n\nLeadership Event \"Common Cause\" states \"exhaust 1 hero you control\", while Word of Command states  \"exhaust an Istari character\", without any refrrences to controlling requirements. So, I would assume, you can exhaust any Istari character in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/68994-word-of-command/?do=findComment&comment=672714","commentId":672714,"userName":"starhawk77","timestamp":1344795200,"content":"No, Dam correctly cited the relevant rules text. You can't pay for Word of Command by exhausting another player's Istari character. The wording on Common Cause is just redundant. "}]}