{"url":"https://community.fantasyflightgames.com/topic/69037-actions-during-combat/","title":"Actions during combat","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69037-actions-during-combat/?do=findComment&comment=672908","commentId":672908,"userName":"Kcall07","timestamp":1344839082,"content":" Hello,\n\nThe new FAQ has left me rather confused as to when you can take player actions during combat. I was playing it as you can only take player actions after each attack/defense resolves fully. I know the bars are green on the turn order chart, but i thought the rules said you can only take actions between steps (I may be wrong.)\n\nSo taking this into account, is it possible to boost your shield with protector of Lorien after a nasty shadow effect has been revealed? Or heal? Is it even possible to feint at this point? Or play quick strike?\n\nI think the shadow effect has to be resolved before you do anything, ie if it says damage defending character. But what if it says enemy gets +2 attack? Can you use any of the steps above to mitigate the effect, or stop the enemy attacking entirely? \n\nAny help would be very much appreciated.\n\nBen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69037-actions-during-combat/?do=findComment&comment=672971","commentId":672971,"userName":"Angus Lee","timestamp":1344847907,"content":"P.18 of the rulebook: \"Players may play event cards and take actions at the end of each step.\" Resolving Enemy Attacks is divided into 4 steps, so you can take actions after each step.  Likewise, Attacking Enemies is divided into 3 steps, and you can take actions after each step.\n\nEdit: so, answering your questions, you can trigger Protector of Lorien's effect or take any actions after revealing and resolving the shadow effect.  However, using Feint now has no effect since the attack has already begun; you have to use Feint before selecting the Enemy to be an attacker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69037-actions-during-combat/?do=findComment&comment=673033","commentId":673033,"userName":"richsabre","timestamp":1344854540,"content":"Kcall07 said:\n\n  I know the bars are green on the turn order chart, but i thought the rules said you can only take actions between steps (I may be wrong.)\n\n\n\nin addition to angus' comment, you can indeed take actions in any green bar\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69037-actions-during-combat/?do=findComment&comment=675234","commentId":675234,"userName":"Nerdmeister","timestamp":1345183087,"content":"Seem to recall having read somewhere that attacks do have to resolve fully before players having the chance to initiate actions. Thus you can take actions between different attacks but not at any point after an attack has been declared and before it has been fully resolved.\n\nI´ll be damned if I can remember where I read that right now though sonrojado.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/sonrojado.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69037-actions-during-combat/?do=findComment&comment=675283","commentId":675283,"userName":"Angus Lee","timestamp":1345189789,"content":"Nerdmeister said:\n\nSeem to recall having read somewhere that attacks do have to resolve fully before players having the chance to initiate actions. Thus you can take actions between different attacks but not at any point after an attack has been declared and before it has been fully resolved.\n\n\n\nThis is definitely incorrect.  As quoted in a reply above, P.18 of the rulebook: \"Players may play event cards and take actions at the end of each step.\" , where  Enemy Attacks is divided into 4 steps and Attacking Enemies is divided into 3 steps."}]}