{"url":"https://community.fantasyflightgames.com/topic/69058-for-those-going-to-gencon-this-week/","title":"For those going to GenCon this week!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69058-for-those-going-to-gencon-this-week/?do=findComment&comment=673137","commentId":673137,"userName":"player2052423","timestamp":1344865061,"content":"Boy, I can't wait for Thursday…..\n\nIn a previous thread some time ago, there was a suggestion for a get together at Gencon.  Since that time, FFG has posted some events that are going off on Friday (Laketown), as well as other FFG events for the weekend that I know caused some conflicts (especially for me).\n\nIf anyone would like to get together for some fun.  How about meeting Saturday evening at 7pm in the FFG play area.  Usually at that time things have calmed down and there are empty tables to play at.  We can see how many show up and maybe have a small tourney.  I have an idea that might be fun and I may come up with a prize or two.  The play will be casual!! Ask for Moses if you have trouble finding us.  I'll make mention to the FFG folks that are around the FFG play area.\n\nIf nothing else we can throughly discuss the new Saga edition and the Laketown event and make some new friends."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69058-for-those-going-to-gencon-this-week/?do=findComment&comment=673156","commentId":673156,"userName":"richsabre","timestamp":1344867349,"content":"lucky buggers haha…lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\ni hope you all have a great time at GenCon- i look forward to your session reports when you get back!!\n\nRich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69058-for-those-going-to-gencon-this-week/?do=findComment&comment=673514","commentId":673514,"userName":"Shady Rick","timestamp":1344930473,"content":" I should be able to make this. Like you I had already signed up for other events before the LotR LCG events were advertised. My flight leaves early Sunday morning so my plan will likely be to just stay up all night playing LotR. \n\nSee you there. "}]}