{"url":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/","title":"Question about the &quot;Ranged&quot; keyword.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673283","commentId":673283,"userName":"DurinIII","timestamp":1344883064,"content":"Okay guys, like many of you, I am thoroughly enjoying the new \"Hands upon the Bow\" card allowing Legolas to do what Legolas does best…snipe things dead. My question is a simple one: Is the single condition for an attack to be considered \"Ranged\" when my ranged character shoots at an enemy engaged with another player? I haven't messed with ranged myself up until this last Adventure Pack, and I am really hoping/wishing that an attack is considered \"Ranged\" when shot into the staging area, but I fear it isn't that way. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673284","commentId":673284,"userName":"richsabre","timestamp":1344883240,"content":"dont think so - Hands upon the bow is for ranged characters, but using it doesnt trigger a ranged attack\n\nnice thought though\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673286","commentId":673286,"userName":"booored","timestamp":1344884190,"content":"The way I think of it is that anything with \"ranged\" on it printed or attached is attacking ranged every time. At this time I do not think there is any reason to consider them differently. It is a passive effect that is constant on every time they attack, not something that triggers. Every time Legolas attacks it is a ranged attack, even if it is into your own engagement area.\n\nThis new super powerful Hands upon the Bow [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/shadow-and-flame/hands-upon-the-bow-saf] card is trivial to use… just exhaust a character with ranged and it IMMEDIATELY attacks. So it can run at event speed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673338","commentId":673338,"userName":"DurinIII","timestamp":1344890267,"content":"I am inclined to agree with you booooored, which would mean that Legolas could get a +1 Attack bonus off of the Bow Attachment in solo games.  However, the way the Ranged keyword is described on page 24 of the rule book makes it sound as if the attacks are only deemed \"ranged\" if they are targeting an enemy engaged with another player. So, I am still not really sure. Thanks for the comments."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673352","commentId":673352,"userName":"Bullroarer Took","timestamp":1344893109,"content":" But isn't the greater cave troll immune to ranged damage, but not to an attack by a ranged character in his own engagement area?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673391","commentId":673391,"userName":"DarthJalapeno","timestamp":1344904491,"content":"Bullroarer Took said:\n\n But isn't the greater cave troll immune to ranged damage, but not to an attack by a ranged character in his own engagement area?\n\n\n\n \n\nThis is how I interpret it too. Ranged is used when attacking enemies engaged with a fellow player. Just as Sentinel is only used when defending your buddy from enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673408","commentId":673408,"userName":"richsabre","timestamp":1344908925,"content":"yes otherwise rivendell bow would make legolas ALWAYS get a permanent +1 attack…its says when a character makes a ranged attack so i stil think they are two seperate things\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673483","commentId":673483,"userName":"DurinIII","timestamp":1344924935,"content":"I think that is right Rich, though, I really don't think it would be too overpowered if Legolas always received a +1 from a bow attachment. That seems like the way it should be to me. Oh well. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69074-question-about-the-ranged-keyword/?do=findComment&comment=673521","commentId":673521,"userName":"GhostWolf69","timestamp":1344931256,"content":"IMO Ranged Attack is considered whenever Ranged is a requirement to execute the attack.\n\nSo Legolas is not Using Ranged when attacking enemies engaged with \"his own\" player for instance, because Ranged is not required to attack them.\n\nHe IS using Ranged when attacking Enemies Engaged with other players, because without Ranged he would not be able to attack them at all.\n\nSo far, I think we agree.\n\nNow: \"Hands on the Bow\" requires Ranged. Because if Legolas didn't ahve that keyword, you would not be able to play the card on him.\n\nTherefore I conclude that Attacking using this card indeed IS a Ranged attack, since Ranged is a Requirement for the Attack to happen.\n\nThat is my ruling anyway. If official sources Rule otherwise I will House-Rule it.\n\n/wolf"}]}