{"url":"https://community.fantasyflightgames.com/topic/69091-cards-with-victory-points-and-shadow-effects/","title":"Cards with victory points and shadow effects","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69091-cards-with-victory-points-and-shadow-effects/?do=findComment&comment=673426","commentId":673426,"userName":"Memetix","timestamp":1344913744,"content":"On page 24 it says\n\nVictory X\n\nSome enemy and location cards award victory points\nwhen they are defeated. When such a card leaves play,\none player should place it near his threat dial to remind\nthe players of the victory points when they are scoring\nat the end of the game.\n\nIn the FAQ it clarifies that shadow cards \"leave play\" at the end of the combat phase. \n\nThe first sentence is poorly written since a location cannot be defeated, a location can be explored, only enemies can be defeated. This sentence can't really be taken literally because you could never get victory points for locations.\n\nSo it comes down to how we should interpret \"such a card\" in the second sentence of the defintion.\n\nUsing common sense (a danerous thing to do), \"such a card\" therefore either means \"a defeated enemy card with victory X or an explored location card with victory X\" or it means \"a card with victory X\".\n\nIn the first case you wouldn't put Hummerhorns [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/hummerhorns-core]in the victory display if it was revealed as a shadow card, in the second case you would.\n\nHas there been an official ruling on how we should be interpreting this?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69091-cards-with-victory-points-and-shadow-effects/?do=findComment&comment=673460","commentId":673460,"userName":"richsabre","timestamp":1344921491,"content":"i certainly wouldnt think that a card should go to the victory display if its a shadow card..not that i can think of a rule that says this directly\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69091-cards-with-victory-points-and-shadow-effects/?do=findComment&comment=673469","commentId":673469,"userName":"muemakan","timestamp":1344922218,"content":"                           "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69091-cards-with-victory-points-and-shadow-effects/?do=findComment&comment=673648","commentId":673648,"userName":"VTSvsAlucard","timestamp":1344945084,"content":" This happened o us last night, and we really wanted the points to just get Hummerhorns out of the game. However, we decided that it does NOT go to the victory pile and is discarded like other Shadow cards. We came to this conclusion because there are other cards with Victory Points that have no shadow effect, such as a couple locations in the Anduin River quest.  Technically they are still dealt as shadow cards and resolve with no effect, so they undergo all the same processes as the Hummerhorns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69091-cards-with-victory-points-and-shadow-effects/?do=findComment&comment=673734","commentId":673734,"userName":"Valyrian Steel","timestamp":1344953199,"content":" I think you're probably looking for something that isn't there. I agree poor choice of words as usual, but that's obviously not the intent of victory point cards. They should only be claimed when you have defeated the enemy or explored the location."}]}