{"url":"https://community.fantasyflightgames.com/topic/69218-o-elbereth-gilthonial-or-son-of-arnor-against-durins-banethe-watcher-with-another-tentacle-enemy-in-play/","title":"O Elbereth! Gilthonial! OR Son of Arnor AGAINST Durin&#039;s Bane/The Watcher with another Tentacle enemy in play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69218-o-elbereth-gilthonial-or-son-of-arnor-against-durins-banethe-watcher-with-another-tentacle-enemy-in-play/?do=findComment&comment=674644","commentId":674644,"userName":"PESKPESK","timestamp":1345105159,"content":"What if I play:\n\n1) O Elbereth! Gilthonial! After a attack.\n2) Son of Arnor\n\nAgainst:\n\nA) Durin's Bane\nB) The Watcher with another Tentacle enemy in play\n\nSpecific is it legal for the quest? What happens, are the gone/engaged? Status with quest cards? Victory?\n\n\nDurin's Bane\nType: Enemy\nEncounter Set: Shadow and Flame\nThreat Threashold: 1\nThreat: 4 Attack: 6 Defense: 3 Hit Points: 27\nBalrog. Flame. Shadow.\nRegenerate 3. Indestructible. Players cannot play attachments on Durin's Bane.\n\nDuring's Bane cannot leave the staging area,\nis considered to be engaged with each player whose threat\nis 1 or greater, and attacks each of those players in turn\nduring the combat phase (deal and discard a new\nshadow card each attack).\n\n\nThe Watcher\nType: Enemy\nEncounter Set: The Watcher in the Water\nThreat Threashold: 48\nThreat: 4 Attack: 5 Defense: 7 Hit Points: 9\nCreature. Tentacle.\nRegenerate 2. While there is another Tentacle enemy in play, The Watcher cannot be optionally engaged.\nIf The Watcher is in the staging area at the end of the combat phase, each player must deal 3 damage to 1 character he controls.\n\nO Elbereth! Gilthonial!\nType: Event Sphere: Spirit\nCost: 4\nSecrecy 4.\nResponse: After an enemy attacks you, put that enemy\non the bottom of the encounter deck. If your threat is\nlower than that enemy's engagement cost, set your\nthreat equal to the engagement cost of that enemy.\n\nSon of Arnor\nType: Ally\nSphere: Leadership Cost: 3\nWillpower: 0 Attack: 2 Defense: 0 Hit Points: 2\nDunedain.\nResponse: After Son of Arnor enters play,\nchoose an enemy card in the staging area or\ncurrently engaged with another player. Engage\nthat enemy.\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69218-o-elbereth-gilthonial-or-son-of-arnor-against-durins-banethe-watcher-with-another-tentacle-enemy-in-play/?do=findComment&comment=674678","commentId":674678,"userName":"Valyrian Steel","timestamp":1345109333,"content":" Against Durin's Bane - According to the FAQ, the word \"cannot\" is absolute. Therefore, OEG and Son of Arnor would not be effective at discarding or moving DB out of the staging area respectively. The only way to get rid of DB is through the Dark Pit location effect. This point is not 100% clear by a literal reading of the cards since again cannot is absolute yet the dark pit says to discard him, but it seems pretty reasonable this was the intent. There is another thread on this specific topic though if you want to read about counter arguments.\n\nAgainst the Watcher - Optional engagement only occurs during the encounter step of the round, Son or Arnor is able to engage the Watcher even if another tentacle is in play. Also, OEG is legal to use on the Watcher after he attacks since he is not immune to player card effects. Your threat would go up to 48 by using this though so make sure you have the 5 required progress or you might lose quickly!"}]}