{"url":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/","title":"We Must Away, Ere Break of Day objective question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/?do=findComment&comment=676429","commentId":676429,"userName":"Shockeffect","timestamp":1345343508,"content":"Both the troll key and troll purse say to attach to a troll in play, and the troll then has to be killed in order to claim it.  If no troll is in play, would this then just be discarded and you have to cycle back through the discard pile to get it?\n\n \n\nTroll Purse/Troll Key\n\nIf Troll Purse/Troll Key is discarded, resolve its \"when revealed\" effect, if able.\n\nWhen Revealed: Attach to a Troll Enemy\n\nResponse: After attached troll enemy is destroyed, the first player may spend 1 baggins resource to claim this objective and attach it to bilbo baggins.\n\n \n\nMy first guess is yes it gets discarded but was just curious what other peoples thoughts are on this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/?do=findComment&comment=676913","commentId":676913,"userName":"starhawk77","timestamp":1345406136,"content":"I haven't seen the cards myself, but your interpretation appears correct. If there are no Troll enemies in play, the objective will simply be discarded. This situation obviously makes it impossible to trigger the \"If ____ is discarded…\" effect. \n\nSo, you'll have to cycle back through the encounter deck unless you have a card like Shadow of the Past (which will give you a slightly better chance to obtain the objective, but won't solve your problems entirely). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/?do=findComment&comment=676946","commentId":676946,"userName":"starhawk77","timestamp":1345409890,"content":"Scratch that last. I completely ignored the fact that Troll Key is an objective (even though I actually wrote \"objective,\" it somehow didn't register…). When revealed, it should just sit in play if there are no legal targets. Treacheries are generally the only encounter cards that are discarded immediately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/?do=findComment&comment=676949","commentId":676949,"userName":"Shockeffect","timestamp":1345411191,"content":"The only thing that bothers me about that interpretation is that both objectives say: \n\nResponse: After attached troll enemy takes damage as the result of an attack, the first player may exhaust bilbo(troll key) or pay 1 baggins resource (troll purse) to claim the objective attached.  So it is kinda weird wordings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/?do=findComment&comment=676967","commentId":676967,"userName":"hildargo","timestamp":1345413060,"content":"The next time I play the quest, I will just house rule it, and add the Purse and Key to the encounter deck after the Trolls are added to the staging area. Seems to make the most sense to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/?do=findComment&comment=677531","commentId":677531,"userName":"Bullroarer Took","timestamp":1345472813,"content":" I have played it so that the Troll Key and Purse are not added to the deck until card 2, but there is a good chance you won't see them if you do that.  I really wish FFG had made this a bit more clear.\n\n \n\nI've also played it so the cards just lay in the staging area if no troll is in play, and then claim them after a troll is defeated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69407-we-must-away-ere-break-of-day-objective-question/?do=findComment&comment=677543","commentId":677543,"userName":"Shockeffect","timestamp":1345473701,"content":"yeah it really is ambiguous.  Well i think my buddies and i are going to just say they get discarded until we hear more from FFG.  Hopefully soon!"}]}