{"url":"https://community.fantasyflightgames.com/topic/69456-eagles-of-the-misty-mountains-attachments/","title":"Eagles of the misty mountains - attachments","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69456-eagles-of-the-misty-mountains-attachments/?do=findComment&comment=676988","commentId":676988,"userName":"GrandSpleen","timestamp":1345415426,"content":"Hi all,\n\nWhen an Eagle ally leaves play, that card may be attached facedown to the Eagles of the Misty Mountains, givign the EoMM +1 to attack and defense.\n\nIf a card effect instructs you to choose and discard one attachment you control, do these facedown Eagles qualify as an attachment the same as any other? \n\nThanks!\nGS"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69456-eagles-of-the-misty-mountains-attachments/?do=findComment&comment=677103","commentId":677103,"userName":"Angus Lee","timestamp":1345430627,"content":"As per the official FAQ, (1.23) Attachments: \"Any card that attaches to another card is treated as an Attachment in addition to its other card types.\"\n\nSo I'd say yes in this case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69456-eagles-of-the-misty-mountains-attachments/?do=findComment&comment=677132","commentId":677132,"userName":"starhawk77","timestamp":1345432588,"content":"They are certainly attachments for purposes of card effects that reference \"attachments\" in general (e.g., Black Uruks, if revealed while EotMM is committed to the quest).\n\nWhether they are \"attachments you control\" is slightly less clear. However, the rule book section on \"Control and Ownership\" (p.25) states that players \"control\" all of the cards they bring to the game unless some other player/encounter effect explicitly takes control of a given card. So, since the EotMM effect does not mention any control change, it seems you will retain control over any Eagle characters that attach to EotMM.\n\nI would, therefore, posit that the facedown cards count as \"attachments you control.\" \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69456-eagles-of-the-misty-mountains-attachments/?do=findComment&comment=677266","commentId":677266,"userName":"GrandSpleen","timestamp":1345450562,"content":" Thanks for the answers guys.\n\nOne related question. When a hero is destroyed, Landroval's ability can be triggered, and Landroval is put back into your hand.  Landroval leaves play; if the player has a copy of EoMM on the table, can he/she choose to attach Landroval to the EoMM instead?  \n\nThe response criteria for EoMM seems to be met (an Eagle card is leaving play), but if you attach Landroval you don't seem to be able to fulfill Landroval's own Response text (which states that Landroval should go back into your hand).  I suppose this would be no different, however, than if the card text had stated \"place Landroval in your discard pile.\"\n\nSince Landroval is a unique card, there isn't much use in having multiple copies of him in your hand except to draw him faster.  This scenario could at least give a possible -- if highly situational -- use that second copy.\n\nThanks again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69456-eagles-of-the-misty-mountains-attachments/?do=findComment&comment=678077","commentId":678077,"userName":"Nerdmeister","timestamp":1345520305,"content":"They payment cost for using Landroval´s ability is to put him into your hand. Once you have payed that cost, there is nothing preventing you from using the response on EotMM to intersect the Landroval card as it is en route to your hand (so to speak), and place him as an attachment"}]}