{"url":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/","title":"Using The Hobbit with Previous Sets","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=679361","commentId":679361,"userName":"Bandoras","timestamp":1345626997,"content":" So, my Hobbit set is on the way and should be here later in the week. I'm curious to see how much of it can be integrated into the regular LotR LCG? I'm particularly interested to see if it's possible to introduce hero Bilbo Baggins and the Baggins Sphere to the existing game? I'm a huge Tolkien fan, particularly the hobbits and their culture and Bilbo is one of my favorite characters in the Middle-earth setting - so I'd love to be able to use the young Burglar in my existing regular games.\n\nIs this possible, or simply wishful thinking?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=679580","commentId":679580,"userName":"starhawk77","timestamp":1345641262,"content":"The rules insert says that Bilbo may only be used when playing the scenarios from the saga expansion. However, there's really nothing stopping you from using him in other games if you so desire (not like FFG is going to police the rule). He won't be able to do a whole lot outside of the Hobbit quests (since his resources have many applications in the saga scenarios but virtually none in other quests), and you do lose if he leaves play, but it might be fun.\n\nSo, while the rules as written forbid you from using Bilbo in any old scenario, it's not going to hurt anyone if you decide to take the Burglar to Rhosgobel or Khazad-dum. Up to you how strictly you want to apply the text in the insert."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=680282","commentId":680282,"userName":"Bandoras","timestamp":1345713234,"content":" That was kind of my concern. I wasn't sure if doing that (using Bilbo outside of the Hobbit Scenarios) would turn him into dead weight. I want to balance fun w/ playability. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=680572","commentId":680572,"userName":"starhawk77","timestamp":1345732940,"content":"Well, there's only one player card (with three copies) that requires Baggins resources, so he wouldn't be particularly useful outside of the special scenarios. However, he is an extra hero in all those special scenarios (i.e., he becomes a fourth \"free\" hero). A free extra character at the start of any game could be very useful, but he would really only be paying for neutral cards and questing/attacking/defending. He is a Hobbit, though, so you could target him with your Good Meals, Fast Hitches, etc. I think it might be plenty fun if you include a few cards like that to give him more stuff to do.\n\nJust keep in mind that you will lose if he ever leaves play, and you won't be able to use the other Bilbo (much like the Arwen objective in this respect).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=696753","commentId":696753,"userName":"JasonRed3","timestamp":1348061667,"content":" Anyone know what the difficulty ratings of the Saga scenarios are?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=696842","commentId":696842,"userName":"richsabre","timestamp":1348069255,"content":"JasonRed3 said:\n\n Anyone know what the difficulty ratings of the Saga scenarios are?\n\n\n\nffg did away with the offical difficult ratings - people will say different but id say\n\n1 = 6\n\n2 = 4\n\n3 = 8\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=696867","commentId":696867,"userName":"JasonRed3","timestamp":1348071781,"content":" Did they announce that they were doing away with the ratings, or did they simply not include them in the saga set?  (which would make sense, since they are designed to be played together)\n\n \n\nJ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=696879","commentId":696879,"userName":"richsabre","timestamp":1348072397,"content":"JasonRed3 said:\n\n Did they announce that they were doing away with the ratings, or did they simply not include them in the saga set?  (which would make sense, since they are designed to be played together)\n\n \n\nJ\n\n\n\ni just think they didnt include them- i didnt hear anything so maybe someone else knows\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69644-using-the-hobbit-with-previous-sets/?do=findComment&comment=699778","commentId":699778,"userName":"Nyarlathotep5150","timestamp":1348511905,"content":"Also, wouldn't Bilbo be jumping from player to player because, \"The first player takes control of Bilbo?\" Or is that just at the start of the game?"}]}