{"url":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/","title":"Hobbit and Heirs:  More of the Same, *Sigh*","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=679761","commentId":679761,"userName":"Runix","timestamp":1345652144,"content":"I will freely admit that I go back and forth on my feelings on this game; and that's probably not a good thing.  I really want to like it, but there are things about it that drive me crazy.\n\nCurrently, the one thing that is driving me crazy:  it seems that recent scenario design is just \"more of the same\".  Threat, nasty treacheries, hard-hitting monsters . . . and more threat, nastier treacheries, and even harder-hitting monsters.\n\nI was hoping for a change in direction with The Hobbit and with Heirs of Numenor, but the previews here for both sets are MOTS:  more threat, nastier treacheries, and even harder-hitting monsters.  The original set had some Doomed and Surge cards; the new sets have even more Doomed and Surge cards.  The original set had nasty never-want-to-ever-see-them treacheries; the new sets have even nastier never-want-to-see-them treacheries.  The original set had 6/3/9 monsters; the new sets have 7+/3+/12+ monsters.  This is supposed to be compelling gameplay . . . how?\n\nOne problem is that this just feeds into the current meta-game of sticking with a very narrowly defined does-it-all strategy that can routinely dispatch most quests with little difficulty, and is only challenged by the most brutal swarm of hard-hitting treacheries and monsters.  Greetings and Gandalf for threat reduction, Test of Will so you never have to worry about another treachery again, and loads of dwarves with axes and armor to finish off the hordes of monsters.  There is little flexibility and little innovation, and frankly, it's boring.\n\nEven worse, it's unthematic.  If you never read Tolkien's original works and your only experience was from the LCG, you would think it was all about bands of dwarves roaming the land hacking apart impossibly tough monsters while occasionally stopping in to rest at the local elf-run tavern.  Subtlety: none, really.  Diplomacy:  none.  Magic:  what magic? Interactions between heroes:  they're all in this together and the best of friends.  Humble people succeeding against impossible odds:  why bother with the hobbits when Gimli and Glorfindel can handle just about anything?\n\nMy complaint is about scenario design, but now that I think about it, it may simply be that the deeper game design is flawed.  They do not have a solution, for one thing, for power creep.  Hence the need for more threat, more nasty treacheries, and harder-hitting monsters.  This is a problem the designers should have seen coming a long way off, but they made no considerations for it in the game design.  (Why not just leave the power creep in place and consider it part of the game?  Because the nastier the encounter decks get, the more of a chance there is that the player will lose simply by virtue of what is drawn out of the deck in the first few turns.  Since the player's power scales up slowly over time, but the encounter deck can hit the ground running - particularly with Doomed and Surge - the more difficult the scenarios are, the greater a factor luck plays, which is a bad thing.)\n\nThe other problem is that the designers gave themselves relatively few tools to work with - locations, monsters, and treacheries aren't that much when you come to think of it.  You travel, fight, and reduce threat, and that's about it.  And what's worse, the mechanics on many of the cards are very straightforward:  place progress tokens, do damage, reduce threat, cancel a \"when revealed\" card.  The game has nowhere near the complexity of interaction of mechanics that Call of Cthulhu has, let alone Android:  Netrunner, where cards interact in interesting ways, which encourage the development of deep strategies.  And the encounter decks are worse than the player's decks; there is little to no interaction between cards in the encounter decks, so all the designers can do is just turn it up to \"11\".\n\nI will give the designers credit for attempting to strike out in a new direction with Secrecy.  But that seems to have gone nowhere, as most players simply ignored it, and so it's back to the standard approach.  That's unfortunate.  I'll keep watching this game, but right now it just isn't a temptation to get the more recent releases, when they're just Mirkwood with Doomed and Surge and more hit points."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=679777","commentId":679777,"userName":"Dain Ironfoot","timestamp":1345652811,"content":"Runix said:\n\n \n\nplace progress tokens, do damage, reduce threat, cancel a \"when revealed\" card.\n\n \n\n \n\nexcept this isn't quite true. Battle of Laketown has you trying to accomplish the quest before laketown burns down, and Smaug is the only monster in the set. You have the choice of *not* placing progress on the quest, but instead, removing damage from laketown.\n\nfrom what we see from HoN, the enemies now attack locations, which is totally different that what we've seen before.\n\nin The Hobbit, whatever progress you make isn't actually just placing progress, it's discarding cards from the encounter deck (the sun is coming up/night is ending, to speak in thematic terms). Riddles are another cool twist on the treachery cards.\n\non top of that, many current and upcoming enemies have different stats/abilities when other cards are in play, again, pointing to the fact that the encounter deck does interact with itself, as much as a random, non-human controlled deck can do.\n\ni don't disagree with some of your larger points, but you are completely missing/ignoring the (what i consider drastic) changes in quest mechanics we have coming up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=679801","commentId":679801,"userName":"richsabre","timestamp":1345654521,"content":"Dain Ironfoot said:\n\nRunix said:\n\n \n\nplace progress tokens, do damage, reduce threat, cancel a \"when revealed\" card.\n\n \n\n \n\nexcept this isn't quite true. Battle of Laketown has you trying to accomplish the quest before laketown burns down, and Smaug is the only monster in the set. You have the choice of *not* placing progress on the quest, but instead, removing damage from laketown.\n\nfrom what we see from HoN, the enemies now attack locations, which is totally different that what we've seen before.\n\nin The Hobbit, whatever progress you make isn't actually just placing progress, it's discarding cards from the encounter deck (the sun is coming up/night is ending, to speak in thematic terms). Riddles are another cool twist on the treachery cards.\n\non top of that, many current and upcoming enemies have different stats/abilities when other cards are in play, again, pointing to the fact that the encounter deck does interact with itself, as much as a random, non-human controlled deck can do.\n\ni don't disagree with some of your larger points, but you are completely missing/ignoring the (what i consider drastic) changes in quest mechanics we have coming up.\n\n\n\ni agree completely with this….id also like to add that i find the theme excellent….and im not exactly easy to please.\n\nstill more interactive mechanics are never a bad thing, and i certainly wouldnt mind seeing a few better card effects, but as shown in the previews, i think hiers of numenor is the exact cycle that you are looking for\n\nalso id like to add there is a new method for making old quests more difficult- im not sure if anyone has any more info on that\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=679815","commentId":679815,"userName":"monkeyrama","timestamp":1345655353,"content":" I do sympathize very much with the OP's point about the way in which some features of some scenarios are just ramped up versions of old ones, and this has been frustrating at times.\n\nNonetheless, I've found the most recent cycle to have developed some more skillful uses of the scenario cards - which in the first cycle didn't do too much - to really interact with the player decks and hands. For instance, I think in Foundation of Stone, or maybe the Long Dark (I've not been playing enough recently) there was a quest card limiting questing by allies to no more than the heroes committed. As a mechanic I also really liked what FFG tried with the Long Dark and the lost effects, even if it didn't quite work out perfectly: it seemed to me that they were trying to create a feeling of gradual, crushing despair by sucking away your hand.\n\nIt's still a young game though. CoC's been around a while, and Netrunner has pedigree from before, and I feel like FFG are gradually getting a feel for how to interact with players more subtly than just whacking us with threat and damage. Which, when they regress to doing that, I totally agree is irritating and simplistic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=679965","commentId":679965,"userName":"Runix","timestamp":1345672193,"content":"Dain Ironfoot said:\n\nexcept this isn't quite true. Battle of Laketown has you trying to accomplish the quest before laketown burns down, and Smaug is the only monster in the set. You have the choice of *not* placing progress on the quest, but instead, removing damage from laketown.\n\nfrom what we see from HoN, the enemies now attack locations, which is totally different that what we've seen before.\n\nin The Hobbit, whatever progress you make isn't actually just placing progress, it's discarding cards from the encounter deck (the sun is coming up/night is ending, to speak in thematic terms). Riddles are another cool twist on the treachery cards.\n\non top of that, many current and upcoming enemies have different stats/abilities when other cards are in play, again, pointing to the fact that the encounter deck does interact with itself, as much as a random, non-human controlled deck can do.\n\ni don't disagree with some of your larger points, but you are completely missing/ignoring the (what i consider drastic) changes in quest mechanics we have coming up.\n\n\n\nI should have qualified what I said a little more.  The designers have been building more variety into the scenarios, although it does feel like very slow progress, and the system doesn't really seem to be built to do more than the default locations/encounters/fighting, so some of the mechanics feel a bit awkward.  But I should recognize that they are trying to shake things up a bit, at least on the encounter deck side.\n\nBut that still leaves the player side of the problem.  And it is a problem.  Whatever's in the encounter deck, the players are using the same tools, and not even in creative ways.  The designers may put some interesting and surprising treacheries in the deck, but it doesn't really matter when all the player does is swat it away with A Test of Will.  The encounter deck may add threat in clever ways, but it doesn't matter, because the player will just Greeting it all away.  The encounter may do clever things with monsters, but it doesn't matter, because the player will just tank-and-spank them (when the player is not Forest Snare-ing-and-sniping them).  The encounter deck may lay on some direct damage, but the player will just use the Daughter to heal it all away.  Whatever the encounter deck does, it's the same solution from the player side.  The only question is the balance of the deck:  how much of questing vs attack/defense vs threat reduction vs encounter deck control.  That's it.\n\nMoving away from that would involve a major change in game design philosophy - specifically, reducing the power of a lot of the most common player cards, and changing mechanics to be more interactive, rather than \"have a specific problem? here's the one card to play that will fix it\" that the current design features.  (As an aside, I'm just amazed that the card set doesn't have something that moves monsters directly from the staging area to the discard pile - it already has one-card-solutions for locations and treacheries.)  One thing that would really help the design out would be player cards that can be used in multiple ways, albeit with significant limitations on their power, thus building more flexibility for deck-building.  Toning down the power of the player decks - while retaining some flexibility - would also provide a good excuse to tone down the quests, away from the current \"whoops, looks like you drew a series of Surge and Doom cards followed by a Troll on turn 1, may as well shuffle and restart\" situation.\n\nI'm more and more inclined to think that getting the game to where I think it should be would involve a full reset, but obviously that's not going to happen.  Gathering up all the copies of A Test of Will, The Galadhrim's Greetings, Steward of Gondor, and Zigil Miner, and burning them - and then rebalancing all the quests based on the fact that they are no longer beatable without those cards available - would be a good start, but again, that's not going to happen.\n\nAnyway, I'm just complaining, and that's not productive, so I'll quit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=679991","commentId":679991,"userName":"Glaurung","timestamp":1345674939,"content":"Runix said:\n\nDain Ironfoot said:\n\n \n\nexcept this isn't quite true. Battle of Laketown has you trying to accomplish the quest before laketown burns down, and Smaug is the only monster in the set. You have the choice of *not* placing progress on the quest, but instead, removing damage from laketown.\n\nfrom what we see from HoN, the enemies now attack locations, which is totally different that what we've seen before.\n\nin The Hobbit, whatever progress you make isn't actually just placing progress, it's discarding cards from the encounter deck (the sun is coming up/night is ending, to speak in thematic terms). Riddles are another cool twist on the treachery cards.\n\non top of that, many current and upcoming enemies have different stats/abilities when other cards are in play, again, pointing to the fact that the encounter deck does interact with itself, as much as a random, non-human controlled deck can do.\n\ni don't disagree with some of your larger points, but you are completely missing/ignoring the (what i consider drastic) changes in quest mechanics we have coming up.\n\n \n\n \n\nI should have qualified what I said a little more.  The designers have been building more variety into the scenarios, although it does feel like very slow progress, and the system doesn't really seem to be built to do more than the default locations/encounters/fighting, so some of the mechanics feel a bit awkward.  But I should recognize that they are trying to shake things up a bit, at least on the encounter deck side.\n\nBut that still leaves the player side of the problem.  And it is a problem.  Whatever's in the encounter deck, the players are using the same tools, and not even in creative ways.  The designers may put some interesting and surprising treacheries in the deck, but it doesn't really matter when all the player does is swat it away with A Test of Will.  The encounter deck may add threat in clever ways, but it doesn't matter, because the player will just Greeting it all away.  The encounter may do clever things with monsters, but it doesn't matter, because the player will just tank-and-spank them (when the player is not Forest Snare-ing-and-sniping them).  The encounter deck may lay on some direct damage, but the player will just use the Daughter to heal it all away.  Whatever the encounter deck does, it's the same solution from the player side.  The only question is the balance of the deck:  how much of questing vs attack/defense vs threat reduction vs encounter deck control.  That's it.\n\nMoving away from that would involve a major change in game design philosophy - specifically, reducing the power of a lot of the most common player cards, and changing mechanics to be more interactive, rather than \"have a specific problem? here's the one card to play that will fix it\" that the current design features.  (As an aside, I'm just amazed that the card set doesn't have something that moves monsters directly from the staging area to the discard pile - it already has one-card-solutions for locations and treacheries.)  One thing that would really help the design out would be player cards that can be used in multiple ways, albeit with significant limitations on their power, thus building more flexibility for deck-building.  Toning down the power of the player decks - while retaining some flexibility - would also provide a good excuse to tone down the quests, away from the current \"whoops, looks like you drew a series of Surge and Doom cards followed by a Troll on turn 1, may as well shuffle and restart\" situation.\n\nI'm more and more inclined to think that getting the game to where I think it should be would involve a full reset, but obviously that's not going to happen.  Gathering up all the copies of A Test of Will, The Galadhrim's Greetings, Steward of Gondor, and Zigil Miner, and burning them - and then rebalancing all the quests based on the fact that they are no longer beatable without those cards available - would be a good start, but again, that's not going to happen.\n\nAnyway, I'm just complaining, and that's not productive, so I'll quit.\n\n\n\nAgree with many things with you. The game is really unbalanced and force players use the same cards all the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680022","commentId":680022,"userName":"Shockeffect","timestamp":1345678231,"content":"Im probably not going to be well liked for this comment, but here we go.\n\nA lot of people with every game, be it a computer game, board game, or card game, are NEVER happy.  For FFG this game is, and hopefully always will be a huge work in progress.  They have to continually try new things, or revamped old things to see how the player base reacts.  With most good games, this takes some time, and its only from the supporting players that they get the ability to improve the game.  There will always be things that are out of balance.  Take a look at MTG's fan base, that game has been going on for a very long time, and to this day people are always unhappy about it.\n\nNow to help the game designers, constructive feedback is required.  Not continuous complaining or just saying \"this is bad, that is bad.\"  Numerous things in the OP's original post were directed at things he has not even played yet, one of which is not even out yet. \n\nWhile im not saying that this game is perfect, look back to the core set and the shadows of mirkwood cycle and compare them to the dwarrowdelf cycle and the hobbit saga.  There are DRASTIC changes that ffg has brought in to make things more difficult, new card options, and truly some very creative and interesting combos.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680040","commentId":680040,"userName":"freteval","timestamp":1345681608,"content":" Bonjour,\n\nJe suis français et je lis souvent vos posts car comme chez vous, le jeu marche très fort en France!!!\n\nComme vous, je trouve le jeu magnifique, de plus en plus immersif et de mieux en mieux construit.\n\nC'est vrai que nous sommes dans une mécanique toujours identique mais je vois chez FFG des changements intéressants :\n\n- les cartes \"trésor\" pour l'extension Hobbits\n\n- la nouvelle extension \"Les héritiers de Numénor\" introduit beaucoup de nouvelles choses (combat, menace, ennemis…) et nous attendons comme vous des visuels de cette extension pour découvrir les mécaniques proposées.\n\n- La bataille de la ville du lac propose un challenge incroyable contre un ennemi unique.\n\n \n\nLe jeu n'est pas non plus le même que l'on joue seul ou à plusieurs.\n\nNous pouvons aussi personnifier le jeu. Rien n'empêche de jouer chaque cycle en mode cauchemar, de prendre 8/9 héros pour réaliser le cycle complet, de supprimer des cartes inimaginables dans le royaume de cavenain (les aigles dans la moria? , asfaloth dans la moria? …) , de placer grâce aux nouveaux protège-cartes des attachements importants dans le deck de rencontre et de leur attacher une carte rencontre quand ils sont révélés et de pouvoir les utiliser à la prochaine quête que si on a réussi celle-ci…de n'utiliser qu'en carte unique des cartes importantes que presque tous les joueurs choisissent à chaque quête.  On peut créer et imaginer plein de choses pour corser la difficulté ou rendre le jeu plus attrayant encore pour soi-même.\n\nJe remercie FFG d'avoir créé ce jeu magnifique et j'espère sincèrement qu'il va continuer et nous surprendre encore très longtemps.\n\nEnfin je remercie la communauté américaine car c'est souvent très intéressant de lire vos commentaires et opinions (Richsabre, Glaurung, Dain Ironfoot, et plein d'autres…) sur un jeu que nous pratiquons ensemble mais si loin les uns des autres.\n\nBon jeu à vous et au plaisir de vous lire encore sur vos forums.\n\nMinipoulet"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680045","commentId":680045,"userName":"Dain Ironfoot","timestamp":1345682112,"content":"Runix said:\n\nDain Ironfoot said:\n\n \n\nexcept this isn't quite true. Battle of Laketown has you trying to accomplish the quest before laketown burns down, and Smaug is the only monster in the set. You have the choice of *not* placing progress on the quest, but instead, removing damage from laketown.\n\nfrom what we see from HoN, the enemies now attack locations, which is totally different that what we've seen before.\n\nin The Hobbit, whatever progress you make isn't actually just placing progress, it's discarding cards from the encounter deck (the sun is coming up/night is ending, to speak in thematic terms). Riddles are another cool twist on the treachery cards.\n\non top of that, many current and upcoming enemies have different stats/abilities when other cards are in play, again, pointing to the fact that the encounter deck does interact with itself, as much as a random, non-human controlled deck can do.\n\ni don't disagree with some of your larger points, but you are completely missing/ignoring the (what i consider drastic) changes in quest mechanics we have coming up.\n\n \n\n \n\nI should have qualified what I said a little more.  The designers have been building more variety into the scenarios, although it does feel like very slow progress, and the system doesn't really seem to be built to do more than the default locations/encounters/fighting, so some of the mechanics feel a bit awkward.  But I should recognize that they are trying to shake things up a bit, at least on the encounter deck side.\n\nBut that still leaves the player side of the problem.  And it is a problem.  Whatever's in the encounter deck, the players are using the same tools, and not even in creative ways.  The designers may put some interesting and surprising treacheries in the deck, but it doesn't really matter when all the player does is swat it away with A Test of Will.  The encounter deck may add threat in clever ways, but it doesn't matter, because the player will just Greeting it all away.  The encounter may do clever things with monsters, but it doesn't matter, because the player will just tank-and-spank them (when the player is not Forest Snare-ing-and-sniping them).  The encounter deck may lay on some direct damage, but the player will just use the Daughter to heal it all away.  Whatever the encounter deck does, it's the same solution from the player side.  The only question is the balance of the deck:  how much of questing vs attack/defense vs threat reduction vs encounter deck control.  That's it.\n\nMoving away from that would involve a major change in game design philosophy - specifically, reducing the power of a lot of the most common player cards, and changing mechanics to be more interactive, rather than \"have a specific problem? here's the one card to play that will fix it\" that the current design features.  (As an aside, I'm just amazed that the card set doesn't have something that moves monsters directly from the staging area to the discard pile - it already has one-card-solutions for locations and treacheries.)  One thing that would really help the design out would be player cards that can be used in multiple ways, albeit with significant limitations on their power, thus building more flexibility for deck-building.  Toning down the power of the player decks - while retaining some flexibility - would also provide a good excuse to tone down the quests, away from the current \"whoops, looks like you drew a series of Surge and Doom cards followed by a Troll on turn 1, may as well shuffle and restart\" situation.\n\nI'm more and more inclined to think that getting the game to where I think it should be would involve a full reset, but obviously that's not going to happen.  Gathering up all the copies of A Test of Will, The Galadhrim's Greetings, Steward of Gondor, and Zigil Miner, and burning them - and then rebalancing all the quests based on the fact that they are no longer beatable without those cards available - would be a good start, but again, that's not going to happen.\n\nAnyway, I'm just complaining, and that's not productive, so I'll quit.\n\n\n\ni get what you're saying, and as i've said on other threads, i think developing a co-op game must be 100x harder than a PvP game to keep it fresh and interesting.\n\nwith that said…i still don't entirely agree.\n\nwe have more and more enemies that can't have attachments. more and more treacheries that can't be canceled. we have enemies that can only be attacked by 1 hero or ally or can't take more than X amount of damage per turn. so, for each of your complaints, the designers are addressing these issues\n\nto be fair though, one could also argue that those powerful player cards should have a higher cost or never have been made.\n\nand at the end of the day (while i sometimes hate this line of reasoning…) just don't play with the cards you find overpowered. i've never played with frodo, or glorindel, or Loreagorn, and don't intended to, it's just not my play style. i don't play with a test of will, again, not my play style. and i still manage to win. in fact, i rarely, if ever, put cards in my deck that interact with the encounter deck, at all. i take what i get and hope to recover. and it usually works.\n\ni think we all share your sentiment to some degree -- i just don't think you are giving them enough credit. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680074","commentId":680074,"userName":"Glaurung","timestamp":1345686237,"content":"In my opinion complain is good. Cose they make people start to think- what is wrong?\n\nI complain about Beravur and Protector of Lorien from the start(more then 1 year)and errata is here finally. But a problem is designers should to see them self cards like Beravur or Protector of Lorien is crazy powerful and from the beginning make them less powerful. Remember Stand and Fight errata??? So if you look on the way how the designers take care the game you will see there is no certain plan. They play on the way change the rules and so on. And is not small mistakes, there is some Foundation mistakes was done from beginning. I still think we will come to some hand limit in the end. And cards like will of the west should be ban too.\n\nAnd if Gandalf will have errata like : effect apply only when you play him from hand, the sneak attack start to be useless and we will see much more interesting decks around.But then is to much erratas(some players dont happy with that) so designers should be more careful from the beginning. This is they job!\n\nAlso important think: I play this game a lot. And one thing is missing in encounter deck. Encounter deck most of the time doesn react on players power. I mean how many allies or attachments players have a the moment in play and so on. Some cards do yes, but is too few of them. If you play 2 players game and both players have already about 5 or 6 allies under each player control 90% you win the game. Cose encounter deck cannot do nothing at this moment. But if threachery and enemies will get bonuses depend on how many allies and attachments or even resources in play will be much better. Yes there is some cards but so few of them. Example: deal 1 damage to each ally in play, 2 damage instead if you can see 5 allies and get surge.\n\nAlso can be good idea to revealed 1 card per players +1 card for quest stage. So in the first stage 0, on the second+1, on the third+2 and so on.\n\nTravel. Travel is important pat of the adventure. In MMCCG it was really cool phase really make you feel like you travel and so on. Here travel phase is nothing. I  think designers can improve the travel idea and make it more exiting. And also locations can have some automatic attack when you travel there(this was cool in MMCCG). Also i think will be more interesting if is no possible explore location in the staging area. You must go there to explore!!! This also make a travel phase more interesting. Now with card like Asfaloth, Northern Tracker and other cards who really cares to travel somewhere???? In my opinion s wrong and destroy all location-travel idea.\n\nAnyway game is going better now is for sure but it can be done much more quickly. In my opinion FFG very slowly here.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680088","commentId":680088,"userName":"Dain Ironfoot","timestamp":1345688152,"content":"Also important think: I play this game a lot. And one thing is missing in encounter deck. Encounter deck most of the time doesn react on players power. I mean how many allies or attachments players have a the moment in play and so on. Some cards do yes, but is too few of them. If you play 2 players game and both players have already about 5 or 6 allies under each player control 90% you win the game. Cose encounter deck cannot do nothing at this moment. But if threachery and enemies will get bonuses depend on how many allies and attachments or even resources in play will be much better. Yes there is some cards but so few of them. Example: deal 1 damage to each ally in play, 2 damage instead if you can see 5 allies and get surge.\n\nAlso can be good idea to revealed 1 card per players +1 card for quest stage. So in the first stage 0, on the second+1, on the third+2 and so on.\n\n______\n\ni love both of these ideas! and you are right, they are starting to get there…and i bet will only start to see more of this kind of thing in the future!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680164","commentId":680164,"userName":"richsabre","timestamp":1345701355,"content":"@glaurung- i like the first of those ideas Dain quoted from you, however the second needs more thought depending on the quest….stages dont always progress difficulty wise in a linear way, so having a fixed +1 +2 +3 etc could end up screwing a good quest. but i see the point you're making - quests do need more interaction that flows with the way you play\n\nalso about banning cards- yes some need errated, but if ffg actually banned a card, id be pretty annoyed…..its just a complete waste of money when there are much more productive ways to change them….take sneak attack for instance…if you only let G.s effect be played from hand its pretty much a crap useless card, which is basically what zigil has become (well some people have found uses for him i guess)- and thats a shame, given that ive had so many good, fun games using that card…..to just burn it on the fire\n\nno what they need to do is what you say- get it right the first time!!! (easier said than done right?)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680170","commentId":680170,"userName":"Glaurung","timestamp":1345701816,"content":"richsabre said:\n\n@glaurung- i like the first of those ideas Dain quoted from you, however the second needs more thought depending on the quest….stages dont always progress difficulty wise in a linear way, so having a fixed +1 +2 +3 etc could end up screwing a good quest.\n\nalso about banning cards- yes some need errated, but if ffg actually banned a card, id be pretty annoyed…..its just a complete waste of money when there are much more productive ways to change them….take sneak attack for instance…if you only let G.s effect be played from hand its pretty much a crap useless card, which is basically what zigil has become- and thats a shame\n\nrich\n\n\n\nyes sure if you will make system where you must add more encounter cards with quest stage progress  it will change everything.\n\nAbout sneak attack errata: yes you right card will be pointess but  in my opinion is small cost for improve the game balance.\n\nAnyway we talking about some special rules for expert players so novice players can still use card as they want.\n\nWill see what happen. I heard soon we will get a Game kit and there will be some cool powerful encounter cards which we can add in previous scenarios to make it more challenge and interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680172","commentId":680172,"userName":"richsabre","timestamp":1345701998,"content":"true- FFG needs to tailor to all levels of play, im in the nice sweet spot of finding new quests just about right (though a little on the easy side for a few, one or two are far too easy)….and i really hope these new encounter cards sort this out so players can tweak the dff. rating\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680185","commentId":680185,"userName":"starhawk77","timestamp":1345703540,"content":"Not to be confrontational, but has the OP actually played the scenarios from the Hobbit box? I have, and I can attest that there are some very innovative encounter mechanics that may (or may not) muck with established strategies. The first quest features a deck of troll sacks that attach to your characters via various card effects. You can't cancel them, and they can only be removed via an interaction between Bilbo and a few particular encounter cards. Want to use Gandalf/Sneak Attack to take out the three monstrous trolls before they engage you? Can't--one of them prevents all damage to Troll enemies in the staging area. A team attack with six characters? Nope--Tom ensures that Troll enemies may only be attacked by one character at a time. Add in the various shenanigans with Baggins resources and you get a quest that forces you to think outside the box.\n\nAnd that's just the first scenario.\n\nThe second quest uses two separate encounter decks, while the third forces you to answer \"riddles\" with Bilbo in order to progress to the final stage. Particularly in that final scenario, most of the normal deck staples are decidedly less meaningful; if you aren't giving Gollum correct responses, Bilbo will die (and you will lose) whether or not you have your Steward and your Test of Will. If those mechanics don't sound interesting and challenging enough, then I don't really know what else might convince the OP. The essential tasks--questing, defending, and fighting--are all still present (because, well, that's the heart of the game design), but there's a bunch of flavorful, dynamic tweaks to that basic formula.\n\nMore generally, I would caution against passing judgments based on a few preview cards. I did it myself after watching the Star Wars LCG demo, but I'm actually more enthusiastic about that game after having surveyed a more extensive collection of images. You never really know whether there's anything truly fresh and innovative until you actually sit down and examine how all the cards in a boxed set/AP interact with one another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680216","commentId":680216,"userName":"John85","timestamp":1345708819,"content":"minipoulet said:\n\n Bonjour,\n\n…\n\n- les cartes \"trésor\" pour l'extension Hobbits\n\n- la nouvelle extension \"Les héritiers de Numénor\" introduit beaucoup de nouvelles choses (combat, menace, ennemis…) et nous attendons comme vous des visuels de cette extension pour découvrir les mécaniques proposées.\n\n- La bataille de la ville du lac propose un challenge incroyable contre un ennemi unique.\n\nLe jeu n'est pas non plus le même que l'on joue seul ou à plusieurs.\n\nNous pouvons aussi personnifier le jeu. Rien n'empêche de jouer chaque cycle en mode cauchemar, de prendre 8/9 héros pour réaliser le cycle complet, de supprimer des cartes inimaginables dans le royaume de cavenain (les aigles dans la moria? , asfaloth dans la moria? …)\n\n…\n\nMinipoulet\n\n\n\nGreat comments Minipoulet! I agree that then new treasure cards, HoN, and BoLT certainly look interesting. I also like your idea of suppressing cards to add to variety (as you suggest, no Asfaloth in Moria,no eagles in Moria, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680220","commentId":680220,"userName":"Pericles","timestamp":1345709305,"content":"minipoulet said:\n\n Bonjour,\n\nJe suis français et je lis souvent vos posts car comme chez vous, le jeu marche très fort en France!!!\n\nComme vous, je trouve le jeu magnifique, de plus en plus immersif et de mieux en mieux construit.\n\nC'est vrai que nous sommes dans une mécanique toujours identique mais je vois chez FFG des changements intéressants :\n\n- les cartes \"trésor\" pour l'extension Hobbits\n\n- la nouvelle extension \"Les héritiers de Numénor\" introduit beaucoup de nouvelles choses (combat, menace, ennemis…) et nous attendons comme vous des visuels de cette extension pour découvrir les mécaniques proposées.\n\n- La bataille de la ville du lac propose un challenge incroyable contre un ennemi unique.\n\n \n\nLe jeu n'est pas non plus le même que l'on joue seul ou à plusieurs.\n\nNous pouvons aussi personnifier le jeu. Rien n'empêche de jouer chaque cycle en mode cauchemar, de prendre 8/9 héros pour réaliser le cycle complet, de supprimer des cartes inimaginables dans le royaume de cavenain (les aigles dans la moria? , asfaloth dans la moria? …) , de placer grâce aux nouveaux protège-cartes des attachements importants dans le deck de rencontre et de leur attacher une carte rencontre quand ils sont révélés et de pouvoir les utiliser à la prochaine quête que si on a réussi celle-ci…de n'utiliser qu'en carte unique des cartes importantes que presque tous les joueurs choisissent à chaque quête.  On peut créer et imaginer plein de choses pour corser la difficulté ou rendre le jeu plus attrayant encore pour soi-même.\n\nJe remercie FFG d'avoir créé ce jeu magnifique et j'espère sincèrement qu'il va continuer et nous surprendre encore très longtemps.\n\nEnfin je remercie la communauté américaine car c'est souvent très intéressant de lire vos commentaires et opinions (Richsabre, Glaurung, Dain Ironfoot, et plein d'autres…) sur un jeu que nous pratiquons ensemble mais si loin les uns des autres.\n\nBon jeu à vous et au plaisir de vous lire encore sur vos forums.\n\nMinipoulet\n\n\n\nBonjour, minipoulet! C'est un plaisir avec une touche internationale sur les forums FFG. :-)\n\n \n\nJe suis d'accord avec vos points ci-dessus, je pense que les concepteurs ont fait un travail remarquable avec le jeu jusqu'à présent, et je suis impatient de les expansions que nous avons à venir plus tard cette année. Je ne doute pas qu'il viendra un moment où le jeu va devenir obsolète, mais je crois que nous sommes loin de ce point.\n\nBon jeu!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680285","commentId":680285,"userName":"TheDukeOfSpades","timestamp":1345713382,"content":" First of I love this game. I love it because it feels unique compared to most other games. I won't lie I'm super biased towards coop. But I disagree with the OP. And I really hate the sentiment \"They should have got it right from the start!\" Game development is hard and I think they core set by itself is a great game and a great start.\n\nI do think the OP has some legit complaints and I would love to get some more feedback from him (it feels like part of this was a 'let it all out' rant):\n\n\"The Hobbit and with Heirs of Numenor, but the previews here for both sets are MOTS\"\nWhat scenarios have you played?\n\n\"feeds into the current meta-game of sticking with a very narrowly defined does-it-all\"\n\nHave you tried not playing that way? I think part of the brilliance of LotrLCG is you can play it as you want. It sounds like you are approaching it from the hardcore uber deck side. I don't know a card game that doesn't evetually fall into the \"The One Deck\" mode if that's how you choose to play it.\n\n\"My complaint is about scenario design … \" \nI'm a bit confused by this paragraph? Are you then talking about power creep in the scenarios? Which I think is the case. Then you talk about leaving it in? Or is that in the voice of the developers?\n\n\"the designers gave themselves relatively few tools to work with\"\nYou seem to be ignoring Objectives outright. I love protecting Arwen, getting random bonuses like rangers and armor, or hunting down keys. Also you seem to be ignoring nuances within some of these. Such as the Counter Spell treachery in Shadows and Flame.\n\n\"Diplomacy: none. Magic: what magic?\"\nDiplomacy? I'd love to see that, but realistically that seems a bit out of scope? Magic? How about Vilya or a Gandalf popping in and kicking butt, seems like a good start, as I recall the stories they weren't that full of constant magic and LotrLCG seems to have a the right amount, but maybe that's me?\n\n\"nowhere near the complexity of interaction of mechanics that Call of Cthulhu has, let alone Android: Netrunner\"\nI'm would be curious of some examples of this that work well in these games as I'm not as familiar with them.\n\n\"you would think it was all about bands of dwarves roaming the land\"\nHaha, I completely agree with this sentiment but we already know that it's being addressed with HoN. Having so many Dwarfy expansions in a row was unfortunate.\n\n\"Whatever's in the encounter deck, the players are using the same tools, and not even in creative ways.\"\nThis sounds more like a player problem than a game one. They don't require you to use the same things. And they've come out with some good alternatives. Why use Snare when you can use Out of the Wild? Why use Galahdrims when you can use Elrond's Counsel? Also it sounds like you are playing solo against harder decks. I will admit solo is a different harder beast that I wish they'd balanced better. Another thing to try is to do a sequence of scenarios so you aren't just building for one. But in most part, is sounds like you are competitive gamer and this may not be the perfect game for you.\n\n\"One thing that would really help the design out would be player cards that can be used in multiple ways\"\nThey are starting to do that. The Tactics cards in Hobbit are an interesting start. I think Lore hast the strongest use cases of this with Gildor and their encounter deck manipulations. Do you have an example of what you'd like to see to address it.\n\nAgain, I love this game, it's not perfect, but none are. I hope I did't assume to much.\n \n\n \n\n\n\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680478","commentId":680478,"userName":"Khaden","timestamp":1345726621,"content":"starhawk77 said:\n\nNot to be confrontational, but has the OP actually played the scenarios from the Hobbit box? I have, and I can attest that there are some very innovative encounter mechanics that may (or may not) muck with established strategies. The first quest features a deck of troll sacks that attach to your characters via various card effects. You can't cancel them, and they can only be removed via an interaction between Bilbo and a few particular encounter cards. Want to use Gandalf/Sneak Attack to take out the three monstrous trolls before they engage you? Can't--one of them prevents all damage to Troll enemies in the staging area. A team attack with six characters? Nope--Tom ensures that Troll enemies may only be attacked by one character at a time. Add in the various shenanigans with Baggins resources and you get a quest that forces you to think outside the box.\n\nAnd that's just the first scenario.\n\nThe second quest uses two separate encounter decks, while the third forces you to answer \"riddles\" with Bilbo in order to progress to the final stage. Particularly in that final scenario, most of the normal deck staples are decidedly less meaningful; if you aren't giving Gollum correct responses, Bilbo will die (and you will lose) whether or not you have your Steward and your Test of Will. If those mechanics don't sound interesting and challenging enough, then I don't really know what else might convince the OP. The essential tasks--questing, defending, and fighting--are all still present (because, well, that's the heart of the game design), but there's a bunch of flavorful, dynamic tweaks to that basic formula.\n\nMore generally, I would caution against passing judgments based on a few preview cards. I did it myself after watching the Star Wars LCG demo, but I'm actually more enthusiastic about that game after having surveyed a more extensive collection of images. You never really know whether there's anything truly fresh and innovative until you actually sit down and examine how all the cards in a boxed set/AP interact with one another.\n\n\n\nGreat points, and you didn't even mention the increased card reveal for the Gollum quest!  (you must reveal double the amount of players in the game during questing, which makes it no walk in the park)  Maybe even challenging enough for Glaurung!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680565","commentId":680565,"userName":"mr.thomasschmidt","timestamp":1345732289,"content":"minipoulet said:\n\n Bonjour,\n\nJe suis français et je lis souvent vos posts car comme chez vous, le jeu marche très fort en France!!!\n\nComme vous, je trouve le jeu magnifique, de plus en plus immersif et de mieux en mieux construit.\n\nC'est vrai que nous sommes dans une mécanique toujours identique mais je vois chez FFG des changements intéressants :\n\n- les cartes \"trésor\" pour l'extension Hobbits\n\n- la nouvelle extension \"Les héritiers de Numénor\" introduit beaucoup de nouvelles choses (combat, menace, ennemis…) et nous attendons comme vous des visuels de cette extension pour découvrir les mécaniques proposées.\n\n- La bataille de la ville du lac propose un challenge incroyable contre un ennemi unique.\n\n \n\nLe jeu n'est pas non plus le même que l'on joue seul ou à plusieurs.\n\nNous pouvons aussi personnifier le jeu. Rien n'empêche de jouer chaque cycle en mode cauchemar, de prendre 8/9 héros pour réaliser le cycle complet, de supprimer des cartes inimaginables dans le royaume de cavenain (les aigles dans la moria? , asfaloth dans la moria? …) , de placer grâce aux nouveaux protège-cartes des attachements importants dans le deck de rencontre et de leur attacher une carte rencontre quand ils sont révélés et de pouvoir les utiliser à la prochaine quête que si on a réussi celle-ci…de n'utiliser qu'en carte unique des cartes importantes que presque tous les joueurs choisissent à chaque quête.  On peut créer et imaginer plein de choses pour corser la difficulté ou rendre le jeu plus attrayant encore pour soi-même.\n\nJe remercie FFG d'avoir créé ce jeu magnifique et j'espère sincèrement qu'il va continuer et nous surprendre encore très longtemps.\n\nEnfin je remercie la communauté américaine car c'est souvent très intéressant de lire vos commentaires et opinions (Richsabre, Glaurung, Dain Ironfoot, et plein d'autres…) sur un jeu que nous pratiquons ensemble mais si loin les uns des autres.\n\nBon jeu à vous et au plaisir de vous lire encore sur vos forums.\n\nMinipoulet\n\n\n\nRemember that the majority speaks English here so if you wanna participate, please use English. Either that or maybe start a new thread in french maybe :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680586","commentId":680586,"userName":"John85","timestamp":1345733860,"content":"mr.thomasschmidt said:\n\n \n\nRemember that the majority speaks English here so if you wanna participate, please use English. Either that or maybe start a new thread in french maybe :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nWe can always use Google translate if we want to engage and can't read the language."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680610","commentId":680610,"userName":"Cunir","timestamp":1345735184,"content":"I think the travel phase is probably the weakest phase in the game, because it never really feels like you are travelling anywhere. I hope that they can address that some more and make it better.\n\nI thought they did something really good with \"massing at osgiliath\" when they made it seem like you were actually on one bank of the river, and you couldn't travel to some of the locations until you travelled over to the other bank, at which point you could no longer travel to locations on the original bank. That straight away made it feel like you were actually AT a place, and travelling really meant something. But they don't seem to have followed that idea up since. I hope they go back to it, because it made travelling a lot better"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680738","commentId":680738,"userName":"Runner5","timestamp":1345745778,"content":"TheDukeOfSpades said:\n\n \"Diplomacy: none. Magic: what magic?\"\nDiplomacy? I'd love to see that, but realistically that seems a bit out of scope? Magic? How about Vilya or a Gandalf popping in and kicking butt, seems like a good start, as I recall the stories they weren't that full of constant magic and LotrLCG seems to have a the right amount, but maybe that's me?\n \n\n\n\nI have been thinking about this as well especially the magic part and I thought of a card they could make that is both very thematic and uses magic.\n\nFlaming Pinecone\n\nAttachment\n\nAttach to Gandalf \n\nWhen attacking enemy is a Warg, discard Flaming Pinecone and put attacking enemy in discard pile. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680860","commentId":680860,"userName":"Style75","timestamp":1345756326,"content":"I have to disagree with the OP. I think the basic game mechanics allow for incredible customization of rules to create highly thematic scenarios. In particular, the separation of the encounter deck from the player decks and the role of quest stage cards as rule adjusters allows FFG to really experiment with the encounter deck from scenario to the next, constantly tweaking the rules to create varied scenarios. They can shake things up without having to put out broken and unbalanced players cards (however they still did it with Ziggy, a mistake in my opinion). The problem is that FFG has barely scratched the surface of what this game is capable of. They've been advancing the game very, very slowly but I suspect that is going to change after the Hobbit saga sets are done.\n\nI suspect we'll see some really new and exciting game mechanics in the Gondor expansion. The Core Set and the Mirkwood cycle had to establish a baseline of gameplay, get the basics of scenario design and put out a stable of standard player cards. Then we saw some slightly more innovative mechanics in the Moria and Dwarrodelf sets. In particular I'm thinking of how the Cave Torch cards interacted with many locations and events to create a theme of risk/reward in the dark. I thought this was really well done throughout the Khazad-dum set. In the Dwarrowdelf set we saw the Watcher in the Water which was our first super-boss monster and the interesting (albeit kinda hokey) attempt to model the Gates of Durin. Foundation of Stone really broke the mold and did a fantastic job of pushing the mechanics in new directions. From the reviews I've read, the first Hobbit saga also mixes things up.\n\nI'll admit they've been pretty slow to mix things up, but I think FFG now has a really good idea of what the basic rule set can do and how they can push it to make the game do many different things. I'm really interested in seeing how they handle sieges as I've developed my own custom scenario for Helm's Deep that attempts to model how a siege works.\n\nThe biggest problem they're going to run into is that it's hard to release really innovative player cards without creating dangerous synergies somewhere down the road. But this is not different from any other CCG, which really only have player decks to worry about. For LotR:LCG most of the potential innovation is in encounter deck design. I predict that the future of this game will bring really exciting and different encounter decks, but a very predictable progression of player cards with abilities similar to what you would see in any other CCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680911","commentId":680911,"userName":"Thorongil","timestamp":1345762490,"content":"Runix said:\n\nDain Ironfoot said:\n\n \n\nI'm more and more inclined to think that getting the game to where I think it should be would involve a full reset, but obviously that's not going to happen.  Gathering up all the copies of A Test of Will, The Galadhrim's Greetings, Steward of Gondor, and Zigil Miner, and burning them - and then rebalancing all the quests based on the fact that they are no longer beatable without those cards available - would be a good start, but again, that's not going to happen.\n\n\n\nI've been interested in a lot of the comments on this thread. I've played a lot of CCGs and FFG's LCGs, and LotR stands alone as the only cooperative/solo game I've played. That makes it an entirely different monster. Some people clearly approach it like they're playing any other competitive CCG and applying the same mentality. Others clearly approach it more like a thematic experience, perhaps in the vein of a boardgame. Neither is inherently \"right\" or \"wrong.\" And, of course, there's a whole spectrum.\n\nSo it's been interesting to see all the (on the whole) very thoughtful comments about the game's power curve (it's undoubtedly been creeping upward in scenario difficulty) and what in the game's foundations encourages that twist.\n\nHowever, I think it's worth noting that the cards mentioned above are so powerful because of the unique places they hold (or held) in the game. When Steward of Gondor was the only reliable cash machine (Horn of Gondor is great in multiplayer, but weak in solo), it was an auto-include in pretty much every deck. The Zigil Miner may have been broken pre-errata, but it opened up a whole new deck type (a pretty cool and fun one, too… maybe it made the game too easy and limited design space, but it clearly ended the train of thought that dictated every deck have a Steward of Gondor). I've said it before in another thread, and I'll say it again: A Test of Will is the game's most powerful and most important card because it's the only card in the game that cancels \"When Revealed\" effects (flat-out cancel versus redraw/exchange). This is not, however, a problem in the foundations of the game. This is a problem with the fact that the card pool doesn't allow other ways around one of the encounter deck's fundamental challenges, the \"When Revealed\" effect. Likewise, Galadhrim's Greetings offers a good deal of power, but is not in and of itself broken or indicative of a fundamental problem. If you're spending your base resources for a turn on lowering your threat, you're not spending anything toward clearing the staging area. This could result in threat building in the staging area and making progress higher. Typically, you work around this and address both issues at once, but a Sneak Attack / Gandalf is a far more useful threat reduction, because it also adds toward clearing the staging area (4 willpower, 4 defense, or 4 attack).\n\nIn other words, there's a big difference between problems in the foundations of the game's mechanics and problems with the game as it exists (with the current card pool). I'd agree with the OP that there are some big problems with the current game and card pool that are being exacerbated by forcing us to rely even more upon the same critical cards (Test of Will), but I'd agree with everyone else who's pointed out that the game's designers have found more innovative ways to use the game's mechanics in interesting ways, pushing the different interactions between card types.\n\nI'm particularly fond of Shadow and Flame for encounter design with the attachments that played on Durin's Bane. Counterspell is one of the nastiest encounter cards we've seen…. but it was a good thing I always played Test of Will when it was revealed ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680956","commentId":680956,"userName":"mr.thomasschmidt","timestamp":1345768485,"content":"John85 said:\n\nmr.thomasschmidt said:\n\n \n\n \n\nRemember that the majority speaks English here so if you wanna participate, please use English. Either that or maybe start a new thread in french maybe :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\nWe can always use Google translate if we want to engage and can't read the language.\n\n\n\nReally? You mean that would really work? Cool! That means we don't have to write in English I this English forum and can just use whatever language? Awesome. Så er der jo faktisk ikke nogen som helst grund til at skrive på engelsk når man bare kan bruge sit modersprog. Så kunne glaurung have undgået en masse ubehagelige poster hvis nogen havde gidet at fortælle ham det. Tak for tippet :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=680990","commentId":680990,"userName":"Glaurung","timestamp":1345775640,"content":"Thorongil said:\n\nRunix said:\n\n \n\nDain Ironfoot said:\n\n \n\nI'm more and more inclined to think that getting the game to where I think it should be would involve a full reset, but obviously that's not going to happen.  Gathering up all the copies of A Test of Will, The Galadhrim's Greetings, Steward of Gondor, and Zigil Miner, and burning them - and then rebalancing all the quests based on the fact that they are no longer beatable without those cards available - would be a good start, but again, that's not going to happen.\n\n \n\n \n\nI've been interested in a lot of the comments on this thread. I've played a lot of CCGs and FFG's LCGs, and LotR stands alone as the only cooperative/solo game I've played. That makes it an entirely different monster. Some people clearly approach it like they're playing any other competitive CCG and applying the same mentality. Others clearly approach it more like a thematic experience, perhaps in the vein of a boardgame. Neither is inherently \"right\" or \"wrong.\" And, of course, there's a whole spectrum.\n\nSo it's been interesting to see all the (on the whole) very thoughtful comments about the game's power curve (it's undoubtedly been creeping upward in scenario difficulty) and what in the game's foundations encourages that twist.\n\nHowever, I think it's worth noting that the cards mentioned above are so powerful because of the unique places they hold (or held) in the game. When Steward of Gondor was the only reliable cash machine (Horn of Gondor is great in multiplayer, but weak in solo), it was an auto-include in pretty much every deck. The Zigil Miner may have been broken pre-errata, but it opened up a whole new deck type (a pretty cool and fun one, too… maybe it made the game too easy and limited design space, but it clearly ended the train of thought that dictated every deck have a Steward of Gondor). I've said it before in another thread, and I'll say it again: A Test of Will is the game's most powerful and most important card because it's the only card in the game that cancels \"When Revealed\" effects (flat-out cancel versus redraw/exchange). This is not, however, a problem in the foundations of the game. This is a problem with the fact that the card pool doesn't allow other ways around one of the encounter deck's fundamental challenges, the \"When Revealed\" effect. Likewise, Galadhrim's Greetings offers a good deal of power, but is not in and of itself broken or indicative of a fundamental problem. If you're spending your base resources for a turn on lowering your threat, you're not spending anything toward clearing the staging area. This could result in threat building in the staging area and making progress higher. Typically, you work around this and address both issues at once, but a Sneak Attack / Gandalf is a far more useful threat reduction, because it also adds toward clearing the staging area (4 willpower, 4 defense, or 4 attack).\n\nIn other words, there's a big difference between problems in the foundations of the game's mechanics and problems with the game as it exists (with the current card pool). I'd agree with the OP that there are some big problems with the current game and card pool that are being exacerbated by forcing us to rely even more upon the same critical cards (Test of Will), but I'd agree with everyone else who's pointed out that the game's designers have found more innovative ways to use the game's mechanics in interesting ways, pushing the different interactions between card types.\n\nI'm particularly fond of Shadow and Flame for encounter design with the attachments that played on Durin's Bane. Counterspell is one of the nastiest encounter cards we've seen…. but it was a good thing I always played Test of Will when it was revealed ;-)\n\n\n\nI agree with you on many points. Always nice to talk and discuss with people who understand the subject. My English is not enough good to express my thought that way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=681403","commentId":681403,"userName":"gokubb","timestamp":1345820675,"content":" I partially agree with the OP. My problem isn't really with the player cards or encounter sets. Thematically, the encounter sets do a great job of really translating the difficulty of their story into a card game. But, I agree that the core of the game is really limited. You need to control threat, cancel encounter cards, heal, and control willpower somehow. Even though the encounters put you in different situations, it really comes down to the same thing and after playing four or five games in a row, the sameness just sinks in. I run decks that purposely don't use Steward of Gondor, Galadhrim's Greetings and Sneak Attack/Gandalf just to make it a challenge. But, as more cards get released, I'm finding even more ways to do the same as these cards. Currently, I'm running a Thorin, Ori, Nori deck that draws itself out every game and reduces threat just by playing more Dwarfs. We Are Not Idle/Lure of Moria combo is all the resource acceleration anything would ever need. The only way to lose is by a first or second turn stomping by the worst treachery cards ever created without a Test of Will (which is the one card they need to find alternates of). \n\nI really enjoy playing the game, but its starting to all feel the same. Rush for enough allies to control the board and then drop threat. After the first two turns, you know if you've won the scenario or not. And, it gets worse with every new player card they make."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=681469","commentId":681469,"userName":"Dain Ironfoot","timestamp":1345826078,"content":"gokubb said:\n\n I partially agree with the OP. My problem isn't really with the player cards or encounter sets. Thematically, the encounter sets do a great job of really translating the difficulty of their story into a card game. But, I agree that the core of the game is really limited. You need to control threat, cancel encounter cards, heal, and control willpower somehow. Even though the encounters put you in different situations, it really comes down to the same thing and after playing four or five games in a row, the sameness just sinks in. I run decks that purposely don't use Steward of Gondor, Galadhrim's Greetings and Sneak Attack/Gandalf just to make it a challenge. But, as more cards get released, I'm finding even more ways to do the same as these cards. Currently, I'm running a Thorin, Ori, Nori deck that draws itself out every game and reduces threat just by playing more Dwarfs. We Are Not Idle/Lure of Moria combo is all the resource acceleration anything would ever need. The only way to lose is by a first or second turn stomping by the worst treachery cards ever created without a Test of Will (which is the one card they need to find alternates of). \n\nI really enjoy playing the game, but its starting to all feel the same. Rush for enough allies to control the board and then drop threat. After the first two turns, you know if you've won the scenario or not. And, it gets worse with every new player card they make.\n\n\n\ni ask this in all earnestness: what game *doesn't* start to feel the same? every game has the same core mechanics from expansion to expansion (or not, if it's a board game). magic is play creatures and tap (or mill). clue is travel around and ask questions. battleship is call out grid coordinates. star trek ccg was fly around space, beam down, and complete missions. AGoT is play characters, bash the other guy. tag is running around and touching your friends. soccer is kicking the ball around a field.\n\nwhile i might be oversimplifying (there is variation to all of the above) but every game, at it's core, is the same every time you play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=681487","commentId":681487,"userName":"John85","timestamp":1345827271,"content":"Dain Ironfoot said:\n\n \n\ni ask this in all earnestness: what game *doesn't* start to feel the same? every game has the same core mechanics from expansion to expansion (or not, if it's a board game). magic is play creatures and tap (or mill). clue is travel around and ask questions. battleship is call out grid coordinates. star trek ccg was fly around space, beam down, and complete missions. AGoT is play characters, bash the other guy. tag is running around and touching your friends. soccer is kicking the ball around a field.\n\nwhile i might be oversimplifying (there is variation to all of the above) but every game, at it's core, is the same every time you play it.\n\n\n\nI like this progression, CCG, Card/Boardgame, Boardgame, CCG, CCG/LCG, children's game, ball game. Hilarious (although I'm not sure why)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=681645","commentId":681645,"userName":"Thorongil","timestamp":1345849953,"content":"Dain Ironfoot said:\n\ni ask this in all earnestness: what game *doesn't* start to feel the same? every game has the same core mechanics from expansion to expansion (or not, if it's a board game). magic is play creatures and tap (or mill). clue is travel around and ask questions. battleship is call out grid coordinates. star trek ccg was fly around space, beam down, and complete missions. AGoT is play characters, bash the other guy. tag is running around and touching your friends. soccer is kicking the ball around a field.\n\nwhile i might be oversimplifying (there is variation to all of the above) but every game, at it's core, is the same every time you play it.\n\n \n\n \n\nDon't trash soccer! That takes this thread too far…\n\nOh, ahem… *cough* Minas Morgul. Carn Dum. The Iron Hills. The Blue Wizard. The sorcerer of Angmar. Palantiri…. Phew! Back on topic!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=681651","commentId":681651,"userName":"Glaurung","timestamp":1345850388,"content":"Dain Ironfoot said:\n\ngokubb said:\n\n \n\n I partially agree with the OP. My problem isn't really with the player cards or encounter sets. Thematically, the encounter sets do a great job of really translating the difficulty of their story into a card game. But, I agree that the core of the game is really limited. You need to control threat, cancel encounter cards, heal, and control willpower somehow. Even though the encounters put you in different situations, it really comes down to the same thing and after playing four or five games in a row, the sameness just sinks in. I run decks that purposely don't use Steward of Gondor, Galadhrim's Greetings and Sneak Attack/Gandalf just to make it a challenge. But, as more cards get released, I'm finding even more ways to do the same as these cards. Currently, I'm running a Thorin, Ori, Nori deck that draws itself out every game and reduces threat just by playing more Dwarfs. We Are Not Idle/Lure of Moria combo is all the resource acceleration anything would ever need. The only way to lose is by a first or second turn stomping by the worst treachery cards ever created without a Test of Will (which is the one card they need to find alternates of). \n\nI really enjoy playing the game, but its starting to all feel the same. Rush for enough allies to control the board and then drop threat. After the first two turns, you know if you've won the scenario or not. And, it gets worse with every new player card they make.\n\n \n\n \n\ni ask this in all earnestness: what game *doesn't* start to feel the same? every game has the same core mechanics from expansion to expansion (or not, if it's a board game). magic is play creatures and tap (or mill). clue is travel around and ask questions. battleship is call out grid coordinates. star trek ccg was fly around space, beam down, and complete missions. AGoT is play characters, bash the other guy. tag is running around and touching your friends. soccer is kicking the ball around a field.\n\nwhile i might be oversimplifying (there is variation to all of the above) but every game, at it's core, is the same every time you play it.\n\n\n\nDain Ironfoot said:\n\ngokubb said:\n\n \n\n I partially agree with the OP. My problem isn't really with the player cards or encounter sets. Thematically, the encounter sets do a great job of really translating the difficulty of their story into a card game. But, I agree that the core of the game is really limited. You need to control threat, cancel encounter cards, heal, and control willpower somehow. Even though the encounters put you in different situations, it really comes down to the same thing and after playing four or five games in a row, the sameness just sinks in. I run decks that purposely don't use Steward of Gondor, Galadhrim's Greetings and Sneak Attack/Gandalf just to make it a challenge. But, as more cards get released, I'm finding even more ways to do the same as these cards. Currently, I'm running a Thorin, Ori, Nori deck that draws itself out every game and reduces threat just by playing more Dwarfs. We Are Not Idle/Lure of Moria combo is all the resource acceleration anything would ever need. The only way to lose is by a first or second turn stomping by the worst treachery cards ever created without a Test of Will (which is the one card they need to find alternates of). \n\nI really enjoy playing the game, but its starting to all feel the same. Rush for enough allies to control the board and then drop threat. After the first two turns, you know if you've won the scenario or not. And, it gets worse with every new player card they make.\n\n \n\n \n\ni ask this in all earnestness: what game *doesn't* start to feel the same? every game has the same core mechanics from expansion to expansion (or not, if it's a board game). magic is play creatures and tap (or mill). clue is travel around and ask questions. battleship is call out grid coordinates. star trek ccg was fly around space, beam down, and complete missions. AGoT is play characters, bash the other guy. tag is running around and touching your friends. soccer is kicking the ball around a field.\n\nwhile i might be oversimplifying (there is variation to all of the above) but every game, at it's core, is the same every time you play it.\n\n\n\nMany games is not same. I also hate this feelings when you understand you win after couple of rounds. yes there is a long way still but you already now you will win the game. MAO is build different way and i love it cose of that. FOS also very cool about cose you also dont know what can happen after wash away. LD with 3 players also really interesting and tricky. We need have more quest which is going more harder with quest cards progress and encounter deck must start to react on players power(number of allies, attachments, cards in hand, resources) not only threat level and everything will be fine. And is possible to do! Designers just need t do better job! But if there is mo complain about no one will really care.IF players will complain and sales go down then they will move fast.\n\nI love the game but im pretty sue there is a lot of ways to make this good game amazing. Sometimes this game have monotony and we need get rid of this!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=683026","commentId":683026,"userName":"HilariousPete","timestamp":1346071019,"content":"I partially agree with the OP, sometimes LotR seems only to focus on quest, attack and defend. But FFG can change this with new game mechanics, e.g. I really liked FoS… there are some very good ideas in it. And I hope FFG will do that / continue to do that. Treasures and battlegrounds sound promising, at least.\n\nGlaurung said:\n\n \n\nI also hate this feelings when you understand you win after couple of rounds. yes there is a long way still but you already now you will win the game….\n\nWe need have more quest which is going more harder with quest cards progress and encounter deck must start to react on players power(number of allies, attachments, cards in hand, resources) not only threat level and everything will be fine. And is possible to do!\n\n \n\nYou already told that a good while ago (perhaps a year or so) and it's still right. The encounter deck should build up its power slowly to simulate an opponent in a 2 player duelling game. I created a custom quest with that in mind, try it out if you want to: http://boardgamegeek.com/thread/828088/new-custom-quest-orc-hunt [http://boardgamegeek.com/thread/828088/new-custom-quest-orc-hunt]. It has one starting encounter card that builds up its strength as the players do, has a starting location that is good for a solo player to make it (hopefully) equally difficult for solo and multiplayer mode, encounter cards that react on some player actions, and it includes a mechanic/theme that you will remember from the old MECCG that I am currently really missing in this game: corruption! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nGreetings,\n\nPete\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=683085","commentId":683085,"userName":"Glaurung","timestamp":1346075236,"content":"HilariousPete said:\n\nI partially agree with the OP, sometimes LotR seems only to focus on quest, attack and defend. But FFG can change this with new game mechanics, e.g. I really liked FoS… there are some very good ideas in it. And I hope FFG will do that / continue to do that. Treasures and battlegrounds sound promising, at least.\n\nGlaurung said:\n\n \n\n \n\nI also hate this feelings when you understand you win after couple of rounds. yes there is a long way still but you already now you will win the game….\n\nWe need have more quest which is going more harder with quest cards progress and encounter deck must start to react on players power(number of allies, attachments, cards in hand, resources) not only threat level and everything will be fine. And is possible to do!\n\n \n\n \n\nYou already told that a good while ago (perhaps a year or so) and it's still right. The encounter deck should build up its power slowly to simulate an opponent in a 2 player duelling game. I created a custom quest with that in mind, try it out if you want to: http://boardgamegeek.com/thread/828088/new-custom-quest-orc-hunt [http://boardgamegeek.com/thread/828088/new-custom-quest-orc-hunt]. It has one starting encounter card that builds up its strength as the players do, has a starting location that is good for a solo player to make it (hopefully) equally difficult for solo and multiplayer mode, encounter cards that react on some player actions, and it includes a mechanic/theme that you will remember from the old MECCG that I am currently really missing in this game: corruption! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nGreetings,\n\nPete\n\n \n\n\n\nYes i sow your quest and Traggic also recomend it. Should try this one!\n\nOld good MECCG is really cool game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=684681","commentId":684681,"userName":"Runix","timestamp":1346260717,"content":"Just a follow up from the original complainer, or rather, the original poster.\n\nSomebody asked about quests - I have not played the very latest, as I am still working my way through them.  I did recognize in my second post, however, that they are making progress making the quests more interesting - but it is very slow progress.\n\nI totally agree with Glaurung and HilariousPete, above - the Encounter deck needs to build more slowly.  Too many quests are decided within the first two turns.  There are two problems here:  one is the very weak synergy in the Encounter deck (some Encounter decks have almost literally zero synergy between cards), and one is the very strong synergy in the player deck.  The former is easier to fix, the latter is not.\n\nAs for solutions, there are some available solutions, but some things where there simply is not an easy solution.  Basically, the quests can be improved, but there's very little that can be done about the player decks, other than the belated balance-by-errata, which is clunky and far from ideal.\n\nSomeone mentioned \"cannot have attachment\" monsters and \"cannot be canceled\" effects - those aren't solutions, those are belated recognitions that certain player cards are broken.  Preventing the player from doing anything about an Encounter deck effect is bad design, only tolerable because it's obvious that certain effects available to the player are way too strong.  Ideally, the player should always be able to do something about whatever pops out of the Encounter deck - but not easily.  That's the problem, it's just too easy to negate certain Encounter deck effects, so the designers have to make them immune to player effects.  Again, bad design.  Far better would be to always give the player the option to do something, but make the player work or sacrifice for it.\n\nAs far as constructive suggestions, I second the suggestion above of Encounter deck effects that scale off the size of the player's board, or even the size of the player's hand.  Also effective would be Encounter deck effects that are difficult, but which can be handled in more than one way - e.g., a card that the player can deal with either through a questing effect or a combat effect or just by having a certain combination of items in play, which would reward creativity on the part of the player.  And as already mentioned, quests should start just a bit slower but rapidly accelerate, particularly as the player's actions accelerate.\n\nI also like the multi-quest idea which they've toyed around with previously, but which has new life in The Hobbit expansion.  Taking quests one at a time just doesn't \"feel\" right - ideally, quests would be chained together, and what happens in one would roll forward to what happens in the next one.\n\nI'd also like to see a lot more mechanics built around keywords.  Again, they've done a bit more of this recently, with Dark locations from Khazad-dum and so forth, but it's very inconsistent - and, unfortunately, encourages building quest-specific decks, which I personally do not prefer.  It would be nice to see a lot more keyword interaction - both positive and negative - between the Encounter deck and the player deck (right now there is a lot of keyword interaction within the player deck, and some within the Encounter deck, but very little between the two)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=684772","commentId":684772,"userName":"Glaurung","timestamp":1346277801,"content":"Runix said:\n\nJust a follow up from the original complainer, or rather, the original poster.\n\nSomebody asked about quests - I have not played the very latest, as I am still working my way through them.  I did recognize in my second post, however, that they are making progress making the quests more interesting - but it is very slow progress.\n\nI totally agree with Glaurung and HilariousPete, above - the Encounter deck needs to build more slowly.  Too many quests are decided within the first two turns.  There are two problems here:  one is the very weak synergy in the Encounter deck (some Encounter decks have almost literally zero synergy between cards), and one is the very strong synergy in the player deck.  The former is easier to fix, the latter is not.\n\nAs for solutions, there are some available solutions, but some things where there simply is not an easy solution.  Basically, the quests can be improved, but there's very little that can be done about the player decks, other than the belated balance-by-errata, which is clunky and far from ideal.\n\nSomeone mentioned \"cannot have attachment\" monsters and \"cannot be canceled\" effects - those aren't solutions, those are belated recognitions that certain player cards are broken.  Preventing the player from doing anything about an Encounter deck effect is bad design, only tolerable because it's obvious that certain effects available to the player are way too strong.  Ideally, the player should always be able to do something about whatever pops out of the Encounter deck - but not easily.  That's the problem, it's just too easy to negate certain Encounter deck effects, so the designers have to make them immune to player effects.  Again, bad design.  Far better would be to always give the player the option to do something, but make the player work or sacrifice for it.\n\nAs far as constructive suggestions, I second the suggestion above of Encounter deck effects that scale off the size of the player's board, or even the size of the player's hand.  Also effective would be Encounter deck effects that are difficult, but which can be handled in more than one way - e.g., a card that the player can deal with either through a questing effect or a combat effect or just by having a certain combination of items in play, which would reward creativity on the part of the player.  And as already mentioned, quests should start just a bit slower but rapidly accelerate, particularly as the player's actions accelerate.\n\nI also like the multi-quest idea which they've toyed around with previously, but which has new life in The Hobbit expansion.  Taking quests one at a time just doesn't \"feel\" right - ideally, quests would be chained together, and what happens in one would roll forward to what happens in the next one.\n\nI'd also like to see a lot more mechanics built around keywords.  Again, they've done a bit more of this recently, with Dark locations from Khazad-dum and so forth, but it's very inconsistent - and, unfortunately, encourages building quest-specific decks, which I personally do not prefer.  It would be nice to see a lot more keyword interaction - both positive and negative - between the Encounter deck and the player deck (right now there is a lot of keyword interaction within the player deck, and some within the Encounter deck, but very little between the two).\n\n\n\nBravo, bravo!!! Agree with you on many points. Is really good more and more players start to share my point of view. 1year before if i try to say something like this everyone was against me (the game is amazing, how dare you?!). Im pretty sure if designers will listen all this suggestions we will get much better quest in the end of the day."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=684824","commentId":684824,"userName":"Dain Ironfoot","timestamp":1346288082,"content":"Runix said:\n\n \n\nJust a follow up from the original complainer, or rather, the original poster.\n\nSomebody asked about quests - I have not played the very latest, as I am still working my way through them.  I did recognize in my second post, however, that they are making progress making the quests more interesting - but it is very slow progress.\n\nI totally agree with Glaurung and HilariousPete, above - the Encounter deck needs to build more slowly.  Too many quests are decided within the first two turns.  There are two problems here:  one is the very weak synergy in the Encounter deck (some Encounter decks have almost literally zero synergy between cards), and one is the very strong synergy in the player deck.  The former is easier to fix, the latter is not.\n\nAs for solutions, there are some available solutions, but some things where there simply is not an easy solution.  Basically, the quests can be improved, but there's very little that can be done about the player decks, other than the belated balance-by-errata, which is clunky and far from ideal.\n\nSomeone mentioned \"cannot have attachment\" monsters and \"cannot be canceled\" effects - those aren't solutions, those are belated recognitions that certain player cards are broken.  Preventing the player from doing anything about an Encounter deck effect is bad design, only tolerable because it's obvious that certain effects available to the player are way too strong.  Ideally, the player should always be able to do something about whatever pops out of the Encounter deck - but not easily.  That's the problem, it's just too easy to negate certain Encounter deck effects, so the designers have to make them immune to player effects.  Again, bad design.  Far better would be to always give the player the option to do something, but make the player work or sacrifice for it.\n\nAs far as constructive suggestions, I second the suggestion above of Encounter deck effects that scale off the size of the player's board, or even the size of the player's hand.  Also effective would be Encounter deck effects that are difficult, but which can be handled in more than one way - e.g., a card that the player can deal with either through a questing effect or a combat effect or just by having a certain combination of items in play, which would reward creativity on the part of the player.  And as already mentioned, quests should start just a bit slower but rapidly accelerate, particularly as the player's actions accelerate.\n\nI also like the multi-quest idea which they've toyed around with previously, but which has new life in The Hobbit expansion.  Taking quests one at a time just doesn't \"feel\" right - ideally, quests would be chained together, and what happens in one would roll forward to what happens in the next one.\n\nI'd also like to see a lot more mechanics built around keywords.  Again, they've done a bit more of this recently, with Dark locations from Khazad-dum and so forth, but it's very inconsistent - and, unfortunately, encourages building quest-specific decks, which I personally do not prefer.  It would be nice to see a lot more keyword interaction - both positive and negative - between the Encounter deck and the player deck (right now there is a lot of keyword interaction within the player deck, and some within the Encounter deck, but very little between the two).\n\n \n\n \n\nMany of these things are indeed being done. I don't want to sound like I don't have criticism of the game and don't understand where you are coming from, but by not playing the more recent quests, you really are missing out on a lot.\n\nSome examples:\n\n-there are now encounter cards you can use resources to cancel.\n-there are now quests that have two encounter decks, and once the second encounter deck becomes \"active\" it really pours on the number of enemies engaged with you (i.e. increasing the difficulty).\n- two staging areas (one Bilbo, one the rest)\n- there are more keyword interactions for the encounter deck\n\n\"Someone mentioned \"cannot have attachment\" monsters and \"cannot be canceled\" effects - those aren't solutions, those are belated recognitions that certain player cards are broken. Preventing the player from doing anything about an Encounter deck effect is bad design, only tolerable because it's obvious that certain effects available to the player are way too strong. Ideally, the player should always be able to do something about whatever pops out of the Encounter deck - but not easily. That's the problem, it's just too easy to negate certain Encounter deck effects, so the designers have to make them immune to player effects. Again, bad design. Far better would be to always give the player the option to do something, but make the player work or sacrifice for it.\"\n\nyes and no, but every game has this. Magic has \"can't be countered\" effects on some creatures. It's not because the counter cards are broken or overpowered, it's just another way to make the creature better. Or creatures that can't be the target of your opponents spell, same thing. You are taking the most pessimistic view of game design, instead of realizing that it could actually not be some sort of retroactive \"fix.\"\n\nAgain, all in all, I think you have some good ideas. But think of it this way: your thread is titled \"More of the same…*sigh*\" and you admit you haven't played the most recent quests and many of your points are addressed in those quests (to be sure, perhaps not to your satisfaction). If you are a game designer, and spent a lot of work/energy/time into making the quests, how would you react to a similar post? It starts off sort of demeaning towards the designers and comes off more as a negative, as opposed to constructive, post.\n\nI guarantee if you had titled the thread \"Constructive Suggestions for Improving Quests\" and made the same points in a more positive manner, the thread would have taken on a whole different life and the conversation would have spun off in an entirely different direction.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=684966","commentId":684966,"userName":"John85","timestamp":1346314639,"content":"Dain Ironfoot said:\n\nAgain, all in all, I think you have some good ideas. But think of it this way: your thread is titled \"More of the same…*sigh*\" and you admit you haven't played the most recent quests and many of your points are addressed in those quests (to be sure, perhaps not to your satisfaction). If you are a game designer, and spent a lot of work/energy/time into making the quests, how would you react to a similar post? It starts off sort of demeaning towards the designers and comes off more as a negative, as opposed to constructive, post.\n\nI guarantee if you had titled the thread \"Constructive Suggestions for Improving Quests\" and made the same points in a more positive manner, the thread would have taken on a whole different life and the conversation would have spun off in an entirely different direction.\n\n\n\nThis is all of it in a nutshell, Dain. Constructive criticism is the way to go. I learned how to do this when I was in 6th grade. I presume most/all on this board are older than that and familiar with the concept. Give it a shot folks, it doesn't mean you can't be critical, it just means that you aren't critical in a completely asinine way. Acknowledge the good and then make your suggestions. Everyone on the board will be happier, and those who don't share your opinion will take you more seriously."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69677-hobbit-and-heirs-more-of-the-same-sigh/?do=findComment&comment=684968","commentId":684968,"userName":"John85","timestamp":1346314815,"content":"John85 said:\n\n \n\n \n\nThis is all of it in a nutshell, Dain. Constructive criticism is the way to go. I learned how to do this when I was in 6th grade. I presume most/all on this board are older than that and familiar with the concept. Give it a shot folks, it doesn't mean you can't be critical, it just means that you aren't critical in a completely asinine way. Acknowledge the good and then make your suggestions. Everyone on the board will be happier, and those who don't share your opinion will take you more seriously.\n\n\n\nJust to be clear, the antecedent of \"you\" and \"your\" is \"folks\" not \"Dain\"."}]}