{"url":"https://community.fantasyflightgames.com/topic/69734-the-importance-of-good-stats/","title":"The Importance of Good Stats","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69734-the-importance-of-good-stats/?do=findComment&comment=680143","commentId":680143,"userName":"lleimmoen","timestamp":1345698708,"content":"Most of the players of the Lord of the Rings the Card Game would probably agree that the majority of its quests hinge on the few opening rounds. It is there and then that the encounter deck is most unpredictable and the players most vulnerable. It is also then that heroes play the most essential part. In many a successful play, the end-game can often be carried by an army of allies, supported by armoury of attachments and driven forth by powerful events. However, getting there usually leads through the opening struggle where the few lone heroes must prove their worth.\n\nWith the card pool for this game ever growing, it is easy now to think of numerous combos that can boost heroes to sky-high limits. And one does not need imagination to experience games in which Dúnhere repeatedly strikes the staging area and fells a great foe with each blow. This experience is costly though. To get to it, one needs to fill many slots in his deck with cards supporting such a strategy, draw the cards in time, and pay for them. Not to say any of the above is a bad idea, the experience of it is usually quite entertaining and the satisfaction when all the synergies come true almost guaranteed. However, it is not what wins the game in the first place; and it is not what takes one to the point of having a chance of winning it. The hardest quests to date often follow a similar pattern, the players face a rough beginning and much of their chance depends on luck.\n\nLuck, chance, probability: it is not always easy to draw a fine line between them. Choosing the right party to overcome the opening odds can be decisive though. If the set difficulty can be managed in quest and combat, the further opportunities shall arise. Getting rid of early enemies, surviving treacheries and exploring locations will open a path on which all the hard-thought deck-building will not be in vain.\n\nAll of the above is not to say that all one needs do is to look at his heroes’ stats and pick the highest (or lowest) numbers. Combining a reasonable starting threat with enough willpower and sufficient combat skills is not easy; and the formula for it may differ with a scenario. It is here though that much of the early success lies.\n\nOf course, some decks and their strategies simply depend more on their deck, and they need time and resources to get going properly. Others tend to be more direct in their approach and their tactics do not require delving deep into the deck. In either case, a player should avoid thinking too much in terms of all the possible combos because filling many valuable slots for a certain strategy may backfire, or come short if there is not enough time to pursue it. Depending more on the given stats of heroes can leave these slots open for other possibilities.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69734-the-importance-of-good-stats/?do=findComment&comment=680157","commentId":680157,"userName":"richsabre","timestamp":1345700777,"content":"yes- i completely agree. the vast majority of games are won in the first few round……which is sort of a downfall of this game at the moment. i would like to see more cards that can turn a sunny walk through hobbiton into a poison infested crawl through mordor (metaphorically of course!!)\n\n \n\nstill you make a good point on hero choice, which as you say is certainly not easy, and i think its part of the challenge in choosing a good 3 heros, and is something that players get better at over time and play.\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69734-the-importance-of-good-stats/?do=findComment&comment=680328","commentId":680328,"userName":"schmoo34","timestamp":1345716597,"content":"I agree as well…this is why I push for 6 hero decks.  Starting with more heroes opens the game up for all kinds of possibilities.  Even if you can't fathom being this radical, consider an alternative where a player gets to draw the first three cards and put them into play immediately (akin to a quest card requiring X cards being drawn and put into the staging area)  It is certainly doable by any quest designer.  Ultimately, either option opens doors for more epic encounters and battles, etc. so the opening rounds aren't so restricted.\n\n \n\nI guess my point is that this is so easy to overcome if someone wants to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69734-the-importance-of-good-stats/?do=findComment&comment=680382","commentId":680382,"userName":"lleimmoen","timestamp":1345720606,"content":"I still haven't got the Hobbit box but partly what made me write this was seeing Beorn. I am not sure how well he's going to play but when I first saw his restriction I was very disappointed, thinking about all the combos Beorn's missing. More I have been thinking about it, however, more I am guessing Beorn could work very well when placed in a proper deck. Obviously you can boost Gimli to be hitting for much more than 5 and you can make Elrohir or Elrond a much surer defender; but the ability to defend almost anything at the start, and to hit for 5 from round 1 can mean a lot. The Dori's combo makes things much better still, and if Fortune or Fate works, Beorn can quickly become a favourite… and it is only two different cards to make him very effective… Stand Together and Stand and Fight for Dori are taking things a bit further."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69734-the-importance-of-good-stats/?do=findComment&comment=680385","commentId":680385,"userName":"lleimmoen","timestamp":1345720695,"content":"To play a devil's (read ffg) advocate, I have a hunch the new scenarios may shift the trend toward a more climactic quests."}]}