{"url":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/","title":"New custom scenario &quot;The Battle of Helm&#039;s Deep&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680146","commentId":680146,"userName":"Style75","timestamp":1345698963,"content":"Can't wait for the Gondor expansion and what it's like to survive a seige in LoTR:LCG ?  Get your fix with my new custom scenario, \"The Battle of Helm's Deep\". You can find the files for download in my skydrive at the following link:\n\nhttps://skydrive.live.com/?cid=F56C6FE4A0A30C29&id=F56C6FE4A0A30C29!105 [https://skydrive.live.com/?cid=F56C6FE4A0A30C29&id=F56C6FE4A0A30C29!105]\n\nI've included JPEGs for general viewing and 300dpi images for those who want to print, cut and sleeve them. I've also included .o8d and .o8s files for those of you who like to play on OCTGN.\n\nPlease note that I designed this scenario to be played by 2 players. Solo play is extremely difficult and very much dependent on luck. This is a very combat heavy scenario that obviously favors combat oriented decks. Make sure you've got some \"ranged\" capability in your deck if you want to take out the siege engines and the orc general. Make sure you read the instruction card very carefully as this scenario uses an alternative method to calculate starting threat.\n\nI consider this scenario to be a playtest and I'd appreciate any feedback you can give me. I've got about a 40% win rate which is right around where I like. I've played the scenario many times myself and know of several changes that can make it a little easier if you are struggling to defeat it:\n\n- Remove the keyword \"Infantry\" from the Blademaster\n\n- Lower the number of \"Infantry\" cards revealed by Ladder Assault from 3 to 2\n\n- Lower the number of \"Scout\" cards revealed by Commando Raid from 3 to 2\n\nOf course if you prefer a harder challenge, you could increase the effects of those cards.\n\nThank you to everyone who has playtested this so far, and a special thanks to Brian Ganas of Cardboard of the Rings for creating the OCTGN sets for me. Have fun, and please send me your feedback!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680191","commentId":680191,"userName":"Memetix","timestamp":1345706449,"content":"Thanks for sharing this, the OCTGN deck idea is great.\n\nI've tried installing the \"set\" and it seems to uninstall Foundations of Stone while doing it, which means my player deck won't load as it uses Imladris Stargazer. Is anyone else experiencing this problem?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680206","commentId":680206,"userName":"Style75","timestamp":1345707795,"content":"That's really strange, I'll build a deck myself that uses Foundation of Stone and see if I can replicate the problem. I really have no idea how to create OCTGN sets, this one was created for me, so I can't give you any advice just yet. If anyone else has this problem please post and let me know. Also if anyone knows of a fix to this problem, please post. Thanks in advance. In the meantime, you should be able to preview the cards by checking out the JPEGS. Don't forget to look at the card distribution which I've listed in the word document in the sky drive.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680256","commentId":680256,"userName":"Shiv@n","timestamp":1345711947,"content":"This seems to have some great ideas developp in here.\n\nIt's a little sad that the pictures are not very pretty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680299","commentId":680299,"userName":"Style75","timestamp":1345714123,"content":"Thank you for mentioning the artwork on the cards. All of these pictures I obtained from google images and I have no idea who the artists are. If you are an artist and I have used your image, please let me know so I can credit your name on the card. Rest assured that this card set is purely for fun and is available freely to all through public downloads. The publication of this card set will involve no money transactions of any kind.\n\nWith regards to the images, I thought the artwork I choose was a pretty good representation of the cards. Without hiring an army of professional artists, it's hard to get the exact image you want. There's a few pictures I'll probably change in the final product once the playtest is over. Which pictures in particular did you have a problem with?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680334","commentId":680334,"userName":"Shiv@n","timestamp":1345717371,"content":"The screencaptured ones ;-)\n\nI may have some stuff for you. I wanted to develop one fanmade scenario from this event myself and I tried to gather some good pictures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680355","commentId":680355,"userName":"Memetix","timestamp":1345718652,"content":"OCTGN ….. when I install TheBattleOfHelmsDeep.o8s it uninstalls FoundationsOfStone. I wondered if I'd hit a limit (16 sets) so tried uninstalling an unused set and then installing it but to no avail, same effect.\n\nStrangely, when I install FoS.o8s it uninstalls TheBattleOfHelmsDeep.o8s so maybe they have the same ID somewhere hidden in the file.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=680594","commentId":680594,"userName":"Style75","timestamp":1345734315,"content":"Thanks for the emails, also please feel free to post feedback here in the forums. It would be good to get some discussion going on it. Please remember to read the instruction card because I use a different way to calculate starting threat.\n\nAgain, thank you for the feedback!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=681092","commentId":681092,"userName":"Emrad","timestamp":1345795462,"content":"I'm stunned by the quality of this custom adventure. There are so many great design ideas in there that I can't wait to play it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYou'll definitely hear feedback from me as soon as I can print this quest and play it with some friends.\n\n \n\nFor the minor changes I can already see:\n\nHelm's Dike, Hornburg Citadel, Great Horn of Helm and Hornburg Gate should be unique.\n\nMaybe Glimmering Caves and King Theoden's Charge, too.\n\nSince ressource tokens on locations represent damage to structures, why not use damage token? It seems much more flavourful :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nKing Theoden's Charge is missing a full stop in its text box (after \"(set aside)\").\n\nUruk Heavy infantry should state \"… discard the top card of the encounter deck. If that card is an ennemy, add it to the staging area.\" (like Cave Torch actually).\n\nI'm not sure the \"doomed\" keyword should be found in shadow effects. Cards states \"raise player's threat by X\" when a shadow effect increases a player's threat.\n\nWestfold harrier should state \"…1 damage to the attacking ennemy…\" to make its shadow effect clearer.\n\n\"Forced\" on Missing in action and on Ballista should be in bold.\n\n\"Ballista\", \"Catapult\" and \"Siege Tower\" are, in my opinion, too generic names for orc siege weapons. Some adjectives would be welcome.\n\n \n\nBut most importantly, I do understand the point of the reverse method of calculating starting threat, but it seems changing the game a bit too much in my opinion.\n\nPlayers' deck can become awfully strong just by playing the best heroes possible AND Secrecy cards, while the normal design of the game is exactly the opposite: you play Secrecy cards along with low-threat heroes to be able to avoid Sauron's attention.\n\nThis method also requires whole new decks, and as a player point of view, I dislike changing my favorite deck too much for a particular quest (my freinds and I use sideboard cards system mainly).\n\nI'd really like to see how other players feel about this reverse threat method.\n\n \n\nKeep up the good work!\n\n \n\nPS: You say \"NEW custom scenario\", do you mean you already made other ones? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\nIf so, I'd really like to know where I can find them! (you should have a link mentionned in you signature, like Memetix)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=681747","commentId":681747,"userName":"Style75","timestamp":1345872810,"content":"Yes, I've got another cutom scenario, but it's very straightforward and kinda crude. Not what I want released. However I am currently working on my next custom set which will involve spying, intrigue, and mystery. This is going to be very thematic and unlike anything else in the game so far. I'm really trying to do different things with the game, experiment with ways to take the basic rules and see how I can push them in new directions.\n\nIt'll be a while before that set gets released, I'd like to polish up \"Battle of Helm's Deep\" first. Thanks to everyone for their feedback so far, it's hugely helpful. Please keep commenting or send me an email, the more suggestions I get, the better this set will be.\n\nNOTE:  I'm working on a fix to the OCTGN problem. Right now if you install the OCTGN sets I have posted you won't be able to use any player cards from Foundations of Stone. Obviously this is unacceptable so I am going to create a new OCTGN set that (hopefully) resolves the problem. I'm new to OCTGN so this might take a day or so for me to figure out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=681785","commentId":681785,"userName":"Emrad","timestamp":1345881588,"content":" I'm looking forward to any future scenario!\n\n \n\nI've got a question regarding Hornburn Gate. How is it exactly supposed to work?\n\nWith the forced effect, as it is written, once explored (aka 4 exploration tokens on it) you should remove 2 ressource token from it and add 2 progess token on a location. But since the condition of the trigger is still verified, it would trigger again and again.\n\nDo you intend it to trigger only once per turn, after questing?\n\nOr maybe you intend to make it trigger several times until it no longer has ressource tokens? (but this would make it \"indestructible\")\n\n \n\nA little clarification would help before I test this scenario tonight :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=682472","commentId":682472,"userName":"Style75","timestamp":1345986224,"content":"Thanks for the question on the \"Hornburg Gate\" card. The effect of removing resource tokens and placing progress tokens on another location should happen only once per round during the quest resolution phase. Basically this effect was put in place to allow players to make progress on other locations without having to remove Hornburg Gate from play and avoid the necessity of having Northern Tracker in your deck. Hopefully that answers your question, if not please let me know. I'll be sure to edit that card for the next version to make it read better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=682474","commentId":682474,"userName":"Style75","timestamp":1345986447,"content":"The OCTGN problem has been fixed and a new .o8s file has been placed in the Skydrive location listed in my original post. I have deleted the old .o8s from the skydrive and you should make sure you delete old copies of the file and uninstall the old .o8s file from OCTGN.\n\nThank you very much to Brian of \"Cardboard of the Rings\" for fixing the file!\n\nEnjoy the game, and please feel to comment and ask questions, I'll do my best to fix any issues that come up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=682591","commentId":682591,"userName":"Emrad","timestamp":1346002537,"content":"\"Thanks for the question on the \"Hornburg Gate\" card. The effect of removing resource tokens and placing progress tokens on another location should happen only once per round during the quest resolution phase. Basically this effect was put in place to allow players to make progress on other locations without having to remove Hornburg Gate from play and avoid the necessity of having Northern Tracker in your deck. Hopefully that answers your question, if not please let me know. I'll be sure to edit that card for the next version to make it read better.\"\n\n \n\nPerfect, this is indeed what I ended up with since no other interpretation made sense.\n\nOur test session for your quest has been delayed because we manage to get our end on the latest expansion (Shadow and Flame, and YES, we're late in Europe :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]), so we played the official scenario instead of testing. But you'll get some feedback from me, don't worry!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=682603","commentId":682603,"userName":"Memetix","timestamp":1346004838,"content":"Thanks for fixing the OCTGN set. I've downloaded the new version and given it a go (solo) with my best deck.\n\nI'm not sure if I'm playing it right but it seems impossible.\n\nSo many shadow cards added enemies to the staging area, others have surge and all seem to engage straight away, bringing more shadow cards and more enemies. All in all an overwhelming experience.\n\nThe fact they have such low engagement checks takes away any options from the players.\n\nEven with Bilbo on my team drawing me an extra card I was never able to keep up with the encounter deck so I suspect I'm either playing it wrong or the difficultly level of the quests needs work.\n\nThere are lots of good ideas in there, but they didn't come together (for me) into an enjoyable game. With all the rule changes and cards in play with effects putting tokens on other cards it felt a bit confusing and I'm sorry to say, a bit of a chore.\n\nSorry to be down on all your efforts ….. I hope you can find a way to make it more of an enjoyable challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=682629","commentId":682629,"userName":"Style75","timestamp":1346007574,"content":"Memetix, this was never intended to be a solo quest. In fact, I'm quite certain it is impossible solo. With two players, it is difficult, but certainly doable. As I said above, I've won about 40% of the games I've played, all with two players.\n\nMany people have complained about the number of units being added to the staging area by shadow effects so I will probably change a few of them. Any suggestions which ones I should change?\n\nIf you find you're being overwhelmed every time, try reducing the effect of \"Ladder Assault\" and \"Commando Raid\" from adding three enemies each to two enemies each. You can also remove the infantry keyword from the hardest hitters like Uruk Blademaster and Uruk Heavy Infantry or removing surge from goblin pathfinder.\n\nA strong tactics hero like Boromir or Hama is extremely helpful, and hail of stones can be really beneficial for picking off the artillery units if you don't have enough ranged characters.\n\nWith regards to complexity, I'm hoping that rewording some of the cards will help make it a bit clearer. The game certainly strays from the simple mechanics of the core game, but then again, that's what I was going for :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I'm trying to mix things up a bit, shake the tree and see what happens. If you have any suggestions on how I can clean up the mechanics I'd appreciate them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=682803","commentId":682803,"userName":"Memetix","timestamp":1346037521,"content":"I would be great for your quest if it worked both solo and multiplayer. Cards like ladder assault could bring back X enemies, where X is the number of players.\n\nAs for surge effects, I think these could be conditional on the number of enemies already in play, i.e. if there are less than X+1 enemies in play, scout gains surge. X is twice the number of players.\n\nConceptually, the wall locations should be helping you and at the moment they seem to increase in threat according to how many enemies are in play, the opposite of what I'd expect. I seem to be fighting myself to try to explore them. It would make more sense to remove damage from them when you \"explore\". Could the walls have an effect that reduces the threat of all enemies in the staging area and some sort of timer (like the rearguard allies) to put them in the victory display if you can keep them in tact for a set period of time. Maybe they could apply damage to all enemies engaged with the player when they leave play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=684246","commentId":684246,"userName":"Emrad","timestamp":1346220144,"content":"The fact that the walls generate threat isn't too contradictory since you have to deal with an army of orcs that is trying to storm them.\n\nBut flavour-wise, it would indeed be great too if the walls could give a little help to the players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69735-new-custom-scenario-the-battle-of-helms-deep/?do=findComment&comment=684348","commentId":684348,"userName":"Shiv@n","timestamp":1346232633,"content":"I was thinking of a \"weapons room\" location wich would allow the player who travel to it to look the 5 first cards of his deck a take one \"armor\" or \"weapon\" attachment in his hand and shuffle back the rest in the deck. Seems legit for me ! And its a little help for the player who can have a hard time doing this quest.\n\nFor the wall stuff, I agreed that some may help the player, maybe with a shadow effect that hurt the player too ?\n\nStyle75, if you want the pictures I have, I can send you an email if you want ?"}]}