{"url":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/","title":"Epic play rules","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/?do=findComment&comment=680570","commentId":680570,"userName":"schmoo34","timestamp":1345732809,"content":"Ok, this is my official \"non-official\" rules for epic play which I have been playtesting.  I used Conflict at Carrock, Journey Down Anduin and Shadow and Flame as my test quests for working on these rules.  So there is definitely room for more playtesting, but I wanted to share them and allow each of you an opportunity to try it and decide if you like it or if you feel it is crap.\n\n \n\nI'm a simple man, and I like simple rules so everything is standard rules (by the book with the following exceptions)\n\n \n\n1) You may start the game with any number of heroes you like in groups of three.  For my playtesting, I was using 12 heroes.\n\n2) For purposes of \"X\" on encounter cards or for determining the number of encounter card draws or number of players; X = Number of heroes divided by three.\n\nThis means, with a 12 hero starting hand, X = 4 (which would be equivalent to a 4 player game)\n\n3) Use only one threat tracker.  Threat is added once per round just like normal rules.  Starting threat is equal to (Sum of all threat on all heroes) divided by number of heroes) * 3.    In other words, it is (Sum * 3/N)\n\nFor example, if you had 6 heroes, you add up all threat and you get 60.  60/6 = 10.  10* 3 = 30.  So your starting threat would be 30.\n\n4) Minimum deck = 50 cards.\n\n5) Money earned per round is equal to 3 for every 50 cards you have in your starting deck.  So if you only use 50 cards, you only get 3 resources.  If you use a 100 card deck, you get 6 resources.  You may assign them to whichever hero you wish and can not earn more resources than game rules allow.\n\n6) Card draw is similar.  You may draw one card per turn for every 50 cards you have in your deck.  If you have a 100 card deck, you draw two cards per round.\n\nIt may be obvious for most, but I will point out that you can have an imbalance of money and cards if you start with too small of a deck but its your game and these aren't official rules so have at thee.\n\nSome scenario specific playbalancing suggestions:\n\nDue to the epic nature of encounter card draws, there are cards which damage all heroes committed to the quest, etc.  A variant I recommend is that healing may interrupt and be performed at any time during the encounter phase (i.e. even after applying damage but before a character dies).  This is simply to counterbalance the design of cards which were clearly not designed to be used this way…and if you are drawing 6-8 encounter cards each turn, this damage adds up quickly.\n\nAlso, any card which asks you to add threat based on # of exhausted or unexhausted characters should have said threat divided by \"X\" or you will likely lose the very first time you draw that treachery card.\n\n \n\nThat is it. \n\n \n\nI played Journey down teh Anduin with 18 heroes quite successfully.  The only two issues it presented was that my starting deck was rather large (300 cards) and you need a large table.   But man oh man, I was drawing 7 encounter cards at a time and having some awesome battles.  I'm quite happy with this solution so far…obviously there are specific treachery cards in specific quests which I may not have thought of or may need \"discernment\" in regards to how to apply them…but I hope you enjoy the suggestion and happy gaming!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/?do=findComment&comment=683997","commentId":683997,"userName":"Zalrus9","timestamp":1346180196,"content":" This seems very interesting. This might be a good varient for solo play, without having to double-fist, which gets a bit fiddly. I might just use this with the Hobbit scenarios( with a dwarf party) and see how well that does.\n\nQuestion, though: does the hero number/ deck size scale with the opening hand? That might be important with multi-sphere decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/?do=findComment&comment=684043","commentId":684043,"userName":"Zalrus9","timestamp":1346187447,"content":" Okay, so I just finished a solo game of \"We Must away ere break of day\" with a party of six dwarves (Thalin, Dain, Ori, Nori, Bifur, and Thorin). It was a bit less fiddly, but since I was playing a deck of 100 cards, it was a bit harder to shuffle, and I found that it was hard to get good stuff out of my deck. Perhaps if I got more card draw effects. I found myself with multiple copies of unique cards, and that was no fun.\n\n \n\nAll in all though. It was fun, and I think this would be how I would like to do the Hobbit scenarios. (though having the new dwarves is a bit game-breaking)\n\n \n\nAnybody else tried this format?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/?do=findComment&comment=684534","commentId":684534,"userName":"schmoo34","timestamp":1346248260,"content":"What is interesting is I have gotten wiped playing the hobbit scenario using these rules multiple times.  There is a treachery card where it says to draw X more cards and if you have an epic hand, \"X\" can still be quite large…and in doing so, I drew the OTHER COPY of that treachery card and wound up with a 16 card staging area.  Needless to say, it was a bloody mess from that point.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI found it interesting that you had multiple uniques drawn in your 100 card deck…usually, it is even harder to do if you have 3 copies of a card in a 100 card deck vs. a 50 card deck.\n\n \n\nThe part that rings true for me is that I generally like a LOT of cards so it is easy for me to fill a 100 card deck for dwarves.  (Leadership and tactics) or to do a 400 card deck with all four spheres.  The shuffling thing, you are correct on.  What I do is I break the deck up into smaller chunks and shuffle those, then cut each smaller deck in half and mix with other decks, shuffle, etc. etc.  You can do it…it does take longer.  But I justify it in my mind by saying it is saving me time of playing multiple \"players\" solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/?do=findComment&comment=684536","commentId":684536,"userName":"schmoo34","timestamp":1346248389,"content":"Zalrus9 said:\n\n This seems very interesting. This might be a good varient for solo play, without having to double-fist, which gets a bit fiddly. I might just use this with the Hobbit scenarios( with a dwarf party) and see how well that does.\n\nQuestion, though: does the hero number/ deck size scale with the opening hand? That might be important with multi-sphere decks.\n\n\n\n \n\nYou tapped on a rule I forgot to mention.\n\n \n\nYou draw 6X cards.  So if X = 2, then you draw 12 cards.  If you keep the hand, then you draw two more.\n\n \n\nIf X = 3, then you draw 18 cards and then 3 more…etc. etc.\n\n \n\nYour \"X\" determines you opening hand.\n\n \n\nSo with a 100 card deck, your opening hand would be 14 cards. with 6 heroes and 6 resources to start the game with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/?do=findComment&comment=684673","commentId":684673,"userName":"Zalrus9","timestamp":1346260089,"content":" Thanks for that info. I'll try playing it again with a my improved deck (lots more card draw and discard effects)\n\nAs for the Hobbit Scenario, are you talking about the campfire trechery? I would see that a large X would be hosed a lot. I think Hobbit is better with X being 2. Don't know how it will effect other scenarios though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69774-epic-play-rules/?do=findComment&comment=685113","commentId":685113,"userName":"schmoo34","timestamp":1346328676,"content":"I had X=4 and it was brutal.  That is no worse than a 4 player game, but I feel most would agree the hobbit scenario is more difficult with four players vs. two.  And it is largely due to a very high number of treachery cards in that scenario.  The more battle based scenarios are a lot of fun with a large X.  I feel that epic play has the same issues solo play has.  Some scenarios are better suited while others are more difficult.  Escape from Dol Goldur is one that is extremely difficult solo but in epic play, it isn't bad at all."}]}