{"url":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/","title":"Stance cards: What are your thoughts?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=680597","commentId":680597,"userName":"Cunir","timestamp":1345734429,"content":"I've just been having a read of this thread, where Runix is hoping the game is going to branch out a bit, and not just be more of the same all the time -- www.fantasyflightgames.com/edge_foros_discusion.asp [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=702687]. That is what i am hoping too, although I'm still enjoying the game as it is, so i don't mind if it carries on like it is.\n\nBut here is something that I brought up on BGG a while ago and wondered what you thought. It didn't get much response on there, so maybe it is totally rubbish\n\n… Stance cards\n\nThe idea is to make fighting a bit more involved and strategic, and not just be the same old \"turn over a card, put up a defender, add up the numbers and repeat all over again blah blah blah\" that it is at the moment. there's not much strategy involved at the moment. you've just got your cards, the enemies have got their cards, and you just add up the numbers to see who wins.\n\nThe idea with stance cards is that we will have a handful of cards (probably no more than 5) which we can put into play at any time, to effect our entire group. The stance cards can be played whenever we want, whenever we think it will help, and will stay in play until we decide to remove them, or replace them with another stance card. So there is no luck involved. We either choose to play them, or we don't.\n\nImagine a stance where we can line up our characters on the \"front row\" and \"back row\". enemies would only be able to attack the ones on the front row, but we could only defend and attack with people on the front row as well. so straight away we would have a way to protect some of our most vunerable (wounded?) characters by putting them on the back row, but we'd have to put other characters at risk on the front.\n\nIf we only have two characters on the front row, and 1 on the back row, but we have 3 enemies engaged, what happens? that is where the risk comes in… because we can exhaust those 2 characters on the front row to defend against the first two attacks, but the third attack is still going to come… it can't attack the guy on the back row though -- he is safe -- so one of the already exhausted characters on the front has to take the damage.\n\nNormally, we could only attack back with characters on the front row as well, but i was thinking that maybe we could allow characters on the back row to attack if they have \"ranged\" -- that would be a really good and thematic use for the ranged trait.\n\nYou could have other stances like \"defence\" too. I was thinking that this stance would work by allowing us to defend with more than 1 character against each attack. So that would allow is to boost our defence, but the downside to defence stance would be that we could no longer attack back. So that would really be a \"backs to the wall\" kind of stance, when things aren't going too well\n\nThe only other stance i have thought of so far is a \"rest\" stance, where you can basically just hold up for an entire round if there are no enemies in play, collect resources and cards like normal, but you dont have to commit anyone to questing -- even if there is some threat there from locations. and you can stay like that, building up your cards and resources, until an enemy card comes off the encounter deck. at which point your group has to stop resting and go back into normal play again.\ni dont think that would be too powerful, because in practice you are only going to go a few rounds until an enemy appears, by which time some new locations might have appeared as well, and you still have to increase your threat every round too. maybe they could make it so you have to remove all progress from your current quest as well, if you choose to stop and rest.\n\n \n\nThe whole point of this \"stance\" idea though, is that it will add an extra little bit of strategy to the game, without relying on the luck of the cards. I find it really annoying when I turn over a card and just know straight away that I'm going to lose, whatever I do. But maybe this will give us some extra options that won't rely on us getting lucky and drawing the right card out of our player decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=680598","commentId":680598,"userName":"John85","timestamp":1345734653,"content":"This seems like a reasonable concept, but perhaps overly complicated. I feel like this would turn the game the direction of an RPG (e.g. Final Fantasy). I'll maintain my position on \"Weather Cards\" if they want to implement it, that's fine, but make it optional."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=680607","commentId":680607,"userName":"schmoo34","timestamp":1345735058,"content":"If I may simplify your concept…I think fighting is just fine the way it is.\n\n \n\nMy *stance* on this (ba-da-bing) is rather than muddying the fighting rules, just simply have stance cards (I like your suggestion of 5) and they could be named after various formations, etc. but they can be quite simple:\n\n \n\nScattered stance:  +1 willpower for all characters this round.  Discard after use\n\nFormidable wall: +1 defense for all characters this round.  Discard after use\n\nHeroic battlecry:  +1 attack for all characters this round.  Discard after use\n\nThe death king returns!: +3 attack for one hero this round.  Discard after use\n\nMy Precious:  +3 Defense for one hero this round.  Discard after use.\n\n \n\nThe stance cards would be a separate card mechanic which is simply used at the beginning of a round.  Obviously 5 cards would mean a bonus for 5 turns.  It gives interesting boosts as willpower might be difficult in early rounds so it can help a party out.  Or perhaps when the nasty hill troll attacks on turn 1, you can get +3 defense, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=680620","commentId":680620,"userName":"Cunir","timestamp":1345736009,"content":"Good cards, but isn't that mechanic just the same as event cards? (but ones that you already have in hand at the beginning)\n\ni was hoping to add something new to the game… a brand new mechanic. that is the main point of stance cards,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=680670","commentId":680670,"userName":"schmoo34","timestamp":1345739715,"content":"I am not currently aware of event cards you are guaranteed to have at the start of the game nor ones that provide the kind of benefits these do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=680679","commentId":680679,"userName":"Bullroarer Took","timestamp":1345740242,"content":"Honestly, I like the game because it can be set up easily and played in a reasonable amount of time.  Still, get a bunch of allies in play, some tricky locations and enemies and a hand full of event cards with interacting effects and I'm going to miss something.  Even veteran gamers like sirprim misses things once in a while.  For me the game is complicated enough as it is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=683099","commentId":683099,"userName":"Mr Coffee","timestamp":1346076516,"content":"Cunir said:\n\nImagine a stance where we can line up our characters on the \"front row\" and \"back row\". enemies would only be able to attack the ones on the front row, but we could only defend and attack with people on the front row as well. so straight away we would have a way to protect some of our most vunerable (wounded?) characters by putting them on the back row, but we'd have to put other characters at risk on the front.\n\n…\n\nNormally, we could only attack back with characters on the front row as well, but i was thinking that maybe we could allow characters on the back row to attack if they have \"ranged\" -- that would be a really good and thematic use for the ranged trait.\n\n\n\nI could see a \"stance\" card as a 1-phase event card that affects your allies/heros…  But making it an actual location-based issue (back row vs. front row) would create a fundamental shift in the structure of the game.  Having played the DC/Marvel universes VS card-game, they had a very similar front/back row set-up for protection, but it did create an extra amount of time each turn to decide who was blocking who, etc…  On the flip side, it allowed for their keywords of \"Flight\" and (if I remember correctly) \"Ranged\" for attacking to/from the back row… Could definitely get more useage out of the \"Ranged\" keyword from this game that way… although, as much as I'd love to be able to use Legolas and Brand more often in my solo play, I really don't want them to mess with the mechanics of this game… it's decently balanced right now…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=683146","commentId":683146,"userName":"Cunir","timestamp":1346081050,"content":"looks like this idea might be a lousy one… but there is one more stance that i thought of, which i thought i would include before the topic dies.\n\nan attack stance. this would basically just switch the defend and attack phases around, so you get to attack the enemy before they attack you. (this has always bugged me in the game, because why should you have to defend first all the time, even when you optionally engaged it?)  so this stance will allow you to get your hits in before you have to defend. but it would need a downside… and i haven't thought of that yet"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=683179","commentId":683179,"userName":"schmoo34","timestamp":1346084591,"content":"The downside could/would be that you must endure one attack undefended as a result. (If an enemy survives to counterattack)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=683196","commentId":683196,"userName":"OnkelZorni","timestamp":1346086195,"content":"sorry but I have too ask cause I'm really not sure what stance cards are. Can you please explain what these cards do? LOTR is the only card game I'm playing so I'm not familiar with this. Thanks in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=683285","commentId":683285,"userName":"Mr Coffee","timestamp":1346092951,"content":"Cunir said:\n\nlooks like this idea might be a lousy one… but there is one more stance that i thought of, which i thought i would include before the topic dies.\n\nan attack stance. this would basically just switch the defend and attack phases around, so you get to attack the enemy before they attack you. (this has always bugged me in the game, because why should you have to defend first all the time, even when you optionally engaged it?)  so this stance will allow you to get your hits in before you have to defend. but it would need a downside… and i haven't thought of that yet\n\n\n\n \n\nNot sure I could buy off on the entire concept of stance cards, but I completely agree with your idea about engagement…. if we OPTIONALLY ENGAGE an enemy, why does it get to attack first?!\n\nI think there could be a definite future mechanic developed around this.  Perhaps some would think it cheapen Quick Strike or Hands Upon the Bow, but it seems logical to create some bonus for choosing to engage enemies you don't have to…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69776-stance-cards-what-are-your-thoughts/?do=findComment&comment=683288","commentId":683288,"userName":"Mr Coffee","timestamp":1346093058,"content":"OnkelZorni said:\n\nsorry but I have too ask cause I'm really not sure what stance cards are. Can you please explain what these cards do? LOTR is the only card game I'm playing so I'm not familiar with this. Thanks in advance.\n\n\n\nThere is no such thing as stance cards.  They are merely an idea that was suggested by this thread… In theory, they perhaps would be an event card that grants you certain benefits while also causing certain drawbacks…"}]}