{"url":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/","title":"Frodo&#039;s Ability","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681519","commentId":681519,"userName":"Shockeffect","timestamp":1345830481,"content":"I have a question about the damage that Frodo's ability cancels.  THe the damage placed and then removed or does it never get placed on Frodo? Im asking this cause I was wondering if the attack would normally kill him, does his ability save him or does the damage have to go to Frodo first?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681521","commentId":681521,"userName":"richsabre","timestamp":1345830801,"content":"this [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=535389] thread is the one you need from the depths of time…..\n\ncant remember if there was ever an official faq on it though- general agreement was that the damage never occures so the likes of muck adders effect never happens\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681539","commentId":681539,"userName":"Shockeffect","timestamp":1345832258,"content":"Well thanks for that rich.  It is still a little ambiguous.  I think for now i will just play that the damage must be able to land on frodo.  Comparing this to Dori's Text: \"Response: After a hero is assigned any amount of damage, exhaust Dori to place that damage on Dori instead.\"  Whereas Frodo's ability says: \"Response: AFTER Frodo Baggins is damaged, cancel the damage…\"  Now that I have looked at this more, seems to me for sure that Frodo has to be able to take the damage in the first place without dieing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681553","commentId":681553,"userName":"richsabre","timestamp":1345833990,"content":"i see- in that ruling then you would personally play it that muck adder kills frodo as the damage physically lands on him first?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681564","commentId":681564,"userName":"Shockeffect","timestamp":1345835054,"content":"Yeah I would.  It does lessen Frodo quite a bit but it seems more reasonable to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681667","commentId":681667,"userName":"starhawk77","timestamp":1345853066,"content":"I could have sworn there was an official ruling on this, but I can't seem to find it. At any rate, Frodo can definitely use his ability to shrug off more damage than he would normally survive. When he was released, one of the preview articles mentioned using him to tank damage from Hummerhorns, which he obviously could not do if he were only able to cancel 1 damage at a time. \n\nI think the effect is poorly worded (should be \"When Frodo is assigned damage…\"), but there is direct evidence of designer intent in this instance. Frodo takes any amount of damage, and then his ability wipes those hits away before he is killed (even though characters are supposed to die \"immediately\" upon taking damage equal to their health). \n\nSo, while a strict reading of the card text would support your position, and while I usually favor such literal interpretations, this is one case in which we do have an indication of official intent. Once per phase, Frodo can take any amount of damage as threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681712","commentId":681712,"userName":"leptokurt","timestamp":1345863482,"content":"This game uses the word \"after\" in a very specific way, namely \"immediatly after\". Every response triggers immediatly after the effect that caused it. Nothing is going to happen between event and response. The combat sequence is like this:\n\n \n\n1) Calculate damage.\n\n2) Place damage tokens on defender\n\n3) Remove defender from play\n\n \n\nWith Frodo it goes like this:\n\n \n\n1) Calculate damage\n\n2) Place damage tokens on Frodo\n\n3) Trigger Frodo's response and cancel the damage\n\n4) Raise your threat by the cancelled damage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681728","commentId":681728,"userName":"richsabre","timestamp":1345868177,"content":"not to derail this thread to much- but starhawk- you seem to favour the likes of muck adder not killing frodo right? whilst leptokurt- that chart seems to favour him dieing??\n\nman- i wish we had an official answer on this\n\nEDIT- bugger it- ive sent an official request just in case\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681782","commentId":681782,"userName":"starhawk77","timestamp":1345881336,"content":"rich:\n\nStrictly speaking, Frodo should die from Muck Adder or from taking more than one damage from any single source. The way his ability is worded, he must have already taken damage before it can be canceled (which leads to another problem, since \"canceling\" existing damage counters would seem to be distinct from \"healing,\" but that's a separate issue). However, based on the article I referenced, I think this is just a case of loose/imprecise phrasing. The examples in the article clearly indicate that Frodo can tank damage from things like Hummerhorns. Since characters die immediately upon receiving lethal damage, Frodo could not possibly absorb those kinds of hits unless his response actually prevents all damage in the first place. If he actually prevents the damage, then Muck Adder's forced effect never triggers. \n\nI think this is one instance (similar to the inconsistencies between Brand and Legolas) in which it isn't very productive to parse the wording on a particular card. I'll be interested to see what the designers say, but I expect Muck Adder won't kill Frodo, and I am certain excess damage alone won't kill the little hobbit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681783","commentId":681783,"userName":"richsabre","timestamp":1345881482,"content":"yes i think youre right…..besides i think it makes sense themeatically (not that thats anything to go on haha)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=681936","commentId":681936,"userName":"Shockeffect","timestamp":1345903673,"content":"Well Starhawk, I guess if there is word from FFG somewhere about what their intent was for Frodo then I will accept that.  But yes, bottom line, poor wording.  That seems to be one of my biggest criticisms about the game is they need to get their wording more standardized, as this would fix a lot of the player issues with how cards work.  Thanks for all the responses though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=792556","commentId":792556,"userName":"Nickpes","timestamp":1367829090,"content":"Sorry I bring that up, but I'm still not sure that I get this correctly.\n\n \n\nFrodo can instead of dying from a cobat, raise the players threat the amount of damage he would have taken, even if that exceeds his hit points ? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=792737","commentId":792737,"userName":"richsabre","timestamp":1367865912,"content":"yeah, thats how i (and others as far as i know) have been playing him. so he could take a 10 damage hit and survive with threat raised\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=792964","commentId":792964,"userName":"Glaurung","timestamp":1367924372,"content":"Shockeffect said:\n\nWell Starhawk, I guess if there is word from FFG somewhere about what their intent was for Frodo then I will accept that.  But yes, bottom line, poor wording.  That seems to be one of my biggest criticisms about the game is they need to get their wording more standardized, as this would fix a lot of the player issues with how cards work.  Thanks for all the responses though!\n\n\n\n10000000000% agree. this problem was fromm the begin. They very funny tnose designers……."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69861-frodos-ability/?do=findComment&comment=792998","commentId":792998,"userName":"richsabre","timestamp":1367932394,"content":"was the muck adder thing ever concluded officially?"}]}