{"url":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/","title":"Stick to the theme?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682218","commentId":682218,"userName":"Ted Sandyman","timestamp":1345953653,"content":"Hi, this post may be already duplicated but ive just got The Hobbit , which looks fantastic. On the back of the rules there is a deck list to help players make a themed approach to these quests. This a great idea but includes Gondor and Rohan allies, which( to me) dont really have a place on my travels through these quests. My deck will consist largely of events and attachments with only a minority of allies. These will include Beorn, Gandalf, keen eyed and a wandering took, they may have come across a west road traveller, the company of dwarves that are not heroes and maybe a few eagles.  I expect im lining myself up for a hammering but will give it a go. Im not going to look at the quest cards or the encounter cards beforehand, so im going in blind but that adds to the excitement for me as i havent got a clue whats around the corner! I think i will re-read the early bits of The Hobbit to find out if they met any allies on the road. Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682231","commentId":682231,"userName":"starhawk77","timestamp":1345956121,"content":"Sounds like fun. I have nothing but admiration for dedicated theme decks, since winning is usually challenging enough with a finely-tuned build that largely dispenses with thematic considerations. More power to you, and I expect you'll really enjoy the scenarios in that box. They are all pretty innovative and positively oozing with thematic goodness (Bilbo will prove his worth time and time again, as well he should). \n\nThat being said, expect a rude welcome from Tom, Bert, and William gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682245","commentId":682245,"userName":"richsabre","timestamp":1345959810,"content":"hey ted- sounds a great idea, one i may steal off you happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\nas for the early book the company went through many lands with inns (so up to breeland) until the came to the forsaken inn which marked the lonelands through to weathertop….then they met the trolls in the trollshaws\n\nso up till then you have men (of arnor lands such as dunedain and breelanders) dwarves, a few tookish hobbits and very rarely , elves travelling west\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682292","commentId":682292,"userName":"player1761766","timestamp":1345965415,"content":"Ted Sandyman said:\n\nHi, this post may be already duplicated but ive just got The Hobbit , which looks fantastic. On the back of the rules there is a deck list to help players make a themed approach to these quests. This a great idea but includes Gondor and Rohan allies, which( to me) dont really have a place on my travels through these quests. My deck will consist largely of events and attachments with only a minority of allies. These will include Beorn, Gandalf, keen eyed and a wandering took, they may have come across a west road traveller, the company of dwarves that are not heroes and maybe a few eagles.  I expect im lining myself up for a hammering but will give it a go. Im not going to look at the quest cards or the encounter cards beforehand, so im going in blind but that adds to the excitement for me as i havent got a clue whats around the corner! I think i will re-read the early bits of The Hobbit to find out if they met any allies on the road. Cheers.\n\n\n\nI tried this yesterday, specially tailoring my deck for just the dwarf stuff etc, and had a most enjoyable time until the trolls appeared! It was fun trying to deal with them, but sadly the end was never really in doubt, and before too long it was curtains for me with a threat of 50. Sigh! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682308","commentId":682308,"userName":"shoreless","timestamp":1345966702,"content":" It's always those ruddy trolls!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682485","commentId":682485,"userName":"Ted Sandyman","timestamp":1345987742,"content":"Well thanks for all the advice and tips above guys. Sounds like it will be enjoyable but hard! Will give it a go and tinker the deck to my weaknesses when i finish. Im glad to know they may have met a few men and elves travelling, that expands the ally list. Im determined not to move on to scenario 2 until ive won the first one! Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682489","commentId":682489,"userName":"DarthJalapeno","timestamp":1345988297,"content":" Awesome idea!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682824","commentId":682824,"userName":"Ted Sandyman","timestamp":1346042481,"content":"Oh dear!!! After 7 minutes i was sacked and killed by the trolls! Well that was just a bloodbath. This quest reminds me of the Carrock where its wise to have a low starting threat, quest slowly at first and build up your allies. That will be my plan second time around. I didnt stand a chance once i discovered the trolls.  Im going in………"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=682831","commentId":682831,"userName":"starhawk77","timestamp":1346043745,"content":"Yeah, Tom, Bert, and William make the Carrock trolls look like weenies. Their cumulative passive effects along with the sack cards (not to mention the treacheries that add even more sacks) make for tough sledding. Just pray you stumble across a Troll Camp so Bilbo can do his burglar work. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/69923-stick-to-the-theme/?do=findComment&comment=683090","commentId":683090,"userName":"Ted Sandyman","timestamp":1346075848,"content":"Success on the third game as i put a load more dwarf allies in, quested very slowly and kept my threat low. Quite a balancing act. Took the trolls out one by one. A couple of queries though, the key turned up and i just attached it to Bilbo from out of the staging area, was this right? Sadly the purse was a shadow card so that went! Then Bilbo got sacked by the 3rd troll as he had the most attachments, I played it that i couldnt then travel to the troll cave as bilbo was sacked and couldnt spend his 5 resources as he wasnt allowed a trigger effect. Was this the correct play or can i still travel to the troll cave even if bilbo is sacked? Sadly no troll camps came up soon so i could de-sack him. I won the game but didnt get into the cave to collect the treasures."}]}