{"url":"https://community.fantasyflightgames.com/topic/69936-thank-you-ffg-for-giving-us-elrond/","title":"Thank you FFG for giving us Elrond","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/69936-thank-you-ffg-for-giving-us-elrond/?do=findComment&comment=682350","commentId":682350,"userName":"leptokurt","timestamp":1345972929,"content":"There has been surprisingly little discussion about good old Elrond so far (perhaps because of all the new expansions), so I'd like to dedicate this thread to the guys of FFG for creating a hero like Elrond. First of all, he is incredibly powerful, better than Glorfindel. This is balanced by his high starting threat. There are some strong card combos to power him up, namely LoV + Vilya. I love this combo and it's fun to play with it. The other combo is Elrond + Warden of Healer. We now get two DotN for only 2 resources.\n\nHowever, the main reason why I am so in love with Elrond is his ability to pay for other spheres' allies. You might already know that I am one of those who was quite unhappy about how the tactics sphere was treated so far - for solo play, at least. The main reason why tactics didn't work solo was it's lack of WP. To get enough WP you have to play some eagles, but these are expensive. One solution was to play Radagast, but that way you still had to wait several rounds before you could play the high cost eagle allies.\n\nNow Elrond solves this problem. Not only does he add 3 points to your WP, but he also provides resources to pay for eagles. It's now possible to play an eagle/tactics deck with only one tactics hero in your portfolio. The only price you have to pay is a relatively high starting threat (> 28). In the Dwarrodweld scenarios a high starting threat isn't that troubling, but in the Mirkwood cycle it can certainly cause some problems.\n\nHope everyone else here enjoys Erond the way I do. IMO his abilities are a big contribution to the game experience as they open new possibilites for deck construction. The same can be said about new Glorfindel and Loragorn, so:\n\n \n\nWell done, FFG!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69936-thank-you-ffg-for-giving-us-elrond/?do=findComment&comment=682355","commentId":682355,"userName":"richsabre","timestamp":1345973263,"content":"i agree completely. my shadow pack is on its way however ive been mentally building decks with elrond since his being spoiled the other month……one of the best heros in the game no doubts there and even more so for his ally paying ability.\n\ni hoped and predicted (correctly for once) that he would have the abilities he did, and im really pleased that ffg took notice of his mistrel history, and tapped into some nice lore\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69936-thank-you-ffg-for-giving-us-elrond/?do=findComment&comment=682513","commentId":682513,"userName":"leptokurt","timestamp":1345991323,"content":"richsabre said:\n\ni agree completely. my shadow pack is on its way however ive been mentally building decks with elrond since his being spoiled the other month……one of the best heros in the game no doubts there and even more so for his ally paying ability.\n\ni hoped and predicted (correctly for once) that he would have the abilities he did, and im really pleased that ffg took notice of his mistrel history, and tapped into some nice lore\n\nrich\n\n\n\nWoah, you look… different!\n\nYou're going to enjoy this one. Great scenario, good cards, and secrecy in full mode! If your predictions start coming true, couldn't you perhaps predict a tactics hero that provides us with additional resources?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/69936-thank-you-ffg-for-giving-us-elrond/?do=findComment&comment=682544","commentId":682544,"userName":"richsabre","timestamp":1345995839,"content":"leptokurt said:\n\nrichsabre said:\n\n \n\ni agree completely. my shadow pack is on its way however ive been mentally building decks with elrond since his being spoiled the other month……one of the best heros in the game no doubts there and even more so for his ally paying ability.\n\ni hoped and predicted (correctly for once) that he would have the abilities he did, and im really pleased that ffg took notice of his mistrel history, and tapped into some nice lore\n\nrich\n\n \n\n \n\nWoah, you look… different!\n\nYou're going to enjoy this one. Great scenario, good cards, and secrecy in full mode! If your predictions start coming true, couldn't you perhaps predict a tactics hero that provides us with additional resources?\n\n\n\nyes ive aged a bit since this morning haha\n\nwell my psychic abilities only go so far, but if we all think hard enough maybe it will happen……..lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]\n\nseriously though i do hope your idea of the hero that gains resources everytime they damage/kill an enemy happens, and i guess it probably will\n\nrich"}]}