{"url":"https://community.fantasyflightgames.com/topic/70017-shadow-and-flame-2b/","title":"Shadow and Flame 2B","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/70017-shadow-and-flame-2b/?do=findComment&comment=683192","commentId":683192,"userName":"Nerdmeister","timestamp":1346085741,"content":"The card text on this quest card says: \"Forced: If at least 1 hero committed to the quest this round, place 4 progress tokens on The Rear Guard (bypassing any active location) at the end of the quest phase\"\n\nNow I´d say that this means if you have just passed quest card 1B in the quest phase and committed a hero to do so, then, according to the wording, you would place the first four progress tokens on quest card 2B almost immediately. Seeing as the quest phase isn´t over when you have placed the last progress token on 1B and (even if the card wasn´t active at the time) the trigger to 2B´s special ability is still valid at this point.\n\nOur group got into a discussion about this but we couldn´t reach a definite conclusion. So what is your guys´ take on this issue?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70017-shadow-and-flame-2b/?do=findComment&comment=683214","commentId":683214,"userName":"starhawk77","timestamp":1346087364,"content":"Yes, you will place four progress tokens on Stage 2B during the round in which it is revealed (assuming you complete Stage 1B via conventional questing as opposed to, say, Legolas' effect during the combat phase). \n\nAs soon as you place the ninth token on Stage 1B, you immediately advance to the second stage. Then, the quest phase ends, and the forced effect on Stage 2B triggers. If you committed any heroes to the quest during the preceding quest phase, you will satisfy the forced trigger and get four extra tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70017-shadow-and-flame-2b/?do=findComment&comment=683230","commentId":683230,"userName":"Nerdmeister","timestamp":1346088562,"content":"Thanks. That was my assumption as well. Nice to have back-up from the community happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"}]}