{"url":"https://community.fantasyflightgames.com/topic/70078-treasures-rules/","title":"Treasures Rules","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/70078-treasures-rules/?do=findComment&comment=683857","commentId":683857,"userName":"Dain Ironfoot","timestamp":1346165107,"content":"Okay, rule two (page 3) states: \"The specific treasure card belongs to a treasure set that is listed in the setup instructions for the scenario currently being played.\" \"For example, Tom has discovered  the treasure card Sting in the We Must Away, Ere Break of Day scenario. While setting up to play the Over the Misty Mountains Grim scenario, he sees that Sting belongs to a treasure set that can be used during that scenario. Therefore, he ads 1 copy of Sting to his deck.\"\n\nSo, since quest 3 doesn't list the appropriate icon for its setup, that leads me to believe treasures can't be used in quest 3.\n\nBut, on page 6 of the rule booklet, it tells us we can use the treasures in quest 3 (even though the corresponding treasure icon is missing from the quest card).\n\nAm i missing something?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/70078-treasures-rules/?do=findComment&comment=683866","commentId":683866,"userName":"Dain Ironfoot","timestamp":1346166138,"content":"well, caleb e-mailed me very quickly:\n\n \n\n\"Hi Matthew,\nThe information in the rule booklet is correct. The treasure cards Sting, Glamdring, and Orcrist are playable in both the Over the Misty Mountains Grim and Dungeons Deep and Caverns Dim scenarios.\nCheers,\nCaleb\"\n\nof course, my position is that the rules contradict…but good to know that we can use them in both 2 and 3…it'd be lame otherwise!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70078-treasures-rules/?do=findComment&comment=683869","commentId":683869,"userName":"starhawk77","timestamp":1346166445,"content":"Well, the treasure sets are only listed in the rules booklet, so that makes sense. Neither A Short Rest nor Out of the Frying Pan display the treasure set icon, so the printed setup instructions are the only guide."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70078-treasures-rules/?do=findComment&comment=683889","commentId":683889,"userName":"Dain Ironfoot","timestamp":1346168208,"content":"now that i look at it more closely, you are right. both orc heads kinda look the same, especially when they are so tiny on quest 2!\n\nmyself, and a few others i know, interpreted that sentence to mean: you can only use the treasures if the quest has the matching encounter set icon, hence our confusion."}]}