{"url":"https://community.fantasyflightgames.com/topic/70198-making-the-battle-of-laketown-winable/","title":"Making &quot;The Battle of Laketown&quot; winable","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/70198-making-the-battle-of-laketown-winable/?do=findComment&comment=685132","commentId":685132,"userName":"BoundForGlory","timestamp":1346330809,"content":"I really like that this quest is so challenging.  Thematically, it should be a very challenging quest.  Personally, I won't care if I never save Lake-town from being destroyed, but I want a decent chance to defeat Smaug.  (I'm not as uncaring a human being as I made that sound.)\n\nHowever, I have heard that it is nearly impossible to defeat Smaug, given the difficulty of the quest.\n\nSince Smaug is immune to player card effects, I think that the way I'm going to defeat Smaug is to create a custom \"Black Arrow\" objective card that, under the exact right conditions, can take Smaug down.\n\nWhat about something like this:\n\n \n\nThe Black Arrow - Objective\n\nWhen Revealed: Attach to a hero with Ranged.  Otherwise, discard this objective and deal 1 damage to Lake-Town.\n\nCounts as an attachment with the text: \"Action: If attached hero is attacking, and his owner has no cards in hand, discard this card to make him attack +20.\"\n\nShadow:  Place 2 progress on the current quest and resolve the \"When Revealed\" text on this card.\n\n \n\nI know it makes killing Smaug a lot easier, but I think I'm going to need it.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/70198-making-the-battle-of-laketown-winable/?do=findComment&comment=709979","commentId":709979,"userName":"BoundForGlory","timestamp":1350339472,"content":"Now that The Black Arrow has been previewed as a player card, I won't need to use this objective.  But I still think I'm going to need something else to make this winnable.\n\nBut I'll wait until I've played this a half-dozen times before seeing exactly what I'm going to need."}]}