{"url":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/","title":"Adding another hero!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685223","commentId":685223,"userName":"Riley.reba7","timestamp":1346341157,"content":" would adding another hero make solo player a little more manageable, or no? (so a total of 4 heros)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685235","commentId":685235,"userName":"Captain Poe","timestamp":1346341971,"content":"I think so. Yes. I've thought of trying this. I've heard players who didn't know that there was a limit try this before, and apparently its much easier, despite the boosted starting threat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685266","commentId":685266,"userName":"Bullroarer Took","timestamp":1346344307,"content":"I played around with adding a 4th hero and eventually dropped it.  Others have too, there are threads on this topic at BGG.  I tried it in the early days when the card pool was small and the paths to success limited.  I don't feel that you really need to add a 4th hero anymore except for a few of the quests, and even those can be beaten with enough luck and experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685289","commentId":685289,"userName":"richsabre","timestamp":1346345826,"content":"basically the answer is yes. of course the starting threat would go up, but say you put in a glorfindel or bifur, and you should be ok\n\nin addition to this you are collecting 4 resources per turn instead of 3, potential to run a 4 sphere deck without songs\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685436","commentId":685436,"userName":"Zalrus9","timestamp":1346365104,"content":" While I would agree that adding another hero would help, but the threat is still a problem. There are some scenarios that are unplayable because of the high doom rating. It will see if I can try another hero though. Perhaps SpiritFindel and Loragon might help things."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685488","commentId":685488,"userName":"zeb","timestamp":1346378028,"content":"You could always house rule that starting threat is 3/4 of total threat, or add only the 3 heroes with the highest threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685581","commentId":685581,"userName":"lpknight21","timestamp":1346398561,"content":" I don't see why you need 4 heroes unless you are playing the Hobbit expansion… I think 3 heroes for solo play is good… that is what I play and I enjoy the challenge and do win quite a bit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70206-adding-another-hero/?do=findComment&comment=685590","commentId":685590,"userName":"booored","timestamp":1346400353,"content":"you can house rule anything… we for example have a number of cards banned or restricted or limited to once per turn… there is no \"rules\" in this, as it is not competitive it is all about your user experience.. if you want top lay with 8 heroes.. do it.. nothing is stopping you.  For me though, I like to work inside the official rules for major gameplay mechanics, all our house rules make the game harder not easier.\n\nI find it funny that only a few days ago me and G were getting flack for using multiple copies of core to \"make the game easier\" .. then this thread :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] talking about grossly reordering the rules.\n\nStill as I said.. more power to you. This is co-op.. so do w/e. If you go to BGG there is a very comprehensive 4 hero rule variant that has been refined over the last year that you should look it."}]}