{"url":"https://community.fantasyflightgames.com/topic/70234-the-new-gandalf/","title":"The new Gandalf","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/70234-the-new-gandalf/?do=findComment&comment=685480","commentId":685480,"userName":"CaffeineAddict","timestamp":1346377080,"content":" I've seen several less-than-thrilled comments about the new Gandalf, so I thought I would share my experience -\n\nlast night I modified my main deck (having recently received Shadow and Flame and The Hobbit), a spirit-lore Frodo, Aragorn & Glorfindel deck, to use the new Gandalf in place of the original, and had a go at the new quests (solo).\n\nThis guy is a complete tank. I paid the threat cost of keeping him around for most of the game, and he just kicked ass. Took down Durin's Bane 2-0, and smashed all three hobbit quests (I had previously managed to win the first two with a dwarf deck, but failed to riddle effectivley before running out of cards in the last).\n\nfollowing this i decided to try the modified version running through the quests from the start -\n\nPassage through Mirkwood - won (72)\n\nJourney down the Andiun - won (97)\n\nEscape from Dol Guldur - 1 Loss, 1 win (162)\n\nthis is the first time i've ever beaten dol guldur solo (or att all, in fact), so i was really pleased with this (frodo was my captured hero, and my starting hand contained henamarth riversond and light of valinor. game went well from there.)\n\nThe Massing at Osgiliath - won (128)\n\ngoing to continue running through the current quests over the weekend.\n\nmy deck is now a slight variant of one i've posted before:\n\nHeroes (3):\nGlorfindel (Spirit)\nFrodo\nAragorn (Lore)\n\nAllies (20):\n2 x Henamarth Riversong\n3 x Arwen Undomiel\n3 x West Road Traveller\n3 x Master of the Forge\n2 x The Riddermark's Finest\n2 x Bofur\n2 x Northern Tracker\n3 x Gandalf (Hobbit)\n\nAttachments (19):\n3 x Unexpected Courage\n3 x Ancient Mathom\n3 x Light of Valinor\n2 x Burning Brand\n3 x Asfaloth\n3 x Fast Hitch\n2 x Song of Wisdom\n\nEvents (11):\n3 x Elrond's Council\n3 x Daeron's Runes\n2 x Dwarven Tomb\n3 x A Test of Will"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70234-the-new-gandalf/?do=findComment&comment=685515","commentId":685515,"userName":"richsabre","timestamp":1346387995,"content":"both have their uses- in my decks i have 2 old and 1 new\n\nthe new one combos well with aragorns threat reset, so hes good in my flight to the ford deck which is centered around threat manipulation\n\ni won the first hobbit quest with that deck, but i admit the hero out of the two types was the old one\n\nstill i certainly wouldnt say he was a bad card…he's very good- just doesnt fit into every deck like the old one\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70234-the-new-gandalf/?do=findComment&comment=685579","commentId":685579,"userName":"CaffeineAddict","timestamp":1346398163,"content":" hes certainly not for every deck, thats true, but given a chance he can really shine.\n\nnot sure id want to mix the two versions in one deck, though - wouldnt that make the play of the deck quite inconsistent?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70234-the-new-gandalf/?do=findComment&comment=685592","commentId":685592,"userName":"lleimmoen","timestamp":1346400481,"content":"I am very impressed by the new version of Gandalf, especially since I was also very impressed by the original one. And this one in comparison is very different. I would say the core version works better in decks that have trouble dealing with enemies or lowering threat, the Hobbit fits better in decks which need a constant help with questing and fighting but can manage threat excessively well. Then of course, some quests call for a particular strategy also."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70234-the-new-gandalf/?do=findComment&comment=685608","commentId":685608,"userName":"richsabre","timestamp":1346401963,"content":"CaffeineAddict said:\n\n hes certainly not for every deck, thats true, but given a chance he can really shine.\n\nnot sure id want to mix the two versions in one deck, though - wouldnt that make the play of the deck quite inconsistent?\n\n\n\nwith 1 new and 2 old you can keep the new in for a while lettting threat get up, then take him out and proceed to sneak attack the other two to get threat back down\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70234-the-new-gandalf/?do=findComment&comment=685659","commentId":685659,"userName":"Mr Coffee","timestamp":1346408022,"content":"lleimmoen said:\n\n \n\n… I would say the core version works better in decks that have trouble dealing with enemies or lowering threat, the Hobbit fits better in decks which need a constant help with questing and fighting but can manage threat excessively well. ….\n\n \n\n \n\nThis seems like spot-on analysis to me.  The one thing I was going to mention was that I'm sure that most of us have used the core version to repeatedly bail us out of a tight spot here or there, but it's usually a very short lived (albeit useful) effect…  The ability/option to use the new one repeatedly provided some great counterbalance to the core version.  Essentially, it's \"what can you do for me right now\" versus \"what can you do for me over the next few turns\"…\n\n \n\nI LOVE having options!"}]}