{"url":"https://community.fantasyflightgames.com/topic/70307-questions-primarily-hobbit-but-one-shadow-and-flame-too/","title":"Questions - primarily Hobbit but one Shadow And Flame, too","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/70307-questions-primarily-hobbit-but-one-shadow-and-flame-too/?do=findComment&comment=686244","commentId":686244,"userName":"Stenun","timestamp":1346521580,"content":"I think I know the answer to most of these but I thought I'd ask them all anyway to make sure.\n\n \n\nCan Bilbo (Hobbit Deluxe) Baggins pay 1 resource to give 1 to Bifur?  What if he's in the Riddle Zone in the thrid quest?\n\n \n\nSpeaking of the Riddle Zone … no cards can be played on Bilbo at all, right?  Not even Sting?\n\nSo three failed Riddles and it's all over?\n\n \n\nIf Troll Key and Troll Purse come up as a Shadow card, they are discarded for no effect even if there are Trolls in play, right?  The rules state that only the Shadow text applies when an encounter card is drawn for a Shadow card and Troll Key and Troll Purse have no shadow texts …\n\nIt makes the scenario something of a crap shoot …\n\n \n\nFinally, the Shadow And Flame question, can The Balrog have more than 27 wounds on him?  It won't destroy him because he's Indestructable but there's nothing in the rules about not having more wounds than you health.  And so if he can have, say, 28 wounds, is he considered to have -1 health when using Dark Pit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70307-questions-primarily-hobbit-but-one-shadow-and-flame-too/?do=findComment&comment=686295","commentId":686295,"userName":"starhawk77","timestamp":1346535738,"content":"1. Bilbo can certainly transfer his resources to Bifur during the first two Hobbit scenarios. Nothing prevents Bilbo from doing so, and Baggins resources are just as good as any others (albeit with more limited applications). The riddle area question is a bit trickier, but I would argue that you can indeed transfer Baggins resources under those circumstances. While in the riddle area, Bilbo is immune to player card effects. As such, he \"ignores the effects of all player cards.\" However, paying a resource from a hero is the COST of Bifur's ability (as opposed to the effect, which consists of adding a resource to Bifur's pool), and the immunity rules do not mention anything about being unable to pay costs. As worded, then, Bilbo can transfer his resources to Bifur even while the hobbit is in the riddle area.\n\n2. Correct, no cards may be played on Bilbo. No Sting, no Dunedain Warnings, etc. Three failed riddles (or two, if you fail both in the same turn and force Bilbo to take an undefended attack) will end the game.\n\n3. Correct, based on prior rulings (Banks of the Anduin, most notably). However, FFG has already issued some unique clarifications for other aspects of the Key/Purse, so keep an eye out for official word on this. It makes acquiring the treasures slightly more challenging, but that's just the nature of a random encounter deck (plus, the treasures aren't actually necessary--they're just cool little bonuses).\n\n4. There aren't any rules precedents governing damage on DB, but it seems like you can indeed place damage counters on the Balrog in excess of its health. On p.19 of the core rules, the diagram shows 6 damage counters being placed on a Silverlode Archer (even though that card only has 1 hit point). The only difference is that DB is not destroyed by such excess damage. With DB reduced below 0 hit points, the action on Dark Pit would then be merely a formality."}]}