{"url":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/","title":"Vote on the heroes we play (in our 100 play challenge) ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=690925","commentId":690925,"userName":"DrNate","timestamp":1347276647,"content":"Hello everyone! I am going to jump into the 100 game exercise with Lord of the Rings, inspired by Wojo's insightful (and just delightful) thread [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=661701&efpag=0] \n\nBased on the experiment presented on Board Game Geek [http://www.boardgamegeek.com/geeklist/142757/the-100-play-challenge-in-support-of-deeper-explor] brave adventurers choose a game and play it 100 times (not in a row or all at once, though) and during/after each play, take notes based on what is going through your head or what is happening. Hopefully, by the end of the experience, we'll have had a good time, gained a lot of gaming wisdom, and maybe even come up with one (pair of) deck(s) to rule them all.\n\nTo make things a little different from just treading the same ground as those before me, I am doing three special things:\nFirst, this will be Nate and Zackery's excellent adventure. Every game will be a two-player affair, we'll see if our friendship can survive\nSecond, We're going to play the quests in order of publication. However, there will be no moving on to the next quest until we defeat the quest that we are currently on. How many quests can we defeat before the 100 game \"timer\" runs out?\nThird, and the point of this post, we're going to pick some of our heroes based on what you tell us to pick! I'm throwing open a vote, as follows:\nPlease pick and post the names of four heroes that you think we should use in this 100 play experiment. It can be based on power, winnability, your personal favorites, card art, spheres you think we should use; vote for whichever four heroes strike your fancy.\n\nWe'll get underway in about a week, so stay tuned and please vote."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=690928","commentId":690928,"userName":"richsabre","timestamp":1347277149,"content":"1.Frodo- how can you lotr without the most important character tolkien ever created?\n\n2.strider aka lore aragorn. threat reset one of the most combo-friendly actions in the game, arts amazing, and themes great, he also combos amazingly with frodo\n\n3.glorfindel spirit- such a different type hero to all the others, and again goes well with 1 and 2 - those 3 actually make up my flight to the ford deck that i use most often\n\n4. beorn…..just becuase he's fun- im also using him in a deck with strider and glorfindel to good results\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691029","commentId":691029,"userName":"Dam the Man","timestamp":1347288637,"content":"No hobbits!\n\nThat's my one rule (to rule them all)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691030","commentId":691030,"userName":"richsabre","timestamp":1347288694,"content":"Dam said:\n\nNo hobbits!\n\nThat's my one rule (to rule them all).\n\n\n\ndam…..i can never understand how you manage to play this game given how much you despise hobbits! lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691032","commentId":691032,"userName":"Dam the Man","timestamp":1347288797,"content":"Hey, no hobbits in any of my decks means I don't have to see them at all. I just imagine they've been annihilated (I get all warm inside at that picture). Preferrably after horrible torture."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691206","commentId":691206,"userName":"Mr Coffee","timestamp":1347302045,"content":"Since 4 is the stipulation, I will do from each of the four main races from LOTR- Man, Elf, Dwarf, Hobbit:\n\n1)  Hobbit:  Bilbo - I've never been a Frodo believer…  I'll take consistant card-draw over having my threat get jacked up to \"save my bacon\" ANY day…\n\n2)  Elf:  Glorfindel (spirit)- lore-wise, one of my favorite Tolkien characters.  He's like that guy that shows up in every group picture you take….  \nNeed someone to duel a balrog?  He'll handle it.  \nNeed someone to bring down the Witch-king's realm?  He sent the wraith crying back home to daddy Sauron… (then prophecied his death, as a big F.U.)\nNeed a Hobbit saved from a handful of Nazgul?  Glorfindel will take care of that during the commercials of the football game….\n\nGame-wise, Glorfindel has the BEST tailor-made attachments (LoV and Asfaloth) this side of Aragorn, meaning he can quest, do direct progress tokens to locations, and either defend or attack… all in a single turn for the grand total of 5 threat and 3 resources.  Tell me who else has that kind of value??? \n\n3)  Man:  I really want to say Aragorn.  Feel the need to say Aragorn.  He's….. well, damnit, HE'S ARAGORN!         But I have to admit that I use Theodred a lot more than Aragorn….  that resource.  Just.  So.  Addictive…..\n\n4)  Dwarf:  Torn between either Dain or Bifur… but since Dain is pretty exclusive to an all-dwarf deck, and I already mentioned one Lore hero (Bilbo above), I'll request Thalin, so we can get one of each of the spheres on my list. (But Bifur is my favorite…. shhhh… don't tell the other dwarves.  They're kinda jealous folk)…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691250","commentId":691250,"userName":"Pharmboys2013","timestamp":1347306392,"content":"Dwarfy Recommendation if you want to do dwarf-like things:\n\n(Leadership) Dain Ironfoot -  The dwarfy master.  His usefulness is well documented, plus he has all kinds of new toys to boost up from the hobbit box.\n\n(Spirit) Nori - Second only to Dain in regards to the best dwarfy dwarfs.  His ability reduces your threat supa fast replacing card spaces you would normally waste with Galadrim's Greeting or Elrond's Counsel.  Pretty solid stats to boot and awesome artwork.  all good things with this card\n\n(Lore) Ori- decent stats (wish his health was a tad higher altho) and an always useful effect.  plus you're obviously using Nori and they both rhyme! how fantastic is that?\n\n(Tactics) Thalin-  Great ability plus no one ever uses him anymore i feel so i want to give him some loving."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691305","commentId":691305,"userName":"GrandSpleen","timestamp":1347312755,"content":" 4 heroes, 4 spheres… seems like this is the wise way to go.\n\nLore: Bilbo, because I can't seem to play the game without him.  Very useful ability, buuuut hard to find a use for him until you get the right attachments on him (cf. other heroes who are useful even without attachments…).  Still, one of my favorite heroes.  Just make sure you bring Burning Brand, Dunedain Warning, and Fast Hitch!!\n\nSpirit: Eowyn.  I think everyone rightly choose Spirfindel here, but I don't own him yet so I can't in good conscience put him down for my vote!  Eowyn is still the strongest quester in the game.  Potential for 6 WP per round in a 2-player game.\n\nTactics: Gimli.  I almost said Legolas, because his ability sorta makes up for the lack of WP in Tactics heroes.  But Gimli is versatile (tank, slayer, and OK questing -- better with Dain present) and I don't have any dwarves on my list!\n\nLeadership: Aragorn.  Also versatile, especially once you get Celebrian's Stone on him.  And other Aragorn attachments (which I also do not own yet).\n\nWell, I didn't include any Elves… oh well, those are my votes!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691433","commentId":691433,"userName":"bollywongaloid","timestamp":1347332970,"content":"I have a thing for short men with beards so here we go:\n\n1.  Dain- his ability too good to pass up on if ur considering dwarfy decks\n\n2. Thalin- his ability to damage enemies as they come out makes me feel all warm and fuzzy (and with Dain ready you still get 2 willpower down)\n\n3. Dwalin- Good threat control in a lot of cases, but mainly because I love the artwork\n\n4. Bifur -  his ability is handy and I find myself using it often esp. in a 2 player game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=691929","commentId":691929,"userName":"Zalrus9","timestamp":1347392887,"content":"1) Beorn! He's a cool guy, and why not have a giant bear-man to kill things with\n\n2) Elrond! Don't just let him order your adventurers around! Make him go as well. Aside from the high threat cost, he's a pretty cool guy.\n\n3) Nori! If he's rowdy enough to be drinking in his picture, you know he itching for a quest! and he's got mad threat reduction as well.\n\n4) Thorin Oakinshield! King of the dwarves? Why not?\n\nThat's all I have right now. I'll see if I can think of any more"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=692066","commentId":692066,"userName":"lleimmoen","timestamp":1347422879,"content":"Pharmboys2013 said:\n\nDwarfy Recommendation if you want to do dwarf-like things:\n\n(Leadership) Dain Ironfoot -  The dwarfy master.  His usefulness is well documented, plus he has all kinds of new toys to boost up from the hobbit box.\n\n(Spirit) Nori - Second only to Dain in regards to the best dwarfy dwarfs.  His ability reduces your threat supa fast replacing card spaces you would normally waste with Galadrim's Greeting or Elrond's Counsel.  Pretty solid stats to boot and awesome artwork.  all good things with this card\n\n(Lore) Ori- decent stats (wish his health was a tad higher altho) and an always useful effect.  plus you're obviously using Nori and they both rhyme! how fantastic is that?\n\n(Tactics) Thalin-  Great ability plus no one ever uses him anymore i feel so i want to give him some loving.\n\n\n\nIf I were to choose Dwarves, I'd pick the same, although I now hardly ever use Tactics Dwarf heroes. Among those Thalin is interesting and gets better with more players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=694801","commentId":694801,"userName":"DrNate","timestamp":1347823928,"content":" Thanks for the feedback so far. More is welcome, but in the meantime, I have a question: \n\nThe #1 vote-getter (it's a tie, but) is Thalin. Is he super awesome and I just can't see it? Can someone enlighten me?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=695081","commentId":695081,"userName":"richsabre","timestamp":1347857230,"content":"DrNate said:\n\n \n\n Thanks for the feedback so far. More is welcome, but in the meantime, I have a question: \n\nThe #1 vote-getter (it's a tie, but) is Thalin. Is he super awesome and I just can't see it? Can someone enlighten me?\n\n \n\n \n\nits the 1 damage after an enemy is revealed from the deck- many uses for this\n\n- eastern crows die and dont surge\n\n-use it along with fresh tracks to do 2 damage, instant kill on many of the khazad goblins\n\n-use it along with expecting mischeif to do 3 damage, or with fresh tracks 4!\n\n-generally weakens enemies making even the tougher ones easier to bring down\n\n-with dain he becomes a useful quester with 2 willpower\n\n-he is a competant attacker, and with UC and an axe or two, he can really get through enemies quickly\n\nbut its mainly just the kill-before-surge effect\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/70736-vote-on-the-heroes-we-play-in-our-100-play-challenge/?do=findComment&comment=695235","commentId":695235,"userName":"Redblock","timestamp":1347885425,"content":" Tactics - Hama, his toolbox ability does wonders vs almost every quest\n\nLeadership - Gloin, one of best resource makers, and still can quest. Just add some lore for healing.\n\nLore - Aragorn, threat reset and lots of support cards.\n\nSpirit - Eowyn…Still the one…."}]}