{"url":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/","title":"What&#039;s the consensus for solo play -- 1 sphere, 2 sphere or 3-sphere?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694170","commentId":694170,"userName":"Cunir","timestamp":1347722506,"content":"I normally play a 2 sphere deck for solo play, which i chop and change about depending on the quest. But the more i play, the more i want a deck that can do pretty good against everything it goes up against. and that means i probably need to work on a 3-sphere deck.\n\nwhat does everyone else play? can you build a good 2-sphere deck that can beat most quests? what are the spheres that you use? or maybe a 2-sphere secrecy deck? i was think that might work sometimes too. especially now we're getting some heroes with extremely low costs (so one day we might even be able to have a good 3 hero secrecy deck)\n\ni'm guessing that 99% of us have given up on assembling a solo deck made up of only 1 sphere. unless you splash in a few songs and other cards.\n\nor maybe i could do a 3 sphere deck, but with some of the 4th sphere splashed in as well, with songs. has anyone tried that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694173","commentId":694173,"userName":"richsabre","timestamp":1347722972,"content":"depends on different things -for instance i can run a good 4 sphere deck with elrond in and have the tactic cards as allies\n\nin general i tend to run a 3 sphere deck with the following - leadership lore and spirit\n\nwith the songs and narivs belt added with master of the forge and/or stargazer i can pretty much have a tri sphere deck up and running pretty swiftly\n\ni tend to always use tactics with dwarves,so they often end up with a 4 sphere deck with narivs belt in play and some songs as back up and perhaps hammermith in there just in case.\n\n \n\nall of the above wins consistently, even the challenging quests in the hobbit….ive pretty much sticked with the same decks for a while now as i really like them - flight to the ford (frodo/glorfindel/strider), dwarven deck (dain/thalin/bifur) and more recently and rather interesting a deck with beorn, strider and glorfindel\n\nnot done much secrecy yet as i dont feel like its been expanded enough on for solo play\n\n \n\noverall i m going to say 3 or 4 sphere, though i see me playing more 4 sphere as the card pool grows\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694439","commentId":694439,"userName":"DevastazioneH88","timestamp":1347779024,"content":" I almost always play 3 sphere leadership, tactics, spirit decks for solo play… modifiying a few cards depending on the quest (in a journey to rhosgobel my three sphere deck becomes a four sphere one)…up to now I built a few decks…my tops (more than tops these are the decks with which I got to defeat all the scenerios multiple times) are a rohan based deck with theodred, hama and eowyn, an elrohir/elladan one with the twins and spirit glorfindel, and an eagle deck with theodred legolas and eowyn…\n\nas for the question about the scenario beating consistency… I don't think you can run a 2 sphere deck in solo play able to defeat all the scenarios consistently…at least this is my experience…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694443","commentId":694443,"userName":"richsabre","timestamp":1347780030,"content":"DevastazioneH88 said:\n\nas for the question about the scenario beating consistency… I don't think you can run a 2 sphere deck in solo play able to defeat all the scenarios consistently…at least this is my experience…\n\n\n\nyou can beat a fair amount of them though- i played lore/spirit for quite a while and was able to beat just about all of the core set and mirkwood cycle consistently apart from dol guldur and return to mirkwood which in my opinion doesnt even count as solo quests.\n\nin dwarrowdelf i can beat all but the last one consistently….in fact i think that lore/spirit is about the most powerful combo of spheres in the game\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694452","commentId":694452,"userName":"Ranger of the Force","timestamp":1347781590,"content":"I prefer two-sphere, but that is mainly because I believe that three+sphere tend to make the deck peform more slowly early.  For you three+ sphere players out there, what are you using card-wise that overcome this deficiency…mostly songs with Lore for Rivendell Minstrel?  If so, how may minstrels and how many songs?  Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694456","commentId":694456,"userName":"DevastazioneH88","timestamp":1347781896,"content":" yeah for a 2 sphere solo deck lore spirit is probably the best…though you still can't defeat all the quests consistently…surely not shadow and flame nor return to mirkwood…while with a 3 sphere deck that's more easily done.\n\nI do this thing which I call a \"campaign\"…I build a deck around a theme (be that a character, a race, a combo and so on) and then I start from the very first core set scenario (a passage through mirkwood) to see if that deck works against all the quests (it was easier before…now the whole campaign takes quite a lot of time) and proceed to the second the third and so on, only after I defeat the quest at least three times also losing not more than three times (through shadows of mirkwood, khazad dum and dwarrodelf and now the hobbit…). I obviously adjust the deck for every scenario (some cards are useless and some very useful depending on the scenario)…but of course the heroes are the same ! that's my way of bot playing and deckbuilding (and card testing)…for exemple I had built a deck with aragonr alladan and elrohir based on these character ability to ready themselves…boosting their respectives strenghts…it worked very well on a few scenarios but horribly on others (jounrey along the anduin and return to mirkwood for example…because of the high starting threat)…so I dropped it…\n\nThis is also my way to find out which decks are always usable and which aren't…because as I said, I like to campaign…and not to build a deck every single time I play ( I find that boring and non-constructive for a better understanding of the game and the whole gaming experience)\n\nthere's no need to say I skip escape from dol guldur which is totally random in single player unless you play with a deck built specifically …which I don't do…\n\nIn my experience as a solo playere…playing mainly 3 sphere leadership, tactics, spirit deck (it changes totally when I play 2 player games) I find the hardest scenarios (those that defeats me the most) are Return to Mirkwood and The Watcher in the Water…whichare yours guys ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694458","commentId":694458,"userName":"richsabre","timestamp":1347782010,"content":"Ranger of the Force said:\n\nI prefer two-sphere, but that is mainly because I believe that three+sphere tend to make the deck peform more slowly early.  For you three+ sphere players out there, what are you using card-wise that overcome this deficiency…mostly songs with Lore for Rivendell Minstrel?  If so, how may minstrels and how many songs?  Thanks.\n\n\n\nRanger of the Force said:\n\nI prefer two-sphere, but that is mainly because I believe that three+sphere tend to make the deck peform more slowly early.  For you three+ sphere players out there, what are you using card-wise that overcome this deficiency…mostly songs with Lore for Rivendell Minstrel?  If so, how may minstrels and how many songs?  Thanks.\n\n\n\nif i use say lore+spirit+leadership i will usually have no leadership hero, but i will have 2 minstrels, 1 master of the forge, and 3 song of kings. in my flight deck i will have strider so giving him celebrians stone and sword that was broken gives him all the spheres in play without any songs\n\ni couple all this with some fast card drawing mechanics\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694459","commentId":694459,"userName":"richsabre","timestamp":1347782164,"content":"DevastazioneH88 said:\n\nIn my experience as a solo playere…playing mainly 3 sphere leadership, tactics, spirit deck (it changes totally when I play 2 player games) I find the hardest scenarios (those that defeats me the most) are Return to Mirkwood and The Watcher in the Water…whichare yours guys ?\n\n\n\nkeeping my most played spirit/leaderhip/lore deck (with the leadership just splashed in) i find the hardest to be those that require some quite powerful attacks - obviously which is tactics game…..this can usually be overcome by having strider, glorfindel, gildor, haldir etc in play, but its certainly not consistent\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694460","commentId":694460,"userName":"DevastazioneH88","timestamp":1347782390,"content":" for ranger of the force : You have to focus on one sphere and add cards that help your strategy from the other two…and then add the songs from that sphere…and obviously steward of gondor (if you want to focus on two spheres you may you use very few cards from the third)…I give you as an exemple the eagle deck I'm using at the moment…I have theodred (resource boost) legolas and eowyn (willpower)…to speed up everything I have radagast (resources, willpower) 3x steward of gondor (resources) the eagles are coming (draw), Gandalf (draw, threat, willpower), 3 or 2x song of battle (further resource boost and tactics heromaking to play support of the eagles), ancient mathom (draw), a test of will and dwarven tomb (cancel) and feint (combat cancel)…these are all cards useful to play easily at the beginning and prepare yourself…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694464","commentId":694464,"userName":"richsabre","timestamp":1347783072,"content":"and remember you have a mulligan which is worth using if you dont draw any key cards in your set up hand"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694537","commentId":694537,"userName":"Cunir","timestamp":1347795569,"content":"what do you do with all the high cost cards though (costing 3 or more), when you have a 3-sphere deck. do you just not bother including any of them? by the time you've got enough tokens to pay for them i would imagine that it would be too late."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694546","commentId":694546,"userName":"John85","timestamp":1347796201,"content":"richsabre said:\n\nand remember you have a mulligan which is worth using if you dont draw any key cards in your set up hand\n\n\n\nLearning when to (and not to) take the mulligan is a BIG step toward better playing. You really need to understand your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694549","commentId":694549,"userName":"richsabre","timestamp":1347796390,"content":"Cunir said:\n\nwhat do you do with all the high cost cards though (costing 3 or more), when you have a 3-sphere deck. do you just not bother including any of them? by the time you've got enough tokens to pay for them i would imagine that it would be too late.\n\n\n\ni include usually only one copy of them, and only the very important cards of the deck such as sword that was broken and so on\n\ni usually do whatever i can to get steward out into play as soon as possible\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694559","commentId":694559,"userName":"Cunir","timestamp":1347797368,"content":"That's one of the things that puts me off doing a 3-sphere deck… you have to include a load of cards that dig through the deck to find stuff you need to improve your resources, so you can actually afford to pay more than 1 token for stuff (like those cards which look for the songs)\n\ni'd much rather include cards that can actually do things on their own, without needing another card to find them first. it's like playing a 2-card combo to do 1 thing.\n\nbecause what if you find the card at the beginning anyway, without needing another card to find it? -- you have just wasted a card\n\ni begrudge putting in the songs as well. because they dont help you fight or defend, or quest, or anything useful. they dont even generate resources. all they do is let you spend the resources that you've already got on something else. i know that is useful in it's own way, but it just seems a waste to play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694577","commentId":694577,"userName":"richsabre","timestamp":1347801261,"content":"i know what you mean, and have over the last few months tried many games with varying amont of song and song-related cards…\n\ni am tending to only use the 'splash sphere' song cards, so in my strider/frodo/glorfindel deck i will only splash the leadership in, so that only means 3 song of kings and the master of the forge that i have in anyways for asfaloth and others, and added to this is stargazer who is great in any noldor deck….so it all pretty much adds up to 3 card slots wasted max…\n\nas for the 3/4 cost cards, i do think that a deck is quite lost without at least a few of them. if i a trying to make a real winning deck, then i wouldnt have strider without the sword, or glorfindel without asfaloth, and i would always have fortune or fate\n\nalso with frodo i can play good meal to get a nice discount on some of the more expensive spirit cards\n\nstill, i think that some decks just need that extra few turns to get it going- the question is whether the deck is good enough to make it worth holding the staging area for a few turns\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694653","commentId":694653,"userName":"Redblock","timestamp":1347810771,"content":" You can get consistent 3 sphere dwarf deck with Narvi's Belt, or anything with Elrond in it, other builds are prone \"colorscew\" as they call it in some other TCG, you get too much cards from color you can't play, also multiple sphere decks have problem playing high cost cards (cost 3 and up)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=694701","commentId":694701,"userName":"Ranger of the Force","timestamp":1347815569,"content":"Redblock said:\n\n You can get consistent 3 sphere dwarf deck with Narvi's Belt, or anything with Elrond in it, other builds are prone \"colorscew\" as they call it in some other TCG, you get too much cards from color you can't play, also multiple sphere decks have problem playing high cost cards (cost 3 and up)\n\n\n\nThis is what has always held me back.  When I got into this game and was trying out various combinations, I did a three sphere deck (heroes of different colors) but it was really slow going getting the right resources when I needed them, especially against aggressive scenarios that start with cards in the staging area.  I understand the benefits of tri-sphere and have seen folks have varying degree of success with it, but I just can't see it working as well as two-sphere in my mind. \n\nIf I were doing it though, I would never do three heroes of different colors, rather I would pick two Lore ( to get minstrels out quickly) and one other sphere, plus the songs that cover the remaining weakness of the deck.  Would I be on the right track here?       "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71075-whats-the-consensus-for-solo-play-1-sphere-2-sphere-or-3-sphere/?do=findComment&comment=695129","commentId":695129,"userName":"DevastazioneH88","timestamp":1347864428,"content":" I almost never have these problems…if you put in the right cards you can play a lot of cards from each sphere…the eagles have high cost cards (Radagst, Eagles of the Misty Mountains, Descendant of Thorondor, Support of the Eagles) but I get to play all of them easily even though the heroes are from 3 different spheres…of course putting beorn in a 3 sphere deck without elrond would be useless…but that's another thing I guess…you need to find the right cards for every deck…"}]}