{"url":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/","title":"Petition to put &quot;Sleeping Sentry&quot; on a shadow card errata list.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696564","commentId":696564,"userName":"DurinIII","timestamp":1348043027,"content":"Sleeping Sentry sucks!\n\nOf all the shadow cards that exist in the game, Sleeping Sentry is by far the most over-the-top piece of garbage available. \"Shadow effect\"- discard all exhausted CHARACTERS! Really? This is beyond lame FF. At least errata it to say \"discard all exhausted allies\" or \"discard one exhausted hero if possible.\" My goodness, this card literally makes me quit every time it is pulled as a shadow card. I hate it, therefore, I will never play Road to Rivendell again. Please change some of these overpowered, silly, brainless, shadow effects. Come on, you get paid to develop card games, use your brains to dig a little deeper into more conditional effects.\n\nMy few thoughts. And by the way, I do sound a bit harsh because it is quite annoying to get very far in a scenario, to finally feel that you have the board set up quite nicely, only do find that all of your characters simply get discarded out of play and the game ends. I feel like I wasted a lot of time.\n\nJoseph"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696578","commentId":696578,"userName":"richsabre","timestamp":1348044511,"content":"i agree joseph, though i think that ffg will have taken our feedback since its release and decided it was a bad idea and im pretty sure we wont see many/ any more of these 'insta-kill' cards\n\nall the same i love road to rivendell, i like the 20 progress needed on 1b- its nice to have a long walk in the mountains lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]….but sleeping sentry is annoying\n\nso i guess i agree to an extent…so\n\n/signed\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696630","commentId":696630,"userName":"ClydeCloggie","timestamp":1348050834,"content":" Disagree. Yes, Sleeping Sentry is a hell of a Shadow effect, but it's part of the skill of a player to negotiate it.\n\nDenethor, A Burning Brand, Dunedain Watcher, Hasty Stroke, Shadow of the Past, Out of the Wild, direct damage to the attacking enemy enough to kill it before shadow effect resolution, ready-effects like Miruvor's, Boromir's etc. and most straightforward of all simply not questing with Arwen are some of the ways available to either not let it appear at all or at least not be fatal if it does.\n\nRoad to Rivendell would be a fairly straightforward run-to-the-finish quest without Sleeping Sentry. Because of its looming presence you can't just take the easy option and quest like mad. I actually think it makes Road to Rivendell a really well-designed quest.\n\nRoad to Rivendell is the current quest in my ongoing One Deck To Rule Them All campaign where I play a best-of-three against all quests released up to The Hobbit. It's 1-1 at the moment and in both games the way I dealt with Sleeping Sentry was pivotal. in the first game I decided to go all out on the quest after the first Sentry showed up really quickly, thinking the odds of pulling the second one from a nearly complete encounter deck would be in my favour. Game over that turn. Second game Denethor and Out of the Wild combined to negate the Sleeping Sentries before allowing me to race home. \n\nI have always liked this type of card in all CCGs /LCGs I have played: they affect your game plan simply because they exist, long before they actually hit the table, changing the complexion of the game completely even if the actual state of the game is complete run-of-the-mill. \"Oh, I only need 13 more quest points to win, two turns of hard questing and just one combat phase to negotiate!\" \"Yeah, but this is the Sleeping Sentry quest, remember?\" \"****. What's plan B?\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696638","commentId":696638,"userName":"richsabre","timestamp":1348051812,"content":"that is a good point clydecloggie, and part of the reason i do not fully agree with the post, however i signed as i agree that these instant kill cards need to be limited, as to me it throws off some of the fun….\n\ni like to compare it to dungeon quest….at least the 80s original one…..every card there is insta-kill and you have something like a 15% chance of winning. ive never won it once.\n\nnow obviously this isnt the same, however it shows what happens when these types of cards end up getting too much.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696641","commentId":696641,"userName":"ClydeCloggie","timestamp":1348052226,"content":" Oh yes, a game full of these cards would be stupid. But a game without them would be less interesting, too. And in this game, I can only think of Sudden Pitfall as another example of an almost guaranteed insta-kill. So let the sentry sleep!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696680","commentId":696680,"userName":"Cunir","timestamp":1348054978,"content":"it is brutal, but it does fit the story of the quest quite well. the whole point of the quest is that you're on this dangerous escorting mission and you know that you're going to be ambushed somewhere along the route. so you are expecting it. so you've got to tread super carefully. Anyone who exhausts a big chunk of their group when they know there could be a brutal ambush around any corner deserves to lose!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696737","commentId":696737,"userName":"CaffeineAddict","timestamp":1348060030,"content":"I played a game the other day where I hit sleeping sentry when questing (and sadly had nothing to counter it), followed by the second copy as a shadow effect in the combat phase. At that point any skill in deck building and playing is irrelevant, its play with the counters or lose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696749","commentId":696749,"userName":"DarthJalapeno","timestamp":1348061157,"content":" It's too harsh."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696773","commentId":696773,"userName":"RGun","timestamp":1348063201,"content":"I agree with clydecloggie.  The card fits very thematically into the quest and there are strategies/cards that can be used to negate it.  Even with this card the quest is one of the easier ones and I have one of my higher win rates on it, although one of my higher average scores as the cautious strategy needed to manage it results in some higher round counts (again thematic - you know you are going to be ambushed on the road to rivendell so you need to travel cautiously)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696785","commentId":696785,"userName":"DurinIII","timestamp":1348064167,"content":"Great comments all! Though, to those of you who disagree with my initial gripe, I am not advocating getting rid of the card entirely, just that it should have been a bit less harsh, but, I suppose you know this already! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=696873","commentId":696873,"userName":"player1761766","timestamp":1348072090,"content":"I like it, so wouldn't want to change it at all. As has been pointed out, you need to be expecting bad things to happen on the Road to Rivendell - otherwise we'll end up with \"just another Hills of Emyn Muil\" for everyone to complain about. Spicing it up with something like this is a good thing in my book. \n\nAlso, it's wonderfully thematic. Your sentry is sleeping - what do you think is going to happen to your exhausted party?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=697105","commentId":697105,"userName":"Narsil0420","timestamp":1348109002,"content":"It's like a crazy long overnight road trip where you are just fighting to stay awake but you can't stop because you know that orcs will kill you if you do…\n\nThis happens to me every time I drive to L.A…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=697226","commentId":697226,"userName":"flightmaster101","timestamp":1348131288,"content":"Narsil0420 said:\n\nIt's like a crazy long overnight road trip where you are just fighting to stay awake but you can't stop because you know that orcs will kill you if you do…\n\nThis happens to me every time I drive to L.A….\n\n\n\n \n\nStop driving through Compton."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=703445","commentId":703445,"userName":"GrandSpleen","timestamp":1349125492,"content":"Just had my first experience with this quest. Ugh. I see what the buzz is about. Since this quest gets a lot of hype, I knew what I was up against and went in prepared. Out of the Wild, Henamarth Riversong, Dawn Take You All, Rider of the Mark, Needful to Know, Rumour from the Earth, Denethor…. I was all about catching Sleeping Sentry before it could end us (2-player game).\n\n\nFirst game: Lost due to Sleeping Sentry. First one came out during staging and put one damage on Arwen. I intercepted the second one later on and moved it to the bottom of the deck with Denethor. Warg Lair caused a reshuffle of the encounter deck, and Sleeping Sentry came out on the next turn, finishing off Arwen. Things were in pretty dire straits even without SS though. Thanks to Crebain surge, Warg Lair, Goblin Spearman shadow effect and other nastiness, we had about 8 cards waiting for us in the staging area when Sleeping Sentry flipped out.\n\nSecond game: Lost due to Sleeping Sentry. First one came out during setup and exhausted everyone. We actually brooked this quite well and made it through to the second round with no real setbacks. On turn two, we were engaged with one enemy each. We used Dawn Take You All to discard the shadow card on the enemy engaged with Arwen's controller. This card ended up having no shadow effect. The other player’s card turned out to be Sleeping Sentry, causing a discard of 2 heroes. We opted to forfeit after that.\n\nI have to agree that this card doesn’t really do anything to add to the excitement of the quest. It’s not well matched to its name, thematically. Our sentries were very certainly alert and watching for this card, but we got boinked anyway. We hit the ground running, so to speak, but you can only be so prepared. It's more likely to come out in multiplayer games, and in multiplayer cames you are also less able to view the encounter deck ahead of time… rough!\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=703489","commentId":703489,"userName":"ArachneJericho","timestamp":1349134652,"content":"Here's an idea for making this card less harsh.\n\nOriginal: \"Shadow: Defending player must discard all exhausted characters he controls.\"\n\nFix: \"Shadow: If this attack is undefended, defending player must discard all exhausted characters he controls.\"\n\nIt's still harsh. Especially if Sleeping Sentry in its treachery form catches you just before an attack with it as the shadow card. But in most other circumstances, the harshness will be earned, because the player really will have opened themselves up for attack.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=703520","commentId":703520,"userName":"Dam the Man","timestamp":1349145079,"content":"GrandSpleen said:\n\n On turn two, we were engaged with one enemy each. We used Dawn Take You All to discard the shadow card on the enemy engaged with Arwen's controller. This card ended up having no shadow effect. The other player’s card turned out to be Sleeping Sentry, causing a discard of 2 heroes.\n\nThis. Two Enemies, one Feint, 100% chance you'll Feint the Enemy that doesn't have SS as Shadow card llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif] . Or you resolve the Enemies in wrong order, first one has the \"discard resource tokens\" Shadow effect that you have to cancel or be left without resources, meaning the second one has SS."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=704525","commentId":704525,"userName":"GrandSpleen","timestamp":1349299564,"content":" Had our first win with this scenario tonight.  \n\nSleeping Sentry was revealed as the first card during setup. We used Eleanor to cancel and replace, and what do you know! The second Sleeping Sentry came out. I now believe that this card CANNOT BE BEATEN. Threat went up by 7 on the first questing phase. Anyway, the card exhausted everyone during setup, BUT that meant both copies of Sleeping Sentry were in the discard pile. Nothing to worry about!\n\nThe game after that was not exactly smooth sailing, but we won in the end."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=704678","commentId":704678,"userName":"richsabre","timestamp":1349335187,"content":"GrandSpleen said:\n\n Had our first win with this scenario tonight.  \n\nSleeping Sentry was revealed as the first card during setup. We used Eleanor to cancel and replace, and what do you know! The second Sleeping Sentry came out. I now believe that this card CANNOT BE BEATEN. Threat went up by 7 on the first questing phase. Anyway, the card exhausted everyone during setup, BUT that meant both copies of Sleeping Sentry were in the discard pile. Nothing to worry about!\n\nThe game after that was not exactly smooth sailing, but we won in the end.\n\n\n\nyes- thats probably the best way to get the card, the bastard is when it comes as a shadow effect and guess who doesnt have any cancelling left?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=705736","commentId":705736,"userName":"Style75","timestamp":1349525801,"content":"Road to Rivendell is a really fun scenario provided you make one simple tweak to the encounter deck… remove Sleeping Sentry before you start playing. This card is so obviously broken I have no problem pretending it doesn't exist. Problem solved as far as I'm concerned.\n\nFor those who like their games a little harder, just replace sleeping sentry with another treachery from a different set. There's plenty out there that fit thematically and would provide a reasonable challenge without causing insta-kill rage quitting every time.\n\nSleeping Sentry? What sleeping sentry? Not in my encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=710895","commentId":710895,"userName":"Runix","timestamp":1350470008,"content":"I don't know why so many people here can't see the obvious:  this card is horribly broken, and a clear sign of bad design.  It's a \"You Lose\" card, plain and simple.  It does not make the game more exciting, it makes it incredibly, frustratingly random.\n\nThe \"solution\" is no better.  Yes, Denathor, Hennamarth, and most particularly A Burning Brand will take care of it.  But that's the problem:  once you have A Burning Brand in place, you never see another Shadow card ever again.  So it all comes down to putting A Burning Brand in your deck and then crossing your fingers and hoping you get it early.  That isn't strategy, that isn't tactics, that isn't subtle gameplay, it's dumb luck.\n\nOne clear problem with this game is how incredibly binary it is.  Both Encounter cards and player cards are a mix of incredibly powerful and incredibly weak effects, so that it comes down to whether you get your ridiculously overpowered cards out first (Steward of Gondor, A Burning Brand) or if the Encounter deck gets its horribly overpowered cards out first (Sleeping Sentry, pretty much any of the Trolls).\n\nIt's bad design.  It's not subtle or interesting, it's just stupidly random.  What I find to be particularly egregious is that the designers have quietly conceded to significant mistakes in player card design (read:  Zigil Miner), but can't be bothered to fix obviously broken Encounter cards like this one (or obviously broken quests like Rhosgobel, for that matter)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=710957","commentId":710957,"userName":"Cunir","timestamp":1350476572,"content":"i suppose, flavour-wise, it doesn't make much sense that your characters always die every time. why cant they just be wounded?\n\nit would be better if the card said something like \"add 1 wound to each exhausted character\". That way it is more like an ambush. Some characters might still end up dying, if they are already wounded or weak, but you have at least got a chance to survive it\n\ni might actually start playing that quest like that from now on, with that house rule. it's better than just abandoning the card altogether"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=711483","commentId":711483,"userName":"Ellareth","timestamp":1350550222,"content":"I think we need more \"sleeping sentry\".\n\n \n\nThat 1 trechery or shadow effects per adventure that tells you 'keep this card in mind, or you lose'\n\n \n\nTrechery cards deserve as much attention as enemies and locations when building a deck, yet most decks are more about 'yeah let's kill giant spiders and orc chieftan, slaying legendary Balrog and Watcher or two along the way' than 'let's watch out for trechery of our enemy'.\n\n \n\nBack in core set days, I needed to really watch who to quest and who to exhaust, how many hit points remained in my heroes because of direct damage cards (Orcs… Necro's Reach… Hummer shadow).\n\n \n\nBut when playing Mirkwood Cycle without Dol Guldur Orc set, Dwarrowdelf Cycle without Hazard of the Deep set, and Massing at Osgiliath, there is no tension at all, because all your questing characters are safe.\n\n \n\nWhat we need is a way for each sphere to be able to prepare for Trechery cards (so far Spirit and Lore are only ones to have it), and couple of really nasty trecheries per pack that needs to be dealt in different ways (like Sudden Pitfall, I like it in a way it forces you to not quest until you get atleast 1 questing ally, and not defend with hero without a cancel trechery.. just changes the way I play)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=713088","commentId":713088,"userName":"13edl@m","timestamp":1350861757,"content":"I have to agree with Ellareth on this one.  The card is by all means negatable.(Unlike some horrible treacheries) Think: A test of will, elenor, and hasty.  My play group has both won and lost to this scenario.  We have the technology to build better decks.  We can build them better, faster, stronger. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71318-petition-to-put-sleeping-sentry-on-a-shadow-card-errata-list/?do=findComment&comment=713097","commentId":713097,"userName":"Gunslinger83","timestamp":1350864922,"content":"I think we need more \"sleeping sentry\" type treachery cards in future scenarios. Why? Because every scenario should have some kind of \"motivator\" to keep you from just sitting around and not progressing until you have a comfortable set of allies and attachments in play. If you move along quickly, and build decks that quest well, you have a much smaller frequency of running into the sleeping sentries and hazardous pit type treacheries. I like the tension and pressure to move quickly that fear of a card engenders. It just means you can't be lazy and slow build and takes away some of your control, which I like.\n\n\nPluse, I feel like the effects are pretty thematic… especially with the flavor text on a quest card mentioning you being worn out from your journeys.\n\n \n\nI dearly hope FFG does not errata sleeping sentry, but rather makes more treacheries like it in the future.\n\n "}]}