{"url":"https://community.fantasyflightgames.com/topic/71343-new-lcg-player/","title":"New LCG player","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/71343-new-lcg-player/?do=findComment&comment=696802","commentId":696802,"userName":"farrlinn","timestamp":1348065863,"content":"Hi,\n\nAm more of a casual LCG player. My question is, do I need the small card sets over the big box expansions?\n\nCan I enjoy the big box expansions without purchasing all of the smaller card sets? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71343-new-lcg-player/?do=findComment&comment=696836","commentId":696836,"userName":"richsabre","timestamp":1348068916,"content":"Hello\n\nthe answer is yes you can, though it doesnt work the other way- you cant play the smaller packs without the corresponding deluxe pack\n\nbear in mind though that the later the deluxe pack gets released the more difficult it will be (power creep is of course inevitable to a point) - so having none of the chapter packs will make the quests very difficult indeed.\n\nalso most of the key cards are in the chapter packs - including heros. song cards, elrond, the new aragorn and glorfindel - all very powerful cards that the designers are keeping in mind when designing new packs\n\nso basically the less chapter packs you have the harder the quests will be as your card pool is smaller- this is of course a good business sense on ffg's behalf, but makes it harder for more casual players who dont want to buy many packs\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71343-new-lcg-player/?do=findComment&comment=697075","commentId":697075,"userName":"farrlinn","timestamp":1348102269,"content":" Thanks for the reply. The LCG is fun, but a bit hard for me to manage and buy all of the packs. I guess I am more of a board game guy.\n\n \n\nFFG just got a ton of money from me purchasinf X-Wing Miniatures! Now that is something I am willing to purchase again and again. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71343-new-lcg-player/?do=findComment&comment=697295","commentId":697295,"userName":"CJMatos","timestamp":1348138480,"content":" When I was introduced to this game, i thought \"hm… i'm not going to be hooked up like i did with Magic….\"\n\n \n\n \n\nGuess what happens now: I buy every single pack that comes out when it's available in my country. When I have spare time, I'm always trying to improve or design better decks, or even find someones which people had good luck to try them and try to improve them or my way of deck design.\n\n \n\nSo, if you stay with this LCG, which i recommend if you like the Tolkien's Middle Earth, you will get hooked up…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71343-new-lcg-player/?do=findComment&comment=698784","commentId":698784,"userName":"shoreless","timestamp":1348389024,"content":" Agreed! On a budget, though, I end up only buying one or two packs per month, so I will be perpetually behind until Xmas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71343-new-lcg-player/?do=findComment&comment=698870","commentId":698870,"userName":"ArachneJericho","timestamp":1348401158,"content":"You can also pick-and-choose chapter packs, especially if you're a \"one deck per cycle\" kind of person. I recommend creating dream decks in CardGameDB or grabbing decklists from here, making proxies, and then buying the specific chapter packs for the decks that work for you."}]}