{"url":"https://community.fantasyflightgames.com/topic/71582-not-yet-available/","title":"&quot;Not yet available&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/71582-not-yet-available/?do=findComment&comment=698787","commentId":698787,"userName":"sammann11","timestamp":1348389405,"content":"I am relatively new to LCG, having picked up Warhammer Invasion a few months back. I am thinking of getting the LOTR LCG, either soon or for x-mas, as I do a lot of solo play (Which now consists of deckbuilding and play-testing with W:I).\n\nI was looking through the products page for LOTR LCG and noticed when I clicked on the link to the core set, it said \"Not yet available\" instead of \"Buy now\".\n\nIt also showed different artwork than what is/was on the box of the core set.\n\nIs there a new addition coming out? Does anyone know? Would I be better off to wait until this \"new\" core set comes out, if that even is what this is?\n\nPerhaps this is just an error on the webpage?!?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71582-not-yet-available/?do=findComment&comment=698792","commentId":698792,"userName":"richsabre","timestamp":1348390238,"content":"i would say find a core set from another stockist (perhaps  ffg is out of stock?) as i heard something about re prints but it wont be anything groundbreaking- just errated card being corrected….so you wont be missin much, unless of course things like this bothers you, but i havent heard anything from ffg's end about it, so im not sure how far down the line these reprints are\n\nas for the different photo - its always been like that as far as i can recall, so probably doesnt signify much\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71582-not-yet-available/?do=findComment&comment=698841","commentId":698841,"userName":"GrandSpleen","timestamp":1348398299,"content":" Agree with rich, it is just out of stock.  If you look at the product details page here [http://store.fantasyflightgames.com/productdetails.cfm?SKU=MEC01], it says the availability is \"out of stock.\""}]}