{"url":"https://community.fantasyflightgames.com/topic/71724-when-does-always-mean-always/","title":"When does &quot;Always&quot; mean &quot;Always&quot;?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/71724-when-does-always-mean-always/?do=findComment&comment=700018","commentId":700018,"userName":"dbmeboy","timestamp":1348554436,"content":"Well it looks like I played another part of Caught in a Web wrong. I assumed that always meant always (rulebook pg 25: \"Players always assume control of attachments that have been played on their characters.\"). According to the FAQ, always doesn't mean always as it sets an exception (you don't gain control of attachments that are non-objective encounter cards).  Are there any other rule changes that are complete 180° contradictions from the core rules I should know about?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71724-when-does-always-mean-always/?do=findComment&comment=700039","commentId":700039,"userName":"Angus Lee","timestamp":1348559571,"content":"The keyword in the rules you referred to is \"played\".  Only player cards are played, so here it just means that all player card attachments are under your control if they are attached to characters under your control.  It is not mentioned about the encounter cards (where \"Caught in a web\" is one of them), so the FAQ clarifies it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71724-when-does-always-mean-always/?do=findComment&comment=700041","commentId":700041,"userName":"Dam the Man","timestamp":1348559855,"content":"That isn't a 180 though, as Caught in a Web is never \"played\" on a character. Playing means you pay the cost, but Encounter deck cards aren't played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71724-when-does-always-mean-always/?do=findComment&comment=700058","commentId":700058,"userName":"dbmeboy","timestamp":1348561956,"content":"I actually can't find any technical definition of \"Played\" in the rule book.  Is there a MtG-style comprehensive rules posted somewhere I can read through?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71724-when-does-always-mean-always/?do=findComment&comment=700256","commentId":700256,"userName":"Dam the Man","timestamp":1348581586,"content":"\"This is the only phase in which a player can play ally\nand attachment cards from his hand.\n\nIn order for a player to play a card from his hand (or\nto activate certain card effects), he must pay for it by\nspending resource tokens from the resource pool of a\nhero who has a resource icon that matches the card’s\nsphere of influence.\" (p. 12)\n\nFAQ clarifies \"put into play\" as being separate from \"play\", but unfortunately, unlike W:I and CoC LCGs, LotR doesn't have the FAQ fully specify the terms \"play\", \"put into play\" and \"enters play.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/71724-when-does-always-mean-always/?do=findComment&comment=700433","commentId":700433,"userName":"dbmeboy","timestamp":1348608345,"content":"Yeah, I saw that instance of play.  Unfortunately, instructions on how to play a card from hand don't really do much to define the term \"play.\"  I'm not trying to argue the definition you gave me, it just doesn't seem like it would be a clear conclusion from the rules and I was honestly hoping there was a more complete rule document somewhere.  Oh well."}]}