{"url":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/","title":"HoN known Card List (SPOILERS)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/?do=findComment&comment=701180","commentId":701180,"userName":"John85","timestamp":1348727492,"content":"*UPDATE 10/02: Apparently no one (over at BGG) is very interested in just a list of cards, so I've added the card text when available (inferred text [in brackets])\nI've begun a list of KNOWN CARDS in the new DE \"Heirs of Númenor\" over at the FFG Forums (herehttp://www.fantasyflightgames.com/edge_foros_discusion.asp?e… . I've decided to repost and update it here also, since there are folks who play that aren't in that forum too. NB: I'm keeping a list of ONLY KNOWN CARDS, not hypotheticals.\n\nHeirs of Numenor\nTactics\nHero\n   Beregond (10; 0/1/4/4) Gondor. Warrior. Sentinel. The cost to play Weapon and Armor attachments on Beregond is reduced by 2. \"It is too late to send for help when we are already besieged.\" -Beregond, The Return of the King\nAlly\n   Defender of Rammas (2; 0/1/4/1) Gondor. Warrior. \"And the enemy must pay dearly for the crossing of the River.\" -Denethor, The Return of the King\nEvent\n   Behind Strong Walls (1) Action: Ready a defending Gondor character. That character gets +1 Def. until the end of that phase. …seven walls of stone so strong and old, they they seem to have been not builded but carven by giants out of the bones of the earth. -The Return of the King\n\nLeadership\nEvent\n   Mark Assists?/Helpful Alliance? (Gondor/Rohan Flags; 0)\n   ??? (from back of HoN box; ?) Action: Choose a Gondor hero. [Add one …?] resource to that hero's resource [pool?] flavor text (out of focus/can't read)\n\nSpirit\nAttachment\n   Blood of Numenor (0) Condition. Gondor or Dunedain hero. [Action: Discard?] 1 resource from attached hero's [resource pool?] to give attached hero +1 Def. for […] its resource pool until the end [of the phase?] (Limit once per phase.) “Believe not that in the land of Gondor the blood of Númenor is spent, nor all its pride and dignity forgotten.” –Boromir, The Fellowship of the Ring\n\nLore\nAlly\n   Ithilien Tracker (?; ?/?/?/3) Gondor. Ranger. [Action: Exhaust?] Ithilien Tracker to lower the […] enemy added to the staging area […] end of the phase. Green gauntlets covered their hands, and their faces were hooded and masked with green, except for their eyes, which were very keen and bright. -The Two Towers\n\nNeutral\nAlly\n   Emissary of Pelargir (2; 1/1/0/1) Gondor Response: When Emissary of Pelargir enters play, add 1 resource to a Gondor or Noble hero's resource pool.\n\nQuest Decks\nSiege of Cair Andros\n   1B The Defense (9 points) The assault is relentless, and the defenders grow weary. The tide is slowly but surely turning against you… Siege. (Characters quest Using Def. instead of WP.) Players must deal damage from undefended attacks to the lowest Threat Battleground location in play. If there are no Battleground locations in play, immediately advance to the next stage.\n   2B Reinforcing the Banks (9 points) Reveal 1 additional card from the encounter deck and add it to the staging area during the sieging step each round.\n\nEncounter Decks\nSiege of Cair Andros\nEnemy\n   Battering Ram (33; 2/7/3/5) Besieger. Doomed 2. When Revealed: If the active location is a Battleground, deal 3 damage to it. Shadow: Deal 2 damage to The Approach if it is in play. Otherwise, attacking enemy gets +2 Atk.\n   Siege Raft (30; 3/4/1/6) Besieger. When Revealed: Deal 2 damage to the lowest Threat Battleground location in play, if able. Shadow: Deal 2 damage to The Banks if it is in play. Otherwise, attacking enemy gets +2 Atk.\nLocations\n   The Citadel (3 Threat; 11 points) Cair Andros. Battleground. If The Citadel has 11 or more damage, remove it from the game (do not collect its victory points)9. Response: After The Citadel leaves play as an explored location, remove stage 4 from the quest deck, if able. Victory 3.\n   The Approach (2 Threat; 7? points) Cair Andros. [battleground.?] If The Approach has 7 [or more damage, remove it?] from the game [(do not collect its victory points)9?]. Response: After The [Approach leaves play as an explored?] location, [remove stage 3 from the quest deck, if?] able. Victory 2.\n   The Banks (no img. referenced by Siege Raft)\n\n\"Siege Tower\"\nEnemy\n   Orc Vanguard (40; 2/?/?/?) Mordor. Orc. [Forced: When Orc?] Vanguard is in the staging area, [resources cannot?] be spent from the resource pools [of heroes who?] have a Leadership, Spirit, or Lore resource icon. Shadow: […] attacking enemy two additional […]\n   Orc Crossbowmen (35; 2/1/2/5) Mordor. Orc. Archery X. X is the number of different resource icons (Leadership, Tactics, Spirit,Lore) of heroes in play. Shadow: The attacking enemy gains +2 Atk.\n\n\"Spear Point\"\nTreachery\n   Lurking in Shadows When Revealed Return all Brigand enemies [engaged with?] players to the staging area. If [players?] returned no Brigand enemies to the [staging area,?] Lurking in Shadows gains surge. Shadow: [Return the?] attacking enemy to the [staging area?] after it attacks.\n\n\"Big Tree\"\nEnemy\n   Southron Company (34; 1/3/1/5) Harad. Southron Company gets +2 Threat and +2 Atk. while the current quest card has the battle or siege keyword. Shadow: Attacking enemy gets +1 Atk. (+2 Atk. instead if current quest has a keyword.)\n\n\"Two Arrows\"\nEnemy\n   Mumak (38; 4/7/3/12) Harad. Creature. No attachments can be attached to Mumak. Mumak cannot take more than 3 damage each round. \"His upturned hornlike tusks were bound with bands of gold and dripped with blood.\" -The Two Towers\n\nUnknown Deck\nTreachery\n   The Master's _____ (Might?)\n\n*I'll update this Post as more becomes known (\"Quoted Text\" indicates a made up encounter deck title) I wanted to update an existing spoiler thread on HoN, but I couldn't find it. Here I'm keeping a list of ONLY KNOWN CARDS, not hypotheticals."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/?do=findComment&comment=701183","commentId":701183,"userName":"John85","timestamp":1348727955,"content":"Quest Decks\n Siege of Cair Andros\n  1B The Defense\n  2B Reinforcing the Banks\n\nEncounter Decks\n Siege of Cair Andros\n  Enemy\n   Battering Ram\n   Siege Raft\n  Locations\n   The Citadel\n   The Approach"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/?do=findComment&comment=701257","commentId":701257,"userName":"CJMatos","timestamp":1348739810,"content":" Where did you see some of those cards, like Beregond?\n\n \n\nIt seems you missed on treachery card (visible on Heirs of Numenor page) and the Leadership event is called Mark Assists.\n\n \n\nI can only see:\n\nOn web site:\n\nProtector of Rammas, tactics ally;\n\nMark Assists, leadership event;\n\nthe treachery card whose name can't see well;\n\n \n\nOn first announcement:\n\nBehind Strong Walls, tactics event;\n\nBattering Ram, enemy;\n\n \n\nOn second announcement:\n\nStage 1B The Defense of quest The Siege of Cair Andros\n\nThe Citadel, Location;\n\nSiege Raft, enemy;\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/?do=findComment&comment=701271","commentId":701271,"userName":"John85","timestamp":1348740674,"content":"I left off several Encounter sets intentionally, because I didn't know how to refer to them (I suppose I could use the symbols for reference and makeup a name).  *I'll add other posted cards to the OP later when I have a moment.\n\nI mentioned Mark Assists in the initial post.\n\nBeregond is on the back of the box (posted in another thread), along with the other Leadership event I referenced (as ???); someone has also posted the full card (albeit in French) on a recent thread. This same card is on BGG (where I have provided a translation).\n\nMost of the other cards come from the image on the back of the box OR the About section on the HoN minisite OR the two posts from FFG (Battles and Battlegrounds and Heirs of Numenor)\n\nbtw. sorry I'm not using the acute accent on u in Numenor, it drives me nuts to leave it out, but there seems to not be and easy way to include it on the boards.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/?do=findComment&comment=701945","commentId":701945,"userName":"John85","timestamp":1348838546,"content":"Add \"Orc Crossbowmen\" to \"Siege Tower\" - Enemy.\n\nDoes anyone know how to edit an OP multiple times?  Nevermind, I worked it out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/?do=findComment&comment=702082","commentId":702082,"userName":"BoundForGlory","timestamp":1348864614,"content":"John85 said:\n\nDoes anyone know how to edit an OP multiple times?  Nevermind, I worked it out.\nI know you said \"nevermind,\" but I thought I'd share what I have to do to edit my original post: reply to my thread.  Then, the \"Edit\" button reappears on my original post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71842-hon-known-card-list-spoilers/?do=findComment&comment=703773","commentId":703773,"userName":"John85","timestamp":1349185931,"content":"Updated 10/02: Add card descriptions"}]}