{"url":"https://community.fantasyflightgames.com/topic/71929-replayable/","title":"Replayable?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702111","commentId":702111,"userName":"sammann11","timestamp":1348874391,"content":"I am pretty new to the whole LCG. A few months ago I got into Warhammer Invasion and love it. That said, I happen to have much more of an opportunity to by myself than with others (kids, traveling for work, I live 45 minutes from the \"nearby\" hobby store, etc…). For this reason, among others, LOTR appeals to me. Plus, I've gotten my head around the whole deck-building concept that seems integral to this particular game.\n\nI debated between W:I and LOTR initially, and while I started with W:I, I am tempted to get into LOTR now. Play-testing new W:I decks against myself is fun, but only to a point.\n\nMy question is this: With 3 quests to start, and then only 1 new quest per $15 thrown at the game (or 3 for $30 with the big daddy expansions) is there much of a \"replay-ability\" factor?\n\nOnce you have beaten a quest, is it still that much fun to try it again with a different sphere of influence or some other method of approach? Because of the random nature of card draws, will the same quest play somewhat differently every time?\n\nIn video game terms: Is this game still fun even if you don't have $15 to drop every month on the latest \"downloadable content\"?\n\nKind of a long winded way to ask my question, I know, but I'm just curious about it.\n\nWith W:I no 2 games are quite the same, even with a limited budget. How does this LCG stack up to that one in that respect?\n\nAny feedback would be appreciated. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702144","commentId":702144,"userName":"ArachneJericho","timestamp":1348885354,"content":"I feel that LotR is pretty replayable even without the extra quests. I haven't played many of those yet (despite having all the packs). What really makes play differ each time is both the quest and its interaction with your deck. A willpower rush deck is going to feel very different from a tactics fighting deck versus the flexibility of lore and leadership. Combine spheres, and you have a lot of different options. Even the second-simplest quest, Passage Through Mirkwood (which comes with the Core set) is very replayable, at least in my opinion. It's great for testing decks.\n\nThe harder the quest, of course, the more replayable it is (unless it's not to your taste; not everyone likes the nature of Journey to Rhosgobel for instance). You just gotta get through it. The Core set has two of these: Journey Down the Anduin and Dol Guldor, though the latter is not to everyone's taste. Even now I still play Journey, and it's a great challenge even with a fairly advanced Elrond deck. Pulling one's fat out of the fire is one of the greatest feelings in the game. \n\nThat said, the game gets better with each pack you buy. The Core set isn't as great for deck-building, and the larger your card pool, the more fun the game is (at least to me). Your options really open up to start playing different three-sphere or even four-sphere solo decks. Fortunately, due to the nature of the fixed distribution, you can pick and choose packs that give you greatest bang-for-your-buck player cards and quests that you like or are well-rated.\n\nPlus, if you check out the Player Community subforum, you'll find threads for the Living Tournaments, which add a great deal of replayability.\n\nI strongly recommend browsing card spoilers via CardGameDB [http://www.cardgamedb.com/] if you aren't already. It's a wonderful resource. And Cardboard of the Rings [http://cardboardoftherings.com/] reviews each adventure pack---it's a great podcast and I highly recommend it to get a feel for the possibilities.\n\nOthers can recommend the best packs for (a) player cards, (b) quest variety and/or goodness (for instance, Hills of Emyn Muil is… um… pedestrian). I  recommend picking up the Hobbit saga, the quests are really well-constructed and offer great variety. The first quest has great replayability because it's difficult (at first) to retrieve the treasure without getting killed by trolls. And treasure are extra cards you can add to your deck as you work a deck with the same heroes through the series of quests, an almost video-game-like progress element without being trite.\n\nI am biased, of course, and am lucky in that I can afford the packs as they come out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702201","commentId":702201,"userName":"richsabre","timestamp":1348902580,"content":"Allow me to give you a short and long answer\n\nShort: - i have played this game almost everyday since it was released about a year and a half ago and still love it…obsessive? yes. replayable? yes.\n\n \n\nLong: - there is a thread here talking about the varying difficulty of the start up of quests and this is an important factor in replayability…sometimes you get an easy set up, sometimes very hard, but either way no two games will be alike. the same with deck construction- try diferent decks, if you are finding one too easy then try a themed deck, with tolkien-lore correct player cards. another thing to do is try the nightmare mode.\n\nthe monthly chapters packs are about right for me, anymore would be too expensive, any less would be too stale. there is also the saga packs for the hobbit. all these packs introduce new challenges, and with the expection of a couple of packs that get old quick (emyn muil) i reply most of them.\n\nas above the bigger your card pool the more interesting this game gets. you can have all dwarves, or noldor, or mix the two together. also if you find some of the quests too difficult especially in solo play, then the bigger card pool make them easier.\n\nfinally the bigger card pool allows for some really fun combos of cards, and makes you build decks in your head without you knowing it, and then try applying your crazy ideas to the game….this is a really fun aspect of the game.\n\nthis is of  course from the perspective of a really tolkien-obsessed player, which contributes to about 70% of the satisfaction i get for this game, so im not sure what its like from players who play the game more for the gameplay, and not the lore.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702222","commentId":702222,"userName":"DurinIII","timestamp":1348905500,"content":" Hey Rich, question, how often are you able to beat Journey Down the Anduin, solo? What is your best win ratio against this quest? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702232","commentId":702232,"userName":"richsabre","timestamp":1348907923,"content":"DurinIII said:\n\n \n\n Hey Rich, question, how often are you able to beat Journey Down the Anduin, solo? What is your best win ratio against this quest? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\nwhen the game first came out i didnt win it for months- i was playing it wrong though.\n\nnow i can beat it probably 70% with a deck purposely built for it, such as my flight to the ford deck\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702336","commentId":702336,"userName":"schmoo34","timestamp":1348928307,"content":"Journey down Anduin is a very fun quest.  It is challenging but not oppressive.  As for replayability…I think you missed something on your original post that is worth pointing out.\n\n \n\n1) Yes, you pay $15 for just one quest…however…that isn't all you get.\n\n \n\nYou also get new cards, new heroes, new possibilities for your deck…so you think about it and try mixing and matching and that leads to what you forgot\n\n \n\n2) You get to re-do the other quests with your new deck.\n\n \n\nSo this game, to me, isn't about \"been there, done that\"…because Journey down the ANduin is still my most played quest.  And the Rhosgobel isn't hard at all, but you have to custom build a deck just for that quest so I just find it to be a PITA.   THe refreshing part about paying that $15 is you get new possibilities and then you want to try them out on all of the previous quests which used to kick your butt."},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702378","commentId":702378,"userName":"sammann11","timestamp":1348940065,"content":"All,\n\nThanks for the feedback. This is good stuff to know!\n\nI think I will pick this game up.\n\nIs it worth buying the adventure packs in order? I've read some talk in these forums that make it seem that way. I do want to get them all anyways (Christmas time will be good for stocking up!), so knowing that, I wondered if I should just buy them in order?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702381","commentId":702381,"userName":"richsabre","timestamp":1348940560,"content":"sammann11 said:\n\nAll,\n\nThanks for the feedback. This is good stuff to know!\n\nI think I will pick this game up.\n\nIs it worth buying the adventure packs in order? I've read some talk in these forums that make it seem that way. I do want to get them all anyways (Christmas time will be good for stocking up!), so knowing that, I wondered if I should just buy them in order?\n\n \n\n\n\nyes i think so- if you are into the storyline then its a good idea, but if you miss one or go back to one then youre not missing a huge part of the storyline that you need to play the next one…..its just nice i think\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/71929-replayable/?do=findComment&comment=702481","commentId":702481,"userName":"Cutievalkyrie","timestamp":1348959078,"content":" This is what i v done, with $100 u can build two 50 decks for two players,\n\nyou may also get  two latest FFG deck boxes,  plus all ur cards will be sleeved. \n\nIts not that expensive if u only buy the big expansions:\n\n1 - Fantasy Flight Supply Deck Box: Blue (New, Deck Box, Fantasy Flight Games) at $7.49 each\n1 - Fantasy Flight Supply Deck Box: Red (New, Deck Box, Fantasy Flight Games) at $7.49 each\n1 - Lord of the Rings: The Card Game Core Set (New, Board Games, Fantasy Flight Games) at $25.99 each\n1 - Lord of the Rings LCG: Khazad-dum Expansion (New, Board Games, Fantasy Flight Games) at $19.49 each\n1 - Lord of the Rings LCG: The Hobbit: Over Hill and Under Hill Expansion (New, Board Games, Fantasy Flight Games) at $19.49 each\n11 - Standard Card Game Sleeves: Clear (50ct) (New, Card Sleeves, Fantasy Flight Games) at $2.49 each\nclear. includes 50 sleeves.\n\nSince its over $100 u will get free shipping from most shops. Some shops have cheaper sleeves and some shops have cheaper games, it all depends, check out and dont pay until u find the best total price.\n\n \n\nPros: Affordable for  two players long term enjoyable gaming (9 quests). \n\nCons: Not enough cards for four players. For three players it might be ok but the deck wont be that hard core to beat high level quests.\n\n           Not enough tokens for 3 or 4 players since we have only 1 core set. Not enough counters either.\n\n \n\nSmall expansion is not a good deal for me since for $9.99 u get 60 cards while large expansion for $19.99 u get more than  150 cards plus more quest and hero cards.\n\n          \n\n \n\n \n\n\n \n\n "}]}