{"url":"https://community.fantasyflightgames.com/topic/72362-cards-and-rules-questions/","title":"Cards and rules questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72362-cards-and-rules-questions/?do=findComment&comment=706183","commentId":706183,"userName":"Cutievalkyrie","timestamp":1349639703,"content":" 1. Citadel Plate +4 HP\n\nIf heros got 3 damage token and this armors removed, shall those damage tokens be removed too?(damages on the plate first?)\n\n \n\n2. A very good tale\n\nIf two blue symbol allies exhausted, can we use the total cost of the allies to put any symbol of ally cards into play? or just blue symbol ally cards?\n\n \n\n3. If a threaten level 30 enemy is engaged to player 1 because he has a threaten level of 31, the next turn player 2 get his threaten level to 32 while \n\n player 1 get his threaten level down to 29, shall we move the enemy to player 2? Or we just say once a enemy is engaged, it is always with that player?\n\n \n\n4. Horn of Gondor\n\nWhats the meaning of this card? You pay 1 resource and get 1 resource back when an attached ally dies?\n\n \n\n5.A light of the dark\n\nIs this an useful card? You pay 2 resource just to return an enemy engaged back to staging area and the next turn his coming back again?\n\n \n\n6. Veteran Axehand (0 2 1)\n\nIs this ally much better than guard of the citadel (1 1 0) at the same cost?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72362-cards-and-rules-questions/?do=findComment&comment=706198","commentId":706198,"userName":"GrandSpleen","timestamp":1349641318,"content":"1. Damage tokens are placed on the hero, never on Citadel plate. If Citadel Plate is removed, you do not remove any damage tokens from the hero card. Removing Citadel Plate could very well kill your hero.\n\n\n2. You can exhaust any allies you control to use A Very Good Tale, regardless of sphere (blue, red, green, purple). And you can put into play allies of any sphere as well, they don’t need to be Leadership allies. And I think you mean “purple” – Leadership. “Blue” is spirit. Maybe lost in translation. We have this problem a lot when I play – my wife is Japanese, and she really wants to call Leadership the “blue” sphere. \n\n\n3. Once an enemy is engaged, it stays engaged with that player unless some card effect moves it. Engagement checks are only made against enemies in the staging area.\n\n\n4. When ANY character leaves play (i.e. your hero or ally, your partner’s hero or ally), the hero who has Horn of Gondor gets 1 resource. “Leaves play” is a broad term, so you can get resources when a character is defeated, when Gandalf leaves play at the end of a round, when any character leaves play after a Sneak Attack, when a character leaves play as a result of Born Aloft being discarded, etc.\n\n\n5. We use A Light in the Dark to avoid attacks – sort of like a more expensive Feint, with other repercussions. Useful also in Conflict at the Carrock, to remove a troll’s buff effect for a round. Also useful for moving enemies from one side of the table to the other (i.e., use it at the end of the travel phase, before the engagement phase, and the enemy is now available for another person to engage).\n\n\n6. Veteran Axehand and Guard of the Citadel are just different. GotC can quest, VA… VA has stronger attack, though. Also, VA is a dwarf and can benefit from effects targeting dwarves (like Dain’s +1 effect). GotC is sure to get some love when the new expansion comes out, which is Gondor-themed.\n\n\nP.S. There is a Rules subforum, so you might want to post future rules questions in there. Anyone who is likely to answer your question is reading that forum.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72362-cards-and-rules-questions/?do=findComment&comment=706207","commentId":706207,"userName":"Cutievalkyrie","timestamp":1349643886,"content":" Thank you. From question 1 now i see it may not be a good idea to have that +4 HP armor for my hero since its expensive and may kill him eventually.\n\nHorn of Gondor seems a beast card to me after your explanation, i will add it to my deck .\n\nAnd, i am pretty sure the keywords \"blue, purple, red ,green\" are much easier to remember for your wife when shes playing this game:-)\n\nI was thinking about to buy this game in my own language (the core set and first small expansion has been introduced& translated), but later i found there were few people playing this game there… so i turned to buy the English version, since its much easier to get my questions answered on the Forums.\n\nNot a lot people understand Lort in China, once i was told by someone its a story about getting more allies and dumping the ring…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72362-cards-and-rules-questions/?do=findComment&comment=706242","commentId":706242,"userName":"Angus Lee","timestamp":1349657831,"content":"Hello Cutievalkyrie, glad to know that you're in China and play LotR the card game.  I was in Beijing before 2011 and I'm now in Hong Kong.  I have played this game since last year when the game launched.\n\nHorn of Gondor is really a good card; however, there is only one copy in the core set, so you can't rely on drawing it from your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72362-cards-and-rules-questions/?do=findComment&comment=706260","commentId":706260,"userName":"Cutievalkyrie","timestamp":1349664544,"content":"Actually i am in US now. Somebody just introduced board/card games to me last year, then i started to spend money on these cool stuffs…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72362-cards-and-rules-questions/?do=findComment&comment=706277","commentId":706277,"userName":"richsabre","timestamp":1349669197,"content":"Cutievalkyrie said:\n\n Thank you. From question 1 now i see it may not be a good idea to have that +4 HP armor for my hero since its expensive and may kill him eventually.\n\n\n\ncitadel plate is a great card, and is worth the risk of losing it. not all quests have encounter cards that discard attatchments, and if you know you have some treachery/shadow cancellation around, the plate on a good defender or gimli can be deadly\n\nrich"}]}