{"url":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/","title":"The Steward&#039;s Fear","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708679","commentId":708679,"userName":"impaulm","timestamp":1350056477,"content":"So the first AP of Against the Shadow is up on the products page, but no news about it yet. Strange! Maybe keep our eyes out today?\nhttp://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm… [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=2&esum=228]\n\n Edit: here it is!  \n\nhttp://www.fantasyflightgames.com/edge_news.asp?eidn=3643 [http://www.fantasyflightgames.com/edge_news.asp?eidn=3643] \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708686","commentId":708686,"userName":"Abelard3","timestamp":1350056806,"content":" Looks very exciting from what's been spoilered.  Not so much the cards but the idea of a continuous narrative is really appealing.  Trap must be a new kind of card, possibly distinct from the ally/event/attachment trio…  \n\nOutlands trait also potentially interesting provided that there are enough cards to support it.  Do you think Imrahil and Dol Amroth would be considered outlands?\n\n \n\n \n\nEDIT: Hard to tell from the half pictured card but 'Trained for War' looks to me like something for a pure tactics deck that allows you to quest with attack or defence for a turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708687","commentId":708687,"userName":"Dain Ironfoot","timestamp":1350056980,"content":"i suppose all the doomsayers need to restart their countdown until the next article… ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708688","commentId":708688,"userName":"richsabre","timestamp":1350057193,"content":"interesting they went with enemies within instead of without, suppose its best as it leaves the real bad guys for the mordor cycle\n\nnice art- interesting ideas- well done ffg….reminds me of tolkiens discarded lotr followup\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708692","commentId":708692,"userName":"impaulm","timestamp":1350057749,"content":" I am really looking forward to the new more cohesive narrative between AP's. I liked how the previous ones told a story and I am happy to see them expand on this idea! \n\nNow, the wait until January/ February!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708695","commentId":708695,"userName":"John85","timestamp":1350058449,"content":"All of the player cards look great!  I really like the art on Anborn (and traps sound interesting). A Villain trait and unique enemy cards (is that last one new?). Another Neutral ally is shown (\"White Tower Watchman\"). With him and \"Emissary of Pelargir\" it looks like we may expect a boost in Neutral allies (beyond \"Gandalf\").\n\nThe Outlands. trait and synergies will surely be very interesting (Ethir Swordsman is like a half cost, half benefit, spirit Core-Faramir (FaraCore?)), although I would have preferred something other than \"outlands\" (really it's okay). The stronger narrative thread sounds very exciting as well.\n\nLooking forward to this cycle even more!!\n\nP.S. ought I start a spoiler list for this AP, with card names, stats, text (like I did with HoN)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708702","commentId":708702,"userName":"lleimmoen","timestamp":1350059682,"content":"I don't have my cards with me but I believe Forest Snare is a trap. I believe we will be getting more of them.\n\nOverall, this cycle really is much more exciting to me than the previous. The theme is really intriguing. I especially like the traitor aspect of the narrative. The art on the box looks scary in an interesting way - much more than the nameless ageless endless shameless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708703","commentId":708703,"userName":"lleimmoen","timestamp":1350059773,"content":"As for Anborn, the attack 3 seems already pretty good. It is interesting that Lore is pretty good in the attack dept, second best I would say, although Leadership have its boosts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708704","commentId":708704,"userName":"richsabre","timestamp":1350059855,"content":"my only fears are that this will become a game of thrones type cycle….which it certainly looks like. dont get me wrong im really excited about it, and it looks great, i just hope it remains 'tokien' enough…..dont ask me what i mean by that as i cant explain it, i just hope it keeps the middle earth magic\n\nstill…packs showing some of the other lesser enemies of middle earth may prove interesting….and the others speak of sieges as we expected, so im pretty much talking crap (as usual haha) but it will be interesting to see how this one plays out, should be fun\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708706","commentId":708706,"userName":"BoundForGlory","timestamp":1350060012,"content":"lleimmoen said:\n\nI don't have my cards with me but I believe Forest Snare is a trap.\n\n\n\nIt's a trap!  \n\nSeriously, it is.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708714","commentId":708714,"userName":"lleimmoen","timestamp":1350060350,"content":"Bryon said:\n\nlleimmoen said:\n\n \n\nI don't have my cards with me but I believe Forest Snare is a trap.\n\n \n\n \n\nIt's a trap!  \n\nSeriously, it is.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nThanks 8)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708716","commentId":708716,"userName":"lleimmoen","timestamp":1350060554,"content":"richsabre said:\n\nmy only fears are that this will become a game of thrones type cycle….which it certainly looks like. dont get me wrong im really excited about it, and it looks great, i just hope it remains 'tokien' enough…..dont ask me what i mean by that as i cant explain it, i just hope it keeps the middle earth magic\n\nstill…packs showing some of the other lesser enemies of middle earth may prove interesting\n\nrich\n\n\n\nI don't think we have to fear too much promiscuity and sadistic torture in these packs, hopefully it will be NOTHING like the GoT ex."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708719","commentId":708719,"userName":"Rapier1","timestamp":1350061093,"content":" I laugh at all the doomsayers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708731","commentId":708731,"userName":"Narsil0420","timestamp":1350063131,"content":"So cool!!! I really love the cover art, very Assassin's Creed, brilliant!\n\nI also think it's really cool that Christian Peterson helped create the story for this cycle. That just shows me how much they love this game at FFG and should be a reminder to all those 'doomsayers' who start complaining so quickly.  Everyone, up to the owner, puts a lot of thought, time and passion into this game and I think we owe it to them to have a little faith when our impatience starts nagging at us.\n\nI also found it interesting that there wasn't a seperate article for the cycle in addition to the one for the AP. Perhaps they felt rushed to get this out, I can't imagine why… (cough)\n\nAnyway, all the player cards look awesome! I'm excited to set some traps with rangers such as Anborn!\n\nAlso, Castamir shows one heck of a research effort by FFG, they really dig deep into Tolkien's world! It's interesting because there's the 'Rains of Castamir' song in Song of Ice and Fire. I thought that FFG stole the name from ASOIAF but looked it up and found a whole article on Tolkien's Castamir. Just goes to show you that, when it comes down to it, they're all borrowing from Tolkien!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708735","commentId":708735,"userName":"Budgernaut","timestamp":1350063565,"content":" This looks like an amazing cycle! I love that they're trying to make the narrative a bigger part of the game. I'm really curious to see how it turns out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708737","commentId":708737,"userName":"lleimmoen","timestamp":1350063776,"content":"Narsil0420 said:\n\n \n\nAlso, Castamir shows one heck of a research effort by FFG, they really dig deep into Tolkien's world!\n\n \n\n \n\n \n\nWait. They better. Whilst I share the glory feeling seeing the preview, and I am grateful for this great game, I also feel that with privilage comes responsibility (and I think they feel it too)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708751","commentId":708751,"userName":"mason240","timestamp":1350066520,"content":"Dain Ironfoot said:\n\ni suppose all the doomsayers need to restart their countdown until the next article… ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n\n\nIt's been 6 hours now. Has FFG decided to just give up on LOTR?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708755","commentId":708755,"userName":"BoundForGlory","timestamp":1350066568,"content":"Movie fans will remember that Castamir was played in the movie by Peter Jackson himself.  There is a Castamir card in the Lord of the Rings TCG from Decipher."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708756","commentId":708756,"userName":"BoundForGlory","timestamp":1350066724,"content":"mason240 said:\n\nDain Ironfoot said:\n\n \n\ni suppose all the doomsayers need to restart their countdown until the next article… ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\n \n\nIt's been 6 hours now. Has FFG decided to just give up on LOTR?\n\n\n\nHA!\n\n \n\nI never thought they gave up on the game.  It just seemed like they gave up feeding us info/spoilers.  If they hadn't filled this article with so many card images and spoilers, I would feel like they still \"owe\" us a couple articles for the several weeks that have gone by without an article."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708825","commentId":708825,"userName":"Runner5","timestamp":1350085518,"content":"Narsil0420 said:\n\nSo cool!!! I really love the cover art, very Assassin's Creed, brilliant!\n\n\n\nThat was exactly my first thought when I saw the cover art.  They are introducing a new healer \"Doctor\" and doing so gave a hint for the hero of the adventure pack:  Ezio Auditore da Firenze"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708881","commentId":708881,"userName":"CaffeineAddict","timestamp":1350111791,"content":" Looks like its going to be good, I just wish they'd hurry up and release some of these expansions! or at least get laketown in the store, for those of us that didn't go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708898","commentId":708898,"userName":"DurinIII","timestamp":1350116064,"content":"First off, great looking stuff, now we are 3 sets out in anticipation (really 4 if you count the Lake Town scenario). Exactly Bryon, it was the longest lull ever for no new news, and for all of you now turning this new review (which finally arrived) on us \"doomsayers,\" that's pretty easy fodder, I mean come on, we didn't actually think no new news would ever come again, we were simply complaining about the time it was taking. In that regard, it is kind of silly to laugh at those who did get frustrated with FF because you are essentially laughing at a period of undefined time…in other words, would you have laughed equally if no new news was revealed in let's say, 2 months (instead of this last lull of 1 month), 3 months, or 4? Yours is a straw-man's argument, and if you weren't someone who complained, well, good for you, FF doesn't need your support to save face, they can do that on their own; they're big enough, competent enough and most certainly rich enough.\n\nSo, that is my rant, now back to the good stuff. I am so glad that they have decided to stick with the adventure pack cycle which worked so well before. This keeps the game consistent and much like a drug habit (a good kind of drug that is), as we are able to get our \"fix\" once a month! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Bring it on! My wallet is ready!\n\n-Joseph"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708923","commentId":708923,"userName":"lleimmoen","timestamp":1350121712,"content":"DurinIII said:\n\nFirst off, great looking stuff, now we are 3 sets out in anticipation (really 4 if you count the Lake Town scenario). Exactly Bryon, it was the longest lull ever for no new news, and for all of you now turning this new review (which finally arrived) on us \"doomsayers,\" that's pretty easy fodder, I mean come on, we didn't actually think no new news would ever come again, we were simply complaining about the time it was taking. In that regard, it is kind of silly to laugh at those who did get frustrated with FF because you are essentially laughing at a period of undefined time…in other words, would you have laughed equally if no new news was revealed in let's say, 2 months (instead of this last lull of 1 month), 3 months, or 4? Yours is a straw-man's argument, and if you weren't someone who complained, well, good for you, FF doesn't need your support to save face, they can do that on their own; they're big enough, competent enough and most certainly rich enough.\n\n-Joseph\n\n\n\nI wasn't gonna comment on it but since you did, I just have to say you did it well. The laughing comment was arrogant enough to make one angry, possibly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708933","commentId":708933,"userName":"monkeyrama","timestamp":1350123049,"content":"One part of the preview got me really excited:\n\n\"Our second goal for the Against the Shadow cycle was a little more ambitious. We really wanted to push the narrative focus. Not only did each scenario need to be fun to play, it needed to move the story forward and immerse the players in the narrative. Taken together, the Adventure Packs tell a grand story full of intrigue, tension, and heroics. Each adventure leads directly into the next, and by the time the players defeat the last stage of the last quest, the players will have completed an epic tale that almost feels more like an inspired RPG than a monthly LCG.\"\n\nOh hell yeah! One of the problems I've had in the past is that, at times, this game gets too gamey (some, non-obsessed friends of mine had exactly this criticism - they were expecting more story than they got). It's a bit like I'm playing a deck, rather than really exploring, getting a story etc. This is partly just because I'm not that good at making the story myself, I fully admit, but if they're going to make the narrative stronger in future, I'm even more excited about what is to come! And HoN was already awesome looking! Cool new cards, Gondor, an actual well pieced together story…yahoo!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708973","commentId":708973,"userName":"Rapier1","timestamp":1350129851,"content":" I'd like to protest against your argument.\n\nYou contention is that I don't think you should have complained after a lull of only a month, but that I might have complained had it been 4 months.\n\n \n\nMy contention is that you shouldn't have complained at all - that ranting about the time it takes for them to write reviews is not productive or beneficial or even neutral. It is in fact unpleasant and counter-productive to what the people that rant want (which is to build a solid reliable base to play, and discuss and enjoy the hobby).\n\n \n\nCrying because FFG haven't mentioned anything about one game among the many that they have to support for a period as short as a month, and doing that after we have confirmed product coming (a second deluxe expansion and a second saga expansion), just strikes me as inherently childish and unfair. I didn't complain when news was scarce and only the base box was out because promised support may have been scrapped at that point. (before we had heard of any support in the form of extra cards at all I mean).\n\n \n\nFFG are a good company, not hearing something for a month is nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=708988","commentId":708988,"userName":"lleimmoen","timestamp":1350133288,"content":" What can be more childish than laugh about people when a preview comes up? What the complainers did was not unpleasant at all, it wasn't really angry or disrespectful in any way. It was simply a stance toward a certain action, or the lack of.\n\nAnd these boards are meant to show one's opinion. As long as the opinion is not disrespectful to others, it is fine. What was highly disrespectful was your redundant comment. Again, this is just my opinion. You can of course disregard it as surely as I will disregard yours."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709112","commentId":709112,"userName":"DurinIII","timestamp":1350161666,"content":" Well, Rapier, I obviously disagree with you and you obviously disagree with me. Oh well.\n\nlleimmoen: spot on mate. The \"laughing\" comment is far more childish in my opinion. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709113","commentId":709113,"userName":"DurinIII","timestamp":1350161733,"content":"Besides, stating that someone shouldn't complain at all is not, as I see it, a \"contention.\" It's an opinion that is equally as valid as the opinion of choosing to complain. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709115","commentId":709115,"userName":"Bullroarer Took","timestamp":1350162143,"content":" Some of you Tolkein experts can weigh in on this one if you wish: I believe Tolkein started another story that was set after Aragorn died (and featured his sons) and it was basically a murder mystery set in Gondor.  He abandoned it.  I wonder if this is the basis for the first AP?\n\nIt's famine and feast around here.  We feasted on the end of Dwarrowdelf and the release of the first Hobbit saga.  After short commons we will be feasting again on the second Hobbit saga and Heirs etc.  While the pacing might leave something to be desired, we're still getting pretty good material over the long haul."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709163","commentId":709163,"userName":"Gizlivadi","timestamp":1350175020,"content":"So, it seems the guys at ffg were not satisfied with one political intrigue themed lcg, so they made another one! Ok, in all seriousness, this is indeed interesting, though I must say it's rather, um, strange. It does feel a whole lot like GOT, and seeing a Plague Doctor kinda guy in Middle Earth is not exactly what i was expecting. It is a very creative concept though, I must give them that. I love the art for Anborn, and many of the card art and themes look pretty cool, though I hope this cycle does not focus too much on secrets and intrigue but rather more on feudal warfare against foreign folk, which feels a lot more like Gondor anyway. \n\nBullroarer Took said:\n\n Some of you Tolkein experts can weigh in on this one if you wish: I believe Tolkein started another story that was set after Aragorn died (and featured his sons) and it was basically a murder mystery set in Gondor.  He abandoned it.  I wonder if this is the basis for the first AP?\n\n\n\nOk, so we first have cycles based around the timeline after the Hobbit and before the Lord of the Rings, then we get expansions based on the Hobbit, and just after that we get a cycle based on the story after the Lord of the Rings (a story which is not even canon and would be pretty much about baseless speculation). If this is how ffg treats the timeline for their games, I would really start to question myself about continuing to play this game. No, I really doubt it is based on The New Shadow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709200","commentId":709200,"userName":"Rapier1","timestamp":1350184972,"content":"lleimmoen said:\n\n What can be more childish than laugh about people when a preview comes up? What the complainers did was not unpleasant at all, it wasn't really angry or disrespectful in any way. It was simply a stance toward a certain action, or the lack of.\n\nAnd these boards are meant to show one's opinion. As long as the opinion is not disrespectful to others, it is fine. What was highly disrespectful was your redundant comment. Again, this is just my opinion. You can of course disregard it as surely as I will disregard yours.\n\n\n\nI think that stating an unwaranted feeling of neglect from a very busy company that is not in fact neglecting you is insulting to others. It's insulting to the staff at FFG.\n\nHowever I did not mean to offend anyone when I said I laugh at the doomsayers it was not meant to be, \"I laugh at them, how stupid they are,\" it was meant to be, that I was amused by the ranting when it was clearly unwarranted. Which I still think it was.\n\n \n\n \n\nOn a better topic, what is the outlands? Is that the large wilderness between the \"good\" human kindgom and the Easterling kingdoms? Might we see easterling human enemies?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709232","commentId":709232,"userName":"richsabre","timestamp":1350194467,"content":"Rapier said:\n\n \n\nOn a better topic, what is the outlands? Is that the large wilderness between the \"good\" human kindgom and the Easterling kingdoms? Might we see easterling human enemies?\n\n \n\n \n\nthe outlands are the southern fiefs of gondor, so i think we shall see many umbar corsairs in this cycle, and we know were are getting haradrim as we have seen the southron company and mumak\n\nas for tolkien's sequel, as i posted on the first page, it is indeed what immediatly came to mind….however there is very very little to go on if ffg are thinking of making a discarded 4th age draft cycle!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709301","commentId":709301,"userName":"DurinIII","timestamp":1350210478,"content":"Good points there Rapier; you are a smart chap. As far as your outlands question, well, Rich to the rescue! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=709340","commentId":709340,"userName":"lleimmoen","timestamp":1350217830,"content":"Rapier said:\n\nHowever I did not mean to offend anyone when I said I laugh at the doomsayers it was not meant to be, \"I laugh at them, how stupid they are,\" it was meant to be, that I was amused by the ranting when it was clearly unwarranted. Which I still think it was.\n\n\n\nI see that. If I am to speak about myself - whether I can be counted among the so-called doomsayers or not - even though I may have shown disappointment toward the lack of news, I still think it was not an offense in any way. At the same time I have more than once honestly called this game my all time favourite.\n\nMore importantly, I really think ffg cannot be offended by honest opinions, whether they be praise or not. More so, I would go as far as guessing that they welcome such opinions because as any good company they care about their customers's views. Not least those customers that have spent \"fortune\" buying their products."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=711725","commentId":711725,"userName":"muemakan","timestamp":1350574190,"content":" I wonder if this Swordsman is a not the final version?!\n\nA  2 cost ally with 2 willpower and you can have 3 of them in play……thus adding up to a total of 12willpower.\n\nAnd I guess there will be other outland characters too.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=711733","commentId":711733,"userName":"OnkelZorni","timestamp":1350574737,"content":"muemakan said:\n\n I wonder if this Swordsman is a not the final version?!\n\nA  2 cost ally with 2 willpower and you can have 3 of them in play……thus adding up to a total of 12willpower.\n\nAnd I guess there will be other outland characters too.\n\n\n\n \n\nCan you haer this too? A silent voice from somewhere starts screaming \"power creep!!!\" gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\n \n\nSo, who wanna start a thread bout this? gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=711974","commentId":711974,"userName":"lleimmoen","timestamp":1350619397,"content":"Willpower 2 for cost 2 is nothing new, right? If we disregard Arwen as being unique, we have West Road Traveller (not to mention Escort from Edoras) who has a pretty good effect on top of it, same hp but not attack and defence. What really could make this Ethir Swordsman super strong is the number of Outlands characters. Especially if we get an Outlands hero, as we are probably bound to sooner or later. So coming back to the start, yes, I think there will be power creep warning sign buzzing blinking red."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72658-the-stewards-fear/?do=findComment&comment=714990","commentId":714990,"userName":"Rapier1","timestamp":1351190258,"content":" I would have liked it more with \"Each other Outlands character you control receives +1 willpower\" \n\nI'm not sure it is power creep though, this ability alone isn't going to even scratch the massively powerful dwarf synergy.\n\n \n\nI would expect an Outlands hero and a Gondor hero in the box, assuming we get 2 heroes again.\n\n "}]}