{"url":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/","title":"My Hobbits For A Decent Deck Type: The Power of Zigil Sliver","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=708978","commentId":708978,"userName":"ArachneJericho","timestamp":1350131039,"content":"In a little game called Magic the Gathering, there's a deck type called The Sliver Deck, a specialized type of what one might call the Weenie Rush. If this did not sound ominous to you, let me explain:\n\nSlivers are a type of creature that, by themselves, are not very impressive. They're usually 1 attack, 1 defense; but their special ability reads: \"All slivers [gain quality].\" This can be anything from \"All Slivers get +1 attack\" to \"All Slivers gain protection from red (damage)\" and so on. Like the Trolls from We Must Away Ere Break of Day, they buff each other; and the more types of Slivers in play, the more abilities every single one of them has.\n\nGet enough Slivers with abilities into play, and even blank Sliver counters will become powerful 3 attack, 3 defense, protection from all colors, shrouded, shadow, regenerating enemies. Playing against a Sliver deck with no reliable mass or even targeted creature destruction can be a nightmare.\n\nSlivers are a demonstration of a very simple type of synergy, what I'll call direct synergy: abilities that read \"cards of type X gain a quality\". The Trolls in WMAEBOD have synergy.\n\nAnd what's called a Dwarf Deck in LotR:TCG also has this kind of synergy.\n\nLet us consider the following partial deck list:\n\nHeroes\n- Nori\n- Ori\n- Dain Ironfoot\n\nAllies\n- Erebor Battle Master x3\n- Erebor Hammersmith x3\n- Erebor Record Keeper x3\n- Longbeard Map-Maker x3\n- Longbeard Orc Slayer x2\n- Miner of the Iron Hills x3\n- Zigil Miner x3\n\nAttachments\n- Hardy Leadership x2 (unique)\n- Legacy of Durin x3 (unique)\n- Song of Battle x3\n…\n\nEvents\n- Lure of Moria x3\n…\n\nAnd consider the build-up of abilities:\n\n- Nori basically means that every dwarf gains \"when put into play lower your threat by 1\"\n- Ori draws 2 cards instead of 1 if you have at least 5 dwarves in play\n- Dain Ironfoot gives every dwarf +1 willpower and +1 attack\n- Erebor Battle Master gains +1 attack for every dwarf in play (on top of 1 attack)\n- Hardy Leadership gives +1 hitpoint to every dwarf in play\n- Legacy of Durin means that every dwarf gains \"when put into play draw a card\"\n\nConsider now the impact of playing 3 Erebor Record Keepers, which I know people diss as a 1 cost, 1 willpower, 1 hit point, can't defend or attack, ally with a relatively expensive ability:\n\n- You decrease threat by 3\n- You draw an additional 3 cards\n- You gain 6 willpower\n- All Erebor Battle Masters now have +3 attack\n- You get three 2-hit-point allies\n- You draw 2 cards instead of 1 during resource\n\nAll for a mere cost of 3.\n\nConsider playing a single Zigil Miner, whose ability has been so nerfed by a recent FAQ that I just basically use him as a 2-cost Spirit Dwarf ally with no ability:\n\n- You decrease threat by 1\n- You draw an additional card\n- You gain 2 willpower\n- You gain 2 attack\n- All Erebord Battle Masters now have +1 attack\n- You get a 2-hit-point ally\n\nErebor Hammersmith? You get a 4-hit-point ally, along with all the other niceties above, for a cost of 2 with a useful special ability all on its own.\n\nI tossed in Lure of Moria because it has awesome value for 3 cost: ready all Dwarves in play. This can mean something like spending 20 willpower, then standing all 2-hit-point-minimum allies, then attacking for 16 (assuming you hold a couple Zigil Miners back for defense).\n\nThis results in an absolutely amazing deck type that performs well unless you encounter mass ally destruction---and even then, a Hardy Leadership will ensure that all except for treacheries like Rock Slide are relatively harmless. I actually play without treachery or shadow effect counters, even if they remove attachments because the synergy without attachments is still pretty dang powerful. And all three hero abilities work even when sacked.\n\nThe question now becomes: Is all this synergy too powerful?\n\nLet's go back to MtG and Sliver decks. They are powerful, but there exist cards to counter them: creature destruction. A deck that splashes in black or even white, the two main mass creature destruction colors, will be well-prepared. A deck that splashes blue to steal key creatures like Sliver Overlord will wreck havoc against the Slivers' master. In other words, a competitive environment, by its volatile and adaptive nature, eventually balances against almost any deck type, even Sliver decks.\n\nBut what about a cooperative environment, like LotR:TCG, where the only opponent is the encounter deck?\n\nWell… things get a little… dicey. A well-built dwarf deck will demolish most quests solo. Yet here's the thing: for those of us who want to win semi-reliably in the mines of Moria, a dwarf deck is key. The deck type just happens to be the Swiss Army knife of deck types for the moment because the evolution of the game means that earlier quests often become weaker as more cards are introduced---especially if they have high synergy. It's the rare quest that stands the test of time, like Journey Down the Anduin.\n\nAnd the thing about synergy is that it can be used against you. Consider the following types of treacheries that would kill a dwarf deck:\n\n- All Dwarf allies are dealt three damage.\n- This card becomes a Condition Attachment with the text: \"All dwarves cost 1 extra resource to play.\"\n- While Shadow of Durin's Bane is in play, all dwarves have their hit points reduced by 1.\n- Flame of Durin's Bane gains +1 attack and +1 defense for every dwarf in play.\n\nThese are pretty evil, but also pretty extreme and specifically aimed at dwarf nerfing, which would be a bit inelegant.\n\nBut I can think of a non-specific treachery that will stop a dwarf deck in its tracks:\n\n- Target the hero with the highest printed hit points. This card becomes a Condition Attachment with the text: \"Treat this hero's text as if it were blank.\"\n\nDoes the design team need to resort to such treacheries?\n\nI personally don't think so. You might as well argue that the Rohan Rush or Noldor decks are too powerful and should be nerfed.\n\nBut this isn't a competitive environment.\n\nWhen it comes down to it, you are the one making the choice to play a Swiss Army deck. You are the one choosing to play one deck type over all others. The choice of boredom, if you think of this as such, is yours and yours alone.\n\nThat said, I like my dwarf deck and play it a lot. It's synergistic and thematic and powerful. What more could a Bilbo want?\n\nPipe-weed, that's what.\n\nBRING ON THE HOBBITS, I SAY\n\nEdited: Corrected for the fact that Legacy of Durin is unique. Thanks, Zanebane!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=709002","commentId":709002,"userName":"Abelard3","timestamp":1350134527,"content":" Great article!  It's really interesting to have all of those dwarf synergies laid out together and see just how powerful the combination is.  Of course multiply up the number of players and it can become even more ridiculous!  You make great points about nerfing and so on and I think it's definitely one of the enjoyable things about a non competitive environment to be able to simple choose how easy to make it for yourself.  You can get satisfaction from steamrollering or from barely making it with a thematic deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=709004","commentId":709004,"userName":"richsabre","timestamp":1350134722,"content":"excellent first article and nice reading.\n\npipe weed indeed gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=709024","commentId":709024,"userName":"player1049508","timestamp":1350136261,"content":"Isn't Legacy of Durin unique? So won't you only ever have one of them in play at a time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=709058","commentId":709058,"userName":"CaffeineAddict","timestamp":1350143806,"content":" I think its a great point about the \"opponent\" being the encounter deck, not another player. That renders a lot of the \"old wisdom\" about card games somewhat redundant - i.e. \"deck X is too powerful, kill it with cards Y and Z or a ban/errata\". Personally I love having powerful cards to build powerful decks, and thematic cards for more story-driven decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=709116","commentId":709116,"userName":"ArachneJericho","timestamp":1350162143,"content":"Thanks, Abelard, Rich, and CaffeineAddict!\n\nZanebane: You are correct. I made a mistake there. I have updated the article!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=709159","commentId":709159,"userName":"CJMatos","timestamp":1350173253,"content":" Nice approach to this theme and the game itself.\n\n \n\nI like the fact that in LotR: LCG we do not play against another person, but against an encounter deck with is always different even in the same quest. It is what makes this game wonderful.\n\n \n\nIn MtG, we could have a great deck but if the opponent knows it and has the right strategy, we are finished. In LotR, we don't have any of that, we have always different situations, even if we have the same deck.\n\n \n\nThe dwarf sinergy is, at the moment, for me, the great and most powerfull combo in the game, especially in multi-player.\n\n \n\n \n\nGreat article… Keep them going"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72693-my-hobbits-for-a-decent-deck-type-the-power-of-zigil-sliver/?do=findComment&comment=709179","commentId":709179,"userName":"Xaanalinos","timestamp":1350177789,"content":" i got almost same build like u wrote but i use Bofur. pay 1 to put him in play just for quest and lower ur threat by 1. Maybe u cant pick up another card but its still nice. \n\n \n\n1 cost\n\n1 lower threat\n\n+3 willpower to a quest \n\n \n\nand than return to ur hand so u can use it on and on ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nAnd if some treachieries says deal some dmg to questing char u can put almost all of them to bofur cuz he'll go back to ur hand :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}