{"url":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/","title":"Unsung Heroes of Middle Earth: Prince Imrahil","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709073","commentId":709073,"userName":"Abelard3","timestamp":1350147374,"content":" Welcome to Volume One of this Unsung Heroes of Middle Earth series. The aim is to look at those heroes that have been left by the wayside as the game has developed; languishing in your heap of cards with the likes of Dark Knowledge while their friends go on exciting missions, visit amazing locations and experience glorious victories or horrible deaths. I will be looking at ways to utilise these characters, including synergies with other cards, thematic decks and other general musings.\n\n \n\nM1197.jpg [http://lotrlcg.com/img/med/M1197.jpg]\n\n \n\nFirst to the fore is Prince Imrahil, the Swan-Knight-leading ruler of the Dol Amroth. At present, he is without thematic allies beyond standard Gondorians, though that may change with the release of the next cycle.\n\n \n\nHe is what I like to think of as a 'balanced' hero, in that his threat count is equal to the sum of his Willpower, Attack, Defence and Health. An imbalanced hero could be one such as Elrond (Extra threat due to his strong ability) or Spirit Glorfindel (Lower threat and a compensating disadvantage). With his 2|3|2 attributes and 4 hit points, Imrahil is a jack of all trades. However, in a game where a character can only choose 1 among many roles each round, this is not as useful as one might imagine. Better surely to use Theodred for questing, Thorin to attack or Dain to defend in the leadership sphere? Well, if you manage to utilise Imrahil's ability, then he can do 2 or more of those things. Response: After a character leaves play, ready Prince Imrahil. (Limit once per round.) On paper (or card?) it looks good, but in reality how many times do you lose allies or heroes each game? Perhaps not so often. One thing to consider though, is that the turn you lose an ally (or even a hero) is probably just the turn when you need another character to turn up and defend an attack. Consider the situation, you've rationed out your defenders and then you get hit with a shadow card that knocks out your weak exhausted allies. Just when you need him, Imrahil will be ready.\n\n \n\nThat is the simple way to use Prince Imrahil, to carry on as normal and be thankful when he gets a bonus readying. But maybe with a little bit of careful deck construction we can come up with something interesting…\n\n \n\nIn the immortal words of MC Hammer, 'It's Hama time'.\n\n \n\nThe staging area is hotting up, you've got a location you need to clear and a couple of bad guys adding to the threat total. Your heroes are Hama, Prince Imrahil and a 3rd unknown entity (let's face it, it's probably Spirit Glorfindel) In your hand are Menedlor's Flight and Vassal of the Winglord. In an ideal world, you've got Support of the Eagles and Horn of Gondor equipped to Hama. Play Vassal of the Winglord, commit Imrahil to the quest, exhaust Support of the Eagles to give Hama a total of 6 attack. Use Menedlor's Flight to get Vassal of the Winglord back to your hand. Imrahil gets readied, Hama gets his resource back and when he declares his attack, you get Menedlor's Flight back as well. Rinse and repeat as desired.\n\n \n\nAnyway that might be a bit far fetched but it gives you an idea of the sort of thing the Prince can be involved in. Below are some cards which have good synergies.\n\n \n\nHeroes:\nBoromir (Can raise your threat to ready him)\nElrohir and Elladan (Pay to ready)\nHama (Recycle Menedlor's Flight)\n\n \n\nAllies:\nBrok Ironfist (Put him into play when you lose a Dwarf Hero for a double whammy)\nBeorning Beekeeper (Discard to damage enemies, desperate measure)\nBofur (Spirit Version - If you quest successfully he goes back to your hand)\nDescendent of Thorondor (Even better with Menedlor's Flight or sneak attack)\nDunedain Watcher (Discard to cancel a shadow effect)\nEomund (Ready all Rohan characters when he leaves)\nEscort from Edoras (Focus on the quest, knowing that you can clear it and still have Imrahil ready afterwards)\nLandroval (Discard to Get a hero back)\nThe Riddermark's Finest (Discard for 2 progress on a location)\nTrollshaw Scout (Attack and discard)\nVassal of the Winglord (Attack and discard)\nWatcher of the Bruinen (Defend and discard)\nWinged Guardian (Defend and discard)\n\n \n\nAttachments:\nBorn Aloft (Like Menedlor's Flight, consider using with Snowborn Scout or similar)\nCram (Discard to ready)\nHorn of Gondor (Gain a resource point whenever a character leaves)\nMiruvor (Ready Imrahil again and reusable)\nUnexpected Courage (Ready again)\n\n \n\nEvents:\nGrave Cairn (Add the attack of a just discarded character to Imrahil for some revenge)\nMeneldor's Flight (Return an eagle to your hand)\nRear Guard (Discard a leadership ally for +1 willpower per hero)\nRide to Ruin (Discard a Rohan ally for 3 progress on a location. Combine with SS for 4 progress)\nSneak Attack (You know the drill)\nValiant Sacrifice (Draw two cards when an ally leaves)\n\n \n\nI can see some opportunities to make Prince Imrahil into that all rounder that he wants to be. Give him a couple of Dunedain attachments and he can be a force to be reckoned with in questing, attack and defence."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709077","commentId":709077,"userName":"MyNeighbourTrololo","timestamp":1350148507,"content":"Imrahil is my only custom hero at the moment(except from one of the Elrond sons which is pointless without the other one, so I don't count him).\n\nAnd I use him in association with Bifur(Spirit). 4 Willpower at the expense of 1 spirit resource per turn is pretty neat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709093","commentId":709093,"userName":"John85","timestamp":1350156218,"content":"MyNeighbourTrololo said:\n\nImrahil is my only custom hero at the moment(except from one of the Elrond sons which is pointless without the other one, so I don't count him).\n\nAnd I use him in association with Bifur(Spirit). 4 Willpower at the expense of 1 spirit resource per turn is pretty neat. \n\n\n\nWhat do you mean by \"custom hero\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709094","commentId":709094,"userName":"John85","timestamp":1350156363,"content":"@ Abelard - This looks like a great series of posts, good idea!!!\n\nWhat are the odds that Imrahil gets an errata for the new Outland trait? That would be interesting and appropriate.\n\nMaybe we'll get a new version in the AtS cycle (although since we're apparently getting a second Boromir and maybe another Denethor, I'd much rather get some new ones rather than more repeats)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709167","commentId":709167,"userName":"MyNeighbourTrololo","timestamp":1350175325,"content":"By a custom hero I mean the hero which doesn't comes with a Core Set :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709175","commentId":709175,"userName":"CJMatos","timestamp":1350177120,"content":"MyNeighbourTrololo said:\n\nBy a custom hero I mean the hero which doesn't comes with a Core Set :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\n\n\n \n\nSo for you all heroes that are not the 12 from the core set are \"custom\"?\n\nI understand that, because all expansions and AP's say \"This is not a standalone set. A copy of The Lord of the Rings: The Core Set is required to play.\"\n\n \n\nBut I see costum heroes as those that don't exist in Tolkien's books: For instance Beravor, Eleanor or Thalin (all from the core set). Call me an Tolkien-fan or whatever…\n\n \n\n@Abelard: Nice view on Prince Imrahill… I use him a lot in my recent plays with mono sphere deck… I like his ability and the fact that he is an all-round that combos well with other heroes Aragorn (Core) can attack and Imrahill defend or quest; Dain defends; quests togheter with Theodred or Thorin quests.\n\n \n\nAlso a lot of good combos with some allies that have the possibility to get out of play while not dying: Gandalf, the Eagles that you mention or Bofur (spirit)…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709178","commentId":709178,"userName":"ArachneJericho","timestamp":1350177241,"content":" This is the series I'm looking for! Breathing new life into older heroes is excellent. Keep it up!\n\nIs Lorefindel a candidate for a future article?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709213","commentId":709213,"userName":"Abelard3","timestamp":1350187818,"content":"John85 said:\n\n@ Abelard - This looks like a great series of posts, good idea!!!\n\nWhat are the odds that Imrahil gets an errata for the new Outland trait? That would be interesting and appropriate.\n\nMaybe we'll get a new version in the AtS cycle (although since we're apparently getting a second Boromir and maybe another Denethor, I'd much rather get some new ones rather than more repeats).\n\n\n\nGlad you like the idea, this was originally intended as something to fill the news void but I should like to carry on anyway!  Interesting point on the Outlands trait, that is something that I thought about as well when they announced the Steward's Fear.  It seems to me that characters are unlikely to have both Gondor and Outlands so I don't think he will get an errata, more likely a new version.\n\n \n\nCJMatos said:\n\n@Abelard: Nice view on Prince Imrahill… I use him a lot in my recent plays with mono sphere deck… I like his ability and the fact that he is an all-round that combos well with other heroes Aragorn (Core) can attack and Imrahill defend or quest; Dain defends; quests togheter with Theodred or Thorin quests.\n\n \n\nAlso a lot of good combos with some allies that have the possibility to get out of play while not dying: Gandalf, the Eagles that you mention or Bofur (spirit)…\n\n\n\nNice to hear someone is playing with him, as you know I am trying to pick under used heroes so if you have any thoughts about other neglected ones..  The thing about Gandalf is that he leaves play at the refresh phase so unless you sneak attack him it wouldn't help Imrahil too much would it?\n\n \n\nArachneJericho said:\n\n\nThis is the series I'm looking for! Breathing new life into older heroes is excellent. Keep it up!\n\nIs Lorefindel a candidate for a future article?\n\n\n\n \n\nThanks a lot, I was spurred on by your Dwarf synergy article.  Lorefindel is definitely next on the list, after that I may need some ideas about who to cover next.  I dread trying to think of useful situations for Brand, son of Bain!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709225","commentId":709225,"userName":"richsabre","timestamp":1350191677,"content":"Abelard said:\n\n \n\nI dread trying to think of useful situations for Brand, son of Bain!\n\n \n\n \n\nReally? i cant think of a more well-rounded hero. he has 2 willpower, 3 attack, 2 defence and 3 hit points. and 10 threat is nice enough to fit into most decks.\n\nand he's also ranged, so get UC and some weapons on him or dunedain attachements and you have an epic guy\n\nhim and beravor + a lower threat character make a great deck in my opinion\n\nanyways, nice article\n\nrich\n\n PS- you forgot to metion the #1 reason to use these types of 'less useful' heros- theme! happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709226","commentId":709226,"userName":"lleimmoen","timestamp":1350192155,"content":" I had been playing Imrahil a lot. I always kinda liked him, not least for the theme and art. I also wished the restriction were once per phase instead of round, as it would not have made him too powerful (I think) but it would have encouraged even more strict deck-building.\n\nAnd the deck-building is certainly harder with Imrahil than most heroes. Unless you want to play coop, preferably three or four player game where allies will leave play as a rule of heavy combat, you need to pick allies that leave play \"naturally\" due to their ability. You have mentioned these, Horse-breaker, Escort, Riddermark's Finest, Eagles, these all are fit for Imrahil. But Rohan allies are mostly Spirit and Eagles are all Tactics which leaves you with a tri-sphere deck, not that it be a bad idea solo. You are more restricted though in terms of high starting threat, so you've got a hero who needs certain allies and certain heroes (of certain spheres) to get this going. Not easy.\n\nWhat I am quite sure of though is that Imrahil will get a heavy boost with HoN, as will all Gondorians.\n\nIt is a good point that with the Outlands trait (quite interesting I think, having the distinction similar to Silvan and Noldor) we may expect new version of Imrahil. Mind there are 8 new heroes coming and all greatest Gondorians of the time safe Faramir have already got their hero versions. Thus it doesn't surprise me at all that there is a gossip of a new Boromir version, and I think Imrahil may be another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72706-unsung-heroes-of-middle-earth-prince-imrahil/?do=findComment&comment=709456","commentId":709456,"userName":"cordeirooo","timestamp":1350243722,"content":"It is interesting to see that someone pays any attention to Imrahil and Meneldor's Flight.\n I liked your articles. Now I have two good readings in this forum (in addition to Rich's).\n\n \n\nThanks. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "}]}