{"url":"https://community.fantasyflightgames.com/topic/72726-after-quest-phase-are-those-exhausted-characters-still-on-quest/","title":"After quest phase, are those exhausted characters still on quest?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72726-after-quest-phase-are-those-exhausted-characters-still-on-quest/?do=findComment&comment=709192","commentId":709192,"userName":"Cutievalkyrie","timestamp":1350182369,"content":"1. Core set quest 2, after we complete 3a in combat phase(by Legolas skill ), 3b reveals 2 cards for each player and one enemy has the when revealed ability, which is to deal 2 damage to one quest character.\n\n2. What if we complete 3a in quest phase and still get revealed the same card in 3b? Since everyones completed his quest, are they still considered to be in their quest phase?\n\nFinally i made quest 2, i think this game is for 2 players to enjoy the most, not for solo(too hard), and not for 3 or 4 players( too easy)? We use 2 decks, 1  with high threat level powerful heroes to attack and defense, the other deck with quest heroes and ranged allies, perfect game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72726-after-quest-phase-are-those-exhausted-characters-still-on-quest/?do=findComment&comment=709194","commentId":709194,"userName":"CJMatos","timestamp":1350184466,"content":" Characters are commited to quest only during the quest phase.\n\n \n\nIf you put the last progress tokens on quest 2B (3a doesn't have progress nor any other action) during combat phase and reveal a card that says to deal damage to any character commited to quest, you have to ignore that when revealed effect on my opinion.\n\n \n\nIf you complete the 2b quest on the quest phase and reveal the same card (Misty Mountains Goblins is the card that you speak?) then the damage is deal to the characters commited for quest…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72726-after-quest-phase-are-those-exhausted-characters-still-on-quest/?do=findComment&comment=709198","commentId":709198,"userName":"Cutievalkyrie","timestamp":1350184797,"content":"Thank you. This game is nice. I v also ordered mage knight and agricola. Soloable game is great for me and i love them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72726-after-quest-phase-are-those-exhausted-characters-still-on-quest/?do=findComment&comment=709436","commentId":709436,"userName":"GrandSpleen","timestamp":1350238899,"content":" I think the card is Dol Guldur Orcs (choose one character committed to quest, deal 2 damage).  And you're right, the When Revealed effect on this card is ignored if it is revealed outside of the Quest phase, because:\n\n\"Characters committed to a quest are considered\ncommitted to that quest through the end of the quest\nphase, unless removed from the quest by a card effect\".\n\n(manual pg. 14)"}]}