{"url":"https://community.fantasyflightgames.com/topic/72859-dungeons-deep-and-caverns-dim/","title":"Dungeons Deep and Caverns Dim","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72859-dungeons-deep-and-caverns-dim/?do=findComment&comment=710403","commentId":710403,"userName":"Mighty Jim 83","timestamp":1350400472,"content":" Has anyone got anywhere near this with 4 players?\n\nthe set-up just seems ridiculous:\n\nThreat 8 location in the staging area, immune to player card effects (so you can't ignore it's threat, reduce the threat, travel to it, or explore it.)\n\n8 Cards coming off the encounter deck per turn\n\nevery time you lose a riddle Bilbo takes minimum one damage, which you can't heal as he also is immune to player card effects. Likewise, you can't snare or otherwise kill Gollum due to the immune to card effects.\n\n \n\nThe only really doable way to deal with riddles seems to be building monosphere decks, ideally with little variation in card cost and/or very heavy on a single card type. Evidently, what they gain from that build they're going to lose in general game-play utility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72859-dungeons-deep-and-caverns-dim/?do=findComment&comment=710416","commentId":710416,"userName":"Pharmboys2013","timestamp":1350401825,"content":" Its just a very difficult quest; havent done it with four players but i'd imagine its insane.  I've tried it with 2 and 3 players and lost each time.  The goblins just stack and stack and it only takes a few lost riddles to be done.  I've beaten it solo,  but things are generally much more manageable when playing solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72859-dungeons-deep-and-caverns-dim/?do=findComment&comment=710437","commentId":710437,"userName":"richsabre","timestamp":1350403965,"content":"oh this one is crazy- tried it 1 and 3 players and lost each attempt….definatly one you need a tailored made deck for\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72859-dungeons-deep-and-caverns-dim/?do=findComment&comment=710737","commentId":710737,"userName":"lleimmoen","timestamp":1350450786,"content":"I beat this coop, one deck being very uniform in having many events, cost 1 and Tactics cards. This deck was set as the first player and was trying to take as many riddles as possible.\n\nTo answer your question though, I have not tried it 4 players. 3 was very difficult. For four players you need at least 2 very uniform decks, I believe. The good thing about them is that they usually are Tactics which will also help you with the masses of enemies coming at you."}]}