{"url":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/","title":"Brand new to the game, a few questions.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=710577","commentId":710577,"userName":"sammann11","timestamp":1350422593,"content":"?I just picked up the game today, am playing solo, and have a few questions:\n\nIf an enemy survives my attack, at the end of the Combat phase, then do I go ahead and move to the Refresh Phase, then go back to phase 1? If so, then the enemy is still considered engaged for the new turn, and his threat level does not count against my willpower, correct? I guess I'm still just a little unclear on how enemies who survived are dealt with following the combat phase. Any clarification here would be great.\n\nWhat happens to the resource tokens in a hero's pool if he leaves play for any reason?\n\nBecause I am playing solo I am using only one deck. Would I be better off with 2?\n\nShould I take the rulebook's advice and not use shadow cards since I'm brand new to the game? I kinda want to, but did my butt kicked on my first run through - then again, I kinda sorta was still figuring it out and didn't know quite what the hell I was doing :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThanks for any feedback!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=710579","commentId":710579,"userName":"sammann11","timestamp":1350422856,"content":"One more question:\n\nIf an enemy in the staging area has a threat cost higher than the number on my dail, he does NOT engage me, correct? IF so, he just stays in the staging area, adding tp the threat strength, until he can engage me? Can I choose to engage him if I want?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=710593","commentId":710593,"userName":"GrandSpleen","timestamp":1350424730,"content":"sammann11 said:\n\n?I just picked up the game today, am playing solo, and have a few questions:\n\nIf an enemy survives my attack, at the end of the Combat phase, then do I go ahead and move to the Refresh Phase, then go back to phase 1? If so, then the enemy is still considered engaged for the new turn, and his threat level does not count against my willpower, correct? I guess I'm still just a little unclear on how enemies who survived are dealt with following the combat phase. Any clarification here would be great.\n\nWhat happens to the resource tokens in a hero's pool if he leaves play for any reason?\n\nBecause I am playing solo I am using only one deck. Would I be better off with 2?\n\nShould I take the rulebook's advice and not use shadow cards since I'm brand new to the game? I kinda want to, but did my butt kicked on my first run through - then again, I kinda sorta was still figuring it out and didn't know quite what the hell I was doing :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThanks for any feedback!\n\n\n\nHi, and welcome to the game!  I'll try to answer your questions.  \n\n1) Enemies remain engaged with you unless destroyed or moved by some card effect (like A Light In the Dark).  They're going to attack you every round until you deal with them!\n\n2) Enemies that are engaged with players do not count their threat toward the total threat in the staging area, so ignore them during your calculations in the quest phase.\n\n3) If a hero leaves play, their resources are gone.  Even if you revive the hero (immediately or later, via \"Landroval\" or \"Fortune or Fate\")!\n\n4) A lot of solo players play \"2-handed.\"  There's a thread right now on the main forum about it (here [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=725926&efpag=0]).  Some quests are harder with 2 \"players,\" while many are easier.  In the Core set, all of the quests are easier with 2 players, in my opinion.  I think \"Flight from Moria\" in the Khazad-dum expansion is a good example of a quest that may be a little easier with fewer players (or fewer hands).\n\n5) I never played without shadow effects… try it if you're having a hard time winning.  It will make combat more predictable and easier to plan for, but won't help you out in the quest phase, which is where you need to win in order to make progress toward your ultimate goal.\n\n6) If an enemy has a threat cost that is higher than the number on your threat tracker, that enemy will not engage you during the encounter phase.  They'll just remain in the staging area.  Each player is allowed one optional engagement in the encounter phase, so you could still choose to engage that 44 enemy even if your threat is 29.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=710633","commentId":710633,"userName":"sammann11","timestamp":1350432149,"content":"GrandSpleen, thaksfor the feedback.\n\nI may have totry 2-handed. I'm 0-for-3 going at it with a single deck, and that's against the easy quest with no shadow effects! Man, I'm no natural at this! I did make a 50 card spirit/tactic deck and fare much better, but lost near the end.\n\nWith tatctics alone I couldn't ever get enough willpower going to even make it worth \"going active\" for a quest. I had much better luck with the combo deck.\n\nA few more questions I thought of during gameplay:\n\nCertain card effects allow you to place resource tokens on locations. If a location is still in the staging area, but has as many progress tokens on it as it has quest points, do I discard it, or does it have to be moved to the active location first, then be discarded?\n\nDo progress tokens carry or \"bleed\" over from one quest card to another? Say, if I only need 2 more progress tokens to complete 2B, but I get 4 toekns, to two of them carry over to 3A/B?\n\nAs long as two heros share the same sphere of influence, can one pay for an attachment to put on the other. Or, can one pay for an attachment that is of his same sphere to attach to a hero of a different sphere?\n\nAgain, thanks for any feedback!\n\nPS - any tips for the new guy to actually win one of these **** \"starter\" quests? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=710676","commentId":710676,"userName":"player543086","timestamp":1350441037,"content":" Questions:\n1. If you place enough progress token on a location (be it in the staging area or an active one) it is immediately explored (it gets explored i.e. discarded)\n2. No, progress tokens do not bleed to the next stage\n(you first put all gained progress tokens on the current stage and then if their number is grater or equal to the required one you progress to the next stage discarding all collected progress tokens)\n3. Once you pay (here you need sphere/resources matching) for a attachment you can attach it to any legal (attachment cards specifies what legal means) target. So you can freely attach a card to another hero even if \"someone else paid for it\". In multiplayer you can even attach cards to another players cards.\n\nAs for tips:\nPlay some with starter decks (especially spirit, lore and leadership) against the first scenario. You should be able to beat it on a fairly regular baisis (at least once you get basic strategies down) - this will help you to get the feeling for which cards work and which do not this will be of a great help once you start building your own deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=710720","commentId":710720,"userName":"richsabre","timestamp":1350448133,"content":"tips:\n\n-start deck building quickly- i personally think the starter decks hinder your progress at this game\n\n-use lore/spirit/leadership with perhaps aragorn, beravor and eowyn  as heros\n\n-utilize 'card combos' to get the most out of your deck, ie putting steward of gondor on aragorn to give him extra resources to make sure he can ready after questing. there are many of these but the basic idea is to use 1 card in order to make another more powerful…..another example is letting gloin take damage which gives him resources. this is dangerous but if you give him self preservation then he can heal himself and still gain extra resources.\n\n-there are some must have cards to include in most decks- these are:\n\ntest of will\n\nhasty stroke\n\nunexecpted courage\n\nsteward of gondor\n\nyou may as well put in celebrians stone if you have aragorn\n\nprotector of lorien is good for getting rid of extra copies of cards, and combos well with a good card draw, though it has been errated to make it less powerful\n\nif you find solo to hard then i would say try two handed- i used to play only 1 handed solo until a month ago, and i have had alot of success with it however i have been playing since the core release and i can say that it was frustrating losing so much at the start.\n\ndont expect to win dol guldur solo\n\nif you want tips on anduin then search in 'drowing on the anduin' which is a thread that was here last year. i also started a 'anduin mega thread' (make sure you add fantasy flight games to the search for it to come up)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=711860","commentId":711860,"userName":"sammann11","timestamp":1350591851,"content":"Thanks, all\n\nTurns out, I'm not AS bad at this as I thought. After getting my butt whupped by the Mirkwood entry-level quest right outta the box, without using shadow cards in combat, I knew something was up. I just couldn't be that horrible. I thought: \"I must have missed something in the rule book.\"\n\nSure enough, I did. In my brain, I scrambled the 1 defender rule with the attacking phase and come up with only 1 character may attack. Once corrected, I smashed right through the quest twice. So…not a bad card player (for a newbie), just a BAD reader ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nA few more questions, though: When attaching an attachment card to a character, like say Steward of Gondor, and the text reads that I may exhaust Stweard of Gondor, do I exhaust the attachment card itself, or the character it is attached to?\n\nThanks for the tips!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72879-brand-new-to-the-game-a-few-questions/?do=findComment&comment=711862","commentId":711862,"userName":"John85","timestamp":1350592231,"content":"sammann11 said:\n\nThanks, all\n\nA few more questions, though: When attaching an attachment card to a character, like say Steward of Gondor, and the text reads that I may exhaust Stweard of Gondor, do I exhaust the attachment card itself, or the character it is attached to?\n\nThanks for the tips!\n\n\n\nAlways Exhaust the card (i.e. attachment) unless it says \"Exhaust attached character\" or something like that."}]}