{"url":"https://community.fantasyflightgames.com/topic/72883-gollums-anguish/","title":"Gollum&#039;s Anguish","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72883-gollums-anguish/?do=findComment&comment=710595","commentId":710595,"userName":"GrandSpleen","timestamp":1350425391,"content":"Hi all,\n\nGollum's Anguish is a card in the encounter deck for Return to Mirkwood.  It has the following text:\n\n\"When Revealed: Raise the threat of the player guarding Gollum by 8. That player must choose a new player to guard Gollum, if able.\" \n\nTonight I was played a 2-player game.  My threat was 46 and I was guarding Gollum when this card came out.  The card eliminated me, but here's my question: is this game over or am I allowed to pass Gollum over to the other player?  \n\nSome treachery cards use the word \"Then…\"  According to the FAQ, this is intentional and significant.  From the official FAQ:\n\n\"(1.15) The word “then”\nIf a card effect uses the word 'then,' then the preceding effect must resolve successfully for the subsequent dependent effect to resolve.\"\n\nThis language is not used on Gollum's Anguish, so how am I to understand the card's effect?  I don't think this falls under the umbrella of \"simultaneous effect timing.\"  I can only assume that FFG intentionally chose not to use the word \"Then,\" which I believe had been defined well before Return to Mirkwood was released (right?). But I'm not sure how to interpret the result.\n\nYour thoughts?\n\nGS"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72883-gollums-anguish/?do=findComment&comment=710724","commentId":710724,"userName":"richsabre","timestamp":1350448344,"content":"it says 'that player must choose a new player if able' - now im just getting used to co op play, but i would read this as the player must be in play to do the choosing, otherwise it game over, right?\n\nor perhaps the 'if able' means that if the player is not able to chose, it goes to the remaining player anyways\n\nperhaps someone else with more co op experience than me can help\n\nrich"}]}