{"url":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/","title":"Unsung Heroes of Middle Earth: Glorfindel (Lore)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=710932","commentId":710932,"userName":"Abelard3","timestamp":1350473401,"content":"Welcome to Volume Two of my Unsung Heroes of Middle Earth series. Today's article will be looking at Glorfindel, the elven lord of legend.\n\n \n\nM1011.jpg [http://lotrlcg.com/img/med/M1011.jpg]\n\n \n\n \n\nAvailable from the word go in the core set, (Lore) Glorfindel offers strong questing and attacking abilities with 5 hit points and a total of 12 threat. Like Prince Imrahil, this makes him a typical balanced hero. Thematically, his healing ability can feel slightly disappointing for a hero who famously slew a balrog. He is portrayed in this case, more as the Glorfindel who delivers Frodo to Rivendell. With the release of Foundations of Stone, we were presented with a Spirit version boasting a powerful low threat value and a cheap card (Light of Valinor) to off-set his disadvantage. This, with the reduction in usefulness of healing as the game has progressed has tended to render Lorefindel less useful.\n\n \n\nSo let's look at the details. For 1 resource per turn, you can heal 1 damage from any character. The good thing about this ability is that, unlike many others, Glorfindel doesn't need to exhaust in order to use it. This leaves him free to commit to another action without wondering whether he'll be needed in the healing department. The downside is the cost of 1 resource token to recover a fairly meagre 1 damage. Since lore is the sphere focused around healing, he could potentially put his tokens to better use with a card like Warden of Healing. Simply save two tokens and bring in the warden who can then heal not just 1, but 2 characters and for free every turn.\n\n \n\nSo how can we get more out of Glorfindel and find a good use for his abilities that render him more useful than his alter ego? A great choice is to pick Elrond as one of your heroes. With his passive ability to boost all healing by 1, he doubles the effectiveness of Glorfindel's ability and can really make that resource token feel worth spending. Thematically, it's also great fun to be in control of a couple of Elven lords. With Elrond's high defence, he's the perfect partner to work with Glorfindel's weakness in that area. The downside is their combined threat cost of 25, as high as 3 heroes might give in many spirit heavy decks. So what are your options? Another Lore hero seems redundant and the cheap ones don't have an obvious role with these two. Spirit is a good option to open up some very nice cards like Light of Valinor and Elrond's Counsel. Eleanor comes in at a nice 7 threat and gives you the chance to cancel those nasty treachery cards from the word go. Dwalin or Nori can work well in a dwarf focused deck (though really, you'd be mad to use Elrond and Glorfindel over Dain in that set up) and Eowyn gives strong questing power from the word go. Leadership is also an interesting option to think of with potential to use Gloin and find a use for Glorfindel's healing. Finally tactics can make for a powerful deck to blitz through quests. Consider Hama and eagles for event recycling and the fact that Elrond could give a bonus to Radagast's healing power as well as sharing the cost of eagle allies.\n\n \n\nPersonally, I think a great advantage of Lore Glorfindel over Spirit Glorfindel is starting with a bonus rather than a disadvantage. Spirit Glorfindel needs to find Light of Valinor before you feel entirely comfortable questing with him, Lore Glorfindel can quest immediately and also start spreading the healing if things go badly in the early turns. Combined with someone like Eleanor, you can feel pretty confident about dealing with whatever comes out of the encounter deck. Then, as the game progresses you can add in things like Asfaloth to really make him shine.\n\n \n\nBelow is a summary of useful cards with synergies.\n\n \n\nHeroes:\nElrond (Boost his healing)\nGloin (Pair up for resource factory)\n\n \n\nAttachments:\nAsfaloth (Very strong location clearing ability – made for Glorfindel)\nLight of Valinor (No exhaust to quest, allowing use of his attack skill as well)\nResourcefulness (Spare tokens for healing)\nRivendell Blade (Use on a Noldor)\nRivendell Bow (Use on a Noldor)\nSteward of Gondor (Extra generation to spend on healing)\n\n \n\nEvents:\nElrond's Counsel (Powerful threat reduction for Noldor characters)\n\n \n\nUltimately, it is very difficult to make a case for Lore over Spirit when it comes to Glorfindel, but hopefully this gives you some ideas about where he might be the better choice and possible deck building around him where you have a starting set-up that's ready for anything the game throws at you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711037","commentId":711037,"userName":"Dam the Man","timestamp":1350483244,"content":"I had him initially in my Lore/Leadership deck of Denethor, Gloin and him, which I think is/was the best deck, it could handle just about any situation, thus freeing the other deck to focus more on one thing. I was never disappointed with him, but did replace him with Loragorn once that AP was released, with the plan of using Spirit Glory Boy in my Spirit/Lore deck. Once you had allies out, you didn't necessarily need him to quest, so that 3 attack was nice, especially since Lore allies at that time lacked a proper punch. And with 5-hp, he could take that odd undefended hit with less risk than 4-hp Gloin. As for his high threat, my decks all had 29 starting threat (apart from Spirit/Lore) and I never did worry about it being that high."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711051","commentId":711051,"userName":"lleimmoen","timestamp":1350483995,"content":"Cards you mention, Counsel, Valinor, Asfaloth make the original Glorfindel quite playable. Still, two of them being Spirit to one Lore, they make the new version even better. Thus it is indeed really hard not to prefer the Spirit alternative.\n\nThe best use for the Lore one is in coop I feel, with the other deck running Elrond to boost the healing but not to go over board with the threat. Legolas is a good companion here for the supply of the Elven weapons."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711098","commentId":711098,"userName":"Captain Poe","timestamp":1350487840,"content":"I was able to beat Dol Guldor solo by using a deck with Lorfindel. I found he was very useful IF you had the ability to see what was coming up from the encounter deck. He's a good quester and attacker, but its vital to know which you need him to be. Rumor of the earth works great with him for this purpose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711145","commentId":711145,"userName":"John85","timestamp":1350491786,"content":"Just wanted to say \"thanks\" again for this thread Abelard. I find it to be very useful and informative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711191","commentId":711191,"userName":"cordeirooo","timestamp":1350496352,"content":"Captain Poe said:\n\nI was able to beat Dol Guldor solo by using a deck with Lorfindel. I found he was very useful IF you had the ability to see what was coming up from the encounter deck. He's a good quester and attacker, but its vital to know which you need him to be. Rumor of the earth works great with him for this purpose.\n\n\n\n \n\nI had a very similar build where the main focus was Glorfindel (Lore), but I never was able to reach even 50% in Dol Guldur (even 'cheating' when Glorfindel was selected to 'deflect' the selection). Never even reached the Nazgûl. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711463","commentId":711463,"userName":"Captain Poe","timestamp":1350547682,"content":"I did it with him, legolas, and eyowyn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711475","commentId":711475,"userName":"Ellareth","timestamp":1350549493,"content":"I never like any heroes with 11 or 12 threats, unless they provide specific advantage that glues the deck together.\n\n \n\nLoragorn's threat reduction can be central strategy, Dain's Global boost, Elrond's resource management (and boost later), Imrahil and Aragorn's readying abilities, Beorn's early game advantages and so on.\n\n \n\nBut with lore Glorfindel, I find his ability lacking very much.\n\n \n\nIf his healing ability was limited once per round and didn't cost anything, I can see use of it (still weak ability for threat of 12 though, but better).\n\nBut at a cost of resource and once per round with 12 threat?\n\nI mean even if you pair him up with Gloin, Gloin takes 1 damage to get 1 resource, then you use that 1 resource to heal 1 damage, net result being transfer of Lore resource to Leadership resource, and if you have Gloin, Leadership resources should be abundent relative to Lore ones……\n\n \n\nHigh threat heroes need to be paired up with low threat ones, and ironically the hero FFG introduced to glue high costing heroes togehter is… Glorfindel, the Spirit version.\n\n \n\nHe may have seen some lights in days of core set, simply due to lack of choices in heroes (provides decent attack in Spirit/Lore deck), but Glorfindel's song will remain unsong for me for forseable future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711971","commentId":711971,"userName":"Abelard3","timestamp":1350618945,"content":"Thanks all for your interesting responses,  I think I would tend to agree that unless FFG introduce a big use for healing or something to give him the edge over Spirit Glorfindel, he is almost always going to lose out.  Any thoughts on other heroes to look at?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=711986","commentId":711986,"userName":"lleimmoen","timestamp":1350624756,"content":"Since you have done two Glorfindels you could also do two Aragorns. However, both versions are probably given enough attention, so whilst the conversation could be interesting, it doesn't really go well within the series.\n\nI am not sure about this one but I feel Eleanor is among the heroes not played very often now. Or is she?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712116","commentId":712116,"userName":"Xaanalinos","timestamp":1350644722,"content":" imo dwalin is the next one. There are too many dwarfs that could be put in the 3 of them instead of dwalin, but oh wait he get not realy secret combos. From spirit dwarfs Nori still is better than Dwalin :<"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712139","commentId":712139,"userName":"lleimmoen","timestamp":1350648087,"content":"Xaanalinos said:\n\n imo dwalin is the next one. There are too many dwarfs that could be put in the 3 of them instead of dwalin, but oh wait he get not realy secret combos. From spirit dwarfs Nori still is better than Dwalin :<\n\n\n\ngood call, i cannot see myself ever playing him again… and i hope to get an ally alternative in the next hobbit pack so that the company stays whole… and bombur too actually, the first version is too bad… pretty please, caleb?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712142","commentId":712142,"userName":"Abelard3","timestamp":1350649020,"content":" Good idea on Dwalin, I had dismissed the dwarves as all being too useful.  I don't think it should be too hard to come up with some arguments for him however."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712249","commentId":712249,"userName":"Xaanalinos","timestamp":1350661386,"content":" aye but oh well he isnt as might as other dwarfs :< just for now best combo for dwarf 3 heroes: nori ,ori, dain lots of willpower, lots of attack cuz of dain. with nori u just put bofur for 1 resource just to lower ur threat by 1 and give another 3 willpower to quest (and take some dmg if need :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]). Add lots of dwarfs to deck and voila! one of best decks is here :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712258","commentId":712258,"userName":"richsabre","timestamp":1350663180,"content":"i was going to say dwalin too- i think it is easy to give good combos for him given the great dwarven pool and dain, but this doesnt mean the card i good- comapre him to other dwarves and hes a bit crap\n\nshame as i like the art…i mean he's not aweful, just not great\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712267","commentId":712267,"userName":"Xaanalinos","timestamp":1350664776,"content":" actualy his ability isnt crap at all… even goblins get trait \"orc\" so still it counts to his ability. good combos for him? Ranged mechanism, few cards to attack before enemies + Unespected Courage…. So Hama to get tactic events + Dwalin and probably Dain to boost attack. Not sure if i good remember but wasnt here a card to put one of discard pile on top of encounter deck? and ofc supports just to boost attack , and place progress tokens why kill an enemy. But its still not as good as nori and his ability to lower threat :<"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712270","commentId":712270,"userName":"richsabre","timestamp":1350665049,"content":"Xaanalinos said:\n\n actualy his ability isnt crap at all… even goblins get trait \"orc\" so still it counts to his ability. good combos for him? Ranged mechanism, few cards to attack before enemies + Unespected Courage…. So Hama to get tactic events + Dwalin and probably Dain to boost attack. Not sure if i good remember but wasnt here a card to put one of discard pile on top of encounter deck? and ofc supports just to boost attack , and place progress tokens why kill an enemy. But its still not as good as nori and his ability to lower threat :<\n\n\n\ni didnt say his ability was crap- just compared to the rest of the dwarves, hes not that great in a general sense\n\nive tried him in my dain deck as im sure most have, and he is about the least effective of the whole dwarven hero range\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712288","commentId":712288,"userName":"GrandSpleen","timestamp":1350667764,"content":" My wife really likes Dwalin… I try not to influence her when she picks heroes, because I want to her to be her own player (and not my puppet!).  But I cringe a little when she picks Dwalin as her dedicated attacker, because he needs more help than some other heroes to do enough damage.  But!  With Dwalin in play, she is more free to target ME with The Galadrhim's Greeting [http://lotrlcg.com/pages/cardFocus.php?Card_Key=1046], which is nice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712307","commentId":712307,"userName":"Mr Coffee","timestamp":1350670461,"content":"richsabre said:\n\nXaanalinos said:\n\n \n\n actualy his ability isnt crap at all… even goblins get trait \"orc\" so still it counts to his ability. good combos for him? Ranged mechanism, few cards to attack before enemies + Unespected Courage…. So Hama to get tactic events + Dwalin and probably Dain to boost attack. Not sure if i good remember but wasnt here a card to put one of discard pile on top of encounter deck? and ofc supports just to boost attack , and place progress tokens why kill an enemy. But its still not as good as nori and his ability to lower threat :<\n\n \n\n \n\ni didnt say his ability was crap- just compared to the rest of the dwarves, hes not that great in a general sense\n\nive tried him in my dain deck as im sure most have, and he is about the least effective of the whole dwarven hero range\n\nrich\n\n\n\n \n\nSame here.  I don't think anyone really thought he was really all that bad… until Nori came along.  So I had my Dain/Bifur/Dwalin combo, but I found that I just rarely actually got to use Dwalin's ability.  Maybe once or twice a game, definitely not every turn…  But he allowed for my cheap Spirit cards and otherwise helped feed Bifur's ability to get all my Lore dwarves out there for Dain to inject with his dwarven steroid juice… lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/72910-unsung-heroes-of-middle-earth-glorfindel-lore/?do=findComment&comment=712448","commentId":712448,"userName":"Xaanalinos","timestamp":1350698128,"content":" hmm but maybe instead of giving some advice with heroes maybe lets do same things with other cards? Like\n\n the-end-comes-rtr.jpg [http://www.cardgamedb.com/slir/h288/forums/uploads/lotr/the-end-comes-rtr.jpg]\n\n \n\nOr Radagast there are plenties of cards that im not sure with what cards/situations it will work well. (just like that stupid event which only could be nice for givin back objectives and nothing more…)? Actualy almost every hero what left for that topic actualy get such instinct synergies. Or just make every hero with his synergies its all up to u ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}