{"url":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/","title":"Saying goodbye to Winged Guardian…?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=711922","commentId":711922,"userName":"legolas18","timestamp":1350604596,"content":" So with the arrival of Heirs of Numenor soon, I've noticed one of the cards that they've spoiled is one called \"Defender of Rammas\". According to the picture, his stats show a cost of 2, no willpower, 1 attack, a whopping 4 defense, and 1 hit point.  Winged Guardian, however, has the stats of no willpower, no attack, 4 defense, and 1 hit point, for the same cost of two.  But the biggest difference here is that Winged Guardian costs 1 Tactics resource to keep him in play after he defends, whereas this Defender of Rammas looks like he stays in no matter what.  So why would you choose Winged Guardian over Defender of Rammas when they have the same stats, except for the Defender adds an attack, and he doesn't cost to defend? (Unless you've worked up a mischievous plan with Winged Guardian attributing to Horn of Gondor or Prince Imrahil or something of that nature) gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=711928","commentId":711928,"userName":"DarkCatalyst","timestamp":1350605326,"content":"Winged Guardian can be pulled from your deck with Support of the Eagles. He can also be payed for by Radagast, go into Eagles of the Misty Mountains when he goes, and be used with Support of the Eagles to boost the defense of a hero. There are lots of reasons to use Winged Guardian instead of Defender of Rammas, depending on how you're building your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=711929","commentId":711929,"userName":"legolas18","timestamp":1350605601,"content":"That's true. I didn't mean to overlook all of the benefits of winged guardian, such as all those you mentioned, plus, he does have sentinel unlike the Defender of Rammas.  It's just at first glance, the Defender is a better choice. But with all the buffs, especially Support of the Eagles, which I completely forgot about, Winged Guardian is very helpful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=711931","commentId":711931,"userName":"Shiv@n","timestamp":1350606460,"content":"Well, Defender of Rammas, as a Gondor card, will benefit from boost too… Heirs of Numenor and surely Against the Shadow are going do provide some good synergy cards for the Gondor deck.\n\nTo answer your question, both Wingued Gardian and Defender of Rammas are good cards, but they are not going to be use in the same \"thematic\" deck. One for Eagle and one for Gondor. Il you don't bother to have a theme in your deck, I assume you would prefer Defender of Rammas since he has no \"drawbacks\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=711973","commentId":711973,"userName":"lleimmoen","timestamp":1350619088,"content":"I made similar thread when the card was first previewed, I think Defender of Rammas is very, very strong. Especially taken in account the siege mechanic and all the possible Gondor synergies.\n\nOn the other hand, as mentioned above, Eagles are still very worth it. They are made for coop where the Guardian can indeed top Defender due to his sentinel keyword. And I hope their time is still to come yet with Gwaihir the Windlord lurking in the clouds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=712454","commentId":712454,"userName":"Mighty Jim 83","timestamp":1350701331,"content":" Winged Guardian will be better with the new cards- if he's questing in a siege, you don't have to pay to not discard him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=712501","commentId":712501,"userName":"leptokurt","timestamp":1350720331,"content":"As has been mentioned, Winged Guardian is a crucial card for any Eagle themed deck. You can use them to defend once and discard them afterwards to boost the Eagles of the Misty Mountains ATT and DEF values The same can be done with Vasall of the Windlord, so you can easily create a 4 ATT and 4 DEF ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=713421","commentId":713421,"userName":"Mr Coffee","timestamp":1350918149,"content":"Mighty Jim said:\n\n Winged Guardian will be better with the new cards- if he's questing in a siege, you don't have to pay to not discard him.\n\n\n\nGreat observation! \n\nSo for a total of 4 resources (one time), you could play both a single copy of Winged Guardian AND Defender of Rammas which would provide a total defense of 8 in the Siege quests that pit your defense (instead of willpower) against the Encounter decks threat to fulfill questing…  Let me say that again much simpler:\n\n4 resources = 8 progress tokens (potetentially)\n\n… and you get to ignore Winged Guardian's forced discard due to not defending….\n\nI'll take that all day long…\n\nNow imagine 3 copies of each.  That's a s-ton of potential defending AND questing (given the appropraite scenario), freeing up your heros to attack, exahust for actions/abilities…. or take high tea with the queen if they want!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73005-saying-goodbye-to-winged-guardian%E2%80%A6/?do=findComment&comment=713423","commentId":713423,"userName":"Mr Coffee","timestamp":1350918252,"content":"… (also makes me excited for Vassal of the Windlord and it's 1-resource/3-attack quest boost for the Battle quests!)…"}]}