{"url":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/","title":"dwarrowdelf axe","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/?do=findComment&comment=712397","commentId":712397,"userName":"GrandSpleen","timestamp":1350684996,"content":"Dwarrowdelf Axe has the text:\"Response: After attached character attacks, deal 1 damage to the defending enemy.\" \n\nDoes this mean after the attack fully resolves?  Just thinking about this card used with Dwalin… could interfere with his ability if it placed damage before attack resolution."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/?do=findComment&comment=712474","commentId":712474,"userName":"richsabre","timestamp":1350710688,"content":"man - this one gave me a headache for a long time…i posted a thread about it, and people seemed to be split down the middle.\n\ni will try and find it…..****- cant find it.\n\ntheres a BGG thread which annoyingly ends without resolution…so im stuck as i cant remember what the ruling was (if any)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/?do=findComment&comment=712481","commentId":712481,"userName":"MyNeighbourTrololo","timestamp":1350714733,"content":"My bet is that damage placed after the attack resolves, so Dwalin won't get his ability to work unfortunately.\n\nMy bet is based on wording. First of all, card text reads \"after\". Then, for me, to damage the enemy before the attack, wording must be something like \"after attached character declares an attack/declared as an attacker\". "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/?do=findComment&comment=712485","commentId":712485,"userName":"monkeyrama","timestamp":1350715739,"content":" Given that FFG haven't offered a strict timing map for this game, these issues can be messy. For my part, I wonder if one extra piece of evidence to argue for it activating post attack, and therefore not benefiting Dwalin, is that it only costs 1 resource. That's pretty cheap for a guaranteed bit of damage, unlike all the other weapons. Just a thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/?do=findComment&comment=712623","commentId":712623,"userName":"GrandSpleen","timestamp":1350750862,"content":"  My thought is that it means after attack resolution. If it was meant to be before resolution, I'd think the card would read \"after attached character is declared as an attacker.\"  But I realize that \"after attached character attacks\" might not be equal to \"after an attack in which attached character resolves,\" hence the question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/?do=findComment&comment=716185","commentId":716185,"userName":"ooryl2","timestamp":1351505818,"content":"GrandSpleen said:\n\n  My thought is that it means after attack resolution. If it was meant to be before resolution, I'd think the card would read \"after attached character is declared as an attacker.\"  But I realize that \"after attached character attacks\" might not be equal to \"after an attack in which attached character resolves,\" hence the question.\n\n\n\nHere's the rulebook/faq rulings on a few similar cards that might help here:\n\nFAQ:  When do the \"after this enemy attacks\" Forced effects like those on Chieftan Ufthak and Wargs resolve?\n\nA: These effects resolve immediately after step 4 of enemy attack resolution.\n\nFrom the rulebook, step 4 is determining combat damage.\n\nSo, for those cards, the \"after this enemy attacks\" effects trigger after damage is determined and the defending card is possibly destroyed.\n\nERRATA: Dol Guldur Beastmster\nShould read: “Forced: When Dol Guldur Beastmaster\nattacks…”\nThe additional shadow card is dealt when the Dol\nGuldur Beastmaster is chosen during step 1 of enemy\nattack resolution.\n\nThe \"When [] attacks\" effect occurs when the Beastmaster is chosen as the attacking enemy, therefore resolving before any combat occurs.\n\n \n\nSo, the \"After attached character attacks\" on the axe should be resolved after combat damage is determined, assuming the enemy is still alive.  Further, if for some reason adding this damage would screw up any other card combo, it's not a Forced action, therefore the Response is optional.  You wouldn't have to add the damage if for some reason you didn't want to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73051-dwarrowdelf-axe/?do=findComment&comment=716269","commentId":716269,"userName":"richsabre","timestamp":1351514350,"content":"ive sent a rules request so we can know this one for sure\n\nrich"}]}