{"url":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/","title":"Questions on Escape from Dol Guldur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=712672","commentId":712672,"userName":"sammann11","timestamp":1350767576,"content":"Alright - I'm new at this - many questions:\n\n1) For this quest (or any where the setup text has me place cards in the staging area) after I follow the setup instructions on 1A, play proceeds to the 1st phase of round 1. When it comes time to quest, and draw 1 encounter card from that deck per player, at this point there will have been a total of 5 encounter cards drawn: 1 for each objective plus the two (playing with 2 decks) during the quest phase. Do I have this part correct so far?\n\n2) When 1 hero is still \"prisoner\" and the other 2 heroes controlled by that player leave play, what happens? Do any allies that have survived remain in play, since the \"imprisoned\" hero has not been discarded, and therefore that player has not been \"removed\" from the game? If this is the case, do enemies still engage that player? If so, can I let their attacks go undefended? Since I have no heros to absorb their undefended attacks, where does that damage go? Can the allies still participate in defending and attacking?\n\n3) When does the Nazgul of Dol Guldur enter play? I can't find any clarification on the quest cards' text. Does he enter into the staging area during the quest phase, or does he directly engage a player?\n\n4) Does anyone have any tips for deckbuilding for this quest?\n\nI have been doing 2 separate \"2 sphere decks\". I have Aragorn and Theodred and Gimli in one deck and Eowyn, Beravor, and Dunhere in another. I've tried to build the decks 2/3 cards for the spheres that I have 2 heroes of and 1/3 cards of the hero that I have one sphere of. I've thought about shifting Aragorn over to build a \"Leadership/spirit deck\" since he can gain the spirit sphere with the Celebrian's stone. It seems like Tactics isn't real popular among you forum posters (from what I've read of relatively recent threads) but I like Gimil's hard hittin power.\n\nAny suggestions as to what spheres to combine and what heroes do best against this quest would be great! Is my deck building philosophy off the mark, or are there other suggestions you guys would offer?\n\nThanks!!!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=712684","commentId":712684,"userName":"GrandSpleen","timestamp":1350770432,"content":"1. Correct.  With 2 decks, after the first questing phase 5 cards will have been revealed (Excluding \"surge\" effects and so forth).\n\n2. You've lost the game if your only remaining hero is the imprisoned hero.  From the official FAQ: \n\n\"Q: If all of a player’s heroes (except for the captured hero) are destroyed during the Escape from Dol Guldr scenario, is that player eliminated from the game?\nA: Yes, the player is eliminated, and the players (as a group) have lost.\"\n\n3. The Nazgul enters play when you rescue the prisoner.  The prisoner may be rescued whenever you place progress tokens on quest card 2B.  Rescuing the prisoner is a \"response\" effect to placing progress tokens, so it is optional -- you can place progress tokens without rescuing the prisoner.  But, once you choose to rescue him/her, the Nazgul goes into the staging area (per the \"Forced\" effect on the Nazgul's card).\n\n4. I have horrible luck with this quest.  Solo, people often say not to even bother.  If attempting solo, try a mono-sphere deck.  With 2 decks, I have about a 10% success rate (but I'm not the most skilled player!!).  We've tried mono-sphere and dual-sphere, and had more luck with the latter.  Our best decks for this quest seemed to have 1) allies who are good for combat and 2) heroes who quest well.  That's about all I can offer you… good luck!\n\nP.S. I LOVE tactics.  It doesn't get much love on these forums, but I think that is because we have a lot of SOLO players on the forums.  If playing solo -- and, in particular, with only one deck -- tactics can't pull its weight.  In multiplayer there is a much greater niche for a tactics-heavy deck (especially with cards-- eagles-- from the mirkwood cycle)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=712692","commentId":712692,"userName":"sammann11","timestamp":1350772167,"content":"One more question! While setting up the quest, If one of the 1st 3 encounter cards I draw is a treachery, is one of those 3 objectives now unguarded? If so, during the questing phase of the 1st turn when I draw an encounter card from the deck, if that card is a location or enemy will it become the guardian? Is the objective card in the staging area get a \"new\" guardian everytime an enemy or location card is revealed form the encounter deck?\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=712697","commentId":712697,"userName":"sammann11","timestamp":1350772475,"content":"Grandspleen - again, thanks for the feedback.\n\nI seem to like tactics, too. Then again, in every RPG video game I've ever played I tend to go with the big-bruising, hack-n-slashing, tank-style character. So, obviously, I'm partial.\n\nI may not have typed/explained question 2 well. What I meant was: I'm playing 2 handed (double fisting, as I've seen on these forums, is a brilliant term!). I'm looking for an answer to the following scenario: one \"hand\" has 2 discarded heroes and the one prisoner, while my other \"hand\" still has 1 or more heroes. What happens then?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=712816","commentId":712816,"userName":"Angus Lee","timestamp":1350811145,"content":"sammann11 said:\n\nOne more question! While setting up the quest, If one of the 1st 3 encounter cards I draw is a treachery, is one of those 3 objectives now unguarded?\n\n \n\nYes, after the treachery is resolved and discarded.\n\nsammann11 said:\n\nIf so, during the questing phase of the 1st turn when I draw an encounter card from the deck, if that card is a location or enemy will it become the guardian? Is the objective card in the staging area get a \"new\" guardian everytime an enemy or location card is revealed form the encounter deck?\n\nThanks!\n\n\n\nNo, the objective will not get a new guardian.  It will remain in the staging area unguarded until claimed or after effects affect it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=712817","commentId":712817,"userName":"Angus Lee","timestamp":1350811323,"content":"sammann11 said:\n\nI may not have typed/explained question 2 well. What I meant was: I'm playing 2 handed (double fisting, as I've seen on these forums, is a brilliant term!). I'm looking for an answer to the following scenario: one \"hand\" has 2 discarded heroes and the one prisoner, while my other \"hand\" still has 1 or more heroes. What happens then?\n\n\n\nThe relevant FAQ quoted by GrandSpleen explains clearly that the \"hand\" with the prisoner is eliminated from the game; since the prisoner cannot be rescued anymore, the group of players (or \"hand\" in this case) has lost the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=712836","commentId":712836,"userName":"GrandSpleen","timestamp":1350816069,"content":" Yep.  What Angus said.  There are several quests where everybody loses when one player is eliminated -- whenever there is an ally objective in play (A Journey to Rhosgobel, Return to Mirkwood, The Redhorn Gate…).  Dol Guldur is one, just without an ally objective.  If the player with the prisoner is eliminated, but you still have one player left in the game, you won't be able to rescue the prisoner.  You have to rescue the prisoner to advance beyond quest card 2B, so you can't win the game.\n\nIncidentally, if you rescue the prisoner and that hero is killed later in the game, I don't see anything that would prevent you from winning.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=713035","commentId":713035,"userName":"sammann11","timestamp":1350849508,"content":"Makes sense. Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=713070","commentId":713070,"userName":"sammann11","timestamp":1350856912,"content":"Perhaps 2 players both playing \"2 handed\" (or 1 playing 4 handed) would be a better way to approach this quest. What do you all think?\n\nI am new to the game, and will be buying the expansions in order. That said, I want to try and beat the quests with just the cards that were released at the time of the quests' releases. (Although I plan to go back later and try quests again with new decks as well, of course!)\n\nHas anybody ever beat this big baddy with just core set cards?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=713074","commentId":713074,"userName":"legolas18","timestamp":1350857743,"content":" For me, this would be really hard.  I don't have all the sets yet, but I'm getting closer.  But I think the biggest choice for this scenario is heroes, and probably attachments.  Allies are usually the most helpful, but seeing as how the quest limits you to one ally per turn (except for through special card effects like sneak attack), I think the heroes you choose are very important to this quest.  \n\nJust thought I'd… Throw that in. gui%C3%B1o.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gui%C3%B1o.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=713129","commentId":713129,"userName":"lleimmoen","timestamp":1350879811,"content":" Yes, this one scales badly. More players easier. Two seems just about fun. Four should be rather easy unless for beginners. There are only two surge cards and they are not too bad. The scaling really went wrong here. Solo is almost un-doable.\n\nIf I should recommend one hero here, it would be Boromir. It is very useful to get rid of the small threat enemies early. With more players it is likely to have several of those in the opening rounds. Boromir can block them and kill them - once you let them undefended you are risking a bad shadow and a loss of a hero which can be very crippling as you have one hero in prison.\n\nAlso, Glorfindel and Asfaloth (and the Thror's Map) have proven very important in our games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=713152","commentId":713152,"userName":"GrandSpleen","timestamp":1350886938,"content":" I think 2 is still the optimal number.  With 4 players you still have a one-ally-per-turn restriction, but you have four encounter cards being revealed per turn.  If you have a good card base for all four players, you can maybe get around the ally restriction via Stand and Fights, Sneak Attacks, Vilya, and so forth.  But if you only have 1 or 2 good card bases and you are splitting that among 4 players, I don't think increasing the player number will work in your favor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=713154","commentId":713154,"userName":"lleimmoen","timestamp":1350887355,"content":"GrandSpleen said:\n\n \n\n I think 2 is still the optimal number.  With 4 players you still have a one-ally-per-turn restriction, but you have four encounter cards being revealed per turn.  If you have a good card base for all four players, you can maybe get around the ally restriction via Stand and Fights, Sneak Attacks, Vilya, and so forth.  But if you only have 1 or 2 good card bases and you are splitting that among 4 players, I don't think increasing the player number will work in your favor.\n\n \n\n \n\nGood point actually. I do not cherry pick for scenarios but I do pick decks against them. For Dol Guldur I tend to pick those least ally oriented. Which again is both Boromir and Glorfindel oriented decks.\n\nThe ways around the one ally per round restriction you provided seem just about right, Sneak Attack, Stand and Fight, Vilya, they all work very well here.\n\nThe biggest difference however is in the set up. To get three set up cards for two and four players is a huge difference (not to mentioned in comparison for solo). And one hero out of six or twelve is also not just marginal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=714074","commentId":714074,"userName":"sammann11","timestamp":1351022213,"content":"lleimmon - I like what you wrote at the end there. Having only one hero gone out of 12 is a big advantage over 1 our of 6. One out of six is  like a 16.6% handicap, while one out of twelve is only 8.3%. Plus, as you say - staging the 3 guardians is rough against 2 or 5 heros, but not so bad against 11.\n\nI do see what Grandspleen is saying, though - now you have 4 encounter cards coming up everytime as opposed to only 2. However, while all 4 \"players\" can still only pay for 1 ally per turn, having the extra heros could only help, IMO. I kinda look at it like: 2 cards vs 5 heros or 4 vs 11. There's a 1 hero card advantage right there.\n\nThis way you can get every sphere completley covered (could sacrifice a tactic hero, as they are the most ally-oriented deck in the core set). You would have 3 resoruces minimum per turn (for 3 of the spheres, anyway). And with not using decks made of multiple spheres, you won't be stuck with a hand full/mostly full of cards all from the sphere that you have only 1 hero (and limited resources) of.\n\nI may give this a try sometime in the next week or so and see how it goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=714134","commentId":714134,"userName":"GrandSpleen","timestamp":1351031814,"content":" Very true points, very true.  I think this scenario adheres strictly to the \"3 round\" rule -- that is, winning or losing the scenario is largely decided in the first 3 rounds of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=714145","commentId":714145,"userName":"sammann11","timestamp":1351034025,"content":"That's an interesting point, Grandspleen. I'll have to try and keep track of that. I read somewhere that the intro quest was a 1 on difficulty, Journey down the Anduin was a 4, and that Dol Guldur was a 7 - the hardest. Is there an official document that lists the difficulty of all the different quests?\n\nSpeaking of number of rounds… I read in another post about whether or not players use the quest log - you said you had a spreadsheet. What kinds of numbers/formulas do you put in there? I'd be interested to see what kind of results you can pull from that data.\n\nOn a somewhat related note: Is there a good way to keep track of rounds? I haven't really been keeping track of my scores. And when I do have a nice victory over a quest (as just happened tonight) I think, \"Oh cool…now what was my score?\" and by then I've forgotten how many rounds I've played. I know it could be assimple as keeping tally on a sheet of paper or setting aside a pile of progress tokens, but I just wondered if anyone had a cool little method they used.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=714212","commentId":714212,"userName":"CJMatos","timestamp":1351052885,"content":"sammann11 said:\n\nThat's an interesting point, Grandspleen. I'll have to try and keep track of that. I read somewhere that the intro quest was a 1 on difficulty, Journey down the Anduin was a 4, and that Dol Guldur was a 7 - the hardest. Is there an official document that lists the difficulty of all the different quests?\n\n\n\n \n\nThe rules that came with each pack say the dificult ratting from FFG. But we all know that some difficult rattings are not quite correct. They depend very much on the number of player.\n\n \n\nIf you do not have the rules or all the packs, you can see the rules for each pack on the support page of the LotR:LCG javascript:void(0);/*1351070862883*/ [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=714256","commentId":714256,"userName":"GrandSpleen","timestamp":1351062399,"content":" I tend to keep score for my own satisfaction, but I use the old scoring system (the one given in the manual).   I haven't been adding 10 points per round, so I can't compare my scores to those of others.\n\nReally I was just interested in a win% per quest.  I just made a simple excel spreadsheet and listed the quest name, a brief comment describing the quest (e.g. \"fight a troll then float down the river\"), number of times played, number of times won, and a cell converting that into the win percentage (times won / times played).  I also made a cell to track the last date that I played that scenario.  I was interested in overall win% as well, so I made two measures for that -- one cell does [total games won] / [total games played].  I also made a separate cell that does an average of all of my win%'s.  I made the second one because the \"total\" win% is  heavily influenced by personal choice… that is, if I get frustrated and try Dol Guldur 10 times, my total win% will drop appreciably, but if I was the kind of player who only plays easy quests, that wouldn't happen.  The \"average win%\" measure better reflects my performance in the game overall, I think, with slightly less sensitivity to a preference for breaking myself against hard quests or only attempting the easy ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=714281","commentId":714281,"userName":"lleimmoen","timestamp":1351066564,"content":"I also use the original scoring system for my own purposes (which is why I stopped reporting on the quest log though I quite enjoyed the tool). I find the adjusted scoring a bit anti-thematic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=715039","commentId":715039,"userName":"ricedwlit","timestamp":1351200436,"content":"sammann11 said:\n\nOn a somewhat related note: Is there a good way to keep track of rounds?Thanks!\n\n\n\nI've been playing that every time you pass the first player token (assuming there is more than one player), place a progress token on the threat tracker of the player who is passing first player token. If you are doing one player, then every time you raise threat at the end of the turn, put a progress token on your threat tracker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=715085","commentId":715085,"userName":"jjeagle","timestamp":1351214745,"content":"ricedwlit said:\n\nsammann11 said:\n\n \n\nOn a somewhat related note: Is there a good way to keep track of rounds?Thanks!\n\n \n\n \n\nI've been playing that every time you pass the first player token (assuming there is more than one player), place a progress token on the threat tracker of the player who is passing first player token. If you are doing one player, then every time you raise threat at the end of the turn, put a progress token on your threat tracker.\n\n\n\nI use a similar method, but you have to be careful - the turn count needs to be adjusted at the end of the round. In between refreshing cards/raising threat/passing first player token and the end of the round, there is the Refresh Action window.\n\nIn, for instance, Flight From Moria, it is quite likely that you will complete the scenario in this action window, before you have counted the round for scoring purposes. If you miss this point you will end up counting an extra round against your score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=715445","commentId":715445,"userName":"ricedwlit","timestamp":1351284371,"content":"jjeagle said:\n\nI use a similar method, but you have to be careful - the turn count needs to be adjusted at the end of the round. In between refreshing cards/raising threat/passing first player token and the end of the round, there is the Refresh Action window.\n\nIn, for instance, Flight From Moria, it is quite likely that you will complete the scenario in this action window, before you have counted the round for scoring purposes. If you miss this point you will end up counting an extra round against your score.\n\n\n\nAgreed - so far this is the one time where an action in the refresh can end the game. When playing that one I put on my rules lawyer hat and take care to add the token after player take actions.   I guess it's possible in the future that there will be an event card that lets you directly pay progress onto the quest card (or say kill the final enemy) in which case you would also have this problem. But hey, you just won the game, so take the time to remove the one token you added."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=716074","commentId":716074,"userName":"lleimmoen","timestamp":1351484724,"content":"You can end the game in that phase in quite a few quests actually - pretty much any and every one. Just have Legolas finish off an enemy to add enough progress tokens (or fulfill other requirements); it can be Blade of Gondolin, and it can be any other kill in scenarios where elimination is the key.\n\nOf course, you need some special tools for this, like Quick Strike, Hands Upon the Bow, Hail of Stones or Rain of Arrows but it is all perfectly possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=716498","commentId":716498,"userName":"sammann11","timestamp":1351547838,"content":"Earlier in this thread there was some discussion on playing \"4 handed\", using all 12 Core Set heros with every Core set card in their respective decks to attempt a victory at Dol Guldur.\n\nI am pleased to report that, while not beating the quest, on my first time through I did get all the way to Quest card 3B before I lost, 6 progress tokens shy.\n\nYes, there was massive confusion potential, but I just went slow and made sure I looked over everything during each phase of the round.\n\nThis was by far the most success I've had at this quest. It was quite the mental exercise playing 4 handed, so I may not give it another go until tomorrow or later in the week. But if my brand-new-buns can be this successful during the first attempt, I do feel like it lends some credibility to this strategy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=1028823","commentId":1028823,"userName":"georgioos","timestamp":1395918051,"content":"> 1. Correct.  With 2 decks, after the first questing phase 5 cards will have been revealed (Excluding \"surge\" effect\n\na. do all this 5 cards contribute to the thread when questing?\n\nb. do the enemy cards guarding, attack like normal staging enemy cards or they involved to combat only when i declare i claim the guarded card?\n\nEdited March 27, 2014 by georgios"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=1028835","commentId":1028835,"userName":"MyNeighbourTrololo","timestamp":1395920142,"content":"Do you mean they contribute to any particular thread or this one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=1028856","commentId":1028856,"userName":"georgioos","timestamp":1395921522,"content":"i meant threat! lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=1028942","commentId":1028942,"userName":"Nickpes","timestamp":1395927225,"content":">  \n> \n> > 1. Correct.  With 2 decks, after the first questing phase 5 cards will have been revealed (Excluding \"surge\" effect\n> \n> a. do all this 5 cards contribute to the thread when questing?\n> \n> b. do the enemy cards guarding, attack like normal staging enemy cards or they involved to combat only when i declare i claim the guarded card?\n> \n>  \n\nKalimera !\n\n \n\n1. Yes they all do\n\n2. Yes they may attack like normal staging cards. They could be locations or treachury cards, not only enemies "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=1029923","commentId":1029923,"userName":"PsychoRocka","timestamp":1395970778,"content":"Anyone on here who is using the old scoring system, feel free to add me as I do too so you will be able to compare scores =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=1184753","commentId":1184753,"userName":"Makusi","timestamp":1407268853,"content":"Im a new player and have a few questions about the scenario/rules.\n\n \n\nIt was a long game, around 35 rounds, lost track of it at some point. The game took so long because \"Dungeon Jailor\" shufled back one Object to the encounter deck. And that object was the 3rd last card in the encounter deck.\n\nQ#1: My deck ended in the end of the game so I didnt use \"Out of the dungeons\" or \"Tower gate\" because it says from the player deck. Did I do correctly not to add them because I didnt have a deck?\n\nQ#2: Thorin Oakenshield got killed by a \"When Reaveled: Do 5 damage to a single Hero\"(Hummerhorns). Is it correctly not to reduce the damage of his shield, just directly give the 5 damage and kill him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73076-questions-on-escape-from-dol-guldur/?do=findComment&comment=1184789","commentId":1184789,"userName":"alogos","timestamp":1407270039,"content":"Q#1 : yes.\n\nQ#1 : it is not a when revealed effect, but when it engages you (or you engage it, it is the same). But yes, you only count your defense when defending an attack, never any other time."}]}