{"url":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/","title":"My hopes for the remaining cards in &#039;On the Doorstep&#039;.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714555","commentId":714555,"userName":"Attercop","timestamp":1351103522,"content":"Here are some of the other cards I would love to see in the second Saga expansion:\n\n * Bard the Bowman - as a Hero, perhaps with a special rule that allows him to return an attachment from his controller's discard pile to his hand (mainly thinking about the Black Arrow attachment here). Such a rule could be supported by the quote from the novel when Bard is about to fire this arrow at Smaug: 'You [The Black Arrow] have never failed me and always I [bard] have recovered you'. \n\n * Balin - as a Hero - whilst I am aware that he is effectively dead in all non-saga quests I would like to see Balin as either an ally or hero. Afterall, FFG didn't have any problems creating a card for Ori, who was part of Balin's futile attempt to colonise Moria. I feel he would be best represented by a lore or spirit hero. I also feel that his ability should reflect his skill as a look-out man. \n\n * Oin - as a hero - the other and final member of Thorin's compay yet to have a card devoted to him. Unfortunately, he also dies in Moria along with Balin and Ori, so it may be considered foolish to make a card for him. I would like him to be a lore or tactics hero.\n\n * Gwaihir - as a hero. We have not yet had an Eagle hero and I feel that it would be nice to include him now. He plays an important role both in The Hobbit and The Lord of the Rings. He would probably have to be a tactics hero - especially given the fact that all eagle cards are firmly rooted in the tactics cards.\n\n * It would also be just as nice to see allies with the Dale and Silvan Keywords. \n\n * I hope we do not see any re-designs of current heroes (e.g. Legolas, Dain Ironfoot, Thorin, etc). \n\nWhat does everyone else think about these ideas?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714558","commentId":714558,"userName":"Mr Coffee","timestamp":1351104535,"content":"I agree with pretty much all of this!  My only difference in thought would possibly be with Gwahir…\n\nI'd love to see him, of course.  And I agree that having him as Tactics makes logical sense (since all other eagles are Tactics).  But thematically, I personally see him as a better fit in Lore or especailly Leadership.  Play-wise having him as Lore/Leadership would make for a better vehicle for playing multi-sphere decks. \n\nIf he WASN'T brought into the game as a hero but as an ally, then making him Leadership would be a great tie-in to using Imrahil as you hero for Leadership to bring in his ability to ready every time an eagle leaves play, thus freeing up some resources off of Tactics.  Right now, ALL eagle cards are only payed NORMALLY (not via Vilya, Radagast, etc) through a Tactics hero.  So you either run a mono-sphere deck to pay for them all (and we all know how well Tactics chokes on questing by itself), or you suffer hand/deck-choke if you can't pay for all those birdies for lack of wnough Tactics heros.  I would have to assume that Gwahir (as an ally) would be a spendy toon to bring in, thus locking up even more of your resources.  Making him Leadership would allow for easier multi-sphere, Prince Imrahil as a hero (if Gwahir is not a hero), and/or (possibly even more important) allow you to play Steward of Gondor on someone to pay for all the spendy Eagles.\n\nI find it odd that most/all other factions have at least SOME amount of spreading out through the four spheres (eg. dwarves have rep's in all four, etc).  Yes, some are more consolidated (Rohan is mostly Spirit, etc), but there is at least some movement around the different spheres for most factions.  Eagles is pretty much the only one I can think of (that has a decent number of allies/cards) off the top of my head that is ONLY in one faction….  (feel free to correct me if I'm wrong)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714839","commentId":714839,"userName":"lleimmoen","timestamp":1351167731,"content":"I hope Bard does get a combo with the Black Arrow. It is one of the few items in the story highly associated with the character.\n\nI am also hoping to see Thranduil. I think it has been announced that the escape from Woodland Realm is not one of the quest and the Battle of Five Armies is on the other hand. Thus I feel we're ought to see the Elven King. More so that it would be only the second Silvan hero, despite the fact Thranduil wasn't really but I totally understand the move from the designing point of view."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714846","commentId":714846,"userName":"richsabre","timestamp":1351168413,"content":"Hobbits……why? well its about **** time lengua.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/lengua.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714854","commentId":714854,"userName":"Dam the Man","timestamp":1351170101,"content":"richsabre said:\n\nHobbits……why?\n\n\n\nJust this demonio.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/demonio.gif] !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714875","commentId":714875,"userName":"richsabre","timestamp":1351172964,"content":"haha- i had you in mind when i wrote that Dam…..gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714913","commentId":714913,"userName":"lleimmoen","timestamp":1351179176,"content":"richsabre said:\n\n \n\nhaha- i had you in mind when i wrote that Dam…..gran_risa.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/gran_risa.gif]\n\n \n\n \n\nHobbit player cards, unlike the previous cycles, seem to be done in strong accordance to the theme. So I wouldn't expect to see other Hobbits in the second part of the saga. And I have a hunch it may be the trend from now on. I don't expect to see only Gondorians (and its closest allies) in HoN and AtS but the majority of the cards may go with the theme.\n\nIf that logic holds true, we may wait for more Hobbit characters for the Arnor cycle. Then again, HoN or AtS could stretch to Arnor for a quest or two, as the heirs are indeed there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714933","commentId":714933,"userName":"gokubb","timestamp":1351181247,"content":"I think Bard and Balin are definitely going to be two of the heroes in the next set. As to the OP's doubts about making a character that is dead in the non-Saga quests, they've already broken through that with Thorin and the others that die in the Battle of the Five Armies.\n\nAside from them, I'd love to see Thranduil and Gwaihir. Oin should be there, but as another named Ally like Fili, Kili, etc. Gwaihir would be awesome as a different sphere Eagle that allowed you to use his resources for Eagle cards as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=714986","commentId":714986,"userName":"Narsil0420","timestamp":1351188437,"content":"I really like the idea of having Bard be able to draw back discarded attachments.\n\nI think Balin would work better as a low threat leadership hero, Dain and Thorin are too expensive to use together!\n\nI also really hope for some Dale and Silvan characters including Thranduil. I think the inclusion of Beorn as a hero really opened possibilities up as far as who can be a hero. That being said I highly doubt that we're going to see Gwaihir as a hero. Maybe an ally.\n\nOverall, I was really happy with the player cards from the first Hobbit expansion but I hope for a little more diversity as far as non-dwarf cards go. Not that I'm complaining, I'm having a lot of fun making dwarf decks. Ori/Bifur/Gimli are my latest triumph in defeating all three Hobbit 1 scenarios without changing the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=715149","commentId":715149,"userName":"lleimmoen","timestamp":1351235641,"content":" Well, I really want new Bombur card as the old is quite poor (both art and game design). But then I hope not to see any Dwarven card theme taking spots of other factions for a long, long time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=715250","commentId":715250,"userName":"BoundForGlory","timestamp":1351251106,"content":"Attercop, Attercop 1989 said:\n\n \n\n * Bard the Bowman - \n\n * Balin - as a Hero - \n\n * Oin - as a hero - \n\n * Gwaihir - as a hero. \n\n\n\n Agreed with the first three.  I especially would love to see Oin as a hero.  \n\nGwaihir as a hero I don't really like, just as I am not happy about the Beorn hero.  I'd love to get a Gwaihir ally.  \n\nI'm frustrated that we didn't get a tactics Dwarf hero from the Hobbit story line, and I'm afraid we still won't get one if Bard is Tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=715299","commentId":715299,"userName":"lleimmoen","timestamp":1351260938,"content":"Bard may well be Leadership.\n\nI do like Beorn as a hero, he was certainly a major character in the Hobbit as he was absolutely principal in the Battle of Five Armies, for which I would love to see a card tailor made for Beorn - even if it is so hard as he is immune to player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=715559","commentId":715559,"userName":"Kasatka","timestamp":1351335292,"content":" I think Gwaihir shouldn't be a Hero per-se but rather a hero-replacement in the same way that Brok Ironfist can be used as a replacement Hero in a dwarf themed deck, then Gwaihir could be used to replace a Tactics hero. \n\nI'd propose something like and i'd justify it by saying that Gwaihir is all about doing errands as favours for characters in the Hobbit and LotR so a quest focussed Ally makes sense.\n\nCost:7\n\nWillpower:3\n\nAttack:1\n\nDefence:2\n\nHP:4\n\nTraits: Eagle, Noble\n\nResponse: After an Tactics hero you control leaves play, put Gwaihir into play from your hand.\n\nAnd then maybe some other unique ability that i cannot currently think of. Maybe:\nAction: Exhaust Gwaihir to return the topmost Eagle card from your discard pile to your hand.\n\nor if that proves too powerful…\n\nAction: Exhaust Gwaihir to shuffle up to 5 Eagle cards into your deck from your discard pile.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73262-my-hopes-for-the-remaining-cards-in-on-the-doorstep/?do=findComment&comment=715986","commentId":715986,"userName":"gatharion","timestamp":1351456070,"content":" It seems like it would be a bit odd for them to get shirty about making the dwarves who died in Moria since they made a Thorin hero."}]}