{"url":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/","title":"Now, roll a d6 or…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715336","commentId":715336,"userName":"cordeirooo","timestamp":1351266389,"content":"I need your opinion to develop new mechanics when I travel east - well, when the heroes travel east, to be more precise.\nI have some ideas in mind, like rolling a die and suffering damage equal to the number or an ability that only works when you roll a 6 (10 on a d10 or 20 on a d20) or whatever. Obviously, some abilities would be absolutely impractical with higher numbered dice (like the referred wounding effect above), but I want to know what YOU think is the best.\n\nWhat do you guys think? Would a die complicate the game too much? Would it give yet another dimension? Give me your opinion, and if you will, elaborate as well!\n\n \n\nVote here! [http://boardgamegeek.com/thread/875450/now-roll-a-d6-or]\n\n\nThank you. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715344","commentId":715344,"userName":"richsabre","timestamp":1351267820,"content":"as much as the workings of mathematics and chance interest me, i do not think dice would be a good idea…well, not a bad idea per se…i just dont think it would add anything to the game or if anything would make this game even more luck based than it already is\n\n \n\nnow, that is not to say i dont like your idea….i for one would not be angered if die were included, but in a more subtle way that 'roll X to do X damage'\n\nperhaps the die could add to a certain aspect to the game….dont ask me what because im aweful at that type of thing, but maybe you have an idea\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715350","commentId":715350,"userName":"Hannibal_pjv","timestamp":1351268457,"content":"Rolling could be nice to make some characters more impredictable personality. But would it be fun… Hard to say:\n\n \n\nFor example: Tom Bombadil will help you if you roll 1, sing his song and pass a way when rolling 2-5, Tell you a story if you roll 6… Hmmm…Maybe.\n\nIt means that you can give certaing thing more propably outcome than other, so you can modify the most likely outcome by playing with propability numbers, but all in all dice will add more randomness. But it is definitely an aspect that can be studied!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715351","commentId":715351,"userName":"richsabre","timestamp":1351268522,"content":"Hannibal_pjv said:\n\nRolling could be nice to make some characters more impredictable personality. But would it be fun… Hard to say:\n\n \n\nFor example: Tom Bombadil will helop you if you roll 1, sing his song and pass a way when rolling 2-5, Tell a story if you roll 6… Hmmm…Maybe.\n\nIt means that you can give certaing thing more propably outcome than other, so you can modify the most likeky outcome by palyng with propability numbers, but all in all dice will add more randomness. But it definitely is an aspect that can be studied!\n\n \n\n\n\nthis is sort of what i was trying to come up with - thanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715441","commentId":715441,"userName":"cordeirooo","timestamp":1351283081,"content":"Sure, the damage thing was just an example.\n\nI had some abilities in mind, like a Stealth-like ability based on a lucky roll. The game already - as rich said - has luck in it; it has some ways to manage it somewhat, though: The 'discard a card from the top of the deck' and looking at the number. My intention with the dice is to break this, so everyone would be equal - not a good idea if this would be brought to EVERY aspect of the game, but I still believe it would be interesting.\n\n \n\nIf the poll goes badly against the dice, I will make only one non-cycle scenario based on it - if it goes well, some scenarios on my next cycle will have this aspect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715510","commentId":715510,"userName":"OnkelZorni","timestamp":1351312576,"content":"What I like about this game is that there are no dice rolls needed. For me, there is enough randomness in drawing cards and encounters and shadow cards. Adding another luck factor wont suit me much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715523","commentId":715523,"userName":"Xaanalinos","timestamp":1351322056,"content":" Why adding a dice into game? Isnt better to manage cards? Like Zigil Miner or so? IMO adding a dice would make less ppl try to play that game :?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715552","commentId":715552,"userName":"Kasatka","timestamp":1351333805,"content":" I think this should be held back for scenarios, so that the scenario pack can come with the applicable dice. Perhaps a nice custom dice with Tolkien-esque symbols on it? A d4 would suffice for a random chance mechanic or potentially a d6 but i wouldn't recommend going higher into the realms of polyhedrals lest you forget that this is meant to be a card game after all. the skill is in deck construction and the random chance is through shuffling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715610","commentId":715610,"userName":"Hannibal_pjv","timestamp":1351346306,"content":"One thing where this would be fun is by making a mechanics that encourages waiting in some gaming dilemmas.\n\n \n\nFor example:\n\nStage 2b: There is a guard making his inspection round. Put one spy token to the guard at the end of Refresh phase. If you pass stage 2B, roll a dice. If you roll higher than there are spy tokens on guard, the Guear immediately engages the first player. Othervise discard the guard. proseed to the stage 3A.\n\n \n\nStage 3b: The Smaug is flying above the house roofs. Put one aim token to the Smaug at the end of Refresh phase. When you shoot the black arrow to the Smaug roll a dice and count aim tokens and add them to the dice roll, if the total is more than 6 you kill the Smaug. Otherwice the Smaug engages you!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73345-now-roll-a-d6-or%E2%80%A6/?do=findComment&comment=715624","commentId":715624,"userName":"cordeirooo","timestamp":1351348500,"content":"Xaanalinos said:\n\n Why adding a dice into game? Isnt better to manage cards? Like Zigil Miner or so? IMO adding a dice would make less ppl try to play that game :?\n\n\n\n \n\nTo try new things?\nI'm not advocating the dice in the official rules/game. I'm talking about custom games here.\n\n \n\nAlso, answering a poster in BBG that could help clarify things:\n\n \n\n \n\nQUESTION: \"I have no problem with dice in general, however it's really hard to answer the question without some more information. Could you elaborate on your idea some more? What exactly do you have in mind, what rules would you like to implement? Specifics, please.\n\nHow can I answer whether I prefer d10 or d6 if I know virtually nothing about the actual rule that you'd like to implement?\n\nTo me, all that matters is good mechanics. If you have an interesting idea, one that would fit well with the theme and really add something to the game experience, I don't care if it uses dice or stones or matches or whatever.\"\n\n \n\nSure. The mechanic I was thinking about is new abilities like Stealth, that (without any test whatsoever) would work like this:\n\n\"Stealth is a new ability on very small creatures or enemies with training in not being detected. The ability works based on the creature's natural ability or training and a dice - Stealth can go from 0 to 7.\nWhen Revealed: Roll a die. If the result is 5 or 6, this enemy cannot be engaged and is immune to player's action until the start of the next quest phase\nForced: Before being attacked, roll a die and add the Stealth value. If the total roll minus the attacker's WILL is 5+, the attack is canceled.\"\n\n \n\nAnother one was as a player-side ability, called Powerattack:\n\"The Powerattack ability is present in the most fearsome and courageous men, elves and dwarves. When you attack with a character with Powerattack, you may decide to discard that character; if you do, roll a die and add the results as damage tokens on the enemy.\"\n\n\nThis wouldn't be a good idea with Heroes, but allies are a go.\nI'm not that worried with player-side because people don't usually play with custom-made player cards."}]}