{"url":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/","title":"Do you think we&#039;ll get a new kind of ally card -- war machines?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716678","commentId":716678,"userName":"Cunir","timestamp":1351591856,"content":"i like the way this next cycle is going, with the big battles and tactics heroes being able to quest, and the great artwork too, and i've been thinking about what cards we'll get in the big battle quests.\n\nim hoping that we'll be able to play actual war machines, like battering rams and siege towers. they could work in exactly the same way as allies do, except they will be machines instead of people. then we could bring them into play and turn them against the enemies and locations. they could give them a load of attack points and maybe some measly defence and hit points, and obviously they wont be able to quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716687","commentId":716687,"userName":"richsabre","timestamp":1351594894,"content":"yes- i said pretty much the same when HON was first previewed, with the obvious parallels drawn to the trebuchets in the ROTK films. it would sort of be an opportunity missed if we didnt get something\n\nwe could also i suppose get siege operators as the actual allies and then give them different attachments (to show them operating different machines)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716692","commentId":716692,"userName":"Rapier1","timestamp":1351595652,"content":"It would also be interesting because we know some enemies have the \"Siege\" keyword. \n\nSo they could make effects which target all siege engines (burning arrows or something like that), which might target enemy and ally cards on occasion.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716707","commentId":716707,"userName":"Cunir","timestamp":1351597181,"content":"maybe they could make it so a particular quest stage can only be beat by one of these machines. you might have to scale a wall, or something like that, so first of all you have to beat all the defenders down, before finally bringing the siege tower in to scale the wall.\n\nif it was me, i would probably make it so you can only bring it into play when you party hits a certain size. so you have to build up your party with allies first. if they let you bring it in right at the start with only 3 heroes in play it wouldn't seem right, because its a huge machine\n\nalthough if they did that, it would probably be more like an objective card than a normal ally card, because you wouldnt be able to win if you didn't include it in your deck. so maybe thats a dumb idea. i'd prefer having it as an ally card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716779","commentId":716779,"userName":"Rapier1","timestamp":1351607081,"content":" I like your suggestion - but it would be scenario specific as you say. It's a nice idea though - we may well see a manning the siege engines step in one of the adventures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716784","commentId":716784,"userName":"Xaanalinos","timestamp":1351607855,"content":" IMO that should be some kind of objective cards instead of ally. If it would be ally card it would be totaly stupid to me. Cuz u could use it any other scenario (or that card would be useless in any other scenarios)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716791","commentId":716791,"userName":"Cunir","timestamp":1351609407,"content":"if they limited them to just work in \"battle\" or \"battleground\" locations, or whatever they are called, then it would work okay. then you would only be able to use them in places that fit\n\ni agree that it would be a bit dumb if people were allowed to play it in quests like \"the hunt for gollum\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=716809","commentId":716809,"userName":"Xaanalinos","timestamp":1351611489,"content":" But if it would be normal \"ally card\" that u could include into deck u wont get copies of serious cards that could be used everywhere. thats why IMO its bad idea. I would rather get another ally with some good stats instead of war machines. And as objective it would be lot better. Maybe u have to attack to a hero and he cannot quest,attack or defend. He use only action at obj. and that would be awesome imo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=717301","commentId":717301,"userName":"lleimmoen","timestamp":1351688035,"content":"If the trebuchets (or other) are made into allies, they need to work in any scenario. If eagles can be used everywhere, then why not trebuchets. Obviously, if they work better against some quest than other, that is alright too. I think they should have a certain value for every quest, and then a slightly special value in quests with sieges. I don't feel this is hard to design."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=717323","commentId":717323,"userName":"richsabre","timestamp":1351691145,"content":"lleimmoen said:\n\nIf the trebuchets (or other) are made into allies, they need to work in any scenario. If eagles can be used everywhere, then why not trebuchets. Obviously, if they work better against some quest than other, that is alright too. I think they should have a certain value for every quest, and then a slightly special value in quests with sieges. I don't feel this is hard to design.\n\n\n\nagreed, i see no reason we can haul trebuchets in moria if eagles can fly in there, but this of course is a debate that has been around from the start and everyone has their boundaries. i see myself as a lore pureist, but i still would include them in my 'not so lore friendly decks'\n\nand i like your idea of making them less powerful in a non siege quest….im not sure i get the whole 'battleground' mechanic yet, but perhaps the card could have 'if no battleground in play, trebuchet gets -X (whatever stat)'\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=719071","commentId":719071,"userName":"FAAx87","timestamp":1352103264,"content":"They could include a mechanic to discard the warmachine after a quest card is completed. If you go on, you abandon your trebuchets (or whatever…) to travel faster."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=719415","commentId":719415,"userName":"player1761766","timestamp":1352171930,"content":"FAAx87 said:\n\nThey could include a mechanic to discard the warmachine after a quest card is completed. If you go on, you abandon your trebuchets (or whatever…) to travel faster.\n\n\n\nThat could make sense. If you're using your attack to quest, then they could make siege engines an ally that gives something like -4 willpower to the group while in play, which wouldn't affect a siege-quest but would make them pretty stupid to include in something like Hunt for Gollum or whatever. Then the quest card, when completed, discards all siege engines from play like you say. \n\nOr maybe you cannot travel to locations while a siege engine is in play, so having one would be detrimental to the party in a location-heavy quest. \n\nI suppose it could just as easily enter the game as a trebuchet on the walls of the white city, as Rich says, which are locations from the encounter deck that benefit the group when drawn - for example, the location could deal one damage to every enemy in the staging area if you have a suitable ally in play who can operate them, then discard the location from play. Or deals one damage at the beginning of the round while that ally remains in play (which could then lead to specialised enemies who target allies or whatever). Or something. That way, the actual war machine remains quest-specific but we still get an ally we can use in other quests if need be. \n\nOn a tangent, I think friendly encounter cards could be an interesting thing to develop. We have a small number like the Dwarrowdelf objectives, or some locations like that glade in RtM that lowers threat or whatever, but it seems we rarely get rewarded for completing certain parts of quests. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73505-do-you-think-well-get-a-new-kind-of-ally-card-war-machines/?do=findComment&comment=720382","commentId":720382,"userName":"Chaos101","timestamp":1352363388,"content":"I think war machines would work best in a Northern Tracker kind of way. But only against battlegounds or siege locations. And as such a Northern Tracker cannot effect a Battlegound or Siege. So including them for using in Passage through Mirkwood would be pretty dumb."}]}