{"url":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/","title":"They should give us a treasure at the end of each cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716716","commentId":716716,"userName":"Cunir","timestamp":1351597744,"content":"i quite liked the introduction of treasures in the Hobbit quests, and i think it would be really cool if we were awarded a treasure at the conclusion of each cycle. They should have given us one at the end of \"Shadow and Flame\", because that is like a big boss fight. When you complete it you should be rewarded with a great weapon or piece of armour. But you should only get it if you've completed the entire cycle -- all 6 quests. Only then would you qualify to receive it. Then you'd have a great incentive to complete each quest in the chain, and it would also help them to sell a few more adventure packs too"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716749","commentId":716749,"userName":"CJMatos","timestamp":1351603572,"content":" And how exactly they verify that you completed the cycle quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716758","commentId":716758,"userName":"Rapier1","timestamp":1351604617,"content":" Hrm, I don't know.\n\nI like the idea of treasure during a cycle - but I don't think linking them together like this would work that well. \n\n \n\nThe best way for them to put treasure in a cycle would be to include it in the deluex expansion too, and who would want to wait for 6 pack releases to get to use it \"legally\" ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716769","commentId":716769,"userName":"richsabre","timestamp":1351605997,"content":"CJMatos said:\n\n And how exactly they verify that you completed the cycle quests?\n\n\n\ni think the poster means we get the card in the pack, but we reward ourselves with it, not FFG which is what i assume you mean\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716790","commentId":716790,"userName":"Cunir","timestamp":1351609133,"content":"thats what i mean, yeah. like we do in the hobbit. because there's nothing to stop us including those hobbit treasures in our deck straight away (if we don't mind cheating). it's all done on trust.\n\nthey should include a treasure in the last adventure of each cycle, in the same way, which we can \"unlock\" once we've successfully completed the whole cycle. it would be a good climax and reward, and something we can work towards, instead of just playing each quest on its own"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716816","commentId":716816,"userName":"richsabre","timestamp":1351611941,"content":"i actually like the idea and i hope they continue with the treasure thing…i found the treasures in the hobbit and the ways they worked a little of an anti climax given the hype before hand….sort of like, find this card in quest 1 and you can include it in quests 2 + 3..but no more!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716829","commentId":716829,"userName":"Cunir","timestamp":1351612825,"content":"i thought it was a bit limited as well. but i suppose we will get a bit more use out of them when the Hobbit part 2 comes out.\n\nbut at the very least i thought they should have let us equip our regular Bilbo with them, whenever we played with him in the other quests. it seems a bit silly to have Bilbo finding Sting in the hobbit box, and then you go and play with the other Bilbo in the Shadows of Mirkwood cycle and he's not allowed to use it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716911","commentId":716911,"userName":"Mr Coffee","timestamp":1351621393,"content":"richsabre said:\n\ni actually like the idea and i hope they continue with the treasure thing…i found the treasures in the hobbit and the ways they worked a little of an anti climax given the hype before hand….sort of like, find this card in quest 1 and you can include it in quests 2 + 3..but no more!\n\nrich\n\n\n\n \n\n… or just as ham-stringed:  \"Here's your treasures.  Oh by the way, one of the characters won't really be able to use his except for one encounter (Sting), cuz we're gonna make him pretty much useless for the last quest.  Enjoy!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=716957","commentId":716957,"userName":"sammann11","timestamp":1351627400,"content":"I like the idea of a treasure card. Maybe like an Objective card. Deal it into the staging area or off to the side and if you beat the wuest, you recieve it for future use in your deck. True, you could just put it in your deck if you wanted to cheat, but if you wanted to play fair, it would be kind of cool. A really unique attachment for later use. Almost like finding a really sweet weapon after you whup up on a bi boss in a video game. Cool idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=717079","commentId":717079,"userName":"Ted Sandyman","timestamp":1351652976,"content":"The treasure idea is great but its obviously up to ourselves to be honest. We could gain a treasure to use in that cycle after we meet certain criteria during the first AP such as defeating a certain character or finding an objective in the encounter deck. Maybe attaching this objective to a hero but if that hero takes a hit for example that treasure could be lost. (Just off the top of my head thought) It would be an interesting addition if ffg were to develop it. Going back to being honest with yourself, i  only just got the Hobbit treasures the other week as i hadnt been lucky enough to draw the troll cave and have the purse and key. I only shuffle the key and purse into the encounter deck when the trolls enter play. I find it hard convincing myself that you set out from the shire then can possibly find the key and purse in the hobbit lands straight away! Bilbo has got to steal from the trolls in my opinion, not just find a key and purse in the middle of nowhere. Does anyone else add the objectives in when the trolls enter play or do you whack em in at the start?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=717114","commentId":717114,"userName":"Cunir","timestamp":1351662131,"content":"i also think it would be pretty cool if each main character had their own unique treasure, which we have to find and unlock.\n\nas the story and cycles continue, they can slowly introduce them in the quests at relevant points. so bilbo has already got sting. aragorn can have his sword. frodo can have his version of sting too.\n\nonce we've unlocked them for that character, it should be available for any other quest where we use that character"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=717184","commentId":717184,"userName":"Mighty Jim 83","timestamp":1351676922,"content":"we've basically been houseruling that Bilbo gets sting (either starting in play, or in his deck, depending on the situation).\n\nthematically it fits, and it makes the original Bilbo card less stupid. (and the third hobbit quest vaguely possible)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=717191","commentId":717191,"userName":"Cunir","timestamp":1351677413,"content":"yeah, thats the other thing that i didnt like about treasures -- the fact that you had to start with them shuffled into your deck. which meant that you might never get to use them. i think you should be able to buff up your characters at the beginning, provided that you won them fair and square. anything else doesnt make sense, story wise"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=717311","commentId":717311,"userName":"Xaanalinos","timestamp":1351689251,"content":" But if u start with some kind of treasures it would make u awesome early game wont that made game easier? Thats why i dont realy enjoy trasuries… It should be add as attachment into a hero but that would make game easier… and if FFG will made some kind of harder quest that would make ppl without treasuries so hard game that they will never finish it. Thats kinda weird."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73511-they-should-give-us-a-treasure-at-the-end-of-each-cycle/?do=findComment&comment=717548","commentId":717548,"userName":"Angus Lee","timestamp":1351716172,"content":"Ted Sandyman said:\n\n I only shuffle the key and purse into the encounter deck when the trolls enter play. I find it hard convincing myself that you set out from the shire then can possibly find the key and purse in the hobbit lands straight away! Bilbo has got to steal from the trolls in my opinion, not just find a key and purse in the middle of nowhere. Does anyone else add the objectives in when the trolls enter play or do you whack em in at the start?\n\n\n\nI play this scenario according to the rules as written, i.e. shuffle the key and the purse at the start but discard them if they are drawn before the Trolls enter play.  When the Trolls enter play, the encounter discard pile has to be shuffled into the encounter deck, so I have no problem in drawing the key and the purse again."}]}