{"url":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/","title":" How is this game doing?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=717303","commentId":717303,"userName":"JCourtney","timestamp":1351688723,"content":"How is this game doing from Fantasy Flights perspective? Do they plan to have this around for a long time?  I know they're cutting back on CoC, or at least making it not into monthly expansions and now they have Netrunner has a new upstart.  I know this game is coop, so I don't know if it not being competitive hurts it's sales and thus it's future. \n\nEvery time I jump into the forums here, people are always complaining about lack of news of upcoming products.\n\nJust wondering how bright the future is for this game? I was hoping the New Hobbit movies would bring out a whole slew of support for the game.\n\n \n\n*Edit*- Since posting Fantasy Flight games has hired a new designer picked straight from the player community.  This game is showing enough that it'll be around for a very long time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=717320","commentId":717320,"userName":"richsabre","timestamp":1351690797,"content":"this game is doing fine and there is absolutely nothing that points to it being otherwise for a few years yet\n\nyes there was a lack of news for a while but i believe this was more down to ffg doing other things that lack of anything to say, as we have since then had an entire new cycle previewed, when have a deluxe pack out soon, and the last of the hobbit saga packs out as well\n\nthis game is still young, it has a big following, and it is of course based on one of the most popular fantasy worlds of all time….this should pretty much keep it around for a while yet\n\nas for the coop hurting or helping im not sure, but ffg seem to be brining out packs for events such as lake town and osgiliath, and then doing them as print on demand, so they seem to be using events to their advantage\n\nthe smaller packs are still to come out on a monthly basis with 6 in a cycle as it has been from the start\n\nffg are also reprinting the core set\n\nyou can probably tell from how im saying all this that im a huge player of the game, but i do think in an unbaised manner that the game is healthy as is its future\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=717329","commentId":717329,"userName":"CJMatos","timestamp":1351692257,"content":"richsabre said:\n\nthis game is doing fine and there is absolutely nothing that points to it being otherwise for a few years yet\n\nyes there was a lack of news for a while but i believe this was more down to ffg doing other things that lack of anything to say, as we have since then had an entire new cycle previewed, when have a deluxe pack out soon, and the last of the hobbit saga packs out as well\n\nthis game is still young, it has a big following, and it is of course based on one of the most popular fantasy worlds of all time….this should pretty much keep it around for a while yet\n\nas for the coop hurting or helping im not sure, but ffg seem to be brining out packs for events such as lake town and osgiliath, and then doing them as print on demand, so they seem to be using events to their advantage\n\nthe smaller packs are still to come out on a monthly basis with 6 in a cycle as it has been from the start\n\nffg are also reprinting the core set\n\nyou can probably tell from how im saying all this that im a huge player of the game, but i do think in an unbaised manner that the game is healthy as is its future\n\nrich\n\n\n\n \n\nAgreed with rich.\n\n \n\nThey are also reprinting some of the first cycle of AP's. \n\n \n\nFor that I believe they expect that the upcoming Hobbit movies will expand the number of players for this game…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=717375","commentId":717375,"userName":"JCourtney","timestamp":1351696986,"content":" I'm glad to hear it, as I expect to start playing shortly. \n\n \n\nI'm assuming they have no shortage of content to develop cards from with how big the LoTR universe is. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=717391","commentId":717391,"userName":"richsabre","timestamp":1351698721,"content":"JCourtney said:\n\n \n\n I'm glad to hear it, as I expect to start playing shortly. \n\n \n\nI'm assuming they have no shortage of content to develop cards from with how big the LoTR universe is. \n\n \n\n \n\ngiven the vast history of middle earth, not just in the famous books but in the unfinished tales and various appendices, i would say that ffg will give up before they run out of material happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\ni did a poll of most wished for next locations here [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=713771]\n\nadding them up gives about 15 possible cycles at least…..so given 1 cycle is about 6 months, thats what…about 7 years?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=717434","commentId":717434,"userName":"cordeirooo","timestamp":1351701590,"content":"This game is doing pretty well!\n\nThe major complaining is about lack of news, not products.\n\n \n\nTo be honest, when I started I kind of loved the flowing with 1 Adventure Pack per month, but I feel it should slow down a bit - I'm probably alone on this, but still. The game is flowing well, and it is maturing too; new mechanics being implemented, making the game more complete. I would not like to see, however, this new stuff being mandatory, forcing Abelard to make more threads about Unsung Heroes (which, let's face it, makes you want to play them after that good read).\n\n \n\nThere is also a good amount of custom-made quests at BGG - not trying to auto-promote me, but there is. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\nLookout for Feonix's stuff, he seems to be the longest running in the custom-scenario makings.\n\n \n\nHope we can add you to our ranks pretty soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=725416","commentId":725416,"userName":"JCourtney","timestamp":1353291064,"content":" Just ordered two core sets and the whole Mirkwood cycle.  I'm going to play through all that content and buy the next deluxe pack and it's cycle pack.\n\nHow many people have three core sets just to have a complete set of every card?  I'm thinking about it, but that's quite a bit of money for only a few cards. \n\nI'm glad with the latest news of the hiring of another designer.  That means we should be in for a long future.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=725420","commentId":725420,"userName":"player543086","timestamp":1353292024,"content":" At first I felt it was a waste to buy even a second core set but after playing the game several time I decided it makes sense and got it. Third core seems so wasteful that I am still resisting buying it for 12 or so missing cards (even second hand) although for some reason it does not feel so outlandish after 150+ plays. We shall see if I will give in :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\nIn any case I will only do it if I can get it used and very cheap."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=725448","commentId":725448,"userName":"richsabre","timestamp":1353298867,"content":"JCourtney said:\n\n Just ordered two core sets and the whole Mirkwood cycle.  I'm going to play through all that content and buy the next deluxe pack and it's cycle pack.\n\nHow many people have three core sets just to have a complete set of every card?  I'm thinking about it, but that's quite a bit of money for only a few cards. \n\nI'm glad with the latest news of the hiring of another designer.  That means we should be in for a long future.\n\n \n\n \n\n\n\ni dont- but if i could i would. quite a few people do it, and id recommend it (im a completionist anyways)….but yes, having 3 copies of unexpected courage is always nice\n\ni think 2 core sets is perhaps best, between spending too much money and getting extra cards. the 3rd really will have alot of extras\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=725589","commentId":725589,"userName":"Rapier1","timestamp":1353322958,"content":" I keep telling you guys, all this complaining over nothing is giving the wrong impression. Now we've had to clarify for a new player that the game isn't dead.\n\nWhat if others like him read the forums and then decided not to bother?\n\n \n\nAlso welcome to the game, it's a lot of fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=725605","commentId":725605,"userName":"JCourtney","timestamp":1353325505,"content":"I don't see Fantasy Flight hiring a brand new associate developer, if they had any plans to slow down development on this game.  The new expansion is just coming out and a whole another cycle, plus another saga pack for The Hobbits.  I wanted to make sure the game was healthy and had a future before I started investing in it.  I've posted on here and numerous other forums and all the information was laid out.  \n\nThis game is doing fine and will be around for quite some time.  I really believe with the new Hobbit movies that this game will probably be able to pick up a new surge of players. \n\n \n\nNow if only I could go about explaining how to play this game with the wife…\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73564-how-is-this-game-doing/?do=findComment&comment=725629","commentId":725629,"userName":"richsabre","timestamp":1353329037,"content":"Rapier said:\n\n \n\n I keep telling you guys, all this complaining over nothing is giving the wrong impression. Now we've had to clarify for a new player that the game isn't dead.\n\nWhat if others like him read the forums and then decided not to bother?\n\n \n\nAlso welcome to the game, it's a lot of fun.\n\n \n\n \n\nthose who were complaining were not complaining about the product going dead (at least not this time round) but about ffg's lack of interaction with its player base\n\nbeing fair, theres 1 negative thread on here for every 20 positive….thats pretty **** good for a game\n\nbesides, the main 'doomsaying' thread happened before HoN news was even released, and half of those guys arent even about.\n\npersonally i was one of those who never saw any reason to doubt the life of the game….but everyone to themselves i suppose\n\nif the OP wants any other reason to commit to the game then heres some more happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]\n\n-the game is based on one of the (the?)  most succesful fantasy series…ever\n\n-whether you like the films or not, i think no one can doubt the hobbit films are good for this game\n\n-this game is fairly young….if GOT can do several years im sure tolkien can\n\n-im not a BGG regular, but i believe it is one of the most popular games at the moment\n\n-just went into a UK book store today and they had FFG products in…..when this happens in northern UK you know youre popular\n\nanyways im rambling…..once again welcome\n\nrich"}]}