{"url":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/","title":"Introducing: Power Attack and Stealth traits","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717438","commentId":717438,"userName":"cordeirooo","timestamp":1351701936,"content":"After the dice-roll idea (which wasn't well received), I bring two new traits. They are very simple in execution, don't require bookkeeping and are really fun.\n\nThe idea is very simple:\n Powerattack - While ATK is good enough to show how good swordsman or how strong a character is, I feel that Powerattack adds a new feeling to what raw strength means.\n Stealth - When I quest with my characters, I always imagine some of them (mostly elves or dúnedain) scouting before the party starts to walk, just to make sure everyone (including children and non-combative people) will be safe; so Stealth is really good to describe this in more depth: Some characters are very good to go unnoticed, but others can make everyone as well!\n\nBasicly:\n\n \n\n \n\nPowerattack X\nAfter this character attacks, you may discard him to inflict X damage on the defending enemy.\n\nStealth X\nIf this character is commited to a quest, this player's threat is considered to be lowered by X during the engagement checks.\n\n\nNotes:\nPowerattack may seem very strong at first, but the cost of discarding a guy for that important moment really makes me feel like I'm in Tolkien's Lord of the Rings.\nWhen I started thinking about stealth, I was using a mechanic with dice, then, when I left the dice aside, stealth started to shine more. The first version only worked if you successfully quest (which makes sense), but then one of my friends said that a very good scout is the one who always has a second plan - it is kind of obvious, so I changed it to work whenever he went questing. Is it too powerful? I don't believe so.\n\n \n\n \n\nYou can see the new cards using this traits here [http://boardgamegeek.com/thread/877504/introducing-powerattack-stealth-traits].\n\n\n So, what you guys think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717446","commentId":717446,"userName":"richsabre","timestamp":1351702417,"content":"whilst ive never been one to go for home brew, i admire your ideas, theyre themeatic and seem to fit well in middle earth\n\ni am going to say something which is very cliche so i apologise in advance- they seem to be a little over powered. i know the character is discarded in the attack trait, but with that spirit card that brings allies back from the dead regardless of sphere (forgot the name) mixed with dwarven tomb, i think a very powerful combo indeed could be set up\n\nanyways, just my thoughts\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717458","commentId":717458,"userName":"cordeirooo","timestamp":1351703759,"content":"richsabre said:\n\nwhilst ive never been one to go for home brew, i admire your ideas, theyre themeatic and seem to fit well in middle earth\n\ni am going to say something which is very cliche so i apologise in advance- they seem to be a little over powered. i know the character is discarded in the attack trait, but with that spirit card that brings allies back from the dead regardless of sphere (forgot the name) mixed with dwarven tomb, i think a very powerful combo indeed could be set up\n\nanyways, just my thoughts\n\nrich\n\n\n\n \n\nOh snap! **** Dwarven Tomb!\nDidn't even thought of that… u.u\n\n \n\nWell, yes, with recursion in mind, being 'killed' isn't really a problem. Maybe removed from the game, but that seems overkill as well.\n\nDid you found Stealth to be overpowered as well?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717466","commentId":717466,"userName":"richsabre","timestamp":1351704395,"content":"mmmm- im not so sure about stealth, fittingly it seems more subtle than the attack one, but to an extent i think yes it is a little powerful\n\nit would depend of course how many allies have the trait….and i assume X is the cost of the ally correct? if many do have stealth you could have 3 or 4 in play questing and your chances of having to battle high threat enemies would be very low indeed\n\nbut on the flip side engagement checks arent the most pressing matter in the game, i apart from 'ambush' enemies, so perhaps the impact is somewhat lessened\n\nalso it would depend on what the willpower of these scouts would be….if they were moderate  or low then perhaps it would add an aspect of 'are they worth committing this phase or not?' to the game, so i think it could work in a way, though as i say, it depends on the stats\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717470","commentId":717470,"userName":"Shiv@n","timestamp":1351705367,"content":"I see your Powerattack like a Sacrifice which could stand for \"Discard this ally to inflict damages equal to its attack to an enemy engage with you\".\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717493","commentId":717493,"userName":"cordeirooo","timestamp":1351708006,"content":"@Shiv@n: Hey! No, Powerattack only works when attacking. The text on this page is just an explanation, not the rule itself (the cards with the rules are in that link).\n\n \n\n@rich: Nope, X is the value on the card. Some cards (most) have 1-2, the most powerful (like Haldir, the Hero version) may have greater amounts. The idea is another dimension; of course, having a 4Will with Stealth is a no-brainer, but when the cards have some drawback of some sort it becomes a dilemma - a cool one, in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717795","commentId":717795,"userName":"Mr Coffee","timestamp":1351772965,"content":"richsabre said:\n\n… \"but with that spirit card that brings allies back from the dead regardless of sphere (forgot the name)\"…\n\nrich\n\n\n\nStand and Fight.\n\n \n\nI agree to an extent that the Power Attack \"combo\" (as described) could be potent, but I don't think I would claim it over-powered or \"broken\" (been a while since I've heard that term, so thought I'd toss it out there for fun…).  If the benefit was only 1 or 2 points that would be a low enough number to justify sacrificing a character with those \"return\" cards out there.  And quite honestly, it's not as if those cards aren't already out there being useful for returning all sorts of other \"discard to do this…\" allies into the hand.  And Dwarven Tomb is already used to cycle any number of combos back into our hands.  So I think the key would be to make sure the Power Attack bonus would remain low enough (1 or 2 at most, with notable exceptions - a Boromir-type character could have more to compensate for his epic sacrifice, and being a hero, since Stand and Fight only allows for allies), and possibly see it mainly on Tactics characters that might not normally be in a deck with the Spirit event cards…\n\nAlso, I would probably change the name so that the word \"attack\" isn't used redundantly.  It might confuse folks, and we are already aware of many issues in the translation of cards into other languages (I also prefer single-word keywords; it keeps the card uncluttered)….  I would probably use a keyword like \"Rage\" or \"Berserker\" or even \"Sacrifice\" followed by the X-value.  So:\n\nBerserker 2\nRage 1\nSacrifice 3\netc…\n\nMy initial reaction the Stealth idea was \"YES!\"  I like the idea thematically, as Ranger-Dunedan-sneaky-type-folk are some of my favorite's in Middle Earth…  I would probably have to see it in effect in a game to get a more objective perspective on it, but I think it is a very viable concept.  Again, limiting the value to 1 or 2 per character with the keyword would keep it from being TOO-strong, but it would give a strong concept to try and build around (particularly strengthening the Secrecy-type deck beyond just \"save some resources\"…)\n\nI can't view your examples from my work computer, but intend to check them out when I get home!  Nice creativity!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717815","commentId":717815,"userName":"Cunir","timestamp":1351777081,"content":"i think your stealth idea is pretty good. i came up with an idea for stance cards once and it would go absolutely perfect with that.\n\ninstead of putting it as a trait on character cards, you could have it as a stance instead -- www.fantasyflightgames.com/edge_foros_discusion.asp [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=672708&efpag=0]\n\nthen it wont be so overpowered , because you'll only be applying it once to the whole group, instead of having it potentially adding up on lots of different characters.\n\ni think it needs a downside, though. so it will give you a bonus, but also something that you dont like. how about preventing you from optionally engaging enemies? that would fit the stealth theme quite well… on the plus side, it lowers your threat so enemies cant engage you, but on the minus side, you cant engage them back (because you're supposed to be hiding)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=717845","commentId":717845,"userName":"cordeirooo","timestamp":1351783702,"content":"@benhanses: Indeed, Powerattack's name must be changed, the word 'attack' is already a concept/thing in the game and can lead to further confusion. I still need to storm a little bit to find the perfect solution - something that is generic enough that both an eagle and a hobbit (no, I won't make a Hobbit with powerattack) could use while still being focused and specific.\n\nStealth shouldn't be made in abundance simply because even 3 characters with 1-2 Stealth could make a HUGE difference. Still, the Hero I made has Stealth 3… which seems to be counter-intuitive, but he seems a good candidate to have a nice Stealth anyway. I think of having Stealth 1 as being a REALLY good scout; you can evade an army for some time and Stealth 2 as a superb one; so 3 or more is like a master of the shadow technique, someone that knows where he is going, where to hide and how to cover your tracks - this is the Lore Hero I made to debut Stealth1.\n\nI really like that you enjoyed the ideas. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n@Cunir: I will disagree with you. I believe the traits are fine as they are, although… I enjoyed your idea of a 'stance' kind of card a lot! I made a several Event cards with the \"Technique\" keyword, being cards that stay in play for a while, giving a bonus until they vanish. I'll mix both Stance and Technique to make a new kind of event; maybe even with a new border and stuff.\n\nI understand the idea of a drawback for this good ability (I do not consider it overpower), but the problem I have in making cards is that the wording must be trimmed the maximum possible; giving it a drawback - even yours, that makes perfect sense - would make it complicated. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/73584-introducing-power-attack-and-stealth-traits/?do=findComment&comment=718064","commentId":718064,"userName":"Rapier1","timestamp":1351842972,"content":"cordeirooo said:\n\nPowerattack X\nAfter this character attacks, you may discard him to inflict X damage on the defending enemy.\n\nStealth X\nIf this character is commited to a quest, this player's threat is considered to be lowered by X during the engagement checks.\n\n\n\n \n\nFirstly, these ideas are a lot better than using the dice (which I didn't comment on), they stay thematically within the game, expanding on concepts that are already in place without being wildly divergent (and thus are more suitable at this time of the game's life).\n\nThat said, power attack already exists in a better form than how you implemented it. (Beorn from the Coreset gets + attack in return for being discarded at the end of the round). To my mind that implementation is more accurate than direct damage for the concept you're going for - and could indeed be called power attack. (+ attack, discard at the end of the round). You could also all it all out attack.\n\nI quite like the idea of it actually being add this characters defence to their attack, discard them at the end of the round - but I think that might be too specific. It's probably better if you gave cards Power Attack X (Where X is the + attack they receive)\n\n \n\n \n\nI would rename stealth to Tracking X. Functionally the same but it would represent finding the right routes during the questing phase to have lower threat. The reason for renaming it is that I think Stealth would be better as a combat mechanic rather than a questing one. I do however, like this idea a lot.\n\n \n\nStealth could be something like, cannot be used to defend, but also isn't targeted by treachery cards (so cards that say damage all allies, wouldn't effect stealth allies). I'll give it a bit more thought, but I definitely think Stealth should be a combat application, rather than a questing one.\n \n\nUnless you made Stealth X be, draw X less card from the encounter deck this questing phase - then you could have it be on events or on allies as a discard effect. (Discard elven tracker to grant stealth 2 for one round for instance)."}]}