{"url":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/","title":"Hobbit Quest 3 issues","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=721718","commentId":721718,"userName":"Skowza","timestamp":1352653142,"content":"Apologies if there is already a thread for this, if there is then someone just link me to it. I'm also posting this without the cards or rules handy, so sorry for any mistakes…\n\n \n\nWe are having great difficulty with the third Quest from the OHaUH Hobbit box, so much so that we're not sure we're interpretting the rules properly.  Let me see if we have this right…\nYou cannot move on to the third part of the Quest until you correctly answer 9 Riddles, all of which involve randomly discarding cards from the top of your deck.  If you incorrectly guess at what card will be discarded, Gollum does 1 damage to Bilbo, who cannot be healed.  So we have to correctly guess 9 times before we make 3 wrong guesses or else Bilbo dies…\nHow are we supposed to beat this, short of rebuilding our decks to increase our chances of guessing what will be discarded?  We have a 4-player party using mostly mixed-sphere decks; it would be bad enough if the Riddles only required us to guess 1 thing about the card (sphere, type, etc) but some of them require you to guess multiple attributes correctly, like both the cost and sphere.  wtf!\n\nHow is anyone beating this other than dumb luck and playing it over and over?  I really hope somone just tells me we are doing it completely wrong; its the most frustrating experience I've had with this game since the \"escape test\" Quest when Gollum got shuffled back into the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=721759","commentId":721759,"userName":"richsabre","timestamp":1352658483,"content":"seems like you are playing it correctly, but if i remember rightly then you place however many cards you guess right as progress tokens on the card so it can end up being more than 1progress per riddle answered\n\nalso you can use the ring and bilbos resoucres to discard more cards\n\nfinally i played this with 3 player and it was hard but i think its actually easier with less people….i also think alot of people build decks specially for this quest\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=721810","commentId":721810,"userName":"Skowza","timestamp":1352665588,"content":"richsabre said:\n\ni also think alot of people build decks specially for this quest\n\n\n\ngrumble… I was afraid that I was going to get that answer.  We're not keen on that approach b/c we like playing with the decks we have; we enjoy the challenge of trying to beat every Quest with the same builds, not just taking advantage of the card pool to build something that is specifically designed to win one particular Quest.  Whats the point in playing if you've built a deck based on knowledge of all the bad stuff thats going to happen from the Encounter deck?  In that case you can't really lose unless you get bad draw; its kind of like using god mode when playing a video game - fun for a minute but ultimately not very rewarding."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=721922","commentId":721922,"userName":"Ted Sandyman","timestamp":1352691771,"content":"Ive played this quest about 15 times and won only once. After the few initial goes i had to tailor my deck to be able to defeat the quest and also to limit my expanse of cards to a single sphere and mainly two cost allies, events etc which made the riddle guessing achievable.  Part of the fun for me is when i get defeated i go back to reshaping my deck in order to be able to win(or at least get further along the quest).  I know you must be frustrated as you want your one ready built deck to defeat all adventures but with this game im afraid you will need to tinker around with your decks to suit the quest you will be going on. Good luck with it and dont give in, just limit your spheres and cost of cards with this one and im sure you will get further, Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=725944","commentId":725944,"userName":"Emrad","timestamp":1353397096,"content":"Don't forget about treasures that you can collect in the first scenario.\nMy friends and I beat this scenario (3 players) fairly easily with Sting on Bilbo (he doesn't take damage from Gollum anymore), and Orcrist on Elladan with a bow (insta-kill all the goblins)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=725954","commentId":725954,"userName":"jjeagle","timestamp":1353398737,"content":"Emrad said:\n\nDon't forget about treasures that you can collect in the first scenario.\nMy friends and I beat this scenario (3 players) fairly easily with Sting on Bilbo (he doesn't take damage from Gollum anymore), and Orcrist on Elladan with a bow (insta-kill all the goblins).\n\n\n\nStrictly speaking, I'm not certain Sting would work - as per the rules inset, cards in the riddle area (including Bilbo) are immune to player card effects, and treasures are player cards. This, however, would seem rather silly.\n\nI may have got this all wrong - I haven't actually played the Hobbit scenarios yet, I've just looked at the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=725967","commentId":725967,"userName":"ClydeCloggie","timestamp":1353402060,"content":" Yes, I don't think Sting works.\n\nI must admit I haven't yet played the third Hobbit scenario, but wouldn't the riddle game be made a lot easier through the timely use of Imladris Stargazer / Gildor? As long as you know which card is on top of your play deck when you play the riddle game, you'll always win.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=725976","commentId":725976,"userName":"richsabre","timestamp":1353405414,"content":"ClydeCloggie said:\n\n Yes, I don't think Sting works.\n\nI must admit I haven't yet played the third Hobbit scenario, but wouldn't the riddle game be made a lot easier through the timely use of Imladris Stargazer / Gildor? As long as you know which card is on top of your play deck when you play the riddle game, you'll always win.\n\n \n\n\n\nyou always have to shuffle right before doing riddles\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726021","commentId":726021,"userName":"starhawk77","timestamp":1353411877,"content":"You don't need to build a deck tailored to the quest; you do, however, need to know the composition of your deck like the back of your hand. Realizing things like \"I have 20 attachments left in my deck\" can go a long way. Even then, sometimes you'll just get hosed. Such is the nature of a game with random elements."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726481","commentId":726481,"userName":"Emrad","timestamp":1353511520,"content":"Man, I had never thought that Sting was prohibited on Bilbo in quest 3…\n\nIt made so much sense to me to have the benefit from the treasure you took time to loot… but I guess you're right, Treasure cards become player cards after all.\n\n \n\nAbout the Treasure quest, aren't you annoyed by the way the Purse and the Key work? Basically, if you see them before the Trolls arrive, there's no way you can loot them. How frustrating is that? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] My friends and I homeruled that those objectives are attached to the Trolls when they appear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726488","commentId":726488,"userName":"starhawk77","timestamp":1353512285,"content":"Emrad said:\n\nAbout the Treasure quest, aren't you annoyed by the way the Purse and the Key work? Basically, if you see them before the Trolls arrive, there's no way you can loot them. How frustrating is that? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] My friends and I homeruled that those objectives are attached to the Trolls when they appear.\n\n\n\nThis situation has been clarified by Caleb Grace of FFG. If the objectives are revealed before the trolls are in play, the Key/Purse are discarded. This gives you a chance to acquire them when the encounter deck is reshuffled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726496","commentId":726496,"userName":"13edl@m","timestamp":1353514463,"content":"My play group had problems with this as well.  We sort of cheesed it a bit though.  Between the four of us we had a Rohan deck and a tactics deck that were nearly pure sphere and each had a sizable and predictable card draw.(centering mostly on allies)  We simply nominated the Rohan deck to be first player and the tactics player to follow him.  Low and behold we passed the riddles in fair shape.  It's disputable whether it's a cheap tactic going into the scenario deciding who goes first or not, but in this scenario we take what we can get."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726627","commentId":726627,"userName":"jjeagle","timestamp":1353547832,"content":"Emrad said:\n\nMan, I had never thought that Sting was prohibited on Bilbo in quest 3…\n\nIt made so much sense to me to have the benefit from the treasure you took time to loot… but I guess you're right, Treasure cards become player cards after all.\n\n\n\nThough on reflection - if you could use Sting on Bilbo here, it would make it impossible for Gollum to damage him. Which would make things rather too easy, I think. It still doesn't make sense thematically though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726700","commentId":726700,"userName":"John85","timestamp":1353572263,"content":"Happy Birthday jjeagle"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726798","commentId":726798,"userName":"richsabre","timestamp":1353588297,"content":"John85 said:\n\nHappy Birthday jjeagle\n\n\n\nhappy birthdday from me also (though im not sure the ffg birthday thing works- it was mine yesterday and it failed to recognise it…it did however give another poster a cake sign that quoted me….so i guess that counts haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726801","commentId":726801,"userName":"jjeagle","timestamp":1353588629,"content":" Well, thank you both - but I don't quite understand this - it isn't my birthday, and I entered my DOB correctly in my FFG profile. So I don't know why the birthday cake has come up!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726818","commentId":726818,"userName":"richsabre","timestamp":1353592125,"content":"jjeagle said:\n\n Well, thank you both - but I don't quite understand this - it isn't my birthday, and I entered my DOB correctly in my FFG profile. So I don't know why the birthday cake has come up!\n\n\n\ni think they gave you mine from yesterday llorando.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/llorando.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74108-hobbit-quest-3-issues/?do=findComment&comment=726867","commentId":726867,"userName":"cordeirooo","timestamp":1353599206,"content":"haha, I had the cake as well two days ago and  my birthday is in July…\nWeird huh?"}]}