{"url":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/","title":"I think this game is too hard…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=721913","commentId":721913,"userName":"Cutievalkyrie","timestamp":1352690040,"content":" Its unreasonable hard for me. I am still stuck at  core set quest 3. No matter 1 or 2 players, with 2 large and 2 small expansions, with different sizes of deck (30,40 or 50), with different kinds of combination of heroes, i still couldnt make it. Its just too hard for me. The enemies hard (a lot of them have 5+ HP&DEF), so many locations(surge, high threaten level) and damage trap, shadow cards are strong (2 damages to each exhausted hero, forced 2 resources to recover a hero etc. )\n\nMaybe i am not playing carefully enough, but even if i uncover all the encounter cards and play, i still couldnt get through this quest, i mean, if a game makes me fail every time no matter how carefully u plan ahead, it will depress me. When i loose, i just feel i had a bad luck of drawing the worst encounter cards.\n\nI v been playing mage knight boardgame also. That game is hard too and i need to think a lot before making a decision of what to do next, but hey, i can achieve my goal by planning and it really satisfies me a lot. For LOTR LCG, even if i win a game like quest 2 hill troll, i just feel i was lucky because the encounter cards didnt trouble me too much.\n\nSo what about you guys, are you feel depressed about this game? Or do you always win a level 7 quest with ease?\n\n \n\nBTW, i v been playing this game for 2 months, with 2 months i can play puerto rico and twilight struggle online pretty well (over 70%  win rate vs real persons), with a week i can solo mage knight the board game with no big problems. So i dont think i couldnt play this game well just because i am not smart enough, then what wrong with me? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=721926","commentId":721926,"userName":"Ted Sandyman","timestamp":1352692746,"content":"I wouldnt be hard on yourself and dont give up on the game. Ive been playing for nearly a year and have only beaten Dol Guldur once in a 3 player mode, never solo which is 90% of my games.  After the core set you get Adventure Packs with varying levels of difficulty but with these come new cards to make your deck better and the quests more achievable. In my first few months i won about 10% of my games which i thought was bad but once you expand your card range and learn new combos, you will win more often.  Again, dont give up on this game its fantastic, i assure you that the satisfaction you will get in a few months will be well worth it. Buy the APs, play regularly, examine the card combos and watch some you tube vids which will give you little tips on tactics to defeat the quests, Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=721941","commentId":721941,"userName":"Glaurung","timestamp":1352696507,"content":"Hmmmm Dol-Guldor is really difficult to play solo yes but in 2 player or more is actually quite easy.\n\nI think you have some problem with deck building and you need also choose right combination of heroes.\n\nMaybe you understand rules wrong???\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=721945","commentId":721945,"userName":"richsabre","timestamp":1352698463,"content":"dont get depressed about this- when the game first came out, i lost ALOT….and i mean an hell of a lot. why did i lose? …..poor deckbuilding\n\nthis is what everything really comes down to…its not so much how you play, but what you play. a good deck (or two) will be able to handle the encounter deck and what it can throw at you, whether that be lots of enemies, locations or treacheries.\n\nas said above dol guldur is hard, so dont dwell on that…it took my a long time to win this multiplayer and ive never won it solo. i have however won everything else out at the moment so i think this shows what a hard quest it is\n\nalso remember that your card pool is relatively low at the moment. there are some amazing cards out there that can really help. not that im saying this is a 'pay to win game' but the idea of a greater card pool is more choice and better combos.\n\n2 months isnt that long. ive been playing for a year and a half and still loose often enough to make this game as challenging as when i first bought it (well not all are as challenging, but many are)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=722071","commentId":722071,"userName":"cordeirooo","timestamp":1352715750,"content":"The game is quite hard, indeed, but Dol Guldur is next to impossible solo. I play this game for a long time now and never defeated alone - I tried for probably one or two months after getting the game, then I forfeit it. \n\nAll the other quests have similar difficulty to the second quest in the Core set, but they usually focus in different aspects - while the Journey Along the Anduin focus on combat and enemy engagement choices, others may focus on treachery cards, questing power, quickness, etc…\n\n \n\nYou'll have more success if you try a deck for each quest before trying the \"One Deck to Rule Them All\" method; this way you will have knowledge on how to beat each quest when deckbuilding."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=722079","commentId":722079,"userName":"Cutievalkyrie","timestamp":1352716748,"content":" Thank you guys, i feel much better now. I think i will start to watch some youtube  OCTGN video and learn first.\n\nLast night i was thinking about to sell this game. There are new games coming out every month, attracting me so much. \n\nWith your words, i understand this game is hard not because it has a bad mechanism, the problem is my deck building,\n\nWith 2 big and 2 small expansions my original box still is not full, i think i may have to buy another small expansion or just wait for the new larger gondor expansion coming out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=722098","commentId":722098,"userName":"richsabre","timestamp":1352719644,"content":"Cutievalkyrie said:\n\n Thank you guys, i feel much better now. I think i will start to watch some youtube  OCTGN video and learn first.\n\nLast night i was thinking about to sell this game. There are new games coming out every month, attracting me so much. \n\nWith your words, i understand this game is hard not because it has a bad mechanism, the problem is my deck building,\n\nWith 2 big and 2 small expansions my original box still is not full, i think i may have to buy another small expansion or just wait for the new larger gondor expansion coming out.\n\n\n\nim pleased youve decided to stay around….this game can be hard and ive seen too many people give up on it (or perhaps they stopped posting…) but anyways with a decent card pool and deck building you should soon lose that frustration happy.gif [/edge_scripts/fckeditor/editor/images/smiley/msn/happy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=722137","commentId":722137,"userName":"player1761766","timestamp":1352723259,"content":"I am very often terrible at this game, and I've been playing well over a year now. All of the recent scenarios I cannot complete, and I do often get really depressed by it (case in point, I haven't played it in over two months). But I love it, somehow, and I will keep buying the expansions. Maybe I'm just too strange…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=722167","commentId":722167,"userName":"cordeirooo","timestamp":1352726541,"content":"Cutievalkyrie said:\n\n Thank you guys, i feel much better now. I think i will start to watch some youtube  OCTGN video and learn first.\n\nLast night i was thinking about to sell this game. There are new games coming out every month, attracting me so much. \n\nWith your words, i understand this game is hard not because it has a bad mechanism, the problem is my deck building,\n\nWith 2 big and 2 small expansions my original box still is not full, i think i may have to buy another small expansion or just wait for the new larger gondor expansion coming out.\n\n\n\nSomewhere here in the forums Rich answered a guy about the Adventure Packs and he also gave tips on which (good) cards came with each pack. You should take a look.\n\n \n\n \n\n \n\n \n\nspalanzani said:\n\nMaybe I'm just too strange…\n\n\n \n\nWhy, aren't we all? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74128-i-think-this-game-is-too-hard%E2%80%A6/?do=findComment&comment=722186","commentId":722186,"userName":"HeavyKaragh","timestamp":1352728377,"content":"I just love the exigency of this game on deckbuilding."}]}