{"url":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/","title":"Card sleeves","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=722910","commentId":722910,"userName":"Chaos101","timestamp":1352816535,"content":"Hi Guys,\n\nDoes anyone know where I can buy some card sleeves in the UK? It seems that every website I look at is out of stock of the plain transparent FFG sleeves.\n\nAny help would be appreciated.\n\nLee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=722951","commentId":722951,"userName":"richsabre","timestamp":1352820662,"content":"have you tried amazon? think they have some in\n\ni got mine from a store that i wont mention here……..(you know exactly where i mean) so thats pretty much out of the question, but they were the daughter and nazgul ones anyways\n\ni seem to remember they were limited at first, but ffg are release some unlimited ones at some point\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=722970","commentId":722970,"userName":"soullos","timestamp":1352822667,"content":"They're currently out of stock. There's more being shipped out so hopefully we'll see more supply next month."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=723093","commentId":723093,"userName":"joec_34","timestamp":1352840332,"content":"Fantasy Flight's upcoming products & reprints sights seems to indicate that the clear standard card game sleeves are expected to be reprinted and released December 2012.\n\nGo here, http://www.fantasyflightgames.com/edge_upcoming.asp [http://www.fantasyflightgames.com/edge_upcoming.asp] , and choose \"Reprints\" and \"Supplies\" and \"All Status\" and you'll see it.  The December 2012 note is in red by the printer, just under the the name of the product.\n\nI just picked up The Hunt for Gollum, but I am waiting to play it until I get these sleeves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=723280","commentId":723280,"userName":"Chaos101","timestamp":1352875776,"content":"joec_34 said:\n\nFantasy Flight's upcoming products & reprints sights seems to indicate that the clear standard card game sleeves are expected to be reprinted and released December 2012.\n\nGo here, http://www.fantasyflightgames.com/edge_upcoming.asp [http://www.fantasyflightgames.com/edge_upcoming.asp] , and choose \"Reprints\" and \"Supplies\" and \"All Status\" and you'll see it.  The December 2012 note is in red by the printer, just under the the name of the product.\n\nI just picked up The Hunt for Gollum, but I am waiting to play it until I get these sleeves.\n\n\n\nThanks for the link. I think I will wait until December then. I was considering buying another brand but would prefer the FFG's own card sleeves as I know the quality is excellent.\n\nLee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=723305","commentId":723305,"userName":"player543086","timestamp":1352881470,"content":" I faced the same problem in Poland. Several shops run out of FFG's sleeves at the same tie and said there is no more in the distribution. I was faced with the possibility of having re-sleeve everything (which would kill my wallet as I hate cheap sleeves) but was able to buy 10 packs from one of the stores that had higher price and because of that still had some left. After that I found out that FFG will produce more in December so I am at ease now.\n\nActually also because of fear of shops running out I did not invest with LOTR art sleeves which were limited up till recently when FFG decided to keep producing them as a regular line."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=754611","commentId":754611,"userName":"SOGra","timestamp":1359333422,"content":"FFG has just released their new unlimited LOTR-LCG Sleeves. As this is my first card game ever, I decided to upscale the game with protective sleeves and get the new released card sleeves made specifically for the game. I have the Base Game, and the whole Shadows of Mirkwood series (1-6). I bought enough sleeves at my FLGS to cover the base game cards, and the first two Mirkwood series sets. I need 3 more of each (good and evil) to cover the remaining 4 expansion sets.\n\nThe sleeves are very high quality and shuffle well and look even better than the original card itself. For the scenario cards, I got cheap clear plastic sleeves from Walmart and the difference is really striking.  I feel the Walmart sleeves have cheapened my game. I will likely get some clear sleeves from FFG, as the quality of the WalMart clear sleeves are nowhere near the quality of the FFG LOTR card sleeves, and I suspect the FFG clear sleeves are the same high quality.\n\nI am a mid 50s wargamer of old, recently expanded my gaming horizons to boardgames like FFG, Mayfair and Z-Man after attending my first national con at Origins in 2009 and then Gencon in 2011, buying Settlers of Catan and introducing it to my wife (she was never much for joining me in my S&T wargames experience). Since then, our non-wargame board games collection has really expanded since that first purchase in 2009, and as of Jan 2013, expanded to my first card game experience - LOTR LCG. Because it can be solo, and Co-op, and is in a Middle Earth setting, it has my wife's interest and we are  learning this together and we are enjoying figuring out this puzzle. We are still in the base game scenarios and will be in Mirkwood soon. We are hoping to get The Hobbit Saga next, then move on to Kazad-Dum, and then its expansion cycle. \n\nGreat game!\n\nAnd the new unlimited game sleeves are really good too.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74240-card-sleeves/?do=findComment&comment=762201","commentId":762201,"userName":"Chaos101","timestamp":1360740886,"content":"Hi Guys,\n\nI have just seen that Amazon has re-stocked (or rather Games Lore Ltd through Amazon have re-stocked) the clear FFG card sleeves for LOTR.\n\nThe link if you are interested is http://www.amazon.co.uk/Clear-Sleeves-Standard-Card-Game/dp/1589945158/ref=sr_1_4?ie=UTF8&qid=1360762367&sr=8-4 [http://www.amazon.co.uk/Clear-Sleeves-Standard-Card-Game/dp/1589945158/ref=sr_1_4?ie=UTF8&qid=1360762367&sr=8-4]\n\nCheers, Lee"}]}