{"url":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/","title":"First game in 7 months!  (+ lots of questions)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=724483","commentId":724483,"userName":"tripecac","timestamp":1353073500,"content":"I played LotR LCG a lot earlier this year, but in April I moved and no longer had room for a table in my office (which is the only toddler-free zone in the house).  This week I rearranged my office so that finally I have space to play.  And yesterday I played my first game in more than 7 months!\n\nI decided to start over, with the first core quest, instead of resuming where I left off before, which was Rhosgobel.  Below is a run-down of my experience, with lots of questions that pop\n\n\nSpheres:\n\nI picked two spheres at random: Leadership and Spirit.  I don't remember if they complement each other well or not. \n\nQuestion: What would be a better mate for Leadership?\n\n\nHeroes:\n\nWhile sorting my cards, I noticed two heroes I didn't remember trying before: Prince Imrahil and Frodo.  I decide to play with both of them, to add some challenge to the easy first quest.  Imrahil was almost as expensive (in terms of threat) as Aragorn, but his ability (untap when character leaves play) seemed lame, since in terms of questing Aragorn could do the same for free.  Frodo looked interesting (redirect damage to threat), but was still somewhat expensive.  So I had to choose a cheap third heroes and decided on Eowyn.  My plan was to quest with her, and then use a combination of Frodo, Imrahil, and cannon fodder for defense, allowing the ally to die so that Imrahil could then attack. \n\nQuestion: Is that a pretty standard strategy for Imrahil?\n\n\nCards:\n\nI picked the obvious favorites, like Gandalf, Sneak Attack, Northern Tracker, etc.  The number of cards available to me now was a bit overwhelming compared to when I just had the core set.  So I picked somewhat randomly, remembering at the last minute to throw in some cheap allies (since that was the whole point of Imrahil).  I used 3 of each card, for simplicity.  I ended up with around 80-100 cards, which shows just how indecisive/sloppy I was.  My plan was to play with this deck, and then, if I lost, refine it. \n\nQuestion: Is using 3 of each card a typical strategy, or are there cards where it's best to use only 1 or 2?\n\n\nPlay:\n\nFirst draw was a mess, so I mulligan'ed.  Second was almost as bad.  It didn't really matter, though.  Eowyn's questing was enough to match the two cards in the staging plus the location card I drew, although I think I had to discard a card to match.  Either way, we traveled to one of the locations, leaving just the Forest Spider to fight.  Since it attacked for 2 + 1 first turn, I let it attack Frodo, and then wounded it with Imrahil. \n\nThe next turn I was able to bring out an ally.  The wounded Forest Spider was joined by a King Spider.  I let the Forest Spider attack Imhahil (no damage) and the King Spider ate the ally.  Imrahil then used his ability to untap and attack the Forest Spider, finishing it off. \n\nQuestion: Is that the standard way to use Imrahil?\n\nThe game continued in much the same fashion.  I brought out cheap allies, and let them get killed off so that Imrahil could both defend and attack.  I used Frodo to defend a couple times, but mostly he just helped in the attacks.  A Gandalf + Sneak Attack combo during the defense round helped lower my threat and also knocked out a King Spider.  Gandalf went back in my hand, so Imrahil untapped, and was able to attack during the attack round.\n\nQuestion: Did I do that right?  Or should Gandalf have stayed until the end of the attack round as well, in which case Imrahil would not have been able to untap and attack?\n\nEowyn got a willpower buff, so her questing was able to progress us through the locations.  We got to the 3B where we can pick a spider out of the deck, so I picked Ungoliant's Spawn.  I then brought out Gandalf, who zapped the spawn for four damage and then defended against it.  Imrahil and Frodo bashed the spawn for another couple damage, putting her at 6.\n\nThe next turn, I put out a cheap ally.  A Forest Spider engaged us.  I had Imrahil defend against the Forest Spider while the spawn ate the ally.  Imrahil then untapped and he and Frodo bashed the spawn for another 2 damage, for a total of 8 (out of 9).\n\nOn the next (and final) turn, I didn't have any more allies to play.  I though about having Eowyn quest, Imrahil defend against the Forest Spider, and then have Ungoliant's spawn kill off Frodo so that Imrahil could untap and finish off the spawn.  However, it didn't seem \"right\" to let Frodo die.  So I skipped the questing, and luckily drew another location card.  Our threat went up, but it didn't matter.  I let the Forest Spider attack Eowyn (who survived), and Ungoliant's spawn attacked Frodo, who rose the threat even more.  Imrahil didn't defend, so was able to bash the spawn for the final point.  End of game.\n\n\nVictory:\n\nSo, I \"won\", but it didn't feel like a very clean victory.  For one thing, I wasn't sure about the Gandalf Sneak Attack issue (see my question above); possibly my sequencing was off on that one. \n\nAlso, I felt like if anything had prevented Imrahil from attacking (can any shadow effect in the first quest do that?)  we would never have been able to recover, since our threat would have been so high that the other monsters in the staging area would overwhelm us.\n\nIt seems like the \"safer\" choice would have been to defend against the Forest Spider with Imrahil, let the spawn kill off Frodo, and then let Imrahil finish off the spawn.  Eowyn would quest to keep the threat down \"just in case\".\n\nQuestion: So what do you think?  Does sacrificing Frodo seem like the safer strategy? \n\n\nNext Step:\n\nSo now what?  I didn't expect to win with such a sloppily constructed deck.  Part of me wants to try again, this time with much fewer cards.  But there's not as much incentive to do so, since I didn't lose.  The Imrahil + \"red shirt\" strategy seems pretty solid.  Perhaps I could get rid of Northern Tracker (too expensive, hard to willingly sacrifice) and Ancient Mathom (didn't ever draw it, so certainly didn't depend on it).   Or maybe I should just play the same deck again and see how it goes? \n\nQuestion: How many times do you usually win/lose with a deck before you feel you know how to tweak it? \nHow do you take \"lucky\" or \"unlucky\" streaks into account?\n\nI suppose I could keep score.  My threat was pretty high at the end of this one, so I bet my score wasn't great.  But I am so used to losing that I normally don't consider there being different \"degrees\" of winning.  To me, any win is good enough, or at least it has been up until this game.\n\n\nFinal Questions:\n\nFor those of you returning to the game after a long time off, how did you get back into the \"swing of things\"?  Did you start all over like I did, or did you try to pick up where you left off, with the more challenging scenarios?  Did you keep your old decks, or create new ones from scratch?  Did you try to pick heroes and cards you never used before, or did you stick with the \"tried and trusted\"?  What was your general philosophy when revisiting the game?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=724505","commentId":724505,"userName":"cordeirooo","timestamp":1353076952,"content":"Ok, lots of questions indeed.\n\nHere we go:\n\n \n\n1 - There is no hard-rule to what is better with what in spheres, but you might want to try out different mix of heroes. This game is all about experimenting, after all. Certain Leadership cards are about resources, so, when I use these I try to match them with expensive cards from other spheres. It can also go another way: Flooding the field with a lot of cheap allies. In the end, I can't answer your question the way you wanted, sorry.\n\n \n\n2 - Hm. Yes?\n\n \n\n3 - First of all, having 50 cards is the optimal… if you're trying to get the best deck possible. If you're playing just for funsies, this limit is crap. Still, there are cards that are best as three-of, while others are 'just in case' cards. As a rule, you could try this: Cards you would love to see at any time during the game: 3. Cards that have an overall effect and are utile: 2. Just in case cards, that have very specific effects: 1.\n\n \n\n4 - Again with 'standard'? Why is that?\n\n \n\n5 - No. Gandalf goes back at the end of the phase. So the Combat phase would've ended before Imrahil could attack.\n\n \n\n6 - Well, the best is to have all Heroes alive, but I'm not sure what you're wanting with 'safe'.\n\n \n\n7 - I like to play all the scenarios with the same deck before tweaking it. Yet, there are times that I go 'oh snap, that card would be really good right now' and then change it right away. The scenarios are really different among themselves, so it's hard to keep a note about luck and stuff.\n\n \n\n8 and next - I never went too long off of the game. Sorry. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\n \n\nGood gaming!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=724506","commentId":724506,"userName":"mr.thomasschmidt","timestamp":1353077081,"content":" First of all welcome back. Always nice when someone returns. I did it myself half a year ago :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWell, I did what you did, started from the begining again. Then I played each quest until I beat it before moving on to the next one. I tweakt it using the new cards in the new packs to try them out once at least. If some card didn't really worked like planed I'd replace it/them until I beat the quest. Then I'd look the deck over once again and continue to the next quest. Usually I give my deck 3-5 tries with minor tweaks and if it still fails I'll re-evaluate my heroes.\n\nThomas"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=724612","commentId":724612,"userName":"tripecac","timestamp":1353093908,"content":"\"5 - No. Gandalf goes back at the end of the phase. So the Combat phase would've ended before Imrahil could attack.\"\n\nI guess that means I lost! Time to hone the deck and try again…\n\nThe reason I'm concerned with \"standard\" is I want to make sure I understand the rules correctly. If I'm the only one using a card in a certain way, then that means I'm probably misunderstanding the rules!\n\nAs for the 50 card limit, I usually find myself using the same \"no-brainer\" cards over and over again: Gandalf, Sneak Attack, Galadhrim's Greeting, etc. It seems like there are cards which are useful in all scenarios. So many cards, in fact, that I end up using the same decks over and over again.\n\nAre there some cards which are weak in the Core and early Mirkwood scenarios, but start to \"shine\" in later quests? For example, I've read that dwarf cards start to get more useful later on. What about cards like Campfire Tales or Wandering Took? Are those cards never useful for solo players?\n\nIt would be very interesting to see each card's relative frequency of inclusion in decks. I'm guessing Gandalf would be close to 100%. But what about, say, Dark Knowledge? Or Wandering Took?\n\nWhen I listen to the podcasts, sometimes they ask each other whether a card will be part of their deck. When they say \"no\", I think: so what are they going to do with that card? Is it just a waste of money? Like getting duplicates with collectable card games? I wonder just how evenly distributed the cards are, in terms of actual utility.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=724678","commentId":724678,"userName":"tripecac","timestamp":1353111083,"content":"I just played a second game, the same quest with the same deck. \n\nThis time it was extremely easy.  It was also a completely different experience.\n\nI started with a Northern Tracker (one of the \"expensive\" cards I thought about getting rid of).  On the second turn, I played it, and it helped me whittle away at an Enchanted Stream in the staging area.  A couple turns later, I brought out a second one.  I also brought out a cheap ally as cannon fodder, but I ended up not needing to use him.\n\nThis time, I didn't lose any allies, so Imrahil never got to use his ability.  He never really needed to.  Frodo took the hits, Galadhrim's Greeting lowered threat, and a Dwarven Tomb got the Galadhrim Greeting back.  I never had to use Gandalf (although he was in my hand from the start), and never felt the need to play Unexpected Courage until one of my heroes was stuck in a web. \n\nInstead of Ungoliant's spawn, I got the other 3B, and had enough guys out to be able to make the 10 in 2 turns.  There really wasn't any struggle this time, no close calls, no hard decisions, no deep thoughts.  It was fast and relaxing, and made my deck seem well put together, even though it's the same hastily thrown together 80 card mess it was yesterday.\n\nSo I find it interesting that each game resulted in different conclusions:\n\nGame 1 : Imrahil grinds through hoards of spiders by repeatedly sending cheap allies to their deaths.  Gandalf saves the day twice.  Conclusion: Need more cheap allies, reduce card count so that Gandalf appears more frequently.\n\nGame 2 : Northern Trackers help us blitz through locations.  Galadhrim Greetings keep threat low.  Imrahil twiddles his thumbs.  Gandalf doesn't have anything to do.  Conclusion: There didn't seem to be any flaws in the deck this time.\n\n \n\nSo, two very different games, two very different conclusions.  The only thing they seemed to have in common is that Eowyn is awesome at questing (which we all know by now), and Frodo is great for defending, as long as we have a way to reduce threat. \n\nUnexpected Courage doesn't seem very useful with those heroes, since Eowyn stinks at fighting, Frodo stinks at attacking, and Imrahil can already untap if there's some cannon fodder.  Perhaps putting Unexpected Courage on Frodo would let him quest, but Eowyn already handles questing well by herself, especially when buffed.  So maybe the only real reason to keep UC in the deck is to deal with webs. \n\nAs for the other cards, well, I probably need to play through this desk a couple more times to be able to evaluate them all.\n\nAnd this gets to my questions:\n\nIs the first core quest too much of an \"easy sampler\" to be a good testing ground for decks?  Should I be tackling the second quest instead?  Or should I give the first quest a few more tries; are two run-throughs not representative enough?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=724691","commentId":724691,"userName":"Narsil0420","timestamp":1353113927,"content":"tripecac said:\n\n \n\nIs the first core quest too much of an \"easy sampler\" to be a good testing ground for decks?  Should I be tackling the second quest instead?  Or should I give the first quest a few more tries; are two run-throughs not representative enough?\n\n \n\n\n\n \n\nI think the first quest is an OK example for solo, but definitely too easy with more than 1 player. I like Hunt for Gollum (out of the scenarios, it sounds like, you have) as a tester for decks. I feel like it's much better balanced than the core scenarios.\n\nI'm glad you're getting back into the game! You're making me want to go back and play some of these old scenarios!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=724753","commentId":724753,"userName":"richsabre","timestamp":1353137407,"content":"tripecac said:\n\nAre there some cards which are weak in the Core and early Mirkwood scenarios, but start to \"shine\" in later quests? For example, I've read that dwarf cards start to get more useful later on. What about cards like Campfire Tales or Wandering Took? Are those cards never useful for solo players?\n\nIt would be very interesting to see each card's relative frequency of inclusion in decks. I'm guessing Gandalf would be close to 100%. But what about, say, Dark Knowledge? Or Wandering Took?\n\nWhen I listen to the podcasts, sometimes they ask each other whether a card will be part of their deck. When they say \"no\", I think: so what are they going to do with that card? Is it just a waste of money? Like getting duplicates with collectable card games? I wonder just how evenly distributed the cards are, in terms of actual utility.\n\n \n\n\n\nwelcome back\n\nthe dwarves all get a boost from dain if he is ready, so yes they do get better.\n\nits a matter of what type of player you are as to what you include….are you bilbo/pippin/boromir? (cant remember if you were around for those) there are certain cards i include often in my decks that arent great but are great for theme - which is important to me, but some arent so bothered.\n\ngandalf is actually gettting less and less play time- he is no longer a 'must have', there are far more potent cards to be used in conjunction with others (in the dwarrowdelf cycle)\n\ni dont consider any cards a waste- i did a thread a while back complaining about the lack of solo friendly cards…now however i play exclusivelly two-handed so get use out of ranged and sentinel……id very much recommend doing this…i thought i wouldnt enjoy it but i think its more enjoyable\n\nfinally id recommend checking out the new FAQ if you havent yet, few cards have changed.\n\nalso as i said welcome back- any questions just ask, or PM me if the forum is quiet\n\nrich\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=725316","commentId":725316,"userName":"tripecac","timestamp":1353269114,"content":"I played 2 more games yesterday with the same deck.\n\nIn the first game, we got swarmed with spiders.  I drew too few allies, and ended up with only useless cards in my hand, despite having tons of resources thanks to a Steward of Gondor.  I kept drawing event cards which couldn't help, and ended up losing.\n\nBefore the second game, I removed lots of events, to increase the frequency of allies. \n\nI won the second game, but it was messy.  I killed Ungoliant's spawn early in the game, and had to wait to kill it again at the end.  I lost Eowyn near the end, because except for Gandalf I had no way to heal. \n\nDo leadership and Spirit get healing cards later after Rhosgobel?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=725417","commentId":725417,"userName":"jjeagle","timestamp":1353291332,"content":"tripecac said:\n\nDo leadership and Spirit get healing cards later after Rhosgobel?\n\n\n\nOff the top of my head, no: Lore is still the only sphere that can heal. But I may have forgotten something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=725450","commentId":725450,"userName":"richsabre","timestamp":1353298966,"content":"tripecac said:\n\nDo leadership and Spirit get healing cards later after Rhosgobel?\n\n\n\nhealing is sort of lore's thing, so no i cant think of any either\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=725886","commentId":725886,"userName":"tripecac","timestamp":1353373404,"content":"Today I created a deck using the other colors: Tactics and Lore.   Since I have Song of Lore, I decided to have 2 Tactics heroes and 1 Lore hero.  To try different heroes from usual, I picked Bilbo for Lore, and, since I always choose Legolas for Tactics, I chose Gimli and Thalin instead.  I also liked the idea of having Bilbo and two dwarves, in the spirit of the Hobbit.\n\nSo did they do?\n\nIn short, they sucked. \n\nEven with a Protector of Lorien, their questing was pathetic.  I never drew a Gandalf, so there was no threat reduction.  The threat just kept going up, up, and up.  Locations stacked up in the staging area.  They were great at fighting, horrible at everything else.  It was sad.\n\nAnd this reminded me why Tactics is my least favorite sphere.  All muscle, no brains. \n\nIt seems like the only way to play tactics is to use Legolas.  The other tactics heroes (Thalin and Gimli) are horrible at questing.  And Bilbo is a joke in terms of questing.  So I would need to use Legolas and probably two Lore heroes.  Is that what most people do when playing a Tactics/Lore combo?  Or are there better-questing Tactics heroes later on in the quest packs and expansions?\n\nI'm wondering if I should instead pair Tactics with Spirit.  Lore can heal and draw cards, but spirit can keep the threat down, and Eowyn is great at questing.  That would mean my second deck would be Leadership and Lore.  Lots of resources plus lots of cards seems like a good combination.\n\nSo, do these combos:\n\n1) Tactics+Spirit and Leadership+Lore\n\nseem better than:\n\n2) Tactics+Lore  and  Leadership+Spirit\n\n?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74403-first-game-in-7-months-lots-of-questions/?do=findComment&comment=725890","commentId":725890,"userName":"Raven1015","timestamp":1353375867,"content":" I had a similar experience. I was obsessed with the game when I first got it, then didn't play it for about 8 or 9 months, mostly because of a lack of a good playing surface and being busy. Recently got back into the game a couple of months ago and I remember why I love it. \n\n \n\nA couple of answers to your questions. I actually constructed a deck using Prince Imrahil for the first time recently, and discovered that he can be quite useful. The red-shirt strategy is definitely one of the main ways to use Imrahil, but I use him in a Leadership/Tactics Eagle deck. Since that deck involves allies popping in and out all the time, Imrahil usually can use his power every turn without necessarily sacrificing an ally. \n\nI generally construct decks after 5 play-throughs or so, either because the deck is failing a lot or because I am starting to get bored with that particular deck. I would suggest reading up/listening to strategy from a variety of sources, as this has helped me to learn. Of course the best teacher is test things out yourself. Even though one source may say a certain card is worthless, it may end up being very useful to you (this has been my experience a few times). After each play-through, especially a failure, it is best to think about these questions:\n\n- What cards did I have in my hand that I never ended up playing? Why did I not play these cards? (if it is because of a lack of resources, you might have to figure out some resource generation, if it is because it never found a use, it may be time to cut that card)\n\n- What was the main reason I lost? (Treacheries, shadow effects, lack of willpower, lack of allies, etc.)\n\nI find that being really purposeful about the overall strategy of a deck is necessary, and including a few cards to cover for glaring weaknesses is the best approach. My first decks were pretty haphazard until I started to be more strategic about picking cards to fit my strategy instead of just picking what I thought were the best cards overall. \n\n "}]}