{"url":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/","title":"User Created Cards: Eomer","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=727990","commentId":727990,"userName":"opethwindowpane","timestamp":1353930627,"content":"Eomer\nHero\nCost: 10\nWillpower: 2\nAttack: 2\nDefense: 0\nHit Points: 4\nNoble. Rohan. Warrior.\nEomer has +1 [DEF] for each exhausted hero you control.\n\nI was inspired by the new spirit sphere theme of situational or temporary defense. My spirit Eomer above is very good at defending a questing party, but not so much while engaging and killing enemies (without the help of allies). I think this fits spirit very well and he is good in the upcoming numenor and following cycle due to the new Siege keyword."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=728039","commentId":728039,"userName":"opethwindowpane","timestamp":1353937634,"content":"Per response from BoardGameGeek community I have adjusted the card design to the following to match cost and stats and clearly identify the \"power\" of Eomer, which is when you have two other exhausted heroes who probably quested or defended this turn.\n\nEomer\nHero\nSpirit\nCost: 10\nWillpower: 2\nAttack: 2\nDefense: 2\nHit Points: 4\nWhile you control at least two other exhausted heroes Eomer has +1 [DEF]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=728067","commentId":728067,"userName":"mr.thomasschmidt","timestamp":1353942366,"content":" I really like the idea BUT with his stats like it is now I think I'd rather go for Glorfindel (Core set). However if he would have 2 def and get +2 def if both other heroes where exhausted I think he'd be awesome. So that he would either have 2 or 4 in def. Great idea anyway :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=728078","commentId":728078,"userName":"opethwindowpane","timestamp":1353944026,"content":"If there is no specific need Glorfindel should be chosen over Eomer.  This fits the lore.\n\nIn this comparison the two are different though.  Glorfindel is better at attacking and less at defending whereas my spirit Eomer is weaker attacker and stronger defender.  If you need a defender and are likely to be able to use his bonus defense then Eomer is the clear choice!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=728102","commentId":728102,"userName":"AjiTae","timestamp":1353947713,"content":"I kind of agree with Thomas on his ability though. I think it would be more balanced if he gained 1 DEF per other hero exhausted. I mean look at the threat cost of beast defenders like Dain and Beregond. Since it's Eomer's ability as a hero, I think it should be more powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=728225","commentId":728225,"userName":"mr.thomasschmidt","timestamp":1353980065,"content":" Exactly my point. However I think it would be fine if his ability could only be \"bonused\" up if you have two heroes exhausted. Maybe 0 def and then +1 for one hero exhausted and +3 def if both heroes are exhausted. Or maybe he could gain +1 def per 2 ally characters you choose to exhaust? Don't know, but I really liked your thinking in this ability :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] keep it up"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=728899","commentId":728899,"userName":"Mr Coffee","timestamp":1354192258,"content":"The adjusted version is much better, but honestly, still not sure that I would use him.  He does have solid all around stats, but I can always get those elsewhere.  For example, he and Beravor would have the exact same starting threat cost and stats.  But personally, her ability is mush more versatile.  I can find ways to raise someone's defense, and particularly since it is based solely on exhausting my other hero's (meaning I can't use them for attacking now), I would rather just use a different hero and throw in a couple Dundain Warnings to get those extra 2 defense (or whatever other defense card you want to use).  About the only reason I can think I would use him outright would be that he has the best stats for a Spirit hero other than Glorfindel, who is equal or better in everything other than defense, and again, I can find better ways to defend than relying on a hero that removes Glorfindel's ability to attack by needing him to be exhausted…\n\n\n\nIf he had an aditional benefit to his ability, I could see using him more tactfully.  Since I think he can fit into either Spirit (assisting the Three Hunters on their quest for the Hobbits by giving horses and guiding them), Leadership (his eored was stoutly devoted to him), or Tactics (obviously proficient in battle, throwing himself and the Rohirrim at the enemy at Pelenor Fields until Aragorn had time to arrive), I have included an additional ability to his card based on what sphere he would be in:\n\n\n\nEomer (Spirit hero)\nRohan. Noble. Warrior.\nCost: 10\nWillpower: 2\nAttack: 2\nDefense: 2\nHit Points: 4\nWhile you control at least two other exhausted heroes Eomer has +1 [DEF].\nResponse:  When Eomer is assigned to a quest that at least one other Hero is also assigned to, add one progress token to the active location or quest.\n(reflects his helping the Hunters quest)\n\n\n\n\nEomer (Tactics hero)\nRohan. Noble. Warrior.\nCost: 10\nWillpower: 2\nAttack: 2\nDefense: 2\nHit Points: 4\nWhile you control at least two other exhausted heroes Eomer has +1 [ATT].\nResponse: After another character leaves play, Eomer has +2 [ATT] for the rest of the round.\n(reflects Eomer's charge after Theoden's death)\n\n\n\nEomer (Leadership hero)\nRohan. Noble. Warrior.\nCost: 10\nWillpower: 2\nAttack: 2\nDefense: 2\nHit Points: 4\nWhile you control at least four Rohan characters Eomer has +1 [DEF].\nWhenever a Mount is played, ready Eomer.                      \n(reflects his status as a Horse-lord, and my desire that they will hopefully include more Mounts as the game progresses)\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=728944","commentId":728944,"userName":"John85","timestamp":1354201577,"content":"Grea suggestions, ben! I really like the Leadership version!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=729260","commentId":729260,"userName":"cordeirooo","timestamp":1354295381,"content":"I liked your ideas, Mr. Benhanses.\nThere is talent there!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74787-user-created-cards-eomer/?do=findComment&comment=729510","commentId":729510,"userName":"Mr Coffee","timestamp":1354379541,"content":"Thanks!  But I'll defer credit to the OP…. I just tweeked his work to fit my own personal ideas….  He did the original work, and I played around with it estrella [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/estrella.gif]"}]}