{"url":"https://community.fantasyflightgames.com/topic/74819-making-faramir-feel-like-an-unlockable-honats-spoiler/","title":"Making Faramir feel like an unlockable (HoN/AtS SPOILER).","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74819-making-faramir-feel-like-an-unlockable-honats-spoiler/?do=findComment&comment=728303","commentId":728303,"userName":"John85","timestamp":1354014279,"content":"So no doubt most of us assume that FFG will give us that long awaited Faramir hero (let us hope that we are not disappointed) sometime in the Against the Shadow cycle. After reading the rulebook for HoN last night, it occurred to me that, thematically, FFG couldn't give us Faramir in the first pack without making one of the heroes unplayable, if one is following theme/lore. What I mean is that since the three quests of HoN are all about delivering a letter to Faramir, it is not possible (while having Faramir as a hero/ally) to deliver said letter over the course of the quests. If Faramir were in your party, you would just give him the letter and skip the scenarios altogether.\n\nInstead FFG makes Faramir the goal of the three scenarios and after safely delivering the letter (completing the scenarios) one is \"rewarded\" with a new playable hero (in a future AP), Faramir (or if you prefer, \"Faramir joins your party\"). Depite my sadness on learning that he wasn't in the HoN box, this makes great sense, and shows FFG's commitment to providing players with consistency when it comes to proper theme/lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74819-making-faramir-feel-like-an-unlockable-honats-spoiler/?do=findComment&comment=728339","commentId":728339,"userName":"monkeyrama","timestamp":1354023261,"content":"Could be, could be. I'm trying to recall, but was Arwen released in the Dwarrowdelf cycle in the first pack in which she wasn't an objective ally? If I'm right about that, it gives FFG a track record of giving a card at a reasonably sensible point in the cycle. It would certainly be very nice to get a Faramir hero. Could do a family deck, with Boromir, Denethor and Faramir. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/74819-making-faramir-feel-like-an-unlockable-honats-spoiler/?do=findComment&comment=728341","commentId":728341,"userName":"Rapier1","timestamp":1354023852,"content":"You are right. 3rd pack for the playable Arwen card. (First 2 have Arwen allies). \n\n \n\nEdit: also you should spoiler warn this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74819-making-faramir-feel-like-an-unlockable-honats-spoiler/?do=findComment&comment=728355","commentId":728355,"userName":"John85","timestamp":1354028278,"content":"Thanks for pointing that out Rapier, \"Spoiler Warning\" added"}]}