{"url":"https://community.fantasyflightgames.com/topic/74880-what-does-printed-sphere-mean/","title":"What does Printed Sphere mean?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74880-what-does-printed-sphere-mean/?do=findComment&comment=728774","commentId":728774,"userName":"RGun","timestamp":1354146630,"content":"In the previews for some of the new adventure packs some of the new event cards speak to \"the printed sphere\" of a hero.  Does this mean only the resource icon on the actual hero card, or if you play some attachments that give a hero additional resource spheres would they count as printed spheres? Trying to figure out if you need decks with 3 heroes from the same sphere to play these cards or whether you can use attachment cards to make them playable (e.g. Song cards)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74880-what-does-printed-sphere-mean/?do=findComment&comment=728776","commentId":728776,"userName":"jjeagle","timestamp":1354147981,"content":"I am fairly sure this must mean the resource icon actually printed on the hero card, not resource icons gained by any other effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74880-what-does-printed-sphere-mean/?do=findComment&comment=728816","commentId":728816,"userName":"richsabre","timestamp":1354170813,"content":"i asked whether printed ranged included attatchment ranged cards, and the official answer was no- so id say only on on the card itself\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74880-what-does-printed-sphere-mean/?do=findComment&comment=729222","commentId":729222,"userName":"starhawk77","timestamp":1354288621,"content":"Yeah, it means exactly what you'd think it would mean: the sphere or spheres actually printed on the hero card. So, resource icons gained through Songs or other similar effects won't be taken into account. Additionally, while Elrond can spend resources to pay for allies of any sphere, he only has the \"printed\" Lore resource icon."}]}