{"url":"https://community.fantasyflightgames.com/topic/74922-interesting-dunhere-vs-wargs-scenario/","title":"Interesting Dunhere vs. Wargs Scenario","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/74922-interesting-dunhere-vs-wargs-scenario/?do=findComment&comment=729043","commentId":729043,"userName":"~Rampage~","timestamp":1354227450,"content":"Tonight while playing the Anduin quest, the Wargs was engaged against me.  As per usual, my shadow effect was nill and the little bugger went back to the staging area and I couldn't kill him.  Until that point, the staging area was empty and I wasn't going to be able to use Dunhere to attack anyone in the staging area to get his +1.  This also left me without any engaged enemies.\n\nMy question is, since the Wargs ended up back in the staging area as a result of the negative shadow effect, and Dunhere was not exhausted, can I attack the Wargs at that time with Dunhere?  In our game, the Wargs had some damage and we elected to say that he was a fair target since this was still in the combat phase and he was eliminated after Dunhere attacked him. \n\nJust looking for some feedback to see if I did that right.  Still pretty new to the game and trying to get all of the ins and outs of various cards down.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/74922-interesting-dunhere-vs-wargs-scenario/?do=findComment&comment=729077","commentId":729077,"userName":"jjeagle","timestamp":1354242772,"content":"This looks fine to me.\n\n- the Warg attacks\n\n- if no Shadow effect, the Warg returns to the staging area after it attacks\n\n- then comes your chance to attack enemies, including using Dunhere against the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/74922-interesting-dunhere-vs-wargs-scenario/?do=findComment&comment=730108","commentId":730108,"userName":"dvang","timestamp":1354558272,"content":"Yes, you can attack with Dunhere. Since the Heroes make their attacks after the Enemies make their attacks, at the time that the Heroes get to attack the Wargs are back in the staging area. This means that Heroes previously engaged cannot attack the Wargs (b/c they are in the staging area), but also does mean that they are eligible for Dunhere to attack them (b/c they are in the staging area)."}]}