{"url":"https://community.fantasyflightgames.com/topic/75007-celador/","title":"Celador","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75007-celador/?do=findComment&comment=729590","commentId":729590,"userName":"Narsil0420","timestamp":1354414806,"content":"So, I'm unsure if I can use Celador (while he's in the staging area) for anything other than just getting his quest contribution.\n\nCan I use him to attack or defend?\n\nCan I exhaust him to put 3 progress on Overgrown Trail? (\"Exhaust a Ranger character to put 3 progress on…\")\n\nCan I heal him?\n\nMy current thought is NO to all of these. Otherwise, why would they make the distinction between having him in the staging area and later when he moves to our play area…\n\nOf course we can do all this when he moves to our play area as per stage 3 of Into Ithilien"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75007-celador/?do=findComment&comment=729807","commentId":729807,"userName":"starhawk77","timestamp":1354478833,"content":" \n\nYou can't do the first two, but there are several ways to heal him.\n\nAlthough Celador is committed to the quest, you do not control him until you reach the third quest stage. Both attacking/defending and paying the cost of Overgrown Trail's effect require you to control the character being used for that action.\n\nOn the other hand, he still counts as a character (per the HoN rules insert).  This means effects like Warden of Healing and Lore of Imladris can remove damage from him, as they do not require that you control the target(s) of their effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75007-celador/?do=findComment&comment=729815","commentId":729815,"userName":"Narsil0420","timestamp":1354482115,"content":"Yeah, good points.\n\nThat's how I played it as well.\n\nJust had my first win against Into Ithilien. What a great scenario!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75007-celador/?do=findComment&comment=729862","commentId":729862,"userName":"starhawk77","timestamp":1354497599,"content":"Yeah, I really enjoy it. I love the mechanic in this scenario (and The Siege of Cair Andros) whereby you can alter the composition of the quest deck by completing an optional objective. Great way to increase replayabilty and give players that \"achievement unlocked\" feeling.\n\nThis particular scenario is a bear because of that initial active location. If you can't get rid of it on the first turn, things can go downhill pretty quickly as every enemy egages you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75007-celador/?do=findComment&comment=731360","commentId":731360,"userName":"Beast Rabban","timestamp":1354892422,"content":"He and the other Ranger. Gondor. Objective Allies also count when calculating the cost to play Citadel Custodians."}]}