{"url":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/","title":"Initial Thoughts on Heirs? Quests and Player Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=729866","commentId":729866,"userName":"impaulm","timestamp":1354498329,"content":"Since some of us have had the weekend to take a stab at the new Heirs of Numenor expansion, I was wondering what everyone thinks so far.\n\nMy initial opinion my first time through the quests was pretty negative to the Battle and Siege Keywords, but now that I have had a chance to make some deck changes I really like them quite a bit. It forces the solo play to have an even more balanced deck, which can be quite a challenge, and plan each turn much more carefully. What I like most is that it really opens the door to a strong and immensly helpful Tactics sphere, both in solo and multiplayer. The one big downside seems to be that a characters willpower at  times has no use. Maybe the designers will find a way for our heroes and allies to utilize that a different way too, even in multi-sphere decks. Ultimately, I like the new Battle and Siege mechanic enough that I wish it was used from the beginning.\n\nSince it is getting late I'll chime in tomorrow with some card thoughts!\n\nPaul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=729880","commentId":729880,"userName":"starhawk77","timestamp":1354505402,"content":"Yeah, battle and siege make deckbuilding much more interesting. As you noted, they make Tactics much more viable for solo play, and they REALLY hose Spirit. \n\nOn the subject of willpower, we've seen a preview of the Spirit event \"Against the Shadow,\" which allows Spirit characters to use their willpower as defense. That'll be good for combat (traditionally the ***** in Spirit's armor) but also for questing if the scenario is replete with siege keywords. That's just one example of a card that uses willpower creatively, and I wouldn't be surprised to see more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=729961","commentId":729961,"userName":"rborkowitz","timestamp":1354526984,"content":"I find the second quest really difficult.  I've played it a half a dozen times and have never made it past the first stage.  I play solo with two decks and it every card from the encounter deck I reveal just compounds the problems.  It seems that if I don't get a couple of \"Test of Will\" cards to play ASAP (and some cheap allies), I'm dead before you know it.  In fact, I'd consider it hard than the first question, which is a difficult 5 (while the second is only a 4!).  Does any one else feel this way?  Any secrets strategies I'm missing?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=729964","commentId":729964,"userName":"Captain Poe","timestamp":1354527135,"content":"I like it, though i was hoping that pure gondor decks would be a little more powerful. I think at this time, gondor/men still lack good attachment options. The spear is a nice start though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=729968","commentId":729968,"userName":"Mattr0polis","timestamp":1354527658,"content":"Our group hasn't played the third quest yet but the first two were VERY fun and VERY thematic. FFG has really been nailing that these last couple cycles.\n\nLots of really awesome player cards as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=729972","commentId":729972,"userName":"Valyrian Steel","timestamp":1354528079,"content":"rborkowitz said:\n\nI find the second quest really difficult.  I've played it a half a dozen times and have never made it past the first stage.  I play solo with two decks and it every card from the encounter deck I reveal just compounds the problems.  It seems that if I don't get a couple of \"Test of Will\" cards to play ASAP (and some cheap allies), I'm dead before you know it.  In fact, I'd consider it hard than the first question, which is a difficult 5 (while the second is only a 4!).  Does any one else feel this way?  Any secrets strategies I'm missing?\n\n \n\n \n\n\n\nrborkowitz said:\n\nI find the second quest really difficult.  I've played it a half a dozen times and have never made it past the first stage.  I play solo with two decks and it every card from the encounter deck I reveal just compounds the problems.  It seems that if I don't get a couple of \"Test of Will\" cards to play ASAP (and some cheap allies), I'm dead before you know it.  In fact, I'd consider it hard than the first question, which is a difficult 5 (while the second is only a 4!).  Does any one else feel this way?  Any secrets strategies I'm missing?\n\n \n\n \n\n\n\n100% agree that the second quest is crazy hard for a difficulty 4. I usually play two player and the decks we have built have handled every quest to date, including the first quest of HoN at a reasonable win rate. This one though, we've played about 7 times without really getting close. We made it to the third quest card one time but due to the inability to engage any enemies in stage 3 the staging area was so built up in 2-3 turns that we were destroyed by all the enemies as soon as we got there. The treachery cards are insanely card (although not one shot kills), and getting attacked with 5 attach from every enemy is very hard to defend against. Also agree that the times we didn't start with a test of will and vassal of the windlord we were usually hosed within a couple rounds. \n\nThe best strategy we had so far was to quest basically everyone the first round to at minimum get rid of Ithilien Road so stop the Southerns from engaging, try to get through the first quest card round 2-3 to get to the hidden road and grab any of the 2-3 threat enemies prior to advancing to keep the staging area at a minimum. The problem again is getting through stage 3 quickly enough to not die immediately on stage 4 (really wish you could at least optionally engage here). If you go to stage 2 instead the siege mechanic makes the Southerns rediculously powerful instead which is equally bad plus the archery every turn. Anyone have any other good strategies on this one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730006","commentId":730006,"userName":"impaulm","timestamp":1354532898,"content":"The second quest is hard! I beat it with a solo deck last night, but I think I ignored a shadow effect on my first turn Southron attack which would have given him +3 on top of the five he already had. No real solid strategies yet… I think that I am mainly just not yet used to building a deck that can handle this type of quest, but still beat the quests published before it. I bet things will get easier once we figure this out. \n\nAs for player cards, I am a huge fan of the set for lore. The ranger cards are great, and I think the new Ranger Spikes work really nice. The Master of Lore, I think is his name, is fantastic! Put him into a mono- sphere lore deck and with one or two of him in play, you can send out three allies a turn, or cheaply set some Forrest snares and ranger spikes. An Aragorn, Bereavor, Denethor deck I built for fun beat the first quest pretty easily using these. All I need is Anborn from the first AP coming up and I think it would be pretty great. \n\nI am excited for the time when Gondor is viable, and these cards start to help. The Custodian card works really well with A Very good Tale, the Envoy from Pelargir is very nice, and Beregond and the new Boromir are really nice heroes. I think that by the second pack we will have some good Gondor options. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730016","commentId":730016,"userName":"Narsil0420","timestamp":1354534386,"content":"Captain Poe said:\n\nI like it, though i was hoping that pure gondor decks would be a little more powerful. I think at this time, gondor/men still lack good attachment options. The spear is a nice start though.\n\n\n\nYeah, no really good weapon options. What I've been doing is actually playing with Keeping Count to get some extra attack power. I also used Aid of the Eagles on (old) Boromir for some series battle questing power!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730024","commentId":730024,"userName":"Captain Poe","timestamp":1354535631,"content":"That works. Dunidain mark helps a bit… but i feel like the axe is too expensive to use on non-dwarf characters, and blades of gondolin are too situational."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730081","commentId":730081,"userName":"richsabre","timestamp":1354550471,"content":"just got mine today and i have to say wow- the art in this pack is the best so far (i know i know- i say that every time haha)\n\ni was worried that it may be a little less tolkien a little more GoT, given the theme, but nope…spot on, well done ffg\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730117","commentId":730117,"userName":"Zdawg88","timestamp":1354560010,"content":"I beat the second quest on my second play through of it. I stuck with my same pseudo Gondor themed deck that I had beaten the first quest with. Leadership Aragorn, tactics Boromir, and Elanor. I'm finding with solo play (one deck) having heroes that can multi-task, meaning perform actions in more then one phase of the turn, is becoming a necessity. Being able to quest, and then attack or define is really nice. In the second quest Aragorn, since he is a ranger can quest, then ready, then exhaust to add progress to the Ithilien Road. I'm also falling in love with Hail of Stone. Knocking out the enemies before they even engage you is nice. My deck has a lot of cheap Gondor allies, so there is usually some left around that didn't quest to power the Stone card. Also, the 4 defense Gondor ally is just awesome in the siege quest stages. Throw in the For Gondor card and you can get some serious questing power in some of the stages in a Gondor deck. I think in stage four of the second quest, my turn my quest total was 26. \n\nNow to try the third quest "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730253","commentId":730253,"userName":"Captain Poe","timestamp":1354612062,"content":"Zdawg88 said:\n\nI beat the second quest on my second play through of it. I stuck with my same pseudo Gondor themed deck that I had beaten the first quest with. Leadership Aragorn, tactics Boromir, and Elanor. I'm finding with solo play (one deck) having heroes that can multi-task, meaning perform actions in more then one phase of the turn, is becoming a necessity. Being able to quest, and then attack or define is really nice. In the second quest Aragorn, since he is a ranger can quest, then ready, then exhaust to add progress to the Ithilien Road. I'm also falling in love with Hail of Stone. Knocking out the enemies before they even engage you is nice. My deck has a lot of cheap Gondor allies, so there is usually some left around that didn't quest to power the Stone card. Also, the 4 defense Gondor ally is just awesome in the siege quest stages. Throw in the For Gondor card and you can get some serious questing power in some of the stages in a Gondor deck. I think in stage four of the second quest, my turn my quest total was 26. \n\nNow to try the third quest \n\n\n\n \n\nWould you be willing to put up a complete deck list? i'd like to try this. My gondor builds have been getting devoured."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730308","commentId":730308,"userName":"Captain Poe","timestamp":1354619502,"content":"Captain Poe said:\n\nZdawg88 said:\n\n \n\nI beat the second quest on my second play through of it. I stuck with my same pseudo Gondor themed deck that I had beaten the first quest with. Leadership Aragorn, tactics Boromir, and Elanor. I'm finding with solo play (one deck) having heroes that can multi-task, meaning perform actions in more then one phase of the turn, is becoming a necessity. Being able to quest, and then attack or define is really nice. In the second quest Aragorn, since he is a ranger can quest, then ready, then exhaust to add progress to the Ithilien Road. I'm also falling in love with Hail of Stone. Knocking out the enemies before they even engage you is nice. My deck has a lot of cheap Gondor allies, so there is usually some left around that didn't quest to power the Stone card. Also, the 4 defense Gondor ally is just awesome in the siege quest stages. Throw in the For Gondor card and you can get some serious questing power in some of the stages in a Gondor deck. I think in stage four of the second quest, my turn my quest total was 26. \n\nNow to try the third quest \n\n \n\n \n\n \n\nWould you be willing to put up a complete deck list? i'd like to try this. My gondor builds have been getting devoured.\n\n\n\n \n\nAlso, do you think Beregond would work over boromir?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730416","commentId":730416,"userName":"Zdawg88","timestamp":1354641393,"content":"Here's the list I use:\n\nLeadership Sphere Cards\n\nErrand Rider 3\n\nGuard of the Citadel 3\n\nCitadel Custodian 2\n\nFaramir 2\n\nSteward of Gondor 3\n\nFor Gondor! 3\n\nSneak Attack 3\n\nTactics Sphere Cards\n\nDefender of Rahmas 3\n\nGondorian Spearman 3\n\nSpear of the Citadel 3\n\nFeint 3\n\nHorn of Gondor 2\n\nHail of Stones 2\n\nSpirit Sphere Cards\n\nDamrod 2\n\nBlood of Numenor 2\n\nUnexpected Courage 2\n\nA test of will 3\n\nNeutral Cards\n\nEnvoy of Pelagir 3\n\nGandalf 3\n\n \n\nI own two core sets, so that is why I choose 2 for some of the cards. Also, I like Boromir over Beregond because of what I mentioned before, being able to multi-task. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730597","commentId":730597,"userName":"ClydeCloggie","timestamp":1354701714,"content":"I have now played the first two scenarios.\n\n \n\nI beat Peril in Pelargir on the first try (short report in the PiP thread on this site).\n\n \n\nInto Ithilien beat me twice, first time I was well and truly Mumaked on stage 1. The second game was pretty tight, and I made it to 12 progress on stage 3 before it all went pear-shaped. As a consolation prize, I did kill the Mumak this time through 4 turns of hard combat. I think I could actually have won if I'd taken the gamble to commit everyone to the quest on the turn I made it to 12 progress; I did have 3 more willpower in reserve, but was holding back in case I couldn't finish the quest that turn. It would have meant an undefended Mumak + potentially a 2nd enemy from the deck. Oh well. It was interesting to see how the encounter deck bit back. Two shadow effects removed 6 progress from the quest and then Glorfindel was killed by a When Revealed; the game was up.\n\nI really like both quests, great flavour and tough decisions needed. To be honest, leafing through the encounter deck I couldn't see how I was ever going to win Into Ithilien; every single card seems brutal in that one. Battle questing is easier than normal though as there is a lot of cheap attack strength available in player cards (Vassal, Axehand, Trollshaw Scout etc.) so that helps. In all three games my heroes received a lot more damage than in an average game against earlier scenarios, but that may also be due to my style of play with the deck I was using (Spirit Glorfindel, Tactics Boromir, Lore Aragorn)\n\nEarly favourite for player card is Ranger Spikes. Took care of a Zealous Traitor that could have wrecked my plans on Peril in Pelargir so a great first impression.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=730610","commentId":730610,"userName":"impaulm","timestamp":1354703869,"content":"The Ranger Spikes are a great addition! I'm also having some success with Hands upon the Bow and Legolas, to prevent some of those enemies from piling up in the staging area in into Ithilian and to knock out some of those enemies with rough forced engagement effects.\n\nI am most looking  forward to what Dunedain cards emerge from this set of AP's. I think there may be some really great ranger decks appearing. \n\nThese quests do seem to make the heroes pretty vulnerable, but I guess when questing with your strength of arms, you are bound to see more damage. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731279","commentId":731279,"userName":"Glaurung","timestamp":1354879855,"content":"HON is amazing. I really love it! Difficult and very very hard solo. And as i see encounter cards is 3 times more powerful in 2 player game.Really need to cooperate with your partner to win. this is just my trhough ( i still didn try 2 or more player game). Anyway HON is really what i waiting for!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731379","commentId":731379,"userName":"RGun","timestamp":1354896173,"content":"Glaurung said:\n\nHON is amazing. I really love it! Difficult and very very hard solo. And as i see encounter cards is 3 times more powerful in 2 player game.Really need to cooperate with your partner to win. this is just my trhough ( i still didn try 2 or more player game). Anyway HON is really what i waiting for!\n\n\n\nYeah, I'm a solo player and I just changed to play 2-handed.  I was worried this would make the quests too easy for me as I enjoy a good challenge and would be bored if I won most of the time.  Appears I had nothing to worry about - I am getting crushed by Peril in Pelagir and haven't yet attempted the other two.  Flipping over 2 cards from the encounter deck with the treacheries and enemies in HoN makes it very difficult (e.g. colloratoral damage becomes a beast).  I've avoided using a dwarf deck as I wanted to try some new cards (a little bored of dwarves at the moment having used them for all of Khazad-dum) but I may need to go back to them.  My Gondor and Eagles decks just aren't working for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731411","commentId":731411,"userName":"ClydeCloggie","timestamp":1354903947,"content":"Just beat Into Ithilien on the 5th try, solo and still with my Tactomir / Spirfindel / Loragorn deck.\n\nI thought I had it in the bag when I quested for 20 willpower on 4b with just 1 threat in the SA, 15 needed on the quest, and threat at 29. But lo and behold, Watcher in the Wood raised my threat by 9, meaning the quest gained siege,  The Southron Company in the SA went to 3 threat rather than 1, and all of a sudden I was questing for 9 defense instead of 20 willpower. I LOVE the way the encounter deck can turn the game in the blink of an eye in this scenario.\n\nNevertheless, thanks to near-total board control I managed to slog it out for three more turns and finish the quest. Again with lots of wounds on my heroes (9) and threat in the 40s. HoN does not give easy wins away, it seems. \n\nSeriously, this expansion has pushed the game into stratospheric heights IMO.\n\nOn to Cair Andros! \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731459","commentId":731459,"userName":"Bullroarer Took","timestamp":1354921077,"content":"My fear is that in an effort to make the quests more difficult the solo player has become locked in to just a few choices.  The winning decks here and at BGG are holding a lot of Sporifindel and Loragorn.  I'm glad tactics is finally getting a little step forward, but let's not throw deck flexibility completely out the window.\n\nYeah, I know the irony.  I'm the guy that was trying to force my Three Hunters round peg into the Mirkwood square hole.  I'm not rushing to judgement until we see a few card packs, but I'm seriously afraid that the game is becoming \"narrow minded\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731498","commentId":731498,"userName":"ClydeCloggie","timestamp":1354939391,"content":"Bullroarer Took said:\n\nMy fear is that in an effort to make the quests more difficult the solo player has become locked in to just a few choices.  The winning decks here and at BGG are holding a lot of Sporifindel and Loragorn.  I'm glad tactics is finally getting a little step forward, but let's not throw deck flexibility completely out the window.\n\nYeah, I know the irony.  I'm the guy that was trying to force my Three Hunters round peg into the Mirkwood square hole.  I'm not rushing to judgement until we see a few card packs, but I'm seriously afraid that the game is becoming \"narrow minded\".\n\n\n\nWell, there's always the fun deck; I'm very fond of my Family Trip deck (Elrond, Elladan, Elrohir on The Redhorn Gate).\n\nAnd actually, thinking about it, the choice for a solo general purpose deck used to be quite simple: tri-sphere without Tactics. Now with HoN, Tactics is a must. Since I like Lore's allround goodness, that means having to choose between leaving out Spirit or Leadership. Current build has no leadership hero and is quad-sphere through Song of Kings, but it's definitely giving me more headaches than before.\n\nIn terms of heroes, you're right. I considered Eleanor and Beravor instead of Glorfindel and Aragorn, but for the same amount of threat there's just no comparison. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731510","commentId":731510,"userName":"Eric W","timestamp":1354947339,"content":"Just remember how hard these quests are when someone asks you if they should buy this or Kazadum for their first big box expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731521","commentId":731521,"userName":"Glaurung","timestamp":1354952994,"content":"RGun said:\n\nGlaurung said:\n\n \n\nHON is amazing. I really love it! Difficult and very very hard solo. And as i see encounter cards is 3 times more powerful in 2 player game.Really need to cooperate with your partner to win. this is just my trhough ( i still didn try 2 or more player game). Anyway HON is really what i waiting for!\n\n \n\n \n\nYeah, I'm a solo player and I just changed to play 2-handed.  I was worried this would make the quests too easy for me as I enjoy a good challenge and would be bored if I won most of the time.  Appears I had nothing to worry about - I am getting crushed by Peril in Pelagir and haven't yet attempted the other two.  Flipping over 2 cards from the encounter deck with the treacheries and enemies in HoN makes it very difficult (e.g. colloratoral damage becomes a beast).  I've avoided using a dwarf deck as I wanted to try some new cards (a little bored of dwarves at the moment having used them for all of Khazad-dum) but I may need to go back to them.  My Gondor and Eagles decks just aren't working for me.\n\n\n\nJust try my Dwarfs decks against HON. Peril In Pelargir i won once but was really close to lose. Second quest i dont have any chance to win(try maybe 5 times already). Last one i dont even try yet. Need to build up new kind of decks. Looks like 2 player game should be awesome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731536","commentId":731536,"userName":"lleimmoen","timestamp":1354957618,"content":"Glaurung said:\n\nHON is amazing. I really love it! Difficult and very very hard solo. And as i see encounter cards is 3 times more powerful in 2 player game.Really need to cooperate with your partner to win. this is just my trhough ( i still didn try 2 or more player game). Anyway HON is really what i waiting for!\n\n\n\nI think you are right. It scales very well. There are cards that are just so much more potent in coop, but on the other hand it is really hard to build a solo deck that can do all things. We actually had a pretty hard time squeezing everything into two decks. We had our decks prepared for Pelargir but had to change them dramatically to stand a chance. We had hardly ever had to do this before. Now I want to tweek the decks so they can still beat some of the earlier quests but to win them all with one (or even two) deck(s) will soon be impossible, I feel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731538","commentId":731538,"userName":"lleimmoen","timestamp":1354957994,"content":"Glaurung said:\n\nLooks like 2 player game should be awesome!\n\n\n\nAnd yeah, I can confirm, coop is rather great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75051-initial-thoughts-on-heirs-quests-and-player-cards/?do=findComment&comment=731582","commentId":731582,"userName":"Glaurung","timestamp":1354966547,"content":"Just try the last quest…… Lost of course but……epic battle! Really love this chain of shadow cards! This quest is very difficult to play solo. FFG make a great job for now cose even 2 player game you must to play very carefull, cooperate with you partner all the time and really one or 2 mistaces can cost you all game. So now in my opinion game come to really cool level! Now the real game is begin!!!!"}]}