{"url":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/","title":"Heirs of Numenor or Khazad-Dum?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=730001","commentId":730001,"userName":"gatharion","timestamp":1354532315,"content":"If you could pick just one of the deluxe expansions, which one would it be?\n\nAssuming they cost the same and you did not have a preference for either Gondorians or dwarves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=730026","commentId":730026,"userName":"richsabre","timestamp":1354536007,"content":"depends on what expansions i had. i would go in order. i have just got Hon today but i would say it is harder than khazad dum\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=730037","commentId":730037,"userName":"impaulm","timestamp":1354537981,"content":"I agree with Rich. HoN is much more difficult, but I think I personally like the storyline better. If I only had the core set, I would have to say Khazad would be my choice, since I think I would be more successful on the quests, and it would allow me to get into the Dwarrowdelf AP set. If I had the first cycle of AP's then maybe HoN would be a good choice, since it might be easier then to win some. It would also allow me to get into the new cycle starting up in a couple months. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=730054","commentId":730054,"userName":"Captain Poe","timestamp":1354542639,"content":"Khazad is a very solid set, and i am inclined to say while dwalin kinda sucks, bifor is probably the best hero out of all those offered in HoN and KD. You'll also have a lot of cards to build dwarf decks, which are at this time much more competitive and capable than gondor decks. You also won't have to wait long if you want to pick up the month adventure packs, as all the Khazad Dum adventure packs are already available in stores."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=730467","commentId":730467,"userName":"Rob_Oz","timestamp":1354656057,"content":"The answer to your question depends largely on what you are looking for. Khazad Dum has an entire Adventure Cycle to support it, plus many other dwarves from the existing game sets, so it would be stronger from a deck-building perspective.  Heirs of Numenor is just kicking off a new cycle, so it likely will not do as much for your decks until several more Adventure Packs are released.  While I own Heirs of Numenor, I have yet to play any of the quests.  However, I hear that the quests are some of the hardest yet, so if you are interested in challenging quests you may want to purchase HoN.  Thematically, it's a case of Moria/Dwarves/Dungeons/Caverns/Goblins (Khazad Dum) vs. Gondor/Men/Sieges/Battles/Outdoor locations (Heirs), so pick your preference, if you have one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=730741","commentId":730741,"userName":"player2052423","timestamp":1354732245,"content":"KD, and I would then start with the corresponding adventure packs.  Have fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=730749","commentId":730749,"userName":"Eric W","timestamp":1354735670,"content":"KD has the least player cards of the 3 expansions.  They all have 165 cards, but more were spent on quest cards and encounter cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75072-heirs-of-numenor-or-khazad-dum/?do=findComment&comment=731567","commentId":731567,"userName":"CaffeineAddict","timestamp":1354963852,"content":"very difficult to pick…in my opinion, Khazadum and Heirs of Numenor are my favourite releases of the game so far, both are just really thematic and enjoyable. I think it depends what else you own - if you're going straight from core, heirs is going to be really difficult (if not impossible), whereas Khazadum (though certainly not easy) might be a more enjoyable experience."}]}