{"url":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/","title":" Into Ithilien:  the first broken scenario?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=731839","commentId":731839,"userName":"Stenun","timestamp":1355045737,"content":"It was bound to happen eventually; with so many scenarios being produced for this game it was inevitable that sooner or later one would slip through the net and be grossly over-powered, and indeed I am beginning to suspect that Into Ithilien is not just over-powered but even broken.\n\nOnce you've placed the starting location and starting objective in play, there remains 35 cards in the deck.  Out of those 35, 16 of them are enemies and 8(!) of them have surge on the first quest card while 2 of them make you search the Encounter deck/discards for a number of enemies equal to the number of players.  So that's 26 cards that are either an enemy or make you draw again, thus giving you another chance to draw an enemy.  That's three-quarters of the deck (for the pedantic among you, it's 74.286% sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]).\n\n \n\nNow in of itself, that's not so unusual for this game.  But let's continue with our examination …\n\nIf you're on the first Scenario Card, Southron Company get +2 attack for a final attack of 5.  Meaning that the average attack of the enemies in the deck is 3.7.\n\nSo in other words, you have a 75% chance of each card draw resulting in an enemy with attack 3.7.  And that's on the first turn of the game.\n\n \n\nHow many Heores and Allies can stand up to an attack that high?  Not many …\n\n \n\nI haven't even touched on the text of the cards, yet.\n\nBlocking Wargs:  Surge.  When Revealed: Deal 1 damage to each character commited to the quest.  (If the current quest has the battle or siege keyword, shuffle this card back into the encounter deck.)\n\nThere are four copies of this card.  So a 1 in 9 chance that every questing character will take one wound and then you shuffle the card back into the deck and draw another one.  And what exactly are you supposed to do if you find the last two cards in the encounter are both copies of Blocking Wargs?  The game enters an infinite loop in which you keep drawing them over and over until they kill off every single questing character and then keep drawing them … game over.\n\n \n\nAnd as for Scenario Card 3B … \"Enemies do not make engagement checks and cannot be opitionally engaged.\"  … what??  So every enemy drawn just sits there?  Slowly building and building in number with their Archery keywords and you not able to do anything to hurt them?  Until suddenly you get to 4B which pushes up your threat by an additional two per round meaning chances are that as soon as you get there, all the enemies are going to pile on you with their average 3.7 attack.\n\n \n\nAnd this is supposed to be a Difficulty 4 scenario????\n\nI'm sorry but this is absurd.  There is no way this is a Difficulty 4.  The only way you can hope to beat it is with extreme luck.  Not just luck in the way the opening of the Encounter deck plays out but also in your opening hand.  You have to either kill the starting active location on the first turn or every player gets an attack 5 enemy with additional enemies at a probability of 75% for each player.\n\n \n\nFFG have seriously messed up with this one.  I genuinelly believe this scenario is the first broken one in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=731841","commentId":731841,"userName":"Stenun","timestamp":1355046229,"content":"(also posted on Board Game Geek, here:  http://boardgamegeek.com/thread/895682/into-ithilien-the-first-broken-scenario [http://boardgamegeek.com/thread/895682/into-ithilien-the-first-broken-scenario])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=731861","commentId":731861,"userName":"Glaurung","timestamp":1355051151,"content":"I dont think is broken. Hard? yes. Difficult? yes. Almost imbossible solo? yes. But that what make a game interesing. Players card was already so powerful before HON, players can win every current quest solo. So if you can win solo nin 2 player game with 2 powerful deck players win very easy. My last games was boring and only Battle in Lake- town still provide any challenge. But now  with HON we come back to real game. Now you must to build up 2 deck which should really cooperate and working together. Most of us play tnis game for 1 year already, so players need some challenge.\n\nToday i play with my friend 2 player game agaisnt Peril in Pelargir. We play 2,5 hours and we lost! My friend very good player and mostly we win. But this time we lose.And we must to real think make a lot of hard decision and diffcult predict what ahppen next. Location and travel now is really important also.\n\nThe game in my opinion make very big step forward with HON. Now this is really cool game. So real game is just only begin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=731914","commentId":731914,"userName":"lleimmoen","timestamp":1355064337,"content":"I can only comment on Peril in Pelargir, have not had a chance with Ithilien. But I have been playing Pelargir over and over and I find it the best quest since Osgiliath, if not the best ever. I think core set did a great job with Dol Guldur for 2 player game but since there were few quests I would want to repeat many times, especially Khazad and Dwarrodelf were real downers for me. Pelargir feels very new and it is so unpredictable that I do not think it will get old soon.\n\nOn the other hand, the OP must have a point. I know how this game can get annoying. Especially when the odds are against you, you can bet something will always go wrong. I am only guessing here but it may also be that us who have been playing this game from the start are used to certain strategies that are placed upside down with HoN. I was certainly shocked in the first few games in Pelargir but it was not impossible to find a way to improve the dekcs, and some cards I had barely considered before suddenly found way into our decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=731917","commentId":731917,"userName":"ClydeCloggie","timestamp":1355066370,"content":"I have played Into Ithilien five times now, solo with one deck. Won once, and came really close (within 3 tokens of victory) on two other occasions. So no, I don't consider this quest to be broken.\n\nIt's essential to clear Ithilien Road on turn 1, so there is probably a limited number of decks that can handle this quest. But since these options will almost all include Tactics, that's not a bad thing as Tactics has long been a distant fourth in the solo sphere rankings.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=731931","commentId":731931,"userName":"impaulm","timestamp":1355069064,"content":"I commented over on BGG, so I'll add something different here.  This quest is hard! I think it requires us to reevaluate every card in our deck to make sure things really are balanced. Before, I was able to slap a lot of quest strength into a deck, ignoring the other two traits, and be pretty much ready to go with a decent chance. I think these quests are here to end that, harshly.\n\nEither way, I would say the quest is more of a seven or eight personally, but might lower once I get an even better grasp on deck construction with the new battle and siege keywords in mind. \n\n-Paul "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=731933","commentId":731933,"userName":"starhawk77","timestamp":1355069421,"content":"It's very hard, but it's not broken. My deck that crushes most scenarios is sub-.500 vs. this quest, but I've won several times. It can be done. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=732297","commentId":732297,"userName":"Style75","timestamp":1355149504,"content":"The quest seems hard now, but wait until we get all the new cards from the six adventure packs. I'd be willing to bet that we're going to get some cards that will make this quest a LOT easier by the time the AP cycle is finished. Look at the Khazad-dum cycle. By the end of it, those 3 expansion quests were quite simple with the tools you got from the AP's.\n\nI'd be willing to bet that this is part of FFG's marketing strategy. Raise the bar really high with tricky quests then sell people the specific tools needed to overcome the challenge. It worked on me, I bought every one of the AP's so far!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=732766","commentId":732766,"userName":"CaffeineAddict","timestamp":1355228368,"content":"I beat this on the first attempt, solo, and haven't gone back to it (been having way to much fun with Seige of Cair Andros). From reading your analysis, I'm thinking I may have got a lucky draw, so I think i'm going to have to go replay it a few times to see how difficult it really is…cos my first impression was that it was easier than the other two quests in Heirs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=732771","commentId":732771,"userName":"Glaurung","timestamp":1355228991,"content":"Play 3 session with 2 payers against this quest. All we lost. Was very cool! Really need to tail your decks to win……. We love it. Now is really intersting play coop. Really feel power of enemies and start to scare them! this is very ok with Tolkien lore! Still need to think about our decks….\n\nIn solo game i got better results and almost win but every time lose by the threat. My starting threat is to high 31."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=733232","commentId":733232,"userName":"Raven1015","timestamp":1355314552,"content":"Definitely a tough scenario, and I like how you broke it down statistically. However, I need to play with it a bit more in order to truly say my thoughts on whether it is broken or not, most likely it is just way more difficult than advertised. The two wargs left in the deck scenario is interesting. That may indeed need some errata, as I double-checked and the surge effect triggers after the when revealed (which would shuffled it back into the deck). I do want to say that I really enjoy how many new mechanics FFG has introduced in this expansion compared to Khazad Dum (battles, sieges, more use of objectives, new kinds of treacheries, etc.). They are really trying to bring something new and it definitely helps the replay value."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=733936","commentId":733936,"userName":"Valyrian Steel","timestamp":1355473769,"content":"This thing is still giving me nightmares. I ran all three scenarios (co-op) three times and here is the progress:\n\nPeril in Pelagrir - won 2 of 3 games. Only loss came on stage 1 due to getting two enemies from the active location mechanic on the first time and being unable to recover\n\nInto Ithilien - won 0 of 3. Best game was 8 progress on stage 1.\n\nSeige of Cair Andros - won 1 of 3. First loss was due to a turn 1 Mumak and the second due to battlegrounds getting blasted apart just before I was able to complete them.\n\nOne would think that if you are able to be competitive with Cair Andros then you should be able to take on Into Ithilien with at minimum similar success. I won't go into too many specifics since I've posted about my general deck make-up on another thread, but I've made some positive tweaks to what I posted to be more competitive in HoN without losing the ability to play against every quest. I'm not saying this quest is broken, but I think it requires a very tuned deck similar to AJtR which is kind of irksome to play with my style. \n\nWe managed to start the last game in great shape last night with 10 progress due to an early For Gondor and had everything cleared out of the staging area except one location and had a single enemy engaged. Next turn everything goes to hell, enemies attacking from the staging area, two shadow cards in a row removing 3 progress each, and all of a sudden it's insurmountable. Oh well, I guess I'll continue having fun with the much better made Seige of Cair Andros which provides a challenge, is amazingly fun to play, and feels winable most games.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=734459","commentId":734459,"userName":"Raven1015","timestamp":1355594276,"content":"I too am still struggling with this one, looking for my first win after several playthroughs. I haven't had this much trouble with a scenario since the first days of the Core Set. Usually, I find myself one-shotting most scenarios, so I actually appreciate this difficulty and am enjoying it immensely. Don't get me wrong, I've had my moments of rage, when I've drawn four Blocking Wargs in a row! (I'm not exaggerating) The farthers I've gotten is stage 3, only about 2 progress away from the last round, but the staging area just got swamped with too many enemies because I couldn't engage them and I didn't have enough willpower to move quickly enough. So I've been retooling the deck to be a bit more balanced. After several playthroughs, I can say that it is not broken (other than the possible infinite wargs loop), just extremely difficult. You need to tailor your deck very carefully."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=734737","commentId":734737,"userName":"Pharmboys2013","timestamp":1355660819,"content":"I beat this scenario on the first attempt whereas I struggle with the first and have yet to beat the siege of cair andros.  I played with one other friend, I used a deck of Elrond, Legolas, and Glorfindel whereas my friend used a Gondor themed deck of new Boromir, Prince Imrahil, and Beregond.  \n\nI think our main sucess came from being able to quest for a lot and keeping Celador in play.  Vassel of the Windlord came out early and the pump to Gondor allies from Boromir allowed us to clear stages in 2 turns max.  Beregond was also able to absorb the big hitters from the encounter deck while I assisted with ranged attacks from Legolas and healing from Lore gondor healer ally.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=735509","commentId":735509,"userName":"Raven1015","timestamp":1355775891,"content":"Finally got a victory against this scenario once I went back to using some (mostly) Dwarf decks. Dain/Loragorn/Bifur on one side and Frodo/Gimli/Thalin on the other. The Dain Dwarf strategy is super useful on this quest because you get a boost to attack and willpower, which helps with both battles and the regular quest, only the sieges are a bit hairy. I was able to beat the quest in about four turns total. Despite the amount of enemies in this quest, it was actually the treacheries and threat increases that were consistently beating me. The cards that were most key to such a quick victory were: Ranger Spikes, Gildor's Counsel, Radagast's Cunning, Test of Will. I've traditionally been a Tactics man, but Lore is quickly becoming my new favorite. Bring on Cair Andros (I played through once so far….ouch!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=736768","commentId":736768,"userName":"Stenun","timestamp":1355967888,"content":"Well, having now – finally – beaten the Scenario, I’m still not happy.\nI was determined to keep trying it until I beat it purely to maintain the fact that I have beaten every scenario (including both the print on demand scenarios) but this is not one I will be returning to often – if at all.\nMy friend and I were playing 2 player games and it was quite common to have 13 threat in the staging area during the first turn’s questing. Even with the Battle keyword on Stage 1, how many decks can you think of that can stand up to 13 threat on the first bloody turn??\nOn the first turn of one particular game, we had our threat raised by five, every questing character took 2 damage and we ended with 14 threat in the staging area. We didn’t even bother going on to the combat, we just stopped and started the whole game again.\nIn the end, the way we finally beat it came down to pure luck. We used Spirit-half-Rohan and Tactics-half-Eagles. The Spirit deck ran all the cancellation cards and cards to add tokens to sites while Tactics concentrated on high attack with the Eagles and lots of events.\nAnd even then we lost two heroes purely because of Blocking Wargs which constantly wounds all questing characters. Having cancellation cards is all very well but you only have so many and it only takes one Blocking Warg to trigger to get it shuffled back in your deck to come up again later – 3 copies were cancelled, 3 triggered.\n\nIf that’s what it takes to beat this scenario, it doesn’t exactly sit high on the “replayability” score line."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=736885","commentId":736885,"userName":"Style75","timestamp":1355997563,"content":"I still think we're going to be seeing some cards come out in the AP that will make this scenario much easier. I played Journey to Rhosgobel the other day, the first time in a long time, and it was an absolute cake walk using the cards available since the release of that AP. When this AP came out I must have tried it 5 or 6 times before I got a victory. Now it's almost a joke.\n\nI think the strategy from FFG is to keep the difficulty really high on release knowing full well they will get easier over time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=736916","commentId":736916,"userName":"Raven1015","timestamp":1356001216,"content":"Very true, and I like it better that way. Too easy right off the bat, and we'd all get bored very quickly. I'm looking forward to there being a \"surge killer\" card eventually. Man do I hate surge.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=736945","commentId":736945,"userName":"richsabre","timestamp":1356004545,"content":"Raven1015 said:\n\nVery true, and I like it better that way. Too easy right off the bat, and we'd all get bored very quickly. I'm looking forward to there being a \"surge killer\" card eventually. Man do I hate surge.\n\n \n\n \n\n\n\nid not like anything too powerful…..far from it. cards that make older quests easy are doing more damage to the replayability than having them easy to begin with\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737022","commentId":737022,"userName":"koraldon","timestamp":1356014357,"content":"Making quests harder in newer products hurts non-hardcore gamers like myself.\n\nI was looking forward to heirs, but quickly cooled off after hearing how difficult the quests are, considering that I only have the core and 2 AP's. Making me buy lots of other products to have a decent chance of winning the quests sucks.\nDon't like dwarves so KD is not for me, HoN is too difiicult, so basically the next product I can buy is either the SAGA or in 2014?\nI hope that the saga part 2 is good, otherwise I have no more interest in releases for this game.\n\nThe nightmare packs are a much better way to cater to those who want very difficult quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737060","commentId":737060,"userName":"danpoage","timestamp":1356019234,"content":"I think that you should give HoN a chance. I suspect that a lot of the talk about the difficultly of the HoN quests is coming from people who tried to shoehorn existing decks into these scenarios. I firmly believe that you can make effective decks for these scenarios with a more limited card pool (especially if you include Beregond as one of your heroes). Sure, if you don't like tactics you're going to be hard-pressed to field a deck that beats the HoN scenarios with any sort of consistency, but I do not think that you need every LotR card ever printed to make a workable deck.\n\nSolo is a different matter, but assuming you are playing with two players, and the other deck includes Spirit/Lore for cancel/healing, you can make a very effective tactics/leadership deck that will serve as your questing and combat deck for the HoN scenarios.\n\n \n\nThis deck is off the top of my head, but it only requires 1 core set, 3 chapter packs (2 of which you may already have) and HoN:\n\nHeroes:\n\nBeregond (HoN)\n\nGimli\n\nGloin\n\n \n\nAllies: 24\n\nErrand Rider (HoN) x3\n\nGondorian Spearman x3\n\nDefender of Rammas (HoN) x3\n\nVassal of the Windlord (The Dead Marshes AP) x3\n\nWinged Guardian (The Hunt For Gollum AP) x3\n\nVeteran Axehand x3\n\nGandalf x3\n\nBeorning Beekeeper (Conflict at the Carrock AP) x2\n\nBeorn x1\n\n \n\nAttachments: 14\n\nCitadel Plate x2\n\nCitadel Spear (HoN) x2\n\nDwarven Axe x2\n\nHorn of Gondor x1\n\nSteward of Gondor x2\n\nSong of Battle (The Dead Marshes AP) x1\n\nDunedain Mark (The Hunt for Gollum AP) x2\n\nDunedain Warning (Conflict at the Carrock AP) x2\n\n \n\nEvents: 12\n\nFeint x2\n\nSwift Strike x1\n\nSneak Attack x2\n\nThicket of Spears x1\n\nBehind Strong Walls (HoN) x3\n\nCampfire Tales (The Hunt for Gollum AP) x3\n\n \n\nI'm not claiming that this deck is automatic against the HoN scenarios, but assuming you play it with a support deck that can cancel some treacheries, quest during the few \"normal\" stages, and heal Gimli and Gloin when needed, this can be a very effective deck. I think it's a myth that you have to have all of the cards to make effective decks; certainly, it makes it easier, but there are some very good cards in the core set.\n\nUltimately, we all have our own preferences of the level of difficulty that we prefer. Personally, I really enjoy the challenge of the new scenarios, particularly the way that Battle and Siege quests have forced me to reexamine tactics cards that I previously may have dismissed. I encourage you to keep an open mind, and consider that even without buying other AP's or Expansions, Heirs of Numenor is something that you might enjoy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737066","commentId":737066,"userName":"Bullroarer Took","timestamp":1356020249,"content":"In my opinion they should not make the quests that much more difficult.\n\n1.  It discourages new players and the more people playing the game the longer we can expect it to last.\n\n2.  It restricts play style.\n\n3.  \"Nightmare mode\" play packs are already in the works and these can ramp up the quest difficulty for the more experienced masochists among us.\n\nI don't like the arguement that the quests will become easier with new card packs.  After I played Khazad Dum a few times I adjusted and was able to beat those quests using the tools at hand.  I didn't even have to change my heros, just my strategy.\n\nThis begs the question though:  what is a reasonable win percentage for a quest for an experienced player using a good deck?\n\nEasy - 90% ?\n\nMid - 50% ?\n\nHard - 10% ?\n\n(I am avoiding using FFG's numbering system since it seems completely arbitrary.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737079","commentId":737079,"userName":"Stenun","timestamp":1356021539,"content":"danpoage said:\n\nThis deck is off the top of my head, but it only requires 1 core set, 3 chapter packs (2 of which you may already have) and HoN:\n\nHeroes:\n\nBeregond (HoN)\n\nGimli\n\nGloin\n\n \n\nAllies: 24\n\nErrand Rider (HoN) x3\n\nGondorian Spearman x3\n\nDefender of Rammas (HoN) x3\n\nVassal of the Windlord (The Dead Marshes AP) x3\n\nWinged Guardian (The Hunt For Gollum AP) x3\n\nVeteran Axehand x3\n\nGandalf x3\n\nBeorning Beekeeper (Conflict at the Carrock AP) x2\n\nBeorn x1\n\n \n\nAttachments: 14\n\nCitadel Plate x2\n\nCitadel Spear (HoN) x2\n\nDwarven Axe x2\n\nHorn of Gondor x1\n\nSteward of Gondor x2\n\nSong of Battle (The Dead Marshes AP) x1\n\nDunedain Mark (The Hunt for Gollum AP) x2\n\nDunedain Warning (Conflict at the Carrock AP) x2\n\n \n\nEvents: 12\n\nFeint x2\n\nSwift Strike x1\n\nSneak Attack x2\n\nThicket of Spears x1\n\nBehind Strong Walls (HoN) x3\n\nCampfire Tales (The Hunt for Gollum AP) x3\n\n\n\n \n\nUnless you are EXTREMELY lucky, Blocking Wargs will rip this deck apart.\n\nRemember; it does 1 damage to every questing character, is normally shuffled back into the deck AND has Surge.  And there are four copies of it in the deck.  And you don't seem to have any defence against it at all.\n\nUnless all four copies come up as Shadow Cards, I don't believe this deck can beat Into Ithilien.  Sorry."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737092","commentId":737092,"userName":"danpoage","timestamp":1356024314,"content":"Stenun said:\n\nUnless you are EXTREMELY lucky, Blocking Wargs will rip this deck apart.\n\nRemember; it does 1 damage to every questing character, is normally shuffled back into the deck AND has Surge.  And there are four copies of it in the deck.  And you don't seem to have any defence against it at all.\n\nUnless all four copies come up as Shadow Cards, I don't believe this deck can beat Into Ithilien.  Sorry.\n\n\n\nI agree, blocking Wargs will rip this deck apart. Having played, and beaten Into Ithilien with a few different decks now, Blocking Wargs rips every deck apart, unless you can cancel it when it comes up or you get enough of an ally presence out and have healing on hand. In my experience, Blocking Wargs is *the* reason why Into Ithilien will always have a fair amount of luck involved, moreso, I would argue than most other scenarios in the game.\n\nAs I mentioned above, this deck needs to be played in a two player game alongside a Spirit/Lore support deck. I'm not saying that this is the ideal deck for Into Ithilien, I was simply providing an example of a deck that could be effective (with support) against HoN quests with a limited card pool. Yes, you will need to get some luck, as, in my experience, does every deck against that scenario. Even with two highly tuned decks using all available cards, a handful of games that we played were lost within the first two rounds simply because of bad draws from the encounter deck. There is no magic bullet solution to that, but I do believe that this deck, with support, could be effective against Into Ithilien. It's a matter of expectation, there is no way with this card pool that you are going to make a pair of decks that beat Into Ithilien even 50% of the time, but you would be hard pressed to make two decks that meet that criteria using every card currently available.\n\nSince I just came up with this deck off the top of my head and haven't had a chance to play with it, it may very well be entirely ineffective against Into Ithilien. The only way to know for sure is to try it out. I actually quite enjoy the challenge of deck-building with (admittedly arbitrary) constraints so I am going to take this as a goal, and an experiment:\n\nIs it possible to build two decks that have at least a 20% chance of beating Into Ithilien using only the following:\n\n1 Core Set\n\n3 Chapter Packs (The Hunt for Gollum, The Dead Marshes, Conflict at the Carrock)\n\n1 Heirs of Numenor\n\nHaving played Into Ithilien several times, and having had to tune decks specifically to deal with it (particularly Blocking Wargs), I suspect that you may be right. This, or a deck like it using the above card pool, may be impossibly overmatched by this scenario. In any case, I am now very curious to try this out. I will work on a Spirit/Lore support decking using this same card pool and see if can't make two decks with even a modicum of a chance.\n\nI'm going to try this expirment and let everyone kwow how it goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737112","commentId":737112,"userName":"danpoage","timestamp":1356026236,"content":"Here is the Lore/Spirit support deck that I will pair with the Tactics/Leadership deck above to see if it is possible to make effective decks for Into Ithilien using a limited card pool.\n\n \n\nSpirit/Lore Support Deck (with limited card pool)\n\n \n\nHeroes:\n\nEleanor\n\nDenethor\n\nGlorfindel (Core)\n\n \n\nAllies: 22\n\nHenemarth Riversong x1\n\nGleowine x2\n\nErebor Hammersmith x2\n\nSilvan Tracker (Dead Marshes AP) x3\n\nMirkwood Runner (Return to Mirkwood AP) x3\n\nMiner of the Iron Hills x2\n\nIthilien Tracker (HoN) x3\n\nMaster of Lore (HoN) x3\n\nDaugther of Nimrodel x1\n\nHunter of Lamedon (HoN) x2\n\n \n\nAttachments: 12\n\nUnexpected Courage x1\n\nA Burning Brand (Conflict at Carrock AP) x3\n\nProtector of Lorien x2\n\nSelf Preservation x1\n\nRanger Spikes (HoN) x3\n\nBlood of Numenor (HoN) x2\n\n \n\nEvents: 16\n\nA Test of Will x2\n\nHasty Stroke x2\n\nGaladhrim's Greeting x2\n\nDwarven Tomb x1\n\nStand and Fight x2\n\nLorien's Wealth x1\n\nRadagast's Cunning x3\n\nSecret Paths x3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737116","commentId":737116,"userName":"Narsil0420","timestamp":1356026780,"content":"After a lot of tries with various strategies, the Three Hunters come through!\n\nStrider/Gimli/Legolas with ranger spikes, peeking at the encounter deck, and pleanty of eagles won the day.\n\nI was trying to get a secrecy strategy to work with Glorfindel(S),Legolas and Thalin but just couldn't quite make it. Mostly due to lack of healing.\n\nI'm still convinced that a secrecy approach could work well with this scenario but you have to have Hands Upon the Bow to make it work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737247","commentId":737247,"userName":"Raven1015","timestamp":1356047804,"content":"I really like this discussion about difficulty, and balancing it for experienced vs. new players. I feel like it is something that has come up many times. I feel like it wouldn't be too difficult to include with each quest, or at least with the big expansions some type of \"easy mode\", even if it's something like \"remove the following cards from the encounter deck\". On the other hand, for those who are reluctant to buy HoN because of difficulty, I'll be honest, the quests are definitely difficult, but I agree with those who are saying that it is possible to beat them without having the entire card pool available. A lot of times we may find ourselves crediting our victories to having more powerful cards, but its also the case that the more you play this game and talk about it and read about it, the better you become (which is why I disagree with those who say that the game is mostly luck). So while that may be a double strike against new players, if they are willing to give the game a chance and invest some time into it, the difficulty will ease with practice. I think it would be an interesting challenge to construct a deck with an older pool of cards and see if it can beat the HoN quests. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737311","commentId":737311,"userName":"richsabre","timestamp":1356068438,"content":"Raven1015 said:\n\nI really like this discussion about difficulty, and balancing it for experienced vs. new players. I feel like it is something that has come up many times. I feel like it wouldn't be too difficult to include with each quest, or at least with the big expansions some type of \"easy mode\",\n\n\n\nironic that ffg are doing the exact opposite- making add on cards to make quests harder…..though i agree with you. ive seen alot of players give up and go because of the difficulty (in the early game)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737745","commentId":737745,"userName":"Glaurung","timestamp":1356154527,"content":"Raven1015 said:\n\nI really like this discussion about difficulty, and balancing it for experienced vs. new players. I feel like it is something that has come up many times. I feel like it wouldn't be too difficult to include with each quest, or at least with the big expansions some type of \"easy mode\", even if it's something like \"remove the following cards from the encounter deck\". On the other hand, for those who are reluctant to buy HoN because of difficulty, I'll be honest, the quests are definitely difficult, but I agree with those who are saying that it is possible to beat them without having the entire card pool available. A lot of times we may find ourselves crediting our victories to having more powerful cards, but its also the case that the more you play this game and talk about it and read about it, the better you become (which is why I disagree with those who say that the game is mostly luck). So while that may be a double strike against new players, if they are willing to give the game a chance and invest some time into it, the difficulty will ease with practice. I think it would be an interesting challenge to construct a deck with an older pool of cards and see if it can beat the HoN quests. \n\n\n\nYes i always was for the system when players can change difficult by themself. I play this game long time and my friend also so for us most of the quest is boring to play cose we win all the time! I like to play for example Hunt for Gollum but problem is to easy for 2 or 3 players so we never play this quest anymore. Hope we will get some nightmare pack for SOM cycle so we can play old quests again with challenge.\n\nWe love HON!!! This level of difficulty we really waiting for long time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=737962","commentId":737962,"userName":"kennoastic","timestamp":1356193080,"content":"To make it harder, just add 1 more card during staging.\n\nStill to easy? Add 1 more card, and so on till you reach desired difficulty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=738026","commentId":738026,"userName":"Glaurung","timestamp":1356205912,"content":"kennoastic said:\n\nTo make it harder, just add 1 more card during staging.\n\nStill to easy? Add 1 more card, and so on till you reach desired difficulty.\n\n\n\nThe problem is reveal extra cards is doesn work.  We play this game long time already and you think we didn try this very first solution what can come in your mind?\n\nBalance of the game is really fragile and 1 more card is easy destroy you special in begin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=738144","commentId":738144,"userName":"kennoastic","timestamp":1356237745,"content":"Glaurung said:\n\nkennoastic said:\n\n \n\nTo make it harder, just add 1 more card during staging.\n\nStill to easy? Add 1 more card, and so on till you reach desired difficulty.\n\n \n\n \n\nThe problem is reveal extra cards is doesn work.  We play this game long time already and you think we didn try this very first solution what can come in your mind?\n\nBalance of the game is really fragile and 1 more card is easy destroy you special in begin.\n\n\n\nsure it works. the solution is easy because it's good.\nsometimes it seems to me that people want really hard quests but they never want to lose. a hard quest should feel like a real victory when you finally beat it after losing some times :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\ni agree adding cards for 1 player the balance can be too hard to maintain. but for more players, especially 4, adding 1 card in staging is just 25% more cards in a 4-player game as opposed to 100% more when playing solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=738335","commentId":738335,"userName":"Ellareth","timestamp":1356283558,"content":"kennoastic said:\n\nGlaurung said:\n\n \n\nkennoastic said:\n\n \n\nTo make it harder, just add 1 more card during staging.\n\nStill to easy? Add 1 more card, and so on till you reach desired difficulty.\n\n \n\n \n\nThe problem is reveal extra cards is doesn work.  We play this game long time already and you think we didn try this very first solution what can come in your mind?\n\nBalance of the game is really fragile and 1 more card is easy destroy you special in begin.\n\n \n\n \n\nsure it works. the solution is easy because it's good.\nsometimes it seems to me that people want really hard quests but they never want to lose. a hard quest should feel like a real victory when you finally beat it after losing some times :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\ni agree adding cards for 1 player the balance can be too hard to maintain. but for more players, especially 4, adding 1 card in staging is just 25% more cards in a 4-player game as opposed to 100% more when playing solo.\n\n\n\n \n\nBut that is like giving AI extra money or units in games like Civilization or Total War, or cranking up your experience requirement to next level in MMORPG.\n\nBy tougher challenge gamers meant improved AI or better quest/content, not stacks after stacks of units or hours after hours of grinding.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=739144","commentId":739144,"userName":"Glaurung","timestamp":1356521394,"content":"I made it solo. 86 points. But was lucky a lot. Crazy difficult quest i love it!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=741470","commentId":741470,"userName":"Hannibal_pjv","timestamp":1357062939,"content":"Well in multiplayer we have in every deck spirit hero and in every deck there is maximum number of changeling cards…\n\nSo Lore/spirit, Tacktic/spirit, Leadership/spirit Spirit/something is normal way of buiding decks against heavy treachery decks… This reguires guite many core sets, but is very viable way of making good multiplayer decks :-)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=742989","commentId":742989,"userName":"GrandSpleen","timestamp":1357338810,"content":"Ouch… my first experience with this quest tonight was painful.  I was reminded of Journey Down the Anduin -- instead of a troll, you get a couple of Southron Companies in the first turn.  But there's no sneaking around those Companies, so the standard strategy for JDtA (low starting threat and build allies) isn't going to work here.  Oh, and here, have some threat in the staging area.  Maybe we'll see a hero in this cycle who can swap out the active location under certain conditions -- game changer for the early part of this quest.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=743754","commentId":743754,"userName":"rexhaha","timestamp":1357534882,"content":"At least Into Ithilien make me consider cards I've never considered is viable.\n\nAt this moment I am thinking of Thicket of Spears with Hama, Out of the Wild, Shadow of the Past and a whole lot of other cards allowing encounter deck manipulation.\n\nThe player cards are becoming very strong that makes nearly all of previous scenarios too easily, at least this is a challenge instead of beating the scenario ten minutes after it come out and wait for next one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=743809","commentId":743809,"userName":"Glaurung","timestamp":1357545723,"content":"revolution.hk said:\n\nAt least Into Ithilien make me consider cards I've never considered is viable.\n\nAt this moment I am thinking of Thicket of Spears with Hama, Out of the Wild, Shadow of the Past and a whole lot of other cards allowing encounter deck manipulation.\n\nThe player cards are becoming very strong that makes nearly all of previous scenarios too easily, at least this is a challenge instead of beating the scenario ten minutes after it come out and wait for next one.\n\n\n\nAgree with you 100%!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=743945","commentId":743945,"userName":"Stenun","timestamp":1357562615,"content":"The problem that I think many are missing, though, is that Into Ithilien is too reliant on luck.\n\nNot just hard cards like the Mumak (which I have no problems with but question its inclusion in an apparently \"Difficulty 4\" scenarion) but broken cards like Blocking Wards.  If Blocking Wargs is the last card in the scenario deck, it's game over.  Not \"it suddenly gets a lot harder\", the game enters an infinite loop.  Even the idea of Blocking Wargs is ridiculous - wound every questing character and there are four copies of the card in the deck.  How many characters can take all four without dying or healing?\n\nThis is a different play experience from the difficulty of the Mumak - it's not difficult, it's just cheesey.  There's no skill involved, no tactics, just luck.  I would happily take out all four copies of Blocking Wargs out of the deck in exchange for 2 more Mumaks.\n\n \n\nI have no problem with genuine difficulty but Into Ithilien is not it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=743987","commentId":743987,"userName":"Narsil0420","timestamp":1357565518,"content":"I don't think this scenario is \"unfair\" or purely luck based. If you're having trouble with really difficult treachery cards, remember that we have ways of dealing with bad treachery cards.\n\nI just had a great game with Imrahil/Eleanor/Boromir(New) where I scored 86 and it would have been ruined by Blocking Wargs if I didn't have Eleanor and Test of Will.\n\nWe also have Denethor, Out of the Wild, Shed Some Light, etc. to help avoid Treachery cards.\n\nI've had the hardest time with 2 players against Into Ithilien. My brother and I played 6 games in a row and lost every one. I simply take this as an awesome challenge, re-tool our decks and get back in there!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744101","commentId":744101,"userName":"GrandSpleen","timestamp":1357578979,"content":"As it the case with most things, the truth is probably on neither end of the spectrum being discussed.  The scenario is not totally broken (with the designer-acknowledged exception of the Blocking Wargs infinite loop, an admitted oversight).  Neither is it aptly-described as simply a challenging scenario which rewards players for thoughtfully constructing their decks.  That description fails to capture the heavily luck-dependent path to victory of any successful attempt at this scenario.  \n\nI think at present, even the perfect deck will fail at this scenario more than 50% of the time.  Can anyone claim better performance?  Or even a 50% win rate?  There are some very smart players on this board (many who are pleased with this scenario, I will add).  However, even with their insights, there has not yet arisen a strategy for tackling this scenario that does not depend on optimal draw from both the player deck and the encounter deck.  Therefore we can only describe Into Ithilien as a challenging scenario which requires both advanced tactics and a lot of luck.  And honestly I think if you sit down and play 7 games in a row, winning only 1 of them, you cannot credit yourself with great tactics or deck construction for the win.  You have to credit beating the odds and pulling just the right cards, which is little testament to the skill of the player.  However, that skill has to -- has to! -- be present for the perfect victory conditions to ever present themselves in the first place.\n\nI like what Valryian Steel said over in this [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=285&efcid=4&efidt=754061] thread: \"Every card in this scenario is just brutal and there is absolutely no breathing room.\"  Very succintly put."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744123","commentId":744123,"userName":"Alex6222","timestamp":1357582179,"content":"Yeah i think that the only way to beat this scenario right now is getting the right cards at the right moment and hoping the encounter deck shows a little mercy. I think that if there were 2 blocking wargs instead of 4 it would be more doable because generally you want to cancel blocking wargs but there are other treacheries that can really ruin your day."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744136","commentId":744136,"userName":"GrandSpleen","timestamp":1357583944,"content":"I didn't say so above, but I don't really have any problem with this scenario.  It's super hard, and that caters to people who like super hard scenarios.  Good for FFG!  I'm not really in that crowd, but I will certainly play this scenario until I beat it at least once :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\nI don't think the difficulty rating of \"4\" is even a valid talking point, really.  Obviously FFG's system for determining difficulty is busted in a big way.  No one in this thread is arguing that it deserves the rating it got.  I would really love to see a \"making of\" segment from FFG and to hear how they determined this rating -- for this scenario, specifically.  Anyway, I'm happy to consider it a typo.\n\nBut yeah… hard scenario.  Stupid elephant!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744210","commentId":744210,"userName":"Mattr0polis","timestamp":1357591242,"content":"I agree with Narsil0420, we have some tools to deal with real bad treachery cards, and there's bad ones in a lot of quests. I will say, if anything, I wouldn't mind just a couple more cards to deal with treacheries for the other spheres though.\n\nGrandSpleen said:\n\nI think at present, even the perfect deck will fail at this scenario more than 50% of the time.  Can anyone claim better performance?  Or even a 50% win rate?  There are some very smart players on this board (many who are pleased with this scenario, I will add).  However, even with their insights, there has not yet arisen a strategy for tackling this scenario that does not depend on optimal draw from both the player deck and the encounter deck.\n\n\n\nYou will EASILY beat this quest over 50% of the time with the Erebor Hammersmith loop deck. But I don't think we want to count that. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744253","commentId":744253,"userName":"Pharmboys2013","timestamp":1357596716,"content":"attempted the scenario 3 more times today with 3 players…got steamrolled each time.  Blocking wargs into blocking wargs.  We succesfully cleared ithlian road first turn too each time.  rough stuff"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744275","commentId":744275,"userName":"GrandSpleen","timestamp":1357599546,"content":"@Mattr0polis -- no way.  Impossible to set up that 5-card combo in this quest!  And, if it didn't happen in at least 2 separate games, it's an accident of fate! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Seriously though, I really doubt you could achieve the Erebor Hammersmith loop in even 50% of Into Ithilien attempts.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744439","commentId":744439,"userName":"bollywongaloid","timestamp":1357633022,"content":"I haven't posted on here for an age, but I feel like sticking my two oars in on this topic.  I attempted Into Ithlien 6 times in a 2P game and we got beat in every game.  We won on the seventh attempt but I don't think either of us got any satisfaction out of it because this quest simply isn't about tactics or strategy.  We won because we were lucky to avoid all the crap cards.\n\nNow I'm not one of these who believe this is a game of pure luck.  But thinking back to some of the difficult older scenarios, especially the likes of some in the Khazad-dum pack and following expansions, I remember having a lot of trouble at times but I felt that when I finally beat the scenario, it was because I'd adopted a winning strategy with a well built deck, and thereafter could consistently beat it more often than not.\n\nI didn't get this feeling at all with Into Ithilien, and my partner agreed.  So we were dreading cair andros naturally… but after a few defeats and adjusting our decks and strategy… we won and can now consistently win and that nice fuzzy feeling of satisfaction is back because I know that it was us that beat the scenario and not Lady Luck.\n\nInto Ithilien is simply an ill-designed scenario, and it baffles me how lots of players (mostly the old-timers, 'experienced' players, funnily enough) refuse to accept this.  Is it denial? I dont know, but I do know  FFG can't always get it right which is to be expected.  They've done some brilliant scenarios and some duff ones, and this is the latter.  But if anybody claims to be able to beat this scenario more than 50% of the time in a 2P game, please post me your decks and let me know what I'm doing wrong sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=744475","commentId":744475,"userName":"Mattr0polis","timestamp":1357637192,"content":"GrandSpleen said:\n\n \n\n@Mattr0polis -- no way.  Impossible to set up that 5-card combo in this quest!  And, if it didn't happen in at least 2 separate games, it's an accident of fate! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Seriously though, I really doubt you could achieve the Erebor Hammersmith loop in even 50% of Into Ithilien attempts.  \n\n \n\n \n\nHeh, you underestimate those decks. I urge you to try them. We've still yet to have a game where I got the combo out later than turn 3. And Blocking Wargs barely hurts me because usually only Thalin I'll send questing here. There's some brutal enemies that will kill some of my friend's heroes but as long as, in that timeframe, they don't lose all 3 heroes and get fully knocked out of the game we can come all the way back.\n\nThat deck is stupid."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745426","commentId":745426,"userName":"Hauptmann","timestamp":1357762628,"content":"I'm with you on this one, Stenun. The new lead designer has me questioning whether or not I want to continue with LotR. I play multiplayer in a three or four-man group and the quality of the scenarios has taken a noticible turn ever since the designer switch. It's not the difficulty that bothers me. Everybody likes a challenge to break the tedium. The new designs greatly favor one, maybe two players. The mechanics used are simply not fun. Stamping Surge and Doom on more cards certainly adds difficulty but nothing dynamic or interesting. Archery is new but all it does is unavoidable damage. Battle and Siege are interesting changes that we were excited about until we played the last scenario of EoN in which you have enemy cards that can one-shot the best defenders currently available and make questing during a Seige laughably difficult, especially if you have a seven encounter card (even after a cancel) Surge cascade in a three player game.\n\n \n\nI'm all for difficulty. However, I'm much more for balance and playtesting. I remember remarking to one of the FFG employees at Gencon that the Laketown scenario we were playing was flawed because the Tactics sphere had absolutely no use at all. The employee didn't seem phased and I don't blame him, there are plenty of trolls out there that don't offer much in the way of constructive criticism but I was disappointed that something as major as that slipped right by and into a printed scenario. Going to stick with the game for now but I really don't want to hear, \"So, is anybody having fun with this?\" asked at the table again. It was very disheartening."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745483","commentId":745483,"userName":"Ellareth","timestamp":1357774022,"content":"Hauptmann said:\n\nI'm all for difficulty. However, I'm much more for balance and playtesting. I remember remarking to one of the FFG employees at Gencon that the Laketown scenario we were playing was flawed because the Tactics sphere had absolutely no use at all. The employee didn't seem phased and I don't blame him, there are plenty of trolls out there that don't offer much in the way of constructive criticism but I was disappointed that something as major as that slipped right by and into a printed scenario. Going to stick with the game for now but I really don't want to hear, \"So, is anybody having fun with this?\" asked at the table again. It was very disheartening.\n\n\n\nI know this is off-topic but I couldn't help but comment on this.\n\nI never actually noticed this problem because I treated Tactics like it didin't exist until Heirs of Numenor expansion.\nBut how ironic is it that the sphere that represent Battle-Strength is absolutely useless in slaying the last firebreathing dragon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745510","commentId":745510,"userName":"starhawk77","timestamp":1357778825,"content":"Ellareth said:\n\nHauptmann said:\n\n \n\nI'm all for difficulty. However, I'm much more for balance and playtesting. I remember remarking to one of the FFG employees at Gencon that the Laketown scenario we were playing was flawed because the Tactics sphere had absolutely no use at all. The employee didn't seem phased and I don't blame him, there are plenty of trolls out there that don't offer much in the way of constructive criticism but I was disappointed that something as major as that slipped right by and into a printed scenario. Going to stick with the game for now but I really don't want to hear, \"So, is anybody having fun with this?\" asked at the table again. It was very disheartening.\n\n \n\n \n\nI know this is off-topic but I couldn't help but comment on this.\n\nI never actually noticed this problem because I treated Tactics like it didin't exist until Heirs of Numenor expansion.\nBut how ironic is it that the sphere that represent Battle-Strength is absolutely useless in slaying the last firebreathing dragon.\n\n\n\nIt's not. You need boatloads of attack to take down Smaug. Tactics is very good at that.\n\nI don't understand the assertion that Tactics is useless in Battle for Lake-town. That's simply untrue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745540","commentId":745540,"userName":"Hauptmann","timestamp":1357784685,"content":"\"It's not. You need boatloads of attack to take down Smaug. Tactics is very good at that.\n\nI don't understand the assertion that Tactics is useless in Battle for Lake-town. That's simply untrue.\"\n\n \n\nI'll settle on saying that if you use Tactics for Laketown, you are shooting yourself in the foot. With a very large calibre bullet. Every version of Smaug is immune to player card effects. That eliminates the all-powerful Feint and any and all direct damage effects from attachments and events. Smaug has a maximum ammount of damage he can take per quest phase, 6,12, and dead, respectively. There's no point in piling up Tactics allies as you're going to be racing to get to the last phase of the quest to kill him and the average 0-1 they're kicking in just doesn't cut it. Utilize solid questing characters and healers to manage burn damage and use attachments from other spheres, primarily leadership, to overcome Smaug's large numbers. Honestly, Tactics would add very little outside of waiting until phase three to have the chance to do its job properly. Even The Old Thrush works off of a discard mechanic, so you'll want card draw which Tactics has little outside of Foe-Hammer and that requires you to kill an enemy, who in this scenario is simply Smaug.\n\n \n\nNow, I'll admit, the first time we ran through the scenario, I was playing Tactics/Leadership and had the delightful experience of realizing that the majority of my deck may as well have been blank. Switching back to Spirit/Lore at least gave me the satisfaction of pulling my weight and helping move the scenario forward. Please keep in mind, I'm speaking from a multiplayer perspective. Perhaps Tactics is the way to go for solo play.\n\n \n\nIf you find a Tactics strategy that works for you, go for it. I'm not saying its impossible. It may even be an interesting challenge to try it out some time. It just doesn't remove the fact that \"Immune to player card effects,\" greatly limits what cards out of your collection you can effectively use and that's exactly the kind of game design that I feel greatly reduces a lot of the strategic creativity for players. Once options begin drying up and it is required to purchase more cards to fit the most effective cookie-cutter build in order to defeat a quest that was designed with increased static difficulty at the cost of unique/interesting/fun mechanics, I'm going to have to either take up designing scenarios as a hobby or move on to a different game.\n\n \n\nNow a little off-topic: Anybody know the designer for Foundations of Stone? That's still my favorite and I want to give the guy a big, uncomfortable man-hug if I happen to run into him at a convention."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745726","commentId":745726,"userName":"Mattr0polis","timestamp":1357821456,"content":"starhawk77 said:\n\nI don't understand the assertion that Tactics is useless in Battle for Lake-town. That's simply untrue.\n\n\n\nThis.\n\nYou know that stuff that adds to your own characters don't fall under the 'immune to player cards' thing, right? So you can still boost up your character's own attack/defense values for example.\n\nIf you are smart on this quest, you won't want to do much (or any) damage to Smaug most likely until the end stage, since there's stuff that will move damage from Smaug to Lake-town. So once you hit that last stage, you're going to need to do some major hits to take him down in a turn or two. This is EASIEST with Tactics because of their attack boosting & good ranged Heroes and allies like Vassals to join an attack from someone else. Not to mention all of the blocking you also need to do throughout the scenario because of some of the different Smaugs and treacheries. Beregond with Citadel Plate and certain other things like Winged Guardians are a godsend here in multiplayer.\n\nThere's certainly other ways to try and defeat the scenario but Tactics is FAR from useless or \"shooting yourself in the foot\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745776","commentId":745776,"userName":"Ellareth","timestamp":1357825042,"content":"Oh dear, here I go using the wrong word to poorly say what I meant to say.\n\n\"Useless\" isn't the word I should've said, because as many mentioned you could boost your character's attack and defence.\n\nHowever, boosting your attack is only useful in the final stage of the quest, and boosting your defence is only useful against one trechery card that makes you unable to declare allies as defender.\n\nYou need lore through out the quest because of deal 2 damage to all character trechery and card draw, spirit due to all those locations and nasty trecheries and shadows, and leadership has great selection of event and allies for chumpblocking (sneak attack + 6 x 1 cost allies), some resource boost and some shadow cancel.\n\nWhile Tactics isn't completely \"useless\" (I'm sorry for my poor choice of word), it certainly isn't as useful as what some of the other sphere offers. Especially with cards like \"For Gondor\" that let's you do one big attack without having tactics sphere invovled (which is Tactics sphere's major, if not only, contribution to this specific quest)\n\nDon't get me wrong, making Smaug immune to player card effect was a good choice, or else we would have another Shadow and Flame where we would just Feint -> Hama -> Feint -> Hama loop it for easy win, and Battle for Laketown is an entertaining challenging quest that I have no problem with. Just thought it was funny how unessential tactics was with dragonslaying.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745777","commentId":745777,"userName":"Hauptmann","timestamp":1357825108,"content":"Well-aware of that fact. Why I used the term \"direct damage\" as in Dwarrowdelf Axes, Spears of the Citadel, Gondorian Spearmen, etc. Nine to twelve marks on a ranged attacker goes a long way and is cheap and effective on top of allowing you to load up a sentinel hero with enough warnings to not run the risk of any damage piling up. I'm more focused on the fact that Tactics would only be effective on the last stage of the quest as Smaug the Magnificent takes three damage from Smaug and puts it on Laketown every time it is revealed and there is a lack of any other enemy cards to attack. Dain and Hardy Leadership make all of your allies more effective at questing, attacking, and surviving the mass burn damage cards in the event deck. Unless you house-rule out Dunedain attachments and dwarves, Tactics is still the weakest of the spheres for the scenario by a long shot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=745788","commentId":745788,"userName":"Hauptmann","timestamp":1357826128,"content":"Don't blame yourself for the \"useless\" fiasco, Ellareth. That is entirely my fault. You bring up an excellent point about Hama and Feint which makes complete sense. It's just a shame that an entire sphere was marginalized by the scenario sticking so closely to the lore. Though it's fun to play out events that occur in the stories of Middle Earth, I believe the designers have more wiggle room to create more balanced and inclusive quests when they pen their own narratives."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=746107","commentId":746107,"userName":"Glaurung","timestamp":1357880939,"content":"Actually my dwarfs Dain/Thorin/Ori deck beat this quest withour any trouble. Also Pelargir. The bigest problem is last quest in the box. But i laos won coulple of times already. So even with old type decks is possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=746163","commentId":746163,"userName":"GrandSpleen","timestamp":1357892649,"content":"Glaurung said:\n\nActually my dwarfs Dain/Thorin/Ori deck beat this quest withour any trouble. Also Pelargir. The bigest problem is last quest in the box. But i laos won coulple of times already. So even with old type decks is possible.\n\n\n\nYou've changed your tune!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=746203","commentId":746203,"userName":"Glaurung","timestamp":1357897897,"content":"GrandSpleen said:\n\nGlaurung said:\n\n \n\nActually my dwarfs Dain/Thorin/Ori deck beat this quest withour any trouble. Also Pelargir. The bigest problem is last quest in the box. But i laos won coulple of times already. So even with old type decks is possible.\n\n \n\n \n\nYou've changed your tune!\n\n\n\nGrandSpleen said:\n\nGlaurung said:\n\n \n\nActually my dwarfs Dain/Thorin/Ori deck beat this quest withour any trouble. Also Pelargir. The bigest problem is last quest in the box. But i laos won coulple of times already. So even with old type decks is possible.\n\n \n\n \n\nYou've changed your tune!\n\n\n\nI understand the idea of the new quest and change my strategy without change or tune my decks. So for solo now i can win almost every time when i play agianst Pelargir and Into Ithilien. But last one no! Very difficult!!!\n\nDwarves rules! Only one problem for them is siege. Dwarves in my deck didn have high defense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=746219","commentId":746219,"userName":"GrandSpleen","timestamp":1357901559,"content":"Glaurung said:\n\n \n\nI understand the idea of the new quest and change my strategy without change or tune my decks. So for solo now i can win almost every time when i play agianst Pelargir and Into Ithilien. But last one no! Very difficult!!!\n\nDwarves rules! Only one problem for them is siege. Dwarves in my deck didn have high defense.\n\n \n\n\n \n\n \n\nI mean you changed what you are saying about Into Ithilien.  Earlier in this thread you were saying it was crazy difficult and that you were losing repeatedly (and loving it!).  Now you're saying that you are winning consistently without any trouble.  I wasn't able to come up with a strategy or a deck that could take this quest on without depending heavily on luck with the encounter deck.  Would you mind sharing your strategy?  I'd love to learn how to approach this thing, as it's still incredibly difficult for me to win!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=746555","commentId":746555,"userName":"Glaurung","timestamp":1357954399,"content":"GrandSpleen said:\n\nGlaurung said:\n\n \n\nI understand the idea of the new quest and change my strategy without change or tune my decks. So for solo now i can win almost every time when i play agianst Pelargir and Into Ithilien. But last one no! Very difficult!!!\n\nDwarves rules! Only one problem for them is siege. Dwarves in my deck didn have high defense.\n\n \n\n\n \n\n \n\nI mean you changed what you are saying about Into Ithilien.  Earlier in this thread you were saying it was crazy difficult and that you were losing repeatedly (and loving it!).  Now you're saying that you are winning consistently without any trouble.  I wasn't able to come up with a strategy or a deck that could take this quest on without depending heavily on luck with the encounter deck.  Would you mind sharing your strategy?  I'd love to learn how to approach this thing, as it's still incredibly difficult for me to win!\n\n\n\nOk i got your point. But im not really good typer on the forum. But i will be happy to chat to you by the skype if you dont mind.\n\nSo send me personal message if you have a skype."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=751457","commentId":751457,"userName":"Ted Sandyman","timestamp":1358836646,"content":"Im presently stuck  in Ithilien. One month playing it - WINS = 0, LOSSES = 16. Anyone beat that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=751658","commentId":751658,"userName":"GrandSpleen","timestamp":1358861831,"content":"Ouch, I feel ya.  It took us 13 times to get our first win after about 2 weeks of playing.  That was about 2 weeks ago; I haven't even tried the Siege of Cair Andros yet because I expect it to be hard as well, and we need to build our confidence back up before going on… :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=751726","commentId":751726,"userName":"Alex6222","timestamp":1358873689,"content":"GrandSpleen said:\n\nOuch, I feel ya.  It took us 13 times to get our first win after about 2 weeks of playing.  That was about 2 weeks ago; I haven't even tried the Siege of Cair Andros yet because I expect it to be hard as well, and we need to build our confidence back up before going on… :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nDont get discouraged by Into Ithilien. The Siege of Cair Andros is far more doable than Into Ithilien. This is a very well designed quest and it actually feels that you can beat it. You can have a lot of fun with it without feeling the frustration that you could feel with Into Ithilien."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=752604","commentId":752604,"userName":"Glaurung","timestamp":1359001363,"content":"Ok i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=752769","commentId":752769,"userName":"monkeyrama","timestamp":1359024412,"content":"Thanks for the video. Have to say, having not built your deck to try it out, seeing it in action was impressive. Very effective use of dwarven synergy!\n\nA wee note on the actual video. I liked that you play at a good speed, without explaining every action, but because of the camera angle the staging area is quite hard to make out. No need to fix the actual angle or anything, but if you mention what is coming out of the encounter deck as you reveal it, the whole process would be very easy to follow. As it is, I was at times working out what card had come out from what you put down in terms of progress etc, because the cards are really hard to make out. Otherwise, was good!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=752784","commentId":752784,"userName":"Glaurung","timestamp":1359025891,"content":"monkeyrama said:\n\nThanks for the video. Have to say, having not built your deck to try it out, seeing it in action was impressive. Very effective use of dwarven synergy!\n\nA wee note on the actual video. I liked that you play at a good speed, without explaining every action, but because of the camera angle the staging area is quite hard to make out. No need to fix the actual angle or anything, but if you mention what is coming out of the encounter deck as you reveal it, the whole process would be very easy to follow. As it is, I was at times working out what card had come out from what you put down in terms of progress etc, because the cards are really hard to make out. Otherwise, was good!\n\n\n\nyes you right! this is my first video and next ones i will try make  better!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=752854","commentId":752854,"userName":"Ellareth","timestamp":1359033186,"content":"Glaurung said:\n\n \n\nOk i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n\n\n \n\n \n\n \n\nJust say your video.\n\nIt was very interesting to see that your play style is totally different from mine, yet it has same result; I usually finish Quest 1 in about 3~4 turns, Quest 2 in 1~2 turns, and Quest 3 in 1~2 turns, which was very similar to how you did on your video.\n\nI am very interested in trying out your way of playing (more playstyles I can do, better I'll be able to do against any quest) and have few questions regarding rules/strategy.\n\nOne minor rule question I have for you is when you played Very Good Tale for the first time, you first discard 5 cards and then bring back 2 allies from discard pile, so wouldn't you have been able to bring back a copy of Legacy of Durin from the Hammersmith you've gotten by Very Good Tale since Legacy of Durin was already in discard pile? (I know this doesn't change anything since you had another Hammersmith in your hand to bring back Legacy of Durin, but I just wanted to know if getting Legacy of Durin with Hammersmith you got form Very Good Tale was possible)\n\nAnd I would like to understand your strategy further.\n\nYou were able to explore Ithilien Road on your first turn thanks to Ranger and a Sneaked Attack Gandalf. Is exploring Ithilien Road on turn 1 something you are able to do normally or was this an exceptional case of having Sneak Attack and Gandalf in your hand?\nI see that you can generate 6 attack strength just by your heroes, but you need 7 Quest Power + 1 card (which I find to be around 3 threat) to clear the Road. And if you fail to clear the Road on first turn despite committing most of characters, I find chance of getting bad shadow that could kill your hero to be bit too high (2 x attack twice shadow, 3 x three attack strength shadow).\nWhat is your usual opening move? Explore Road or not explore Road?\n\nAbout halfway through your video, you assigned an Archery damage to 2 HP ally and then blocked Southron Company with him. Was this an oversight or was it as chance you took? It looked quite dangerous to me as there were 4  Blocking Wargs still in encounter deck and if you've gotten one as the shadow, 5 attack undefended would've killed one of your heroes.\n\nAnd I find it almost impossible to win against this scenario if you get Mumakil early in the game (infact I lose everytime Mumakil enters play on turn 1). What is your plan in case of turn 1 Mumakil?…….. because I have none and would like to learn one if there is.\n\nIt was good video, I liked it was quick paced, and was nice to see an ally heavy deck in action. You should totally make some more of it.\n\n \n\nEdit: As a newb to the cardgames in general (LotRLCG being my first one), I envy your shuffling skill. I wish my card shuffles were half as good or fast as yours were."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=752865","commentId":752865,"userName":"Glaurung","timestamp":1359034129,"content":"Ellareth said:\n\nGlaurung said:\n\n \n\nOk i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n\n\n \n\n \n\n \n\nJust say your video.\n\nIt was very interesting to see that your play style is totally different from mine, yet it has same result; I usually finish Quest 1 in about 3~4 turns, Quest 2 in 1~2 turns, and Quest 3 in 1~2 turns, which was very similar to how you did on your video.\n\nI am very interested in trying out your way of playing (more playstyles I can do, better I'll be able to do against any quest) and have few questions regarding rules/strategy.\n\nOne minor rule question I have for you is when you played Very Good Tale for the first time, you first discard 5 cards and then bring back 2 allies from discard pile, so wouldn't you have been able to bring back a copy of Legacy of Durin from the Hammersmith you've gotten by Very Good Tale since Legacy of Durin was already in discard pile? (I know this doesn't change anything since you had another Hammersmith in your hand to bring back Legacy of Durin, but I just wanted to know if getting Legacy of Durin with Hammersmith you got form Very Good Tale was possible)\n\nAnd I would like to understand your strategy further.\n\nYou were able to explore Ithilien Road on your first turn thanks to Ranger and a Sneaked Attack Gandalf. Is exploring Ithilien Road on turn 1 something you are able to do normally or was this an exceptional case of having Sneak Attack and Gandalf in your hand?\nI see that you can generate 6 attack strength just by your heroes, but you need 7 Quest Power + 1 card (which I find to be around 3 threat) to clear the Road. And if you fail to clear the Road on first turn despite committing most of characters, I find chance of getting bad shadow that could kill your hero to be bit too high (2 x attack twice shadow, 3 x three attack strength shadow).\nWhat is your usual opening move? Explore Road or not explore Road?\n\nAbout halfway through your video, you assigned an Archery damage to 2 HP ally and then blocked Southron Company with him. Was this an oversight or was it as chance you took? It looked quite dangerous to me as there were 4  Blocking Wargs still in encounter deck and if you've gotten one as the shadow, 5 attack undefended would've killed one of your heroes.\n\nAnd I find it almost impossible to win against this scenario if you get Mumakil early in the game (infact I lose everytime Mumakil enters play on turn 1). What is your plan in case of turn 1 Mumakil?…….. because I have none and would like to learn one if there is.\n\nIt was good video, I liked it was quick paced, and was nice to see an ally heavy deck in action. You should totally make some more of it.\n\n \n\nEdit: As a newb to the cardgames in general (LotRLCG being my first one), I envy your shuffling skill. I wish my card shuffles were half as good or fast as yours were.\n\n\n\nWhen i play first time A very good tale i put into play Erebor hammersmiht but i cannot use his ability to get back top attachment from discard pile cose to trigger his response i must play him from hand. A very goof tale put allies into play not play them.\n\n \n\nAbout Road. yes sure you must to explore the location in the first round otherwise is 90% lost.\n\nMumak in the begin? 90% you lost a game.\n\n \n\nI play card games for long time so i learn a bit how to shuffle card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753083","commentId":753083,"userName":"GrandSpleen","timestamp":1359062822,"content":"Thanks for the video, Glaurung.  Actually, we play a very similar strategy on this quest-- Ithilien Road MUST go on turn one or you're pretty much screwed.  \n\nWe Are Not Idle + Lure of Moria is a super strong combination (I don't own Shadow and Flame yet so I haven't been able to take advantage of it).  Even stronger in multiplayer-- if you're the guy with the Steward of Gondor, you can drop a boatload of cash on your neighbor with We Are Not Idle and then everybody's happy.\n\nI still wouldn't call this quest easy even after watching your deck in action. The encounter deck was very kind to you!  No Mumak, you got an Ithilien Guardian out on turn 1… we did see Blocking Wargs, albeit only one time.  Watcher in the Wood is way deadlier in multiplayer games, when there are twice as many questing characters.  \n\nMaybe we just use the word \"easy\" in different ways!  After all, you wrote:\n\nGlaurung said:\n\nAbout Road. yes sure you must to explore the location in the first round otherwise is 90% lost.\n\nMumak in the begin? 90% you lost a game.\n\n\n\nMake sure you are counting those turn-1 forfeit / game restarts when you calculate your win%!  That is how I ended up with my current 1-12 win-loss rate.  If I ignore the crappy starts I have about a 1 in 3 chance of winning, but that's a meaningless number.  We play 2-player only, and that doubles your chance of a \"game losing scenario\" on turn 1.  \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753153","commentId":753153,"userName":"Glaurung","timestamp":1359071573,"content":"GrandSpleen said:\n\nThanks for the video, Glaurung.  Actually, we play a very similar strategy on this quest-- Ithilien Road MUST go on turn one or you're pretty much screwed.  \n\nWe Are Not Idle + Lure of Moria is a super strong combination (I don't own Shadow and Flame yet so I haven't been able to take advantage of it).  Even stronger in multiplayer-- if you're the guy with the Steward of Gondor, you can drop a boatload of cash on your neighbor with We Are Not Idle and then everybody's happy.\n\nI still wouldn't call this quest easy even after watching your deck in action. The encounter deck was very kind to you!  No Mumak, you got an Ithilien Guardian out on turn 1… we did see Blocking Wargs, albeit only one time.  Watcher in the Wood is way deadlier in multiplayer games, when there are twice as many questing characters.  \n\nMaybe we just use the word \"easy\" in different ways!  After all, you wrote:\n\nGlaurung said:\n\n \n\nAbout Road. yes sure you must to explore the location in the first round otherwise is 90% lost.\n\nMumak in the begin? 90% you lost a game.\n\n \n\n \n\nMake sure you are counting those turn-1 forfeit / game restarts when you calculate your win%!  That is how I ended up with my current 1-12 win-loss rate.  If I ignore the crappy starts I have about a 1 in 3 chance of winning, but that's a meaningless number.  We play 2-player only, and that doubles your chance of a \"game losing scenario\" on turn 1.  \n\n \n\n \n\n \n\n\n\nyes you right is not as easy as i say. Actually is quite difficult. But if i can win 4 times from 5 doesn matter how difficult it is but the numbers of win is easy. If you understand my points? About Mumak and other encounter cards. You must play fast and then encounter deck will dont have enouhg time to revealed more cards so you get less chance to get something bad. Dont waste time and play as quick as possible and most of the time you will run trought withoyt big problem. this strategy works fine for most of the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753397","commentId":753397,"userName":"Ted Sandyman","timestamp":1359111600,"content":"Good video glaurung. Enjoyed the pace of your play and your english is excellent seeming as its not your first language. Good use of the combination of We Are Not Idle then the untapping card. Great resource generator. Can you call out the encounter card in future vids as i couldnt quite make out the staging area. Well done though, i enjoyed it. Keep them coming."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753851","commentId":753851,"userName":"leptokurt","timestamp":1359189320,"content":"Glaurung said:\n\nOk i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n\n\n\n\n \n\nLol, somehow I excactly pictured you playing like this. Please try not to destroy that table!\n\n \n\nGood video!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753860","commentId":753860,"userName":"Glaurung","timestamp":1359192164,"content":"leptokurt said:\n\nGlaurung said:\n\n \n\nOk i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n\n\n \n\n \n\n \n\nLol, somehow I excactly pictured you playing like this. Please try not to destroy that table!\n\n \n\nGood video!\n\n\n\nHa ha ha! Table suffer a bit. Leptokurt where you been? You should give a try for HON. Amazing box!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753870","commentId":753870,"userName":"leptokurt","timestamp":1359194052,"content":"Glaurung said:\n\nleptokurt said:\n\n \n\nGlaurung said:\n\n \n\nOk i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n\n\n \n\n \n\n \n\nLol, somehow I excactly pictured you playing like this. Please try not to destroy that table!\n\n \n\nGood video!\n\n \n\n \n\nHa ha ha! Table suffer a bit. Leptokurt where you been? You should give a try for HON. Amazing box!\n\n\n\n \n\nI got HoN on Wednesday. It's not even on amazon.de yet, had to wait until now to get it from another distributor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753890","commentId":753890,"userName":"Glaurung","timestamp":1359197542,"content":"leptokurt said:\n\nGlaurung said:\n\n \n\nleptokurt said:\n\n \n\nGlaurung said:\n\n \n\nOk i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n\n\n \n\n \n\n \n\nLol, somehow I excactly pictured you playing like this. Please try not to destroy that table!\n\n \n\nGood video!\n\n \n\n \n\nHa ha ha! Table suffer a bit. Leptokurt where you been? You should give a try for HON. Amazing box!\n\n \n\n \n\n \n\nI got HoN on Wednesday. It's not even on amazon.de yet, had to wait until now to get it from another distributor.\n\n\n\nOK  i see. You will like it for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=753928","commentId":753928,"userName":"Glaurung","timestamp":1359204022,"content":"Ted Sandyman said:\n\nGood video glaurung. Enjoyed the pace of your play and your english is excellent seeming as its not your first language. Good use of the combination of We Are Not Idle then the untapping card. Great resource generator. Can you call out the encounter card in future vids as i couldnt quite make out the staging area. Well done though, i enjoyed it. Keep them coming.\n\n\n\nHere si another one. Same deck, another quests. this one is really fast one.\n\n \n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754140","commentId":754140,"userName":"Angus Lee","timestamp":1359236842,"content":"Glaurung said:\n\nHere si another one. Same deck, another quests. this one is really fast one.\n\n \n\n\n\n\n\n\n\nOn the last turn (that is the turn after a lot of your allies are destroyed by engaging the enemy), it seems that you only control four drawfs so you should only draw one card instead of two cards in the resource phase.  Don't know if it has any impact on the final turn and don't know if I have got it wrongly since I have just watched the video once.\n\nAnyway, these play session videos are great and please keep them coming.  I've really learned something on how to play better from your videos."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754155","commentId":754155,"userName":"Glaurung","timestamp":1359239195,"content":"Ups my bad. Very big mistake!!! I should be more carefull! All game i play fast and right and this big mistake in the end…… i hate my self for this!!!\n\nactually is change nothing i still can play Gandalf and win but fact is fact. Rrrrrrrrr!!!\n\nthanks Angus to show me that.\n\nActually those video reminds me a tournaments, you must really concentrate on your game.\n\nYes i will keep do it more cose i really have fun with that!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754169","commentId":754169,"userName":"Dain Ironfoot","timestamp":1359240873,"content":"Glaurung said:\n\nUps my bad. Very big mistake!!! I should be more carefull! All game i play fast and right and this big mistake in the end…… i hate my self for this!!! actually is change nothing i still can play Gandalf and win but fact is fact. Rrrrrrrrr!!! thanks Angus to show me that. Actually those video reminds me a tournaments, you must really concentrate on your game. Yes i will keep do it more cose i really have fun with that!\n\n \n\ndare i say: you don't even know how to play the game!, do you even read the cards?, and you've made a fundamental error!!! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ;) ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754179","commentId":754179,"userName":"Bullroarer Took","timestamp":1359242854,"content":"Glaurung said:\n\nUps my bad. Very big mistake!!! I should be more carefull! All game i play fast and right and this big mistake in the end…… i hate my self for this!!! actually is change nothing i still can play Gandalf and win but fact is fact. Rrrrrrrrr!!! thanks Angus to show me that. Actually those video reminds me a tournaments, you must really concentrate on your game. Yes i will keep do it more cose i really have fun with that!\n\nIs that an apology? To the thousands of other players you've insulted for having had the courage for making a session report for this complex game before you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754189","commentId":754189,"userName":"Glaurung","timestamp":1359245686,"content":"Sure you can say what you want. Im not so easy insulted. At least now im in position when you can start to critics me too right? So is more fair.\n\nBut that was not fundemental error. Actually is change nothing in the game. But fact is fact. I made i mustake! I try to play really fast bliz and i won in the end. In the ebd if the day this mistake is change nothing(i mean is not affected the result of the game). This is most important for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754205","commentId":754205,"userName":"Dain Ironfoot","timestamp":1359250288,"content":"Glaurung said:\n\nSure you can say what you want. Im not so easy insulted. At least now im in position when you can start to critics me too right? So is more fair. But that was not fundemental error. Actually is change nothing in the game. But fact is fact. I made i mustake! I try to play really fast bliz and i won in the end. In the ebd if the day this mistake is change nothing(i mean is not affected the result of the game). This is most important for me.\n\ni was just teasing you! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754208","commentId":754208,"userName":"Glaurung","timestamp":1359252448,"content":"Dain Ironfoot said:\n\nGlaurung said:\n\nSure you can say what you want. Im not so easy insulted. At least now im in position when you can start to critics me too right? So is more fair. But that was not fundemental error. Actually is change nothing in the game. But fact is fact. I made i mustake! I try to play really fast bliz and i won in the end. In the ebd if the day this mistake is change nothing(i mean is not affected the result of the game). This is most important for me.\n\n \n\ni was just teasing you! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n\n\nThis sound much better! I hope we can forget all previous problems and be ok to each other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754252","commentId":754252,"userName":"Ted Sandyman","timestamp":1359265679,"content":"Ladies and gentlemen…………… Introducing the new Glaurung!!reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754266","commentId":754266,"userName":"leptokurt","timestamp":1359271306,"content":"Did you forget to pay a resource when traveling to the Market Place?\n\n \n\nImpressing deck, I already guessed that the Dwarfs would fare rather good against PiP.  I think you should open a new thread to post your videos, as this thread is about Into Ithilien being a broken scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754294","commentId":754294,"userName":"Glaurung","timestamp":1359277594,"content":"leptokurt said:\n\nDid you forget to pay a resource when traveling to the Market Place?\n\n \n\nImpressing deck, I already guessed that the Dwarfs would fare rather good against PiP.  I think you should open a new thread to post your videos, as this thread is about Into Ithilien being a broken scenario.\n\n\n\nHmmm Market. RRRRR small think very small but still………..\n\nyes i should make my own thread about my video."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754304","commentId":754304,"userName":"leptokurt","timestamp":1359279684,"content":"Ted Sandyman said:\n\n \n\nIm presently stuck  in Ithilien. One month playing it - WINS = 0, LOSSES = 16. Anyone beat that?\n\n \n\n \n\nWINS = 1, LOSSES = 0\n\n \n\nBest I stop playing it now to keep that record forever.\n\n \n\n \n\n \n\nEdit:\n\n \n\nok, reading the first post I figured out why I had an easy time. They translated \"engagement cost\" with \"attacking strength\" in German. I probably still would have won (Beregond was ready to defend).\n\nI start to wonder if the German translator speaks English at all, if he doesn't know how to translate the very keywords in this game. Dumb as ****!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754307","commentId":754307,"userName":"Ted Sandyman","timestamp":1359280077,"content":"Play it 10 times and let me know how you got on. Surprisingly ive played it twice since watching glaurungs video and actually won one!!! I started \"slapping\" the cards hard on the table which has obviously improved my play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754313","commentId":754313,"userName":"OnkelZorni","timestamp":1359281489,"content":"leptokurt said:\n\nI start to wonder if the German translator speaks English at all, if he doesn't know how to translate the very keywords in this game. Dumb as ****!\n\n\n\n \n\nHoN was the last job for the old translation team. If I understood correctly what Heidelberger said, then everything from now on will be done by a new team. Not sure about Laketown, Against the shadow and Hobbit 2, but everything that will come in the future will be done by others…I only hope that we will see less dramatic translation errors than in the past"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754326","commentId":754326,"userName":"leptokurt","timestamp":1359283576,"content":"OnkelZorni said:\n\nleptokurt said:\n\n \n\nI start to wonder if the German translator speaks English at all, if he doesn't know how to translate the very keywords in this game. Dumb as ****!\n\n \n\n \n\n \n\nHoN was the last job for the old translation team. If I understood correctly what Heidelberger said, then everything from now on will be done by a new team. Not sure about Laketown, Against the shadow and Hobbit 2, but everything that will come in the future will be done by others…I only hope that we will see less dramatic translation errors than in the past\n\n\n\n \n\nI'm happy to hear that. Means I don't have to write a PM to FFG again.\n\n \n\n \n\nBtw, I played two more games. One was ended quickly after round 1 by Blocking Wargs (which killed to allies and Celador) and a nasty shadow effect that killed Beregond, leaving only Boromir and Thalin alive.\n\n \n\nI won the other game quite easily.  Lots of Locations, two Bats (killed at once by Thalin) and three Gandalf's to lower my threat plus Faramir to help me to get through stage 3B quickly. I think the scenario is ok, but the surge effect of Blocking Wargs is indeed way over the top. That card is mean enough on its own, so why making it even harder?\n\nAnd yep, the difficulty rating here is a joke."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754718","commentId":754718,"userName":"OnkelZorni","timestamp":1359356496,"content":"Good News for all german players, the Against the shadow circle, Hobbit 2, laketown and the nightmare decks are translated by the new team. so we can hope to never see all those minor and major errors again"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=754923","commentId":754923,"userName":"leptokurt","timestamp":1359379874,"content":"Ted Sandyman said:\n\nPlay it 10 times and let me know how you got on. Surprisingly ive played it twice since watching glaurungs video and actually won one!!! I started \"slapping\" the cards hard on the table which has obviously improved my play.\n\n\n\nI played 11 games so far and won 7 of them. The last three games I won in a row, without any of these Ithilien dudes and with lots of Blocking Wargs. I think this quest requires a specific designed deck and careful planning when you're playing. Dwarfs are one option, I play a Gondor/Eagle deck with Thalin/Beregond/NewBoromir. Perhaps it's also possible to build a deck around Thalin/Dunhere/NewGlorfindel. Or a deck around OldBoromir.\n\nAfter playing almost a dozen games I think this quest is ok for solo players. I even increased my win/loss ratio compared to PiP. This adventure is not broken, but it's also not a level 4 adventure. I'd say 6 or 7. I can see though why it becomes harder when you're playing multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75319-into-ithilien-the-first-broken-scenario/?do=findComment&comment=755113","commentId":755113,"userName":"Glaurung","timestamp":1359405842,"content":"leptokurt said:\n\nTed Sandyman said:\n\n \n\nPlay it 10 times and let me know how you got on. Surprisingly ive played it twice since watching glaurungs video and actually won one!!! I started \"slapping\" the cards hard on the table which has obviously improved my play.\n\n \n\n \n\nI played 11 games so far and won 7 of them. The last three games I won in a row, without any of these Ithilien dudes and with lots of Blocking Wargs. I think this quest requires a specific designed deck and careful planning when you're playing. Dwarfs are one option, I play a Gondor/Eagle deck with Thalin/Beregond/NewBoromir. Perhaps it's also possible to build a deck around Thalin/Dunhere/NewGlorfindel. Or a deck around OldBoromir.\n\nAfter playing almost a dozen games I think this quest is ok for solo players. I even increased my win/loss ratio compared to PiP. This adventure is not broken, but it's also not a level 4 adventure. I'd say 6 or 7. I can see though why it becomes harder when you're playing multiplayer.\n\n\n\nYes the problem with ole quests was: most of them is going to be easy with the number of players. But HON change it. Now you get the even more difficult with the number of players. So we have now much more reason meet and play togehter with my frineds. Cose before we meet and play only Masssing in Osgiliath cose is still provide some challenge, other quests most of the time is no point to play multy player cose to easy…. Thanks HON now os change. All 2 quests provide very good level of challenge and i hope all third cycle will keep it."}]}