{"url":"https://community.fantasyflightgames.com/topic/75400-the-battle-of-laketown/","title":"The Battle of Laketown","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75400-the-battle-of-laketown/?do=findComment&comment=732469","commentId":732469,"userName":"Tracker1","timestamp":1355174057,"content":"Hi,\n\nJust got Laketown today.\n\nSome questions:\n\nWhen you draw one of the smaugs from his deck, does he stay in the staging area, or engaged with a player each round.  Or does he go to the discard pile after the round and then a new smaug is drawn for the next round? I hope not\n\nI see that Smaug is unique but with three different titles, so can you have the terrible, magnificent and the mighty all in play at the same time, since each of those are unique card names?   I hope not.\n\nIf a new smaug is drawn each time, do you keep a damage counter  that keeps track of the damage he's taken, since a new card is cycled each time? I hope so\n\nI assume the burn keyword is damage given to laketown?\n\nAny help would be appreciated, thanks\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75400-the-battle-of-laketown/?do=findComment&comment=732480","commentId":732480,"userName":"Tracker1","timestamp":1355175704,"content":"Tracker1 said:\n\nOr does he go to the discard pile after the round and then a new smaug is drawn for the next round? I hope not\n\n\n\nI meant I hope so, seems unreasonable to have 3 different smug cards in play, with a combined threat of 18!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75400-the-battle-of-laketown/?do=findComment&comment=732487","commentId":732487,"userName":"Glaurung","timestamp":1355176411,"content":"You must to create Smaug deck and Smaug discard pile which is separate from encounter deck and encounter discard pile.\n\nIn the begining of every quest phase the first player take the top cards of the Smaug deck, reveal it and add to the staging area or engaged with him.Every time first players should to decide where Dragon come : enagage with him or come to the staiging area.\n\nSo there is only 1 Smaug in play which is changed every round in the begin of the quest phase.New Samug reveal and old one go to Smaug discard pile.\n\nIf there is some damage tokens on Smaug they transfer to new one. If Smaung deck is emty you shuffle all copy of Smaug from Smaug discard pile to create new Smaug deck."}]}