{"url":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/","title":"Defending Bilbo in &quot;Dungeons Deep and Caverns Dim&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=732572","commentId":732572,"userName":"Thetimebinder","timestamp":1355197802,"content":"\"Cards in the riddle area (including Bilbo Baggins) are \n\nimmune to player card effects and cannot leave the riddle \narea except through specific quest card effects. While \nGollum is in the riddle area, he does not contribute his \nthreat during the quest phase and cannot be engaged by \nthe players. While Bilbo Baggins is in the riddle area, the \nfirst player still controls him; however, he cannot quest, \nattack, take damage from cards other than Gollum, have \nattachments played on him by the players, or defend \n(except against Gollum)\"\n \n \nCan the first player use a character other then Bilbo to defend against Gollum's attacks on Bilbo?  Can a character with Sentinal defend against Gollum's attacks on Bilbo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=732592","commentId":732592,"userName":"richsabre","timestamp":1355204251,"content":"i would say no…..hes pretty much alone down there\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=732916","commentId":732916,"userName":"Thetimebinder","timestamp":1355246236,"content":"If the first player who controls Bilbo cannot defend for him, then Bilbo cannot defend for himself.  Golum is not engaged with Bilbo, nor is Golum engaged with the first player.  How can Bilbo declare himself as a defender against Golum?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=732944","commentId":732944,"userName":"richsabre","timestamp":1355248375,"content":"Thetimebinder said:\n\nIf the first player who controls Bilbo cannot defend for him, then Bilbo cannot defend for himself.  Golum is not engaged with Bilbo, nor is Golum engaged with the first player.  How can Bilbo declare himself as a defender against Golum?\n\n\n\nbilbo can defend for himself by the first player, though no other actions can happen. its the way the quest is designed to make sure that 3 wrong riddles will end the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=732984","commentId":732984,"userName":"Thetimebinder","timestamp":1355254703,"content":"richsabre said:\n\n \n\nbilbo can defend for himself by the first player, though no other actions can happen. its the way the quest is designed to make sure that 3 wrong riddles will end the game\n\n \n\n \n\nWell, actions CAN happen.  It is a combat phase and players get actions during it, they just cannot target or affect cards in the Riddle area.  During a Gollum attack on Bilbo, a player could play Quick Strike and make an attack on a non-Gollum enemy.\n\n \n\nGollum reads: “Forced: After the first player answers a riddle and fails to find at least 1 match, Gollum attacks Bilbo Baggins. (Do not deal a shadow card for this attack.)”\n\n \n\nTo be clear:\n\n \n\nResolving Enemy Attacks\n\nWhen resolving enemy attacks, the players follow these 4 steps, in order. Players may play event cards and take actions at the end of each step.\n\n1. Choose an enemy. The first player chooses which attack (among the enemies to which he is engaged) to resolve first.\n\n2. Declare defender. A character must exhaust to be declared as a defender. Only one character can\n\nbe declared as a defender against each attacking enemy. A player also has the option to let an attack go\n\nundefended, and declare no defenders for that attack.\n\nUnless a card effect specifies otherwise, players can only declare defenders against enemies with whom they are engaged.\n\n \n\nAccording the the FAQ:\n\n(1.33) Attacks by non-engaged enemies\n\nWhen an enemy attacks a player, that player may declare 1 defender whether the enemy is engaged with him or not. Sentinel may also be used to defend against such attacks.\n\n \n\nHowever, I can't find anything doesn't say what happens when an enemy attacks a non-player.\n\n \n\nTown Baiting says, “When Revealed: Smaug makes an attack against Lake-town. The last player may declare a defender against this attack.” So, it tells you how to defend this attack.\n\n \n\nGollum has no such text, so it seems that by the rules, you cannot defend against Gollum's attack (not even with Bilbo) while Gollum is in the Riddle area.\n\n \n\nHowever…\n\n \n\nThe Riddle Area text in the rule's sheet says”While Bilbo Baggins is in the riddle area, the first player still controls him; however, he cannot quest, attack, take damage from cards other than Gollum, have attachments played on him by the players, or defend (except against Gollum).\n\nSo it implies that at the least, Bilbo can defend against Gollum, but it doesn't say whether or not other characters can defend against Gollum.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=733209","commentId":733209,"userName":"Alex6222","timestamp":1355310119,"content":"I agree with Rich, although tecnically the first player \"controls\" Bilbo the riddle area is a totally diferent place. You cannot play attachemts or use events to help Bilbo so the first player only decides wether Bilbo would defend an attack by gollum or to trigger the ring's ability, once you enter stage 3 you are going to be able to defend with other characters that aren't Bilbo, and thematically it makes sense only Bilbo can defend Gollum attacks because he is pretty alone in there.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=733251","commentId":733251,"userName":"richsabre","timestamp":1355319725,"content":"yes, without sending a rules request this is the closest to an answer you are going to get.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75414-defending-bilbo-in-dungeons-deep-and-caverns-dim/?do=findComment&comment=745336","commentId":745336,"userName":"Thetimebinder","timestamp":1357752514,"content":"I can see not being able to defend for Bilbo except with Bilbo, if the Riddle Area was set up like the seperate staging areas in Foudations of Stone and thus nothing in one area can affect a differant area.  Thanks for all the input."}]}