{"url":"https://community.fantasyflightgames.com/topic/75473-been-away-for-a-while-saga-expansions/","title":"Been away for a while - Saga Expansions?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75473-been-away-for-a-while-saga-expansions/?do=findComment&comment=733153","commentId":733153,"userName":"Svenn","timestamp":1355302376,"content":"Hey all, some of you might remember me from a while back. I've been away from LCGs for a while (mostly playing a bunch of board games and video games) and I'm looking to pick up some new sets now. Last I was here we were just getting the first bits of info about Saga expansions. They are out now (and it seems people like them) but I can't tell what is different about the Saga expansion over the Deluxe expansions (other than the fact that the Deluxe expansions have a 6 pack cycle after them).\n\nSo, what is different about the Saga expansions? Do they also include 2 heroes, a bunch of player cards, and 3 encounter sets like the Deluxe expansions?\n\nThanks for the help in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75473-been-away-for-a-while-saga-expansions/?do=findComment&comment=733159","commentId":733159,"userName":"richsabre","timestamp":1355303038,"content":"hey Svenn, i remember you well.\n\nthe saga expansions do not have any packs after them and they only need the core set to buy them. i think basically they are ideas that ffg want to release but wont fit into the currentl release system.\n\nthe hobbit for instance came out because of the films (well they never said this but its pretty obvious) im guessing that numenor was already in the pipeline and they didnt want to cancel it for two packs.\n\nalso the hobbit saga packs are about the actual events of the books unlike the rest of the quests\n\nwelcome back\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75473-been-away-for-a-while-saga-expansions/?do=findComment&comment=733162","commentId":733162,"userName":"Svenn","timestamp":1355303541,"content":"Thanks, rich!\n\nOkay, so there's nothing crazy where I can't use those heroes elsewhere or anything then? Excellent. Can't wait to pick up some new sets. I've got a new gaming group that just started up and I'm hoping to get them into this and the AGoT LCGs. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nOh, and I remember that there are treasures in this set but there wasn't much info before… how do those work?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75473-been-away-for-a-while-saga-expansions/?do=findComment&comment=733167","commentId":733167,"userName":"richsabre","timestamp":1355304069,"content":"Svenn said:\n\nThanks, rich!\n\nOkay, so there's nothing crazy where I can't use those heroes elsewhere or anything then? Excellent. Can't wait to pick up some new sets. I've got a new gaming group that just started up and I'm hoping to get them into this and the AGoT LCGs. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nOh, and I remember that there are treasures in this set but there wasn't much info before… how do those work?\n\n\n\nyeah you can use heros and so on (apart from bilbo as another bilbo hero is in all the hobbit quests)\n\nthe treasure cards were a dissapointment i have  to say. you have the (difficult) chance in the first quest to rescue the treasure cards (3 of) from the trolls. if yuo get them then you can use them in the other two quests. if you dont you cant. they are just weapon attatchments. hopefully it will be something that ffg keeps expanding on to make them a little more useful.\n\ni mean its a great theme idea, but for the amount of build up they were given it was a little bit of an anti climax\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75473-been-away-for-a-while-saga-expansions/?do=findComment&comment=733169","commentId":733169,"userName":"muemakan","timestamp":1355304350,"content":"Also there are 4 Heros in the Saga Expansion……at least the first one did have 4."}]}