{"url":"https://community.fantasyflightgames.com/topic/75484-if-you-could-design-the-next-deluxe-expansionchapter-cycle%E2%80%A6/","title":"If you could design the next deluxe expansion/chapter cycle…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75484-if-you-could-design-the-next-deluxe-expansionchapter-cycle%E2%80%A6/?do=findComment&comment=733246","commentId":733246,"userName":"Gunslinger83","timestamp":1355317153,"content":" \n\n \n\nIf you had your choice and you were FFG's \"idea guy\", what would be your preference for the next deluxe expansion, chapter cycle release?\n\n \n\nMine would be titled \"Guardians of Eriador\" and the \"Lost Realm of Arnor\" cycle.\n\nThe deluxe expansion would feature the Dunedain as they guarded Bree, the Shire, and the south and east roads. The chapter cycle would feature exploring such locations as Annuminas, Fornost Erain, Carn Dum, the Ettenmoors, and perhaps even the Barrow Downs (maybe searching for a long lost Dunedain artifact?) I would finalize the cycle with a \"Raid on Mt. Gundabad\" as the Rangers/Heroes gather intel on the multiplying orc threat in the Misty Mountains .\n\n \n\nFor me, nothing Tolkien has written has captured my imagination as much as the Rangers of the North secretly guarding the inhabitants of the wild, ruin filled, \"Old English themed\" realm of Eriador. I think this would be in line for several reasons:\n\n \n\n1. This is an area that the books have touched on but always left you wanting for more. It is rich in theme and potential adventure and follows where the books have \"travelled\" (which seems to be important in this game).\n\n2. It would be a great opportunity to build the Dunedain and Hobbit synergy, both of which are so central to Tolkien's works. It could also feature more Noldor as well as \"Bree-men\".\n\n3. There is plenty of room for artistic license to be exercised while maintaining a Tolkienesque feel and canon.\n\n \n\nI've even thought out the initial series quote for the box:\n\n“\"Strider\" I am to one fat man who lives within a day's march of foes that would freeze his heart, or lay his little town in ruin, if he were not guarded ceaselessly. Yet we would not have it otherwise. If simple folk are free from care and fear, simple they will be, and we must be secret to keep them so.”\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75484-if-you-could-design-the-next-deluxe-expansionchapter-cycle%E2%80%A6/?do=findComment&comment=733365","commentId":733365,"userName":"richsabre","timestamp":1355339448,"content":"mmmm….strange, i was going to answer but you seem to have read my mind….burla [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/burlon.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75484-if-you-could-design-the-next-deluxe-expansionchapter-cycle%E2%80%A6/?do=findComment&comment=733395","commentId":733395,"userName":"Raven1015","timestamp":1355345064,"content":"Definitely along the lines of one of the possibilities I was thinking of. I think it would be a logical place to finally bring back secrecy as well (rangers and hobbits). I also would love to see some kind of player ambush mechanic where they can actually strike first for once, for some kind of reasonable cost."}]}