{"url":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/","title":"What ar your thoughts on the last 2 heroes?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=734234","commentId":734234,"userName":"gondor23","timestamp":1355533800,"content":"What do you guys think about the 2 new heroes, Boromir and Beregond.\n\n \n\nI think that if you build a pretty centered deck around boromir, you could get a really powerful gondor allies army, and for beregond, I think that using his ability to buy new weapons/armor can make hima really good defender quester in the next AP.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=734258","commentId":734258,"userName":"lleimmoen","timestamp":1355540310,"content":"Well, I think Beregond is the best defender in the game. One does not need think long to conclude that, he has the highest defence strength. However, there are other values. Elrohir or (Tactics) Boromir can defend multiple times without attachments, the mechanism of the latter seems more potent - and economical, the former has higher defence strength. Then, Elrond has the same defence and is Lore which allows for the immediate play of A Burning Brand, with shadow effects ever more deadly that seems a distinc advantage. Coming back to Beregond though, it is not guaranteed to have a shadow cancelation on round 1 where the attacks will often come, Beregond cannot defend multiple attacks as the above or Beorn (who can also take many hits despite having low defence) but his highest initial defence to date is a good safety cushion. Finally, the direct damage is very powerful tool in dealing with both enemies' attacks and their shadow effects, Spear of the Citadel plays for free on Beregond and combined with the cards like Goblin-Cleaver which can then be played too, can defeat many enemies without ever attacking them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=734296","commentId":734296,"userName":"richsabre","timestamp":1355550581,"content":"beregond is one of my favourite heros so far. great art, theme, ability and its quite easy to make a deck where he finds alot of use.\n\nboromir is ok. art is fine but im not a fan, a little too digital for me. stats are fine and the ability is good if you make a deck specifically to use it.\n\ni much prefer breaking of the fellowship boromir\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=734361","commentId":734361,"userName":"hildargo","timestamp":1355568968,"content":"I think Boromir's usefulness will increase as the card pool grows and we get more Gondor allies. The Gondor allies that we have right now are used for defending or their abilities, not necessarily for attacking. Once we start getting some of those cards, we are going to see him shine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=734379","commentId":734379,"userName":"Glaurung","timestamp":1355573910,"content":"hildargo said:\n\nI think Boromir's usefulness will increase as the card pool grows and we get more Gondor allies. The Gondor allies that we have right now are used for defending or their abilities, not necessarily for attacking. Once we start getting some of those cards, we are going to see him shine.\n\n\n\nAgree. He will be same God for Gondor like Dain for dwarfs now. And his brother and father should help him too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=734825","commentId":734825,"userName":"shoreless","timestamp":1355673482,"content":"I literally just got HoN, so I haven't played with Boromir and probably shouldn't be voicing (typing?) my opinion, but it seems like they were kind of cheap with him.\n\nI would have liked to see maybe some kind of cumulative effect, like \"For every resource token on Boromir, all Gondor characters get +1 atk (maximum +3)\". \n\nAgain, I could be wrong and the +1 could be plenty with a swarm of Gondorian soldiers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=735064","commentId":735064,"userName":"Chaos101","timestamp":1355712940,"content":"richsabre said:\n\nberegond is one of my favourite heros so far. great art, theme, ability and its quite easy to make a deck where he finds alot of use.\n\nrich\n\n\n\nI agree. I use Beregond with Erohir and Elladan in two player games. His ability to defend most enemies and to be able to put Citadel Plate on him for a cost of 2 makes him invaluable in my opinion.\n\nOn a side note, two Citadel Spears on a Gondorian Spearman is awesome!\n\nLee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=735637","commentId":735637,"userName":"Chaos101","timestamp":1355804952,"content":"Chaos101 said:\n\nOn a side note, two Citadel Spears on a Gondorian Spearman is awesome!\n\n\n\n \n\nAnd as I realised when I got home and looked at the cards again, not possible!\n\nLimit 1 per character. Still good though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75626-what-ar-your-thoughts-on-the-last-2-heroes/?do=findComment&comment=735756","commentId":735756,"userName":"lleimmoen","timestamp":1355825347,"content":"I think they are finally making it right but not correnting stuff going backwards. What sense does it make that a hero can have two Citadel Plates but only one Spear of the Citadel.\n\nAs for Boromir, I think he will prove very good once Gondor takes care of willpower which is now its weakest point, I think. It is a bit possible that the Outlands will be an answer to that."}]}