{"url":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/","title":"Play Chronology / Quests Timeline","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=734529","commentId":734529,"userName":"yagyu","timestamp":1355609954,"content":"Hey guys, so my friend and i are trying to pin point exactly the chronology of the blocks and quests.\n\nSome are easy but a few are a little difficult, so if anyone can help wed appreciate it. Also rather then just guesses if anyone actually have evidence of where something occurs that would help. If this has already been answered then just link me over there but wed like to play in actauly chronological order.\n\nSo what we got so far known for sure is\n\nHobbit  Block\nWe must away, Ere break of day\nOver the misty mountains\nDungeons deep and caverns dim\n\n-POD Battle of Lake Town\n\n \n\nLOTR B4 Fellowship of the ring Blocks\n\nCore Set\nPassage through Mirkwood\nJourney along the Anduin\nEscape from Dol Gulder\n \n\nShadows of Mirkwood Cycle\nReturn to Mirkwood\nThe dead marshes\nThe hills of Emyn Muil\nA Journey to Rhosgobel\nConflict at Carrock\nThe Hunt for Gollum\n\nDwarrowdelf [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=2&esum=196]  Cycle\nThe Redhorn Gate\nRoad to Rivendell\nThe Watcher in the Water\nThe Long Dark\nFoundations of Stone\nShadow and Flame\n\nRise against Shadow\n(To be released)\n\n \n\nNow those ones are easy Obviously u start with the core set and march thru each consecutive cycle the deluxe boxes and the print on demand sets are the things that are in question.\n\nKazad-dum\nThis one obviosuly works well with the Dwarrowdelf cycle but the events seem to not fit, i mean which comes first and are they right after or right before or spread out from eachother. It seems to me that its a little overkill to have the fellowship go into moria, fight the goblins and balrog only to come out and go right back in. Thought if we follow release dates then it seems this comes right before the dwarrowdelf cycle, but to me this still seems overkill and i have a hard time seeing these events occuring so close together, but again if theres proof or basis for these events (since i know most of these are taken from some little sentence or paragraph from the books or notes of tokien.) id like to see it.\n\nMassing at Osgiliath, This one is the hardest one for me to place. Part of me wants to play it right after the core set block, another part says no its after the shadows of mirkwood, still another says its right before the new rise against shadow cycle.\n\nThen of course there is Heirs of numenor which again following release makes me want to place it right after dwarrowdelf but again it might be to close or conflict story wise with rise against shadow (havent played either yet so i am just worse case scenario guessing).\n\nBut yeah if there is any super Middle earth nuts out there who can help me place these in their proper places let me know. Sooner the better.\n\nThx guys\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=734609","commentId":734609,"userName":"Ellareth","timestamp":1355634150,"content":"I tried to do something similar in the past.\n\nKeep in mind most of these things quests are probably made up, and some of them really makes no sense at all.\n\nFor example, in the book we know Gollum was drawn to Mordor (for all evil things are drawn to it by will of Sauron), got captured, tortured, told the Ring was in Shire, then 'escaped' (Gandalf guessed he was let out on purpose), wonders around Dead Marshes for something to eat, Aragorn finds Gollum's footsteps in the mud and captures him.\n\nBut in the LotR LCG, heroes found Gollum's tracks in Emyn Muil, Gollum runs into Dead Marshes in last effort to escape but gets captured…… which leaves no time for Gollum to be tortured by Sauron.\n\nHaving said that, here is my best guess.\n\n \n\n \n\nCore Set\n\n \n\nThranduil notices growing shadow in the southern Mirkwood, namely around Dol Guldur, and wishes to warn Lord Celeborn and Lady Galadriel of Lorien. After hearing the news, Heroes are asked to investigate Dol Guldur and find out it is once again occupied by Sauron's force.\n\n \n\nA. Sept 3001 ~ Sept 3018; Core Set rule book says the game takes place between Bilbo's 111th Birthday party and Frodo's departure from Shire. Although this timeline isn't kept for all the expansions, Core Set probably happened within these timeline.\n\nB. ~ 20 June 3018; This is when Thranduil's place was attacked and Gollum escapes. Thranduil would probably warn about more than 'growing evil' if he was surprise attacked by bunch of orcs.\n\nC. 3009; Year 3009 of the Third Age is very promising time frame for the events in Core Set to take place because in the Appendix it mentions this is the year 'the Mountains and all lands eastward are becoming dangerous.'.\n\n \n\nPossible Timeline: Sept 3001 ~ 20 June 3018\n\nProbable Time of Quest: Year 3009\n\n \n\nShadow of Mirkwood\n\n \n\nGandalf asks heroes to track down creature known as Gollum. Being heroes, they get side tracked doing heroic stuff like 'saving' very powerful Beornings who are capable of tramsforming into bear from couple of raggidy trolls and nursing a 'poisonous' arrow wound on a gigantic eagle that is probably nothing more than paper cut considering the eagle's size. Anyhow, heroes finally captures Gollum and brings him back to Thranduil's Palace in Mirkwood for interogation.\n\n \n\nA. 3009 ~ 3017; year 3009 is when \"Gandalf and Aragorn renew their hunt for Gollun at intervals during the next eight years, searchign in the vales of Anduin, Mirkwood, and Rhovanions to the confines of Mordor\", and year 3017 is when \"Gollum is released from Mordor. he is taken by Aragorn in the Dead Marshes, and brought to Thranduil in Mirkwood.\". Kind of hard to imagine a Cycle taking spawn of 8 years, but hunt for gollum is straight out of the Appendix as far as I can tell, and in the Appendix it said it took 8 years.\n\n \n\nTime of Quest: 3009 ~ 3017\n\n \n\nKhazad-Dum\n\n \n\nWhite Council haven't heard from group of dwarves Balin has led to recolonize Moria and fears for the worst. Group of heroes are asked to enter the great dwarven city of Khazad-Dum and gather any news of Balin and his dwarves.\n\n \n\nA. 2994 ~; year 2994 is when Balin dies. Seems logical this quest would take place after death of Balin.\n\nB. ~ January 3019; This is when the Fellowship enters Moria. Balrog would've been dead at this point so there couldn't have been 'Nameless Fear'.\n\nC. Year 3009; 'indeed the only evidence of the former party may now be the burned and frozen remains that lie under snowdrifts as referenced in quest stage two of The Redhorn Gate.' (http://www.fantasyflightgames.com/edge_news.asp?eidn=3374 [http://www.fantasyflightgames.com/edge_news.asp?eidn=3374]). This article seems to suggest that events in Khazad-Dum is kind of prologue to events in Dwarrowdelf Cycle. And our heroes who escaped 'Namelss Fear' all froze to death in the mountains (which makes sense since they should have had no food or gears after narrowly escaping Balrog). Since Dwarrowdelf Cycle happened during year 3009 (see below), Khazad-Dum must have happened during year 3009 as well for corpses to have not rotten that much and recognized as corpses.\n\n \n\nPossible Timeline: 2994 ~ January 3019\n\nProbably Time of Quest: Year 3009.\n\n \n\n* Funny thing is, nobody, not Elrond, not Galadriel, and especially not Saruman (unlike in the movie) knew there was Balrog in the Moria. Heck, Gandalf wanted to go through the mines of Moria in the book against Aragorn's judgement (or maybe Gandalf meant to take care of Balrog on the way…. He did take care of Orcs of Misty Mountains, Smaug, Orcs of Grey Mountains, and the Wargs of Rhovanion while restoring Kingdom of Dale and Erebor and establishing alliance between Thranduil's elves, Dain's dwarves, Beorn's Beornings, and Dale's dalemen. Why not destroy the Ring and kill a Balrog or two on the way too…). Anyways, either our heroes were total lackwits who couldn't recognize Balrog as Balrog, or they all died as said in the article, failing their ultimate mission no matter what we, the players, do.\n\n* Another funny thing, last meeting of the White Council happened in year 2953. But Balin retakes Moria at 2989. So either we are given orders to contact Balin at Moria before he enters Moria (a mission from the past… or mission into the future), or some unknown organization pretending to be the White Council is using us for their own purpose (… could it possibly be Saruman?!?). Of course, White Council might not need to have a meeting to give out every little mission… that's a perfectly fine explanation I suppose.\n\n \n\nDwarrowdelf\n\n \n\nDue to growing threat of Dol Guldur and lands East of the Mountains in general, Elrond judged that it is safer for Arwen to journey over the Highpass during snowing winter than stay at Caras Galadhon under protection of Galadriel. Heroes were really tired from battling against the hiking snowstorms, but they couldn't even afford a good night's sleep due to stupid orcs trying to ambush they every opportunity. Elrond, ignoring the fact that orcs would've been no problem if heroes weren't so tired from stupidly venturing Caradhras during snowing season, was shocked that bunch of orcs were causing trouble in the mountain once again and wished Heroes to investigate the source of the Orcish activity. For some reason, rather than investigating the Orc's last known hide out, the Goblin Town in the High Pass, heroes were sent to investigate Moria instead. They had to fight the Watcher to enter the gate, journey through long dark and eventually found out there is a Balrog in Moria.\n\n \n\nA. 3009; from the Appendix 'Elrond sends for Arwen, and she returns to Imladris'. The Cycle begins with escoring Arwen from Lorien to Imladris.\n\n \n\nTime of Quest: Year 3009\n\n \n\n* These group of heroes also need to die since noone is supposed to know about the Balrog.\n\n \n\nHeirs of Numenor\n\n \n\nWhite Council asks heroes to to sail all the way from Grey Harbour, the western end of Middle Earth, to Pelegir, as east as you can get before entering Mordor and those 'evil' lands, to help Gondor in the war against Sauron. There they are asked to deliver a letter to Faramir. Heroes travel to Ithilien expecting to find Faramir, only to learn he is in Cair Andros, an island fortress that is about to be sieged.\n\n \n\nA. 2983 ~ : This is birth of Faramir. He needs to be born at least.\n\nB. 3000 ~ : This is when 'the shadow of Mordor lengthens'. Mordor needs to grow in power to attack Gondor.\n\nC. ~ March 3019 : This is when Faramir meets Frodo in Ithilien, does NOT take the hobbit hostage but lets them go, and soon suffers from Black Breath. So he must have valiantly defended Cair Andros quite somtime before this.\n\nD. 3018: This is pure speculation, but Sauron throws some Haradhrims, Mumaks, and Elite Orcs, so it's gotta be more than average day at work for Faramir. Sauron was very careful about revealing his own strength. He didn't permit his Nazgul to fly on their fellbeast on the western side of the river, he moved his troops under cover of the night, so it is unlikely he sent some of his elite troops to siege Cair Andros for the fun of it. In the June of year 3018, Sauron launches a semi serious attack against Gondor, to check Denethor's defences and probe around to see where to send his troops when the time comes… and to also create distraction for his Nazgul to cross Anduin in secrete in search for Shire. It is possible that this attack on Cair Andros was one of them.\n\n \n\nPossible Timeline: 3000 ~ March 3019\n\nProbable Time of Quest: Year 3018\n\n \n\n* Once again, White Council stopped meeting about half a centry ago.\n\n \n\nOver Hill and Under Hill\n\n \n\nExperience the events from \"The Hobbits\" as card game.\n\n \n\nA. 2941 : The events take place during the book \"The Hobbit\".\n\n \n\nTime of Quest : Year 2941\n\n \n\nMassing at Osgiliath\n\n \n\nHeroes are asked to scout Osgiliath. When they arrive, they find army of Mordor beyond all expectation.\n\n \n\nA. June 3018 ~ : This is when Boromir, Faramir, and 2 other unknown Gondorians destroyed the Bridge and retreated to Western Osgiliath. Since our hereos retreated by crossing the river while an Ithilien Ranger held the rear, it is probably safe to assume the quest happened after destruction of bridge.\n\nB. ~ March 3019 : Battle of Pelenor Field happens here, so Quest Massing at Osgiliath must have happened sometime before this.\n\nC. 3018 : Same reasoning as Heirs of Numenor, I believe events at Massing at Osgiliath was Sauron's attempt at probing Denethor's defences before the main assault as well as providing cover for his Nazguls to cross Anduin undetected to they can ride north disguised as 'Black Riders' to Shire.\n\n \n\nPossible Timeline : June 3018 ~ March 3019\n\nProbable Time of Quest : Year 3019\n\n \n\n \n\nBattle at Lake Town\n\n \n\nBard kills Smaug.\n\n \n\nA. 2941 : Straight out of \"The Hobbit\"\n\n \n\nTime of Quest : Year 2941\n\n \n\n \n\n \n\n \n\nTo Sumurize…\n\nThe Quests in Chronological Order\n\nOver the Hill and Under Hill (2941 TA) [Gadalf: Sending an Hobbit to slay the last fire breathing dragon. What could possibly go wrong? On a totally unrelated sidenote, dang these are some good pipeweed!]\n\nBattle at Laketown (2941 TA) [bard: Stupid Dwarves, stupid fat Hobbit, and most of all stupid procrastinating weed addict wizard. In the end I did all the work and all saving laketown and all slaying Smaug.]\n\nShadow of Mirkwood (3009 ~ 3017 TA) [Gandalf: Oh, Sauron is in action again? Ah oh… he must be searching for the One Ring….. I am kind of suspicious about Bilbo's ring. Maybe I will try and learn more about Bilbo's ring by questioning Gollum]\n\nCore Set (Spring/Summer 3009 TA) [Thranduil: Oh shizzle, the fortress of Dol Guldur, which White Council cleansed couple decades ago, is sending out evil vibes again. I better send warning to all nearby allies]\n\nKhazad-Dum (3009 TA Early Winter) [Elrond: I'm hearing a lot of reports about evil things stirring in the Misty Mountains and Mirkwood and such. But oddly no report came from Moria for… 15 years, that seems like a long time. Maybe I'll send someone to check them out, to see if they are doing okay.]\n\nDwarrowdelf (3009 TA Winter) [Elrond: Sweety how was your journey over the Mountain? I know it was wintertime but Lorien was just too close to Dol Guldur. What? You were attacked by the Orcs? Come to think of it, the scouts I've sent to Moria hasn't returned yet. This is concerning… maybe I'll send another group to see Moria has something to do with increased Orc activity.\n\nMassing at Osgiliath / Heirs of Numenor (3019 TA) [sauron: I will launch multiple attacks against Gondor on various fronts to see how strong their defences are. Also, while they are busy defending my 'attacks', I will sneak my Nazguls disguised as 'Black Riders' across the river Anduin in search for this Shire, Baggins to get my Ring back.]\n\n \n\n \n\n \n\nThese are just speculations, but I don't think they would be that far off.\n\nAs you can see besides Over the Hill and Under Hill and Battle of Laketown (which are Saga Expansion and Print on Demand, both of which are sort of out of 'regular expansions' cycle), they all fit in the time frame of Bilbo's 111th Birthday party and Frodo's departure from Shire.\n\nFew oversights here and there (like White Council giving missions when they haven't had meeting for some time now, or Gollum never given chance to enter Mordor before being captured), but overall I can tell a lot of work went into make this game as relevent to the source material as possible.\n\n \n\nFrom your post, it sounds like you are asking how could a single set of heroes go through all the quests chronologically. As for that the only answer I could provide is they can't. All these quests are done by many different groups of heroes. Some heroes are even dead after we, the players, win the quest (like the group of heroes from Khazad-Dum will freeze to death even if players win the quest). Some heroes spend 8 years searching for Gollum, so they miss out on opportunity to face Balrog or fight Watcher at all.\n\nHope this reply was kind of useful even though it wasn't exactly what you were looking for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=734613","commentId":734613,"userName":"AjiTae","timestamp":1355635177,"content":"The Hobbit extension does go first since it happens around 2941 TA.\n\nThe Dwarrowdelf cycle takes place after Balin's expedition to Moria and before the War of the Ring, so anywhere between 2989 (when Balin and his fellow Dwarves left for Moria) and 3019 TA.\n\nThen the hunt for Gollum led by Aragorn and Gandalf (which inspired the Mirkwood Cycle) took place in the early 3010s TA.\n\nI'd say Massing at Osgiliath and Heirs of Numenor also take place a little before the War of the Ring so between the early 3000s and 3019 TA.\n\n \n\n \n\nEdit : well Ellareth's post is much more detailed but there you go\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=734622","commentId":734622,"userName":"Glaurung","timestamp":1355637741,"content":"Ellareth said:\n\nI tried to do something similar in the past.\n\nKeep in mind most of these things quests are probably made up, and some of them really makes no sense at all.\n\nFor example, in the book we know Gollum was drawn to Mordor (for all evil things are drawn to it by will of Sauron), got captured, tortured, told the Ring was in Shire, then 'escaped' (Gandalf guessed he was let out on purpose), wonders around Dead Marshes for something to eat, Aragorn finds Gollum's footsteps in the mud and captures him.\n\nBut in the LotR LCG, heroes found Gollum's tracks in Emyn Muil, Gollum runs into Dead Marshes in last effort to escape but gets captured…… which leaves no time for Gollum to be tortured by Sauron.\n\nHaving said that, here is my best guess.\n\n \n\n \n\nCore Set\n\n \n\nThranduil notices growing shadow in the southern Mirkwood, namely around Dol Guldur, and wishes to warn Lord Celeborn and Lady Galadriel of Lorien. After hearing the news, Heroes are asked to investigate Dol Guldur and find out it is once again occupied by Sauron's force.\n\n \n\nA. Sept 3001 ~ Sept 3018; Core Set rule book says the game takes place between Bilbo's 111th Birthday party and Frodo's departure from Shire. Although this timeline isn't kept for all the expansions, Core Set probably happened within these timeline.\n\nB. ~ 20 June 3018; This is when Thranduil's place was attacked and Gollum escapes. Thranduil would probably warn about more than 'growing evil' if he was surprise attacked by bunch of orcs.\n\nC. 3009; Year 3009 of the Third Age is very promising time frame for the events in Core Set to take place because in the Appendix it mentions this is the year 'the Mountains and all lands eastward are becoming dangerous.'.\n\n \n\nPossible Timeline: Sept 3001 ~ 20 June 3018\n\nProbable Time of Quest: Year 3009\n\n \n\nShadow of Mirkwood\n\n \n\nGandalf asks heroes to track down creature known as Gollum. Being heroes, they get side tracked doing heroic stuff like 'saving' very powerful Beornings who are capable of tramsforming into bear from couple of raggidy trolls and nursing a 'poisonous' arrow wound on a gigantic eagle that is probably nothing more than paper cut considering the eagle's size. Anyhow, heroes finally captures Gollum and brings him back to Thranduil's Palace in Mirkwood for interogation.\n\n \n\nA. 3009 ~ 3017; year 3009 is when \"Gandalf and Aragorn renew their hunt for Gollun at intervals during the next eight years, searchign in the vales of Anduin, Mirkwood, and Rhovanions to the confines of Mordor\", and year 3017 is when \"Gollum is released from Mordor. he is taken by Aragorn in the Dead Marshes, and brought to Thranduil in Mirkwood.\". Kind of hard to imagine a Cycle taking spawn of 8 years, but hunt for gollum is straight out of the Appendix as far as I can tell, and in the Appendix it said it took 8 years.\n\n \n\nTime of Quest: 3009 ~ 3017\n\n \n\nKhazad-Dum\n\n \n\nWhite Council haven't heard from group of dwarves Balin has led to recolonize Moria and fears for the worst. Group of heroes are asked to enter the great dwarven city of Khazad-Dum and gather any news of Balin and his dwarves.\n\n \n\nA. 2994 ~; year 2994 is when Balin dies. Seems logical this quest would take place after death of Balin.\n\nB. ~ January 3019; This is when the Fellowship enters Moria. Balrog would've been dead at this point so there couldn't have been 'Nameless Fear'.\n\nC. Year 3009; 'indeed the only evidence of the former party may now be the burned and frozen remains that lie under snowdrifts as referenced in quest stage two of The Redhorn Gate.' (http://www.fantasyflightgames.com/edge_news.asp?eidn=3374 [http://www.fantasyflightgames.com/edge_news.asp?eidn=3374]). This article seems to suggest that events in Khazad-Dum is kind of prologue to events in Dwarrowdelf Cycle. And our heroes who escaped 'Namelss Fear' all froze to death in the mountains (which makes sense since they should have had no food or gears after narrowly escaping Balrog). Since Dwarrowdelf Cycle happened during year 3009 (see below), Khazad-Dum must have happened during year 3009 as well for corpses to have not rotten that much and recognized as corpses.\n\n \n\nPossible Timeline: 2994 ~ January 3019\n\nProbably Time of Quest: Year 3009.\n\n \n\n* Funny thing is, nobody, not Elrond, not Galadriel, and especially not Saruman (unlike in the movie) knew there was Balrog in the Moria. Heck, Gandalf wanted to go through the mines of Moria in the book against Aragorn's judgement (or maybe Gandalf meant to take care of Balrog on the way…. He did take care of Orcs of Misty Mountains, Smaug, Orcs of Grey Mountains, and the Wargs of Rhovanion while restoring Kingdom of Dale and Erebor and establishing alliance between Thranduil's elves, Dain's dwarves, Beorn's Beornings, and Dale's dalemen. Why not destroy the Ring and kill a Balrog or two on the way too…). Anyways, either our heroes were total lackwits who couldn't recognize Balrog as Balrog, or they all died as said in the article, failing their ultimate mission no matter what we, the players, do.\n\n* Another funny thing, last meeting of the White Council happened in year 2953. But Balin retakes Moria at 2989. So either we are given orders to contact Balin at Moria before he enters Moria (a mission from the past… or mission into the future), or some unknown organization pretending to be the White Council is using us for their own purpose (… could it possibly be Saruman?!?). Of course, White Council might not need to have a meeting to give out every little mission… that's a perfectly fine explanation I suppose.\n\n \n\nDwarrowdelf\n\n \n\nDue to growing threat of Dol Guldur and lands East of the Mountains in general, Elrond judged that it is safer for Arwen to journey over the Highpass during snowing winter than stay at Caras Galadhon under protection of Galadriel. Heroes were really tired from battling against the hiking snowstorms, but they couldn't even afford a good night's sleep due to stupid orcs trying to ambush they every opportunity. Elrond, ignoring the fact that orcs would've been no problem if heroes weren't so tired from stupidly venturing Caradhras during snowing season, was shocked that bunch of orcs were causing trouble in the mountain once again and wished Heroes to investigate the source of the Orcish activity. For some reason, rather than investigating the Orc's last known hide out, the Goblin Town in the High Pass, heroes were sent to investigate Moria instead. They had to fight the Watcher to enter the gate, journey through long dark and eventually found out there is a Balrog in Moria.\n\n \n\nA. 3009; from the Appendix 'Elrond sends for Arwen, and she returns to Imladris'. The Cycle begins with escoring Arwen from Lorien to Imladris.\n\n \n\nTime of Quest: Year 3009\n\n \n\n* These group of heroes also need to die since noone is supposed to know about the Balrog.\n\n \n\nHeirs of Numenor\n\n \n\nWhite Council asks heroes to to sail all the way from Grey Harbour, the western end of Middle Earth, to Pelegir, as east as you can get before entering Mordor and those 'evil' lands, to help Gondor in the war against Sauron. There they are asked to deliver a letter to Faramir. Heroes travel to Ithilien expecting to find Faramir, only to learn he is in Cair Andros, an island fortress that is about to be sieged.\n\n \n\nA. 2983 ~ : This is birth of Faramir. He needs to be born at least.\n\nB. 3000 ~ : This is when 'the shadow of Mordor lengthens'. Mordor needs to grow in power to attack Gondor.\n\nC. ~ March 3019 : This is when Faramir meets Frodo in Ithilien, does NOT take the hobbit hostage but lets them go, and soon suffers from Black Breath. So he must have valiantly defended Cair Andros quite somtime before this.\n\nD. 3018: This is pure speculation, but Sauron throws some Haradhrims, Mumaks, and Elite Orcs, so it's gotta be more than average day at work for Faramir. Sauron was very careful about revealing his own strength. He didn't permit his Nazgul to fly on their fellbeast on the western side of the river, he moved his troops under cover of the night, so it is unlikely he sent some of his elite troops to siege Cair Andros for the fun of it. In the June of year 3018, Sauron launches a semi serious attack against Gondor, to check Denethor's defences and probe around to see where to send his troops when the time comes… and to also create distraction for his Nazgul to cross Anduin in secrete in search for Shire. It is possible that this attack on Cair Andros was one of them.\n\n \n\nPossible Timeline: 3000 ~ March 3019\n\nProbable Time of Quest: Year 3018\n\n \n\n* Once again, White Council stopped meeting about half a centry ago.\n\n \n\nOver Hill and Under Hill\n\n \n\nExperience the events from \"The Hobbits\" as card game.\n\n \n\nA. 2941 : The events take place during the book \"The Hobbit\".\n\n \n\nTime of Quest : Year 2941\n\n \n\nMassing at Osgiliath\n\n \n\nHeroes are asked to scout Osgiliath. When they arrive, they find army of Mordor beyond all expectation.\n\n \n\nA. June 3018 ~ : This is when Boromir, Faramir, and 2 other unknown Gondorians destroyed the Bridge and retreated to Western Osgiliath. Since our hereos retreated by crossing the river while an Ithilien Ranger held the rear, it is probably safe to assume the quest happened after destruction of bridge.\n\nB. ~ March 3019 : Battle of Pelenor Field happens here, so Quest Massing at Osgiliath must have happened sometime before this.\n\nC. 3018 : Same reasoning as Heirs of Numenor, I believe events at Massing at Osgiliath was Sauron's attempt at probing Denethor's defences before the main assault as well as providing cover for his Nazguls to cross Anduin undetected to they can ride north disguised as 'Black Riders' to Shire.\n\n \n\nPossible Timeline : June 3018 ~ March 3019\n\nProbable Time of Quest : Year 3019\n\n \n\n \n\nBattle at Lake Town\n\n \n\nBard kills Smaug.\n\n \n\nA. 2941 : Straight out of \"The Hobbit\"\n\n \n\nTime of Quest : Year 2941\n\n \n\n \n\n \n\n \n\nTo Sumurize…\n\nThe Quests in Chronological Order\n\nOver the Hill and Under Hill (2941 TA) [Gadalf: Sending an Hobbit to slay the last fire breathing dragon. What could possibly go wrong? On a totally unrelated sidenote, dang these are some good pipeweed!]\n\nBattle at Laketown (2941 TA) [bard: Stupid Dwarves, stupid fat Hobbit, and most of all stupid procrastinating weed addict wizard. In the end I did all the work and all saving laketown and all slaying Smaug.]\n\nShadow of Mirkwood (3009 ~ 3017 TA) [Gandalf: Oh, Sauron is in action again? Ah oh… he must be searching for the One Ring….. I am kind of suspicious about Bilbo's ring. Maybe I will try and learn more about Bilbo's ring by questioning Gollum]\n\nCore Set (Spring/Summer 3009 TA) [Thranduil: Oh shizzle, the fortress of Dol Guldur, which White Council cleansed couple decades ago, is sending out evil vibes again. I better send warning to all nearby allies]\n\nKhazad-Dum (3009 TA Early Winter) [Elrond: I'm hearing a lot of reports about evil things stirring in the Misty Mountains and Mirkwood and such. But oddly no report came from Moria for… 15 years, that seems like a long time. Maybe I'll send someone to check them out, to see if they are doing okay.]\n\nDwarrowdelf (3009 TA Winter) [Elrond: Sweety how was your journey over the Mountain? I know it was wintertime but Lorien was just too close to Dol Guldur. What? You were attacked by the Orcs? Come to think of it, the scouts I've sent to Moria hasn't returned yet. This is concerning… maybe I'll send another group to see Moria has something to do with increased Orc activity.\n\nMassing at Osgiliath / Heirs of Numenor (3019 TA) [sauron: I will launch multiple attacks against Gondor on various fronts to see how strong their defences are. Also, while they are busy defending my 'attacks', I will sneak my Nazguls disguised as 'Black Riders' across the river Anduin in search for this Shire, Baggins to get my Ring back.]\n\n \n\n \n\n \n\nThese are just speculations, but I don't think they would be that far off.\n\nAs you can see besides Over the Hill and Under Hill and Battle of Laketown (which are Saga Expansion and Print on Demand, both of which are sort of out of 'regular expansions' cycle), they all fit in the time frame of Bilbo's 111th Birthday party and Frodo's departure from Shire.\n\nFew oversights here and there (like White Council giving missions when they haven't had meeting for some time now, or Gollum never given chance to enter Mordor before being captured), but overall I can tell a lot of work went into make this game as relevent to the source material as possible.\n\n \n\nFrom your post, it sounds like you are asking how could a single set of heroes go through all the quests chronologically. As for that the only answer I could provide is they can't. All these quests are done by many different groups of heroes. Some heroes are even dead after we, the players, win the quest (like the group of heroes from Khazad-Dum will freeze to death even if players win the quest). Some heroes spend 8 years searching for Gollum, so they miss out on opportunity to face Balrog or fight Watcher at all.\n\nHope this reply was kind of useful even though it wasn't exactly what you were looking for.\n\n\n\nWow your Tokien lore and work on this thread really imprease me. Respect!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=734690","commentId":734690,"userName":"yagyu","timestamp":1355653965,"content":"Thanx dude, that was spot on what i was hoping for, u sir are awesome and know as much about Middle Earth if not more then i know about a galaxy far far away lol.\n\nYeah i had heard ffg say offfically in one of their preview articles that these were meant to be different fellowships doing these missions. Still it didnt seem to make sense to me why elrond would go and send a group into Moria who barely escapes from the Balrog, only to go and send them or another group BACK into Moria and have to deal with an even angrier kill u in two turns (which it DID tonight when me and my friend played lol) Balrog.\n\nBut yeah dude thank iu so much, hopefully we can keep updating this with the future adventure, sage and deluxe releases to help anyone else like myself who wanna stay true to the timeline when campaigning.\n\nThx again man, u rock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=734801","commentId":734801,"userName":"Gizlivadi","timestamp":1355671658,"content":"Ellareth said:\n\n \n\nMassing at Osgiliath / Heirs of Numenor (3019 TA) [sauron: I will launch multiple attacks against Gondor on various fronts to see how strong their defences are. Also, while they are busy defending my 'attacks', I will sneak my Nazguls disguised as 'Black Riders' across the river Anduin in search for this Shire, Baggins to get my Ring back.]\n\n \n\n\n\n \n\nFrom the HoN rules sheet: \"Welcome to Heirs of Númenor, an expansion to The Lord of the Rings: The Card Game. This expansion explores eastern Gondor in the years leading up to the War of the Ring.\"\n\nConsidering that, I suppose the HoN set, the AtS cycle and MaO take place several years before 3019 TA."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=734846","commentId":734846,"userName":"Ellareth","timestamp":1355676065,"content":"To Glaurung\n\nAnd respect to you for your forum activities and gaming skills.\n\n \n\nTo yagyu\n\nGlad it helped!\n\n \n\nTo Gizlivadi\n\nYou are right, they should be year 3018, not 3019 since Nazgul crossed the Anduin in the summer of year 3018.\n\nI guess I made a mistake and it got carried through, will edit that now, thanks for the catch\n\n \n\nEdit: I can't seem to be able to edit my earlier post…. well all the year 3019 should be year 3018."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=1079889","commentId":1079889,"userName":"jkl620","timestamp":1399738442,"content":"I have been searching the internet for a timeline like this! I have tried to make one, but as I don't own everything it has been difficult. Does anyone have updates on where things released in the last 16 months fit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=1080322","commentId":1080322,"userName":"ZanzibarLand","timestamp":1399789828,"content":"Really cool. Thanks for this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=2521619","commentId":2521619,"userName":"RegisF","timestamp":1480588386,"content":"Is it possible to update this topic ? Cause I'm very interested by that timeline.\n\nAccording to the expansions' rules, after Numenor comes, Ringmaker, Dread Realm and Grey Havens. And Harad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=2521697","commentId":2521697,"userName":"PsychoRocka","timestamp":1480595364,"content":"This thread is fantastic I wish I had found it a long time ago.\nI have recently started an endeavor similar to this one and I was lucky enough to post a guest article on Hallofbeorn where I focus on the lore of the game and how it fits into the actual history of middle earth and the impact the game may have had behind the scenes: https://hallofbeorn.wordpress.com/2016/11/11/the-story-so-far-part-1-shadows-of-mirkwood/ [https://hallofbeorn.wordpress.com/2016/11/11/the-story-so-far-part-1-shadows-of-mirkwood/]\n\nI have only covered the core set and shadows of mirkwood so far but hope to continue the series soon with the next article covering HoN and the first few quests of Against the Shadow. The next article should be a little more interesting considering the important and dire events that unfold."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=2521929","commentId":2521929,"userName":"ParinorB","timestamp":1480606410,"content":"I don't have time now to read the entire thread in detail so forgive me if I am posting useless info.\n\n \n\nI was thinking the thread should mention \"The tale of years [https://boardgamegeek.com/thread/1214867/tale-years-mega-campaign-mode-lotr-lcg]\", a project sitting on BGG - they have a chronology of quests and also special campaign rules. The latest update includes the list up to the middle of the Dream Chase campaign.\n\n \n\nLooked like they also added some custom boons and burdens for the entire campaign etc. I haven't looked at all of this in detail but thought it might be interesting to you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=2522391","commentId":2522391,"userName":"987654321","timestamp":1480621939,"content":"> u sir are awesome and know as much about Middle Earth if not more then i know about a galaxy far far away lol.\n\nYour sources are probably from a long time ago, therefore possibly inaccurate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=3681529","commentId":3681529,"userName":"aliprandifabio","timestamp":1555511269,"content":"Hi all, \nThis is the file I made few weeks ago.\nI don't know if it is chronologically correct, but you can help me to fix the item.\n\n \n\nHere you can download the file: https://ufile.io/y9iq9013 [https://ufile.io/y9iq9013]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75663-play-chronology-quests-timeline/?do=findComment&comment=3681695","commentId":3681695,"userName":"Felswrath","timestamp":1555519631,"content":"We know that the heroes from Grey Havens are the same as the ones from Angmar Awakens, Angmar Awakens takes place in Autumn, so it's unlikely that the following cycles are set in the same year."}]}