{"url":"https://community.fantasyflightgames.com/topic/75690-what-happens-to-alcarons-scroll-if-attached-to-an-enemy-when-it-is-destoyed/","title":"what happens to Alcaron&#039;s Scroll if attached to an enemy when it is destoyed?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75690-what-happens-to-alcarons-scroll-if-attached-to-an-enemy-when-it-is-destoyed/?do=findComment&comment=734736","commentId":734736,"userName":"CaffeineAddict","timestamp":1355660804,"content":"I was just playing Peril in Pelargir…it seems obvious that the intention is that if the scroll is attached to an enemy, and the enemy is destroyed, the scroll goes back to the staging area (this would be an impossible quest otherwise). But don't attachments get discarded if attached to something that gets destroyed? or does that only apply to player cards? Are we supposed to detach the scroll in some other way? I've played this quest before, and put it back in the staging area after destroying the enemy, but this evening it occured to me that surely thats not the way the rules work…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75690-what-happens-to-alcarons-scroll-if-attached-to-an-enemy-when-it-is-destoyed/?do=findComment&comment=734828","commentId":734828,"userName":"richsabre","timestamp":1355673583,"content":"i would say it goes to staing area. the other rule will just apply to player cards i would say\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75690-what-happens-to-alcarons-scroll-if-attached-to-an-enemy-when-it-is-destoyed/?do=findComment&comment=734848","commentId":734848,"userName":"kennoastic","timestamp":1355676247,"content":"I think the scroll is supposed to work like:\n\nFirst you get the scroll, if an enemy damages the hero carrying the scroll that enemy grabs it. Then you have to kill that enemy (and exhaust a hero) to regain the scroll.\n\n \n\nI'm unable to find rules about unattaching.\n\nTo make the card work I assume it will be something like this:\n\nAttaching an already attached attachment to something else does not trigger any \"unattached\" responses. It just moves the attachment. When killing an enemy with an attachment the attachment would normally be discarded unless it's a guarded objective. The \"when unattached\" on the card will return the scroll to the staging area instead of being discarded.\n\nMy conclusion is that \"when unattached …\" means \"when the object this attachment is attached to leaves play …\"."}]}