{"url":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/","title":"The Hobbit + The Appendices","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=734896","commentId":734896,"userName":"Dain Ironfoot","timestamp":1355684027,"content":"So, I just got home from seeing The Hobbit and I'm very curious about The Appendices now; I'll admit, I've never read them before as I've not had much interest (so much of them seemed boring).\n\nHowever, now I want to know what Tolkein has written about the events that happened during The Hobbit but aren't part of the story proper (e.g. The Necromancer, etc).\n\nAnyone know which Appendices (or even other works?) I should read? Thanks! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=734899","commentId":734899,"userName":"AjiTae","timestamp":1355684818,"content":"I really enjoyed reading the appendices of the LOTR. But if you really want to learn more about Middle Earth start with the Simarillion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=734968","commentId":734968,"userName":"GrandSpleen","timestamp":1355698366,"content":"SPOILER ALERT for those who haven't seen the movie yet.\n\nThe story in the Hobbit movie engages in some heavy \"revisionist\" history, re-writing certain events (like what happened to Azog) to make them more directly relevant to characters in Thorin's company.  \n\nI won't be able to remember specifics here, but I think the story of the Dwarf/Goblin wars is in the appendix of the Lord of the Rings, so break out your copy of the Return of the King.  I'm sure someone else can give you a more precise location.\n\nI haven't personally read an appendix that describes the White Council and the assult on Dol Guldur in more detail than Gandalf gives in the Hobbit.  I think he talks about it after the Battle of the Five Armies, before Bilbo sets off home.  Anyone know where or if one is written?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=735092","commentId":735092,"userName":"richsabre","timestamp":1355721086,"content":"if you want to read the appendices then id recommend reading it all- its worth it. they are in the back of the return of the king books or trilogy books.\n\nthere is pretty much not alot in about what you want- just a timeline\n\ntheres more about the istari and white council in unfinished tales which id also recommend\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=735393","commentId":735393,"userName":"Captain Poe","timestamp":1355762636,"content":"read \"durin's folk\" in the appendices if return of the king. That's also the quest for erebor in either unfinished tales or book of lost tales."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=735870","commentId":735870,"userName":"Captain Poe","timestamp":1355837420,"content":"http://www.nto-ttt.ru/prtrans/erebor/er_orig.shtml [http://www.nto-ttt.ru/prtrans/erebor/er_orig.shtml]\n\n\nGood place to start ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=742895","commentId":742895,"userName":"ShuffleTheDeck","timestamp":1357320335,"content":"Peter Jackson's movies of The Hobbit are rounding out the majority of the backstory of Tolkien's Middle Earth. Taking a short book and turning it into 3 full length movies was the real mystery many of us fans had been wondering about. This first movie has taken chunks of materials from the Appendices and The Silmarillion and provided more content than every included in The Hobbit.\n\nIf you noticed, Frodo in his blue shirt there in the beginning will be turning up at the end of the third Hobbit movie as we'll be ready for Bilbo's birthday party as The Fellowship of the Ring movie starts. Nicely done… but then again Jackson and crew did a grand job the first time around with even a larger amount of material to condense.\n\nRumor has it that in the second Hobbit movie, Smaug will be killed off which leads many to wonder what will be in the third movie other than the Battle of the Five Armies and Bilbo's return home. (IMDB has a reported rumor that Stephen Cobert has a role in the project somewhere, one hopes that Cobert a former D&D player as a kid and a true nerd among us all will be able to find a role somewhere in the movie. Even if he gets torched by Smaug after one line of dialogue!)\n\nGlad to see The Hobbit finally being made as it had many legal stumbles before coming to the theaters!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75719-the-hobbit-the-appendices/?do=findComment&comment=742968","commentId":742968,"userName":"Goblin King","timestamp":1357334590,"content":"http://www.smithsonianmag.com/arts-culture/The-Tolkien-Nerds-Guide-to-The-Hobbit--185546102.html?utm_source=smithsonianinsider&utm_medium=email&utm_campaign=201301-insider [http://www.smithsonianmag.com/arts-culture/The-Tolkien-Nerds-Guide-to-The-Hobbit--185546102.html?utm_source=smithsonianinsider&utm_medium=email&utm_campaign=201301-insider]"}]}