{"url":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/","title":"Grimbeorn&#039;s Quest 1B","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=734929","commentId":734929,"userName":"hendersondayton","timestamp":1355691320,"content":"OK. After I place the 7th progress token…according to the FORCED, The Carrock becomes the active location and I discard the previous active location…if I have enough willpower to place the 6 progress tokens on this location (The Carrock), as a continuation of the quest phase that I placed the 7th progress token on, BEFORE flipping to stage 2 of this quest?\n\nI am trying to plan ahead here…if I end up with at least 7 progress tokens to place (1 to complete Stage 1B of Grimbeorn's Quest), and then 6 to immediately complete the new Carrock location, will this work?\n\nAt this point, I can flip to Stage 2B (Against the Trolls) and avoid the +1 Att and +1 Def. for the Carrock being the active location.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=734953","commentId":734953,"userName":"muemakan","timestamp":1355694883,"content":"No, you place tokens on the active location first and then on the quest card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=735127","commentId":735127,"userName":"hendersondayton","timestamp":1355727299,"content":"According to the Quest card, The Carrock immediately becomes the active location. When you place the 7th progress token it says, make The Carrock the active location. This is BEFORE you flip to Quest 2A. If I still have progress tokens to place, I would have to place them on the Carrock wouldn't I?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=735309","commentId":735309,"userName":"CJMatos","timestamp":1355751400,"content":"hendersondayton said:\n\nAccording to the Quest card, The Carrock immediately becomes the active location. When you place the 7th progress token it says, make The Carrock the active location. This is BEFORE you flip to Quest 2A. If I still have progress tokens to place, I would have to place them on the Carrock wouldn't I?\n\n \n\n \n\n\n\n \n\nNo, because you already had the chance to put tokens on the active location, if there was one. You have already past that phase of the \"put tokens part\".\n\n \n\nIf you were to put tokens on the active location, then, as you are still in the quest phase, you must recalculate the willpower commited to the quest as the effect of Caradhras would have effect.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=735345","commentId":735345,"userName":"hendersondayton","timestamp":1355755560,"content":"I am confused. If I have 20 progress tokens to place….the first one is the 7th token placed on Quest 1B of CaTC…I have 19 more to place…where do those go?\n\nAccording to Quest 1B: \"After placing the 7th progress token on Grimbeorn's Quest, the Carrock becomes the active location. Discard the previous active location. Does this happen BEFORE flipping to 2A?\n\nI still have 19 tokens to place…where do those go? I cannot place them on 2A (or 2B) because I have an active location (The Carrock)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=735383","commentId":735383,"userName":"CJMatos","timestamp":1355761515,"content":"I believe it happens after. At most it is simultaneouswith the forced effect., However the placing of progress hapens, IMO, before of the forced effect that makes Carrock the active location. So the other progress is lost, as it is lost in any other quest that you do and when the progress is higher than the remaining quest points in the quest card.\n\n \n\nThat is how i played it, because if it is not that way, you can in one turn pass the quest and the location. With that you could get rit of the Carrock effect. and make the game more easy.\n\n \n\nAnd i believe that this was not the way the designers intended it to be played. But, again, that is only my opinion. Let's wait for others to give their views.\n\n \n\nPS: In my previous post I mentioned Caradhras when i meant Carrock"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=735469","commentId":735469,"userName":"Angus Lee","timestamp":1355771705,"content":"I have submitted a rule question and got the following reply from Caleb Grace:\n\nHi Angus,\nThere is no \"carry over\" progress when you complete a quest stage. If you made 13 progress and the quest needed only 7, the other six have no effect and are discarded when you advance to the next stage.\nCheers,\nCaleb\nOn Dec 16, 2012, at 10:19 PM, wrote:\n> Message from:\n> Angus LEE\n>\n>\n> E-mail:\n>\n>\n> Rule Question:\n> The card Grimbeorn's Quest (Conflict of Carrock quest card 1B) reads:\n> Forced: After placing the 7th progress token on Grimbeorn's Quest, The Carrock becomes the active location. Discard the previous active location from play.\n>\n> During quest resolution in the quest phase, I have 13 progress tokens to be placed and there is no active location currently. So I place the first 7 tokens on the quest card 1B and trigger its Forced effect, and the Carrock becomes the active location. Since I still have 6 progress tokens to be placed and there is now an active location, do I place these tokens on the active location, or should I change to the next quest card and thus lose those progress tokens since they cannot be carried forward to next quest stage?\n \n\nAnd it is similar in the Redhorn Gate:\n\nThis is the same language as Grimbeorn's Quest and will be treated the same.\n\nOn Dec 16, 2012, at 10:23 PM,  wrote:\n\n\n\n\n> Similarly, the Snowdrifts (the Redhorn Gate, quest 2B) has similar wordings:\n> Forced: After placing the 11th progress token on Snowdrifts, discard any active location. Caradhras becomes the active location.\n> \n> Is it treated the same way as Grimbeorn's Quest? Thank you in advance.\n\nSo there is no placing of progress tokens on the just-become-active-location.  Thank you Caleb!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75723-grimbeorns-quest-1b/?do=findComment&comment=735482","commentId":735482,"userName":"hendersondayton","timestamp":1355772806,"content":"That answers it then. Thanks!"}]}