{"url":"https://community.fantasyflightgames.com/topic/75722-born-aloft-and-gandalf-to-decrease-threat-10/","title":"Born Aloft and Gandalf to Decrease Threat 10","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75722-born-aloft-and-gandalf-to-decrease-threat-10/?do=findComment&comment=734919","commentId":734919,"userName":"hendersondayton","timestamp":1355689605,"content":"I played Gandalf in the Planning Phase…attached Born Aloft to him…then I executed Gandalf's Response and reduced 5 threat….can I then discard Born Aloft, place Gandalf back in my hand….then pay 5 resource to put him back in and then reduce the threat by 5 again?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75722-born-aloft-and-gandalf-to-decrease-threat-10/?do=findComment&comment=734958","commentId":734958,"userName":"Angus Lee","timestamp":1355695243,"content":"Short answer is yes, you can.\n\nJust wanna clarify the sequence you have written in your original post:\n\n1. you play Gandalf from your hand\n\n2. use his Response to reduce threats\n\n3. then you play Born Aloft on Gandalf\n\n4. discard Born Aloft to return Gandalf to your hand\n\n5. play Gandalft and then use his Response to reduce threat\n\nIt will cost you 10 resources to reduce your threat level by 10 this way, however.  If it is not so urgent to reduce this amount of threats, I will suggest you play it the first time, use his Response and play Born Aloft first, then use him for questing/fighting; at the end of combat phase trigger Born Aloft to return him to your hand and play him in your next Planning Phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75722-born-aloft-and-gandalf-to-decrease-threat-10/?do=findComment&comment=735124","commentId":735124,"userName":"hendersondayton","timestamp":1355727156,"content":"Thanks for the reply. In this case it was needed to reduce the threat. I was playing the CaTC, hit the 7th progress token and my threat was over the 34 that the trolls engage at. I needed to lower the threat enough to buy myself some time to plan my \"one by one\" attack of the trolls.\n\n "}]}