{"url":"https://community.fantasyflightgames.com/topic/75776-second-core/","title":"Second Core?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75776-second-core/?do=findComment&comment=735420","commentId":735420,"userName":"horico","timestamp":1355765928,"content":"Okay, although I have understood a second core would helo greatly in deckbuilding, I can't help but ask:\nwhat are the possibilities with this, After thinking about it If you wish to have four decks, they either would have to be mono sphere (which would be lacking some support since very few cards in the core didnt already have three copies of cards) or they would be decks with two sphere variants of the other but at the end (partially because i do not have funds to buy more copies of expansions, i bearly own the ones i have now) wouldnt two of the decks end out being much more powerful than the other two? I've thought about this and buying a second core sounds like a good idea but i cannot help but think this all.\nCan anyone invoke reason into my rant please?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75776-second-core/?do=findComment&comment=735433","commentId":735433,"userName":"AjiTae","timestamp":1355767391,"content":"Meh, i dont have a second core set and i can still beat pretty much all the quests solo. I think you should buy adventure packs are expansions. You'll get more variety in your cards and new quests to try them.\n\nYou can always proxy core set cards if you want to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75776-second-core/?do=findComment&comment=735444","commentId":735444,"userName":"richsabre","timestamp":1355769066,"content":"i also vote for saving for packs instead- much better for growing your card pool. i have only 1 core set and have beaten all of the mirkwood cycle\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75776-second-core/?do=findComment&comment=735665","commentId":735665,"userName":"shoreless","timestamp":1355812663,"content":"It's a tough call, because I really want more of the Core cards (unexpected courage, horn of Gondor, etc.), but even if you find it on sale you are not getting your money's worth because you end up with extra heroes and encounter decks that you can't use. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75776-second-core/?do=findComment&comment=735753","commentId":735753,"userName":"Welbus","timestamp":1355825170,"content":"Get it on Amazon right now for about $20."}]}