{"url":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/","title":"Fundamental &quot;ranged&quot; question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=736394","commentId":736394,"userName":"Couve Timber","timestamp":1355914669,"content":"Just yesterday, a friend and I were playing and had a sharp -- though amicable -- divide on ranged attacks.  We searched the rules and FAQs at the gaming table, and just now I searched the forum and didn't find this question explicitly addressed.  My apologies if we missed it, though:\n\nPlayer A is the first player.  He has a ranged character and uses that ability to attack an enemy engaged to Player B.  In such instance, can Player B \"join into\" the ranged attack?  One of us said yea, the other said Player B couldn't join in because it was Player A's attacking step (although we agreed the two characters could unquestionably join in the attack, if Player A used the ranged ability to join into Player B's attack).\n\nThank you aforehand for your input!  Incidentally, we couldn't convince one another at the time and simply opted for a less controversial strategy :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=736450","commentId":736450,"userName":"muemakan","timestamp":1355920955,"content":"Cannot! But just wait and attack together with player B when it is his turn to attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=736504","commentId":736504,"userName":"Couve Timber","timestamp":1355927907,"content":"I can't remember the specifics now, but when this issue arose, there was some reason why pooling the attack in the first player's \"step\" was preferable/allowed a better result. \n\nFrom our review of the rules and FAQs, there were no explicit statements on this issue -- the arguments on either side were inferential.  In voting for the \"cannot\" side, is that an inference, too?  Appreciate you weighing in on this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=736558","commentId":736558,"userName":"richsabre","timestamp":1355934961,"content":"i would also say you cannot - im not sure where it is in the rules but im sure its the correct answer\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=736623","commentId":736623,"userName":"muemakan","timestamp":1355944345,"content":" \n\n\"A character with the ranged keyword can be declared by its controller as an attacker against enemies that are engaged with other players. A character can declare ranged attacks against these targets while its owner is declaring attacks, or it can participate in attacks that are declared by other players. \"\n\n \n\nPerfectly fine: You can only attack on your turn. So if you range attack another players enemy, the attack must be carried out by only the ranged character.\n\nIf you wait for the other player to declare attacks you can participate in the attack together with his characters.\n\nIf you can ready the ranged character you could first declare an attack on your turn and then again on your partners turn.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=736650","commentId":736650,"userName":"Couve Timber","timestamp":1355948877,"content":"Thanks to both of you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=738788","commentId":738788,"userName":"NotAZombie","timestamp":1356400251,"content":"So I see what you all are saying, but here is where I disagree. As you are reading the rules, say both player A and B have a character with Ranged. Player A attacks first and attacks an enemy engaged with Player B. With your interperetation, Player B could participate in the attack with his ranged character, but could not with a character that is not ranged, even though the enemy is engaged with him. That to me doesn't make much sense with the intent of the ranged as I see it, that you can attack or participate in attacks against enemies not engaged with you, rather than giving the ability to attack out of turn as you are describing. Does that make any sense?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=738789","commentId":738789,"userName":"NotAZombie","timestamp":1356400603,"content":"I just checked the entry in the keyword section of the rulebook on ranged, and I guess as it is written you guys are right. I still don't like it though, because like I described above, if I declare a ranged attack against an enemy engaged with you, you could participate with ranged characters but no others even though the enemy is engaged with you. Oh well. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75883-fundamental-ranged-question/?do=findComment&comment=738817","commentId":738817,"userName":"kennoastic","timestamp":1356419871,"content":"Note the restriction \"…enemies that are engaged with other players.\""}]}