{"url":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/","title":"4 player solo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/?do=findComment&comment=737324","commentId":737324,"userName":"Tracker1","timestamp":1356071782,"content":"I finally tried it.  Anyone else?\n\nI made 4 mono sphere decks, I decided to not use any dwarf heroes, since I did not want to get into too much of a dwarf theme.\n\ni played passage through Mirkwood and journey down the anduin.  It took 3 rounds to beat the former and 5 rounds to beat the later. The hill troll was taken out on the first turn. Wow, never done that before.\n\nSo far, a four player game seems way easier than single player solo, and two handed solo.  One of the things I really enjoyed about it was the amount of cards that were available to play.  It seemed like for each sphere there were always great cards to choose from.  An opening hand of 28 cards gives you a lot of options, and the mono sphere decks, let's you spend at least 3 resources per sphere, so it's easy to pay for those 3 cost cards right away.\n\nI did not find drawing 4 or mor cards per turn to difficult to handle, an could easily quest for 20 and attack for well over 10 each round.  \n\nNot saying much to beat the first two scenarios, but dol gulder is next and I'm looking forward to playing it on the Numenor expansion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/?do=findComment&comment=737401","commentId":737401,"userName":"Alex6222","timestamp":1356085539,"content":"Well i only tried it once against Passage throug mirkwood, but i think is too much for one player (well at least for me). I play solo two-handed and some times it can get a little crowded. But if you like it keep going, it would be interesting to see how it goes agains dol guldur. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/?do=findComment&comment=737610","commentId":737610,"userName":"Tracker1","timestamp":1356118731,"content":"Update on Dol Guldur.  Completed it in 5 rounds.  The nazgul was was destroyed in one round.  Compared to solo one hand, this was a breeze. I've only beat this scenario solo a few times that way, but with the four mono sphere decks I beat it first go around.  \n\nI'm really curious how this will work out on the other scenarios. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/?do=findComment&comment=737617","commentId":737617,"userName":"gatharion","timestamp":1356120005,"content":"You're talking about playing a solo game, but using four different decks? (So up to 12 different Heroes?)\n\n \n\nEscape from Dol Guldor is exttemely difficult in solo play (single deck), but gets expontentially easier as you add players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/?do=findComment&comment=737624","commentId":737624,"userName":"Raven1015","timestamp":1356120951,"content":"Never tried it myself, mainly because of space reasons (and I like the balance and simplicity of 2 decks solo), but I imagine I'll eventually give it a try as a novelty. Interested to see your experience with the other quests. I've heard that generally 4 player makes most quests easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/?do=findComment&comment=737645","commentId":737645,"userName":"Tracker1","timestamp":1356125724,"content":"gatharion said:\n\nYou're talking about playing a solo game, but using four different decks? (So up to 12 different Heroes?)\n\n \n\n\n\nYeah, that's what I'm doing.\n\njust tried peril in pelargir.  I Lost miserably the first game, but managed a win the second, but still very difficult.  The leaping fish active location in the first round is dreadful when you draw 4 cards many of which are enemies which are added to the staging area, and then you do your normal draw of 4 cards, and I forgot to mention that there are already 4 thugs in the staging area to start.  My starting threat for each deck sky rockets, and the 6 or more enemies come crashing in.  Really tough in 4 player mode.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/75987-4-player-solo/?do=findComment&comment=737702","commentId":737702,"userName":"Glaurung","timestamp":1356141959,"content":"Tracker1 said:\n\ngatharion said:\n\n \n\nYou're talking about playing a solo game, but using four different decks? (So up to 12 different Heroes?)\n\n \n\n \n\n \n\nYeah, that's what I'm doing.\n\njust tried peril in pelargir.  I Lost miserably the first game, but managed a win the second, but still very difficult.  The leaping fish active location in the first round is dreadful when you draw 4 cards many of which are enemies which are added to the staging area, and then you do your normal draw of 4 cards, and I forgot to mention that there are already 4 thugs in the staging area to start.  My starting threat for each deck sky rockets, and the 6 or more enemies come crashing in.  Really tough in 4 player mode.\n\n \n\n\n\nthere is copule of things yu must pay attention. In Core set and Shadow of Mirkwood cycle all quests is geting easy with number of players. This was a big problem in the time of first cycle. But start from Khazad-Dum and second cycle things change and some quests geting more harder with number of players.\n\nVery good example is Flight from Moria, Long Dark, Red horn Gate, Foundation of stone. Those quests geting much harder with number of players special more then 2 players. But Shadow and Flame is geting more easy with number of players.\n\nHeir of Numenor and new cycle is very difficult cose encounter cards is very powerfull! So here is good balance is very difficult with any numbers od players. So for now the designers finally found a good balance and scaling."}]}