{"url":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/","title":"Peril in Pelargir questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/?do=findComment&comment=737728","commentId":737728,"userName":"DevastazioneH88","timestamp":1356148992,"content":"I haven't understood a few things so I wanted to share my points :\n\n \n\n1) When Harbor Thug is already engaged with a player does he engage another player if that other player's threat is raised ? (I think he does)\n\n \n\n2) The shadow effect on Picpocket says \"discards one of his attachments\" instead of the usual \"an attachment he controls\" so I guess this shadow effect doesn't discard Local Trouble…or does it ? (I'm only puzzled because they've changed the way they're phrasing it and we know how important phrasing is in card games)\n\n \n\n3) If there are no cards in the encounter deck when Collateral Damage forces me to discard two cards from the encounter deck shall I reshuffle my discard pile back into the encounter deck or does it get no effect ?\n\n \n\nthaks !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/?do=findComment&comment=737873","commentId":737873,"userName":"Kroepian","timestamp":1356179656,"content":"1) Yes they always engage the player with the hero carrying the scroll as soon as he raises his threat. Even if he was engaged with another player before (through Son of Arnor e.g.)\n\n2) Condidtions are always attatchments, so you can discard \"local trouble\". The Black Uruks (Misty Mountains) also allowed you to discard a attachmant (you dont have to control it)\n\n3) When \"collateral damage\" is revealed in the quest phase (which it usually is) and there are no more cards in the encounter deck you shuffle the encounter discard pile and use it as your new encounter deck. The deck encounter deck cant run out in the quest phase (p.25)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/?do=findComment&comment=737911","commentId":737911,"userName":"DevastazioneH88","timestamp":1356185942,"content":"You're right but this particular shadow uses the word \"his\" while former cards either said \"an attachment he controls\" (so you could not discard a condition) or simply \"an attachment\" (in which case you could discard a condition)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/?do=findComment&comment=737930","commentId":737930,"userName":"Kroepian","timestamp":1356188577,"content":"okay i think i figuered it out and have to correct myself. The word \"his\" indicates, that the player owns the attachment.\n\nthe rulebook says on p. 25 \"a player owns his heroes and the cards that he has chosen for the player deck he is playing\"\n\nSo you don't own conditions (they are from the encounterdeck, not playerdeck) and cannot remove them with this shadow effect.\n\nthat is the best i can come up with so far"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/?do=findComment&comment=737995","commentId":737995,"userName":"DevastazioneH88","timestamp":1356198291,"content":"Yeah I thought so too but since they've changed their way of phrasing it I was a bit unsure. Thanks !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/?do=findComment&comment=740207","commentId":740207,"userName":"Ted Sandyman","timestamp":1356790833,"content":"Does this rule also relate to a Ranger Spike? I threw one into the staging area in my game last night then got that card which discards an attachment. I then removed it from the Brigand i had spiked and he came down to kick some ass. Hmmm, did i play that right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76048-peril-in-pelargir-questions/?do=findComment&comment=740335","commentId":740335,"userName":"GrandSpleen","timestamp":1356818581,"content":"Yeah, the player still controls attachments that he/she has played on enemies.  Forest Snare is another example."}]}