{"url":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/","title":"Grrrrrrrr!  Escape From Dol Guldur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=742006","commentId":742006,"userName":"Mr Ruffles","timestamp":1357168103,"content":"Got the core game for my wife for X-mas.  We have been playing it nonstop, but Escape From Dol Guldur has been kicking our butts.  We have made custom decks with what we have from the core set but it doesn't seem to help.  Granted I think we have had some unlucky draws from the encounter deck, but is this quest beatable with just the core set?\n\n \n\nAlso when drawing cards for the 3 guarded items when starting, do you resolve the Treachery cards as drawn?  So if you get caught in a web do you put that on someone before you even start?  Or are we doing it wrong and the guarded items only get Enemy cards?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=742024","commentId":742024,"userName":"flightmaster101","timestamp":1357170709,"content":"I have a post on playing solo with two decks.  One of my rules is I can only use cards already published for the quest.  So I have done it with just 1x core.  I haven't made a post of the deck list I used, but I did do it.  My heroes were 1. Legolas, Denethor, Breavor and 2.  Eowyn, Dunhere, Theodred.\n\nAnd yes you must resolve treachery cards at the initial draw.  Use the Miner of the Iron Hills to get rid of those webs, and if you know it's a problem game after game TAKE YOUR MULLIGAN!!!!   Many of my decks strategize around certain cards so if I don't get that card or a card that can help me get to the card I need I take a mulligan.  You only get one, but it is worth it to use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=742027","commentId":742027,"userName":"flightmaster101","timestamp":1357171183,"content":"Just to clarify on page 24 of the rules in the support section of the LOTR LCG on this web page it tells you how to resolve treachery cards on guarded cards. So yes a treachery card can guard an objective and does so until resolved or canceled.  \n\nI looked at my previous post and realized I didn't answer that very well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=742028","commentId":742028,"userName":"danpoage","timestamp":1357171368,"content":"Enemies, locations and treacheries can all guard an objective. Enemies and locations must leave play (typically by defeating the enemy, or traveling to and then resolving the location, respectively) before you can claim the objective. With treacheries you resolve the when-revealed effect immediately and then the objective which the treachery was assigned to is considered unguarded. So yes, Caught in a Web can be put on a hero during setup of this scenario. Since you don't have any resources yet during setup, there is no way to cancel this with a Test of Will so unless you are playing Eleanor as one of your heroes, you are in for a rough time.\n\nThis quest is difficult using only the core set, but it is beatable. In the Strategy and Deckbuilding forum there are several suggestions for decks tuned specifically to beat this scenario which use only 1 core set. Here is just one example:\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=285&efcid=4&efidt=748979 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=285&efcid=4&efidt=748979]\n\nWelcome to Lord of the Rings LCG, and good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=742042","commentId":742042,"userName":"Mr Ruffles","timestamp":1357173728,"content":"We used Gimli, Legolas, and Aragorn in one deck and Eowyn, Gorlfindel, and Beravor in the other.  Did awesome against the other two quests  But it's pretty rough missing one random hero with those decks for the Dol Guldur quest. \n\nI'll try the two decks with those heros and hit up the other area for info.  I cant wait to get the hunt for gollum quest line to try out more cards and quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=742197","commentId":742197,"userName":"flightmaster101","timestamp":1357207732,"content":"Mr Ruffles said:\n\nWe used Gimli, Legolas, and Aragorn in one deck and Eowyn, Gorlfindel, and Beravor in the other.  Did awesome against the other two quests  But it's pretty rough missing one random hero with those decks for the Dol Guldur quest. \n\n\n\n \n\nI'm surprised you made it through Journey Down the Anduin with those heroes.  That is some pretty high starting threat.  I try to only have one high threat hero in a set of three.  I also think about the first round while picking heroes: who quests, who defends, and who attacks in case i cant get any allies out the first round.\n\nMy advice is just run through the first quest card and keep your threat low until you get your hero back.  And if you think its tough getting through EFDG missing 1 of 6 heroes try it solo missing 1 of 3 heroes (ouch!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=742356","commentId":742356,"userName":"Mr Ruffles","timestamp":1357234727,"content":"flightmaster101 said:\n\n And if you think its tough getting through EFDG missing 1 of 6 heroes try it solo missing 1 of 3 heroes (ouch!).\n\n\n\n \n\nNo bueno!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=745836","commentId":745836,"userName":"Dain Ironfoot","timestamp":1357832910,"content":"Hi Mr Ruffles! Escape is definitely a tough quest.\n\nYou might find this video series helpful: http://www.youtube.com/playlist?list=PL6agV3Ll1nNihJiCSotL0itNwUiiXkF2t [http://www.youtube.com/playlist?list=PL6agV3Ll1nNihJiCSotL0itNwUiiXkF2t]\n\nor: tinyurl.com/lotrprogressionseries [http://tinyurl.com/lotrprogressionseries]\n\nThe players use three core sets but it should still be helpful! Enjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=746786","commentId":746786,"userName":"Cutievalkyrie","timestamp":1358000991,"content":"In a word, buy more expansions to make the game much easier pls…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=746935","commentId":746935,"userName":"shoreless","timestamp":1358026180,"content":"Cutievalkyrie said:\n\nIn a word, buy more expansions to make the game much easier pls…\n\n\n\nThis is very true, but the COTR progression series shows it can be done with just the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76621-grrrrrrrr-escape-from-dol-guldur/?do=findComment&comment=746975","commentId":746975,"userName":"Duftpunk","timestamp":1358036470,"content":"Yes it can be done :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] however I have never managed to do it myself. I was so close yesterday got my tactics deck running at full speed. I was ready to take down nazgul in 1 turn as he appears with gimly with citadel plate on and 8 dmg on him, 4 other allies with 1-2 HP. During staging I got Necromancers reach and then hummerhorns as a shadow card for nazgul later. Total blowout. From group of 3 heroes and about 4 a bit roughed up allies I ended up with Just legolas and one Horseback archer. Game over. Amazing how powerfull and ready I felt for the nazgul. I was counting I could deal about 19 dmg to him in 1 turn. And just like that, game over. Gonna properly analyze the encouter deck to make sure I've got answer for everything."}]}