{"url":"https://community.fantasyflightgames.com/topic/76908-base-game/","title":"Base Game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=744050","commentId":744050,"userName":"Cigar","timestamp":1357572535,"content":"Hello everyone,\n\n \n\nI've been interested in trying this game out for some time.  I was going to purchase the Base game but noticed it is \"Not Yet Available\" on FFG, then I checked Coolstuffinc. and didn't see it on there either.  I did, however, find it on Amazon.  But I'm somewhat leary by FFG's out of stock description and wondering if they are starting to phase the game out?  Does anyone know about this? \n\nAlso I'd like to get someone's overall opinion of the game.  If you've bought expansions in the double digits than I would very much value your opinion.  I'm just curious if this is a game worth getting into.  I'm the type of gamer who is obssessive about collecting everything and considering how many expansions there are, that would become quite the investment.  Any detailed review(s) of the game would be most welcome, veteran or not!\n\n \n\nThanks a bunch!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=744081","commentId":744081,"userName":"CJMatos","timestamp":1357576648,"content":"I believe that FFG is reprinting the Core and the first cycle of AP's.\n\n \n\nIf you love Middle Earth and Tolkien's book, then i'd say get right now into it.\n\n \n\nAs a game, it is good anda has a co-operative side that doesn't exist on any of the other LCG's. Also it has some good mechanics.\n\n \n\n \n\nIn the overal, the game is improving a lot and i believe that there isn't any quest that will not give you some fun in playing….\n\n \n\nIf you decide to buy, then i counsel  you to buy in the order that the game has been released.\n\n \n\nDo not skip packs because the later will became very difficult if you fail to have all the previous cards…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=744085","commentId":744085,"userName":"jc1138","timestamp":1357577352,"content":"I haven't been playing the game too long, but I have all of the released material.  It's a great game, with different quests to provide a lot of replay value and to encourage creative deck building.  I've played a fair few card games (collectable, trading, you name it) over the years and this is a terrific one.  I especilly love the solo play feature.\n\nI very much doubt FFG is phasing this game out, as they have many announced expansions in the works (plus the added interest in Middle-earth due to the new Hobbit film(s)--screw the critics, I loved it!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=744107","commentId":744107,"userName":"Cigar","timestamp":1357579574,"content":"I agree with you jc, The Hobbit film was great! \n\n \n\nI should have clarified that while the cooperative features seems awesome and probably is how the game is designed to play (primarily) I will most likely be playing it solo most of the time.\n\nCJMatos:  Your reasoning behind why they are not in stock makes sense to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=744400","commentId":744400,"userName":"richsabre","timestamp":1357629150,"content":"hello\n\ni have been playing this game from the start of its release….i have every pack to date and over 2000 posts on this forum so consider myself a serious player.\n\ni would say i am very obsessive about this game, mainly for its tolkien element which is why i bought it in the first place….so my first point is that if you love tolkien, more specifically the books (the game's lore friendly) then certainly get this game.\n\nsecond point, if you are a new gamer (which it doesnt seem you are) or even an experience one, prepare to lose alot in the early game. this game really does need you to have a decent card pool i.e. quite a few packs, so if you are going to buy core set, then you may as well get some packs while youre at it\n\ni would just go in order for the storyline but thats just me\n\nthe player scaling is where this game gets worst reviews….its very hard solo, medium 2 player and then (most) quests get easier with 3/4 players though it looks as if ffg are changing this and things have certainly improved since core set\n\ni have managed to beat all quests to date solo apart from the last core set quest (which is almost impossible with core set cards), one of the print on demand sets (again near impossible). i have however beaten the former of those 3 player so you can see how things get easier\n\nif this seems like a problem then i recommend playing solo 2-handed, i do this all the time and prefer it to ordinary solo play\n\nthe theme and artwork of this game is where it really shines. amazing artwork to protray an amazing story. the story doesnt of course follow the books but each quest has that authentic tolkien feel about them.\n\nthe amount of cards you get in a small pack feels about right. 60 cards in total, im not sure how many are player cards are in each pack (i think about 21, with 3 copies of each card..so basicaly around 7 new types of card per pack) but its about right so things dont go too fast. the other cards are the quest cards which gives you a fully playable quest per pack\n\nthe bigger packs are what you need to play the smaller ones which make up a cycle. the first cycle (mirkwood) you do not need a big pack as the core set acts as this, but if yuo want to buy any packs from the dwarrowdelf cycle then you need the big pack- khazad dum\n\nhope this helps\n\nrich\n\nPS- there is no reason to think this game is being phased out- i believe it is doing very well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=744460","commentId":744460,"userName":"Captain Poe","timestamp":1357634979,"content":"As others have said, the game does not appear to be phasing out any time soon. We just got a new big box expansion based on gondor. We have 7 new adventure packs planned out over the next few months. There is another big box expansion for the second half of the hobbit on its way. New league play rules were just released with \"Nightmare Mode\" cards to make the core set harder to play for people who have all the expansions. Thats a lot of matieral set for this year, so I would say there is no indiciation that this game is going anwhere soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=744598","commentId":744598,"userName":"CJMatos","timestamp":1357648883,"content":"Captain Poe said:\n\nAs others have said, the game does not appear to be phasing out any time soon. We just got a new big box expansion based on gondor. We have 7 new adventure packs planned out over the next few months. There is another big box expansion for the second half of the hobbit on its way. New league play rules were just released with \"Nightmare Mode\" cards to make the core set harder to play for people who have all the expansions. Thats a lot of matieral set for this year, so I would say there is no indiciation that this game is going anwhere soon.\n\n\n\n \n\n6 new Adventure Packs…\n\n \n\nAs i said before, this is a game that will likely stay active for a lot of time. And that is because FFG has chosen to create new scenarios that are different from the books, but also remain linked to them, as you can see for instance with the Core quests (something related to the discovery of Sauron as the Necromancer living in Dol Guldur), with the first set of adventure packs,  Shadows of Mirkwood (retraces the hunt and capturing of Gollum by Aragorn at Gandalf's request) or with Kazhad-Dum and Dwarrowdelf cycle, in the search for the fate of Balin's attempt to recolonize Moria…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=746897","commentId":746897,"userName":"Trismich","timestamp":1358019318,"content":"Love this game! Me and my wife are both massive Tolkien fans, and this game really has that Tolkien vibe about it. If you are into middle earth and card games its highly recommended!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=747016","commentId":747016,"userName":"Migwald","timestamp":1358049777,"content":"I would recommend this game if you are into Tolkien. I'm fairly new to the game (and card games in general), but the quality of the artwork, variation in the quests that come out and the fact that it's co-op make it great fun to play. The game is very tough, particularly solo, so be prepared to lose more than you win……just makes you more determined to beat it next time! The game community is very helpful and I can't recommend the game highly enoughsonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]\n\nI've bought the quests in the order they came, except the first Hobbit saga, which is sort of out on its own a bit and I'm finding it pretty tough but very enjoyable. Maybe get a core set and the first 2 or 3 adventure packs from the Mirkwood cycle to see how you like the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=748214","commentId":748214,"userName":"SOGra","timestamp":1358297456,"content":"This is my very first FFG Forum posting, and I wanted to chime in on this thread. \n\nI am a wargamer of old, a boardgamer of the FFG and Mayfair variety over the last 3 years, and never a cards game player (I leave that fun to my two older sons who have gone the route of Pokemon and Magic). But this game caught my eye, and the more I read, it caught my interest. So earlier this month I bought the game base set and a couple of the first adventure packs (Mirkwood 1-4) for my wife and I (in our 50s), and we both love it and are hooked. We have not yet made it out of the first 3 scenarios that come with the game, but we are enjoying it and plan to get all expansions as we can. What drew me in was the co-op play (she prefers co-op instead of competitive her vs me), and the fact it was Middle Earth….we are huge Middle Earth fans. I even tested it out with my younger son (21), and he agreed we had a winner. \n\nSo there you have it. A 50s non card gamer who bought a card game and loves it. And I am a hard sell, never once being interested in trying Magic the Gathering. FFG did a great job with this one, designing a great playing game, requiring lots of thought, and capturing that Middle Earth ambiance to play in. With the support FFG is currently giving it, and with the Hobbit movies still coming over the next 2 years, this product line is still in the early stages of its life cycle. It will not be disappearing anytime soon. Buy it, and enjoy!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=748485","commentId":748485,"userName":"Cigar","timestamp":1358343830,"content":"Thanks again for all the replies.  You guys sold me!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=751900","commentId":751900,"userName":"SOGra","timestamp":1358898586,"content":"Cigar…After you have spent some time learning and playing it after you buy it, come back here to the Forum in this thread and update us on your impressions and how much you liked or disliked the game, and for what reasons.\n\nMy wife and I are still enjoying it, and loving the familiar Middle Earth setting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=752894","commentId":752894,"userName":"Nizi","timestamp":1359037908,"content":"I also just got it (quite late), and loving it. Started out soloing, which didn't work out well at the beginning using the core decks, although I am a somewhat experienced cardgamer. I need to play 2 core decks for the second scenario in order to beat it. Will soon play with some friends, ordered some expansions, and will probably keep buying their stuff until it gets stale. I, too, have seen many games and am a hard sell. That must mean something. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=754902","commentId":754902,"userName":"Cigar","timestamp":1359377805,"content":"Hey SOGra,\n\n \n\nThanks for replying to my thread, I'm honoredthat  I inspired you to do so!\n\nI went ahead and bought the core set, and so far I'm loving it.  Unlike a lot of FFG's other LCGs, LoTR card game seems to have a much better value, not just in its solo capability but in how unrestricted you are in building decks (to a degree).\n\nThat's not to say it was smooth sailing.  The rulebook--while adequate in teaching the basics--left me scratching my head on a lot of the finer points of the game.  I found a pdf file on BGG that showed rulings each card in all the sets save for Heirs, and that was a godsend.  If it weren't for that, I would have been really frustrated with figuring out certain timing aspects among other things.\n\nWith a card like \"Guard of the Citadel\" I have to wonder why you would ever use it.  It's arguably the worst ally in the base set.  At a cost of 2 resources, it has 1 willpower, 1 attack, 0 defense and 2 health with no abilities.  Then compare it to the Erebor Hammersmith which also has a cost of 2, with 1 willpower, 1 attack, 1 defense, 3 health AND a discard pile fetch ability.  Now i realize these belong to two different spheres, but that doesn't change the fact that the hammersmith is better not just in one category, but three!  The only redeeming quality to the Guards would possibly be it's \"Gondor\" trait, but I can't imagine that its usefulness warrants it's gimped (by comparison) stats.  I digress…\n\n \n\nThe game is fantastic and I'll be looking forward to more expansions, I just wish the rulebook had been more thorough as well as the card ability descriptions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=755743","commentId":755743,"userName":"SOGra","timestamp":1359494935,"content":"I agree. Love the rulebook, but there are things missing.\n\nThe one that got me for a while was whether an engaged enemy that survived the first round it is engaged, counts as a threat when calculating Quest point differences. I was not sure, and the wording is not clear, nor referenced. But on the FFG game site in Support in the FAQ is a clarification (that like locations that leave the staging area), engaged enemies from the previous round are not considered in the staging area and do not count in the Quest calculations. Because it was not clear in the rules, my son and I assumed otherwise the first time we played, and we lost the first scenario together by the barest of margins, which would have been won so much sooner had we known engaged enemies threat levels do not count in Quest computations in the Quest phase, which would have allowed us to reach our quest objectives instead of losing. \n\nThere are other things. A guide for each cards effects in the game box would have been nice so you can just look up a deeper explantion of the effects of a card should the card explanation seem too brief. I am still trying to figure out what a Gondor trait is, I can't find it in the rules. Perhpas it is in the FAQ, and I have not read through them all yet. The other traits are well explaned…ranged, sentenel, etc. But I did not find a Gondor trait. So for me the card that gives my hero the Gondor trait is useless. No idea. \n\nI have initially only been playing solo with each 30 card group by themselves in the first scenario. I am doing that so i can understand the differences, strengths and weaknesses of each group against the same basic scenario. I am learning a lot that way. Eventually, we will move on to a full 50 card deck for my wife and I, combining hero groups. \n\nI must admit that I am liking the challenge and the game. I play on a Lord of the Rings Risk game board (essentially used as a solo game mat), and listen to the LOTR soundtracks from all 3 movies on my I-Pod for rich atmosphere. Really really cool. \n\nThere is a lot of game play in the Base game. Of course it only wets your appettite. Along those lines, I have completed my total Mirkwood AP (1-6) purchases, so we have a lot of gaming in front of us. We will aim for Kazad-Dum once we are well on our way through the Mirkwood APs. \n\n \n\n \n\n \n\n. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=755760","commentId":755760,"userName":"Raven1015","timestamp":1359498775,"content":"The \"race\" keywords like Gondor, Noldor, Dwarf, Hobbit, etc. do not have any effects by themselves. However, other cards refer to them sometimes, like the event For Gondor!, which gives stat bonuses to characters with the Gondor trait. \n\nThere are also \"class\" or \"job\" keywords like Warrior, Noble, Scout, etc., which also have no effects by themselves, but only come into play when other cards directly refer to them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=755761","commentId":755761,"userName":"GrandSpleen","timestamp":1359498876,"content":"Yes, the Guard of the Citadel is a pretty weak ally, and served only as a \"chump blocker\" in a pure leadership deck when the Core set first came out.  The Gondor trait was not developed further until recently -- the new Heirs of Numenor box is all about Gondor, and this guy can find a place in a Gondor-themed deck nowadays.  I'm sure that theme will continue to be developed over the next several adventure packs.  But don't go out and byu Heirs of Numenor -- it's best described as \"super fantastically hard\" if you haven't built up your card base by buying the intervening adventure packs.  \n\nIt's not a subtle business model.  Later-released quests are generally much more challenging if you haven't been \"keeping up\" with your purchases."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76908-base-game/?do=findComment&comment=756322","commentId":756322,"userName":"Cigar","timestamp":1359571582,"content":"@ SOGra:  I was making that same mistake during my first several games.  It made a huge difference, and thus made the game more manaeable when I played the step of engagment… correctly.\n\n@Spleen:  Thanks for confirming my suspicions.  Based on your experience, and I'm assuming you have several expansion for the game, what percentage of \"deck-building\" cards would you say are generally useful?  That is to say, how many are considered for decks you build versus those that are automatically discarded due to being comparatively bad?"}]}