{"url":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/","title":"A New Lord of the Rings LCG Blog: Hall of Beorn","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=744096","commentId":744096,"userName":"danpoage","timestamp":1357578717,"content":"I've recently started a Lord of the Rings LCG blog:\n\nhttp://hallofbeorn.wordpress.com/ [http://hallofbeorn.wordpress.com/]\n\nTake a look and let me know what you guys think. Feedback is much appreciated!\n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=744171","commentId":744171,"userName":"jc1138","timestamp":1357587644,"content":"Impressed with the content so far.  Keep up the good work!  I like the depth and length of the articles, especially how you discuss the virtues of underappreciated cards.  Some great coverage between your new blog, Tales From the Cards, and Cardboard of the Rings podcast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=744644","commentId":744644,"userName":"danpoage","timestamp":1357653594,"content":"Thanks jc!\n\nYeah, I'm really trying to go in-depth on the strategy and deck-biulding concepts. Many people have commented that this game is difficult, so I want to provide a more thorough analysis of what goes into building a successful deck. I also really enjoy making more thematic decks, I really like that this game, like most FFG games, lets you decide where on the thematic -> powerful spectrum you want to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=744926","commentId":744926,"userName":"Mr Ruffles","timestamp":1357688770,"content":"I shall check it out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=745062","commentId":745062,"userName":"just Logan","timestamp":1357719220,"content":"You mean how nedly vs Jaime you want to play. I heard .cardgamedb.com was seeking new contributers maybe you should check that; it's the place I to for LCG news and your stuff is definitly worth being spread as much as possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=746568","commentId":746568,"userName":"leeroyer","timestamp":1357958955,"content":"I just looked at your blog and I must say that it's amazing.. I love the number of decks for inspiration and I think that you really did great job and I hope that you will continue… \nI would just like one more thing (I don't know how hard to do is it however) - it would be great if you could manage to do this - when I am on some card with my cursor it could show it so I don't have to click on it. Somehow like when you check decks at cardgamedb.com ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=747716","commentId":747716,"userName":"danpoage","timestamp":1358175460,"content":"Thanks leeroyer! I will look into displaying the card image when you hover your mouse over a link. Unfortunately, with the version of WordPress that I am using for this blog, I don't know that I can get full access to the unerlying HTML to add this kind of javascript that would enable this feature. Again, thanks for your support, I'm glad that you are enjoying the blog, I will see what I can do to improve the markup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=747717","commentId":747717,"userName":"danpoage","timestamp":1358175520,"content":"Thanks leeroyer! I will look into displaying the card image when you hover your mouse over a link. Unfortunately, with the version of WordPress that I am using for this blog, I don't know that I can get full access to the underlying HTML to add the javascript that would enable this feature. Again, thanks for your support, I'm glad that you are enjoying the blog. I will see what I can do to improve the markup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=747724","commentId":747724,"userName":"HeavyKaragh","timestamp":1358180336,"content":"Yeah, great content danpoage, worth reading. It's getting hard to keep up with that many posts in your blog and in Tales from the Cards. Keep up the good work! cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=747763","commentId":747763,"userName":"hendersondayton","timestamp":1358188319,"content":"For me, this blog is perfect. I have long said that I love LOTR:LCG but I just don't have the time to dedicate to deck building. I like finding decks others are willing to post and trying them out. What seems to be missing from most of the decks I find are the creators suggestions for how best to use their decks.\n\nThis is what you have done, and I am grateful. You have posted what seem to be very well made decks. Then you have gone further and added your instructions for use.\n\nKeep this coming!\n\nI will add a suggestion for what I personally would like to see but have not found yet. Perhaps you have time to take on the task:\n\nI have searched all over and have \"yet to find\" a write-up by someone on the type of deck needed for each Quest in the game.\n\nEach Quest (IMO) puts a different requirement on your deck building skill. For example, some would require more questing power. Some may require you to have lots of strength in Ally's in order to defend or attack (CaTC perhaps). Some would require you to manage threat, etc.\n\nJust a thought for a future addition!\n\nThanks for your work!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=748189","commentId":748189,"userName":"danpoage","timestamp":1358293641,"content":"Thanks hendersondayton! I agree that it always help me to appreciate a deck better when the creator has explained the reasoning behind particular card choices and how they play the deck. You are in luck, I am planning on doing a deck list series for The Core Set, each of the Deluxe Expansions, and then the Adventure Pack Cycles. Unfortunately I am going to be busy for a bit, and it really takes time to go through each of these scenarios again, and build appropriate decks for each one. Be on the look out for the first in the series, but also know that it will be a while as I work through each of the expansions and APs.\n\nAlso, one question for the community at large, for the scenario-specific decks, would everyone prefer if I limited each deck to only cards that were printed as of that expansions/AP (e.g. Heirs of Numenor cards would only be included in decks for the Heirs of Numenor quests -- no using Beregond in decks for Shadows of Mirkwood or Dwarrodelf cycles), or would you prefer the deck be a free-for-all where any printed card is fair game?\n\nI am glad to hear that people are enjoying the blog. Please, feel free to leave comments, feedback and suggestions in the articles that you enjoy most.\n\nThanks!\n\nBeorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=748372","commentId":748372,"userName":"hendersondayton","timestamp":1358330643,"content":"danpoage said:\n\nBe on the look out for the first in the series, but also know that it will be a while as I work through each of the expansions and APs.\n\n\n\nLooking forward to it.\n\n \n\ndanpoage said:\n\nAlso, one question for the community at large, for the scenario-specific decks, would everyone prefer if I limited each deck to only cards that were printed as of that expansions/AP (e.g. Heirs of Numenor cards would only be included in decks for the Heirs of Numenor quests -- no using Beregond in decks for Shadows of Mirkwood or Dwarrodelf cycles), or would you prefer the deck be a free-for-all where any printed card is fair game?\n\n\n\nPersonally, I would like to see less of a deck build and more of a list of things that should be considered when building a deck for a specific quest. For example….take HoEM…obviously with this deck, players will need to deal with locations so cards that aid in adding progress or questing aids will be important. Instead of suggesting specific cards, work on suggesting \"types\" of cards…(IE - Cards that add progress tokens…)…this way, people could build decks with that they have and you yourself don't have to worry about suggesting cards not everyone would have….\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=748628","commentId":748628,"userName":"danpoage","timestamp":1358360052,"content":"On a related note, in my latest post have provided a timeline of Middle-Earth with cross-references to the cards of Lord of the Rings LCG. This will make it a lot easier to provide context for the expansion and adventure pack scenarios as I go through them in order. Take a look, and let me know what you guys think.\n\nhttp://hallofbeorn.wordpress.com/2013/01/16/lore-lord-of-the-rings-lcg-timeline/ [http://hallofbeorn.wordpress.com/2013/01/16/lore-lord-of-the-rings-lcg-timeline/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=749702","commentId":749702,"userName":"leeroyer","timestamp":1358517783,"content":"I have been reading your blog again and I think that it would be pretty nice if you could make another bookmark (as Home and About on the top) for Decks, where could be links for the articles.. I know that you have got them on the leftsdie in category, but I think that this option is little bit less comfortable. Btw you are still surprising me.. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=749824","commentId":749824,"userName":"danpoage","timestamp":1358531952,"content":"This is a great idea!\n\nI've gone ahead an added a Decks page here:\n\nhttp://hallofbeorn.wordpress.com/decks/ [http://hallofbeorn.wordpress.com/decks/]\n\n \n\nEnjoy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=751719","commentId":751719,"userName":"danpoage","timestamp":1358872376,"content":"If you've ever wondered who I would most want to have my back during a bar fight, now you know:\n\nhttp://hallofbeorn.wordpress.com/2013/01/21/who-would-i-most-want-to-have-my-back-in-a-bar-fight/ [http://hallofbeorn.wordpress.com/2013/01/21/who-would-i-most-want-to-have-my-back-in-a-bar-fight/]\n\n \n\nCheers,\n\nBeorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=751880","commentId":751880,"userName":"jc1138","timestamp":1358895025,"content":"I'm liking that Tactics Boromir (one of my fave characters)/Nori/Bifur deck.  Boromir is a lot of fun to mess around with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=751988","commentId":751988,"userName":"Glaurung","timestamp":1358917817,"content":"jc1138 said:\n\nI'm liking that Tactics Boromir (one of my fave characters)/Nori/Bifur deck.  Boromir is a lot of fun to mess around with.\n\n\n\nMe too. Really wonna try it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=752160","commentId":752160,"userName":"hendersondayton","timestamp":1358940008,"content":"It would be awesome to have files for each of your deck builds.\n\nOCTGN, LOTR Deck Builder, and CardGameDB in particular. I would suggest LackeyCCG but nobody keeps this plugin updated anymore (which is why I switched to OCTGN). Vassal Engine also has a module but I don't see that being updated either.\n\nViewers of your blog could download the deck for use in OCTGN, in the LOTR Deck Builder, and also find the file on CardGameDB.\n\nI understand you have enough on your plate as it is, so this is just a suggestion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=752859","commentId":752859,"userName":"danpoage","timestamp":1359033664,"content":"Thanks guys! I am glad that you like the Boromir deck. I wanted to make a fun, and different way to use a great hero. I definitely feel that Tactics Boromir is, at this point at least, superior to the Leadership one from Heirs of Numenor. We'll have to see what else comes out in the upcoming chapter cycle to make Gondor more viable as a deck archetype.\n\nAs for the deck files, I definitely want to make it easier for people to access the decks so I'm glad to hear suggestions. I'm not sure which sites/formats would be most useful to people so maybe I'll put that up as my next poll. It doesn't make sense to convert all of my decks to three or four different formats if only a few people are going to use them. A bear's got to eat and sleep too :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThanks again for the encouragement everyone, and I will look into the best way to can provide more community resources.\n\nBeorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=753245","commentId":753245,"userName":"monkeyrama","timestamp":1359091443,"content":"Just want to add my gratitude for the awesome blog. The decks you post are really great to read, and have opened up my eyes about things I can do with decks (gets so hard not to get stuck in a rut of the same old themes). Keep it up!!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAlso, sadly have to agree about Gondor decks. I'm trying to make a pair of Gondor decks, but the stats of the allies, even with the Boromir boost, just aren't there yet. At least the resource manipulation works well. Hopefully the cycle will flesh out Gondor (and get some decent 2 cost allies who can more than defend!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=753299","commentId":753299,"userName":"hendersondayton","timestamp":1359100463,"content":"danpoage said:\n\n \n\nAs for the deck files, I definitely want to make it easier for people to access the decks so I'm glad to hear suggestions. I'm not sure which sites/formats would be most useful to people so maybe I'll put that up as my next poll. It doesn't make sense to convert all of my decks to three or four different formats if only a few people are going to use them. A bear's got to eat and sleep too :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\nI will happily volunteer my time to help put together files for you. At this point, I am able to do CardGameDB, OCTGN, and LOTR DeckBuilder program (which can export to Text, HTML, and LackeyCCG). The only real issue with the digital formats is that OCTGN is only current up thru OHaUH (no Heirs of Numenor yet, will be up in May)…and LackeyCCG stopped being updated a few releases ago. This means not all your deck builds can be supported.\n\nCardGameDB is updated up thru HoN.\n\nAt this point, I would say our best bet would be to create the following:\n\n- CardGameDB\n\n- OCTGN\n\n- TEXT and HTML version using LOTR Deck Builder program\n\nUp to you Beorn. I will help you out however I can."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=753387","commentId":753387,"userName":"danpoage","timestamp":1359110904,"content":"Thanks Henderson, that would be great! If you create the files, I will find a way to include them on my blog. I really appreciate the help.\n\nBeorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=753437","commentId":753437,"userName":"hendersondayton","timestamp":1359114568,"content":"danpoage said:\n\nThanks Henderson, that would be great! If you create the files, I will find a way to include them on my blog. I really appreciate the help.\n\nBeorn\n\n\n\n \n\nSo that we are on the same page, I have directories set up for all of the decks you have released to date. I had two questions:\n\n1. Secrets of Erebor - You have two decks here…I was going to just create the second version as I interpreted it as an improvement over the first. Do you agree?\n\n2. How do you want to tackle the \"evolving\" core-set deck? I recall talking to you on your blog about how you intended to modify the deck and from I gathered you were planning to modify the Leadership/Lore deck as new APs were added. You were also planning to do a Tactics/Spirit Deck….With this said, I was going to create a Leadership/Lore deck and a Tactics/Spirit deck that I would just modify as we went along.\n\nPlease let me know how you want it to work.\n\nIn the end, I will probably just create all the files, pass them along to you, and let you handle how to store them on your blog."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=753501","commentId":753501,"userName":"danpoage","timestamp":1359120321,"content":"Yes, Secrets of Erebor 2 is just the improved version of the the first deck, so there is no need to create files for both. The Leadership/Lore and (as of yet unbuilt) Spirit/Tactics decks will evolve over time, so again, we only need one copy of those. People will always be able to go back to the articles on the blog to see the various iterations of each of these.\n\nThanks again for your help on this, I will make sure to give you a shout out on the blog when I post these files. Which name or handle do you want me to use when I credit you for this?\n\nBeorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=753527","commentId":753527,"userName":"hendersondayton","timestamp":1359123682,"content":"danpoage said:\n\nThanks again for your help on this, I will make sure to give you a shout out on the blog when I post these files. Which name or handle do you want me to use when I credit you for this?\n\n\n\n \n\nI will work on the decks this weekend. No need to give credit but if you do, Matt Henderson is fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=753589","commentId":753589,"userName":"danpoage","timestamp":1359131468,"content":"Here it is, hot off the presses, the next installment in Beorn's Path. Now we are playtesting the Core Set Leadership/Lore deck that we made in the first article by taking it on a Passage Through Mirkwood. Let me know what you guys think.\n\nhttp://hallofbeorn.wordpress.com/2013/01/25/beorns-path-part-2-playtesting/ [http://hallofbeorn.wordpress.com/2013/01/25/beorns-path-part-2-playtesting/]\n\nCheers, and have a good weekend everyone!\n\nBeorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=755027","commentId":755027,"userName":"danpoage","timestamp":1359394408,"content":"So, thanks to Matt Henderson, the decks section now includes ZDD and TXT versions of some of the deck lists. More to follow:\n\nhttp://hallofbeorn.wordpress.com/decks/ [http://hallofbeorn.wordpress.com/decks/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=755080","commentId":755080,"userName":"hendersondayton","timestamp":1359400588,"content":"I am posting them on CardGameDB as well. A little slow due to the update process used by the admin.\n\nWhen OCTGN uploads HoN I will get them all created in that virtual table top format. \n\nThe Deck Builder (in case you are not familiar) comes from here [http://eric.minet.free.fr/lotrbuilder/index_en.htm]. Great program that us always current. It can create several export files (BBcode, HTML, Text, and LackeyCCG which is useless right now).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=755662","commentId":755662,"userName":"cordeirooo","timestamp":1359484950,"content":"Your work is no short from amazing!\nI was planning to start a blog myself (www.bayofbelfalas.com) but seeing your work I believe I'll stick to making new scenarios instead. haha\n\nGreat job!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/76915-a-new-lord-of-the-rings-lcg-blog-hall-of-beorn/?do=findComment&comment=755781","commentId":755781,"userName":"danpoage","timestamp":1359500940,"content":"Thanks cordeirooo, I'm glad that you like the blog!\n\nIf you change your mind and decide to work on your blog, I am happy to give a shout out and send people your way. The more Lord of the Rings resources, the better it is for the community.\n\nCheers,\n\nBeorn"}]}