{"url":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/","title":"Custom Upgrade?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=744813","commentId":744813,"userName":"Brownmantle","timestamp":1357672995,"content":"I read a post recently quantifying what it took for The Lord of the Rings LCG to cross over from mere game to Hobby. The writer defined the crossing point (where the game moved to hobby status) on three factors. Money spent (number of expansions), amount of time spent obsessing, and personal upgrades (things that enriched the experience but didn't come with the core or any expansions). I personally have spent a respectable amount of money on four custom playmats and FFG limited edition Lord of the Rings Art Sleeves. I also picked up a black tablecloth. What have you done to boost your in game and out of game experience around this Hobby? I want to copy you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=745008","commentId":745008,"userName":"richsabre","timestamp":1357708098,"content":"nice thread.\n\nwell i am certainly a hobbyist…no doubts there. heres my things…\n\napart from owning all the sets i have the ffg custom art sleeves. i have also converted my old pool table into a gaming table with the cards permenantly set up all in neat little piles…all the encounter sets in different piles, and the attachments, allies and events of each sphere in piles, also the heros (yes…i am actually OCD in case you are wondering….and yes, theres not alot of room on the table now.. haha)\n\ni also do (or rather did…before i started seriously studying again) my chapter series which i bought quite a few books and spent a considerable amount of hours typing and researching\n\ni have over 2000 posts on here by my estimates….**** counter got removed from the site and i visit daily and am proud to say have many good friends on here\n\ni recently bought john howes art book with his designs and sketches in…this game has really got me appreciating artwork\n\ni also play the online game which is pretty good…its free if you want the basic thingy…but seriously - the download time is enough payment for me to show im willing….\n\nmost of all though i think is the time i have put into this hobby….i mean i study astrophysics but i spend far far more time with my cards than my telescope (should i have just admitted that?) …though the british weather may have alot to do with that complice [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/guinyo.gif]\n\noh yes…it has also (indirectly) inspired me to take back up landscape photography which i did for many years..(through following ffg artist on deviantart…which i now am part of)\n\nthe beauty of middle earth is a great inspiration for my work\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=745903","commentId":745903,"userName":"Mr Coffee","timestamp":1357842292,"content":"Brownmantle said:\n\nI read a post recently quantifying what it took for The Lord of the Rings LCG to cross over from mere game to Hobby. The writer defined the crossing point (where the game moved to hobby status) on three factors. Money spent (number of expansions), amount of time spent obsessing, and personal upgrades (things that enriched the experience but didn't come with the core or any expansions). I personally have spent a respectable amount of money on four custom playmats and FFG limited edition Lord of the Rings Art Sleeves. I also picked up a black tablecloth. What have you done to boost your in game and out of game experience around this Hobby? I want to copy you.\n\n\n\n \n\nWell, Brownmantle…. You know my lengthy history of Tolkien nerdism.  For this game I have taken it to a whole new level.\n\n1)  I make my wife and children dress up as hobbits every time I play.  I really need to be immersed in my experience.\n\n2)  I purchased a vial of JRRT's ashes off of Ebay, and I only bring them out of their hermetically sealed vault whenever I play this game.  (Since this was purchased from a Serbian seafood smuggler and since I'm also not sure whether JRRT was even cremated, I may have gotten scammed on this deal…. still had to take a chance).\n\n3)  I eat taters and coneys for dinner every time I play this game.  These are imported only from New Zealand.\n\n4)  My entire play deck is signed by JRRT.  Since this was purchased from the same Serbian character, these also may not be genuine.\n\n5)  My card sleeves are woven from fiber harvested from Balrog wings.\n\n \n\nOkay.  Obviously one or two of those above are not true.  But you are familiar with some of my Tolkien \"acquisition\".  I do have some of the movie propoganda… er, replicas (sorry, Rich)… I have NOT found that I have yet needed to use Sting, Gandalf's staff, or Gimli's Helm to help beat an encounter yet.  But may give it a shot some day.  I do have a large selection of various FFG sleeves (Ring, Eye, Gandalf, Gimli, Nazgul, etc…), as well as some other FFG product (deck boxes, etc).  I am not as dedicated as Rich to have an actual pool table dedicated to this game.  I did get a small portable computer desk to be able to play this game on (by portable, I mean I can carry it to various rooms in my house).  This desk is BARELY big enough for me to play solo on, so it would be worthless to play any multiplayer games on it…  I have found some containers for the tokens that are pretty handy and more convenient than a bunch of ziplock bags.  I definitely want to find some of those custom playmats that Brownmantle got his hands on!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=746093","commentId":746093,"userName":"richsabre","timestamp":1357878009,"content":"benhanses said:\n\n \n\nBrownmantle said:\n\n \n\nI read a post recently quantifying what it took for The Lord of the Rings LCG to cross over from mere game to Hobby. The writer defined the crossing point (where the game moved to hobby status) on three factors. Money spent (number of expansions), amount of time spent obsessing, and personal upgrades (things that enriched the experience but didn't come with the core or any expansions). I personally have spent a respectable amount of money on four custom playmats and FFG limited edition Lord of the Rings Art Sleeves. I also picked up a black tablecloth. What have you done to boost your in game and out of game experience around this Hobby? I want to copy you.\n\n \n\n \n\n \n\nWell, Brownmantle…. You know my lengthy history of Tolkien nerdism.  For this game I have taken it to a whole new level.\n\n1)  I make my wife and children dress up as hobbits every time I play.  I really need to be immersed in my experience.\n\n2)  I purchased a vial of JRRT's ashes off of Ebay, and I only bring them out of their hermetically sealed vault whenever I play this game.  (Since this was purchased from a Serbian seafood smuggler and since I'm also not sure whether JRRT was even cremated, I may have gotten scammed on this deal…. still had to take a chance).\n\n3)  I eat taters and coneys for dinner every time I play this game.  These are imported only from New Zealand.\n\n4)  My entire play deck is signed by JRRT.  Since this was purchased from the same Serbian character, these also may not be genuine.\n\n5)  My card sleeves are woven from fiber harvested from Balrog wings.\n\n \n\n \n\ni believe all of those apart from 5- ive never thought balrogs to have wings reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]\n\nand oh yes, your film collectables reminded me of something i forgot..i also have some autographs of the cast. ive got mckellan, bloom, boyd and monaghan….and yes- i love them all haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=746234","commentId":746234,"userName":"jc1138","timestamp":1357903326,"content":"I've got all the cards/expansions, though I use KMC sleeves rather than Fantasy Flight's (don't like the larger size).  My Tolkein-related materials are mostly books (I have more than 70 including a replica of the Red Book of Westmark) and, while they are related to the game in lore of course, I don't refer to them while playing.  I also have movie-replica versions of Narsil and Boromir's leather vambraces, but I don't gird them on before playing (it would be kinda silly fun, though).   I've considered creating my own playmat because I both draw/paint and know calligraphy (I've written things in Tengwar and dwarven).  \n\nI'm working on a book copying all the poems from LotR in calligraphy complete with drawings, but it's the work of years."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=746389","commentId":746389,"userName":"HeavyKaragh","timestamp":1357922349,"content":"I'm working on a custom quest. That makes me a hobbyist, right? I'm more on the game side than on the Lord of the Rings side of the thing, that's for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=746398","commentId":746398,"userName":"Alex6222","timestamp":1357924549,"content":"I have become fan of Lord of the Rings, and the Hobbit expansion is what motivated me to read The Hobbit book. I have a monopoly of the movie trilogy and it comes with a very nice ring. I also have the sword Elendil, its not a replica but kind of a toy sword but is very sweet. I had a toy sword of Sting but after a goblin invasion at my house it got destroyed (this sword was definetly not made by elves)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=746761","commentId":746761,"userName":"Brownmantle","timestamp":1357996288,"content":"Making a custom scenario def. puts you in Hobby territory, by the way.\n\n@ Rich: I don't think I can repurpose an entire pool table, but MAN that would be sweet, especially for a sprawling four player!\n\n@ Ben: Balrog wings…why didn't I think of that!? Also, I seem to remember you snagging that movie \"replica\" of Bilbo's pipe (sorry Rich) & refusing to give it to me in your Final Will and Test. I have a long stem (or two) for Pipe Weed. Ale, Pipes & this game MUST HAPPEN! Why didn't I think of this before!? I'm such a dork."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=746789","commentId":746789,"userName":"GrandSpleen","timestamp":1358001131,"content":"Well, I do have all the expansions except for the last two Dwarrowdelf APs (soon to be mine…).  I think time investment is signifiant… we don't play daily, but 3-4 times in a week is a good estimate.  And if I have extra friends coming over for a game night, I'll spend a couple of hours putting together 4 thematic decks for a more interesting play session.  And then they'll come over and we'll end up playing some other game instead… hah!   Also, I've spent some time making a storage solution in the form of dividers for my decks and using cardboard and tape to set up 3 columns in the Core set box to hold all my cards.  It's filling up!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=748541","commentId":748541,"userName":"Mr Coffee","timestamp":1358349890,"content":"richsabre said:\n\n \n\nbenhanses said:\n\n5)  My card sleeves are woven from fiber harvested from Balrog wings.\n\n \n\n \n\ni believe all of those apart from 5- ive never thought balrogs to have wings reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]\n\n \n\n \n\n \n\nAs I have not heard there has been an OFFICIAL ruling from the Tolkien Estate concerning this matter, I stand firm in my Balrogian Wing-Hair acquisition…\n\n \n\nBrownmantle said:\n\n \n\n@ Ben: Balrog wings…why didn't I think of that!? Also, I seem to remember you snagging that movie \"replica\" of Bilbo's pipe (sorry Rich) & refusing to give it to me in your Final Will and Test. I have a long stem (or two) for Pipe Weed. Ale, Pipes & this game MUST HAPPEN! Why didn't I think of this before!? I'm such a dork.\n\n \n\n \n\n \n\nHoly smoke-rings, Batman!  How could I have forgotten my Bilbo pipe???  It's probably the only thing I've acquired that has any functional purpose!  … (My attempt to wield Sting against my boss resulted in two weeks of unpaid suspension, three nights \"visit\" as a guest of the state, and a lot of stupid talk about restraining orders and assault charges…  When I was able to prove that it did indeed glow blue around her, however, all charges were dropped)…\n\nAnd I HAVE enjoyed using my Bilbo pipe (manufactured from some German company that I can't pronounce), but as of yet have not achieved success at blowing a smoke ring, much less a three-mast sailing ship.  Also, my attempt to purchase \"old toby\" and \"pipe weed\" from Craigslist on my work computer earned me another week of suspension.  And an investigation from the local DEA office…\n\n \n\nThe things I suffer for my love…..\n\n \n\nEdit:  Sadly, I failed to mention that my 10-month old got his hands on the pipe from it's display stand, and as a result it now has a sad crack in the lower bowl where the pipe connects.  It still smokes, but makes for a loose fit, so the pipe doesn't stay together easily.  I must look into fixing it.\n\nEdit (part deus):  Yes, Brownmantle, at some point we definitely need to have an all-out nerd session that includes pipes, props, games and ales.  Talk with your brother about our newest ale-love.  Innis and Gunn (from Scotland)… phenomenal stuff.  Sadly, not sold around here (or anywhere west of the Ozarks as best I can tell).  But available in Victoria, BC.  So perhaps we need to head north and smuggle some back across the border.  It is available through onlin purchase, but the shipping fees are astronomical.  But their Scotch Ale was smooth, and I have a hankering to try others in their \"casked\" lineup…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=748604","commentId":748604,"userName":"richsabre","timestamp":1358356845,"content":"in the county where i live the homebrew ale is legendary…in fact i walked to school right past the brewery every day….(wonder why i liked it haha)\n\nif you ever get the chance try some 'jennings ales' or any lake district ale….im sure bilbo himself would appreciate it complice [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/guinyo.gif]\n\non a related note i feel sorry for you americans….cant imagine having to live a life with just lager….(sorry no offense meant :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=749226","commentId":749226,"userName":"Mr Coffee","timestamp":1358444919,"content":"richsabre said:\n\non a related note i feel sorry for you americans….cant imagine having to live a life with just lager….(sorry no offense meant :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])\n\nrich\n\n\n\n \n\nNone taken.  It really depends on where you are from.  The Microbrew industry (I don't know if that's what they call \"homebrew\" there for you) is really taking off here.  Depending on which part of the country you live in. \n\nFortunately, here in the Northwest (Washington State in particular), the industry is in full force.  We are far from relegated to being forced to choose watery lagers.  I won't even touch the stuff (Brownmantle will vouch for my brew snobbery).  And we have quite a few shops in the area that carry a real solid lineup of imported specialties as well.  Ol' Brownie there will tell you that anyone visiting me is pretty much automatically going to be in for a visit to whichever local ale-house I happen to be in the mood for at the moment…\n\nI was just pointing out the I&G as one that I had really enjoyed but I know is not sold in our area…  alas and woe… burla [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/burlon.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=749441","commentId":749441,"userName":"Migwald","timestamp":1358489613,"content":"These replies did make me chuckle and made me realise there are much bigger Tolkien nerds than me reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]\n\nI'm a late-comer to the game but love it and have downloaded several custom-scenarios, playmats, token containers, card dividers etc to 'enhance' the hobby., as well as buying adventure packs to try a new scenarios (I'm yet to start on the Dwarrowdelf series, so some catching up to do).\n\nMy other LOTR addictions are Games Workshop models (my wife fails to comprehend why I need 'yet another model'), Lord of the Rings Online and of course the books (and films!).\n\nHappy dayspillo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/pillin.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77015-custom-upgrade/?do=findComment&comment=749783","commentId":749783,"userName":"Mr Coffee","timestamp":1358526597,"content":"Migwald said:\n\nThese replies did make me chuckle and made me realise there are much bigger Tolkien nerds than me reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]\n\nI'm a late-comer to the game but love it and have downloaded several custom-scenarios, playmats, token containers, card dividers etc to 'enhance' the hobby., as well as buying adventure packs to try a new scenarios (I'm yet to start on the Dwarrowdelf series, so some catching up to do).\n\nMy other LOTR addictions are Games Workshop models (my wife fails to comprehend why I need 'yet another model'), Lord of the Rings Online and of course the books (and films!).\n\nHappy dayspillo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/pillin.gif]\n\n\n\n \n\nOh. man!  I forgot those… My cousin, Doug, and I bought a bunch of those in order to totally nerd out.  Sadly, I think we have yet to paint a single one of them…  Plenty of inspiration.  Serious lack of will…. lol"}]}