{"url":"https://community.fantasyflightgames.com/topic/77042-resource-pool-of-defeated-hero/","title":"Resource Pool of defeated Hero","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77042-resource-pool-of-defeated-hero/?do=findComment&comment=745049","commentId":745049,"userName":"mrkwnzl","timestamp":1357717421,"content":"Hello,\n\nI was wondering what happens to the Resource Pool of a hero if he gets defeated. Do the resources stay, to be used by other heroes, are they removed? Maybe they stay, not to be used by other heroes, so if the defeated hero return, he still has his resource pool?\n\nI read the rulebook and the FAQ 1.31, but have found nothing. I alos tried to use the forum search, but that didn’t lead mie anywhere. Not the best search engine for a forum, I guess.\n\nAnyway, thanks a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77042-resource-pool-of-defeated-hero/?do=findComment&comment=745080","commentId":745080,"userName":"hendersondayton","timestamp":1357721110,"content":"I am positive that the Resources are also lost..I cannot reference that but I am sure someone can follow me up with the reference…\n\n \n\nEDIT: p22 talks about what to do when a hero leaves the game, but now that i can see, I don't see a reference to resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77042-resource-pool-of-defeated-hero/?do=findComment&comment=745346","commentId":745346,"userName":"GrandSpleen","timestamp":1357753485,"content":"Well, \"Each hero has 1 resource pool\" (pg 12) and \"Note that hero cards that are defeated are placed in their owner’s discard pile.\" (pg 20)  You're just going to have to put all those resources back in the resource bank.  Eliminate the hero and you eliminate the resource pool that belongs to them… I guess it's not explicitly stated, but there's nothing in the manual to suggest that surviving heroes would have any claim to another hero's resource pool, or that they can exist independently of the hero owning them.  "}]}