{"url":"https://community.fantasyflightgames.com/topic/77168-feint-card/","title":"FEINT Card","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77168-feint-card/?do=findComment&comment=745832","commentId":745832,"userName":"Arcuro2","timestamp":1357831629,"content":"Greetings All,\n\n \n\nI am a new comer to these types of games and enjoying every minute I get to play.  I have been solo mainly and have a question on the \"FEINT\" card.  I searched around but not sure I found the answer I was seeking, if there was a post I missed my applogies for the question.\n\nQuestion:\n\nCOMBAT Phase:\n\nAfter the shadow card is drawn and placed on the attacking card.  The next step is \"Player Actions\", at this point I want to play the \"FEINT\" card.\n\nOnce I play this card:\n\n 1. It removes the Hill Troll from attacking?  Yes\n 2. Do I still delcare a defender?\n 3. Does it cancel the shadow card from being played?  Yes/No\n\nNext Step:\n\nIf I did not have to declare a defender, that leaves me with two Hero's not exhausted.\n\nNow I can declare my attackers….\n\nThis is where my main question is:\n\n 1. Can I still attack the Hill Troll after playing the FEINT card to prevent it from attacking?  Can I take my two Hero's and attack the Hill Troll or does the \"FEINT\" card act if the Hill Troll is exhausted and no longer part of the phase for actions….\n\nThanks,\n\nDave\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77168-feint-card/?do=findComment&comment=745879","commentId":745879,"userName":"GrandSpleen","timestamp":1357838343,"content":"Hi Dave,\n\nYou do not have to declare a defender (there is no attack to defend).  The shadow card is still dealt to the enemy, but you don't have to resolve it.  Shadow card resolution is a stage in attack resolution.  As there is no attack, the various steps of attack resolution (including declaring a defender) don't occur.\n\nYou can still attack enemies after you have played Feint on them.  You have only canceled their one regular attack.  They could potentially still attack if some card effect instructs them to do so (like another enemy's shadow effect stating \"All enemies engaged with the defender player make an immediate attack\").  Also, enemies do not exhaust in order to attack (or defend).  \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77168-feint-card/?do=findComment&comment=745949","commentId":745949,"userName":"muemakan","timestamp":1357847379,"content":"Once Feint is played on an enemy it does not  attack that phase, that includes additional attacks that might occure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77168-feint-card/?do=findComment&comment=746165","commentId":746165,"userName":"GrandSpleen","timestamp":1357892929,"content":"You're right, it says \"cannot.\"  Sorry I missed that."}]}