{"url":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/","title":"Blocking Wargs - The most stupid card ever created ?…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=746383","commentId":746383,"userName":"DevastazioneH88","timestamp":1357921778,"content":"my vote is obviously…yes !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=746549","commentId":746549,"userName":"Ellareth","timestamp":1357952229,"content":"I am usually happy to see a brutal shadow / trechery cards, but I'll have to agree with you here.\n\nThere just isn't a good way to counter Blocking Wargs.\nSimply dodging it few times by not committing 1 hp characters to quest won't work because it will be shuffled into the deck,\nmanipulating encounter deck so it would come out as shadow card isn't enough because there are 4 copies of this card,\nputting them to the bottom of encounter deck is will only make you reset your quest later on as 2 copies of Wargs at the bottom of deck will loop,\nand unless you have unlimited money, you can only have so many copies of Test of Will per player.\n\nWhy are there Wargs in Ithilien anyways? I thought Wargs were used by Northern Orcs to raiding villages and in Isengard for countering cavalries. Most certainly have not heard of any human in service of Sauron using Wargs at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=746584","commentId":746584,"userName":"Glaurung","timestamp":1357962886,"content":"It is good card! this card make game more harder and i always welcome it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=746604","commentId":746604,"userName":"DevastazioneH88","timestamp":1357969022,"content":"In a Solo game it is more \"dodgeable\" though most of the low cost high attack characters have 1 or 2 hp (so if you play a Vassal of the Windlord to commit more attack in order to complete Ithilien Road the poor Vassal has a high chance of getting killed) but in a 2 player game it almost always destroys your quest. I've been playing this a lot both solo and multi with my girlfriend (solo I win quite \"easily\" but multi is a bit trickier) and we almost always lose because of it. It has surge, so even if you cancel it there's still a chance of getting another (that still surges and is shuffled back into the E.D.) and you'd be surprised to know how many times that happened (but of course it will with 4 copies in such a small E.D.) and other times it simply remains on the bottom…so bye bye….Yesterday night we tried to score our third victory and lost like 5 times in a row (4 out of 5 times because of this card). Once we got three copy of it in the last 5 cards of the E.D.. I'm not a guy who complains much, I like tough ones. but this one is worse than A Foe Beyond, at least there you have one copy per player and you might still try to contol the Namless Fear's threat. Here you have 4 copies that are always in the encounter deck (unless they come out as shadow cards which can still be devastating). The only way to deal with it is to cancel it, hoping the surged card isn't another Blocking Wargs or another card with surge (quite likely). I have to say I like this scenario (though Peril and The Siege are better) but Blocking Wargs take all the fun out of it at times. In my opinion it should either lose surge or it should not be shuffled back into the encounter deck unless the quest card ha the PRINTED siege keyword (so you'd really want to avoid quest card 2 for a reason, while as it is right now I actually prefer it to Q.C. 3 which requires a lot of willpower against a potential infinite amount of threat in the staging area in a scenario where you need attack and defense only). That's my opinion…what do you guys think ? (right now it is my top 1 worse encounter card, way above Sleeping Sentry and Sudden Pitfall and also A Foe Beyond…though the other ones I pretty much like how they fit in the scenarios, this one I really don't, it does not fit at all)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=746609","commentId":746609,"userName":"richsabre","timestamp":1357971960,"content":"Ellareth said:\n\nWhy are there Wargs in Ithilien anyways? I thought Wargs were used by Northern Orcs to raiding villages and in Isengard for countering cavalries. Most certainly have not heard of any human in service of Sauron using Wargs at all.\n\n\n\nthere were orcs in ithillien also. i think the main focus was on humans in the quest but its not lore incorrect\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=746688","commentId":746688,"userName":"Pickles","timestamp":1357984942,"content":"No that's Sleeping Sentry"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=747058","commentId":747058,"userName":"Beano","timestamp":1358063109,"content":"I still think sleeping sentry is worse. Sudden pitfall is way worse early in the game when you may have to quest hero, but that card can be managed once you are a few turns into the game. A Foe From Beyond is very powerful, but at least it is thematic and fits in with the quest really well and scales as you progress through the quest. While it isn't quite as abnoxious, I've found Orc Assault or an early Power of Mordor to have a massive impact on the game often starting a death spiral if they aren't cancelled (with Power of Morder not being cancellable). Orc Assault essentially creates a lost turn which I can never afford on Cair Andros along with a threat hit from terrible questing. The one time impact of these cards is way more than Blocking Wargs. I think Orc Assault shouldn't impact your questing even on a battle/siege and Power of Mordor should be an addition to the encounter deck after a few turns.\n\nI agree with the comments that either removing the Surge or the shuffle back in is needed to avoid Blocking Wargs doing silly things. If you keep track of the Blocking Wargs you can at least plan for a round where you empty out the encounter deck and infinitely cycle Blocking Wargs. Admittedly, I play under the assumption that an infinite loop of Blocking Wargs doesn't end the game, it just kills all questers (which I think is plenty). I don't know if this is correct per se, but it is the only option that isn't silly. The thing that is really bothersome is that there are only 3 cards in the game that can directly get rid of Blocking Wargs (so not counting getting rid of the card through a shadow effect - which requires some unthematic metagaming) - A Test of Will, Eleanor, and Out of the Wild. If we are really required to cancel Blocking Wargs to have a chance against this quest, then we certainly need more options. For now, I won't go Into Ithilien without 6 A Test of Wills and 2 Dwarven Tombs in a two player game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=747122","commentId":747122,"userName":"DevastazioneH88","timestamp":1358072174,"content":"The cards you mentioned are tough ones but they're just one or two copies in their respective encounter decks (and each of thoese encounter deck is way larger than Into Ithilien), so In a three-game match you might happen to be unlucky once, or you might even not get the card at all (or most of the times you'll be able to deal with it) but in into ithilien it's not about being unlucky (4 copies in a very small and surgy encounter deck), it's just that. As I stated before in a solo match it's a bit easier and I get to complete the quest most of the times without stupid things happening, but in multi you almost always end up losing because of Blocking Wargs. Moreover there's to consider that you need a big amount of tactics cards so normally you can use the few remaining slots to either cancel shadows efficiently or to cancel when revealed efficiently, because if you do both, you do neither efficiently and you just die….As I said already HoN is awsome, I like the high difficulty of the scenarios (especially The Siege, that's awsome)…I just don't understand this Blocking Wargs card…I mean, ok let it surge, ok let it damage my ass off, ok let it be in 4 copies…but at least let me discard it after it's destroyd me…won't you ?…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=747181","commentId":747181,"userName":"Beano","timestamp":1358079547,"content":"I guess the point is that if you know that Blocking Wargs is going to be an issue, then you can at least prepare for it. To beat Into Ithilien you have to ensure that you have at least 4 A Test of Wills available for play before you get through the end of the encounter deck (hopefully it will be less with one or two being shadow effects). If everyone at the table has 3 in their deck, this is very doable - even more so if you have Dwarven Tombs backing them up and/or card draw support. I completely agree that having these Spirit cards works against the other things you need in the quest, but at least I have a chance. I have a lot less problem with cards that I am at least given an opportunity to try to counter than ones that can make the game unrecoverable first or second turn. Southron Support (let alone drawing two of them!) first turn on Into Ithilien almost qualifies here. Sleeping Sentry as a shadow effect is absurd particularly when applied on a first turn attack when, beyond a mulligan, there is very little power from the players to be able to set up a defense. A first or second turn Blocking Wargs is not pleasant, but it is eminently survivable as long as you aren't counting on Vassals to make your questing math balance out.\n\nI want to be clear that I don't like the card and I think that the infinite loop scenario is likely a horrible design oversight, but I think it is a step too far to say it is the worst. Also, with a few key exceptions, I really like HoN - although I am close to being frustrated enough with a few of these exceptions to start house ruling the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77234-blocking-wargs-the-most-stupid-card-ever-created-%E2%80%A6/?do=findComment&comment=747213","commentId":747213,"userName":"DevastazioneH88","timestamp":1358084785,"content":"Yeah I get what you're saying, it obviously depends on how you play as well (for exemple the Vassals are one of my best Batlle questers)…the real point is I'm getting frustrated with this card because it destroys my games recurrently when playing multi while most of the others (Sleeping Sentry, Sudden Pitfall etc…) only happen once in a while (their immediate effect is surely worse but the overall effect is much lighter on a whole game especially if you get to counter them). Anyway, I think everyone has his own least favourite encounter card and Blocking Wargs is mine (followed by A Foe Beyond). My point is that while many other \"Bad\" Encounter Cards are tough, this one is a bit \"broken\". I've been \"comboed\" by many scenarios (Ex. The Redhorn Gate - exhaust all characters and commit them to the quest + each exhausted character gets -1 willpower + Caradhras + third quest card)…but that's just a very rare combo (even funny if you think of it) while Blocking Wargs at least in my experience loops once every other game."}]}