{"url":"https://community.fantasyflightgames.com/topic/77315-coop-communication/","title":"Coop communication","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77315-coop-communication/?do=findComment&comment=746984","commentId":746984,"userName":"Bellasarius","timestamp":1358039149,"content":"Can one player with the ability to look at the top of the encounter deck give the other player full information about the card?\n\n \n\nSpecfically I am thinking about matching the first letter to a discarded card to open Diruns door to escape The Watcher. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77315-coop-communication/?do=findComment&comment=747042","commentId":747042,"userName":"richsabre","timestamp":1358057955,"content":"yes- the table is completely open in this game\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77315-coop-communication/?do=findComment&comment=747130","commentId":747130,"userName":"GrandSpleen","timestamp":1358073084,"content":"Here's the only part of the manual that addresses communication between players:\n\n\"Table Talk\n\nPlayers are permitted and encouraged to talk to one\nanother during play, and to work as a team to plan and\nexecute the best course of action. Players can discuss\nanything they would like, but they cannot name or read\nout loud directly from cards in their hand, or from cards\nthat they have seen but the rest of the players have not.\" (pg. 25)\n \nThe bolded part implies that there are times where one player may look at the encounter deck and while other players may not.  You might be thinking about cards like Denethor and Rumour from the Earth to help here.  These cards say \"look at the top card of the encounter deck.\"  It is not clear whether other players are allowed to look or not, the card text is not as instructive as it could be.  I've always played that they are.  Contrast this with a card like the quest cards in The Hunt for Gollum: \"the first player looks at the top 3 cards of the encounter deck. Reveal and add 1 of those cards to the staging area, and discard the other 2 cards.\"  In that case it seems more like only the first player should be looking.   Even so, I've always allowed other players to see, and chosen as a group.  Just more fun if everyone is involved in the process.\n \nI've found it's more fun to ignore this rule.  We tried playing with it for the first couple of months, but it's more satisfying to develop a strategy when nobody is kept in the dark.  Even if you want comply, you can adhere to this rule and sidestep around \"reading out loud directly from cards\" and still let other people know what is in your hand.  \n \nFor Doors of Durin, you have to match the first letter of your card to that of a card discarded from the encounter deck.  You are not supposed to tell other people what cards you are holding, so this rule actually defeats the most obvious strategy here.  But can you say, \"Well, I have a card that starts with a \"D?\"  Or maybe that constitutes reading out loud :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Interpret as you will!\n \n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77315-coop-communication/?do=findComment&comment=749635","commentId":749635,"userName":"Mechanoise","timestamp":1358512001,"content":"When I read that rule I interpretted it as you were not allowed to discuss cards at all, so if you were to look at the top card of the encounter deck then it has to be for your eyes only.\n\nWe played a few games and decided to ditch that rule altogether. We didn't feel like we had an advantage over knowing each other's hands, and it was more co-operative to discuss tactics. I really wish Fantasy Flight removed this rule as communication was severely limited throughout our game."}]}