{"url":"https://community.fantasyflightgames.com/topic/77318-how-to-deck-build-fight-in-moria-deluxe-expansion-1-quest-3/","title":"How to deck build &#039;fight in Moria&#039; deluxe expansion 1 quest 3?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77318-how-to-deck-build-fight-in-moria-deluxe-expansion-1-quest-3/?do=findComment&comment=747005","commentId":747005,"userName":"Cutievalkyrie","timestamp":1358042674,"content":"1. The shadow has a lot of threat. Shall i pass the quest or do the quest 2b when its not the exit? Whats the good for questing 2b?\n\n2. When i focus on fighting i draw a lot of locations; when i focus on questing, i draw a lot of tough enemies… could anyone give me some idea on how to deck build for this quest pls?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77318-how-to-deck-build-fight-in-moria-deluxe-expansion-1-quest-3/?do=findComment&comment=747194","commentId":747194,"userName":"jrd","timestamp":1358082103,"content":"The best way I've found to tackle this quest is to only quest with a small amount of willpower if you don't know what the current quest card is. You probably don't want to complete any quest stages unless you have to, until you can win the quest. Take advantage of putting the current quest card onto the bottom of the quest dack whenever you can, unless the current quest is useful to you. Cards which allow you to increase questing after the encounter cards are revealed are particularly useful.\n\nHope this helps!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77318-how-to-deck-build-fight-in-moria-deluxe-expansion-1-quest-3/?do=findComment&comment=747617","commentId":747617,"userName":"Captain Poe","timestamp":1358153765,"content":"If I recall correctly, I was able to beat this with Eowyn boromir, and a third hero (has been a long time). High questing power is a must, and bormir was able to save the day by readying to pick axe his way to freedom in one turn."}]}