{"url":"https://community.fantasyflightgames.com/topic/77685-momentum/","title":"Momentum","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=749668","commentId":749668,"userName":"tripecac","timestamp":1358514301,"content":"Last summer (NZ summer) I played a lot of LotR LCG because I had a nice playing surface available every lunch time.  I didn't have anyone to play with, so I just played solo (1 hand).  I created 2 decks, so that I could use all 4 spheres.  I then started tacking the quests, in order.  I played with deck A until I beat the quest at least once, and then shifted to deck B.  Gradually I progressed through the quests, eventually reaching Rhosgobel.  Unfortunately at that point, we had to move, and my new office didn't have a nice playing surface, so several months passed before I picked up the game again.\n\nA couple months ago, I began my second \"push\" through the quests.  Since I felt a bit rusty, I decided to start over again with Passage through Mirkwood, but didn't restrict myself to the Core set.  The idea was that since I now had more cards available to me, and was more experienced with the game, I should be able to quickly progress through the quests until I reach Rhosgobel again, and then finally enter terra incognita.\n\nWell, that was the theory at least. \n\nThe reality is that I feel am stalled.  And I think the problem is that is it hard to gain momentum, due in part to decision paralysis.\n\nAfter playing once or twice a week for the past couple months, I am still on Passage through Mirkwood, and am still nowhere close to feeling satisfied that I have \"finished\" it and am ready to progress to the Anduin.  Why am I stuck?  Well, let's see how I have spent my time:  (Note that the days are based on memory and therefore an approximation):\n\nDay 1: I sorted my cards.  They were in whatever state I left them last summer.  Since I no longer felt connected with those decks, I wanted a clean slate.  I therefore sorted them all out again, replacing the card sleeves that had ripped.  This took my entire lunch break.\n\nDay 2: I built a Leadership/Spirit deck.  I felt overwhelmed with options.  It took me forever to whittle down to about 80 cards.  If I had only been playing with the Core Set, it would have been easier, but I hadn't separated the Core Set from the expansion packs I had opened.  It took the entire day just to construct a deck.\n\nDay 3: I built a Tactics/Lore deck.  The Leadership/Spirit deck would be my \"A\" deck. and this would be my \"B\" deck.  It took the entire lunch break to decide which cards to use, and I still had too many.\n\nDay 4: I finally got to play.  I played the Leadership/Spirit deck, and won.  It felt too easy.  I was slow because of having to re-learn the rules and look up errata, so the single game took the entire break.  I had too many cards, so wanted to get rid of some of them.  However, I didn't know which to get rid of, so decided to play the same deck the next day.\n\nDay 5: I played Leadership/Spirit deck again, and this time lost.  I think I got stuck with too many event cards.  I got rid of a bunch of them, and tried again, and won.  I still wasn't convinced I had \"mastered\" the scenerio with Leadership/Spirit, so I decided to give it a final shot the next day.\n\nDay 6: I played Leadership/Spririt again and won.  I was now relatively happy with my deck. although I knew it still had too many cards.  I was ready to tackle the dreaded Tactics deck (assisted by Lore) on the next day.\n\nDay 7: I played and lost Tactics/Lore.  It was painful.  I didn't feel like I was drawing bad cards or that luck was a factor; it was just that this deck really stunk as questing and threat management.  And if I was having trouble on Passage through Mirkwood, which is the easiest quest, then this deck had no chance with the other quests.  I knew that I would dread playing with it each time.  So I decided to forget the Tactics/Lore idea, and instead pair Tactics with Spirit, so that Eowyn could help the Tactics morons heroes quest.\n\nDay 8: Since I decided to switch to Tactics/Spirit, this meant I had to pair Leadership with Lore.  So today I built a Leadership/Lore deck.  This meant I had to disassemble both of my decks first, before building the two new ones: Leadership/Lore (the new \"A\") and Tactics/Spirit (the new \"B\").\n\nDay 9: Today I played the new Leadership/Lore deck, and loved it.  Leadership cranked out resources, and Lore cranked out cards.  What a natural combination!  The only downside is that Bilbo died.  I was playing with him in order to force myself to learn some of the non-Core heroes.  I think it's the Hummerhorns that took him out.  We really didn't need him, once Aragorn got a song of lore and the Steward of Gondor.  Bilbo, schmilbo.\n\nDay 10: I enjoyed the Leadership/Lore deck so much yesterday, but wanted to see if I could keep Bilbo alive, so I played it again, and won easily, but again, Bilbo died, about midway through.  Hummerhorns again, I think.  It didn't matter, though, thanks again to the Song of Lore and the Steward of Gondor, a great combo.\n\nDay 11: I played Leadership/Lore a third time, and was determined to keep Bilbo alive this time.  Somehow I managed.  So, finally, I was satisfied with this deck, although I knew its threat management wasn't that great.  The only way to reduce threat was via Gandalf, and because I was using lots of cards (for disposable allies), the relative frequence of Gandalf was pretty low.  The only way to fix this would be to either play with a smaller deck or add some Spirit cards, which I could use if I put a Celebrian's Stone on Aragorn.  I didn't feel comfortable mixing 3 sphere, however, and wanted to save the threat-reducing Spirit cards for the \"B\" deck, so I decided to stick with the existing deck.\n\nDay 12?: I *think* I played Tactics/Spirit, but I do not remember….\n\n…This is because now began a long series of interruptions.  Family visiting, traveling, Christmas, and then getting ready to move to a new house.   The cards got packed pretty early in the process (since I didn't anticipate playing much), and now we're on the road again, so I don't even have access to them.\n\nI do, however, have LackeyCCG and OCTGN, and have installed the LotR LCG plugins for both.  I've built a Leadership/Lore deck (core set only) and played through a game on each system.  OCTGN feels smoother, but LackeyCCG lets me save.  Testing these two systems took an additional 4 lunch breaks.\n\nSo I have spent 16 days with Lotr LCG in this second phase, and am still not done with Passage Through Mirkwood.  I don't see the light at the end of the tunnel either, because I still need to decide what to do next:\n\nShould I:\n\na) build a Tactics/Spirit deck on LackeyCCG and/or OCTGN with Core cards only\n\nb) build a Tactics/Spirit deck on LackeyCCG and/or OCTGN with cards through Rhosgobel (so that it is better practice when I get access to  real cards)\n\nc) expand my LackeyCCG and/or OCTGN Leadership/Lore deck to include cards through Rhosgobel\n\nd) take my existing LackeyCCG and/or OCTGN Leadership/Lore deck to the next quest (Journey Down the Anduin)\n\ne) spend time learning or rebinding the LackeyCCG and/or OCTGN commands so that I can play more efficiently\n\n\n… and once I get access to my cards again, I will need to decide whether to:\n\nf) find a way to improve threat reduction in my Leadership/Lore deck\n\ng) take Tactics/Spirit through Passage through Mirkwood\n\nh) try playing \"2 handed\" (with both decks at once) - the primary motivation here would be to reduce the number of times I have to win a quest before feeling like I am ready to continue to the next one; the side effect is that this might make some quests easier, which means I can progress faster\n\ni) reduce my decks to just the core set - I like the idea of using cards which are \"contemporary\" with each quest (such as Passage through Mirkwood); the downside is that since I am playing solo, I might be making things harder for myself.\n\nj) create a 3rd and 4th deck using heroes and cards I didn't use in decks A and B - this would let me use *all* the cards; it seems a shame to have some cards going completely unused\n\nk) watch some more video tutorials, to see what other people are using for decks and strategies - this might help me reach the \"good enough\" point faster, so that I can progress through the quests\n\nl) post my issue on the forum\n\nm) go play something else, where I don't have to think as much\n\n------\n\nAs you can see, there are lots of options for what to do next, and since I am playing alone, I don't have anyone pushing me one way or the other; there is no external pressure to \"get on with it\".  Also, since this is my second playthrough, and since I know there is a lot of work to get from here to Rhosgobel, there is more pressure to do things \"right\" on this early quest, so that I set a precedence that will carry me swiftly and enjoyably through the other quests.\n\nThus, the decision paralysis.\n\nI'm sure some of you think this over-analysis and over-documenting is a silly waste of time, but others of you might feel (or have felt) the same way.  It's from the latter bunch that I'm curious to hear your thoughts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=750137","commentId":750137,"userName":"tripecac","timestamp":1358593500,"content":"While waiting for people to reply to my post (ha), I checked out the two new LOTR LCG blogs.  Great writing, great advice, great sense of knowing what they are doing. \n\nSome things were made clear to me while I was reading those blogs:\n\n1) The writers have lots of free time.  Not only were they spending what looked like several hours a week writing the blogs, but they were also spending several hours a week actually playing the game.  Their primary focus (of writing and playing) was on the new Gondor quests and cards, but they also were spending time either playing or at least refeshing themselves with the older quests and cards.  I'm guessing they each are devoting at least 10-15 hours each week to LOTR LCG.  Perhaps much more.  Momentum and improvement at any skill requires time, and they definitely seem to have it.  I'm very impressed, and a tad envious.\n\n2) They use multiple overlapping decks (e.g., multiple decks utilizing Spirit cards).  They aren't restricting themselves to one deck with 2 spheres and the other deck with the other spheres.  Maintaining overlapping decks with a single set of real cards seems a bit of a pain, since you have to continually move a randomly sorted subset of cards from one deck to another; plus, you have to remember which cards are in which deck.  So either they have nimble fingers and memories (or write everything down), or they have purchased multiple copies of the quest packs, or they play mostly virtually.  I am curious which is the case.\n\n3) They don't aim for, or expect perfection.  It seems very clear in their heads that there are no \"perfect\" decks, and even their favorite decks lose some times.  Different decks have different success rates at different quests; none have a 100% success rate on 100% of the quests.  Ditto for individual cards.  Some cards and decks seem to be preferred over others, but the writers never seem to \"settle\" on a single deck consisting of only favorite cards.  LOTR LCG is not like a video game where once you develop a \"winning\" character or strategy, you stick with it forever.  The writers seem to accept, and even appreciate, the fact that while progressing through the quests, they will be building many different decks, rather than a single deck with a few occasional tweaks here and there.  This takes off some of the pressure to build a \"perfect\" deck which will make it all the way from Passage through Mirkwood to Rhosgobel with minimal losses (and therefore minimal time).  Again, this is not a video game, where once you \"solve\" the quests the first time, subsequent play-throughs are a cakewalk. \n\n \n\nI'm really enjoying reading those blogs, and hope they focus now and then on some of the earlier quests, and maybe even address the bigger issues of how they allocate their time for LOTR LCG, how they manage overlapping decks, and how they decide when to progress to the next quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=750234","commentId":750234,"userName":"AjiTae","timestamp":1358605808,"content":"I too have a hard time making 50 cards decks and i find that 60-65 works well for me, especially with decent card drawing ability. So yeah dont limit yourself too much at first and at the end of a game just remove the cards you felt were more of a burden than anything else. The kind of card that sits dead in your hand or that has very little impact on the game when you play it.\n\nOther than that, you should try trisphere deckbuilding. With good ressource gaining power (like Steward of Gondor) and cards enabling you to have mutliple icons on your heroes (Songs, Celebrian's Stone, etc…), you'll do fine.\n\nMy last recommendation would be to not obsess over beating the first quest over and over again until you feel like you've mastered it. You beat it several times already, you should try going on (perhaps leaving Dol Guldur aside for now). It's interesting to confront a deck to different quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=750306","commentId":750306,"userName":"richsabre","timestamp":1358616032,"content":"tripecac said:\n\n \n\nWhile waiting for people to reply to my post (ha), I checked out the two new LOTR LCG blogs.  Great writing, great advice, great sense of knowing what they are doing. \n\nSome things were made clear to me while I was reading those blogs:\n\n1) The writers have lots of free time.  Not only were they spending what looked like several hours a week writing the blogs, but they were also spending several hours a week actually playing the game.  Their primary focus (of writing and playing) was on the new Gondor quests and cards, but they also were spending time either playing or at least refeshing themselves with the older quests and cards.  I'm guessing they each are devoting at least 10-15 hours each week to LOTR LCG.  Perhaps much more.  Momentum and improvement at any skill requires time, and they definitely seem to have it.  I'm very impressed, and a tad envious.\n\n \n\n \n\nhaha….good one. i used to do a blog (below in my links) that was tolkien lore orientated. the key word here was used to, as when i restarted my studies my time dissapeared. so i dont play this game as much as i liked, but what i would say is when you do play, think less of the game and more of the theme\n\nget immersed, at least thats how i get the most out of this game…..quality not quantity. still if the lore isnt so much for you then this doesnt really help.\n\nmy second piece of advice would be to visit this forum and talk with people here, that way you feel 'connected' to the game even when you are not playing it…..keeps the interest up.\n\ni tend to find my momentum goes when no news is posted….like now, but when new cards come out i end up playing alot more\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=750452","commentId":750452,"userName":"tripecac","timestamp":1358640911,"content":"I think at this point one of the big decisions I need to make is whether to continue to play 1-handed solo or switch to 2-handed. \n\nI realize that 2-handed solo play is a form of \"cheating\", since the player knows which cards are in each deck (although you could argue that people who play together often develop \"signals\" and \"tells\" similar to bridge players, so they don't really hide everything from each other).  Also, it requires more table space, and more thinking, since you have to keep tabs on twice as many heroes, threat values, etc.  And finally, it might be harder to play 2-handed via software in those cases when we either don't have access to cards, (e.g., when travelling) or want to record play (for tutorials or to have someone check the validity of our play).\n\nHowever, 1-handed solo, while officially endorsed, has fundamental disadvantages as well.  For one, it appears to be a bit more difficult than 2 players on many quests (Escape from Dol Guldur).  Also, certain cards and functions don't really get used in solo play (Wandering Took, archery, sentinel), so game becomes a little \"shallower\".  And finally, solo decks are not allowed to specialize to the same degree than multiplayer decks can, since solo decks can't depend on a second player to fill the gaps; this forces us to \"water down\" our deck building experiments a bit.\n\nSo which is the lesser of the 2 evils? \n\nWhich is more fun in the long run?\n\nWhich works best for people with limited time to play, say 2-3 hours a week max?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=750468","commentId":750468,"userName":"Cutievalkyrie","timestamp":1358643956,"content":"For me i played solo game first until core set quest 3 since there is no way to beat it one handed.\n\nThen i changed back to solo since i found 2 handed playing cheated as you said.\n\nSolo is better to me but most of the ranged characters wont be used in my deck, which is kinda waste.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=752002","commentId":752002,"userName":"Glaurung","timestamp":1358920701,"content":"Solo is solo. Coop is coop. 2 hands solo? Yes can pay and get fun but there is some cheating and to much thinking…..\n\nI happy play solo as 1 hand and coop with my friends. Game is really good solo but true if you play mostly solo you will become a strong player mostly and after coop game is too easy for you. But HON change it so im happy with that. +New nightmare packs coming so i double happy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=752215","commentId":752215,"userName":"tripecac","timestamp":1358945908,"content":"I watched the first Anduin video from Cardboard of the Rings last night.  It was very interesting to see 2 decks [coop] in action.  One deck was mostly questing/support, and the other mostly fighting.  They got unlucky with some encounter card draws, but overall I could see how each individual deck was much more focused on its role than I can ever get playing 1-deck, simply because 1-deck solo players have to water down their decks in order to be able to handle questing, combat, and support.\n\nI agree that if someone can master solo 1-deck play, he/she can probably do a great job coop as well, since the player will instinctively water down his/her deck a bit, \"just in case\".  That way, if the other player cannot for some reason fulfill his role, it's not the end of the world, since the master solo player still has those \"just in case\" cards.\n\nIt's like, imagine an experienced solo pianist happens to be playing a gig with a drummer, but the drummer gets sick and has to leave.  The pianist, while not expecting to play a solo show, and not fully prepared for it, can at least fall back on some songs which do not require the drummer.  Those songs are like the \"just in case\" cards that a solo player includes in his/her decks.\n\nHowever, it's a long, long road to mastery, at least for those of us with limited time and/or IQ. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  And some of us are content to remain solo musicians.  So, the question is: do we stick to playing one instrument at a time, or do we \"overdub\", which means playing with 2 decks?  Yes, pretending to be 2 people at once is \"cheating\", but it can allow us to experience aspects of the music/game which are not available to true solo play.\n\nSo which is better: becoming a better player, or experiencing more of the game?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=752464","commentId":752464,"userName":"Glaurung","timestamp":1358977808,"content":"tripecac said:\n\nI watched the first Anduin video from Cardboard of the Rings last night.  It was very interesting to see 2 decks [coop] in action.  One deck was mostly questing/support, and the other mostly fighting.  They got unlucky with some encounter card draws, but overall I could see how each individual deck was much more focused on its role than I can ever get playing 1-deck, simply because 1-deck solo players have to water down their decks in order to be able to handle questing, combat, and support.\n\nI agree that if someone can master solo 1-deck play, he/she can probably do a great job coop as well, since the player will instinctively water down his/her deck a bit, \"just in case\".  That way, if the other player cannot for some reason fulfill his role, it's not the end of the world, since the master solo player still has those \"just in case\" cards.\n\nIt's like, imagine an experienced solo pianist happens to be playing a gig with a drummer, but the drummer gets sick and has to leave.  The pianist, while not expecting to play a solo show, and not fully prepared for it, can at least fall back on some songs which do not require the drummer.  Those songs are like the \"just in case\" cards that a solo player includes in his/her decks.\n\nHowever, it's a long, long road to mastery, at least for those of us with limited time and/or IQ. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  And some of us are content to remain solo musicians.  So, the question is: do we stick to playing one instrument at a time, or do we \"overdub\", which means playing with 2 decks?  Yes, pretending to be 2 people at once is \"cheating\", but it can allow us to experience aspects of the music/game which are not available to true solo play.\n\nSo which is better: becoming a better player, or experiencing more of the game?\n\n \n\n\n\nCarboard of the rings they are nice guys but they dont know how to play this game. They lost not becouse of the bad draw, cose they dont see the way what to do. they Suffer from the location for couple of rounds but in he same time he has Stand and fight and his friend has snowborh scout in his discard pile. This is very very big mistake. If i make mistake like this is not mean i have bad luck is just dont know how to play this game. They decks not really working together and sorry to say but they dont know how to build up the decks for synergy.  They just play 2 solo decks togehter. And most of players do it! And why not?\n\nGame didn provide enough challenge when you will lose all the time if you not really cooperate. BUt HON change it! Now you have to build up coop decks with a good synergy with 2 + player game. And i love it!\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=752503","commentId":752503,"userName":"Ellareth","timestamp":1358982716,"content":"Glaurung said:\n\nCarboard of the rings they are nice guys but they dont know how to play this game…… They decks not really working together and sorry to say but they dont know how to build up the decks for synergy.\n\nDon't let Jared (one of the co-host of CotR) hear this one…. from the show I get the impression he is some kind of bad-ass who will come up with game-breaking comboes and like to do other people's fighting for the fun of it.\n\nWhile I agree some of their plays may not have been optimun, you can't take a long time thinking out your moves while recording for a video that is intended to entertain newer players…. and I think they were building decks out of Core Set cards only so how much deckbuilding could have been done?\n\n \n\n \n\ntripecac said:\n\nimagine an experienced solo pianist happens to be playing a gig with a drummer\n\n\n\nDrum and Piano duo? Sounds like one jazzed up craziness."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=752518","commentId":752518,"userName":"Glaurung","timestamp":1358985734,"content":"Ellareth said:\n\n \n\n \n\nDon't let Jared (one of the co-host of CotR) hear this one…. from the show I get the impression he is some kind of bad-ass who will come up with game-breaking comboes and like to do other people's fighting for the fun of it.\n\n\n\nDont worry about this we know each other and i always was critic about them, they now this very well. They even block me on youtube.Ha ha ha!\n\nThey only like when someone comment : you are great and amaizing and never accept any critics. But what i must to say they play beter now but still not as good as they should in my opinion. Anyway is my point of view and i always say this for couple of years im here.\n\nNow i upload my first video where i wonna show how i play this game agaisnt Ambush in Ithilien scenario. This video was done yesterday when i got good stand for my galaxy note 2. i will put the link here soon\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=752605","commentId":752605,"userName":"Glaurung","timestamp":1359001438,"content":"Glaurung said:\n\nEllareth said:\n\n \n\n \n\n \n\nDon't let Jared (one of the co-host of CotR) hear this one…. from the show I get the impression he is some kind of bad-ass who will come up with game-breaking comboes and like to do other people's fighting for the fun of it.\n\n \n\n \n\nDont worry about this we know each other and i always was critic about them, they now this very well. They even block me on youtube.Ha ha ha!\n\nThey only like when someone comment : you are great and amaizing and never accept any critics. But what i must to say they play beter now but still not as good as they should in my opinion. Anyway is my point of view and i always say this for couple of years im here.\n\nNow i upload my first video where i wonna show how i play this game agaisnt Ambush in Ithilien scenario. This video was done yesterday when i got good stand for my galaxy note 2. i will put the link here soon\n\n \n\n\n\nOk i got good stand for my galaxy note 2 and record some video how i play random game against Ithilien. Sorry for quality this is my first video. Actually i have fun with this so i will make more videos sure. English is not my native language so sorry for some speech mistake. There is 2 mistake i done but they very small and doesn change notning. Check it out!\n\nHere is link for first part:\n\nhttp://youtu.be/L0lSm_vWGkQ  [http://youtu.be/L0lSm_vWGkQ%C2%A0]\n\nHere is link for second part:\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753166","commentId":753166,"userName":"Dain Ironfoot","timestamp":1359073562,"content":"As the second member of the \"Progression Series\" team, and not an \"official\" member of Cardboard of the Rings, I think you are full of it, Glaurung.\n\nFirst off, it is easy to sit and critique a video after it's been made. Anyone can be an \"arm chair quaterback.\" But there are so many things to think of when making a vid on OCTGN: is my sound working? do i remember the hotkeys? are we being boring? am i playing the right cards? what's my next move? what is mitch saying? etc, etc, etc. Hell, when I watch the videos to edit them, even *I* think of things we could have done differently. But, again, that's so easy to do when you aren't in the moment. \n\nI will never claim to be \"perfect\" at this game - but to insinuate that I \"don't know how to play\" is insulting, rude, and frankly, uneccessary. I play this game because I love Lord of the Rings and I love this game. Not to be perfect. Not to seem better than anyone else. Not to flaunt how great my deckbuilding skills are. But b/c of the LOVE I have for LOTR and the great friends I've meet because of this game, the FFG Forums, and yes, because of COTR.\n\nAdditionally, we are not building \"solo\" decks and mashing them together. Frankly, there is no way my decks would work solo, as they are mostly tactics.\n\nNot to mention, I accept all criticism, not simply \"I am perfect, wonderful, etc.\" There have been plenty of comments, both critical and supportive, but all made with a tact you seem to lack. \n\nPlus, if you dislike COTR so much, and think they \"don't know how to play the game\" and have been telling this to everyone on the Forums who would listen, why do you even bother to watch the COTR videos and comment on them? Seems to me you'd be much happier never listening/watching/talking about anything COTR ever does, ever again. Why you feel the need to, year after year, bash on the COTR guys is beyond me.\n\nNonetheless, I'm glad to see you finally putting out videos and putting your money where your mouth is. In the future, you should refrain from bashing others, whom you know nothing about, and focus on your own videos.\n\nSo you see, when you bash COTR, not only are you insulting people I now call my good friends, you are insulting me. And, at the end of the day, that is poor sportsmanship. Yes, I am going to forget things. Yes, my decks might not be optimal. But there are \"correct\" ways and \"not-so-correct\" ways to help the community grow as players. I'd prefer comments that are intended to lift up others, not tear them down as \"know nothings.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753167","commentId":753167,"userName":"Dain Ironfoot","timestamp":1359073568,"content":"edit: duplicate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753200","commentId":753200,"userName":"Glaurung","timestamp":1359081086,"content":"Dain Ironfoot said:\n\nAs the second member of the \"Progression Series\" team, and not an \"official\" member of Card Board of the Rings, I think you are full of it, Glaurung.\n\nFirst off, it is easy to sit and critique a video after it's been made. Anyone can be an \"arm chair quaterback.\" But there are so many things to think of when making a vid on OCTGN: is my sound working? do i remember the hotkeys? are we being boring? am i playing the right cards? what's my next move? what is mitch saying? etc, etc, etc.\n\nI will never claim to be \"perfect\" at this game - but to insinuate that I \"don't know how to play\" is insulting, rude, and frankly, uneccessary. \n\nAdditionally, we are not building \"solo\" decks and mashing them together. Frankly, there is no way my decks would work solo, as they are mostly tactics.\n\nNot to mention, I accept all criticism, not simply \"I am perfect, wonderful, etc.\" There have been plently of comments, both critical and supportive, but all made with a tact you seem to lack. \n\nI'm glad to see you finally putting out videos and putting your money where your mouth is. In the future, you should refrain from bashing others, whom you know nothing about, and focus on your own videos (and putting on a shirt, for goodness sake). \n\n\n\nHmmm i dont think i insult someone if i say you dont know how to play this game. I never say something bad i mean a bad word. Any good critics is always good in my opinion. But you right i should to put my video long time ago. Sorry didn have time for it enough. And sure my videos will be never good as CB of the ring cose i just dont have expirience how to make all this design things on computer. My videos is purely about the game and win the game agianst most difficult and crazy situation and quests. And there is real table and real cards.\n\nI still looking every things what Cardboard of the ring do. And that why i say they still not get right experience in this game. But i dont insult them in my opinion.. I just clear the fact.  Jarred actually is cool player. I enjoy his idea and the way of his playing. About other i just can say : Practice, practice, prctice.\n\nWhen you have stand and fight in your hand and your friend have snowborn scout in his discard pile and you suffer from 3 rounds from 3 threat location this is not  bad luck. This is fondumental error. And if this happen after 1 year of playing this is a problem. So learn the lesson! If you have hasty storke and you know there is a batlle ahead but you dont have the recources is not bad luck. This is fondumental error.\n\n And there is a plenty people in the web who do they things good. Look on the Tales of the ring or Hall of Beorn website. They make amazing job!!! i really respect them for what they doing!\n\nI hope you got my points. I dont want to insult anyone so just litte bit critics. I try to give you a bit hot pepper to make you more active. My goal was never to insult. We all love this game and Tolkien so is united us right? I will try to be less critics if you wish no problem.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753203","commentId":753203,"userName":"Dain Ironfoot","timestamp":1359081480,"content":"Well, I was the player with the Snowborn Scout in my discard pile, so we are clear (I'm Matthew).\n\nBut, with that said, I will take any and all comments that are intended to build up a player and make him better. But you know what, people forget things. People make mistakes. No one is perfect.\n\nIt's not what you are saying, but how you come across (and perhaps it's a language barrier thing, I don't know).\n\nI've made mistakes in the videos - some of them have cost us the game. But to err is human, to forgive is divine.\n\nI can never promise to make a perfect video, a perfect deck, or play the game perfectly. What I can do is have a great time with my friends, get to travel and have an adventure in Middle Earth, and hope that, along the way, other people can enjoy the game as much as I do.\n\nAs I said before, I've made so many new friends in real life because of this game -friends I will probably have for a lifetime. This is what keeps me playing. My love of Middle Earth and making new friends. Not to be perfect. And certainly not to be told I \"don't know what I'm doing.\"\n\nSo, no, I reject the idea that it's a \"fundamental error\" - It's called being forgetful. It's called being human."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753218","commentId":753218,"userName":"Glaurung","timestamp":1359083779,"content":"Dain Ironfoot said:\n\nWell, I was the player with the Snowborn Scout in my discard pile, so we are clear (I'm Matthew).\n\nBut, with that said, I will take any and all comments that are intended to build up a player and make him better. But you know what, people forget things. People make mistakes. No one is perfect.\n\nIt's not what you are saying, but how you come across (and perhaps it's a language barrier thing, I don't know).\n\nI've made mistakes in the videos - some of them have cost us the game. But to err is human, to forgive is divine.\n\nI can never promise to make a perfect video, a perfect deck, or play the game perfectly. What I can do is have a great time with my friends, get to travel and have an adventure in Middle Earth, and hope that, along the way, other people can enjoy the game as much as I do.\n\nAs I said before, I've made so many new friends in real life because of this game -friends I will probably have for a lifetime. This is what keeps me playing. My love of Middle Earth and making new friends. Not to be perfect. And certainly not to be told I \"don't know what I'm doing.\"\n\nSo, no, I reject the idea that it's a \"fundamental error\" - It's called being forgetful. It's called being human.\n\n\n\nOk i got your point. We just aprroach different to diferrent things. You trying to defense but im not attacking you! If i insult you sorry. I will not do it agian.There is no point for me do something like this. Here is culture diffirent and also my english is not perfect.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753362","commentId":753362,"userName":"tripecac","timestamp":1359108669,"content":"Matthew and the other CotR folks are excellent at communicating their ideas and enthusiasm for the game.  That is why we follow them.  They are pleasant.\n\nGlaurung, you might be good at playing games, but you are not very good at communicating.  Your posts are negative, unconstructive, and painful to read due to all the spelling and grammatical mistakes.  Your posts are unpleasant.\n\nThis is the Internet.  This is where people communicate.  We come here to find positive, constructive, enthusiastic posts, podcasts, and videos.  We come here to be educated and entertained.  We come here to experience something pleasant.\n\nMy suggestion is that you go play some games, by yourself, and stop wasting your (and our) time on forums.  That way, you can become more perfect, and the forum can become more pleasant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753750","commentId":753750,"userName":"Glaurung","timestamp":1359164103,"content":"tripecac said:\n\nMatthew and the other CotR folks are excellent at communicating their ideas and enthusiasm for the game.  That is why we follow them.  They are pleasant.\n\nGlaurung, you might be good at playing games, but you are not very good at communicating.  Your posts are negative, unconstructive, and painful to read due to all the spelling and grammatical mistakes.  Your posts are unpleasant.\n\nThis is the Internet.  This is where people communicate.  We come here to find positive, constructive, enthusiastic posts, podcasts, and videos.  We come here to be educated and entertained.  We come here to experience something pleasant.\n\nMy suggestion is that you go play some games, by yourself, and stop wasting your (and our) time on forums.  That way, you can become more perfect, and the forum can become more pleasant.\n\n\n\nI stay here on this forum for long time. Cannot say same about you……… \n\n I think i have rights to critics everyone whom i want and tell what i think. And i know this game by heart and i build up top decks in this game(just cose they a most rated and popular on different forums) so i know what im talking about. You can look my video to see how im play this game and make your own conclusion about it.  I like to talk straight without any bla bla bla.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753789","commentId":753789,"userName":"TheLightdarker","timestamp":1359175871,"content":"Glaurung -\n\nIt doesn't take elf-eyes to see that tripecac has made some perfectly rational, logical points, which unfortunately, you only served to reinforce in the response you posted. For someone whom has cast stones at me personally for allegedly claiming to be an expert at this game (something, need I remind you, that I have never once claimed to be), you are extraordinarily entitled; \"I have been on these forums for longer than you! Do you know who I am? I know this game by heart! I demand you respect me!\"\n\nYou certainly have the right to criticize anyone and everyone that your heart so desires; of course, you should also understand that everyone else has the right to ignore you. If that means my blocking you on YouTube several months ago, shortly prior to my long hiatus from producing any videos, guess what? I chose, and continue to choose, not to needlessly subject myself and my viewers to your, in the words of King Theoden, reckless hate - purely destructive criticism.\n\nHere's some advice for you, since you seem to take it upon yourself to coach everyone else on how best to play this game; telling me, or anyone else, that I (or they), \"don't know how to play the game\" does not do anyone any favors. In the video you mentioned, where I forgot that Matthew had a Snowbourne Scout in his discard pile and I had a Stand and Fight event sitting unused in my hand, it was not because there is something \"fundamentally wrong\" with me. It was a simple mistake, and as Matthew so eloquently wrote, there is much more going on in my mind when I'm trying to make a video worth watching than \"what is the optimal play at this exact moment?\" Plus, since you don't seem to use OCTGN, the fact that my teammate's discard pile is not visible to me in this digital format did nothing to prevent this, in hindsight, glaring error.\n\nDo I claim to be a paragon player, as you seem to about yourself? No, I do not. In fact, sitting down and playing enumerable games of LOTR LCG is far from my primary use of free time; I generally play a new scenario a handful of times, usually until I am victorious and have at least some personal play experience worth mentioning on the Cardboard of the Rings podcast, and then I move on to doing something else. In fact, I will openly admit that, due in large part to the unrelenting and frustrating, derogatory comments from you and a couple of others that tarnished and deadened my enthusiasm to continue producing videos and participate in Cardboard of the Rings, I did not touch LOTR LCG in the space of time between the end of Gencon 2012, and the release of Heirs of Numenor.\n\nWhile I very much enjoy being an active part of this card game's online community, I will readily acknowledge that I do not put in nearly as much playtime as some, and unlike yourself, do not play scenarios to death; there's certainly no \"get together with people on the weekend for some games of LOTR LCG\" for me, where I live. As a result, yes, admittedly I not only make mistakes, but am therefore a sub-optimal player due in large part to my lesser experience, relative to many others. Does this prevent me from having passion and enthusiasm about this game? No, it does not. Does it prevent me from being a, dare I say it, relatively skilled player? No, it does not. Does pointless flaming from you and a few others discourage me from putting in the time and effort required to generate content that the vast majority of the LOTR LCG community not only tolerates, but in many cases, enjoys? It certainly did, for many months, though I've yet to entirely abandon this game, and am glad to finally be back producing regular content.\n\nAs this is far from the first time that you've criticized me, or any of the individuals that participate in the Cardboard of the Rings podcast or videos, I've seen from experience that, when confronted, just like you've done now, you temporarily rescind your insults and flaming and claim that you're only trying to be helpful; of course, down the road, you crawl back out of your hole (just as you originally did, in this thread), and pointlessly unleash still more hatred upon our content. If someone likes our series, great; we appreciate their views, comments, likes, and what have you. We have certainly come to understand that you, personally, do not; pointing out mistakes and providing suggestions for how to improve our play, decks, and our series is very helpful, as many viewers have readily, and tactfully, demonstrated, for both the COTR podcast and LCG Progression Series.\n\nHowever, you have demonstrated time and time again that you are unable, or perhaps unwilling, to do this; therefore, I would like to take this opportunity to encourage you, Glaurung, to abstain from viewing any future COTR content. Either take the burden upon yourself to comment in a mature, sportsmanlike manner (as befiting an alleged former pro MTG player), or avoid the Progression Series and podcast entirely. You have shown yourself to be an above average player, with plenty of reasonable advice and sound suggestions to make; your input would certainly be appreciated, but abrasive and derogatory comments will continue to be ignored, and continue to do little more than generate needless frustration and ire."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=753834","commentId":753834,"userName":"Glaurung","timestamp":1359186429,"content":"TheLightdarker said:\n\nGlaurung -\n\nIt doesn't take elf-eyes to see that tripecac has made some perfectly rational, logical points, which unfortunately, you only served to reinforce in the response you posted. For someone whom has cast stones at me personally for allegedly claiming to be an expert at this game (something, need I remind you, that I have never once claimed to be), you are extraordinarily entitled; \"I have been on these forums for longer than you! Do you know who I am? I know this game by heart! I demand you respect me!\"\n\nYou certainly have the right to criticize anyone and everyone that your heart so desires; of course, you should also understand that everyone else has the right to ignore you. If that means my blocking you on YouTube several months ago, shortly prior to my long hiatus from producing any videos, guess what? I chose, and continue to choose, not to needlessly subject myself and my viewers to your, in the words of King Theoden, reckless hate - purely destructive criticism.\n\nHere's some advice for you, since you seem to take it upon yourself to coach everyone else on how best to play this game; telling me, or anyone else, that I (or they), \"don't know how to play the game\" does not do anyone any favors. In the video you mentioned, where I forgot that Matthew had a Snowbourne Scout in his discard pile and I had a Stand and Fight event sitting unused in my hand, it was not because there is something \"fundamentally wrong\" with me. It was a simple mistake, and as Matthew so eloquently wrote, there is much more going on in my mind when I'm trying to make a video worth watching than \"what is the optimal play at this exact moment?\" Plus, since you don't seem to use OCTGN, the fact that my teammate's discard pile is not visible to me in this digital format did nothing to prevent this, in hindsight, glaring error.\n\nDo I claim to be a paragon player, as you seem to about yourself? No, I do not. In fact, sitting down and playing enumerable games of LOTR LCG is far from my primary use of free time; I generally play a new scenario a handful of times, usually until I am victorious and have at least some personal play experience worth mentioning on the Cardboard of the Rings podcast, and then I move on to doing something else. In fact, I will openly admit that, due in large part to the unrelenting and frustrating, derogatory comments from you and a couple of others that tarnished and deadened my enthusiasm to continue producing videos and participate in Cardboard of the Rings, I did not touch LOTR LCG in the space of time between the end of Gencon 2012, and the release of Heirs of Numenor.\n\nWhile I very much enjoy being an active part of this card game's online community, I will readily acknowledge that I do not put in nearly as much playtime as some, and unlike yourself, do not play scenarios to death; there's certainly no \"get together with people on the weekend for some games of LOTR LCG\" for me, where I live. As a result, yes, admittedly I not only make mistakes, but am therefore a sub-optimal player due in large part to my lesser experience, relative to many others. Does this prevent me from having passion and enthusiasm about this game? No, it does not. Does it prevent me from being a, dare I say it, relatively skilled player? No, it does not. Does pointless flaming from you and a few others discourage me from putting in the time and effort required to generate content that the vast majority of the LOTR LCG community not only tolerates, but in many cases, enjoys? It certainly did, for many months, though I've yet to entirely abandon this game, and am glad to finally be back producing regular content.\n\nAs this is far from the first time that you've criticized me, or any of the individuals that participate in the Cardboard of the Rings podcast or videos, I've seen from experience that, when confronted, just like you've done now, you temporarily rescind your insults and flaming and claim that you're only trying to be helpful; of course, down the road, you crawl back out of your hole (just as you originally did, in this thread), and pointlessly unleash still more hatred upon our content. If someone likes our series, great; we appreciate their views, comments, likes, and what have you. We have certainly come to understand that you, personally, do not; pointing out mistakes and providing suggestions for how to improve our play, decks, and our series is very helpful, as many viewers have readily, and tactfully, demonstrated, for both the COTR podcast and LCG Progression Series.\n\nHowever, you have demonstrated time and time again that you are unable, or perhaps unwilling, to do this; therefore, I would like to take this opportunity to encourage you, Glaurung, to abstain from viewing any future COTR content. Either take the burden upon yourself to comment in a mature, sportsmanlike manner (as befiting an alleged former pro MTG player), or avoid the Progression Series and podcast entirely. You have shown yourself to be an above average player, with plenty of reasonable advice and sound suggestions to make; your input would certainly be appreciated, but abrasive and derogatory comments will continue to be ignored, and continue to do little more than generate needless frustration and ire.\n\n\n\nHmmm i think we just dont understand each other and is not only cose my engilsh but also cose we are really different people.\n\nLooks like  really hurt you by my words. Im sorry for that. I really sorry Lightdarker. I think better i will say nothing cose most of the times you take it to personal.  Just lets forget about it. Im sorry if i harm you. I just try little play with you dudes but you take everything to close to your heart so better i will keep silence. Ok? \n\nAnd your conclusion about me very wrong! But i think is my foult cose im not really good typer in English.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=754000","commentId":754000,"userName":"tripecac","timestamp":1359213471,"content":"Glaurung, it's not your English that is annoying people; it's your attitude. \n\nYou apparently can't help insulting even as you are [fake] retreating.  You come across as a real people-hater, with absolutely no empathy.  You think the world in general is lesser than yourself.  How miserable it must be to be you, surrounded by weak, stupid people. \n\nWell, at least these weak, stupid people understand each other, and appreciate each other's writing, podcasts, and videos.  We derive pleasure out of each other's efforts.  That's why we keep coming to this forum: we want to share ideas and experiences.  We appreciate the community for what it is: a bunch of people coming together and pooling their resources, acting cooperatively and symbiotically.\n\nI don't think you quite \"get\" the community aspect here.  Either you are not mature enough, or you just don't have it \"in your cards\" (unstable upbringing perhaps?)  Regardless, I believe everyone (including yourself) would be happier if you just retreat to your aryan bunker, play your cards, pull the heads off barbies, whatever is it you do for genuine enjoyment…  Just please don't keep trying to interact with the outside world, because you are not ready for it. \n\nPut it this way: each time you post, you are raising your threat level by one.  Nothing you say ever seems to bring your threat back down.  If you keep going at this rate, eventually you will \"engage\" a moderator, and will be banned.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756002","commentId":756002,"userName":"Glaurung","timestamp":1359537987,"content":"tripecac said:\n\nGlaurung, it's not your English that is annoying people; it's your attitude. \n\nYou apparently can't help insulting even as you are [fake] retreating.  You come across as a real people-hater, with absolutely no empathy.  You think the world in general is lesser than yourself.  How miserable it must be to be you, surrounded by weak, stupid people. \n\nWell, at least these weak, stupid people understand each other, and appreciate each other's writing, podcasts, and videos.  We derive pleasure out of each other's efforts.  That's why we keep coming to this forum: we want to share ideas and experiences.  We appreciate the community for what it is: a bunch of people coming together and pooling their resources, acting cooperatively and symbiotically.\n\nI don't think you quite \"get\" the community aspect here.  Either you are not mature enough, or you just don't have it \"in your cards\" (unstable upbringing perhaps?)  Regardless, I believe everyone (including yourself) would be happier if you just retreat to your aryan bunker, play your cards, pull the heads off barbies, whatever is it you do for genuine enjoyment…  Just please don't keep trying to interact with the outside world, because you are not ready for it. \n\nPut it this way: each time you post, you are raising your threat level by one.  Nothing you say ever seems to bring your threat back down.  If you keep going at this rate, eventually you will \"engage\" a moderator, and will be banned.\n\n \n\n \n\nWow!!! LOL!!!you sounds so funny!I dont need to answer cose there is no point to answer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756325","commentId":756325,"userName":"leptokurt","timestamp":1359571852,"content":"tripecac said:\n\n \n\nMatthew and the other CotR folks are excellent at communicating their ideas and enthusiasm for the game.  That is why we follow them.  They are pleasant.\n\nGlaurung, you might be good at playing games, but you are not very good at communicating.  Your posts are negative, unconstructive, and painful to read due to all the spelling and grammatical mistakes.  Your posts are unpleasant.\n\nThis is the Internet.  This is where people communicate.  We come here to find positive, constructive, enthusiastic posts, podcasts, and videos.  We come here to be educated and entertained.  We come here to experience something pleasant.\n\nMy suggestion is that you go play some games, by yourself, and stop wasting your (and our) time on forums.  That way, you can become more perfect, and the forum can become more pleasant.\n\n \n\n \n\n \n\nYeah, this is the internet - the place where only one opinion is allowed. Don't be different!\n\nThe only purpose of this post is to insult someone deliberately.  At least Glaurung apologized for hurting the feeling of others. I hope you think over what you have written. One might agree or disagree with Glaurung's opinions, but he is certainly no troll and I never saw him insulting someone on purpose. Like this post somehow does, or did it have another intention that I missed? Yo know, I see the internet still as a democracy and not as a closed society for the chosen ones. Frankly said, posts like these make me angry.\n\nI have a lot of respect for Dain Ironfoot and Lightdarker, who regularly make interesting posts (haven't seen one of their videos so far, so - shame on me?). Of course they should defend themselves against criticism. However, I think that they don't get what this is about. I think they made good points about the problems of creating a video and playing at the same time and I guess Glaurung has by now made the experience that producing a video wit out making mistakes is not that easy. While Glaurung is right about the mistakes that were made and wanting to be helpful he forgets that phrases like \"you don't know how to play the game\" are harsh and over the top. I really don't want to hear these words again. The rules of this game are difficult, and I make a lot of mistakes myself. Almost everyone does. And yes, strategical mistakes do happen, too. I think it is good to point them out, but without making the player look like a dumbass, even if that's not what you want.\n\nHowever, I don't think that it's Glaurung's intention to gloat or to insult other players. I'm fairly sure that's not the case. I am an emphatic person, I know many Russians, so I am able to \"translate\" Glaurung's posts to get his intention. And it's the intention that is important to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756377","commentId":756377,"userName":"tripecac","timestamp":1359579241,"content":"So much for momentum, eh?  These posts consumed a lot of time to read and write, and didn't really get us anything other than that icky feeling of having stepped on a bunch of people's toes.  Glaurung, sorry for the harshness. \n\nBack to the topic…\n\nThose CotR videos made me want to try 2-handed.  However, some recent Beorn's Path blog entries have been focusing on 1-handed play.  So I'm back to that indecisive point, and am essentially stalled.  I'm not sure if I want to invest the time in learning 2-handed play, but at the same time I don't want to \"miss out\" on key elements of the game.  I don't think Wandering Took is a \"key element\", but what about Archery?  Sentinel?  Increase deck specialization?\n\nSo what I'm wondering is if the quests and cards after Rhosgobel get more skewed toward 2-players, in terms of difficulty and gameplay depth.  Or do they diminish the difference between 2-deck and 1-deck play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756411","commentId":756411,"userName":"Ellareth","timestamp":1359586194,"content":"tripecac said:\n\n Took is a \"key element\", but what about Archery?  Sentinel?  Increase deck specialization?\n\nSo what I'm wondering is if the quests and cards after Rhosgobel get more skewed toward 2-players, in terms of difficulty and gameplay depth.  Or do they diminish the difference between 2-deck and 1-deck play?\n\n\n\n \n\nWhile I exclusively play 1-deck play (I make enough mistakes while playing 1 handed, it is going to be impossible for me to follow every rules while playing 2 handed), the quests after Rhosgobel will get more aimed for 2 or more players.\n\nYou will miss half the mechanics in Return to Mirkwood while playing solo (many effects and decisions regarding who guards Gollum), a major mechanic in Foundation of Stone (splitting and reuniting staging area), and few mechanics in Shadow and Flame / Battle for Laketown (Balrog and Smaug attacking multiple players).\n\nYou will be missing out on Sentinel keyword (ranged is somewhat relevent in solo too with Hands Upon Bow) and other card effects (Song of Earendil, the one where you get to draw card and lower threat by playing attachment to other player…. I can't remember the name because I haven't seen it since sleeving it).\n\nAnd of course, As you pointed out, playing 2 handed gives you many gameplay depth.\n\nIt sounds like double-handing (trying to avoid the term double-fisting) is the way to go…. however, playing single-handed has it's merit too because I only play single-handed but still enjoy this game very much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756454","commentId":756454,"userName":"leptokurt","timestamp":1359592866,"content":"To help to bring this back on topic:\n\n \n\nI agree that mosts quests of the Dwarrodwelf cycle have been designer with 2 players in mind. Like Ellareth said, RtM is a good example for this. Shadow and Flame too might be more interesting if you have to defend two decks. Secrecy decks are more powerful when playing multiplayer.\n\nSo yes, there are some reasons to play twohanded. I did this when playing against RtM and Escape from Dol Guldur, as both adventures were not very enjoyable for solo playing. It's doable, but requires more time and a big(ger) table. It's also harder IMO as you have to additionally think over how you can make these two decks work together (synergies). And you're more likely to make mistakes, as has been mentioned. I sometimes even forgot to draw cards or to switch objectives etc. The main issue for me against playing tow handed is that it requires a lot of time and that it is sometimes a bit stressful.\n\nThe good thing is that with all these deckbuilders in the internet you can take easily build two decks that you want to play together. Perhaps that is what you should do, then you should try this, playing against an easier scenario. Rich got hooked after playing two handed. I still prefer to play solo. ANd I'm having fun, which I guess is the most important thing. And as long as you have fun you can do whatever you want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756952","commentId":756952,"userName":"Raven1015","timestamp":1359675016,"content":"tripecac said:\n\nWhile waiting for people to reply to my post (ha), I checked out the two new LOTR LCG blogs.  Great writing, great advice, great sense of knowing what they are doing. \n\nSome things were made clear to me while I was reading those blogs:\n\n1) The writers have lots of free time.  Not only were they spending what looked like several hours a week writing the blogs, but they were also spending several hours a week actually playing the game.  Their primary focus (of writing and playing) was on the new Gondor quests and cards, but they also were spending time either playing or at least refeshing themselves with the older quests and cards.  I'm guessing they each are devoting at least 10-15 hours each week to LOTR LCG.  Perhaps much more.  Momentum and improvement at any skill requires time, and they definitely seem to have it.  I'm very impressed, and a tad envious.\n\n2) They use multiple overlapping decks (e.g., multiple decks utilizing Spirit cards).  They aren't restricting themselves to one deck with 2 spheres and the other deck with the other spheres.  Maintaining overlapping decks with a single set of real cards seems a bit of a pain, since you have to continually move a randomly sorted subset of cards from one deck to another; plus, you have to remember which cards are in which deck.  So either they have nimble fingers and memories (or write everything down), or they have purchased multiple copies of the quest packs, or they play mostly virtually.  I am curious which is the case.\n\n3) They don't aim for, or expect perfection.  It seems very clear in their heads that there are no \"perfect\" decks, and even their favorite decks lose some times.  Different decks have different success rates at different quests; none have a 100% success rate on 100% of the quests.  Ditto for individual cards.  Some cards and decks seem to be preferred over others, but the writers never seem to \"settle\" on a single deck consisting of only favorite cards.  LOTR LCG is not like a video game where once you develop a \"winning\" character or strategy, you stick with it forever.  The writers seem to accept, and even appreciate, the fact that while progressing through the quests, they will be building many different decks, rather than a single deck with a few occasional tweaks here and there.  This takes off some of the pressure to build a \"perfect\" deck which will make it all the way from Passage through Mirkwood to Rhosgobel with minimal losses (and therefore minimal time).  Again, this is not a video game, where once you \"solve\" the quests the first time, subsequent play-throughs are a cakewalk. \n\n \n\nI'm really enjoying reading those blogs, and hope they focus now and then on some of the earlier quests, and maybe even address the bigger issues of how they allocate their time for LOTR LCG, how they manage overlapping decks, and how they decide when to progress to the next quest.\n\n\n\n \n\nJust came across this post. As the writer of one of those blogs (Tales from the Cards), I thought I'd chime in here (and thanks for reading and the kind words by the way).\n\n1) You are not wrong. Writing for TftC requires a lot of free time, and your 10-15 hours estimate is probably pretty accurate. The fact that I recently came into a lot of free time is what allowed me to start up the blog in the first place. Soon I won't have quite as much time available, and I've made plans for how I will deal with that situation. I empathize with your situation of momentum greatly. When the game first came out, I was obsessed and played at least one game when I got home from work about 3-4 times a week. At that point, I spent most of my available free time playing and didn't really engage with the community that much. Then there was a space of about 4-5 months where I was extraordinarily busy and had no time to play or keep up with things. This was a \"dark period\" or \"extended break\", whatever you want to call it. I always had the memory of how much I loved the game though, but it was really hard to get back into the game, because of the same analysis paralysis that it seems like you are going through. The hardest part was playing that very first game back. After that, I got sucked right back in, spending endless hours playing the game and writing about it. My biggest advice to you would be to not overthink it too much. Don't worry about being perfect on each scenario. Beat it once or twice and move onto a new one and keep that momentum going and get experience. Once you start feeling comfortable you can always go back and play earlier scenarios to your heart's content, but the biggest thing right now is to get enjoyment out of the game. If anything, it shouldn't feel like a task, the more you have fun, the more you'll build up natural momentum.\n\n2) Again, you're correct. I have multiple different decks I play with and work on at the same time. I generally create and store them on Card Game DB for ease. My cards are all stored in a card binder, organized by sphere and type. This makes it a fairly quick process to break down decks and build new ones.  I quickly sort them into spheres and type and put them back in the binder. Then I follow my deck lists and quickly pull the cards I need out of my binder. I guess you do build up a bit of nimble fingers after awhile. All my quests are sorted by encounter card set in a card storage box, and it is super quick to find them and combine them as well. I've spent a bit of money and time to organize things this way, but it saves me quite a bit of set-up time in the long run.\n\n3) I'm definitely not looking for perfection or the \"one deck to rule them all\". In my opinion, looking for perfection is sometimes the enemy of learning, in that it makes you too paralyzed by the thought of making mistakes to have fun and to experiment. I have a bit of deck ADD, in that I'll play certain decks for awhile, but then will get bored and try something new.I have specific decks built for certain quests, and others that tend to do well against a wide variety. The biggest thing that guides my deck-building is experimentation, usually starting with \"I wonder what would happen if I built a deck around…\"\n\n \n\nFinally, I'm a big proponent of 2-handed solo. I don't view it as cheating at all, because the table talk rules don't make much sense to me. We can say \"grey wizard\" but not Gandalf? We can say \"a certain readying attachment from the Spirit sphere\" but not \"Unexpected Courage\"? Doesn't add much to the experience in my book, but that's just my opinion. On the other hand, playing 2-handed lets you experience so much that you don't get 1-handed, and you get great experience with different types of decks and building synergies. Before my \"break\", I played exclusively 1-handed solo, but afterwards I almost always play 2-handed (I do still try out quests 1-handed as well though to see how they play). Don't get intimidated by the seeming complexity of playing 2-handed. Borrow someone else's decks and try it out first, or pick a simple set-up like Lore/Spirit questing deck and Leadership/Tactics combat deck and try things out from there. For the record, almost all of the decks I post on Tales from the Cards are designed for 2-handed play, meaning that they synergize with another deck, although they can be used solo as well a lot of times. \n\nThis has been a fairly long-winded post, but my main advice is what I said earlier: focus on the fun and try out as many different things as possible (1-handed, 2-handed, different scenarios, different deck types). Momentum requires movement. Don't worry about doing things perfectly or comparing yourself to others. Your primary goal is to enjoy yourself. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756980","commentId":756980,"userName":"tripecac","timestamp":1359682213,"content":"Thanks for the thoughtful replies!\n\nI think my next step will be to give 2-handed a shot.  I've got 2 core sets, which lets both decks use 3 Gandalfs, but I only have 3 Radagasts, although I don't know if there are many times when both decks need 3 Radagasts.  As for the non-neutral cards, I'm hoping that complementary 2-sphere decks (e.g., Leadership/Lore and Tactics/Spirit) will work out okay.  \n\nI suppose one thing that makes 2-handed solo feel less like \"cheating\" is the fact that unless we buy 2 of every expansion and quest pack, we're pretty much forced to use \"opposite spheres\" in each deck, since we can't usually include more than 3 of any card across both decks.  This means we can't have both decks with really good Spirit cards…  Or two extremely dwarf-heavy decks.  We can't test the extremes as easily as 2 players who have each bought their own copies of all the packs.\n\nOf course, if there's a way to play 2 handed in OCTGN, VASSAL, or LackeyCCG, we're not limited in which cards we use.  However, I've never seen a video of anyone playing 2-handed in those programs.  I'd love to see how it's done!\n\n \n\nAs for the blog, this suggestion might ruffle some feathers, but perhaps Tales from the Cards and Hall of Beorn can merge at some point?  Having 2 insightful blogs is awesome (and I am incredibly impressed at the quality of writing!), but as real life gets busier, it might help you avoid \"blog fade\" to take turns writing articles.  You would be motivating each other (cooperatively rather than pseudo-competitively) as well.  I think most of us are just amazed at the number of high-quality articles you are cranking out, and wondering how in the world you can sustain it.  Perhaps the competitive element is helping with the motivation, but at some point, there's the real risk of burn out.  Look at Fellowship of the Cards. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]  I hope you're able to keep writing about LotR LCG for the long haul, and if that means slowing down a bit or taking turns, then I'm all for it!  I'd rather have a Gandalf that pops in and out sporadically from beginning to end than a Boromir who super-novas in the first book!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAnyway, keep up the good writing!  I'd love to see a supplementary video series as well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=756992","commentId":756992,"userName":"Dain Ironfoot","timestamp":1359684752,"content":"tripecac said:\n\n \n\nAnyway, keep up the good writing!  I'd love to see a supplementary video series as well!\n\n \n\n \n\nThe Progression Series isn't enough for you?! Haha.\n\nIn all seriousness, I'm glad it sounds like you've gotten your momentum back - I, too, go through fits and spurts of playing. While I always buy all of the quests, there are a bunch I've never even played - or only played once!\n\nOne reason I enjoy the Progression Series so much is actually b/c I'm playing a lot of the quests for the first time - it's helped my \"momentum,\" if you will.\n\nMitch and I are looking for new subjects to tackle in the series, so if you - or anyone! - has any suggestions, we''ll gladly consider them! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=757147","commentId":757147,"userName":"tripecac","timestamp":1359714779,"content":"I love the progression series, and have a huge appetite for more.  The more high-quality videos, the better!  It's great to see different play styles, card layouts, and how they get around the OCTGN/LackeyCCG/VASSAL interface.  For those of us who have only played solo, this is our own chance to observe other people playing, so we eat it up!\n\nOne possible topic for the progression series would be a comparison of the different interfaces.  Or, if you only want to focus on OCTGN, a brief tutorial on how to setup OCTGN for Lotr LCG, and then how to make the most of the OCTGN interface.  For example, it took me a few games in OCTGN to figure out how to draw the arrows from enemies to character cards.  That's a very useful way of keeping track of who is defending which cards.  This sort of \"techical\" video might be tedious to make, but it would definitely help people get started with virtual play and more easily keep track of what's going on in the videos (e.g., where is the threat counter, why are the quest cards laid out, how do you flip a coin, etc.)\n\nA much more fun video would be seeing the Mirkwood cycle tackled in nightmare mode (using any cards from Mirkwood cycle).  Of course, that might have to wait until the new nightmare cards are released.  It would certainly increase our \"attachment\" to the decks being used (since we'd become more familiar with them after seeing them played a few times) and would let us see how the meta-game is played.  Might take a few attempts, however. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=757210","commentId":757210,"userName":"Raven1015","timestamp":1359722858,"content":"tripecac said:\n\nI'd rather have a Gandalf that pops in and out sporadically from beginning to end than a Boromir who super-novas in the first book!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\n \n\nHehe, I love this analogy. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3731241","commentId":3731241,"userName":"tripecac","timestamp":1561836645,"content":"Okay, on the topic of momentum, I have a long-overdue update. \n\nOver the past 6 years, I have been playing LotR LCG off and on, almost exclusively on OCTGN (though I continue to collect the cards). \n\nMost of my progress was made during overseas trips (in 2014 and 2018) when I was limited to a laptop which couldn't play \"real\" video games .  During those trips I played LotR LCG on OCTGN, gradually progressing through the Mirkwood cycle.  Whenever I returned from those trips, however, I would go back to playing other games, and didn't really pick up LotR LCG again until my next overseas trip.  So, I often restarted with Passage through Mirkwood.\n\nHowever, in 2019 something changed.  I've been listening to new podcasts about LotR LCG, which keep me inspired.  And BGG is a great source of \"reminders\" about the game.  So, for whatever reason, a few months ago I started playing LotR LCG again, on weekend mornings.  My goal was one quest per week. \n\nAnd guess what... I've stuck with it!  Playing once a week is frequent enough to keep the rules fresh in my head (which reduces overhead), but not frequent enough to feel like a \"chore\" or cause burnout.  It's a comfortable frequency.\n\nRight now I'm in the Dwarrowdelf cycle.  Yesterday I finished The Long Dark.  This is now the farthest I've ever gotten in LotR LCG!!!  After all these years, I am finally progressing into new content.  So, playing once a week has helped maintain momentum.\n\nHowever, there is another factor: I have created my first \"good\" deck (or rather, a pair of decks, since I play 2-handed): Dwarves!  Dain helps glue this deck together, and so far, several missions into the Khazad Dum/Dwarrowdelf quests, I haven't needed to rebuild my decks!  This also reduces the overhead of playing LotR, and gets rid of the most stressful part of the game for me, which is deck building (since I hate the process of removing cool cards from decks, and so many cards seem cool to me!).\n\nSo, those 2 things have helped me maintain momentum for the longest period of time so far:\n\n1) playing once a week, and\n\n2) playing a \"good\" deck (which doesn't need to be tweaked between scenarios)\n\nHopefully this update will help other people in similar situations find ways to establish their momentum too! \n\nIt feels great to be finally making progress in this game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3731290","commentId":3731290,"userName":"Gizlivadi","timestamp":1561844393,"content":"Excellent! I myself haven't played in like 4 months, although of course I continue to collect. Still, even if not playing, I always think about the game, new lineups and builds and interactions to build upon, as well as listening to the podcasts and participating in the online discussion. I have to get back to actual questing though, and for that the idea of ready-to-play, all-rounded solo decks for a variety of quests in standard mode has been invaluable. I too dislike to disassemble decks I actually enjoy, taking out cards for others, etc., so my ever-growing slew of prebuilt solo decks has been one of my biggest treasures (though granted, it is more expensive to keep than a normal collection). Still, the online community has helped tons in maintaining momentum for me. As I've said elsewhere, without the community, discord, podcasts, blogs, forums, etc, I wouldn't enjoy this game half as much as I do. I've played and still play other card games, and this is by far the best community I've seen. I'll have to try the quest a week idea. It's very reasonable, and will keep my skills from getting rusty. Thanks for sharing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3731300","commentId":3731300,"userName":"Calvadur","timestamp":1561845357,"content":"> 1 hour ago, tripecac said:\n> \n> Okay, on the topic of momentum, I have a long-overdue update. \n\nLong-overdue? You surely are no wizard :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] \n\nAnyway great to hear you're back having fun with the game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3731919","commentId":3731919,"userName":"Yepesnopes","timestamp":1561956591,"content":"Happy to hear you are back! It is a great game.\n\nI understand very much the “having a good deck” point. It is something that we have discussed recently due to the upcomming erratas. With the modern card pool, I am sure you can make a different deck for each scenario and be able to beat it. But most people do not have the time or the will to play the game that way, this is a style of play that should be exclusive to nightmare mode. Having good decks that do not have to be tweaked between escenarios is important."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3732698","commentId":3732698,"userName":"TheSpitfired","timestamp":1562045712,"content":"@tripecac [https://community.fantasyflightgames.com/profile/177282-tripecac/] Thanks for the inspiration. I've been in the same boat, which is funny because at the same time I've been on FFG's website like a hawk this year, buying up sets I've always wanted as they became available.\n\nI've got an annual camping trip next week and the game always comes with me, and after that week I will be joining you in the (minimum) once a week play. Been sitting on too much content not to and the more I think about it the more excited I get!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3732931","commentId":3732931,"userName":"tripecac","timestamp":1562081639,"content":"I've also been listening to Card Talk (one of the newer LotR LCG podcasts) which has been great because each episode is short, focused, and entertaining.  It's probably the \"easiest to digest\" LotR LCG podcast out there, and when it comes to this game, anything easy is good!  Plus, the show has a relaxed, humble, humorous feel to it.  It's like listening to two buddies talking about the game.  Highly recommended!\n\nEdited July 2, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3740879","commentId":3740879,"userName":"tripecac","timestamp":1563257089,"content":"I managed to get through the final 2 Dwarrowdelf quests!  Shadow and Flame required some deck building, but I stuck with it and managed to beat it.  So now I am finally, for the first time ever, done with Moria!\n\nNext weekend I plan to tackle Massing at Osgiliath, and then the Hobbit Saga.  That will be interesting!\n\nHow are you guys doing?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3740987","commentId":3740987,"userName":"Seosaidh","timestamp":1563276550,"content":"I've beaten Assault on Osgiliath a few times, but most of those felt a bit cheap due to that one swingy treachery, so I'm planning on playing it a few more times until I decide to move on and take my technical win (one on turn 1 due to the treachery, one several turns in after I had taken control of a location or two due to the treachery) or I get a satisfactory win. I'm pretty sure my current decks can beat it, but I have a mono-tactics replacement for my mono-spirit deck if need be.\n\nOnce I'm done with the Heirs of Numenor, I actually plan on taking a break in order to paint my miniatures for Journeys in Middle Earth, then it's on to the Angmar Awakens cycle (I already played Ringmaker)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3795926","commentId":3795926,"userName":"tripecac","timestamp":1569823857,"content":"Just a quick update...\n\nI have stuck with the once-a-week routine, and it's been working out great!  The Hobbit Saga has been a real pain to get through, though.  I am finding its quests much more difficult and frustrating than the Dwarrowdelf ones.  That said, it's neat having Bilbo floating around on the edges.\n\nDespite, or perhaps because of, the frustrating scenarios of the Hobbit Saga, I'm very glad I've been forcing myself to stick with the once-a-week schedule.  If I hadn't created that \"rule\" for myself, I suspect I would have skipped a weekend or two or three or... and wouldn't have made as much progress as I have.\n\nSo, although \"momentum\" requires effort, it does have the benefit of ensuring an overall sense of progress through the game, and plus, even the hardest, nastiest quests have their fun moments.  I love it when my Dwarf swarm is finally kicking butt... and I love that sense of relief when I finally beat a quest I've lost repeatedly.  Those infrequent, \"hard-earned\" moments are very satisfying, and they wouldn't happen if I didn't \"force\" myself to maintain momentum.\n\nIt's a truly great game.  A very hard one (for those of us who don't enjoy deck building) but also one that is very thought-provoking and emotionally/intellectually rewarding... when we finally win.\n\nTLDR: There is no winning without losing.  And there is no losing without playing.  So play.\n\nEdited September 30, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3797321","commentId":3797321,"userName":"TheSpitfired","timestamp":1569972852,"content":"I have not had the willpower to commit to once a week like you have so I am still a little envious, but I am also happy to report that I've found another motivator that has gotten the game back to almost regular play.\n\nI introduced a local friend to the game on a board-game night when there would be only the two of us. He had been wanting to try it anyways and the timing worked out. I took my two Gondor decks (see my post in deck construction if you're curious) and we not only did passage through Mirkwood but we Journeyed down the Anduin in one night. My friend absolutely loved the game, and he went out and found someone selling their collection so he got a small jump start on sets. A combination of Core, maybe early stuff and one or two sets from the latest stuff too.\n\nSuffice to say another board game night came up where it would be only the two of us, so we boldly took Gondor into the heart of Dol Guldor so that we could Escape from it. We got absolutely destroyed by the quest in both attempts but I don't know if I've ever had more fun playing this game.\n\nI still enjoy the game solo and two-handed but it has been so refreshing to find someone locally to play the game with and it has helped it get to the table more. If you have friends with any interest in Lord of the Rings I heartily recommend nudging them on the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3835183","commentId":3835183,"userName":"tripecac","timestamp":1574457130,"content":"So, I finished the Hobbit saga, and finally managed to beat Lake-Town.\n\nI'm now tackling the first quest in Heirs of Numenor: Peril in Pelargir.\n\nTwice I tried it, and twice I got completely crushed within the first 3 or 4 turns.  My decks (I play 2-handed) are not even close to making headway.  Starting with 2 enemies in the staging area, and then drawing up to 2 more at the beginning of the quest phase, and then up to 2 more during staging...  Both times I ended up having to fight 4 or 5 enemies on turn 1.  So I couldn't really quest, and either ended up threating out or getting too many heroes killed to make it worth continuing.\n\nPeril in Pelargir feels so imbalanced (and \"unfair\") that, to be honest, it's very tempting to \"take a break\" for a few weeks/months/years and focus on other games.  I can now see why so many people said that the Heirs of Numenor quests are painful and discouraging.\n\nLake-town was hard.  The Hobbit quests were confusing.  But Peril at Pelargir is just plain depressing.\n\nIs this how you felt when you first tried it?  Did it throw your momentum off for a  while?\n\nAnd, if you persevered, what helped you get through?  Did you overhaul your deck(s)?  Shift to/from 1-handed?  Play Easy Mode?  Cheat?  Or did you give up on the idea of beating each quest, allowing yourself to \"fail forward\" after X attempts, with no real consequences other than a bruised/battered ego (and perhaps some bent cards)?\n\n \n\nEdited November 22, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3835658","commentId":3835658,"userName":"dalestephenson","timestamp":1574536387,"content":"When first acquiring the quests I was playing two decks -- Theodred/LeAragorn/LoDenethor and SpEowyn/TaGimli/Thalin.  Those of course are the hero lineups from Beorn's Path, but as I acquiring more cards I kept tweaking the contents.  My procedure was as follows:\n\n1) Play each deck a maximum of three times against the quest.  If either wins, go on to the next quest.\n\n2) Play both decks together against the quest a maximum of three times.  If I win, go on to the next quest.\n\n3) Repeat #1 in semi-easy mode (extra resource for each hero at start).\n\n4) Repeat #2 in semi-easy mode.\n\n5) Repeat #1 in easy mode.\n\n6) Repeat #2 in easy mode.\n\nI followed this procedure for all regular quests through Temple of the Decieved and all saga quests through Shelob's Lair (plus the two saga PoD quests), at which point these two decks were displaced to play assorted Dori fellowships.  Only Morgul Vale reached the 27th try.  I'm not sure where Peril in Pelargir fell, I think the SpEowyn/TaGimli/Thalin deck took it down--a maxed-out Gimli with Unexpected Courage can solve a lot of battle questing issues.  I only completely remade the deck for one quest in that span (Hobbit's riddle quest), but I added sideboard cards for assorted quests.\n\nWere I to play again progression style with a particular deck, I think I would rely on the Grace of the Valar variant we use in the solo league.  With enough help from the Valar you can win any quest, and you don't lose the cards out of the deck like you do with easy mode.  With that said, there's absolutely no shame in taking a tough quest down in easy mode, especially for a progression player.  And sometimes a particular deck just is a bad fight for a particular quest.  At least there's one stage where SpEown was useful; in some of the other quests in the cycle she was dead weight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3835829","commentId":3835829,"userName":"Wandalf the Gizzard","timestamp":1574562756,"content":"Peril in Pelargir requires you to really tech against it with a very specific deck to be successful. A good deal of the most efficient \"normal\" decks would perform poorly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3835890","commentId":3835890,"userName":"JonG","timestamp":1574582439,"content":"> On 11/22/2019 at 9:12 PM, tripecac said:\n> \n> So, I finished the Hobbit saga, and finally managed to beat Lake-Town.\n> \n> I'm now tackling the first quest in Heirs of Numenor: Peril in Pelargir.\n> \n> Twice I tried it, and twice I got completely crushed within the first 3 or 4 turns.  My decks (I play 2-handed) are not even close to making headway.  Starting with 2 enemies in the staging area, and then drawing up to 2 more at the beginning of the quest phase, and then up to 2 more during staging...  Both times I ended up having to fight 4 or 5 enemies on turn 1.  So I couldn't really quest, and either ended up threating out or getting too many heroes killed to make it worth continuing.\n> \n> Peril in Pelargir feels so imbalanced (and \"unfair\") that, to be honest, it's very tempting to \"take a break\" for a few weeks/months/years and focus on other games.  I can now see why so many people said that the Heirs of Numenor quests are painful and discouraging.\n> \n> Lake-town was hard.  The Hobbit quests were confusing.  But Peril at Pelargir is just plain depressing.\n> \n> Is this how you felt when you first tried it?  Did it throw your momentum off for a  while?\n> \n> And, if you persevered, what helped you get through?  Did you overhaul your deck(s)?  Shift to/from 1-handed?  Play Easy Mode?  Cheat?  Or did you give up on the idea of beating each quest, allowing yourself to \"fail forward\" after X attempts, with no real consequences other than a bruised/battered ego (and perhaps some bent cards)?\n> \n>  \n\nI think all of the cycles start getting harder after Khazad Dum and the only way around it is to up your decks. Forget playing progression or anything else that limits you, at least for a while. \n\nYour Dwarf deck should be able to handle Peril at Pelargir, but another one to consider is a Gondor leadership deck, as you get plenty of low cost allies that you can use. Maybe something like this:\n\nTheodred\n\nLeadership Boromir\n\nLeadership Denethor\n\nSteward of Gondor x 3\n\nGandalf x 3\n\nSneak Attack x 3\n\nErrand rider x 3\n\nSquire of the Citadel x 3\n\nFaramir x 3\n\nVisionary Leadership x 3\n\nPelargir Ship Captain x 3\n\nStrength of Arms x 3\n\nGuard of the Citadel x 3\n\nFor Gondor x 3\n\nGrim Resolve x 3\n\nEnvoy of Pelargir x 3\n\nWhite Tower Watchman x 3\n\nIf you've got later packs you can add in:\n\nIngold x 3\n\nVeteran of Osgiliath x 3\n\nHerald of Anorien x 3\n\nYou can tinker around with this but hopefully you get the gist - you have plenty of resources, and use lots of allies, plus boosts using the Gondor keyword pack a real punch. There are one or two quests in HoN that force a change but worry about them when you get to them!\n\n \n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3993282","commentId":3993282,"userName":"tripecac","timestamp":1600976802,"content":"A quick update...\n\nPeril in Pelargir ended up completely killing all of my momentum, to the point where I haven't played any LotR LCG in 2020.\n\nWandalf's words express the key reason:\n\n> On 11/24/2019 at 3:32 PM, Wandalf the Gizzard said:\n> \n> Peril in Pelargir requires you to really tech against it with a very specific deck to be successful. A good deal of the most efficient \"normal\" decks would perform poorly.\n\nAt the end of 2019 I tried repeatedly to beat Peril in Pelargir.  My Dwarf decks kept failing to get beyond the first few turns.  I was nowhere close to winning.  It was painful.  All the advice (here and elsewhere) said to try different archetypes... but since I didn't have anything other than my Dwarf decks, and since I didn't want to go through the hassle of building brand new decks from the hundreds of unfamiliar cards which have come out, I decided to set the game aside and focus on Gloomhaven instead.\n\nSo, 2020 has been the year of Gloomhaven.  It's been great.  I play about as many hours per month as I did for LotR LCG, but I find it a lot less less stressful. \n\nI still think about LotR LCG very often, and keep up with podcasts and forums for it.  I still collect the packs as they get released, despite playing 100% virtually (on OCTGN).  I'm still \"into\" it, despite not playing it.  I look forward to tackling Pelargir's peril again, but will only do so once I've got a firm plan on how to get around the deck construction issue.\n\nFinding a collection of \"official\" decks would be the best situation, especially if there were also carefully designed pairs of decks (since I prefer to play 2 handed).  I'd love to be simply selecting decks rather than cards.  Trying some community-constructed archetypal decks would be the next best thing, but I would prefer if FFG itself could create (or annoint) \"official\" decks so that skipping the deck construction process didn't feel like cheating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3993565","commentId":3993565,"userName":"PigsAreOurEquals","timestamp":1601026920,"content":"I think your deckbuilding time and decision paralysis could be reduced a lot by selecting ones you like from ringsdb. These decks are published by other players (some of them are incredible deckbuilders). You can download the octgn deck straight from ringsdb.\n\nYou can specifically look up \"fellowships\" lists of decks designed to work together. \nIn this link I set up a query for 2-handed fellowships using only cards up to Heirs Of Numenor (https://ringsdb.com/fellowships/find?nb_decks=2&numcores=1&numplaysets=1&author=&name=&sort=popularity&packs[]=1&packs[]=8&packs[]=15&packs[]=2&packs[]=3&packs[]=4&packs[]=5&packs[]=6&packs[]=7&packs[]=9&packs[]=10&packs[]=11&packs[]=12&packs[]=13&packs[]=14&packs[]=37&packs[]=38 [https://ringsdb.com/fellowships/find?nb_decks=2&numcores=1&numplaysets=1&author=&name=&sort=popularity&packs%5B%5D=1&packs%5B%5D=8&packs%5B%5D=15&packs%5B%5D=2&packs%5B%5D=3&packs%5B%5D=4&packs%5B%5D=5&packs%5B%5D=6&packs%5B%5D=7&packs%5B%5D=9&packs%5B%5D=10&packs%5B%5D=11&packs%5B%5D=12&packs%5B%5D=13&packs%5B%5D=14&packs%5B%5D=37&packs%5B%5D=38]). \n\n \n\nThese 2 stuck out to me since they specifically mention Peril in Pelargir:\n\nhttps://ringsdb.com/fellowship/view/9281/heirsofnumenorprogression1csfellowshipbyczyn [https://ringsdb.com/fellowship/view/9281/heirsofnumenorprogression1csfellowshipbyczyn]\n\nhttps://ringsdb.com/fellowship/view/7598/ats1perilinpelargir2-handedsoloprogression [https://ringsdb.com/fellowship/view/7598/ats1perilinpelargir2-handedsoloprogression]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77685-momentum/?do=findComment&comment=3993719","commentId":3993719,"userName":"asgardianphil","timestamp":1601049533,"content":"Hey,  I second that piece of advice.\n\nI regularly pull decks off rings DB. They have done all the hard work so that you can quest more. \n\n \n\nI find deckbuilding fun but.. takes me ages too. i often loose focus and end up with a deck opposite to what I wanted. With rings db you can put in cards you want to focus on and then find a deck using them. \n\n \n\n \n\n "}]}