{"url":"https://community.fantasyflightgames.com/topic/77728-nightmare-deck-vs-burglar-deck/","title":"Nightmare Deck vs Burglar deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77728-nightmare-deck-vs-burglar-deck/?do=findComment&comment=749923","commentId":749923,"userName":"Hannibal_pjv","timestamp":1358548560,"content":"FFG is going to release Nighmare decks:\n\n * One 22-card Passage Through Mirkwood Nightmare Deck\n * One 22-card Journey Down the Anduin Nightmare Deck\n * One 22-card Escape from Dol Guldur Nightmare Deck\n\nHow about allso releasing Burglar decks?\n\n * One xx-card Shadows of Mirkwood burglar Deck\n * One xx-card Dwarrowdelf burglar Deck\n * One xx-card Against the Shadow burglar Deck\n\nThe idea of Burglar decks is opposite from Nightmare decks. There are supose to make adventures more easy to do.\n\nA burglar deck would include cards that will help adventurers. They would be \"good\" Encounter cards like Treachery cards like \"Good weather\", \"An Elf hunting party\" \"Beorn appears\", \"Eagles are coming\" etc. There can be limited time objective allies like \"Wandering old hobbit\", \"Elven scout\", \"Woodman hunter\" that helps adventures one time, and then goes to the victory point pile. There can be positive attachements like, \"Mushrooms\", \"bandage\" etc. The idea is that every cards in Burglar deck would have a negative Victory point value and every card would be \"one time wonder\" So you can only fenefit that one card only one time during the scenario and after the use, it would go to the victory point pile.\n\nFor example:\n\n\"Wandering old hobbit\" Hobbit. Burglar.  Willpower 2, Attack strenght 2, Defense strengt 2, Hit Points 3, When revealed the first player gets controll of Wandering old hobbit. Forsed: After Wanderin old hobbit attacks, defend or is committed to the quest, put Wandering old hobbit to the victory point pile at the end of that phase. Shadow: Attackin enemy does not cause damage in this turn. Put wandering old hobbit to the victory point pile. Victory -2. Objective - Ally.\n\n\"Peafull clade\" Forest. Clade. Treath streght -1. Quest points 0. Travel: The first player may draw a card when travelling here. When Peaseful clade is explored, put it to the victorypoint pile. Victory -1. Location.\n\n\"An elf hunting party\" Doomed -1. When revealed: discard an enemy card in the staging area with lovest Engament cost. Shadow: Discard an attaking enemy. Victory -5. Treachery.\n\n\"Muchrooms\" When revealed: The hero with the lovest Treat cost get this card as an attachement. Action: Discard this card to remove one wound from a character, and put this card to the victorypoint pile. Shadow: the defending character get +1 Defense strenght.  Victory -1. Treachery.\n\n \n\nThe main idea is that burglar deck makes it possible to pass the scenario with only one / or two core packs and one expansion. The normal sceario would be suitable when you own two core sets and the whole cycle. And Nightmare decks are for those who have all the released cards…\n\n \n\nThis would make it possible to play each scenario even you only have the core set and only one expansion, and allso make the scenario tough enough if you have all the cards released so far. The positive and negative Victory points will balance the outcome, so a victory with Nighmare pack will be more valuable than the same sceanario with Burlar pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77728-nightmare-deck-vs-burglar-deck/?do=findComment&comment=749949","commentId":749949,"userName":"DarthJalapeno","timestamp":1358554767,"content":" \n\nAwesome idea!\n\nIt'd be great for Bilbo players who doesn't want to powerplay their way through the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77728-nightmare-deck-vs-burglar-deck/?do=findComment&comment=801859","commentId":801859,"userName":"Hannibal_pjv","timestamp":1370444660,"content":"One idea that I got from Nerdmeister is to have somekind of balance cards. Allso idea that rose up was to have replasement errata versions of some removed easy mode cards.\n\nFor example Wilderlands\n\nHilltrol could be Stupid Hill troll\n\nEngagement cost 40\nTreath level 1\nAttack 4\nDefense 2\nHit Points 6\nTroll\nIf there are less than 2 players, Stupid Hill troll goes elsewhere to hunt food. Remove Stupid Hill troll from the game.\nIf there are less than 3 players and there is another troll in the game, discard Stupid hill troll and this card gains surge.\nVictory 1.\nHill trolls are not famous for their intelligence…\n\nMarsh Adder\nEngagement cost 40\nTreath level 1\nAttack 3\nDefense 1\nHit Points 6\nCreature\nForced: if your treath level is less than 40 each time Marsh Adder attacks you, raise your threath by 1.\nVictory 2\n\nDespair\nWhen revealed if there are less than 3 players remove 2 progres tokens from current quest card.\nShadow: Defending character shield is -1\n\n \n\nSo when easy mode says that you would remove those cards you instead use these replasement cards instead. It makes the quest easier, but not so easy as normal easy mode. It allso keeps the deck size same as original. You ofcouse have to keep one of those Hill trolls original like in normal easy mode.\n\nPlease be free to errata other easy mode cards, so that we may actually make them as an virtual version of original. These needs some game balancing and it may be better to remove some cards totally, but this leaves some cards useable allso in the future.\n\nSo I will make normal Burglar helping cards like above and these new balance based \"errata\" cards. Errata card can even have positive effect in the game during the most difficult scenarios.\n\n "}]}