{"url":"https://community.fantasyflightgames.com/topic/77770-sons-of-e%C3%A4rendil/","title":"Sons of Eärendil","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77770-sons-of-e%C3%A4rendil/?do=findComment&comment=750317","commentId":750317,"userName":"Mechanoise","timestamp":1358619482,"content":"Sons of Eärendil has text which reads:\n\nResponse: After another player raises his threat, raise your threat by 1 and reduce that player's threat by one.\n\nWould this mean that, (in a 4 player game), if all players were forced to increase their threat, the player with this card can reduce all other players threat by 1 and increase their own threat by 3? I don't see any restrictions for the number of times this can be done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77770-sons-of-e%C3%A4rendil/?do=findComment&comment=750400","commentId":750400,"userName":"GrandSpleen","timestamp":1358634175,"content":"Yes, sounds right to me.\n\nedit: and further, since Song of Earendil is not a unique card, you could play 3 on a single hero.  In a 4 player game, if you lost the Questing phase, you could then use that to reduce every other player\"s threat by 3 and raise your own by 9, if you had a mind to do so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77770-sons-of-e%C3%A4rendil/?do=findComment&comment=779113","commentId":779113,"userName":"Highland Shade","timestamp":1364508094,"content":"Based on errata and timing of \"response\" effects, anything which triggers more than one response simultaneously can only happen once, not multiple times. So in this case, if a card/effect raises each players threat by 1 (simultaneous effect) the Song card can only be used on one of the four players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77770-sons-of-e%C3%A4rendil/?do=findComment&comment=782736","commentId":782736,"userName":"GrandSpleen","timestamp":1365420337,"content":"Highland Shade said:\n\nBased on errata and timing of \"response\" effects, anything which triggers more than one response simultaneously can only happen once, not multiple times. So in this case, if a card/effect raises each players threat by 1 (simultaneous effect) the Song card can only be used on one of the four players.\n\n\n\nHmm…\n\nHere's that part of the FAQ:\n\n \n\n(1.08) Responses per Trigger\n\nIf a response or forced response is triggered, the effect can only occur once per trigger.\n\nExample: Theodred (CORE 2) reads, \"Response: After Theodred commits to a quest….\" This effect can only be triggered once each time Theodred commits to a quest.  (p. 4)\n\nThis would clearly mean that one response can be used once per trigger.  So, if you have 1 Song of Earendil, you can only trigger the response one time by that card (you can't use that one trigger to continually activate the Song's response text).  As I am reading it, though, this text doesn't address multiple copies of a card, or multiple responses being activated off of a single trigger.  So three copies of Song of Earendil should be able to activate their response from a single trigger (but only one time each, as per the Theodred example above).  Or, for example, if a character leaves play, you may trigger the Horn of Gondor's response AND Prince Imrahil's response AND the response on Misty Mountain Eagles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77770-sons-of-e%C3%A4rendil/?do=findComment&comment=782891","commentId":782891,"userName":"GrandSpleen","timestamp":1365446174,"content":"In that response above I lost sight of the original question, so I wanted to add also that if three characters leave play, that's three discrete triggers and one could trigger the Horn of Gondor's response 3 times.  Likewise if three different players raise their threat, a single copy of Song of Earandil should be able to be triggered 3 times."}]}