{"url":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/","title":"A new cycle&#039;s cards  are always better than the old ones?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=750810","commentId":750810,"userName":"Cutievalkyrie","timestamp":1358704826,"content":"For example:\n\nIn the basic set\n\nffg_gandalfs-search-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_gandalfs-search-core.jpg]\n\n \n\nand\n\nin Foundations of Stone [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/foundations-of-stone/]\n\nffg_imladris-stargazer-fos.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_imladris-stargazer-fos.jpg]\n\n \n\nwhich one will you choose?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=750821","commentId":750821,"userName":"GrandSpleen","timestamp":1358705957,"content":"Gandalf's Search doesn't get a lot of love, that's for sure, but holding it up next to Imladris Stargazer is kind of an apples-to-oranges comparison.  I treat GS basically like a \"pay one resource to draw one card.\"  The Stargazer doesn't put any cards in your hand, just arranges them for future draw.  Heck, you could even combine them: exhaust Stargazer to put the cards in optimal order, then use Gandalf's Search to immediately draw the card that you just placed on top.  Stargazer essentially makes GS a much more powerful (or cost-effective, if you prefer) card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=750856","commentId":750856,"userName":"richsabre","timestamp":1358710446,"content":"basically speaking yes, thats how ffg sell their packs. but not always….otherwise it would be too much the other way, people would fed up with the game if their card pool was only as good as the last pack.\n\ntake gandalf, sneak attack, UC and so on…still great cards probably because they are the 'core' cards (not just because they were in the core set, but because they represent the core abilities of most games, namely free play a card, double play a card, powerful guy and so on)\n\nso in short yes but there will always remain unbeatable cards….at least if ffg do their design job correctly\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=750955","commentId":750955,"userName":"Ellareth","timestamp":1358729430,"content":"I would say no.\n\nComparing one of the least used card from Core Set to one of the most used card in Dwarrowdelf Cycle seems hardly fair.\nIt's like comparing Resourceful (1 cost for 1 resource per turn starting the following turn if secrecy, if not 4 cost for 1 resource per turn starting following turn), against Steward of Gondor (2 cost for 2 resources per turn starting the turn it is played).\n\n \n\nThere has to be some fancy cards in newer expansion, but when I make a deck more than half the cards come from Core/Mirkwood Cycle.\n\nYou got Sneak Attack, Gandalf, Steward of Gondor, Snowbourn Scout, Gondorian Spearman, Test of Will, Hasty Stroke, Galadhrim's Greeting, Will of West (perhaps most over powered and contraversal card in the game) and many more from Core Set,\n\nDunedain Attachments, Winged Guardian, Vassal of Windlord, Songs of Spheres, Westroad Traveller, Haldir, Gildor and on and on from Mirkwood Cycle.\n\nEven some of the most favourite heroes are from Core/Earlier expansions. Legolas, Gimli, Theodred, Beravor, Frodo, Bilbo, Boromir, Dain and so on.\n\n \n\nAs far as the player card power creep goes, I would say FFG is doing a reasonably good job of it.\n\n \n\nP.S. Seeing Imladris Stargazer and Gandalf's Search together just made me think of unrelated side question. Are you able to use Vilya + Elrond to play Gandalf's Search, and say X is 50 and reorganize your entire deck the way you want?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=750986","commentId":750986,"userName":"Nerdmeister","timestamp":1358733983,"content":"Ellareth said:\n\nP.S. Seeing Imladris Stargazer and Gandalf's Search together just made me think of unrelated side question. Are you able to use Vilya + Elrond to play Gandalf's Search, and say X is 50 and reorganize your entire deck the way you want?\n\n\n\nDon´t think that will work. I believe you could technically play Gandalf´s Search with Vilya but since you payed no resources then X = 0 as far as I read it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=751009","commentId":751009,"userName":"HeavyKaragh","timestamp":1358738999,"content":"I agree with Ellareth. I'd say cards from Core/Mirkwood are on the \"usefull\" side, while Dwarrodelf cards are on the \"power\" side. Also, there are \"theme\" cards.\n\n\"Usefull\" cards are those that won't win you a game, but will help you control the Encounter deck (hard-soft counters), help you setting up your strategy (songs, card draw) or are cards always playable regardles of your deck (cheap eagles, signals). Examples: Unexpected Courage, Steward of Gondor, Feint, Arwen, Warden of Healing, Daeron's Runes…\n\n\"Power\" cards are those that can change the tide of the game (Taking Initiative, Hail of Stones, A Very Good Tale) but require specific conditions to do so, and those that are part of a deck engine (Zigil Minil, Legacy of Durin).\n\n\"Theme\" cards are those you won't be using if they hadn't an specific trait or use or require that trait: Escort from Edoras, Guard of the Citadel, Hands upon the Bow. I think these cards come mostly in the Deluxe boxes. Ton of dwarf cards in Khazad and Hobbit, ton of Gondor cards in Heirs.\n\nI'm curious on what the next cycle will bring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=751122","commentId":751122,"userName":"Pickles","timestamp":1358777786,"content":"karagh said:\n\n\"Usefull\" cards are those that won't win you a game, but will help you control the Encounter deck (hard-soft counters), help you setting up your strategy (songs, card draw) or are cards always playable regardles of your deck (cheap eagles, signals). Examples: Unexpected Courage, Steward of Gondor, Feint, Arwen, Warden of Healing, Daeron's Runes…\n\n\"Power\" cards are those that can change the tide of the game (Taking Initiative, Hail of Stones, A Very Good Tale) but require specific conditions to do so, and those that are part of a deck engine (Zigil Minil, Legacy of Durin).\n\nIt is a strange taxonomy that does not include Unexpected Courage, Steward of Gondor or Feint amongst power cards.\n\nThe core set has a lot of very strong cards that are very straightforward like A Test of Will, Hasty Stroke or Feint. It is hard to improve upon these as they are unconditionally good. Burning Brand is a good example of an alternative to Hasty Stroke as it is a different sphere & card type & has different restrictions - it is reusable but only works on attackers hitting the carrier. \n\nOn the other hand Quick Strike & Behind Strong Walls are pretty much inferior versions of Feint. You would want to include 3 Feints before you added in these cards without a cunning combo based plan. While is a good way of expending the card pool to make cards that must be built around rather than ones that are just overtly powerful but the presence of super strong cards in the core set does squash the design space. \n\nAnyway along with all these really good cards there are a lot that are poor or just not useful - allies with bad stats & abilities that are not useful or super situational events or ones that are overcosted (Loriens wealth & Gandalfs Search & the healing one ). These cards are just not useful & so there  will inevitably be improvements in later sets if the job they do is deemed worth doing - card draw & healing in this case. \n\nSome allies will be better than what has gone before - Erebor Battlemaster is a bit of a ridiculous outlier in terms of numbers in any deck he will be in. But even if the numbers are just shuffled round some will appear more useful - West Road Traveller is 2 Willpower for 2 but only has 1 hp is that better than 1 Willpower & 2 hp? Well sometimes it is but occasionally not - if there is a lot of ally hate. \n\nSo I think I too see three groups of cards in expansions (well 4)\n\nEgregiously powerful cards - cards that are just better than the baseline that has been established possibly too much so. Glorfindel with Light of Vlainor, Erebor Battlemaster etc. Uniqueness is a \"cost\" that can balance some of the more powerful cards down but there comes a point (er will probably come a point) where there are enough uniques to fill all of your character slots. (this is a symptom of Legend of the 5 Rings cycles.\n\nPatch cards that cover an ability that was not very useful before (or an ally slot) & so are more powerful than before but thats comparing with somwhet underpowered stuff EGs are Warden of Healing, Daeron's Runes (Well thats more the previous category). Tactics Bofur for willpower. Rivendell Blade - a better weapon.  I would include songs here as they \"patch\"  multishpere decks\n\n\"Key word\" cards. I distinguish these from theme as with theme I think people play them because they want a deck with a rich flavour whereas for my keywords I want powerful effects /combos/synergies with the cards I play. The only ones that really work now are dwarfs & to a lesser extent eagles though there is the odd benefit elsewhere (if you have Rivendell Blades to give to Legolas you might include some other elves to get any spares etc). Here you might  get cards identical other than keyword (or with very minor abilities like the West Road Traveller)\n\nMore bad cards - some new cards are equally weak as what is already there & has no obvious ability to be combined with other cards to make it better. Secrecy has this (Resourceful is still playable ish, most of the others are not sufficient compensation for the penalty of playing them & compete with the strong vanilla cards like A  Test of Will ).\n\n \n\nAnyway in summary the cards do not always get better but the ones that get used do. There are good & bad reasons why this happens but some power creep is inevitable & even desirable. FFG have a challenge balancing this against the difficulty of existing & new quests. Hopefully they will do it by broadening the scope of what is playable & doing it in different ways - an elf synergy deck that is the same as a dwarf synergy deck would be dull. This would be more intersting than unchecked power creep.  \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=751670","commentId":751670,"userName":"HeavyKaragh","timestamp":1358863911,"content":"Pickles said:\n\nSo I think I too see three groups of cards in expansions (well 4): Egregiously powerful cards, Patch cards, \"Key word\", More bad cards\n\nMy distinction is not based on the card value, but in their use.\n\nPickles said:\n\nIt is a strange taxonomy that does not include Unexpected Courage, Steward of Gondor or Feint amongst power cards\n\nI'm not denying those cards' power (or value), but you won't build a deck around them because they are straightforward (usefull in any deck). \"Power\" cards are those that may give you great advantage, but you need to build your deck around them.\n\nPickles said:\n\nHopefully they will do it by broadening the scope of what is playable & doing it in different ways - an elf synergy deck that is the same as a dwarf synergy deck would be dull. This would be more intersting than unchecked power creep.\n\nI hope that too: that trait and sphere specialities don't banish."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77840-a-new-cycles-cards-are-always-better-than-the-old-ones/?do=findComment&comment=752889","commentId":752889,"userName":"Nizi","timestamp":1359037380,"content":"With all content being spoiled nowadays, they are basically forced to make them somewhat more powerful. However, in this game it's not a necessity, as the encounters / quests are basically the selling point of the expansions."}]}