{"url":"https://community.fantasyflightgames.com/topic/77947-characters-in-on-the-doorstep/","title":"Characters in On the Doorstep","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/77947-characters-in-on-the-doorstep/?do=findComment&comment=751622","commentId":751622,"userName":"lleimmoen","timestamp":1358856799,"content":"Taking into account the designer's words, I think it is not hard to guess what characters we shall see in the second saga box.\n\nWe got Beorn, Thorin, Nori, Ori as heroes and Dori, Kili, Fili and Bofur as allies in the first box.\n\nThus we may expect Bard, Bombur, Balin, Dwalin, Bifur, Oin and Gloin in the second, which would leave one more spot for either Thranduil or Gwaihir (cannot think of anyone else). I find it given we shall see all the Dwarves despite the fact some of them had previously been released, Bofur and Bombur, plus the designer's arguments, pretty much make this certain.\n\nSo, which one will be the last, the great Eagle or Elven King. And which will be heroes and allies for each sphere? My guess is like this (including the previews).\n\nHeroes\n\nLeadership - Thranduil\nTactics - Bard the Bowman\nSpirit - Balin\nLore - Bombur\n\nAllies\n\nLeadership - Gloin\nTactics - Bifur\nSpirit - Dwalin\nLore - Oin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77947-characters-in-on-the-doorstep/?do=findComment&comment=751774","commentId":751774,"userName":"Pharmboys2013","timestamp":1358881366,"content":" \n\nI agree with you and have the upmost confidence that Balin will be the spirit Hero.  I can see leadership going either way to Thranduil or Gwahir, but i think Thranduil would fit better thematically as i included in another post….as for the allies i'll go with…\n\nLeadership- Gloin (i can see gloin being lore based on all the history he tells to frodo, but none of the other dwarfs make thematic sense for leadership so i'm keeping him here)\n\nTactics- Dwalin  (even tho he was spirit last time he still had a combat oriented power plus i know its meaningless, but his adaptation in Jackson's film pictured him as one of the bigger and stronger dwarfs of the company making him a decent fit for tactics)\n\nLore- Bifur  (he was already lore, but i already broke that rule with my dwalin position so i'm just keeping him in this sphere)\n\nSpirit- Oin  (he was barely mentioned in the book so who knows, might as well be here)\n\n \n\non a side note, i hope at somepoint they remake Kili and Fili if only because i strongly dislike their art…honestly they remind me of snowhite's dwarfs not the youngest pair of dwarfs in Thorin's rugged company"},{"commentUrl":"https://community.fantasyflightgames.com/topic/77947-characters-in-on-the-doorstep/?do=findComment&comment=751877","commentId":751877,"userName":"jc1138","timestamp":1358894762,"content":"I started a similar thread a while back, but also included speculations about the treasures and stuff.  Agree about the Fili and Kili art--I'll give it a pass.\n\nBilbo will be one of the heroes (spoiled).\n\nI'm hoping for an both an eagle and a mirkwood elf hero (Thranduil), to represent for the battle of five armies.  Then fill in the last two spots with a couple of dwarves, including Balin in Spirit hopefully.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77947-characters-in-on-the-doorstep/?do=findComment&comment=751951","commentId":751951,"userName":"lleimmoen","timestamp":1358910605,"content":"Pharmboys2013 said:\n\n \n\nI agree with you and have the upmost confidence that Balin will be the spirit Hero.  I can see leadership going either way to Thranduil or Gwahir, but i think Thranduil would fit better thematically as i included in another post….as for the allies i'll go with…\n\nLeadership- Gloin (i can see gloin being lore based on all the history he tells to frodo, but none of the other dwarfs make thematic sense for leadership so i'm keeping him here)\n\nTactics- Dwalin  (even tho he was spirit last time he still had a combat oriented power plus i know its meaningless, but his adaptation in Jackson's film pictured him as one of the bigger and stronger dwarfs of the company making him a decent fit for tactics)\n\nLore- Bifur  (he was already lore, but i already broke that rule with my dwalin position so i'm just keeping him in this sphere)\n\nSpirit- Oin  (he was barely mentioned in the book so who knows, might as well be here)\n\n \n\non a side note, i hope at somepoint they remake Kili and Fili if only because i strongly dislike their art…honestly they remind me of snowhite's dwarfs not the youngest pair of dwarfs in Thorin's rugged company\n\n\n\nYeah, we guess just about the same. As for Gloin, we both think he will stay in the same sphere as his Hero counter-part. Then we get Bifur and Dwalin, they could actually do the same for Lore and Spirit, which would leave Oin as Tactics. I actually cannot recall enough from the Book to have a more sophisticated guess on this one. If it were up to the film, then Dwalin would surely come Tactics (I am not saying it will, or should)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/77947-characters-in-on-the-doorstep/?do=findComment&comment=752377","commentId":752377,"userName":"Mr Coffee","timestamp":1358966256,"content":"lleimmoen said:\n\nThus we may expect Bard, Bombur, Balin, Dwalin, Bifur, Oin and Gloin in the second, which would leave one more spot for either Thranduil or Gwaihir (cannot think of anyone else). I find it given we shall see all the Dwarves despite the fact some of them had previously been released, Bofur and Bombur, plus the designer's arguments, pretty much make this certain.\n\nSo, which one will be the last, the great Eagle or Elven King. And which will be heroes and allies for each sphere? My guess is like this (including the previews).\n\nHeroes\n\nLeadership - Thranduil\nTactics - Bard the Bowman\nSpirit - Balin\nLore - Bombur\n\nAllies\n\nLeadership - Gloin\nTactics - Bifur\nSpirit - Dwalin\nLore - Oin\n\n\n\nHmmm.  I'll take a different approach, just for variety's sake (and because I really want Gwair…).  I actually think Gwahir fits better as a character in the set.  Not that Thranduil is a bad choice, but honestly (and it's been mentioned in the forum here already) he almost plays more of an antagonist in the books, and at one point he nearly goes to open war with the dwarves.  Kinda hard to paint him as a hero in this specific saga.  And this will fulfill my desire for FINALLY getting an Eagle hero in a non-Tactic sphere to create a natural connection.  I'm gonna change up the allies spheres, cuz I'm not sure that FFG would do a second version of an ally in a sphere they are already present (can't think of any off the top of my head… but haven't been able to focus on the game for a few months now)…\n\nHeroes\n\nLeadership - Gwahir\nTactics - Bard the Bowman\nSpirit - Balin\nLore - Bombur\n\nAllies\n\nLeadership - Dwalin\nTactics - Gloin\nSpirit - Bifur\nLore - Oin\n\n \n\nIf they use Gwahir as an ally, it completely changes up that lineup of course.  Although I hope they would still then keep him as a Leadership character, as he bridges that gap as well as synergizes well with some of the Leadership characters and events.  If he isn't a hero, I imagine he would be a pricey and powerful ally.  Imrahil plus SoG would be a good combo to get him (and Radagast) out as soon as possible.  Perhaps he could be a \"Dain-lite\" card and simply add +1 Willpower to any questing Eagle.  Then he and Faramir combined would make a Tactics questing deck actually possible… just a thought.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/77947-characters-in-on-the-doorstep/?do=findComment&comment=752422","commentId":752422,"userName":"Pharmboys2013","timestamp":1358971996,"content":"When ffg finally reveals the leadership hero for this box I don't know what we're going to debate about on here anymore haha"}]}