{"url":"https://community.fantasyflightgames.com/topic/78032-best-sphere/","title":"Best sphere?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78032-best-sphere/?do=findComment&comment=752453","commentId":752453,"userName":"Ozil23","timestamp":1358976402,"content":"So what do you guys think is the best sphere so far?\n\n \n\nI would have to say:\n\n1.- Spirit\n\n2.- Leadership\n\n3.-Lore\n\n4.- Tactics"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78032-best-sphere/?do=findComment&comment=752468","commentId":752468,"userName":"jc1138","timestamp":1358978542,"content":"I think it partly depends on how you are playing (solo, 2 player, etc), and also how many spheres are in your deck, but MOST important what scenario you are playing, of course.  For solo (only way I play), I'd say:\n\n1-Spirit\n\n2-Lore and Leadership (tied)\n\n3-Tactics (especially if you're going mono)\n\nSo yeah, I pretty much agree with your break down.\n\nHowever, I don't think there's as much of a gap between the sphere's as is sometimes put forward, and they seem to be becoming more equal as the game expands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78032-best-sphere/?do=findComment&comment=752495","commentId":752495,"userName":"Ellareth","timestamp":1358982007,"content":"I can't really argue with Spirit being #1\n\nBut with the HoN expansion, I would have to argue Tactics for #2\n\nI'd probably put Lore as #3 and Leadership as #4…. with growing card pool I don't find Steward of Gondor and Sneak Attack as essential as they used to be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78032-best-sphere/?do=findComment&comment=752619","commentId":752619,"userName":"Serazu","timestamp":1359004224,"content":"From a purely solo perspective:\n\n1. Spirit\n\n2. Lore\n\n3. Leadership\n\n4. Tactics\n\nFrom the HoN and the coming cycle it looks like the DT starts to bridge the gap between the spheres by hosing Spirit and making Tactics more important than before, but I 'd have to argue about one thing: everyone says these days how important Tactics is and how indispensable is slowly becoming, judging by the new adventures. Well, in my opinion, the most important sphere in the Numenor cycle so far has to be Lore. Without access to healing these adventures (and the coming ones I suspect) are just not doable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78032-best-sphere/?do=findComment&comment=752682","commentId":752682,"userName":"Maggical","timestamp":1359016361,"content":"Serazu said:\n\nFrom a purely solo perspective:\n\n1. Spirit\n\n2. Lore\n\n3. Leadership\n\n4. Tactics\n\n\n\nI agree!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78032-best-sphere/?do=findComment&comment=752697","commentId":752697,"userName":"Captain Poe","timestamp":1359017394,"content":"Spirit is probably my least favorite sphere in the game, but I can't really argue that its the strongest sphere. Its got 2 of the best heroes in the game, glorfindel and eowyn… high quest, counter to \"when revealed\", and threat reduction. I think from a mono-sphere perspective, it probably has the best chance of survival.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78032-best-sphere/?do=findComment&comment=752698","commentId":752698,"userName":"OnkelZorni","timestamp":1359017461,"content":" \n\n \n\nSerazu said:\n\n \n\n Well, in my opinion, the most important sphere in the Numenor cycle so far has to be Lore. Without access to healing these adventures (and the coming ones I suspect) are just not doable.\n\n \n\n \n\n \n\nI disagree, The Siege of Cair Andros is with a mono-tactics deck absolutly doable. After several losses with my trisphere deck I tried just for fun a tactics deck and (compared to my other session) it was nearly a cakewalk. Still it was not that easy to win but with my other deck i never managed to get beyond the first quest card so i'm really satisfied with tactics…for the first time at all…"}]}