{"url":"https://community.fantasyflightgames.com/topic/78062-ents/","title":"Ents?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78062-ents/?do=findComment&comment=752696","commentId":752696,"userName":"RendTheHeavens","timestamp":1359017356,"content":"Hey everyone, I'm new the forums, and pretty new to the game as well.\n\nHad a quick question, I know that currently the game is based around the events not mentioned in the books, But the ents are probably my favorite characters and was wondering if there rumors or thoughts about them every being included in the game?\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78062-ents/?do=findComment&comment=752700","commentId":752700,"userName":"Captain Poe","timestamp":1359017799,"content":"No mention on Ents yet. Would be really cool to see some, but right now the game is focued on the Hobbit and Gondor, so i see little hope for Ents anytime soon. However, the last expansion was focused on dwarves, and the current expansion on men. Maybe the next one will focus on elves, and get more into the lorien area?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78062-ents/?do=findComment&comment=752701","commentId":752701,"userName":"Glaurung","timestamp":1359018007,"content":"Yes we all wating for them……"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78062-ents/?do=findComment&comment=752717","commentId":752717,"userName":"RendTheHeavens","timestamp":1359019432,"content":"It would be really interesting to see how they would be used in the game. I could see them being similar to Eagles.\n\n \n\nAlso, since all the expansions are based off of a story line, Which one do you think could be used to focus on the elves and their territory? It's been a while since I read the books, Were they doing anything during this time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78062-ents/?do=findComment&comment=752725","commentId":752725,"userName":"richsabre","timestamp":1359020264,"content":"RendTheHeavens said:\n\nIt would be really interesting to see how they would be used in the game. I could see them being similar to Eagles.\n\n \n\nAlso, since all the expansions are based off of a story line, Which one do you think could be used to focus on the elves and their territory? It's been a while since I read the books, Were they doing anything during this time?\n\n\n\nthe end of the third age really saw the elves' time over….they were all pretty much making their way to the grey havens to depart middle earth\n\nthere were however a few things of note…dol guldur attacked lothlorien twice (i think) during the war of the ring, so i can see lorien really getting some orc attacks as storylines\n\nalso given the mirkwood was pretty near (and in the same place as thranduil's elves) then i see a return to mirkwood\n\nrivendell had the wilderness of the trollshaws and the misty mountains near, both of which i am especially looking forward to\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78062-ents/?do=findComment&comment=752947","commentId":752947,"userName":"Hannibal_pjv","timestamp":1359044132,"content":"Hmmm… I think that ent would be a guite a lot like the original Gandalf is. Guite expensive, very powerfull and very short term investement. The Ents are no so keen on peoples busines, so they come, kill some orcs, (if they somehow get agitated,) and soon goes back to the forest to see after those dangerous huorns!\n\n:-)\n\nHoooom, don't be hasty!\n\n "}]}