{"url":"https://community.fantasyflightgames.com/topic/78097-beat-laketown-3-out-of-5-times-with-this-deck/","title":"Beat Laketown 3 out of 5 times with this deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78097-beat-laketown-3-out-of-5-times-with-this-deck/?do=findComment&comment=753097","commentId":753097,"userName":"Tracker1","timestamp":1359064383,"content":"Built with 2 core sets and every thing up to and including HoN.\n\n \n\nGlorfindel (spirit)\n\nFrodo\n\nAragorn (lore)\n\nStarting threat: 24\n\n \n\nAllies: (17)\n\nGleowine x 2\n\nMaster of the forge x3\n\nHenemarth Riversong x1\n\nElfhelm X1\n\nWest road traveller x 2\n\nEscort from Edoras x 3\n\nArwen Undomiel x2\n\nGandalf (OHaUH) x3\n\n \n\nAttachments: (21)\n\nA Burning Brand x2\n\nFast hitch x3\n\nAfaloth x2\n\nUnexpected courage x2\n\nLight of Valinor x3\n\nAncient Mathom x3\n\nSong of Wisdom x3\n\nGood Meal x3\n\n \n\nEvants: (12)\n\nThe Galadhrim's Greeting x3\n\nA test of will x3\n\nElrond's Counsel x3\n\nShadow of the Past x3\n\n \n\nStrategy:\n\nI really build up frodo with attachments.  If I can I'll get 3 fast hitches, song of wisdom, and burning brand on him.  Of course he'll also get the Good meals and play the Galadhrim's greeting with them.  All this is primarily to defend the smaug card that attacks during the staging step, Frodo, can take this damage during the quest /staging phase and ready with fast hitch to defend again during the combat phase.  If arwen is in play giving frodo +1 def then both of these attacks will only add up to 4 threat.  If he has another fast hitch he could have also quested, or if he did'nt he could attack.  \n\nGandalf is another key card in the strategy.  I try to get him in the game sometime during the 2nd quest card, usaully sometime after Aragorn has reduced the threat back to 24, this is basically removing all the threat generated by frodo.  At that point I'll be tring to lower burn damage on laketown and start my attacks on smaug.  Gandalf will stay in the game at this point.  And I'll have to take his threat increase at the end of the round.  THis is where the good meals and greetings come into play.  I usually save them in my hand until this part of the game.  With master of the forge and Gleowine card draw is pretty good.  So, I usually had the cards I needed.  Resource production on the other had was pretty slow.\n\nAt some point glorfindel will have light of valinor and Aragorn will have unexpected courage, so all my heros are questing with gandalf and arwen.  Burn damage is not an issue.  Can easily drop it to 0.  What is critical is making sure i have the Old Thrush objective card.  I ve lost every time without it when I drew it as a shadow card, so I started to include Shadows of the past to return it to the top of the encounter deck.  With old thrush and plenty of cards in my hand, Mathoms are great for this purpose.  I'll get smaug up to about 10 points damage and have the the 2nd quest card with 9 progress tokens.  \n\nThe next round I'll take him out.  I quest with everyone, and then ready them with attachments.  Then frodo defends. Attack with gandalf, glorfindel, aragorn, and any other potential attackers.  I'll discard 8 or so cards from my hand, and deal 10  damage to smaug.  Typically there is very little burn damage on laketown, and I usually have about 20 victory points to spare.\n\n3 out of 5 times with this deck.\n\n \n\n \n\n \n\n \n\n "}]}