{"url":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/","title":"Custom Scenario: Into Fangorn now available","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/?do=findComment&comment=753047","commentId":753047,"userName":"Raven1015","timestamp":1359056244,"content":"Aside from working on the Tales from the Cards blog, I've recently been spending time creating a custom scenario called Into Fangorn. As you can guess from the name, it has to do with Ents, Huorns, and investigating Fangorn Forest (pretty good timing considering the other post about Ents today). It's a stand-alone encounter set, so you don't need to include any other sets. Here's the link to the post, which will direct you to the download. You can either download a printable form or there are also some sets to play it on OCTN:\n\nInto Fangorn [http://talesfromthecards.wordpress.com/2013/01/24/custom-scenario-into-fangorn-released/]\n\n \n\nFeel free to give me any feedback on play experiences!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/?do=findComment&comment=753050","commentId":753050,"userName":"Raven1015","timestamp":1359056299,"content":"I meant OCTGN sorry"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/?do=findComment&comment=753227","commentId":753227,"userName":"Memetix","timestamp":1359086423,"content":"I thought I'd download this and give it a go, feedback to follow.\n\nI don't own the Heirs of Numenor set so I don't know the rules for battle, siege, archery. Can anyone explain them or point me at a pdf with the rules please?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/?do=findComment&comment=753265","commentId":753265,"userName":"Nerdmeister","timestamp":1359095014,"content":"From FFG´s LotR LCG support page:\n\nhttp://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/rulesheets/Heirs-of-Numenor_rules.pdf [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/rulesheets/Heirs-of-Numenor_rules.pdf]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/?do=findComment&comment=753427","commentId":753427,"userName":"Memetix","timestamp":1359113736,"content":"Thanks for the rule link Nerdmeister.\n\nWow - that was quite a battle, played 2 player (in OCTGN).\n\nHeroes were: Beorn, Berevor, Glorfindel (Spirit) and Dwalin, Nori, Bifur.\n\nThe first deck was a \"good and cheap stuff\" deck, the second is designed to play the new Gandalf and keep its threat under control. Sadly no Orcs to kill so Dwalin was a bit of a waste of space.\n\nIt took 3 and a half hours to play through but we made it in the end. Beorn had 2 hit points left, the other heroes were healed by a friendly warden throughout the game. Both Glorfindel and Berevor were really useful in helping with the anger of the forest.\n\nI thought you captured the feel of Fanghorn really well, I particularly liked the spiders that reduce your attack strength (and hence questing in the battle stage of the quest). Overall an well themed and thought out quest and well worth playing. I'll certainly give it another go and the quality of the artwork is top-notch.\n\nRandom thoughts/Feedback.\n\n1. I'm not sure the the anger of the forest will work in a 3 or 4 player game, there is no way you could keep the resource tokens under control given the number of cards being revealed from the encounter deck, especially as half of them seem to surge or cause more cards to be drawn in other ways. Maybe you could allow each player to exhuast a hero to remove tokens.\n\n2. Beorn was always the target of the treachery card \"fog and melancholy\", but since he cannot have attachments we played it that he became exhausted and then the condition was discarded. I'm not sure this is what you'd indended.\n\n3. All the enemies have at least 4 attack, this seems a little harsh, the scenario may work better if you drop the attack value of the branches to 3\n\n4. I suspect the the proportion of cards with shadow effects could be too high. As it stands it feels like you really need to get a burning brand into play in order to succeed.\n\n5. Quest stage 3b was over in the blink of an eye and given that the Ents are suppoed to be deliberating for ages I think you could increase the quest total of this stage to make it last longer.\n\n6. The final stage of the quest felt like a slight anti-climax. We were able to block and then kill Amroth on the first turn he appeared. If there was a requirement to quest for say 4 on this stage we would have had to deal with the troll and huorn that were also in play in some sense too.\n\nThanks for all the effort you put into the quest and I really appreciate the OCTGN download, it makes it far more accessible. Great work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/?do=findComment&comment=753458","commentId":753458,"userName":"Raven1015","timestamp":1359116950,"content":"Glad you enjoyed it Memetix! Your feedback was very well-detailed and will be invaluable in improving it for version 2.\n\nA few notes on what you said, which might be helpful for others who are thinking about creating their own scenarios or want to give feedback on this one:\n\n1) That is a good point about Anger of the Forest. Admittedly I have a bit of a blindside for 3 or 4-player play, as my own experience is mainly in the 1 or 2-player realm. Originally, I had it that each player could exhaust one hero to reduce tokens, but found that it made it sometimes too easy to keep things in check for 2-player play. For v2, I might make the text on Anger of the Forest and Ent Guardian player dependent (X tokens instead of a set amount).\n\n2) I think you meant \"Lulled to Sleep\"? Beorn is an interesting case, as then that would be an easy way to render the treachery ineffective. I would say that if a hero cannot have attachments, then it should go to the next lowest willpower hero in line. I'll think about tinkering with the wording a bit to make it more clear.\n\n3) You definitely have some of my same instincts when it comes to design. The Branches originally had 3 attack in my first version, and then I upped it to 4 to make the first part of the quest a bit more tricky. Overall, the high-attack enemies are designed to gvie players the feeling that they are walking amongst giants and have to be wary, but I could live with the Branches being lower. I'll have to think about that one.\n\n4) Another player mentioned about the proportion of shadow effects as well. Again, this is something that I modified, as in my first version there were far less shadow effects. I suspect that I over-compensated a bit and will likely be reducing the amount of shadow effects a bit for v2. It seems that finding the best ratio for shadows is one of the key design considerations, and is a way of controlling difficulty as well.\n\n5) I am in agreement about quest stage 3. I was very tempted to make it a longer stage, but decided against it, as I figured if players could get Ents literally \"on their side\" by making them allies, then that was a sufficient condition. However, I like the flavor of the Ents deliberating for a long while meaning more progress tokens needed, and I will be rolling with that for v2.\n\n6) Figuring out how to make the final boss battle challenging yet not over-powered was a bit of a challenge for me. I thought of making him the type of enemy who was engaged with all players, but that would make him too easy to kill. I think perhaps some extra mechanic, tokens, or text on quest stage 5 could remedy the situation.\n\nAgain, thanks for trying it out and thanks for the feedback, super helpful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78093-custom-scenario-into-fangorn-now-available/?do=findComment&comment=765052","commentId":765052,"userName":"Raven1015","timestamp":1361331120,"content":"I've released version 2 of Into Fangorn based on player feedback. Here's the link:\n\nhttp://talesfromthecards.wordpress.com/2013/02/20/into-fangorn-v2-is-now-available/ [http://talesfromthecards.wordpress.com/2013/02/20/into-fangorn-v2-is-now-available/]\n\nAnd here's the change list:\n\n- Formatting now follows the correct template (italics, bold, etc.)\n\n- The cards now include a custom icon for the scenario instead of the Passage through Mirkwood icon\n\n- Frequency of shadow effects has been decreased\n\n- Anger of the Forest and Ent Guardian have been modified to scale better depending on the number of players\n\n- Quest Cards 3B and 5B have been modified to be more consistently challenging\n\n- A few minor text tweaks on certain cards\n\n- Updated to work with the newest version of the LOTR OCTGN plug-in"}]}