{"url":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/","title":"The Game within the Game…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=753503","commentId":753503,"userName":"Brownmantle","timestamp":1359120349,"content":"I have a question for all those who run Dwarven decks. Well, actually I have several questions. I dropped my Dwarven deck last year and, when it comes to dwarves, I’m extremely rusty. I’ve been playing the new quests two handed and have been having a hell of a good time, especially with . I’m really looking forward to playing the new Hobbit expansion with a two Dwarven decks and would like to preconstruct them so as to leave room for card swapping and not complete redesign-on-the-spot. What do I have available for a Double Decker? I have…well, two core sets and one of everything else.\n\nFirst Question: Bombur?\n\nSecond Question: Two decks = two sets of three hero’s. Which Six do I choose? (Bombur?)\n\nThird Queston: Synergies? (Dain, Thorin, Thrain, Bombur?)\n\nA deck list would be awesome, but thoughts would be greatly appreciated.\n\nRants are encouraged.\n\nSoapboxes are subsidized.\n\nMovie quotes get extra points (and we are keeping score).\n\nRules…\n\n1: points are not very just\n\n2: most points win\n\n3: loser gets the Cheat\n\nStarting Tally:\n\n \n\nBenhanses: 5\n\nRich: 5\n\nDurin III: 3\n\nJoby 21: twenty-one\n\nMr. Thomas Schmidt: 42"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=753507","commentId":753507,"userName":"Brownmantle","timestamp":1359120548,"content":"err…\"especially the Seige of Cair Andros…\"\n\nBrownmantle: disqualified from game for being a dork."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=753532","commentId":753532,"userName":"hendersondayton","timestamp":1359124552,"content":"Here is a great Dwarf deck\n\nhttp://hallofbeorn.wordpress.com/2013/01/22/deck-boromir-and-the-seven-dwarves/ [http://hallofbeorn.wordpress.com/2013/01/22/deck-boromir-and-the-seven-dwarves/]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=753545","commentId":753545,"userName":"legolas18","timestamp":1359125398,"content":"If you had to choose six dwarf heroes, I would probably choose something like this (in no specific order): Dain, Gimli, Nori, Bifur, Ori, and either Dwalin, Thalin, or Thorin.  Then, have one deck focused on tactics, for the fighting, and the other focused on… everything else.  I always include all of the Erebor Battle Masters, all of the Veteran Axehands (cheap and useful), and all of the weapons possible in tactics except for the Silvan and Noldor ones.  But…. You may not want to listen to my advice either because I have yet to win any of the Heirs of Numenor quests. complice [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/guinyo.gif]  As for synergies, Dain is everything.  Even though he's a great defender, I usually keep him ready as much as possible, because of his +1 will and attack to everybody.  Also, the Thorin, Ori, and Nori deck is always fun with a lot of allies.  As for Bombur… Well I don't have much to say about him.\n\nBut I always include the Battle masters, because they provide a short cut to winning fights.\nOr should I say a \"Shorcut to Mushrooms.\"\n\n. I hope there is a first quote award. reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=753547","commentId":753547,"userName":"richsabre","timestamp":1359125768,"content":"im so confused !!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=755059","commentId":755059,"userName":"Mr Coffee","timestamp":1359398295,"content":"First, I want to know what I get 5 points to start off with?  And what personal humiliation must I endure to get MTS's starting points of 42??\n\n \n\nI absolutely MUST win The Cheat.  The future of Strongbadia depends on it!\n\n \n\nBrownmantle said:\n\n \n\nFirst Question: Bombur?\n\n \n\n \n\n \n\nAnswer:  Erebor Battle Master.  Thorin.  We Are Not Idle.  (more on this answer in a bit)\n\n \n\nBrownmantle said:\n\n \n\nSecond Question: Two decks = two sets of three hero’s. Which Six do I choose? (Bombur?)\n\n \n\n \n\n \n\nAnswer:  This is completely dependant on how you intend to synergize your decks (jumping the gun to your next question)…  You can either do it by sphere (eg, pair up two spheres for each deck and let 'er rip), or try and base it around mechanics within a core group of cards.  Honestly, this is the only race in the game that we have this much luxury to make this decision around.  A blessing AND a curse…  I'll throw some possible combos/ideas after the next question.\n\n \n\nBrownmantle said:\n\n \n\nThird Queston: Synergies? (Dain, Thorin, Thrain, Bombur?)\n\n \n\n \n\n \n\nAnswer:  There's lots of them now!  For the longest time, I had run a tri-sphere Dain, Bifur, Dwalin deck and being VERY successful with it.  Then Rich's use of Thalin with the first two of those inspired me to switch from blue to red.  The deck works much better for \"large\" enemies, as it allows for using the Erebor Battle Master.  However, since I still love my blue escape cards and threat reduction, I find that the costlier red cards and needing to drop Narvi's Belt into the deck make it suffer a bit of card-draw/resource sluggishness.  I haven't tried the Thorin, Ori, Nori combo yet since I haven't had much playing time in lately.  But Nori has pretty much identical stats to Dwalin and has a better built-in threat reduction for dwarven decks (better quester than Dwalin as well).\n\nPersonally, I'd scrap the sphere-focused decks.  Mostly because of Thorin and Dain.  If you're really going to run 6 dwarven heroes, Dain is already a MUST HAVE.  Thorin is a bit pricey, but having him on the same table as a \"ready\" Dain means he quests as hard as Eowyn does.  Gonna let that sink in for a second…    So I would definitely have them both out.  But are you gonna run two 12-cost Leadership dwarves in the same deck (adding a third to them means you start at around 30 threat)?  In my mind, I'd split them up.  So that means that my sphere-focused decks are out the window.  If you AREN'T using Thorin, then it's still completely doable.  I'd run Dain, Gloin, and Nori in one deck and Bifur, Thalin, and Gimli in the other.  Drop SoG on Dain, use him and Gloin to create massive wealth (what dwarves do best right?) and Nori to get rid of all that nasty threat.  Bifur can steal all that wealth from the two horders and help pay for the spendy Tactics and Lore cards to keep Gimli and Thalin alive.\n\nHere's where my mind is just going to wander for a bit about Bombur… I was kinda \"Meh…\" about him when I first saw him.  However, if running two entire decks of dwarves, I think he'll be a beast.    Run a strong Dain, Bifur, Thalin deck such as Rich has fleshed out before.  This will provide a strong base for operating from.  Then combine Bombur with Thorin and Ori to start.  That means if you can get one cheap dwarven ally out on round 1, then you generate an extra resource and draw an extra card starting in round two from there on out.  If you have a Narvi's Belt (or song) on Thorin, you definitely will want to get EBM out.  Bombur alone gives him +2 attack.  Then you start dropping \"We Are Not Idle\" and all you need is him alone and he generates two more resources and a card for you.  Have a UC on him to ready him and use his 5 health to soak up the damage from defending!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=755355","commentId":755355,"userName":"Captain Poe","timestamp":1359448498,"content":"richsabre said:\n\nim so confused !!!!\n\n\n\n \n\nI'm glad i wasn't the only one who had no idea what the hell the original poster was trying to convey."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=755371","commentId":755371,"userName":"Gizlivadi","timestamp":1359450182,"content":"Captain Poe said:\n\nrichsabre said:\n\n \n\nim so confused !!!!\n\n \n\n \n\n \n\nI'm glad i wasn't the only one who had no idea what the hell the original poster was trying to convey.\n\n\n\n \n\nNot trying to be mean but… same here. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=755543","commentId":755543,"userName":"Mr Coffee","timestamp":1359469229,"content":"Gizlivadi said:\n\nCaptain Poe said:\n\n \n\nrichsabre said:\n\n \n\nim so confused !!!!\n\n \n\n \n\n \n\nI'm glad i wasn't the only one who had no idea what the hell the original poster was trying to convey.\n\n \n\n \n\n \n\nNot trying to be mean but… same here. \n\n\n\n \n\nWell, I assume the questions about all the Dwarfy stuff made sense and that it was all the random blather about points and such that seemed odd.  That's just Brownmantle's way of being…. well, Brownmantle sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=755593","commentId":755593,"userName":"legolas18","timestamp":1359476562,"content":"To tell the truth, I didn't know what was going on either, but I just decided to play along. sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78133-the-game-within-the-game%E2%80%A6/?do=findComment&comment=756885","commentId":756885,"userName":"Beano","timestamp":1359663628,"content":"Speaking to the spirit of the questions. I think many run Thorin, Ori, and Nori in one deck which is a fantastic combo, my other hero combo right now is Dain, Thalin, and Dwalin. I think Dwalin mostly blows, but he is needed for Spirit access right now until a new option is available in hobbit 2 (crosses fingers). My decks are posted on my latest blog entry here: http://www.boardgamegeek.com/blogpost/16358/heirs-of-numenor-how-it-has-changed-the-game [http://www.boardgamegeek.com/blogpost/16358/heirs-of-numenor-how-it-has-changed-the-game]\n\nI don't see Bombur replacing anyone in this group unless an alternative to A Test of Will reveals itself. While the Thorin, Ori, and Nori deck could use a stud blocker, all in all your rank and file dwarves can often handle most attacks once without dieing (even more with Hardy Leadership or a ring mail), and they can generally be cranked out when maximizing synergies such that they are easy to toss away as cannon fodder blockers. So I see the value in a Bombur super defender with Burning Brand, but this is somewhat redundant with a powered up Dain on the board - and Dain is a MUST. As far as Bombur's card text goes, I don't think there are enough synergies at the moment to make it particularly valuable. Thorin and Ori's powers are easily triggered with a deck packed full of dwarves. An Erebor Battle Master really doesn't need many dwarves on the board to be able to kill just about anything in the game. And We Are Not Idle is just not enough to justify Bombur's existence.\n "}]}