{"url":"https://community.fantasyflightgames.com/topic/78181-pursued-by-shadow-core-117/","title":"&quot;Pursued by shadow&quot; (CORE 117)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78181-pursued-by-shadow-core-117/?do=findComment&comment=753914","commentId":753914,"userName":"drasen","timestamp":1359202378,"content":"Hi All,\n\nI am new to this forum and this is my firt post. I have been enjoying LOTR-LCG for the last month and a number of questions have arisen during this time. The follwing one concerning \"Pursued by shadow\" (CORE 117)  was posted somewhere else, and the prevalent opinion was towards applying the text of the card as it is, however I would like to know whether there is an official endorsement to such mechanics:\n\nThe text of the card Pursued by shadow (CORE 117) reads: \"When Revealed: Each player raises his threat by 1 for each character he controls that is not currently committed to a quest.\" I understand that this was written having in mind a \"normal\" quest phase. However, some scenarios alter the procedure of the quest phase, and Pursued by shadow could be revealed before the players have had the oportunity to commit any character to the quest. For example, at the beginning of the quest phase during stage 2 of The hunt for Gollum, two cards have to be revealed from the encounter deck and one must go to the stage area. In case Pursued by shadow goes to the stage area at that moment, no characters would have yet been committed to the quest and there would be an automatic raise in threat equal to the number of characters controlled by the player. Should such heavy punishment be applied or should the text be left without effect in this case? (Similar situations can occur with other cards as well.)\n\nCheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78181-pursued-by-shadow-core-117/?do=findComment&comment=753923","commentId":753923,"userName":"muemakan","timestamp":1359203383,"content":"That's bad luck. Yes you have to raise your threat, no matter when the card is revealed. All \"when revealed\" effects trigger anytime the card is revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78181-pursued-by-shadow-core-117/?do=findComment&comment=753936","commentId":753936,"userName":"drasen","timestamp":1359204864,"content":"Thank you Muemakan, that is bad luck indeed."}]}