{"url":"https://community.fantasyflightgames.com/topic/78193-restricted/","title":"Restricted","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78193-restricted/?do=findComment&comment=754035","commentId":754035,"userName":"horico","timestamp":1359218533,"content":"So i have a question about this keyword. I've been reading online blogs of the game (seemed credible but now more confusing) and they implied that they attatch two (for example) spears of the citadel on the same character. I know a single character cant hold more than one restricted, so no spear of citadel and citadel plate one one character. That is correct right, as per the keyword right?\nMy question is this, If an armour or weapon do not have the restricted keyword. can a character hold more than one armour or weapon? It seems silly that a single character sports two armours and three weapons at a time.\nI dont know of any without the restricted keyword off the top of my head so, maybe this question is just hypothetical."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78193-restricted/?do=findComment&comment=754064","commentId":754064,"userName":"GrandSpleen","timestamp":1359221551,"content":"You can have 2 restricted attachments, regardless of what they are.  So yes, you can have 2 citadel plates on the same character.\n\nBut!  You can't have 2 spears of the citadel on the same character.  The card specifically forbids it: it says \"Limit 1 per character.\"  I've seen people mention putting 2 spears on a single character also… I'm not sure why so many people seem to miss that text.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78193-restricted/?do=findComment&comment=754414","commentId":754414,"userName":"horico","timestamp":1359300423,"content":"Thank you that's a great help. One last question about a keyword. For Ranged. Does the player the creature is engaged with have to have an attacker for a ranged character to attack or could the player enganged with just defend and another player with ranged attacks it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78193-restricted/?do=findComment&comment=754446","commentId":754446,"userName":"GrandSpleen","timestamp":1359304951,"content":"A ranged character can attack an enemy engaged with another player even if the ranged character is the only character attacking.  I'm getting that from the manual: ranged characters may declare attacks against enemies engaged with other players (p. 24).  If you are the ranged character's controller, you can declare the attack when it's your turn to declare attacks.  In that case, the ranged character can attack alone.  Alternatively, on another player's turn, you can participate in an attack declared by the other player (in this case, I believe there must be another character attacking, because the other player would have had to choose a character in order to delcare an attack)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78193-restricted/?do=findComment&comment=754649","commentId":754649,"userName":"Nerdmeister","timestamp":1359339980,"content":"horico said:\n\nIt seems silly that a single character sports two armours and three weapons at a time.\n\n\nTry to think of it as one masterwork piece of armor if you put 2 citadel plates on the same character"}]}