{"url":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/","title":"Smaug the Immune-to-player-card-effects; reposting","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=757516","commentId":757516,"userName":"Nerdmeister","timestamp":1359773300,"content":"Posted this on the Print on Demand section. Then I realized there´s hardly anything going on in there, so Ill post here as well.\n\nThink I do know the answer to this put want to put it here anyway:\n\nIf Gondorian Spearman or a character with Spear of the Citadel defends against Smaug, will his ability prevent the dealing of 1 damage from taking place?\n\nAlong those same lines, if a character with Dwarrowdelf axe attacks, is Smaug immune to that 1 extra damage the axe does after the attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=757643","commentId":757643,"userName":"GrandSpleen","timestamp":1359798280,"content":"Yeah, those effects would directly interact with Smaug, so he is immune."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=757987","commentId":757987,"userName":"CJMatos","timestamp":1359880126,"content":"In that line of thinking, Rivendell Blade doesn't work against smaug, also…\n\n \n\n \n\nRivendell Blade [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/rivendell-blade-rtr]\nType: Attachment\nSphere: Tactics Cost: 1\nItem. Weapon.\nAttach to a Noldor or Silvan character.\nRestricted.\nWhen attached character attacks an enemy, that enemy gets -2 [Defense] until the end of the phase.\nIllustrator: Sara Biddle\nSet: RtR Quantity: 3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=758028","commentId":758028,"userName":"GrandSpleen","timestamp":1359887686,"content":" \n\nYeah… and that's correct, right?  So the +1atk of a Dwarrowdelf axe is OK (interacts only with stage 4 of combat resolution) but the +1 damage token is not (has to interact directly with the Smaug card).  The Rivendell blade directly subtracts defense from Smaug (which would have implications if there were, for example, a shadow card that did something to all enemies with 0 defense).  RB isn't processed as a part of combat resolution, unlike character +stat bonuses and the hero's base attack value.  It's applied directly to the target card, so he's gotta be immune to it.  Has this been ruled otherwise?\n\n“It's a dangerous business, Frodo, thinking about card immunity. You make one conclusion, and if you don't keep your feet, there's no knowing what other cards might be swept off, too.”\n\nBilbo said it best.   We really do need a developer to give a 60-minute lecture on this topic.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=758583","commentId":758583,"userName":"CJMatos","timestamp":1359995935,"content":"Yep that it is correct. I was just pointing out another card that would affect smaug…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=758760","commentId":758760,"userName":"Nerdmeister","timestamp":1360029940,"content":"This really does take ALOT of bite out of the tactics decks in regards to this scenario. Tactics might have been allowed to shine more if Smaug had read something like \"Smaug cannot have cards played on him\", which would take care of the feints, traps and so forth that would make the scenario too easy, while at the same time still allowing tactics attachments played on characters to still affect him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=762639","commentId":762639,"userName":"Glaurung","timestamp":1360831679,"content":"I have also i quiestion which bother me.\n\nThere is 1 treachery card Name: Town baiting or something….. Smaug make attack agaisnt Lake-Town and any player can assign defener if he want and excess damage must be placed on the Lake-Town.\n\nQuestion: Should i deal Shadow Card to Smaug for this attack or not? Im not sure about it………"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=764511","commentId":764511,"userName":"HeavyKaragh","timestamp":1361239673,"content":"Glaurung said:\n\nShould i deal Shadow Card to Smaug for this attack or not?\n\nShadow cards are dealt because of a step of the combat step, not because Enemy attacks. If the effect doesn't say it, you dont' deal a Shadow card to the attacking Enemy. See \"Wolf Rider\", \"Chieftain of the Pit\", \"Durin's Bane\" or \"Followed by Night\".\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=764726","commentId":764726,"userName":"GrandSpleen","timestamp":1361275325,"content":"The text on cards like Wolf Rider is just a reminder to deal the card.  The official FAQ clarified this awhile back:\n\n\"(1.26) Enemy attacks outside of the combat phase\n\nIf an enemy attacks outside of the combat phase, it is still dealt a shadow card at the beginning of the attack. Then follow the 4 steps under Phase 6 “Combat” in the rules.\"\n \nSo, anytime an enemy attacks, deal it a shadow card… unless otherwise directed!\n \nAnd then the shadow card dealt for that attack remains on that enemy until shadow cards would normally be discarded (i.e., at the end of the combat phase).  Yes?  I remember this coming up awhile back.  Nothing to indicate it would be discarded any time before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=765059","commentId":765059,"userName":"Glaurung","timestamp":1361336364,"content":"Sounds like you both right.\n\nYes shadow cards should discard in the end of the combat phace if there is no special text.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=834931","commentId":834931,"userName":"Nyck","timestamp":1376043977,"content":"Hi, \n\nI just stumbled about another thing concerning Smaug and his immunity to player card effects.\n\n \n\nIn the latest FAQ it is said that you are allowed to use player card effects on cards which are immune to player card effects as long as they are inactive/not in play (f.e. fetching Beorn out of the discard pile by using a card effect).\n\n \n\nSo i was wondering if it would be allowed to play a card like \"Ithilien Tracker\" (Action: Exhaust Ithilien Tracker to lower the [Threat] of the next enemy added to the staging area to 0 until the end of the phase) and placing Smaug in the staging area to reduce his threat.\n\n \n\nAt least in the first round the card effect happens before Smaug is active (he will be drawn from the Smaug-Pile) so he will not be immune to it... and if this is correct what about the next round when you exchange him with another Smaug card... ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78610-smaug-the-immune-to-player-card-effects-reposting/?do=findComment&comment=838692","commentId":838692,"userName":"Nyck","timestamp":1376406615,"content":"It does not work...\n\nFollowing Calebs reply:\n\n \n\n> Hi Nyck,\n> Good question. Unfortunately, the Ithilien Tracker's ability will not work on Smaug because it only works on an enemy \"added to the staging area.\" By the time Smaug is added to the staging area, it has entered play and it's immunity is active.\n> Hope you're enjoying the scenario!\n> Regards,\n> Caleb\n> \n>  \n> \n>  "}]}