{"url":"https://community.fantasyflightgames.com/topic/78632-aragorn-lore-and-gandalf-hobbit/","title":"Aragorn (Lore) and Gandalf (Hobbit)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78632-aragorn-lore-and-gandalf-hobbit/?do=findComment&comment=757676","commentId":757676,"userName":"Alex6222","timestamp":1359804559,"content":"I think i know the answer but just to be sure. Gandalf says that i have to discard it at the end of the Refresh Phase unless i raise my threat by 2. So would this happen Before i reduce my threat with Aragorn or would it happen After. I think is the first one, but then again just to be sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78632-aragorn-lore-and-gandalf-hobbit/?do=findComment&comment=757720","commentId":757720,"userName":"Tracker1","timestamp":1359814180,"content":"The way I think it's played is that Aragorn's refresh action takes place before Gandalf's forced text, so you would add on 2 threat to your starting threat after you refresh.  The reason being that Gandalf is still in play after he refreshes, and you could use an event like Word of Comand before he is discarded.  Aragorn's refresh action would also take place during this player action window.  I think when all player actions are completed then Gandalf's forced text takes place at the end of the round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78632-aragorn-lore-and-gandalf-hobbit/?do=findComment&comment=757994","commentId":757994,"userName":"leptokurt","timestamp":1359881244,"content":"Completely missed that. ****!\n\n \n\nAnd thanks for bringing that up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78632-aragorn-lore-and-gandalf-hobbit/?do=findComment&comment=759367","commentId":759367,"userName":"Thanatopsis","timestamp":1360142997,"content":"The Turn Sequence chart from the rule book can also be used to explain this.\n\nAragorn's card text is a \"Refresh Action\". There is only one available action window for this to happen: after card refresh, after the +1 threat, and after the first player token passes. Then Aragorn may use his ability. Gandalf's ability states \"at the end of the resource phase\" which could alternatively be written \"just before the first player collects resources in the resource phase.\" That is, it occurs after the action window.\n\nSo, if you're sitting at 48 threat, Aragorn can save you before Gandalf's ability ends the game for you\n\nHowever, if you're sitting at 49 threat, Aragorn cannot save you from the +1 threat bump."}]}