{"url":"https://community.fantasyflightgames.com/topic/78638-basic-question-for-all-you-long-time-veterans-of-the-game/","title":"Basic Question for All you Long-time Veterans of the Game.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78638-basic-question-for-all-you-long-time-veterans-of-the-game/?do=findComment&comment=757726","commentId":757726,"userName":"DurinIII","timestamp":1359816500,"content":"So a question keeps cropping up at our weekly game night: one of our players keeps insisting that if a card costs 0 resources to play, then it is perfectly acceptable to play such a card in any deck, regardless of sphere matching. For example, he might play a Lore/Tactics deck and then splash in 3 copies of Daeron's Runes (a Lore sphere card that costs 0 to play) and argue that he can play it because it has a cost of 0. I have always been under the impression that regardless of the cost of a card, you had to be able to \"sphere match\" the card's symbol to one of your heroes in order to put that card into play. Am I right in my interpretation, or is he right? I think I know the answer already, but thank you all for your help, of course, I may be wrong afterall.\n\nJoseph"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78638-basic-question-for-all-you-long-time-veterans-of-the-game/?do=findComment&comment=757731","commentId":757731,"userName":"GrandSpleen","timestamp":1359816929,"content":"This one is clearly stated in the manual:\n\n \n\n\"Cards with a cost of zero do not require a resource to be\nspent in order to pay their cost, but they do require\nat least one hero under that player’s control to have a\nresource icon that matches the card’s sphere.\" (pg 12)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78638-basic-question-for-all-you-long-time-veterans-of-the-game/?do=findComment&comment=757736","commentId":757736,"userName":"DurinIII","timestamp":1359818222,"content":"Exactly; sometimes direct evidence is not enough."}]}