{"url":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/","title":"recruit: question about deck building and solo play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=758536","commentId":758536,"userName":"Cuendillar2","timestamp":1359988107,"content":"Hi there I am interested in LoTR living card game but like to know some things. I seen the trailer about gameplay and read some forums. There are many expantions and many forums talk about deck building. Is this really neccesary? When you buy an expantion is it playable or do you need to deck build? When you dont have deck build is it still fun or is it more easy? Do you just need 1 expantionpack or you have to buy more like in ccg? I read 50 card is minimum deck, are there rules for howmany cards of a type you can put in? Can you use all expansions with eachother? Also I read alot about solo playing. Is LoTR more an solo game? Thouth with core set you can play with 2 players. Is it easier to play with 2 or solo? With all these expantions you think it will be better playable with 4 players?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=758819","commentId":758819,"userName":"Cuendillar2","timestamp":1360044643,"content":"Can this threat be erased? Somehow I had some trouble with connection last night and the pages gave errors so I made post today without looking. I see now my earlier post did get through. Sorry for the spamming."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=758974","commentId":758974,"userName":"richsabre","timestamp":1360070266,"content":"Cuendillar said:\n\nHi there I am interested in LoTR living card game but like to know some things. I seen the trailer about gameplay and read some forums. There are many expantions and many forums talk about deck building. Is this really neccesary? When you buy an expantion is it playable or do you need to deck build? When you dont have deck build is it still fun or is it more easy? Do you just need 1 expantionpack or you have to buy more like in ccg? I read 50 card is minimum deck, are there rules for howmany cards of a type you can put in? Can you use all expansions with eachother? Also I read alot about solo playing. Is LoTR more an solo game? Thouth with core set you can play with 2 players. Is it easier to play with 2 or solo? With all these expantions you think it will be better playable with 4 players?\n\n \n\nhello and welcome\n\n1. threads can only be erased by moderators….i wouldnt worry about it, no one will mind here\n\n2.deck building is not only neccesary if you wish to get the most out of this game (ie. win more than the starter quest), but also a large part of the fun factor.\n\n3. expansions dont really work like that. what you have in each small pack is\n\n-1 new hero\n\n-about 9 or so new player cards (3 copies of each)\n\n- encounter cards that allow you to play 1 new quest\n\n \n\n4. when you dont deck build you will find the decks given in the core set are very limited and are for introduction and learning only (though some here use them)….the game relies on you to build decks to get the most out of card combinations, therefore allowing you greater power decks\n\n5. this is an lcg so you can buy as many or little as you want…there are some things to consider though\n\n- each smaller pack set is part of a 'cycle' where a cycle has 6 packs. to play ANY of the cycle packs you need to have a DELUXE expansion pack that came before it.\n\n-the core set acts as the 1st cycle's deluxe pack (1st cycle is called shadows of mirkwood)\n\n-after the 6 packs of the 1st cycle you then have a deluxe pack called khazad dum which is needed to play ANY of the following cycle (the dwarrowdelf cycle)\n\n-there are these new types of packs called Saga packs which can be bought without any other packs…there are only two of these (one is yet to be released) they are the hobbit packs\n\n-despite the idea of being able to only buy a few packs central to lcgs, you will find that the difficulty level increases alot from cycle to cyle, so if you wanted to get the core  set then the most recent cycle (3rd cycle) you will certainly struggle with winning…while there is nothing to stop you from doing this, its worth considering building up to the harder ones\n\n \n\n6. 1 of each named hero (so no deck with 2 bilbos in), 3 copies of any one card\n\n7. all player cards in all expansions are compatible with each other\n\n8. i have only played this game solo since its release 1.5 years or so ago….im perfectly happy with solo play, though any find it difficult to begin with. this is something you get used to, or alternatively you can player '2 handed' playing 2 players at once….its also fun, if not better.\n\nas for whether its more of a solo game than 2/3/4 player, i would say no…it is probably designed with 60% multiplayer, 40% solo in mind (there are cards that are useless in solo play…though not many (3 or 4))\n\ni did a poll a few months ago and it turned out more players on this forum play only solo play than any other type, so youre in good company :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nthe game is generally harder solo , getting easier with more players….some quests it is the opposite way round\n\nhope this helps\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=759049","commentId":759049,"userName":"Cuendillar2","timestamp":1360082515,"content":"Thank you very much Richsabre. These are insightfull awnsers. I dont mind deckbuilding.. When buying expansions you get all cards, not like magic or a ccg you have to hope for good cards And the scenario play seems nice aswell. I like cooperative games. I like arham horror alot. Though with deckbuilding with another, he has to like deckbuilding aswell. Nice you can soloplay then:) Can you use expansion cards of later cycles in previous cycles. What makes the deluxe cycle pack so it is needed for the smaller packs?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=759080","commentId":759080,"userName":"CJMatos","timestamp":1360086677,"content":"There aren't any rules preventing you from using cards from later cycles on the quests from previous cycles. In fact, i believe that FFG wants to enforce that with the newly created Nigthmare packs.\n\nHowever some players prefer to try to beat the quest first only with the use of the cards that were realesed till the quest that they are playing.\n\nFor instance, to play Return to Mirkwood (6th pack of the first cycle), those players will only use cards from Core and all the first cycle.\n\n \n\nCycle = 1 deluxe expansion and 6 Adventure Packs (AP's);\n\n \n\nThe encounter deck in smaller packs (AP's)  needs some encounter cards that come with the expansion that starts the cycle.\n\n1st Cycle- Core (base expansion) + 6 AP's (Hunt for Gollum; Conflict at the Carrock; A Journey to Rhosgobel; The Hills of Emyn Muil; The Dead Marshes; Return to Mirkwood) - known as the Shadows of Mirkwood cycle and tries to follow the quest to find Gollum.\n\n \n\n2nd Cycle- Khazad-Dûm (deluxe expansion) + 6 AP's (The Redhorn Gate; Road to Rivendell; The Watcher in the Water; The Long Dark; Foundations of Stone; Shadow and Flame) - known as Dwarrowdelf cycle and tries to establish what as happened to Balin in his attempt to re-colonize Moria.\n\n \n\n3rd Cycle- Heirs of Númenor (deluxe expansion) + 6 AP's. For now we only know the name of 4 of them and only the expansion has been released.\n\n \n\nHobbit - A sepparate cycle that follows the book of Tolkien and the story of the adventure that Bilbo undertook with the dwarfs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=759084","commentId":759084,"userName":"richsabre","timestamp":1360086857,"content":"No problem :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nyou can use the cards from later cycles in previous ones….the only real reason you need to do the whole 'deluxe then smaller packs' thing is that the smaller pack's quests rely on encounter cards from the deluxe packs…in other words you cant play the quest but can use the cards. this of course doesnt matter when it comes to player cards, you can use them in any quest, and indeed this is quite beneficial making hard quests easier as the card pool grows\n\nas above, the deluxe pack is needed as it contains encounter cards needed for the follow 6 small packs….the way quests work is that the 'enemy' cards (encounter cards) are split up into different sets which are shuffled into each other. there are several of these sets in the deluxe packs (which are much larger than smaller packs) however usually only 1 set in a small pack\n\ntherefore to make up the rest of the encounter deck which you will play against you need these other sets from the deluxe set, thus making the need to buy it first\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=759788","commentId":759788,"userName":"player543086","timestamp":1360212530,"content":"Welcome to the game! A while ago I've written an article entitled: A guide for new LOTR:LCG solo players. You can find it here: http://www.boardgamegeek.com/blogpost/16397/editorial-8-a-guide-for-new-lotrlcg-solo-players [http://www.boardgamegeek.com/blogpost/16397/editorial-8-a-guide-for-new-lotrlcg-solo-players] . You might find some useful points/suggestion there. Most of all though I hope you will enjoy the game. As you can see from the posts above there is a tremendous community here and on BGG and many people will go out of their way to help you out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=761395","commentId":761395,"userName":"Cuendillar2","timestamp":1360557898,"content":"Thank you all for your replies. gave me some inside in the game and I think I like it. I like games where you can work together with friends.\nDeckbuilding I am no to into but who knows… took the step and bought the game. I must say it looks great and really invites you to play.  Even may want to deckbuild abit.. With just the core set it arent to many cards to pick from which makes it overseeable.\nLast night I played a trial game with my brother. Although the rulebook is easy to read we run into some questions.\n\nPlanning: when must action, respond cards be played is it here aswell? Do you keep them on table till a moment that you want to use them?\nI skip quest and travel for now will come back to that:\n\nEncounter: First a player may choose to engage a creature. This makes later engagement check for this creature invalite. Engagement and engagement checks are there to see to which player a creature is bound? For example player 1 has engaged creature A when a creature is not defeated in one turn the creature stays on player 1 next turn even though according engagement checks it should go to player 2 now?\n\nNow traveling: there are the creature A and a location card in the staging area. We want to go to the location. Does the engaged creature (assuming above was right) go with us to the location? (cause it is engaged?) Or does it stay on the main quest in staging area and wait for us to complete the location and then get engaged with player 1 again?\n\nIf creature A comes with us to the location and somehow survives but the location card is overwon. Is creature A then discarded? or goes with us back to the mainquest? Even so for when the main quest is overwon and we continue to a following part of the main quest.\n\nCan you travel from location to another location after the first is overwon or you always get back to the main quest?\n \n\nQuesting in relation to traveling: Steps are questing then traveling. We are at the staging area and there is a location card we want to go.\nFirst we need to submit us to the quest in the staging area and then travel right. So the new encounter cards will be deployed at the staging area. (as above when we move they can or can not move with us when traveling?)\nWhen on the location, next turn how and where is the quest submitted and compared with and where do the cards from the encounter deck deploy? The original staging area or the location?\nSeems to me both at the location. Any over damage will be added on the mainquest. (can you also choose a location in the staging area or isnt that location part of the adventure yet? I think it isnt cause you cant quest there yet, what about Snowbourn scout? can he add a progress token on location cards in the staging area?)\n \n\nHope my questions are clear if not I like to know so I can try and re-write my question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78741-recruit-question-about-deck-building-and-solo-play/?do=findComment&comment=761437","commentId":761437,"userName":"richsabre","timestamp":1360569062,"content":"hey again\n\nplanning: the best way to figure this out is to use the flow chart at the back of the rule book. the green boxes are those times when you can play actions generally whenver you want in whatever order you want. the planning phase is green so this applies. responses are rather different as they can only be played when a specific thing happens….for instance if the card says\n\n'response: after you play an ally draw 2 cards' then this card can only be played immediaty after you play an ally.\n\nresponses can be played in red boxes, unlike normal actions\n\nencounter: if a creature engages player A, or player A engages it first, it stays engaged to that player until it is killed or the player is killed. \n\ntravelling: locations and creatures are treated differently ….neither depends on the other. if there are creatures in the staging area you can travel to locations normally, and if there are locations in the staging area you can engage creatures normally….neither go with the other though\n\nlocations can be travelled and won…then of  course they are discarded.. the creature stays engaged with you. likewise the location stays with you if the creature dies\n\nquesting: again there is no 'travelling with the location' ….it is treated differently. the cards from the encounter deck always go to the staging area. then you add up and compare threat from said encounter cards against your commited questing cards as normal, and any progress goes on the location you travelled to\n\nany spill over from the location once it is discarded goes to the quest card…never to another location\n\n \n\nsnowbourne scout can add a progress to any location you choose as it doesnt specifiy where that location must be\n\nhope this helps\n\nrich"}]}