{"url":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/","title":"Journey Down the Anduin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=759256","commentId":759256,"userName":"Rogue Element","timestamp":1360120744,"content":"Hello all,\n\nI'm new to this game and have been confused by a few things. Most of my questions have been answered by looking through thesse forums at topics others have raised, but one thing is still currently confusing me - apologies if someone has covered this one though.\n\nDuring the set-up for Journey down the Anduin, you draw a card and place it in the staging area (assuming you are playing solo). You then turn to side 1B on the quest card and are instructed to place a Hill Troll in the staging area. Does this count as the encounter card draw for turn one, or do you still have to draw yet another encounter card during turn one?\n\nIt's a little confusing, since if you still have to draw another card, why wasn't this just included in the set-up instructions? Also it means that you have three cards in the encounter area (one of which is a Hill Troll!) before you even get going. Needless to say I've been taking a bit of a hammering tackling this one solo with just the core deck!\n\nMany thanks to anyone who is able to shed some light on this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=759346","commentId":759346,"userName":"GrandSpleen","timestamp":1360139380,"content":"You'll still have to reveal another card during the quest phase.  If you're lucky, you'll reveal a Hill Troll as your first reveal during setup, meaning you won't have to pull another Hill Troll out of the encounter deck.  But of course that rarely happens :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nA lot of the quests, and particualrly the older ones, are quite variable in terms of the opening couple of rounds.  If you get a pretty innocuous couple of reveals, the whole game is much easier.  On the other hand, if the encounter deck is intent on punishing you right from turn 1, things can go south very quickly.  Some of the newer quests avoid this by having static setups (no more \"reveal 1 card per player\" during setup)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=759511","commentId":759511,"userName":"Rogue Element","timestamp":1360162673,"content":"Many thanks for the quick reply.\n\nThat is how I've been playing it, but unfortunately it has meant that I often sit down to get involved in a good game, and then it's all over within 10 minutes. Thanks for the information about the later quests, I'll get one or two of the newer quests, and some of the newer heroes may also help me against the Hill Troll (I live in hope…)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=760436","commentId":760436,"userName":"Ted Sandyman","timestamp":1360322171,"content":"The lower your start threat with this one the better. I try to start at early to mid 20's which gives you a few turns to build up allies or get a snare into your hand before you have to engage the troll. Give Frodo, Eowyn and Denethor a go. Add in a splash of purple (Song of kings and Celebrian Stones, Steward of Gondors. ) Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=760494","commentId":760494,"userName":"GrandSpleen","timestamp":1360329958,"content":"Has Into Ithilien made anyone else rethink the way they approach Journey Down the Anduin?  The most common strategy as far as I know is as Ted describes above: delay engaging the troll.\n\nWith Into Ithilien (and potentially in Siege of Cair Andros), you've got X enemies on the table on turn 1 who not quite as strong as Mr. Troll, but no pushovers either (Southron Companies with 5 attack and 5 health).  X being the number of players in the game (plus whatever comes out of the encounter deck).  From what I've read, folks like to try to try to explore Ithilien Road on turn 1-- again, the avoidance strategy.   But not everyone does this, and I've read at least one account of players ignoring the quest and going at the Southron Companies right on turn 1…\n\nHow about a similar strategy here?  Now that the card base is significantly built up, do you play Journey Down the Anduin more aggressively?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=761796","commentId":761796,"userName":"yakysly","timestamp":1360674641,"content":"Hello, I am also new to the game (i have all the decks and boxes so far but never had the time to play) and was wondering why on the scenario deck you see on side a all the symbols used for  the encounter deck and on side b just one? You don't change the encounter deck one you flip the card with only one trait of encounter cards do you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=761908","commentId":761908,"userName":"GrandSpleen","timestamp":1360693398,"content":"Icons on Side A is there to instruct you how to construct the encounter deck.\n\nI guess Side B is just flavor.  It identifies this quest card as \"hey, I belong to scenario X.\"  You don't reconstruct the encounter deck when flipping quest cards unless specifically instructed to do so (I'm looking at you, Foundations of Stone!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=768661","commentId":768661,"userName":"Alex de la Fang","timestamp":1362098426,"content":"One more question on this quest.\n\nAt the second stage of the quest there is no engagement checks. What does it mean?\n\nAll monsters from staging area engages players no matter of player's treat.\n\nOR\n\nMonsters from staging area never engage players in monster's engagement phase.\n\nP.S. About start in this quest. Last time I had fantastic setup, after first quest phase: 2 Hill Trolls, Wolf Rider, Beastmaster and Marsh Adder,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=768695","commentId":768695,"userName":"Nerdmeister","timestamp":1362105399,"content":"Alex de la Fang said:\n\n \n\nOne more question on this quest.\n\nAt the second stage of the quest there is no engagement checks. What does it mean?\n\nAll monsters from staging area engages players no matter of player's treat.\n\nOR\n\nMonsters from staging area never engage players in monster's engagement phase.\n\n \n\n \n\nIt means that enemies will not check to see wether they engage you. Only way to engage enemies is to pick a fight yourself at this stage. It is quite possible to get a massive build-up of enemies in the staging area during this part of the quest, as every player can only voluntarily engage one enemy each turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=769655","commentId":769655,"userName":"SOGra","timestamp":1362337824,"content":"My wife and I just beat the Journey down Anduin scenario this afternoon.  It was our second attempt. \n\nThe first time we played the scenario, we played with 2  30 card decks with each 30 card deck being a basic sphere deck (don't remember which, though I remember I did Leadership). We got royally toasted in no time at all. I engaged the hill troll right away before I could get allies into play. Oops. Bad move. It went downhill from there. \n\nOn our play of Journey Down Anduin we played this afternoon, we mixed e sphere and played with 50 card decks. She had a combination of Spirit and Lore, and I did a combination of Tactics and Leadership. I used Aragorn, Gimli, and Legolas. I again engaged the hill troll right away and let him do damage on Gimli. Then on the second turn, my wife covered questing while I played Thicket of Spears, which causes my engaged players to be unable to attack. Then with Gimlis damage adding to his strength, and attacking also with Aragorn and Legolas, I had the hill troll knocked out on the second turn. My wife healed Gimli 2 damage, leaving 2 remaining to give him +2 attack for the remainder of the game. Legolas was able to add his 2 progress tokens onto the quest and combined with her questing, we were well on our way. Later in the game I was able to add Blade of Gondolin to Gimli, and in combining him with Legolas on successful kills, 3 progress tokens would be added to quests for every kill. We were lucky in that we did not get a lot of locations right away from Encounter deck draws. It was a great experience. \n\nSo, did we win by combining spheres into 50 card decks whereas on the first try we just played singular spere 30 card decks? Or lose the first time from bad luck? Or did we win the second time from good luck? I cannot say. All I know is that it was an enjoyable fun challenge on a Sunday afternoon. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=769672","commentId":769672,"userName":"GrandSpleen","timestamp":1362342359,"content":"Glad to hear you had an enjoyable experience.  It's a rewarding moment when you overcome a quest that has defeated you in the past!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=769706","commentId":769706,"userName":"SOGra","timestamp":1362350950,"content":"Correction to my last posting…Thicket of Spears caused enemies engaged with my characters to be unable to attack.\n\nIt was sweet.\n\nSorry for the word typo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=769852","commentId":769852,"userName":"Angus Lee","timestamp":1362384826,"content":"SOGra said:\n\nCorrection to my last posting…Thicket of Spears caused enemies engaged with my characters to be unable to attack.\n\nIt was sweet.\n\nSorry for the word typo.\n\n\n\nPlease be reminded that Thicket of Spears requires you to pay from three different heroes.  Since Aragon does not have the Tactic sphere of influence (unless you have played a Song of Battle on him), you can't play Thicket of Spears with these three heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=770987","commentId":770987,"userName":"SOGra","timestamp":1362611722,"content":"Regarding \"Thicket of Spears\"…good catch. I played it wrong then. I read the part about resources needing to be paid from three separate hero resource pools, but missed the part that all three heroes needed to be in tha same sphere. This is a technical reference to the rule book that says cards can only be bought with heroes in the sphere of which the card being purchased is from. In this case, it requires all three heroes to be from the same sphere in order to purchase the card. \n\nThanks for pointing it out to me. Like I said, good catch. Completely invalidates my victory last Sunday.  Oh well, back to start. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=774309","commentId":774309,"userName":"Vivekananda","timestamp":1363373963,"content":"The best way to deal with the Hill Troll is to not engage it in the first turn. I usually play with two Lore and one Tactics hero, if I use a trio like Glorfindel, Beravor and Legolas, I end up with a starting threat of 31, meaning the troll engages me on the first round. Unless I already have Feint in my hand, to stop him attacking the first round, and then get Forest Snare by the second round, when I will have enough Lore resources to use it, I will end up either losing a hero, or having my threat go up rapidly if I can use an ally as cannon fodder.\n\nHowever, by starting with Denethor instead of Glorfindel, I can start with a threat of 28 and if I substitute Bilbo for Beravor, it goes down to 26 (9+9+8). This will give me a few rounds to try and get more allies into play, and also increase my chances of getting either Feint, or the Forest Snare. I usually play with my wife, who has two Spirit heroes, so there is also a Spirit card that can let you remove an enemy who is already engaged, which means you can avoid being attacked by the troll.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=775493","commentId":775493,"userName":"peke12","timestamp":1363684035,"content":"A question regarding progress tokens on stage 1B.\n\nStage 1B has 8 quest points. when I have 8 progress tokens on it, but the hill troll is still in play, I can't advance to stage 2.\n\nmy question, when I still keep questing succesfully, do I still add progress tokens on the quest card? (put more than 8 tokens on it?)\n\nor is this not possible?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=775529","commentId":775529,"userName":"GrandSpleen","timestamp":1363692248,"content":"Yeah, you can continue to put progress tokens on the quest even if there are already 8.  I believe a FAQ entry noted that there is no upper limit on how many progress tokens may be placed on a quest card.\n\nThis is nice because there are some goblins that will remove tokens from the quest when they attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=775855","commentId":775855,"userName":"kennoastic","timestamp":1363762370,"content":"peke12 said:\n\nA question regarding progress tokens on stage 1B.\n\nStage 1B has 8 quest points. when I have 8 progress tokens on it, but the hill troll is still in play, I can't advance to stage 2.\n\nmy question, when I still keep questing succesfully, do I still add progress tokens on the quest card? (put more than 8 tokens on it?)\n\nor is this not possible?\n\n\n\nYou still add progress tokens on the quest card, even if it already has 8 tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=777108","commentId":777108,"userName":"Glaurung","timestamp":1364017143,"content":"Hey fellow i just got a Nightmare pack and try to play JDTA solo with Thorin company deck……… Crazy challenge i dont believe is possible solo at all.\n\nThere is some nighmare  cards too powerfull just dull. Anyway you can make whole SOM cycle exiting again to add some cards there and there……"},{"commentUrl":"https://community.fantasyflightgames.com/topic/78833-journey-down-the-anduin/?do=findComment&comment=779164","commentId":779164,"userName":"SOGra","timestamp":1364526751,"content":"This is possible. I think it is in the FAQ, but you can put any number of tokens on a quest, even beyond the printed number on the quest card. And it is advisable to do so while you are killing the hill troll. We got 8 on the quest on our 1st turn, and did not put any more on (we didn't know you could), and then as my son slowly battled the hill troll (in our 3 player game), we watched half of those 8 progress tokens disappear from encounter cards and shadow effects.  It all went downhill from there. We still have not beaten Journey Down Anduin (2 player…wife and me, or 3 player…wife, son and me). "}]}