{"url":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/","title":"Question about Ambush…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/?do=findComment&comment=760978","commentId":760978,"userName":"legolas18","timestamp":1360431330,"content":"What happens when a card such as Ithilien Tracker or Ranger Spikes is being used, and an enemy with Ambush is revealed?  So you have Ranger Spikes in the staging area unattached, or you have Ithilien Tracker using his lower threat ability.  When the enemy is revealed, does it immediately make an engagement check before the Ranger Spikes or Ithilien Tracker can take effect?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/?do=findComment&comment=761077","commentId":761077,"userName":"Nerdmeister","timestamp":1360459368,"content":"I would say that an ambush enemy attaches to the ranger spikes first, because ambush triggers \"after enemy enters play\", which also makes sense to me. As I see it Ranger Spikes negates the ambush ability much like Thalin negates the surge ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/?do=findComment&comment=761169","commentId":761169,"userName":"legolas18","timestamp":1360494172,"content":"Thanks for the clarification."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/?do=findComment&comment=887899","commentId":887899,"userName":"Tracker1","timestamp":1381688699,"content":"Just wanted to revisit this question.\n\nAmbush says: after an enemy enters play.\n\nRanger spikes says: Attatch to next eligible enemy that enters the staging area.\n\nDoes an enemy with ambush enter the staging area if it engages a player?\n\nWhat about Fresh Tracks this says: after an enemy is added to the staging area, deal 1 damage.\n\nSeems like ranger spikes might work with ambush, since it does not say \"add\"' but Fresh tracks would not.\n\nCorrect?\n\nBonus question: what about ranger spikes and Goblin Follower. Card's text says he engages the last player.\n\nMy thought is ranger spikes does not work here.\n\nEdited October 13, 2013 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/?do=findComment&comment=887922","commentId":887922,"userName":"GrandSpleen","timestamp":1381692029,"content":"Here's my take: when an enemy enters play, it is placed in the staging area, per the game manaul.  \"Placed in\" and \"Added to\" the staging area are interchangeable, per the FAQ.\n\n \n\nWhen an enemy with Ambush enters play, I think it would enter the staging area before triggering the Ambush keyword.  It goes into the staging area and is eligible for Ranger Spikes.  This would prevent the Ambush keyword from doing anything, since Ranger Spikes negates engagement checks (Ambush forces players to make engagement checks).  The Goblin Follower does NOT cause players to perform engagement checks -- he just engages the last player immediately.  Ranger Spikes would attach to him, but would not prevent him from engaging.\n\n \n\nI think Fresh Tracks will target any enemy also targeted by Ranger Spikes (excepting immune enemies).\n\n \n\nMy 2 cents.  \n\n \n\nBut here's a question:  when an enemy has \"When Revealed\" text, that text is resolved before the enemy goes into the staging area (pg 13 in current FAQ).  Keywords like Ambush and Surge are resolved when a card is revealed-- I assume that's got to happen after the enemy is added to the staging area.  It would be very awkward to hold an enemy card with \"Surge\" in limbo, reveal the next card, and then add the original enemy to the staging area.  But it looks like this is exactly what happens with a card like Orc Horn Blower [http://www.lotrlcg.com/Card/Focus/1306], whose \"when revealed\" text forces players to reveal the next card.  What state is the Horn Blower in, exactly, while that card is being revealed?  He's not in the staging area, but he's in play?  In play but nowhere in particular?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/?do=findComment&comment=1707604","commentId":1707604,"userName":"cmabr002","timestamp":1438127802,"content":"> What happens when a card such as Ithilien Tracker or Ranger Spikes is being used, and an enemy with Ambush is revealed?\n\n \n\nI had this same question and found the answer in the FAQ after searching here for the answer so I figured I'd post it for anyone else looking.\n\n \n\n \n> Q: If there is an unattached Ranger Spikes (HoN17) in the staging area when an enemy with the ambush keyword is revealed from the deck, what happens?\n>  \n> A: The Ranger Spikes will attach to that enemy, preventing the players from making the engagement checks for the ambush keyword."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79049-question-about-ambush%E2%80%A6/?do=findComment&comment=1707944","commentId":1707944,"userName":"alogos","timestamp":1438160043,"content":"> But here's a question:  when an enemy has \"When Revealed\" text, that text is resolved before the enemy goes into the staging area (pg 13 in current FAQ).  Keywords like Ambush and Surge are resolved when a card is revealed-- I assume that's got to happen after the enemy is added to the staging area.  It would be very awkward to hold an enemy card with \"Surge\" in limbo, reveal the next card, and then add the original enemy to the staging area.  But it looks like this is exactly what happens with a card like Orc Horn Blower [http://www.lotrlcg.com/Card/Focus/1306], whose \"when revealed\" text forces players to reveal the next card.  What state is the Horn Blower in, exactly, while that card is being revealed?  He's not in the staging area, but he's in play?  In play but nowhere in particular?  \n\n \n\nCaleb didn't said limbo, but I remember he said that ennemies making attack as a When revealed effect where not yet in the staging area."}]}