{"url":"https://community.fantasyflightgames.com/topic/79046-riddles/","title":"Riddles","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79046-riddles/?do=findComment&comment=760947","commentId":760947,"userName":"Nizi","timestamp":1360425198,"content":"Might be obvious for most people, but when you choose to answer a riddle of a card, is it discarded? The manual doesn't mention this anywhere, but says you have 2 choices: resolve normally, or answer the riddle. It doesn't mention the riddle as an 'extra', something optional, which would be much more clear. So far, I've resolved them as riddles, but something tells me it's supposed to be optional.\n\n \n\nWhich one is it? Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79046-riddles/?do=findComment&comment=760996","commentId":760996,"userName":"GrandSpleen","timestamp":1360436693,"content":"If you choose to answer the riddle, ignore the rest of the card… enemy, treachery, or location, doesn't matter.  Just discard it after you answer the riddle.\n\nedit: The reason being as the manual states: once you choose to answer the riddle, you don't have to resolve the card normally.  The only real assumption, I guess ,is whether the riddle gets discarded once resolved, or whether it stays in play as a kind of 'dead' card.  Since we aren't explicitly told anything, you should just follow the normal rules for encounter card resolution and put it in the discard pile when it's done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79046-riddles/?do=findComment&comment=761462","commentId":761462,"userName":"Nizi","timestamp":1360573603,"content":"Thanks. It actually makes sense, with the Wargs normally only appearing after they left the caverns.\n\nWould there actually be an instance where people would choose NOT to answer the riddle? It IS kinda the quest, so you're supposed to try as much as you can. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79046-riddles/?do=findComment&comment=761501","commentId":761501,"userName":"Migwald","timestamp":1360580460,"content":"You might choose to NOT answer a riddle if you have already got one wrong that turn. This would leave Bilbo defenceless against Gollum if you got a second one wrong and game over!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79046-riddles/?do=findComment&comment=761522","commentId":761522,"userName":"GrandSpleen","timestamp":1360582694,"content":"You might also skip particularly hard riddles.  Or maybe you've got enough progress tokens down on Bilbo's side of things, and just need to finish with the dwarves.  In that case, you might try to minimize the risk of Bilbo getting damaged."}]}