{"url":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/","title":"Final &quot;On the doorstep&quot; preview!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761549","commentId":761549,"userName":"Pharmboys2013","timestamp":1360585866,"content":"Absolutely shocked that Balin is of the leadership sphere (thought he was a lock for spirit); but what a good card although. Lower starting threat, decent stats, and a pretty great ability IMO.  Almost a pity the 3 leadership dwarves are all soo good because when deckbuilding one of them is gonna have to take the axe to have access to another sphere.\n\nAlso while not directly spoiled, looking at the deck lists we can see that there are ally versions of Bifur, Dwalin, and Gloin. While this was pretty much expected, it gives us a better chance at assuming which sphere they belong too.  If I had to guess id say they remain the same color as their hero versions were…still no sight of Oin although….(maybe he's the last spirit hero?!)\n\nAs for the player cards, I like the combo between the two of them but not sure I'd make the space for it in most decks. Dwarfs have better draw power through lore with Ori and legacy of durin, but I can see King under the Mountain having space in a Leadership spirit deck where you can use will of the west to replace the cards lost from the effect.  To me! My kinsmen! Cards seems a little too situational but may be clutch for a necessary placement of Miner of the iron hills, erebor hammersmith, kili or fili, and even a well timed longbeard Orc slayer (ok so maybe this card seems better the more I think about it)\n\nWhat do u guys think? Shocked as I was Balin is leadership? Who's the spirit hero? Do the player cards stink or are they sweet?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761559","commentId":761559,"userName":"Raven1015","timestamp":1360587191,"content":"I figured Balin to be the Spirit hero as well. I suppose Balin makes sense for Leadership from the standpoint that he led the expedition to Moria, but he felt Spirit to me. Anyway, I quite like his ability, and he is useful beyond just Dwarf decks, which is nice. I'm actually a big fan of King Under the Mountain, mainly because it requires no other condition other than being put into play, and then from there it can work its magic all alone. As a consistent deck-thinner, it is one of the best options in the game so far. As for the Spirit hero, the only one I can think of is Oin. I discounted him previously, just because we don't know much about him, but Nori and Ori made it as heroes, so that isn't necessarily an obstacle. More importantly, I can't really think of any other character in The Hobbit who would fit in the Spirit sphere and that we haven't seen already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761569","commentId":761569,"userName":"Tracker1","timestamp":1360588414,"content":"I guess we can rule out Gwaihir or Thranduil as the spirit hero.  It must be Oin, I can't imagin they would leave him out.  I was hoping for one of the other two, I hope it's the case..  Bard the bowman is pretty good, but I think another tactics dwarf hero would have thematically been good,  since it's odd having Gimli represented as one of the heroes in the company.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761588","commentId":761588,"userName":"DevastazioneH88","timestamp":1360591346,"content":"I'm still hoping Gwaihir will get the Spirit spot (I really want him XD) but I know the spirit Hero will be Oin at this point…I seriously think it's a bad idea to have so many dwarves again though…I expected some non-unique silvan or eagle…or dale… I mean…in Tolkien lore dwarves are great but we have way too many…If they knew they'd release the Hobbit as their first Saga Expansion I think they should have come out with a different first deluxe expansion…Maybe something about silvans, or rohan, or dunedain…whatever…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761612","commentId":761612,"userName":"richsabre","timestamp":1360597802,"content":"great card and im really pleased with the art, makes a nice change from the ultra realistic magali style heros\n\ni can see him getting alot of play\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761631","commentId":761631,"userName":"GrandSpleen","timestamp":1360602992,"content":"Hah! I looked at Balin and thought he was Spirit (especially given his effect), then I read the posts on here and had to go back and look at him again.  Sure enough, Leadership he is.  Surprising!\n\n \n\nBut holy crap, King Under the Mountain?  Really?  This is almost the same thing as a permanent copy of Daeron's Runes in your hand at all times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761739","commentId":761739,"userName":"jc1138","timestamp":1360663609,"content":"When I first saw Balin I thought FFG's must be trying to encourage dwarf-deck players to branch out from Dain, as a deck with Dain and Balin is pretty heavy into leadership, which isn't a sphere most people go too with too strong a commitment and hasn't really been a front-runner for quite some time.  And then of course we have Thorin, another solid hero also from the leadership sphere.  However, as mentioned above, Balin is just fine in non-dwarf decks (otoh, those Dain boosts are just so good, and hard to ignore) and at 9 starting threat he can see a lot of use.  I also like a wider variety of artwork.  His ability looks great, but I wonder how good it will actually be when the rubber meets the road in scenario's."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761818","commentId":761818,"userName":"leptokurt","timestamp":1360679452,"content":"OMG Balin can cancel one of the seven shadow card effects that are dealt on average in the new \"Against the Shadow Card\" cycle? I call power creep!  Sounds like a must have! Especially as we don't already have a card that can cancel all shadow card effects. And yep, we will have plenty of resources to pay for that super power of yours once you replaced Thorin in our fellowship!\n\n \n\n \n\n \n\nWait Bifur, what are you saying? You can do everything Balin can? Even better? And you don't look like you just got a lumbago while trying to raise your axe? Holy ****! But hey, you only have 3 HP, sucker!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761880","commentId":761880,"userName":"gatharion","timestamp":1360689559,"content":"leptokurt said:\n\nOMG Balin can cancel one of the seven shadow card effects that are dealt on average in the new \"Against the Shadow Card\" cycle? I call power creep!  Sounds like a must have! Especially as we don't already have a card that can cancel all shadow card effects. And yep, we will have plenty of resources to pay for that super power of yours once you replaced Thorin in our fellowship!\n\n\n\nActually, I'm thinking to replace Gloin when I want a third Leadership Dwarf.\n\n \n\nleptokurt said:\n\nWait Bifur, what are you saying? You can do everything Balin can? Even better? And you don't look like you just got a lumbago while trying to raise your axe? Holy ****! But hey, you only have 3 HP, sucker!\n\n\n\nI'm confused. Are you talking about Bifur canceling a Shadow Card with Burning Brand? He can only do that for attacks that he is blocking. (And if you pulled a copy of Burning Brand.) Balin can pay a resource to draw new Shadow Cards  for attacks that are being made against anybody. And he doesn't have to be waiting and unexhausted either.\n\nIt's not a game-breakingly good power, but it sure looks like it can be handy. Especially for certain quests where those few Shadow Cards that can just devastate you come up. *cough*sleepingsentry*cough*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761907","commentId":761907,"userName":"GrandSpleen","timestamp":1360693220,"content":"I'm confused about leptokurt's reply as well… that is sarcasm, right?  It seems like you are replying to players who are saying Balin is overpowered. But… no one's saying so.  And then you seem to imply that he's a weak card because other cards can cancel shadow effects.  But just the other day you were singing Eleanor's praises in the Heirs of Numenor quests, and Balin is more or less a refocused Eleanor…. consistency, man, consistency!\n\nI'm happy with Balin because I've thought to myself more than once \"gee, it'd be nice to have a hero who can cancel shadow effects.\"  And now, voila!  You can now construct a deck that can reliably tackle those stupid chaining shadow effects in the Siege of Cair Andros.  Or take Eleanor and Balin on a walk through the park in \"A Road to Rivendell.\"  Sure there are other cards that can cancel shadow, but now we are less reliant upon a strong opening hand in certain quests, and I always like things that reward planning more than rewarding luck-of-the-draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=761946","commentId":761946,"userName":"Gizlivadi","timestamp":1360698731,"content":"Obviously an answer to those sleeping sentry/blocking wargs, etc complaints. Thanks ffg! A good, relatively low threat leadership hero with good art. Still surprised we didn't get Thranduil as the leadership hero, but I'm happy with this. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=762022","commentId":762022,"userName":"Pharmboys2013","timestamp":1360712300,"content":"Gizlivadi said:\n\nObviously an answer to those sleeping sentry/blocking wargs, etc complaints. Thanks ffg! A good, relatively low threat leadership hero with good art. Still surprised we didn't get Thranduil as the leadership hero, but I'm happy with this. \n\n\n\nIn the last hobbit preview where Bofur and Bard were spoiled, Caleb mentioned that all the player cards were made at the same time and then seperated into which boxes they should be in afterwards so Balin isnt necessarily a response to our complaints, but he none the less will make a huge difference especially in the shadow heavy HoN quests.\n\nI'm as surprised as anyone we arent going to see Thranduil or Gwahir (assuming either of them arent the spirit hero which wouldnt make sense plus Oin seems like a lot for that given the decklists)  but i guess FFG's logic is that after this second hobbit box we really wont be seeing any dwarves for a very long time.  They've practically had their own cycle dedicated to them plus the two hobbit boxes, there is so much more of middle earth to explore; another trip into a mountain seems doubtful\n\nPlus there are not too many dwarves left for them to make…I'm sure we'll see a Gimili remake at some point, Id also like to see Thror and Thrain hero cards, but after that I cant think of too many others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=762108","commentId":762108,"userName":"Tracker1","timestamp":1360729289,"content":"Pharmboys2013 said:\n\nGizlivadi said\n\nI'm as surprised as anyone we arent going to see Thranduil or Gwahir (assuming either of them arent the spirit hero which wouldnt make sense plus Oin seems like a lot for that given the decklists).\n\n\n\nI'm thinking Gwahir may be a neutral ally.  I think that would make sense thematically.  If so, I hope he has an ability that allows a players heroes to pay for eagles in a non- tactics deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=762279","commentId":762279,"userName":"Gizlivadi","timestamp":1360750386,"content":"Tracker1 said:\n\nPharmboys2013 said:\n\n \n\nGizlivadi said\n\nI'm as surprised as anyone we arent going to see Thranduil or Gwahir (assuming either of them arent the spirit hero which wouldnt make sense plus Oin seems like a lot for that given the decklists).\n\n \n\n \n\nI'm thinking Gwahir may be a neutral ally.  I think that would make sense thematically.  If so, I hope he has an ability that allows a players heroes to pay for eagles in a non- tactics deck.\n\n\n\n \n\nYeah, i'm hoping for that too, a hero Gwaihir just doesn't seem to make sense to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=762327","commentId":762327,"userName":"leptokurt","timestamp":1360757054,"content":"gatharion said:\n\nleptokurt said:\n\n \n\nOMG Balin can cancel one of the seven shadow card effects that are dealt on average in the new \"Against the Shadow Card\" cycle? I call power creep!  Sounds like a must have! Especially as we don't already have a card that can cancel all shadow card effects. And yep, we will have plenty of resources to pay for that super power of yours once you replaced Thorin in our fellowship!\n\n \n\n \n\nActually, I'm thinking to replace Gloin when I want a third Leadership Dwarf.\n\n \n\nleptokurt said:\n\n \n\nWait Bifur, what are you saying? You can do everything Balin can? Even better? And you don't look like you just got a lumbago while trying to raise your axe? Holy ****! But hey, you only have 3 HP, sucker!\n\n \n\n \n\nI'm confused. Are you talking about Bifur canceling a Shadow Card with Burning Brand? He can only do that for attacks that he is blocking. (And if you pulled a copy of Burning Brand.) Balin can pay a resource to draw new Shadow Cards  for attacks that are being made against anybody. And he doesn't have to be waiting and unexhausted either.\n\nIt's not a game-breakingly good power, but it sure looks like it can be handy. Especially for certain quests where those few Shadow Cards that can just devastate you come up. *cough*sleepingsentry*cough*\n\n\n\n \n\nYes, Bifur needs BB, but nowadays it's not to diffcult to get an attachment into play. I'd like Balin much more of I hadn't to draw a new shadow card after discarding the other. We now have enemies that get extra ATT for each shadow card dealt. And if the new scenarios ares omewhat similar to SoCA, Balin's ability will only help you little.\n\nAnd don't get me wrong, I don't think Balin is a bad hero. What I don't understand is the exitement about his ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=762459","commentId":762459,"userName":"legolas18","timestamp":1360782149,"content":"If Oin is the spirit hero, which he seems obligated to be unless they somehow fit an ally version of him in, what ability do you think he'll have? And what stats? There isn't much information on Oin, so I wonder what they made him like…  I really wanted at least one Tactics hero that was in the company, to make it a more thematic experience, but I guess those spots had to be taken by Bard and Beorn.  It would be really nice to have a Spirit hero that can defend, because I don't like using Frodo, because then I feel like I have to pair him with Loragorn, even if I didn't want a Spirit/Lore deck.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=762502","commentId":762502,"userName":"Pharmboys2013","timestamp":1360790881,"content":"legolas18 said:\n\nIf Oin is the spirit hero, which he seems obligated to be unless they somehow fit an ally version of him in, what ability do you think he'll have? And what stats? There isn't much information on Oin, so I wonder what they made him like…  I really wanted at least one Tactics hero that was in the company, to make it a more thematic experience, but I guess those spots had to be taken by Bard and Beorn.  It would be really nice to have a Spirit hero that can defend, because I don't like using Frodo, because then I feel like I have to pair him with Loragorn, even if I didn't want a Spirit/Lore deck.  \n\n\n\nA defender spirit hero would be a nice addition…I also hope that Oin's power doesnt center around other dwarves.  He have enough of that already.\n\nIt wouldnt have to necessarily be Oin, but it would fit in Spirit's theme to have a hero that has like a 3 defense then a power of:\n\nresponse: after \"character's name\" defends an attack, lower your threat by the difference between \"character's name\" defense and the attacking enemy's attack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79118-final-on-the-doorstep-preview/?do=findComment&comment=763202","commentId":763202,"userName":"John85","timestamp":1360941954,"content":"I have no problem getting neither a Thranduil nor Gwaihir \"Hero\". Gwaihir works as an Ally or objective Ally (the latter makes most sense to me). I was never convinced (I don't think) that Thranduil would be a player card. If it is, I'm not surprised to see it as an Ally (objective Ally seems less likely) since The Hobbit is such a Hobbit- and Dwarf-focused book."}]}