{"url":"https://community.fantasyflightgames.com/topic/79179-quick-question/","title":"Quick Question.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79179-quick-question/?do=findComment&comment=762120","commentId":762120,"userName":"Reckless Outlaw","timestamp":1360730655,"content":"Hi,\n\nI've bought everything to date and now finally have time to play the game. Still learning the rules, but while I was playing passage through mirkwood. I ran across Eowyn questing and have unexpected courage on her then out of no where I draw The necromancer's reach from the encouter deck. If I quickly use expected courage to ready her before the effect does her willpower still contribute?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79179-quick-question/?do=findComment&comment=762131","commentId":762131,"userName":"muemakan","timestamp":1360731917,"content":"Wheter a character is exhausted or not when you resolve the quest doesn´t matter as long as he wasn´t removed from the quest by a card effect.\n\nYou could commit all your characters to the quest and then play Grim Resolve to ready all characters and they would still all be commited to the quest.\n\n \n\n \n\nBut on your subject: No you cannot ready her in that way. You cannot take actions in the staging step of the phase, only reactions. But you can ready her after you commited her to the quest. \n\nSo for the quest phase this would mean:\n\nYou can play actions --then commit characters -- then play actions --then the encounter cards are revealed and only reactions are allowed -- then you could take actions -- then the quest is resolved.\n\nSame goes for all phases. You can use actions between individual steps of a phase but not in the middle of a step.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79179-quick-question/?do=findComment&comment=762168","commentId":762168,"userName":"GrandSpleen","timestamp":1360737778,"content":"And when he says actions and reactions, he's referring to Actions and Responses (Unexpected Courage is an Action, which is printed on the card.  A Test of Will, for example, is a Response)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79179-quick-question/?do=findComment&comment=762953","commentId":762953,"userName":"Reckless Outlaw","timestamp":1360898191,"content":"Thanks for all your help guys."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79179-quick-question/?do=findComment&comment=766303","commentId":766303,"userName":"Reckless Outlaw","timestamp":1361593573,"content":"Another question. If I use sneak Attack with Gandalf, Will I have to discard Gandalf at the end of the phase or put him back in my hand?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79179-quick-question/?do=findComment&comment=766320","commentId":766320,"userName":"GrandSpleen","timestamp":1361602017,"content":"Gandalf can go back into your hand as long as he isn't killed during that phase.\n\nSneak Attack triggers at the end of the phase, while Gandalf's text triggers at the end of the round.  If you use Sneak Attack in the questing phase, Gandalf will go back into your hand after questing is done, and before the encounter phase.  His text will never have a chance to trigger.  Gandalf's text triggers at the end of the Refresh phase, just before you go back to the beginning of the phase sequence for the next round.\n\nThat said, if you do come into a situation where two effects would trigger simultaneously and counteract one another (i.e., Beorn and Sneak Attack), you get to decide which one applies first.  \n\nThe official FAQ (here [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LOTR_FAQ_1.3.pdf]) clarifies this under 'simultaneous effect timing.'\n\n "}]}