{"url":"https://community.fantasyflightgames.com/topic/79375-parting-gifts-infighting-and-the-patrol-leader/","title":"Parting Gifts, Infighting and the Patrol Leader","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79375-parting-gifts-infighting-and-the-patrol-leader/?do=findComment&comment=763701","commentId":763701,"userName":"GrandSpleen","timestamp":1361053482,"content":"Hey all,\n\nPlayed a game of Into the Pit tonight, and a couple of questions came up.  \n\nParting Gifts -- can you use it to move resources away from another player's Leadership hero?  Parting Gifts says:\n\nAction: Move any number of resource tokens from a [Leadership] hero's resource pool to any other hero's resource pool.\n\nIt seems like a legal play… but seems a little iffy, because you could totally use this to rob your neighbor!\n\n-and-\n\nInfighting and the Patrol Leader from Into the Pit.  Would Infighting trigger the Patrol Leader's \"Forced\" ability?  I think this is a question of the meaning of \"deal damage\" (I'm thinking maybe that means you have to be taking damage from the token bank) vs. \"move damage\" as per Infighting.\n\nInfighting says:\n\nAction: Move any number of damage from one enemy to another.\n\nAnd Patrol Leader:\n\nForced: Before patrol Leader is dealt damage, discard the top card of the encounter deck. If the discarded card is an enemy, cancel the damage.\n\n \n\nThanks as always for your thoughts!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79375-parting-gifts-infighting-and-the-patrol-leader/?do=findComment&comment=764086","commentId":764086,"userName":"Nerdmeister","timestamp":1361154769,"content":"If you read it as is then I don´t see why parting gifts couldn´t be used to move resources from another players hero. Though I would think, even if not explicitly stated on the card, that you should get his permission first.\n\nI would play infighting as if the damage is moved rather than dealt and thus can´t be negated by patrol leader´s ability."}]}