{"url":"https://community.fantasyflightgames.com/topic/79388-goblin-sniper-can-we-simply-engage-it-last/","title":"Goblin Sniper - Can we simply engage it last?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79388-goblin-sniper-can-we-simply-engage-it-last/?do=findComment&comment=763812","commentId":763812,"userName":"tripecac","timestamp":1361094898,"content":"Let's say at the beginning of the engagement phase there are 2 enemies in the staging area: a Goblin Sniper and some Dul Guldur Orcs.\n\nIf we optionally engage the orcs, then we are \"moving the enemy from the staging area\" (rules p16).  Since the orcs are no longer in the staging area once they are engaged, at that point, the sniper is alone.  So, can he be optionally engaged as well?\n\nI've always assumed that if the Goblin Sniper starts the engagement phase with another enemy in the staging area, he can't be optionally engaged.  But maybe that's wrong; maybe it just means if he ends the engagement phase with another enemy in the staging area he can't be optionally engaged.\n\nThere is one catch, however: each player can only optionally engage 1 enemy.  So, if I am playing solo (1-handed), I can't optionally engage both the orcs and the sniper in the same turn.  And then engagement checks take place after the optional engagement.  So, even if the orcs have a low enough threat requirement to pass their engagement check, they won't do so until after the optional engagement actions are done.\n\nSo, the \"trick\" of optionally engaging the orcs first, and then the sniper only works if we are playing with more than 1 player.\n\n \n\nIs this correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79388-goblin-sniper-can-we-simply-engage-it-last/?do=findComment&comment=763835","commentId":763835,"userName":"GrandSpleen","timestamp":1361099660,"content":"I've always taken it to mean that you can optionally engage the sniper if there are no enemies in the staging area at the time of engagement, regardless of what the status was at the beginning of the encounter phase.  So in a 2-player game, if there are 2 enemies in the staging area and only one of them is the sniper, you'er all set.  First Player engages enemy 1, and the second player is clear to engage the sniper.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79388-goblin-sniper-can-we-simply-engage-it-last/?do=findComment&comment=765060","commentId":765060,"userName":"Rapier1","timestamp":1361340458,"content":"GrandSpleen said:\n\nI've always taken it to mean that you can optionally engage the sniper if there are no enemies in the staging area at the time of engagement, regardless of what the status was at the beginning of the encounter phase.  So in a 2-player game, if there are 2 enemies in the staging area and only one of them is the sniper, you'er all set.  First Player engages enemy 1, and the second player is clear to engage the sniper.  \n\n\n\n \n\nThis has always been my reading of it as well."}]}