{"url":"https://community.fantasyflightgames.com/topic/79576-into-ithilien-only-4-difficulty/","title":"Into Ithilien only 4 difficulty?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79576-into-ithilien-only-4-difficulty/?do=findComment&comment=765133","commentId":765133,"userName":"Rashley","timestamp":1361351395,"content":"I have followed through all the Quests since this game first came out and I finished each in no more than 3-4 attempts.  That was until the middle Quest of the Heirs set.  Only difficulty 4?  Should be easy once you know what could turn up.  NO! NO! NO!  10 ttempts and I have only once got to 2B.  Yes, I lost Celador!  I learn't to finish the 1st active location on the first turn, but still get swamped by nasty enemies, locations, treacheries and shadow cards.  I just can't seem to protect against them all.  I should add that I refused to buy extra Core Sets just for the odd extra good card, but surely I shouldn't be penalised for that.\n\nAny help would be appreciated.  I normally play 2 groups to cover all 4 spheres.  I add 'When Revealed' and 'Shadow' stoppers.  4 x Gandalfs + Sneak  Attacks.  Threat reductions.  Card Draws.  Resource Boosters etc.  My decks are 50 card ones, so not too big, but the nasties just keep coming.  Unlike other Encounter Decks, which have a few non or very low effect cards, this Quests cards are all deadly!  No respite!  Heroes dropping like flies!  Help!!!  What am I overlooking?  It's only difficulty 4!!!!!!!   Cheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79576-into-ithilien-only-4-difficulty/?do=findComment&comment=765140","commentId":765140,"userName":"Ellareth","timestamp":1361351927,"content":"HoN seems to have buffed up difficulty compared to previous quests.\nThere are few Into Ithilien threads that you should definitely check out where more strategies are discussed in detail.\n\nI now have a good success rate using Beorn/Eleanor/Elrond deck, consisting of cheap tactics allies, usual spirit cancel and threat reduction, lore healing and new ranger spikes, and the standard set of cards that comes with Elrond (Vilya, Stargazer, 1 copy of 4~6 cost allies from every sphere that I find useful).\n\nAlthough I must add my strategy is bit weird compared to standard ones since I do not quest until I clear all the enemies in play, unless I am about to be location locked.\n\nOh and by the way, dropping will power allies from your deck and purposely letting the Ranger die really helps as well.\n\n "}]}