{"url":"https://community.fantasyflightgames.com/topic/79707-battle-of-the-five-armies-questions/","title":"battle of the five armies questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79707-battle-of-the-five-armies-questions/?do=findComment&comment=766246","commentId":766246,"userName":"nismojoe","timestamp":1361569739,"content":"1) If the active location is raven hill, the front gate, or ruins of dale, do any progress tokens get placed on 2b, 3b, or 4b when legolas kills an enemy or is his ability wasted?\n\n \n\n2) Bolg states: cannot leave the staging area.  what happens when he has 8 damage on him before 5b is the active quest? if he stays in the staging area with 8 damage,  do the players immediately win when 5b becomes the active quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79707-battle-of-the-five-armies-questions/?do=findComment&comment=766574","commentId":766574,"userName":"Cmdrindie","timestamp":1361687065,"content":"nismojoe said:\n\n1) If the active location is raven hill, the front gate, or ruins of dale, do any progress tokens get placed on 2b, 3b, or 4b when legolas kills an enemy or is his ability wasted?\n\n \n\n2) Bolg states: cannot leave the staging area.  what happens when he has 8 damage on him before 5b is the active quest? if he stays in the staging area with 8 damage,  do the players immediately win when 5b becomes the active quest?\n\n\n\n \n\n1) I'll give this a try; I'm by no means an authority, but my playgroup and I went through the scenarios and concocted some solutions that might help you. Raven Hill, Front Gate, and Ruins of Dale are all locations, and they only special interaction they have with 2b, 3b, or 4b is in their travel cost and forced effects. In all other cases, the \"immune to player card effects\" reigns supreme, then, and that holds true even if you've traveled there. That would block Legolas's interaction with any of those three, I think. \n\n2) Bolg's text states: \n\nX is the number of players in the game.\n\nImmune to player card effects.\n\nCannot leave the staging area.\n\nI think this question comes up for a similar reason to the 1st question. Since Bolg is immune to player card effects, he is immune to everything you could do to him, except damage from normal attacks. In other words, I think it'd be impossible to deal damage to him before 5b for the following reasons \n\na - He is immune to player card effects, so he can't have attachments or be the target of anything that your cards enable you to do. So, no yew bow, no hands on the bow, ranger spikes, or anything that could damage him. \n\nb - Cards like Expecting Mischief and whatnot can't hurt him, since he isn't revealed from the encounter deck, and would be immune, anyways.\n\nc - Since he can't leave the staging area, you can't optionally engage him, and he will only \"engage\" you when the quest cards say so.\n\nHope this helps!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79707-battle-of-the-five-armies-questions/?do=findComment&comment=766615","commentId":766615,"userName":"nismojoe","timestamp":1361699301,"content":"so if progress tokens cannot be placed on an active location that has ITPCE, im assuming they are cancelled and cannot be placed on the active quest\n\n \n\nLegolas + rivedell bow + hands upon the bow + 2x unseen strike = 11atk\n\nor any combo of black arrow + above stuff.  definitely possible to deal 8dmg to him before 5b\n\nthat's basically 1 less turn + 3-4 bodyguards the players wouldnt have to deal with\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79707-battle-of-the-five-armies-questions/?do=findComment&comment=768562","commentId":768562,"userName":"nismojoe","timestamp":1362077732,"content":"Who does the official ruling around here? answer meh!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79707-battle-of-the-five-armies-questions/?do=findComment&comment=782768","commentId":782768,"userName":"gatharion","timestamp":1365423591,"content":"I'm curious about how things work with Bolg as well.\n\n \n\nI took \"immune to player card effects\" to mean that cards that did direct things to him (like lowering his stats or direct damage via Gandalf or Descendant of Throndor) could not be used. Likewise, one couldn't get any effect from something like a Forest Snare on him. However, I'm not so sure about cards like Hands Upon the Bow, Great Yew Bow, or Dunhere that let you attack enemies in the staging area.\n\nBolg has to be damageable by attacks, or else you could never win, and those cards just let a hero make an attack. I'd say Bard's -2 Defense power couldn't be used against him, but using the Yew Bow to declare him as the target of an attack isn't the same thing as effecting him with the card. The Yew Bow is effecting Bard, Bolg is only is only being affected by the attack. \n\nSo long as there are no Bodyguards in play, I think smacking Bolg before stage 5 is a legitimate way to go. I'd love to hear what others say on the topic though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/79707-battle-of-the-five-armies-questions/?do=findComment&comment=782814","commentId":782814,"userName":"CJMatos","timestamp":1365432265,"content":"nismojoe said:\n\nWho does the official ruling around here? answer meh!\n\n\n\n \n\nWhy don't you send a Rules Question to them????"}]}