{"url":"https://community.fantasyflightgames.com/topic/79753-question-about-the-battle-of-five-armies-quest/","title":"Question about The Battle of Five Armies Quest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/79753-question-about-the-battle-of-five-armies-quest/?do=findComment&comment=766579","commentId":766579,"userName":"Cmdrindie","timestamp":1361688122,"content":"Hallo LOTR LCG community! I hope that this message finds you well, in whatever capacity you are so. I have a question that maybe you mavens can figure out for me, should you be willing or able. Thanks ahead of time!\n\n1) When enough progress tokens have been placed on any of 2b, 3b, or 4b, what happens to that quest card? Is the quest card \"finished\" but the players are prevented from continuing to 5b? Or is it more like, say, Hills of Emyn Muil or We Must Away, Ere Break of Day, insofar as they have progress token requirements, but they rely on all conditions being met before the progress tokens matter?\n\nIf that didn't make sense, here was my playgroup's difficulty. We managed to finish 4b's progress requirements. We drew Gundabad Climber, and removed a progress token according to the When Revealed effect.\n\nSome in the group, twitching with Into Ithilien-PTSD, said, \"Wait, no, you can't remove tokens from 4b. Look at it this way: if you did, then, hypothetically, we could play a game that would be impossible to finish, since the encounter deck recycles itself. Also, the treachery Heedless of Order (Choose a different quest to be the current quest until the end of the round, if able), suggests that it is possible to be on the quests before 5b, yet be unable to switch to a different card, which can only happen if, when finished, 2b, 3b, or 4b can 'be completed' and removed from play. That would be an infinite game, like the Blocking Wargs.\" \n\nStated simply: Can encounter cards like Gundabad Climber undo a completed quest card before 5b?\n\nThank you again for your attention in this matter. Have a good day. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/79753-question-about-the-battle-of-five-armies-quest/?do=findComment&comment=767155","commentId":767155,"userName":"nismojoe","timestamp":1361825045,"content":"I believe you cannot progress to 5a until 2b, 3b, and 4b all have 8 or more tokens on that all at the same time"},{"commentUrl":"https://community.fantasyflightgames.com/topic/79753-question-about-the-battle-of-five-armies-quest/?do=findComment&comment=767709","commentId":767709,"userName":"Cmdrindie","timestamp":1361915544,"content":"Thanks for the reply!"}]}