{"url":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/","title":"Mirkwood Adventure Pack Cycle Reprint","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/?do=findComment&comment=768946","commentId":768946,"userName":"Gunny_J","timestamp":1362147985,"content":"Hey all,\n\nDoes anyone know if they plan on reprinting any or all of the Mirkwood cycle packs?  My son and I have quite a collection of packs now, but we wanted to do the whole series from start to finish.  I can't seem to find Conflict at the Carrock anywhere and even the other adventure packs are becoming rarer to find at the moment.  If you know of any US or Canada online retailers selling these packs, please let me know.  I already own Return to Mirkwood and can find Hills of Emyn Muil and Rhosgobel pack just fine.  Thank you.\n\nBrian"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/?do=findComment&comment=769085","commentId":769085,"userName":"Cutievalkyrie","timestamp":1362170539,"content":"I didnt collect all packs either. Like you i was thinking to get all packs but hey, new pack comes every month and if you do want to collect every single pack thats gona be a lot of mailing cost. Besides, not every pack is fantastic. If you have the hobbit  Over Hill and Under Hill, it contains the same quest as ord of the Rings LCG: Conflict at the Carrock AP [http://www.fairplaygames.com/gamedisplay.asp?gameid=7524] and it is more fun to play. LCG means you dont have to collect everything. Google the spoilers online and choose the pack you really want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/?do=findComment&comment=769120","commentId":769120,"userName":"Gunny_J","timestamp":1362182158,"content":"I actually found a vendor today that sells the entire Mirkwood Adventure pack cycle.  Each pack was less than $9 (US). Shipping, however, was atrocious.  Yet, the overall price per pack was less than retail, so it was still worth it to me.  I know what you're saying about not needing all the packs, Cutie.  However, I have completionist tendencies when it comes to gaming, AND I happen to find this game taking over as my favorite game to play.  It's kinda funny, because the first couple times my son and I played it, we thought it sucked and was ridiculously difficult.  We packed it up and didn't play it again for a whole year. The main reason we stunk it up is because we weren't playing with 3 heroes each.  I think we were both playing with 2.  I have no idea why FFG even put that \"option\" in the rules.  It is insane to run any less than 3 heroes. LOL\n\nLink to vendor if anyone is interested.  www.pokernationusa.com [http://www.pokernationusa.com] The website seems to sell all kinds of stuff, so I was kinda hesitant to buy from them.  I did a bunch of google searches for people who did business with them and many were really good reviews, except those who stated that their shipping costs were stupid.  I already knew that part, so I was ok with it.  Good luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/?do=findComment&comment=769225","commentId":769225,"userName":"JudgeShamgar","timestamp":1362220012,"content":"I can see how they still have stock on those.  The two adventure packs I wanted to get were less than the shipping by four dollars.  I guess if you were buying a bunch it might be worth it but for only two I guess I don't need them that bad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/?do=findComment&comment=769578","commentId":769578,"userName":"Dain Ironfoot","timestamp":1362319378,"content":"yes, checking FFG's upcoming link (top of the webpage) - you'll see what they are reprinting for LOTR."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/?do=findComment&comment=769946","commentId":769946,"userName":"Gunny_J","timestamp":1362412223,"content":"Thanks for that tip! I didn't know that.  It looks like they are not currently reprinted the entire Mirkwood series.  Oh well.  I wanted to also recommend not using the link I provided earlier.  They are out of stock of 2 of the 6 packs as well, but just don't properly show that on their website."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80072-mirkwood-adventure-pack-cycle-reprint/?do=findComment&comment=770004","commentId":770004,"userName":"Colino","timestamp":1362423418,"content":"I'm absolutely desperate to find Hunt for Gollum anywhere that will ship in the UK. I've managed to locate where to get the others but HfG is completely elusive. I'm really HUNTING Gollum!"}]}