{"url":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/","title":"&quot;The Blood of Gondor&quot; Preview","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770066","commentId":770066,"userName":"Pharmboys2013","timestamp":1362433611,"content":"Newest preview for the 5th AtS AP is up.  While the \"plot\" of the quest was well described we dont actually get to see much player card wise.  \n\nThere's a unique leadership attachment which appears as tho it may decrease the cost of certain player cards depending on how many leadership heroes one controls.  Even running running just a 2 leadership hero deck would make this card amazing assuming it's doing what i think its doing considering i can only see half the text)…also seems like you can discard it from play to maybe (once again more speculation) grab an event from your discard pile.  If it does half of what i think it'll do this will be a staple in almost all leadership hero containing decks.\n\nTheres a 3 cost spirit ally whom i'm sure we can assume has the gondor trait but her ability is all but unreadable.  Given her 1 and1 for WP and DEF and assuming her defense isnt astounding, her effect must be pretty useful to justify a 3 cost but we'll have to wait and see\n\nThe last and fully revealed player card is \"the hammer-stroke\".  Some great art but i find the effect itself underwhelming.  Completely useless solo, usable in 2 player, and ok/good in 3-4 player.  Thats just not enough versatility to make me find room for it in a deck.\n\nonce again no hero reveal…let the speculation commence!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770126","commentId":770126,"userName":"Cutievalkyrie","timestamp":1362450796,"content":"Does anyone have the dates when these new expansions released?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770133","commentId":770133,"userName":"lleimmoen","timestamp":1362452297,"content":"They seem to be moving the date further and further. At first the Steward's Fears was supposed to be out Q1, now it is Q2 and the fifth pack already Q3. I hope we start getting the packs no later than April, and then one per month as promised.\n\nAs for the book attachment, I first thought the cost would be reduced for each Gondor hero, but you are right, it reads \"icon\", so it must be Leadership. Now that Master of Lore has been shafted - to the point it is practically useless - this may be another way to save money, but in a sphere needing it the least. Still, these are just guesses, mostly.\n\nI really wonder what the Spirit ally shall be. I think generic, and when I first saw the lady she reminded me of Imladris Stargazer a bit (despite the different art style), then I read the bits of the text and the effect even may have something to do with looking into your deck and getting something out of it, though you might also have to discard something.\n\nI find the Hammer Stroke pretty good. Hardly in solo, yes, but from 2 players on, this could be great. Not least in quests where enemies tend to jump around at their will. This can even help with the Attercop, right? As mentioned in the article, Thicket of Spears goes nicely with this. However, all my heavy Tactics decks do better with a Leadership hero (rather than pure Tactics) and I don't feel like using Song of Battle without ways to pull it out. Still, Boromir on drugs can use this very well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770263","commentId":770263,"userName":"Rapier1","timestamp":1362486595,"content":"I like Hammer Stroke personally. It lets you play a tactics deck and make sure you can do your role even if ranged/sentinel cards don't come up.\n\n \n\nAlso it isn't just for co-op. It pulls enemies from the staging area too, that means if you're having trouble questing due to enemies you can't engage (I'm specifically thinking of some of the quests that prevent engagement), or enemies that return to the staging area. You can use this to grab them as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770572","commentId":770572,"userName":"Colino","timestamp":1362544632,"content":"I wonder if Hammer-Stroke with work with Goblin Snipers?\n\nI still hate them with a passion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770609","commentId":770609,"userName":"lleimmoen","timestamp":1362554613,"content":"Of course it works with them. Even Son of Arnor, for instance, does.\n\nThere seems to be an understanding Theoden might show up in this cycle. What do you guys think? And if, what might he be? I am thinking Leadership, threat cost 10, willpower 3, attack 3, defence 1, hit points 3. I do not think they will try incorporate the corruption thing, though they sort of did that with Boromir, and very well in that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770619","commentId":770619,"userName":"Pharmboys2013","timestamp":1362557519,"content":"I personally would be surprised if Theodan turned up this cycle since he would be the ideal Rohan hero if they decide to make a cycle based on them, but maybe since we already have a decent amount of Rohan characters it is their intent to sprinkle them in wherever. We'll see I guess.  As for speculation on the card I think he would have to be leadership, have 3 WP, and have some kind of universal boost to Rohan characters like Dain although likely to a lesser extent almost like leadership Boromir.  Or if he doesn't give a universal boost, give him a power that can still revolve around Rohan characters like: \"exhaust Theodan to place X progress tokens on the current quest. X equals the total number of Rohan characters you control not including Theodan\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770728","commentId":770728,"userName":"lleimmoen","timestamp":1362572165,"content":"Yeah, I like to see trends among spheres. As for Leadership heroes, we have Thorin, Glóin and Théodred who produce resources; Balin, Elrohir and Aragorn all using resources; then Dain and Boromir giving a global boost. In that way it is only Imrahil not really fitting, though he matches Aragorn with stats and ability. If Théoden comes, I think he is bound to give a boost, he is not king for nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770755","commentId":770755,"userName":"Glaurung","timestamp":1362575090,"content":"lleimmoen said:\n\nYeah, I like to see trends among spheres. As for Leadership heroes, we have Thorin, Glóin and Théodred who produce resources; Balin, Elrohir and Aragorn all using resources; then Dain and Boromir giving a global boost. In that way it is only Imrahil not really fitting, though he matches Aragorn with stats and ability. If Théoden comes, I think he is bound to give a boost, he is not king for nothing.\n\nSounds very promising."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=770875","commentId":770875,"userName":"Sprenger","timestamp":1362593111,"content":"As for the hero, I think we will see a Gondor Tactics hero. Currently there 7 Spirit heroes, 8 Lore heroes, 8 Leadership heroes and 9 Tactics. If they wanted to keep an even number of heroes between the spheres. We will most likely see a Spirit hero in the first, a lore hero in the 2nd, Pippin (spirit) in the 3rd, Faramir (Leadership) in the 4th and then a Tactics in this one. Eomer would be nice but I much rather see him as a Spirit hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=771005","commentId":771005,"userName":"lleimmoen","timestamp":1362615955,"content":"Trends may change but the current is that all characters with both ally and hero versions stayed in the same sphere: Beorn, Bombur, Bifur, Dwalin, Gloin; and it is only when we get a new copy of a hero (Aragorn, Glorfindel, Boromir) or an ally (Bofur) that he changes sphere; well, Gandalf did not but he also never had one. Judging by that logic, though I had thought hero Faramir may come as Lore, he will be Leadership. It would be only fit if the brothers boosted Gondor troops in two ways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=771104","commentId":771104,"userName":"Pharmboys2013","timestamp":1362654853,"content":"lleimmoen said:\n\nTrends may change but the current is that all characters with both ally and hero versions stayed in the same sphere: Beorn, Bombur, Bifur, Dwalin, Gloin; and it is only when we get a new copy of a hero (Aragorn, Glorfindel, Boromir) or an ally (Bofur) that he changes sphere; well, Gandalf did not but he also never had one. Judging by that logic, though I had thought hero Faramir may come as Lore, he will be Leadership. It would be only fit if the brothers boosted Gondor troops in two ways.\n\n\n\nugh too true. After the 2nd hobbit box it seems this trend has really cemented itself at least for the time being. Was really hoping for a spirit or even lore version, not sure why I'm against a leadership one. Either way, I also don't hope that he has a power that is specific to either Gondor or Ranger characters (although I feel the latter may be likely). Since he's one of my favorite characters I would like to be able to use him in a variety of manners and not just for a singular deck type"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=771120","commentId":771120,"userName":"Captain Poe","timestamp":1362656372,"content":"I could see him having boromir's ability, but boosting defense"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80251-the-blood-of-gondor-preview/?do=findComment&comment=771185","commentId":771185,"userName":"lleimmoen","timestamp":1362666186,"content":"Pharmboys2013 said:\n\nlleimmoen said:\n\nTrends may change but the current is that all characters with both ally and hero versions stayed in the same sphere: Beorn, Bombur, Bifur, Dwalin, Gloin; and it is only when we get a new copy of a hero (Aragorn, Glorfindel, Boromir) or an ally (Bofur) that he changes sphere; well, Gandalf did not but he also never had one. Judging by that logic, though I had thought hero Faramir may come as Lore, he will be Leadership. It would be only fit if the brothers boosted Gondor troops in two ways.\n\nugh too true. After the 2nd hobbit box it seems this trend has really cemented itself at least for the time being. Was really hoping for a spirit or even lore version, not sure why I'm against a leadership one. Either way, I also don't hope that he has a power that is specific to either Gondor or Ranger characters (although I feel the latter may be likely). Since he's one of my favorite characters I would like to be able to use him in a variety of manners and not just for a singular deck type\n\n\n\nIf he does the latter though, meaning boost Rangers in some way, then the ability could be usable in many a deck, don't you think? I bet and hope Rangers will be numerous, thus one can choose those to his preference. Although those I am using at the moment are not Leadership; Faramir is actually the only Leadership Ranger (safe the secrecy ally maybe - I never played that one so I am not sure)."}]}