{"url":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/","title":"Stand and Fight ruling removed from FAQ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/?do=findComment&comment=772144","commentId":772144,"userName":"EclecticGamer2","timestamp":1362914082,"content":"So I wrote on my blog about the solo deck I've been playing and someone mentioned that you cannot play 'Stand and Fight' on Gandalf because he does not belong to a sphere.  This seemed contradictory to the wording on the card but I read that it had been ruled that way.  I looked in the official FAQ but did not see it.  Someone told me it was there and after some Googling I found that the ruling was in v1.3 of the FAQ but it is no longer in the most current v1.4 on the FFG support page.\n\nDoes this mean that this ruling has been recinded and it can be played on Gandalf or is this just a mistake?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/?do=findComment&comment=772567","commentId":772567,"userName":"leptokurt","timestamp":1363008438,"content":"There never was a ruling that allowed to play neutral allies with Stand and Fight. However, some players (like me) incrrectly played that card to bring Gandalf back, hence the entrance in the 1.2 FAQ. It's kinda weird that FFG removed that question though it doesn't mean that it's now allowed to use that event on neutral allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/?do=findComment&comment=772880","commentId":772880,"userName":"zeb","timestamp":1363080763,"content":"My gut feeling is that it is an error. But it would be worth asking the creators directly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/?do=findComment&comment=772909","commentId":772909,"userName":"GrandSpleen","timestamp":1363086601,"content":"The old FAQ clarified Stand and Fight in the \"errata\" section, but this wasn't really an errata.  My guess is that they removed it from that section, intending to put it into the Q&A section of the FAQ, but forgot to put it back in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/?do=findComment&comment=773010","commentId":773010,"userName":"Thanatopsis","timestamp":1363101783,"content":"I would like to hope that FFG realized that the errata was incorrect all along. The way the card is written, the \"any sphere of influence\" portion of the text is a parenthetical. Typically, Parentheses are used for clarification purposes. Without this text, a reader would consider that the effect only applies to spirit allies since Stand and Fight is a spirit card. “Most” players would not need this clarification because the card is not self-restricting. However, some want/need  it to be sure of how the card works. The argument is that clarification text does not (should not) impose further ruling or restriction of play.\n\nBut… that’s all old-hat at this point…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/?do=findComment&comment=773384","commentId":773384,"userName":"Shiv@n","timestamp":1363179396,"content":"I just have the confirmation from Caleb Grace that it has misteriously disapeared from the FAQ. But the ruling hasn't changed. It will be back in the next release. Probably in the Q&A section."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80539-stand-and-fight-ruling-removed-from-faq/?do=findComment&comment=773385","commentId":773385,"userName":"EclecticGamer2","timestamp":1363179551,"content":"Yeah, I got the same response:\n\n \n\nHi Adam,\nI was a bit surprised myself when someone discovered that the entry for Stand and Fight had disappeared from version 1.4 of the FAQ. I can assure you that was unintended and quite accidental however it happened. Since the damage is already done, I will probably move the entry to the Q&A section of the next FAQ since the previous entry wasn't really an errata but a clarification.\nIt still doesn't work with Gandalf because Gandalf does not belong to a sphere of influence, sorry.\nThanks for asking,\nCaleb\n\n \n\n \n\nI still think that it should be an errata, since I agree with Thanatopsis."}]}