{"url":"https://community.fantasyflightgames.com/topic/80562-guardian-eagle-vs-gondor-watch/","title":"Guardian Eagle vs Gondor Watch","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80562-guardian-eagle-vs-gondor-watch/?do=findComment&comment=772383","commentId":772383,"userName":"Cutievalkyrie","timestamp":1362975370,"content":"They have the same status (4 def 1 hp, 2 cost)\n\nSo why does the eagle have to be discarded after a defense move? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/80562-guardian-eagle-vs-gondor-watch/?do=findComment&comment=772444","commentId":772444,"userName":"lleimmoen","timestamp":1362989878,"content":"Hmm, that is the question for the designers indeed? Defender also has 1 attack but the Eagles is a sentinel. Synergies are better now for the Eagles but it is only a matter of time. I too do feel the Defender is a stronger play in a majority of cases, I think I even was the first one making that point here. Still, I now run both in a deck. The Guardian is great with Support of the Eagles, and that in turn with the Tactics Boromir, especially for siege."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80562-guardian-eagle-vs-gondor-watch/?do=findComment&comment=772559","commentId":772559,"userName":"Raven1015","timestamp":1363007018,"content":"Well, one reason was that the Winged Guardian was created long before the Defender. The other reason is that it fits the theme of the Eagles in that they come in, do their business, and then go out of play (it was basically designed as the counterpart to the attack-minded Vassal of the Windlord). Both of those Eagles help to feed the Eagles of the Misty Mountains ally, which needs Eagles leaving play to be effective. Finally, as the above post mentioned, Support of the Eagles combined with the Winged Guardian is a great play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80562-guardian-eagle-vs-gondor-watch/?do=findComment&comment=772572","commentId":772572,"userName":"leptokurt","timestamp":1363008762,"content":"Yep, it's all about synergies. Everyone who has played Into Ithilien with a Winged Guardian plus a couple of Support of the Eagles or in combination with Eagles of the Misty Mountains plus Horn of Gondor knows that it is superior to the Defender of Rammas (which is my favourite card from HoN nonetheless)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80562-guardian-eagle-vs-gondor-watch/?do=findComment&comment=772638","commentId":772638,"userName":"legolas18","timestamp":1363019029,"content":"I posted a thread about this in the Strategy and Deck Building section a while back because I had the same question as you.  I thought that Defender of Rammas was way better than Winged Guardian, but there are some good points that people have pointed out in this thread:\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=734943&efpag=0#736460 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=734943&efpag=0#736460]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80562-guardian-eagle-vs-gondor-watch/?do=findComment&comment=773669","commentId":773669,"userName":"gatharion","timestamp":1363255124,"content":"Between Sentinel, Support of the Eagles, and Eagles of the Misty Mountains I still use Winged Guardian more often than Defender Of Rammas."}]}