{"url":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/","title":"A request of FFG … *spoilers for On The Doorstep*","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=772684","commentId":772684,"userName":"Stenun","timestamp":1363025786,"content":"When Foundations Of Stone came out during the Dwarrowdelf cycle, we were introduced to an interesting mechanic of splitting the players up and putting them in seperate staging areas to fend for themselves.  It was an innovate and different way of playing and it made for a fun distinction for that particular scenario.  But now, thanks to The Hobbit: On The Doorstep, we have a second scenario which splits up the players.\n\nI would like to ask that we don't see this mechanic again.\n\n \n\nOnce was interesting, twice looks like it might come again, thrice will start being wearisome.\n\nOne of the whole points of this game is the co-operative nature of the mechanics.  By splitting up the players, you kill that completely.  It destroys the one of the biggest reasons most of us play the game; if we can't play cards on each other or attack the same Enemy, or cancel a Shadow card another player has been hit by, or take advantage of any other mechanic or game text that was designed for mutiple players.  We end up with several players sitting round the table all playing a glorified version of solitaire.  That's not what we want - we want to play a game together, splitting up the players stops that.\n\nSo I would ask that we don't see this mechanic again, let us keep this game co-operative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=772726","commentId":772726,"userName":"Cutievalkyrie","timestamp":1363033407,"content":"The quest just splits players temporily, later they will join together again… So i think its not a big problem."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=772740","commentId":772740,"userName":"danpoage","timestamp":1363037454,"content":"I agree completely, Stenun. My wife and I finally played Flies and Spiders over the weekend. We enjoyed the strategizing in preparation for the second stage, but once we got there, it was a bit of a let down. The whole point of a cooperative game is interacting with the other players, being in a situation where you cannot in any way impact the other player really detracts from the game. There wasn't much point in communicating, and the separate stages feel more like drudgery. So I second your request, FFG please don't print more scenarios that split the players and limit interaction!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=773225","commentId":773225,"userName":"Dain Ironfoot","timestamp":1363138738,"content":"except that the whole point of Saga expansions is to allow players to \"play the books.\" Therefore, it is only fitting that Bilbo be alone, facing spiders, and attempting to resuce his \"friends\" - that's exactly what happens in the book! - it's a theme home run.\n\nBut, folks will always have things to complain about…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=773234","commentId":773234,"userName":"Ted Sandyman","timestamp":1363143191,"content":"I agree, this quest matches the whole LOTR experience during Bilbos journey. FFG have made a theme scenario where you get separated from each other,  have a few fights, travel to a few spooky places then hopefully rejoin the party. I try to feel the theme of the quest from the point of view of the book but thats just my perspective.  FFG only use this mechanic when it matches Tolkiens written works so i wouldnt worry that it will be a common occurence."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=773528","commentId":773528,"userName":"Stenun","timestamp":1363210125,"content":"No.  Sorry but I've played enough games based on various licences over the years to know that \"accuracy to the source\" is not a good reason for doing something in game design.\n\nA very obvious example (with spoiler warnings in case there is someone reading this who hasn't read The Hobbit) is that not all the Heroes survive the Battle Of The Five Armies in the book.  Why isn't that reflected in the scenario's design?  Why doesn't the final card say \"If you are using this Hero, he dies as you win the game\"?\n\nWhy?  Because that would be crap, that's why.\n\nBut hey, source accuracy!  Right?  Right … ???\n\n \n\nNo.\n\nIf the only justifiable reason for putting in a game text/effect is source accuracy then that is bad design. \n\nI point to Decipher's original Star Wars: CCG in which characters had deployment restrictions based on what part of the movies they appeared in.  Commander Luke could only be deployed (deployed = put into play) on Hoth because that's the part of the movies the picture for Commander Luke was taken from.  So if your opponent was fighting hard on Tatooine and your only characters you'd been lucky enough to pick up could only deploy on Hoth, you were S.O.L.  Why?  \"Source accuracy\" …\n\nU.D.E.'s Vs System was a game that managed to licence both Marvel and DC Comics.  And in their quest for \"source accuracy\" they had cards that were so powerful that they would never be played.  Because in order to balance their power they were so prohibitively expensive that the game would be over before you could afford them.  But hey, \"source accuracy\" …\n\nPrecedence Entertainment's Wheel Of Time CCG had a rule that characters with the Children Of The Light affiliation (think \"Sphere\") couldn't work with characters with the Dark One affiliation.  This was source accurate.  Great.  Until you got the the character who, in the books, was revelead as being a spy for the Dark One faction who had infiltrated the Children Of The Light.  So, in order to be \"source accurate\", the makers of the game gave him both affiliations.  Meaning that we now had a rare card who wasn't allowed to do anything.  They ruled that exact thing; given the way the rules of the game were worded, this rare character literally did nothing.  But hey, \"source accuracy\" … !\n\n \n\nI could go on but I trust you get my point.  :-)\n\nSource Accuracy is a bad, I would say invalid, reason for doing anything in game design.  By all means try to reflect the source but the game must take precedent and if that means sacrificing source accuracy in order to have better game play then that's what should be done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=773562","commentId":773562,"userName":"Dain Ironfoot","timestamp":1363217813,"content":"Stenun said:\n\n \n\nNo.  Sorry but I've played enough games based on various licences over the years to know that \"accuracy to the source\" is not a good reason for doing something in game design.\n\nA very obvious example (with spoiler warnings in case there is someone reading this who hasn't read The Hobbit) is that not all the Heroes survive the Battle Of The Five Armies in the book.  Why isn't that reflected in the scenario's design?  Why doesn't the final card say \"If you are using this Hero, he dies as you win the game\"?\n\nWhy?  Because that would be crap, that's why.\n\nBut hey, source accuracy!  Right?  Right … ???\n\n \n\nNo.\n\nIf the only justifiable reason for putting in a game text/effect is source accuracy then that is bad design. \n\nI point to Decipher's original Star Wars: CCG in which characters had deployment restrictions based on what part of the movies they appeared in.  Commander Luke could only be deployed (deployed = put into play) on Hoth because that's the part of the movies the picture for Commander Luke was taken from.  So if your opponent was fighting hard on Tatooine and your only characters you'd been lucky enough to pick up could only deploy on Hoth, you were S.O.L.  Why?  \"Source accuracy\" …\n\nU.D.E.'s Vs System was a game that managed to licence both Marvel and DC Comics.  And in their quest for \"source accuracy\" they had cards that were so powerful that they would never be played.  Because in order to balance their power they were so prohibitively expensive that the game would be over before you could afford them.  But hey, \"source accuracy\" …\n\nPrecedence Entertainment's Wheel Of Time CCG had a rule that characters with the Children Of The Light affiliation (think \"Sphere\") couldn't work with characters with the Dark One affiliation.  This was source accurate.  Great.  Until you got the the character who, in the books, was revelead as being a spy for the Dark One faction who had infiltrated the Children Of The Light.  So, in order to be \"source accurate\", the makers of the game gave him both affiliations.  Meaning that we now had a rare card who wasn't allowed to do anything.  They ruled that exact thing; given the way the rules of the game were worded, this rare character literally did nothing.  But hey, \"source accuracy\" … !\n\n \n\nI could go on but I trust you get my point.  :-)\n\nSource Accuracy is a bad, I would say invalid, reason for doing anything in game design.  By all means try to reflect the source but the game must take precedent and if that means sacrificing source accuracy in order to have better game play then that's what should be done.\n\n \n\n \n\n \n\nI find none of the arguments convincing/applicable, so I doubt we'll see eye-to-eye on this issue. complice [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/guinyo.gif] It isn't \"dumb\" or \"broken\" to have 2 quests out of 29 quests (to date) have a similiar, yet different mechanic. Other than splitting off, there is nothing similar. In FoS, all players get their own staging area. In H2, there are only two staging areas for all players. In FoS, heroes aren't \"knocked out\" - in H2 they are. So, they are similiar, yet different enough, I think for most, to be unique and interesting.\n\nFellowships get separated - and it's only for one quest card out of 3 or 4, on top of it all. It's not the entire quest. It's different, it's thematic, and it's fun.\n\nNow, I will grant you, if every single quest did this it'd be repetitive and dumb. But to b***h when we have 2 - or 6% of quests, mind you (less if you count the nightmare decks are distinct) - do something similar, that's hardly overbearing. I think we could very well argue most of the reamaning 94% of quests are more similar. Two troll quests? Or two balrog quests? What happens when/if we get LOTR saga expansions? Just skip Moria since we've seen the Balrog twice? Haha.\n\nNo one here was arguing do something simply b/c it's source accurate - your analogies are really a straw man. But to find a slightly different, yet theme home run - is great on the part of FFG.\n\nand i'll remind you - this is key! - the point of saga expansions are to play the books! in other words, to create a gaming experience that mirrors the story line of the books to allow the players to experience the books for themselves. that is the sole reason for the existence of saga expansions. nothing more, nothing less. it's not to have \"hobbit-flavored\" quests (i wonder if those are tasty? haha) - it.is.to.play.the.book.! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nThe point of regular APs and Deluxe's is to create new adventures not based on the book (or at least loosely). So, in every possible way, the two types of game product (saga vs. regular expansion) aren't even comparable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=773616","commentId":773616,"userName":"Stenun","timestamp":1363242941,"content":"Dain Ironfoot said:\n\nNo one here was arguing do something simply b/c it's source accurate …\n\n… and i'll remind you - this is key! - the point of saga expansions are to play the books! in other words, to create a gaming experience that mirrors the story line of the books to allow the players to experience the books for themselves. that is the sole reason for the existence of saga expansions. nothing more, nothing less. it's not to have \"hobbit-flavored\" quests (i wonder if those are tasty? haha) - it.is.to.play.the.book.! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n\n\n \n\nThis genuinelly reads to me like you are saying:\n\n\"No one is arguing for something purely because it's source accurate.  The point of saga expansions is to be source accurate.\"\n\n \n\nAm I really the only one who sees his response as coming across that way … ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=773637","commentId":773637,"userName":"leptokurt","timestamp":1363248744,"content":"I like the idea of having different staging areas, and it shouldn't be overdone. But never ever again? That's harsh and a little over reacting.\n\nI'm also not a fan of including stuff just \"because it's like in the books\". The riddle mechanic of the H1 was terrible and is the main reason why I don't like that expansion very much. Hopefully the second one is better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=773754","commentId":773754,"userName":"Dain Ironfoot","timestamp":1363269929,"content":"Stenun said:\n\n \n\nDain Ironfoot said:\n\n \n\nNo one here was arguing do something simply b/c it's source accurate …\n\n… and i'll remind you - this is key! - the point of saga expansions are to play the books! in other words, to create a gaming experience that mirrors the story line of the books to allow the players to experience the books for themselves. that is the sole reason for the existence of saga expansions. nothing more, nothing less. it's not to have \"hobbit-flavored\" quests (i wonder if those are tasty? haha) - it.is.to.play.the.book.! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n \n\n \n\nThis genuinelly reads to me like you are saying:\n\n\"No one is arguing for something purely because it's source accurate.  The point of saga expansions is to be source accurate.\"\n\n \n\nAm I really the only one who sees his response as coming across that way … ?\n\n \n\n \n\n \n\nYeah, that part is unclear, i apologize. i was trying to make a distinction between regular APs and saga expansions. the point of the sagas it to \"play the books\" - the point of APs is to create new/unique adventures in Middle Earth. I was attempting to say that not *every* (or even most) design decisions for regular expansions should be driven by the books. That would be potentially very restrictive on design space, even if flavorful.\n\nHere's how FFG describes Saga Expansions:\n\n\"The Lord of the Rings: The Card Game broke new ground when it offered players the first fully cooperative Living Card Game. Now, The Hobbit: Over Hill and Under Hill breaks new ground within the game.\n\nThe Hobbit: Over Hill and Under Hill recaptures the magic of the first half of the novel that initially introduced us to Hobbits, the Shire, and a certain magic ring…\n\nIt’s not just a game, it’s an adventure!\n\nThe Saga begins!\n\nWhile standard expansions imagine new and untold stories in Middle-earth, this Saga Expansion allows players to participate directly in the events from the beloved fiction of J.R.R. Tolkien. Its scenarios can be played individually, or combined into a sweeping campaign, which carries players through the first half of The Hobbit and will continue, later in 2012, with the release of a second Saga Expansion that will conclude Bilbo’s epic journey.\"\n\nPerhaps it's a fine distinction, but if I were creating a regular, non-book based AP, I wouldn't say \"let's sing songs in a quest just b/c Tolkein does it on every page - that'll be fun!\" - b/c that will probbably turn out bad, in a general sense.\n\nBut if the sole reason for existence of the expansion, a la Sagas, is to recreate the storyline of the book, you aren't given much creative license (beyond translating the theme into game mechanics) in choosing what story to tell - though, you do choose which chapters to recreate in game-terms.\n\nI think the second poster made an excellent point re:The Riddles quest - this isn't a bad quest simply b/c it's recreating the (arguably) most critical chapter of The Hobbit - it's a hum-drum quest b/c, while flavorful, the mechanic doesn't really work all that consistently/well.\n\nBut, I could place a pretty safe bet that if Gollum didn't appear in a quest - people would complain. And he was only in the Book to pose riddles and for Bilbo to get the ring. Now, I suppose FFG could have left out the riddles and done something different? But how would that have been different from the other Gollum quests? That's the challenge.\n\nGiven that, at the end of the day, I have to at least give them credit for trying to re-create the theme via game mechanics. So, on the one hand, if we didn't separate parties in the 1st quest, it would be just like Passage through Mirkwood, or Return to Mirkwood, all over again. If we split off, like the books, it's like FoS. It's damned if ya do, damned if ya don't.\n\nPart of this game, and I think the appeal to many, many players is the theme/story it tells. Why else would we have two Arwen escorting quests in a row (now *that's* definitely more similar than FoS and Hobbit2). Two Troll? Two Balrog? The list of comparisons could go on, and on.\n\nSometimes FFG is going to hit a flavor/theme home run. Sometimes they will hit a mechanic home run. Sometimes it will be a combo of the two.\n\nUltimately, I think different aspects appeal to different players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=774092","commentId":774092,"userName":"bollywongaloid","timestamp":1363337629,"content":"Sorry Stenun, while I agree with you in that I wouldn't like to see this mechanic too often, I couldn't really complain about Flies and Spiders as I found it different enough to still be interesting and fun to play. Also, I get your argument about sticking too closely to the source material… that would just be silly as I think you need to be given enough slack to add your own imagination to the game. However, FFG can't deviate too much otherwise what would be the point in calling it LOTR?  It's a balancing act that's probably harder to do well with the saga expansions… I mean I will never like the riddle mechanic but I'm glad at least they tried something different to get one of my favourite parts of the book in the game or I probably would have been more disappointed if riddles didn't feature at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80609-a-request-of-ffg-%E2%80%A6-spoilers-for-on-the-doorstep/?do=findComment&comment=776406","commentId":776406,"userName":"Mr Coffee","timestamp":1363868027,"content":"As I primarily play this game solo, perhaps I don't have a \"dog in this fight\"… but, I DID like the FoS encounter.  I thought it was innovative.\n\n \n\nI will aggre with the OP though, although for different reasons.  My concern is that any encounter deck mechanic might become tiresome if used too often.  I could understand using a variant, say, once per cycle.  But even that might be too much.\n\nAnd at some point it then just looks like the developers are running out of ideas.  We are much too early in this game for that to happen!"}]}