{"url":"https://community.fantasyflightgames.com/topic/80677-card-storage/","title":"Card storage","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773095","commentId":773095,"userName":"bollywongaloid","timestamp":1363112732,"content":"So I was just wondering what kind of storage solutions people are using for their cards because I seem to have so many that I spend more than a fair bit of time sifting through reems of cards building encounter decks and hunting for player cards I need.  At the moment I store all the encounters in their respective boxes so I can easily pick a scenario I fancy and the cards are there, even if it is a bit annoying that sleeved cards don't all fit properly in the big expansion boxes.  Also sorting out all the different encounter sets is a pain in the backside, say if I want to work through the hobbit saga.\n\nPlayer cards I keep separate and I divide them up according to sphere, type etc, but this still becomes laborious if I want to build a new deck as I have to order them all back together.  I don't suppose anybody has came up with some ingenious storage solution or found some ideal nicely-fitting boxes so there's more time playing and less time messing about lol. Also do people stay with the same deck for a while or do people get bored of a deck quickly and like to change things often like I do (and hence mess about trying to prevent things becoming too disorganised)? Maybe I'm just OCD :-s"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773122","commentId":773122,"userName":"GrandSpleen","timestamp":1363116660,"content":"I threw out the original insert in the Core Set box.  Then I cut up a cardboard box to make a reinforcing inner frame for the Core box, as well as two dividers so that I have three columns in the box to store cards.  I have everything released to date except the PoD stuff, all in the Core box.  It's getting heavy.  I made my own (ugly) card dividers with MS Word and printed them on card stock.  Encounter sets are sorted by set, player cards by sphere & type.  There is just enough room left in the Core box to put the threat trackers, tokenss, first player token, and all the rule inserts in there as well.  But quickly running out of space!\n\nAs for decks, I tend to make a couple of decks for 2-player games and leave them pretty much intact for long periods.  I tweak them quest by quest, but I don't have a lot of time to constantly make decks from scratch, so the core of the deck mostly remains the same from quest to quest.  And of course some quests will force you to make a deck from scratch (I'm looking at you, Numenor!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773197","commentId":773197,"userName":"booored","timestamp":1363132616,"content":"see this thread here\n\nStoring Cards @ CGD [http://www.cardgamedb.com/forums/index.php?/topic/5369-storing-the-cards/#entry21851]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773262","commentId":773262,"userName":"bollywongaloid","timestamp":1363157140,"content":"Hi thanks for the replies.  I used to keep all my cards in the core set box but everything was becoming a bit of a squeeze so not really sustainable as more expansions come out. I can't decide whether or not I'd like to keep all my cards in a binder though… I can see the appeal in having them laid out easy to read but I can't help but think building decks is gonna be even more time-consuming than it is already having to take them all out one by one, especially if I have a couple of mates over wanting to build their own decks at the same time using cards that are inevitably in the same binder as the one I'll be using.  I guess there's no perfect answer to this just gonna have to live with it lol desconfiado [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/desconfiado.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773487","commentId":773487,"userName":"Jacob5432","timestamp":1363203416,"content":"Hi,\n\nI have been having storage problems as well. I found these boxes from a seller on eBay. Now, I have purchased 7 x 1000 cards boxes from them. The good thing about these boxes is that they certainly keep the cards well-protected and easily accessible. They also have room for sleeved cards as the 95mm width fits the FFG sleeves very nicely.\n\nIt is a very expensive soluton but then again, now I do not need to worry about card storage for quite a while as I still have two spare boxes and I am not even close to fill up the five boxes I have taken into use   sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]\n\n \n\nHere is the link to the eBay store: http://stores.ebay.co.uk/GOGOKIWI-HOBBY-SHOP [http://stores.ebay.co.uk/GOGOKIWI-HOBBY-SHOP]\n\n \n\nAnd here is a picture of one of the boxes. They sell 500, 1000 and 2000 card boxes. Notice, that the capacity is for unsleeved cards. For sleeved cards the capacity is somewhat lower (I would say 30-40% lower).\n\nCard box with room for 1000 cards. [http://www.brickshelf.com/gallery/AndreasL/Familiefest/cardbox.jpg]\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773491","commentId":773491,"userName":"Jacob5432","timestamp":1363203753,"content":"I forgot to mention that there is also this guy producing wooden inserts for the original core game box:\n\nhttp://www.boardgamegeek.com/geeklist/152772/uk-based-card-storage-game-components [http://www.boardgamegeek.com/geeklist/152772/uk-based-card-storage-game-components]\n\n \n\nI was considering this solution but the available space for the card rows seemed incompatible with the FFG sleeves. Other sleeves might fit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773576","commentId":773576,"userName":"Cutievalkyrie","timestamp":1363222648,"content":"No boxes better than the original ones. We have 1 basic + 4 large expansion boxes which is enough to hold all the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=773747","commentId":773747,"userName":"158hoff","timestamp":1363269217,"content":"I sleeve everything with Dragon Shields and then put those into the 100 ct. plastic storage cases. It works for now because I can just slap on a label or since their clear I can see which expansion is in each case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=774049","commentId":774049,"userName":"DurinIII","timestamp":1363329592,"content":"Several of my gamming buddies use these, http://www.lowes.com/pd_212419-82673-014710R_0__?productId=4574678&Ntt=portable+tool+box [http://www.lowes.com/pd_212419-82673-014710R_0__?productId=4574678&Ntt=portable+tool+box]\n\nThey work really well; in fact, they don't just use these heavy duty boxes for LOTR LCG but for many other card based games as well. The box is plenty big to hold several hundred cards, it hold sleeved cards, not too big to store, and hey, it only costs $17. I have yet to purchase one only because my local Lowe's is always out of them. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=865992","commentId":865992,"userName":"Kerstoid","timestamp":1379135736,"content":"I keep my player cards in a binder and encounter cards in a box (with dividers made from the AP packaging)\n\n \n\n\n\n\n\n \n\nstorage-solutions.jpg [http://masteroflore.files.wordpress.com/2013/09/storage-solutions.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=866056","commentId":866056,"userName":"HeavyKaragh","timestamp":1379147266,"content":"I use 5 binders (4 spheres + Neutral/Baggins), and keep Encounter cards in the original box. Everything sleeved."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80677-card-storage/?do=findComment&comment=867329","commentId":867329,"userName":"ClydeCloggie","timestamp":1379335733,"content":"I have got everything in one of the big white cardboard boxes from BCW, thinks it's a 4000 ct or similar. Currently about 3/4 full and that's everything released to date except the nightmare packs. For current plays I have one old UltraPro deck box which can hold one player deck and one encounter deck.. "}]}