{"url":"https://community.fantasyflightgames.com/topic/80731-complete-collection-for-sale/","title":"Complete Collection for Sale","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80731-complete-collection-for-sale/?do=findComment&comment=773557","commentId":773557,"userName":"4n6gamer","timestamp":1363216847,"content":"I have been buying the cards since their introduction and have remained a consistent purchaser of the cards as they have been coming out. None of my friends play the game and so it has seen only solitaire play. I only wish I had been as consistent a player as I had a purchaser. I recently took the game upstairs to my game room and found myself more frustrated than happy to sit down with it. Since I have other solitaire games that I can play that do not require deck building I feel I would have to invest for the game to be enjoyable to me, I have made the diffuclt decision to try to sell the entirety of the collection.\n\nLet me first state that the cards have been extremely well cared for. While they have not been sleeved, they have not been played that much at all; primarily the core set encounters and the Hunt for Gollum. The remaining encounter decks have not been touched except to look at them. I have only the core set box. None of the remaining packaging for any of the other decks or expansions have been saved. I have organized the cards into Deck Boxes and all the boxes fit in the core game box, though lifting the lid a bit once the rules are added. The rule sheets for the expansions have been hole punched as I used to have them in a binder.\n\nHere is a listing of the cards I have:\n\n * 2 of the Core Set (first printing)\n * 1 each Mirkwood Cycle AP\n * 1 Khazad-Dum expansion\n * 1 of each Dwarrowdelf AP\n * Both Hobbit expansions - Under Hill Over Hill and On the Doorstep\n * 1 Heirs of Numenor expansion\n * Massing at Osgiliath - print on demand\n\nI would like to get $275 for the complete collection, though I will listen to offers. Shipping and handling will be extra. My zipcode for those purposes is 94509.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/80731-complete-collection-for-sale/?do=findComment&comment=773574","commentId":773574,"userName":"Cutievalkyrie","timestamp":1363222087,"content":"12 small packs=10*12=120\n\n2 core sets= 25*2=50\n\n4 large expensions=4*20=80\n\n2 PODs=12*2=24\n\nAll brand new whole set= $274…\n\nI dont know what to say."}]}