{"url":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/","title":"FFG characters in a LOTR game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774084","commentId":774084,"userName":"ediblecastle","timestamp":1363336023,"content":"Hello, I'm new to the game but just wondered why FFG made up their own characters like Beravor, Eleanor and Thalin? I think I read somewhere that these are FFG characters brought through from another one of their games. But the question is pretty much the same. Why?\n\nSo a quarter of the core-set heroes are not from LOTR. Hmmm. One of the main factors of buying the game for me was the whole LOTR theme. So I just thought the decision to include these made up characters was a bit strange.\n\nAren't there enough heroes from the original texts? I know there's a lack of strong female characters, so including a few made up female heroes is… understandable. But surely there's plenty of Dwarves to pick from. Have FFG made any statements about this?\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774095","commentId":774095,"userName":"bollywongaloid","timestamp":1363338269,"content":"I personally think FFG did it because they believe that if they included all the heroes that everybody knows in the core set (e.g Sam, Pippin, Merry, Theoden etc), the more casual players would be less inclined to pick up the expansions?  I don't know, but it definitely smacks of a business/money making decision rather than a strictly creative one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774096","commentId":774096,"userName":"ediblecastle","timestamp":1363338798,"content":"yep, well - fair enough not bringing out all the more famous charaters right off the bat. But there's still plenty of 'real' lesser-known characters that could have filled the spaces up with.\n\neg. pick a Dwarf, any dwarf: http://en.wikipedia.org/wiki/List_of_Middle-earth_Dwarves [http://en.wikipedia.org/wiki/List_of_Middle-earth_Dwarves] :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774097","commentId":774097,"userName":"Khamul The Easterling","timestamp":1363339106,"content":"Yes those 3 heroes from the core set are made up but those are the only ones in the whole game(that I know of).  There are also about 18 new expansion packs that have come out and each with new heroes.  There have been around 23 (give or take) new Heroes that have come out with each of those new expansion packs.  Thet have already made all the dwarves (or dwarfs) And many other characters.  But they are STILL coming out with more.  And more Heroes.  I doubt they will come out with more made up characters soon.  But Here is a list of all they heroes they have in this card game so far:\n\nHeroes From the Core\n\nEowen\n\nThalin\n\nDenethor\n\nGloin\n\nBeravor\n\nGlorfindel (Lore Version)\n\n Legolas\n\nGimli\n\nAragorn\n\nBifur\n\nDunhere\n\nEleanor\n\nTheodred\n\n \n\nThese are now from the expansions:\n\nBifur\n\nDwalin\n\nBilbo\n\nFrodo\n\nPrince Imrihill\n\nBrand son of Bain\n\nBoromir (Tactics Version)\n\nDain Ironfoot\n\nElrohir\n\nElladan\n\nAragorn (Lore version)\n\nHama\n\nGlorfindell (Spirit Version)\n\nElrond\n\nBoromir (Leadership version)\n\nBeregond\n\nBeorn\n\nNori\n\nBofur\n\nThorin Oakensheild\n\nOri\n\nSpecial version of Bilbo\n\n \n\nThats all i know of. I think i got them all.  And all the rest of the dwarfs are ally versions.  \n\n \n\nHope this helps,\n\nKhamul\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774098","commentId":774098,"userName":"ediblecastle","timestamp":1363339558,"content":"well that's good to know they've pretty much stuck with proper characters for the expansions. thanks.\n\nWonder why they felt it necessary to even bother with the 3 phonies in the core-set then.  I mean, obviously they plan these things out far in advance and genuinely did have a few slots to fill or something. haha. oh well. i'll live."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774107","commentId":774107,"userName":"Thanatopsis","timestamp":1363341049,"content":"I believe it's more of a gender issue.\n\nThere are currently three female heroes in the game, two of which were invented by FGG. Without Eleanor and Beravor, Eowen is the sole female.\n\nIs FGG trying to market to female gamers? Are they trying to “fix” what is “wrong” with Tolkien’s Middle Earth? Are they trying to fit in with modern political correctness? I’m not sure. They certainly have not added any additional female heroes since the core set. But, I do have to applaud them for not overly sexualizing the women of Middle Earth. That is refreshing.\n\nThe role of women in Middle Earth is a very large and complicated discussion. I cannot do it justice in a few lines of a forum. The attached link leads to a pretty balanced argument if you are interested.\n\nhttp://www.freerepublic.com/focus/f-chat/1043733/posts [http://www.freerepublic.com/focus/f-chat/1043733/posts]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774119","commentId":774119,"userName":"Mattr0polis","timestamp":1363343075,"content":"I kind of liked the inclusion of the FFG created characters. I thought it was a nice homage to their Middle Earth Quest game. I wouldn't want them to do it too often (and really they haven't since the core set) but I like getting unique named characters over generic non-unique ones. There's just something more cool about named ones, even if FFG made the names up. There's SOO many dwarves, elves, humans, hobbits, etc, etc, that obviously exist in Middle Earth that are in the background that aren't named so it's a cool way to include others that aren't necessarily as tied down to the story.\n\nThat said, there are a LOT of real characters that they could and will still make, and those should take a bit of precedent, but the inclusion of a few of these every once in a while is fun.\n\nPeter Jackson is doing something similar with the Hobbit movies, by including a Elf named 'Tauriel' that does not exist in the book, to help flesh out some more of the story points with the Wood Elf part of the book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774127","commentId":774127,"userName":"tripecac","timestamp":1363344653,"content":"> I believe it's more of a gender issue.  There are currently three female heroes in the game, two of which were invented by FGG. Without Eleanor and Beravor, Eowen is the sole female.\n\nMakes sense, and who's to say Thalin isn't female too?\n\nFrom now on, I'm gonna call Thalin a \"she\"!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774173","commentId":774173,"userName":"Thanatopsis","timestamp":1363350783,"content":"tripecac said:\n\nFrom now on, I'm gonna call Thalin a \"she\"!\n\nOh, that is amazing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774196","commentId":774196,"userName":"Ted Sandyman","timestamp":1363354900,"content":"Lack of possible female LOTR heroes? I dont think so.    Arwen, Galadriel, Princess Leia."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774450","commentId":774450,"userName":"drasen","timestamp":1363416676,"content":"Call me rare but I would definitely like that FFG would produce more hero cards apart from those characters appearing in the books. Sometimes the mixture of heroes is, well, very unlikely, to put it mildly. And playing with three bigger-than-life heroes is definitely not of my liking: I do not mind one, but three is too many. So, I would be happy if FFG could consider producing an expansion package dedicated to heroes not in the books, replicating the abilities of the current ones. Just my two cents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774466","commentId":774466,"userName":"Rapier1","timestamp":1363421752,"content":"I wanted this game to help me play through new adventures in the middle earth setting.\n\nI have no problems with new heroes being added to the game that are made up by FFG. (Just like I don't make everyone play the fellowship in the One Ring RPG).\n\n \n\nIt also doesn't bother me that all the quests except those from the Hobbit are made up. But if the heroes bother you, I don't understand why these new quests don't bother you? (It's still made up stuff that's only \"based on\" rather than \"taken from\" the setting material)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/80812-ffg-characters-in-a-lotr-game/?do=findComment&comment=774585","commentId":774585,"userName":"Jacob5432","timestamp":1363447141,"content":"I agree with the previous couple of posters. As a fan of the Middleearth Quest game I would actually be very happy if FFG would produce the two remaining heroes from that game, The Middlearth \"time-period\" of the two games match nicely.\n\n \n\nEometh with a fast moving (rider) ability for Tactics or Leadership and Argalad as an Elvish Spirit or Lore hero would be terrific. So, FFG please consider adding these to the LOTR LCG game in the next cycle…\n\nEometh [http://www.fantasyflightgames.com/ffg_content/middle-earth_quest/preview_1/eometh.png]\n\npic572050_lg.jpg [http://cf.geekdo-images.com/images/pic572050_lg.jpg]"}]}