{"url":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/","title":"Sleeping Sentry needs to be nerfed…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776565","commentId":776565,"userName":"Cutievalkyrie","timestamp":1363894164,"content":"ffg_sleeping-sentry-rtr.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_sleeping-sentry-rtr.jpg]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776575","commentId":776575,"userName":"Ellareth","timestamp":1363895787,"content":"Or FFG need to keep pumping out even stronger shadows and when-revealed trecheries, so people might consider adding some anti-shadow and encounter deck manipulation instead of adding extra +10 attack to their 30 attack strength Gimli."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776588","commentId":776588,"userName":"GrandSpleen","timestamp":1363898048,"content":"Cutievalkyrie!  I want your next thread to be something that you LIKE about this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776590","commentId":776590,"userName":"GrandSpleen","timestamp":1363898075,"content":"Also, a 40 attack strength Gimli would be badass."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776599","commentId":776599,"userName":"DevastazioneH88","timestamp":1363901300,"content":"Hilarious XD both Ellareth and Grand Spleen XD "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776676","commentId":776676,"userName":"richsabre","timestamp":1363923838,"content":"this is something that has been discussed alot since its release, the community is generally split between the need for a challenge and the fact that it is rather too much of a luck thing.\n\ni think it is ok, albeit rather annoying when it ruins a great game. i think it does indee force you to consider some different deck building options which is a good thing i think\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776711","commentId":776711,"userName":"Rapier1","timestamp":1363933623,"content":"Ellareth said:\n\nOr FFG need to keep pumping out even stronger shadows and when-revealed trecheries, so people might consider adding some anti-shadow and encounter deck manipulation instead of adding extra +10 attack to their 30 attack strength Gimli.\n\n\n\n \n\nIn which case FFG need to print more options for dealing with shadow effects and trechary cards. (Specifically in spheres that lack those things).\n\n \n\nThat said, without sleeping sentry that quest would always be a joke with no risk at all. I wouldn't want to nerf it or remove it. I think it probably is the harshest trechery in the game though (in a quest that is otherwise fairly uninteresting).\n\nIt makes that quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776719","commentId":776719,"userName":"Style75","timestamp":1363935152,"content":"You could always just do what I do and take that card out of the deck and pretend it doesn't exist. Problem solved.\n\n(the scenario is a lot more fun without it and is still plenty hard enough for casual play)\n\nIf something appears broken, you don't have to wait for the developers to release errata. You know what they say, if want something done right, do it yourself :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776736","commentId":776736,"userName":"Rapier1","timestamp":1363938908,"content":"Style75 said:\n\nYou could always just do what I do and take that card out of the deck and pretend it doesn't exist. Problem solved.\n\n(the scenario is a lot more fun without it and is still plenty hard enough for casual play)\n\nIf something appears broken, you don't have to wait for the developers to release errata. You know what they say, if want something done right, do it yourself :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\n \n\nWithout Sleeping Sentry is their anything else in the deck even worth noting?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776744","commentId":776744,"userName":"Style75","timestamp":1363940340,"content":"Rapier said:\n\nStyle75 said:\n\n \n\nYou could always just do what I do and take that card out of the deck and pretend it doesn't exist. Problem solved.\n\n(the scenario is a lot more fun without it and is still plenty hard enough for casual play)\n\nIf something appears broken, you don't have to wait for the developers to release errata. You know what they say, if want something done right, do it yourself :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\n \n\nWithout Sleeping Sentry is their anything else in the deck even worth noting?\n\n\n\n\"Followed by night\" can be bad, but you do get a choice of effects. \"Goblin gate\" and \"orc ambush\" are quite nasty and can create some wild situations where you end up with pretty much all of the orcs in the deck sitting in the staging area. Individually the orcs are not too bad but if they all come together they can take you out very quickly. Mountain wargs are irritating but managable if you can attack the staging area. Other than that, the locations and enemies are not too bad by modern standards.\n\nOverall, without \"Sleeping Sentry\" the scenario is not really hard, just a moderate challenge. And in my opinion that's a very good thing. Too many of the new scenarios are brutally hard which means the only chance you have of winning is playing the latest, cutting edge decks. It's nice to have scenarios available that allow you to play whatever deck you want and have a reasonable chance of winning.\n\nThe problem that I have with sleeping sentry is that it takes a scenario that should be difficulty 3 or 4 and turns it up to difficulty 7 but in a stupid, bad luck draw kind of way. Try the scenario without sleeping sentry and you'll have a lot more fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776755","commentId":776755,"userName":"Glaurung","timestamp":1363943254,"content":"Rapier said:\n\nStyle75 said:\n\n \n\nYou could always just do what I do and take that card out of the deck and pretend it doesn't exist. Problem solved.\n\n(the scenario is a lot more fun without it and is still plenty hard enough for casual play)\n\nIf something appears broken, you don't have to wait for the developers to release errata. You know what they say, if want something done right, do it yourself :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\n \n\nWithout Sleeping Sentry is their anything else in the deck even worth noting?\n\n\n\n \n\nI really like the ambush idea but this quest is so boring and easy. Without sleeping  centry is really nothing. Only one way how to make this quest more interesting  is play Redhorn gate and Road to Rivendel in one mini nightmare compaine( play 2 quest in 1 go without reset threat, discard pile and damage.)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=776777","commentId":776777,"userName":"Cutievalkyrie","timestamp":1363945406,"content":"One enemy's attack can kill the whole heroes party, this looks ridiculous to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=777450","commentId":777450,"userName":"Rapier1","timestamp":1364107681,"content":"I wouldn't have more fun without sleeping sentry in this quest because I don't think you would ever lose. Much like how the first quest from the core isn't fun because you would never lose. (95%+ is probably more accurate in both cases).\n\nHowever sleeping sentry is frustrating because the quest is a complete joke if it comes up in an inoffensive time/way. Where as it can end your quest if it comes up at the worst time. Which is why I think that while the quest needs this card to be interesting in any way, (and I can see why they tried to desgin a quest like this to see how they work), I don't think they should try to copy the design much (or at least, not with 1 killer card like this).\n\nSudden Pitfall is a similarly annoying card, it won't immeditatly end you like sleeping sentry but you can't cancel it. When I first started playing I had core + khazard dum only and we did take this card out. (Although after getting the first cycle we put it back in because it isn't so bad with a bit more card pool to work with).\n\nI have no objection to taking cards out if you don't enjoy them, I do think the quest will be awfully dull without this one though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=777484","commentId":777484,"userName":"GrandSpleen","timestamp":1364119037,"content":"Also let's not forget that Balin pretty much makes Sleeping Sentry irrelevant now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=777544","commentId":777544,"userName":"Rapier1","timestamp":1364133126,"content":"Balin is a very interesting addition to the game imo. I just hope they don't design quests so that we need him all the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=777629","commentId":777629,"userName":"gatharion","timestamp":1364152756,"content":"GrandSpleen said:\n\nAlso let's not forget that Balin pretty much makes Sleeping Sentry irrelevant now.\n\n\n\nI'd certainly keep a resource on Balin in order to cancel Sleeping Sentry as a Shadow card, but then a dedicated defender with Burning Brand does alot against it too. There's enough enemies in the deck though, that if you draw it as a treachery card, you can still get wiped out by the extra damage and undefended attacks you'll have to take.\n\nPersonally, I agree that the quest would be too easy without that card, but that it is also a heinously nasty card that can make you feel like you've lost just because of a unlucky draw.\n\nI further think that it is foolish to complain about losing to Treachery/Shadow cards when one doesn't include any form of card canceling in their decks. And while it would be nice if we did have more ways to cancel cards, there are also creative solutions that often get overlooked. \n\nWays to deal with Sleeping Sentry:\n\nStraight up cancel cards-  Test of Wills or Hasty Stroke\n\nShadow negators- Burning Brand and Balin are the best, but there are others as well\n\nTreachery Negators- Elenor isn't very good, but when only a few encounter cards are especially nasty she can be worth considering\n\nEncounter Deck manipulation- Often overlooked, but Denethor can potentially put Sleeping Sentry at the bottom of the deck and there's a lore event (my mind is blanking on its name) that let's you remove a card from the encounter deck entirely \n\nWith all that in mind, I'd say Sleeping Sentry is extremely aggravating, but in an otherwise fairly easy quest it's certainly surmountable. I would like it if the card was *almost* as nasty; say if it made you exhaust/discard three characters, rather than all of them. That way it could still potentially devestate you, but not as reliably."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=778705","commentId":778705,"userName":"Pickles","timestamp":1364405066,"content":"I have beaten the quest using dwarfs with no spirit or burning brands. You need to play around Sleeping Sentry but using a swarm of dwarfs buffed by the super OP Dain you can quest effectively while you only risk losing a few allies. Fat dwarf heroes can tank some damage & untapping a bit with Cram or lure of Moria which helps.\n\nWhen I did figure out how to play this deck against it I got a huge sense of satisfaction but it was very frustrating & it can still all go down to a badly timed (ie early) Sentry/ (late) Orc Ambush. I do think it is a pretty terrible quest as you do not get any sense of increasing tension or anything like that you just get the dread of a badly timed \"you lose\" card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=778877","commentId":778877,"userName":"DurinIII","timestamp":1364452256,"content":"I just played a game of Road to Rivendell last night, where I was royally smacked by Sleeping Sentry. The first time it appeared as a shadow card, I cancelled it with Hasty Stroke. The very next combat phase, another one popped up, and yep, nearly all my heroes and allies were exhausted. Such is the way of it. I agree with you Valkyrie: I hate this card with a vengence. As to everyone saying the card is fine, not hard enough (Glaurung) or whatever, well, that's your opinion, and so be it. Good luck playing! By the way, Style75, I agree with your assessment about this quest 100%."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=778944","commentId":778944,"userName":"Style75","timestamp":1364467722,"content":"Thanks Durin, it's nice to see I'm not the only one on here who thinks Sleeping Sentry is BS. I really don't understand the obsession with having every quest be the most uber-difficult quest that requires only the most cutting edge deck with the most powerful cards. I think there's plenty of room in this game for a few softball quests where you can have a fun time trying out a thematic deck with rarely used but flavorful cards,  or maybe bring in some rookie players and let them have fun while showing them the ropes. I think FFG will cull their fanbase if they only put out super difficult quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=778964","commentId":778964,"userName":"Alex6222","timestamp":1364471217,"content":"I agree that sleeping sentry can totally ruin your game. I don´t like cards like that, i prefer cards that work together to ruin you like in Heirs. But i also think this quest is very easy and once you find how to deal with SS it looses it difficulty. You can add the Goblins of the Deep encounter set to make it a little more challenging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=779028","commentId":779028,"userName":"DurinIII","timestamp":1364480924,"content":"Once again Style75, I am in full agreement with your post. I also wish there were more \"softball\" quests to enjoy. I feel as if the majority of the quests to date are more focused on crushing you too much, rather than allowing you to play a nice leisurely game of LOTR questing. I also feel like their are a majority of players on this message site (or at least they are the loudest) who are mega-gamers and not satisfied with anything but ultra hard quests, all the while poking fun at players (like myself) who want more variety and less difficult quests. I really don't think that their are enough \"medium hard\" quests to date. They are either really easy (Mirkwood, Hunt for Gollum, Cliffs, etc.) or really hard (Escape, Shadow and Flame, Foundations of stone, nearly all of the Hobbit quests, HON quests and print on demand quests)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=779089","commentId":779089,"userName":"leptokurt","timestamp":1364497107,"content":"First i want to say that RtR is a great scenario to play secrecy decks. I grew quite fond of this quest because of that. I totally agree that we need easier quests from time to time. I love the new HoN quests, but like D3 said, sometimes you just want to enjoy the game. However, I don't see why Sleeping Sentry should be nerfed. There are many ways to deal with this card, but of course if you don't build a deck that ignores this card, you should not complain about it. Bilbo + BB + Fast Hitch still remains my favourite to master this treachery."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81179-sleeping-sentry-needs-to-be-nerfed%E2%80%A6/?do=findComment&comment=786982","commentId":786982,"userName":"Eryx_UK","timestamp":1366445345,"content":"This is one of those examples where I point to the optional rule in the rulebook that says if the game is too hard don't play with shadow effects. It certainly does help where you want to solo play for fun."}]}