{"url":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/","title":"Adventure packs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777326","commentId":777326,"userName":"Khamul The Easterling","timestamp":1364068009,"content":"So i have The core, KD, and number 2 and 3 of both cycles.(CATC, AJTR, RTR,TWITW) what 3 expansions do you suggjest getting? I can find hunt for gollum NOWERE so thats off the list. (actully i can find it but its like 80$) What adventure packs are your favorite of the ones i dont have?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777333","commentId":777333,"userName":"DevastazioneH88","timestamp":1364069696,"content":"My favourites are Shadow and Flame and The Redhorn Gate…the first one might be a bit tough without so many expansions though…as for the mirkwood cycle I'd say The Dead Marshes…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777337","commentId":777337,"userName":"Khamul The Easterling","timestamp":1364070404,"content":"Return to Mirkwood  is really hard solo i've heard.  What do you think of Emyn Muil? is it really super boring like most people say or it is okay?  I'm kinda hesitant to buy Redhorn Gate cuz of the Victory point thing. I'm guessing it would be wayy harder solo than 2-4.  And it can really drag on a long time so i've heard. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777338","commentId":777338,"userName":"Khamul The Easterling","timestamp":1364070474,"content":"What makes Shadow and Flame and the Redhorn Gate your favorites?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777397","commentId":777397,"userName":"GrandSpleen","timestamp":1364081857,"content":" \n\nA lot of people like Redhorn Gate because it's a cool theme (climb over Caradhras!) and well done thematically.\n\nPersonally I really like all of the quests in the Hobbit: Over Hill and Under Hill box.  But if you're specifically interested in the small AP boxes….\n\n1) Foundations of Stone is pretty awesome, but it shines as a multiplayer quest.  The theme is kind of lost in solo play.  A lot of people put this on their top 5, though.\n\n2) Redhorn Gate would go on my list as well, for reasons I mentioned above.  I can't speak so much for solo play, but I find this to be a well-designed quest that tends to be pretty consistent in terms of difficulty (challenging but not insurmountable, and difficulty doesn't vary wildly like it does with some quests).\n\n3) Return to Mirkwood, but yeah it would be super hard solo (+4 threat every Refresh!).  Also challenging as a 2-player quest, but lots of fun.  This is one of two AP quests where you've got Gollum on the table, the other being The Dead Marshes.  TDM is a whole lot easier.\n\n \n\nI do like The Hills of Emyn Muil, but it can be dry trying to clear locations and little else.  Sure there are treachery and enemy cards in the deck, but on the whole there is not a lot of variety in that quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777442","commentId":777442,"userName":"DevastazioneH88","timestamp":1364103629,"content":"I like Shadow and Flame because I love the idea of escaping from the Balrog of Morgoth and beacause it's well balanced, you can quest without too much effort, fight a lot (you need quite a lot of that but since tactics is my favourite sphere I love it), and you get to use secrecy cards (which I normally don't use, especially cards like timely aid) because the first quest card resets your threat to 0.\n\nAs for The Redhorn Gate it is one of the more varied. Grand Spleen explained it quite well so I'm just gonna say that, maybe, without all of the mirkwood cycle APs, and only 1 Core Set it might be tough, but it's not true that it's way more difficult solo (I played all of the scenarios multiple times both solo and in 2  player games with my girlfriend). The only scenarios that are actually tougher the more player participate are : Road to Rivendell (not very hard anyway), The Long Dark (that you shouldn't miss because there's the mighty Hama of Rohan, also not very hard), Shadow and Flame and the Massing at Osgiliath (this one is much harder in multiplayer while it can be a piece of cake solo with a  low threat deck).\n\nIn conclusion, my advise to you would be to buy the APs in order both because of how hard they are the farther you go (for instance at a certain point you really need hands upon the bow if you plan on using Legolas at his best), and because of the story that is told. But if you prefere to get them without a particular order I think you should also see which cards come out in what AP. Keeping in mind that most people's favourite scenarios are The Redhorn Gate and Foundations of Stone.\n\nAh I was forgetting to say a few words about the Hills of Emyn Muil. In my opinion it's quite cool. After a lot of fighting and cancelling shadows and avoiding threacheries you must focus on exploring locations and travel through this scenario with cards that sometimes are useful only in this one (like ride to ruin, strenght of will and the likes). I like it, maybe it won't hit my top five but it surely is one of my favourite 2 or 3 from the mirkwood cycle (the one I dislike the most being Return to Mirkwood because it's thought for multiplayer only, pretty much like Dol Guldur, so to beat it consistently in solo play you must build an almost perfect deck and most importantly you must have quite a good amount of luck).\n\nAlso keep in mind that reprints from the mirkwood cycle are about to come out, so if you want to get the The Hunt For Gollum you should be able to in a few weeks.\n\nMy last advise is to get the stuff from sites like amazon or the book depository (even better and with free delivery worldwide), especially the bookdepository is the reason why my girlfriend and I get to buy all the packets and expansions from AGOT, LOTR and SW (because of the good availability and very good discount). I don't think we could have gotten three core stes without these sites because the retailer price is like 12 dollars higher. Moreover being stuck in Italy we wouldn't be able to find the stuff (and most importantly not in english)…\n\nHope I helped you out ! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777468","commentId":777468,"userName":"Khamul The Easterling","timestamp":1364111704,"content":"Yes thank you both a lot! The book depository is out of the mirkwood cycle…..  This helps a ton on finding out what expansion to buy next.  The reason I left ou the hobbit and the heirs of numenor is cause ive heard that they are really hard unless you have almost all the expasnions. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81298-adventure-packs/?do=findComment&comment=777474","commentId":777474,"userName":"DevastazioneH88","timestamp":1364115235,"content":"Yes they are, but there are also very useful cards in those, Foe Hammer is the only tactics card-draw option and in combo wiith Hama grants you almost always three cards per turn (or every couple of turns)…Bard and Balin seem to be great (I haven't tried them yet) and some cards form HoN are good, Beregond in a 2 player game is awsome and I found Envoy of Pelargir very useful."}]}