{"url":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/","title":"Dunhere, Bard the Bowman and multiple attacks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780414","commentId":780414,"userName":"PESKPESK","timestamp":1364885912,"content":"If you have Dunhere and any ranged character with the Great Yew Bow, each of them may target and attack the same enemy in the staging area if you wish, but none of these effects will allow you to combine these attacks. But what about Bard the Bowman and his -2 defense? Does it accumulate?\n\nYou, as a player, are only allowed to declare one attack against each enemy during the Combat Phase. However, cards like Great Yew Bow, Quick Strike, and Hands Upon the Bow all include a declaration of attack as part of each card's effect. They do not affect or in any way conflict with your normal ability to declare an attack.\n\n \n\ngreat yew bow:\nCombat Action: Choose an enemy in the staging area. Exhaust Great Yew Bow and attached hero to make a ranged attack against that enemy. Declare attached hero as the attacker. No other attackers can be declared for this attack.\n\nquick strike:\nAction: Exhaust a character you control to immediately declare it as an attacker (and resolve its attack) against any eligible enemy target.\n\nhands upon the bow:\nAction: Exhaust a character you control with ranged to immediately declare it as an attacker (and resolve its attack) against an enemy in the staging area. It gets +1 [Attack] during this attack.\n\n \n\nBard the Bowman\n\n…\n\nWhen Bard the Bowman makes a ranged attack, the enemy he attacks gets -2 Defense until the end of the phase.\n\n\nAs an example, let's say you've got Dunhere and Bard the Bowman, each with Unexpected Courage (Bard the Bowman also has Great Yew Bow), and \"Big Enemy X\" is in the staging area. During the Combat Phase, you could play Upon the Bow on and Bard the Bowman and have him attack the \"Big Enemy X\". Then play Hands Quick Strike on Dunhere to have him attack \"Big Enemy X\". Ready each Hero with Unexpected Courage, then use Great Yew Bow with Bard the Bowman to attack the \"Big Enemy X\" a 3rd time. And finally use your normal declaration of attack on the \"Big Enemy X\" with Dunhere to attack him a 4th time.What defense does \"Big Enemy X\" have at Dunheres second attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780458","commentId":780458,"userName":"GrandSpleen","timestamp":1364895936,"content":"I think you are making a lot of assumptions about the rules.\n\nPESKPESK said:\n\nYou, as a player, are only allowed to declare one attack against each enemy during the Combat Phase.\n\n\n\nThe rules state that you are only allowed to declare 1 attack per enemy.  This is written under the section describing the combat phase, but does not mean that this rule is restricted to the combat phase.  I don't think you are able to declare more than one attack on an enemy per round, whether during the combat phase or not.  \n\nHowever, cards like Great Yew Bow, Quick Strike, and Hands Upon the Bow all include a declaration of attack as part of each card's effect.\n\nPESKPESK said:\n\nThey do not affect or in any way conflict with your normal ability to declare an attack.\n\n\n\nThat's the  bigger assumption.  Of course Great Yew Bow and other cards will consume your 1 allowed declaration.  Why wouldn't they?  The rules state you're allowed one declaration per enemy per round; the card requires you to declare the attack.  There's nothing written to suggest that these cards get around the 1 declaration restriction.\n\nIn my way of thinking, there are currently no cards that skirt this restriction.  Let's say you have some troll in the staging area.  Use Hands Upon the Bow to declare and attack with Legolas during the Questing phase.  Later, the troll engages you.  As I read this, you may not declare an attack against this troll during the Combat phase because you already declared an attack against him during Questing.\n\nThe wording in the manual is:\n\n\"Each player can declare an attack (with any number of eligible attackers he controls) against each enemy with which he is engaged once each round.\" (p 20)\n\nThe only ambiguous part is that which reads \"with which he is engaged.\"  You might take this to suggest that there is no limitation on declaring attacks against enemies with whom you are not engaged.  I think rather it is intended to limit eligible targets for attacks to those enemies engaged with you, rather than lift a restriction on attacking enemies not engaged with you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780469","commentId":780469,"userName":"PESKPESK","timestamp":1364898593,"content":"Cut from the last errata\n\n \n\n1.11) Limitations on Attacks When a player is the active attacker during the combat phase, the game rules grant him the option to declare 1 attack against each enemy with which he is engaged. If, through card effects such as ranged, a player is able to declare attacks against enemies with which he is not engaged, he is still only permitted a single attack against each of these enemies.\n\n \n\nCharacters are not limited as to how many times they can participate in attacks against the same enemy, provided each attack can be legally declared, and the character is ready and eligible to be declared as an attacker.\n\n \n\nThe above sections are in contradiction to each other, the question is what is legally declared?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780542","commentId":780542,"userName":"GrandSpleen","timestamp":1364910993,"content":"This comes up fairly frequently, and rightly so … it's kind of confusing!  This text is meant to describe limitations on attacks declared by players and attacks that characters participate in, regardless of who declared them.\n\nA player can only declare one attack per enemy per round.\n\nA character can participate in any number of attacks, with no limitations -- even against the same enemy.  \n\nSo, for example, in a 2-player game:\n\nPlayer 1 exhausts Silverlode Archer and Haldir of Lorien to declare and resolve an attack against Marsh Adder, who is engaged with Player 2.  This counts as Player 1's attack declaration against Marsh Adder -- Player 1 is not allowed to declare any more attacks vs. Marsh Adder.  Following the attack, Player 1 plays Ever Vigilant to ready Silverlode Archer.\n\nPlayer 2 then exhausts Boromir to declare an attack against Marsh Adder.  Player 1 exhausts Silverlode Archer to participate in this attack.  Even though Silverlode Archer has already attacked Marsh Adder on this round, this play is legal because Player 1 is not declaring the attack.\n\nIt doesn't  mean that you can declare multiple attacks against the same enemy-- only that characters can participate in attacks without limitations, as long as you can ready them and the attack can be legally declared."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780543","commentId":780543,"userName":"CJMatos","timestamp":1364911506,"content":"PESKPESK said:\n\n \n\nCut from the last errata\n\n \n\n1.11) Limitations on Attacks When a player is the active attacker during the combat phase, the game rules grant him the option to declare 1 attack against each enemy with which he is engaged. If, through card effects such as ranged, a player is able to declare attacks against enemies with which he is not engaged, he is still only permitted a single attack against each of these enemies.\n\n \n\nCharacters are not limited as to how many times they can participate in attacks against the same enemy, provided each attack can be legally declared, and the character is ready and eligible to be declared as an attacker.\n\n \n\nThe above sections are in contradiction to each other, the question is what is legally declared?\n\n \n\n \n\nThose sections are not contradictory…\n\n \n\nLet's see…\n\nSituation:\n\nPlayer A has Bard with UC, Descendant of Thorondor and Veteran Axehand ready;\n\nPlayer B has Legolas with UC, Longbeard Orc Slayer and Boromir ready;\n\nEnemy X is engaged with player A and enemy Y is engaged with player B;\n\n \n\nAction:\n\nPlayer A declares an attack against enemy X with all his characters, readies Bard with UC and player B joins with Legolas, and readied by UC;\n\nEnemy X is still allive after attack;\n\nPlayer B declares an attack against enemy X with Legolas and kills him;\n\nPlayer B declares an attack against enemy Y with his remaining characters and player A joins with Bard;\n\n \n\n \n\nThis is a situation where Legolas attacked the same enemy twice in one round and both attacks where legally declared;\n\n \n\nEDIT: did not see previous response"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780587","commentId":780587,"userName":"PESKPESK","timestamp":1364918871,"content":"Good, now that it’s sorted out how multiple attacks works. Let get back to my original question.\n\nWhat about Bard the Bowman and his -2 defense? Does it accumulate?\n\n \n\nExample situation:\n\n \n\nPlayer A has Bard the Bowman with Unexpected Courage and 2 other heroes.\n\nPlayer B has 3 heroes.\n\nPlayer C has Dunhere and 2 other heroes.\n\n \n\nEnemy X is the staging area.\n\n \n\nPlayer A declares an immediately attack against enemy X with hands upon the bow, Bard the Bowman is exhausted, Bard is readied with Unexpected Courage afterwards.\n\n \n\nEnemy X is still alive after attack;\n\n \n\nEnemy X engages player B\n\n \n\nPlayer B defends with a hero and the counter attacks Enemy X with another hero join by Bard the Bowman.\n\n \n\nEnemy X is still alive after attack;\n\n \n\nPlayer C plays  “A Light in the Dark” (Choose an enemy engaged with a player. Return that enemy to the staging area.) forcing Enemy X back the staging area.\n\n \n\nPlayer C declares an attack against enemy X with Dunhere. How much defense does Enemy X have now? X-4 or only X-2?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780627","commentId":780627,"userName":"CJMatos","timestamp":1364926663,"content":"PESKPESK said:\n\nGood, now that it’s sorted out how multiple attacks works. Let get back to my original question.\n\nWhat about Bard the Bowman and his -2 defense? Does it accumulate?\n\n \n\nExample situation:\n\n \n\nPlayer A has Bard the Bowman with Unexpected Courage and 2 other heroes.\n\nPlayer B has 3 heroes.\n\nPlayer C has Dunhere and 2 other heroes.\n\n \n\nEnemy X is the staging area.\n\n \n\nPlayer A declares an immediately attack against enemy X with hands upon the bow, Bard the Bowman is exhausted, Bard is readied with Unexpected Courage afterwards.\n\n \n\nEnemy X is still alive after attack;\n\n \n\nEnemy X engages player B\n\n \n\nPlayer B defends with a hero and the counter attacks Enemy X with another hero join by Bard the Bowman.\n\n \n\nEnemy X is still alive after attack;\n\n \n\nPlayer C plays  “A Light in the Dark” (Choose an enemy engaged with a player. Return that enemy to the staging area.) forcing Enemy X back the staging area.\n\n \n\nPlayer C declares an attack against enemy X with Dunhere. How much defense does Enemy X have now? X-4 or only X-2?\n\n\n\n \n\nGood question.\n\n \n\nOn the situation that you describe, I have no doubt that it is X-2. That because Hands upon the Bow doesn't say that the attack made is ranged.\n\n \n\nHowever if the attack was with Great Yew Bow, I would be in doubt if the Bard effect woul accumulate or not. I'd say not, but ……\n\n \n\nPS: note the different wording on Hands upon the Bow and Great Yew Bow;"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780693","commentId":780693,"userName":"GrandSpleen","timestamp":1364941030,"content":"So the real question is simply: is Bard's effect cumulative?  I think we were thrown off by the setup.  Even in the revised scenario above, the effect would not accumulate (as CJMatos notes, because the attack must be ranged.  Also, in the scenario above, Bard's first attack occurs before the combat phase, and his second during the combat phase.  His effect only lasts until the end of the phase.)\n\nBut to the question at hand: I'm inclined to say the effect is cumulative.  Can't think of any reason why it shouldn't be.  It would be like attacking with two different characters who have Rivendell Blades attached.  Or one character with two Rivendell Blades.  It also reminds me of Ever Vigilant + Faramir for willpower boosts.  Yeah, if you can get Bard to do more than one ranged attack in the same phase, I would say his effect is cumulative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81734-dunhere-bard-the-bowman-and-multiple-attacks/?do=findComment&comment=780894","commentId":780894,"userName":"CJMatos","timestamp":1364988410,"content":"Given the facts that GrandSpleen puts on the table, I think that the effect could cumulate, expecially because the 2 Rivendell Blades attached to the same character.\n\n \n\nBut in order to accumulate, all the attacks on the enemy needs to be on the same phase…"}]}