{"url":"https://community.fantasyflightgames.com/topic/81746-morgul-vale-new-preview/","title":"Morgul Vale; New Preview","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/81746-morgul-vale-new-preview/?do=findComment&comment=780484","commentId":780484,"userName":"Mattr0polis","timestamp":1364901089,"content":"Theoden seems pretty good.\n\nSteed of the Mark seems awful to me though, anyone agree? They keep making these cards, I think, to diminish the awesomeness of Unexpected Courage, but all they're doing is proving how over the top Unexpected Courage is, because they are all still worse than it (except Cram, which is insanely good). Why would I play this, unless there is other new cards coming that like pull mount cards or something? But even then, there's cards like Master of the Forge I can use for the Courages. You'll spend 2 blue resources right away and more in the long run, or could just spend 2 blue for Courage and unexhaust anytime, not just from questing. If this card was any color *but* blue it would maybe be better.\n\nAlso, the article was funny when it tried to make it seem like a hard time to use Dain. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81746-morgul-vale-new-preview/?do=findComment&comment=780573","commentId":780573,"userName":"Ellareth","timestamp":1364916696,"content":"I thought Steed of Mark was awsome.\n\nIt naturally goes well with Steward of Gondor, as SoG provides Gondor trait and resources while Steed of Mark consumes resource and requires Gondor or Rohan trait. Also works very well with Theodred which is a thematic bonus.\n\nSteed of Mark can be used with UC. I wouldn't mind being able to quest with Elrond, defend, and use ability of Vilya each and every turn.\n\nThis also shines some light on attachments that gives WP boost to heroes. With so many options now available for unexhausted questing method (Light of Valinor + Noldor, Steed of Mark), cards such as Favour of Lady (2 cost, +1 WP) may be on par with cards such as Wandering Took (2 Cost, +1/1/1/2 ally).\n\n \n\nYou are, of course, corret when you say UC is still better than Steed of Mark. But as they can be used at the same time, I find more option to ready heroes always welcome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81746-morgul-vale-new-preview/?do=findComment&comment=780690","commentId":780690,"userName":"GrandSpleen","timestamp":1364940104,"content":"If it were better than UC, this post would be about power creep.  Either way, this post would exist!"}]}