{"url":"https://community.fantasyflightgames.com/topic/81918-surge-vs-no-cards-left/","title":"Surge vs &quot;no cards left&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/81918-surge-vs-no-cards-left/?do=findComment&comment=781843","commentId":781843,"userName":"ruchlas","timestamp":1365188408,"content":"Hello guys,\n\nthere's what happened to me.\n\nIn the second stage of  \"We must away ere break of day\"  in Over Hill and Under Hill, we had the Key and the Purse but not travelled to the Cave. So we are left with three cards and in the Encounter Phase, at the last one, we face 'Surge\".\n\nMy question is did we lose immediatelly or we have to surge so the encounter deck goes from the beginning and we have our chance to find the Treasures?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81918-surge-vs-no-cards-left/?do=findComment&comment=781955","commentId":781955,"userName":"ruchlas","timestamp":1365219996,"content":"ruchlas said:\n\nMy question is did we lose immediatelly or we have to surge so the encounter deck goes from the beginning and we have our chance to find the Treasures?\n\n\n\n \n\nWrong wording.\n\nShould have said \"do we win immediatelly?\".  But of course without the Treasures it is more like a defeat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81918-surge-vs-no-cards-left/?do=findComment&comment=782039","commentId":782039,"userName":"GrandSpleen","timestamp":1365244351,"content":"If the encounter deck runs out of cards at any point during the quest phase, you have to shuffle the discard pile to refresh it.  \n\nWhen the conditions on a quest card are met for flipping it, it is typically flipped immediately.  I doubt, however, that this process would interrupt the staging step of the encounter phase, so I would say that the Surge keyword as the last card in the deck will replenish the whole encounter deck and extend the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81918-surge-vs-no-cards-left/?do=findComment&comment=782074","commentId":782074,"userName":"ruchlas","timestamp":1365253010,"content":"That is what I had in mind because the staging step is not completed untill Surge is resolved,\n\nbut the Quest Card says \"Any time\" instead of  \"After the staging step is completed\"  so it was pretty confusing.\n\nAnd it is not very unlikely to happen, because a large number of cards surges in the specific Quest.\n\nAny opposite opinions welcome!\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81918-surge-vs-no-cards-left/?do=findComment&comment=782314","commentId":782314,"userName":"leptokurt","timestamp":1365323381,"content":"In this case the game would be over. You draw the last card, the encounter deck is empty when you draw the last card. Which qualifies for \"any time\".\n\nIf you think that's not sepcific enough, you should think about Thalin's ability which triggers before any surge effect takes place. That implies that there is a small time window between adding an encounter card to the staging area and its surge effect.\n\n \n\nIn a normal game the encounter deck would be refreshed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81918-surge-vs-no-cards-left/?do=findComment&comment=782641","commentId":782641,"userName":"Nerdmeister","timestamp":1365402358,"content":"The game would be over immediately. This quest does have a few cards that reuse the discard pile to the bottom of the encounter deck. There is a treachery and a location, as I recall it. Our strategy, when the trolls have entered the arena, is to have that card replenishing location just sit in the staging area and add to the encounter deck. This buys us the time we need to set up for the treasure retrieval."}]}