{"url":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/","title":"Least Favorite Quest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=781882","commentId":781882,"userName":"Khamul The Easterling","timestamp":1365198723,"content":"What is your 3 least favorite quests? Put them in order from worst at the top and best of the worst at the bottom.\n\nHere's mine:\n\n \n\nRoad To Rivendell\n\nReturn to Mirkwood\n\nShadow and Flame\n\n \n\n \n\nWhat are yours? \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=781937","commentId":781937,"userName":"NotAZombie","timestamp":1365211732,"content":"Way to be a downer :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=781939","commentId":781939,"userName":"Glaurung","timestamp":1365212027,"content":"Emin Muil\n\nRoad to Rivvendell\n\nWatcher in the water\n\nDead marches\n\nActually all quest which is difficulty less then 6 in first and second cycle not deserve attention"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=781940","commentId":781940,"userName":"Glaurung","timestamp":1365212041,"content":"Emin Muil\n\nRoad to Rivvendell\n\nWatcher in the water\n\nDead marches\n\nActually all quest which is difficulty less then 6 in first and second cycle not deserve attention"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=781986","commentId":781986,"userName":"DurinIII","timestamp":1365229940,"content":"Ah, there are so many of them. Road to Rivendell (because of Sleeping Sentry). Shadow and Flame (because it's ridiculous). The Pelegar quests are annoying too because they are ridiculously hard. But, moving beyond the \"hard\" quests, I tend to not like the Gollum themed quests because I just don't care for Gollum very much. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=781999","commentId":781999,"userName":"DevastazioneH88","timestamp":1365233528,"content":"Shadow and Flame is my favourite…it's an awsome scenario…why don't you like it guys ?…\n\n \n\nas for my least favourite :\n\n \n\n1) Return to Mirkwood (too much luck involved when playing solo, if you get an attercop on turn one and your cards are bad or you don't have three attacking heroes you're dead, if you get gollum's bite during setup and have no 5 hp heroes you're dead, if you get the gollum's anguish and can't cancel it you're dead…I think I gave my point)\n\n2) We Must away ere Break of Day (it's a bit boring and lacks some action…very limited enemies)\n\n3)The Lonely Mountain - The Battle of Lake-Town (the idea is not bad but I really don't like when fights are so limited in a scenario, plus in the lonely mountin you have to build your deck focusing more on how cards match in cost, sphere etc then on real deckbuilding) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782002","commentId":782002,"userName":"leptokurt","timestamp":1365237336,"content":"1) Rhosgobel - I hate just everything about this adventure.\n\n2) Return to Mirkwood - because it had so much potential but they screwed it for solo players.\n\n3) The third adventure from Hobbit1 - that riddle mechanic is stupid."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782031","commentId":782031,"userName":"JonofPDX","timestamp":1365242537,"content":"1) Dungeons Deep and Caverns Grim (I HATE the riddle--bad design)\n\n2) Road to Rivendell (which may be more fun now that I regularly run Balin)\n\n3) Hunt for Golum (I don't mind Hills so much, but HfG Can take FOREVER if you get some bad draws--again, Balin might help though)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782042","commentId":782042,"userName":"lleimmoen","timestamp":1365244996,"content":"I quite dislike Khazad-dum. Never come back to it, it really did not capture the theme I was imagining, and it is little fun to play. I really like Anduin and Dol Guldur, Hunt, Carrock, Return to Mirkwood, Osgiliath is probably my favourite but Pelargir and Ithilien are also very interesting. I am not answering the question though; yeah, least favourite are Khazad-dum and some of the Dwarrodelf, Shadow and Flame is quite boring.\n\nNow that I have read the posts above, I agree about Rhosgobel. It is utterly weird to make a quest where having one or two cards (Healing Herbs and Lore of Imladris come to mind) make a difference between winning or losing; there should always be more ways about it; and you can win without the cards but with them it is way, way easier.\n\nI used to hate the riddles but I changed my mind; it can be frustrating but also fun. It was a great feeling winning it for the first time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782089","commentId":782089,"userName":"Khamul The Easterling","timestamp":1365256899,"content":"Thanks guys! These kinds of questions really interest me.  I love know what other peoples favorites and least favorites are.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782097","commentId":782097,"userName":"CJMatos","timestamp":1365257675,"content":"Haven't played all quest due to little time, missing HoN and Hobbit.\n\n \n\nFavourite is Journey down Anduin, Carrock, Rhosgobel and the last from Khazad-dum…\n\n \n\nDislike second from khazad-dum and the Road to Rivendel.\n\n \n\nAlso, had great fun in Massing at Osgiliath, mostly in 4 player (I know I'm crazy)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782123","commentId":782123,"userName":"Mr Coffee","timestamp":1365264611,"content":"While I like most of the \"themes\" for the encounter decks, I do have some dislikes based on the fact that I play primarly solo…\n\n \n\n1)  Return to Mirkwood:     … enough said.\n\n2)  Return to Mirkwood:    …. really hate this encounter.\n\n3)  Return to Mirkwood:    ….. starting to sense a pattern here???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782125","commentId":782125,"userName":"GrandSpleen","timestamp":1365265479,"content":"It really is a design problem that some quests scale so poorly.  \"Return to Mirkwood,\" \"A Journey to Rhosgobel,\" and \"Dungeons Deep and Caverns Dim\" get a lot of hate from solo players.  I never play solo, so these quests look very different from my perspective.  RtM and DDaCD are really fun for me.  Everyone's experience is different!  But, as this thread is about least favorites, I'll list mine, and then give reasons below for those who care to read:\n\n1) Into Ithilien \n\n2) Flight from Moria\n\n \n\nInto Ithilien -- feels to me like victory is too heavily dependent upon lucky encounter draw (kind of like Rhosgobel for solo players).\n\nFlight from Moria -- there are few cards available to deal with Treachery effects.  AToW can outright cancel \"When Revealed,\" and Eleanor can cancel at the danger of pulling a worse card.  There is a ton of treachery in this deck, but still most cards available in the card pool primarily enhance the player's ability to deal with locations and enemies.  We need some cards that mitigate treachery card effects without outright canceling them.  There is always gross encounter deck manipulation (Out of the Wild, Risk Some Light, etc), but I'm looking forward to cards that specifically target treachery in the future.  Until that kind of card becomes more available in the card pool, this is a quest that scales awfully for larger player groups.\n\nI couldn't find any other quests that I really don't enjoy.  I can have plenty of fun with all the others, I think!  Even the ones that beat me senseless, like The Siege of Cair Andros or Escape from Dol Guldur."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782179","commentId":782179,"userName":"nismojoe","timestamp":1365281850,"content":"Riddle Quest. \n\nWorst one.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=782781","commentId":782781,"userName":"rekath16","timestamp":1365426226,"content":"The worst and most ridiculous quest is Dungeons Deep and Caverns Dim. I also dont like Shadows & Flame and the annoying Hunt for Gollum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=783097","commentId":783097,"userName":"richsabre","timestamp":1365493463,"content":"previously as a solo card player i would have put dol guldur staight away, but given my 'conversion' to double handed playing i would say\n\nhobbit box 1, quest 3 (riddle one)\n\nreturn to mirkwood\n\nshadow and flame\n\nrich\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=783130","commentId":783130,"userName":"Khamul The Easterling","timestamp":1365499780,"content":"So you're done playing solo rich?!?!  What do you think of two handed? Liking it? Are you going to switch back to solo ever?\n\nThanks\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=783134","commentId":783134,"userName":"Ted Sandyman","timestamp":1365500309,"content":"Thats like saying; Pick your least favourite out of these:\n\n                                 Beer\n\n                                 Women\n\n                                 Football (soccer)\n\n                                 Chinese food\n\n \n\nJust embrace them all for what they are."},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=783913","commentId":783913,"userName":"richsabre","timestamp":1365668686,"content":"Khamul The Easterling said:\n\nSo you're done playing solo rich?!?!  What do you think of two handed? Liking it? Are you going to switch back to solo ever?\n\nThanks\n\nKhamul\n\n\n\nsorry for the late reply….had my head buried in physics for far too long to be good for me haha\n\nthe answer i think is yes…..i am pretty much done playing solo handed\n\nits wierd saying that since i ferociously defeneded solo right from the start…i lost count of the arguments i had saying this game holds up on its own for solo….\n\nand it does. im not saying different to that, its just a close friend introduced me to two handed and i realised just what i was missing out on the relationship between decks…ranged/sentinel etc.\n\ni also love being able to make an absolute killer tactics deck to go with a questing deck….something you cant yet do in solo\n\nso yes..im converted :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=783998","commentId":783998,"userName":"Khamul The Easterling","timestamp":1365685698,"content":"I think it would be wierd to have two hands of cards that you are looking at at the same time.  I't also would require lots more thinking and time during turns.  And you wouldn't get a suprise of what the other player would be playing.  BUt the good things are that you would be able to see lots more encounter cards and you could like you said use all the ranged and sentinal.(I'm thinking Haldir right now) So are these assumptions true?  \n\n \n\nKhamul\n\nP.S. Tried Brand yet??? What do you think of him now??\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=784024","commentId":784024,"userName":"richsabre","timestamp":1365690212,"content":"Khamul The Easterling said:\n\nI think it would be wierd to have two hands of cards that you are looking at at the same time.  I't also would require lots more thinking and time during turns.  And you wouldn't get a suprise of what the other player would be playing.  BUt the good things are that you would be able to see lots more encounter cards and you could like you said use all the ranged and sentinal.(I'm thinking Haldir right now) So are these assumptions true?  \n\n \n\nKhamul\n\nP.S. Tried Brand yet??? What do you think of him now??\n\n \n\n\n\nyeah you certainly get to see more cards, and thats good given the amount that is out so far. i dont really mind the double thinking. i tend to get into a RP style mind when i play anyways so its just the same with two hands\n\ni actually liked brand even as a solo player, he is very 'well rounded' stats wise, and yes, he is even better in coop!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/81921-least-favorite-quest/?do=findComment&comment=784235","commentId":784235,"userName":"CaffeineAddict","timestamp":1365775659,"content":" \n\nThough i occasionally dabble in \"two-handed\" play, I'm mainly a solo player, so my least favourites are based on what doesn't work well solo:\n\n \n\nRhosgobel. Worst quest ever, in my opinion. I don't mind quests that are ridiculously hard, but possible, but I severely dislike quests that require you to play certain cards to stand a chance. This takes all the fun out of deckbuilding.\n\n \n\nThe riddle quest. Don't get me wrong, I've built decks specifically for it, and had fun playing it, but similar to Rhosgobel, you need to tailor your deck specifically for it.\n\n \n\nDol-Guldur. I've beaten this solo once, out of dozens of attempts. Once. And I don't mind admitting that was due o incredibly lucky draws from my deck, and a **** bad one for the encounter deck. This just doesn't scale properly between solo and multiplayer.\n\n \n\nIf i could nominate a fourth, it would be return to mirkwood - the threat acceleration just doesn't scale well for solo play.\n\n \n\nUnlike a lot of others, it would seem, I like shadow and flame, road to rivendell, and the heirs quests. They're very hard, sure, but that just makes victory sweeter."}]}