{"url":"https://community.fantasyflightgames.com/topic/82010-hobbit-expansions/","title":"Hobbit expansions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82010-hobbit-expansions/?do=findComment&comment=782524","commentId":782524,"userName":"rhtm70","timestamp":1365373329,"content":"A quick question from a new player. Do I need to buy the first Hobbit expansion in order to play the second one or is On the Doorstep good enough? Also, do I need to buy Battle of Lake-Town in order to play either of them? Thanks for the assistance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82010-hobbit-expansions/?do=findComment&comment=782531","commentId":782531,"userName":"ricedwlit","timestamp":1365375213,"content":"You can play On The Doorstep without owning Over Hill, Under Hill.  Likewise you can play Battle of Lake Town without owing either of the Hobbit expansions.\n\nThat said, if you truly want to experience an overall Hobbit experience, then I would say own all three. This would allow you to pick a set of heroes to use for the six adventures in the Hobbit boxes (assuming you want to find and keep treasures) and then have the additional thrill of building separate deck(s) for the Battle of Lake Town (assuming you want to be true to the original story)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82010-hobbit-expansions/?do=findComment&comment=782639","commentId":782639,"userName":"Nerdmeister","timestamp":1365401687,"content":"Having Sting handy for Spies & Flighters (or is that Flies & Spiders ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]) and Battle of Five Armies is something that you will come to appreciate.\n\nYou CAN play \"on the doorstep\" without \"over hill and under hill\". I just wouldn´t do it :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82010-hobbit-expansions/?do=findComment&comment=782745","commentId":782745,"userName":"JonofPDX","timestamp":1365421143,"content":"While the two Hobbit boxes are technically separate and can both be played with just a core set, they are much better together (if for no other reason than the card pool). The narrative of playing all six in sequence is pretty neat.\n\n \nWorth noting as you are a newer player--Laketown is a GenCon challenge scenario. It has no player cards and is intentionally VERY hard. I don't know that it is beatable without access to a wider selection of cards than those that come in the hobbit boxes (don't know what your card pool is like). I think it's fair to say it's one of the hardest scenarios they've ever put out. "}]}