{"url":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/","title":"Neutral Asfaloth?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783399","commentId":783399,"userName":"Caranfea","timestamp":1365559043,"content":"I'm possibly missing something here, but shouldn't the \"Asfaloth\" attachment be neutral, and not lore? As there are more than one version of Glorfindel in the game, and Asfaloth being Glorfindel's steed…it's a bit of a stretch to play with spirit Glorfindel as a starting hero, and then need to build Lore into my deck in some convoluted fashion, just so that I can include his horse.  I understand that I can include song of this or that to get Asfaloth into play, but has anyone found a more succinct way to get \"spirit\" Glorfindel's horse attached to him? \n\nThanks,\n\nC."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783400","commentId":783400,"userName":"Caranfea","timestamp":1365559389,"content":"P.s. I understand that Spirit/lore are a common marriage, just trying to step away from that and play with spirit Glorfindel and his horse without gumming up my deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783412","commentId":783412,"userName":"Nerdmeister","timestamp":1365562554,"content":"I´m fairly confident that Asfaloth wasn´t made lore by mistake :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nYou can still use the ability on a non-Glorfindel hero, he just works better when paired with his master.\n\nBy that same token you could claim that A Burning Brand should be tactics or leadership since they have the best defenders.\n\nThough I´m not too concerned by those restrictions myself since I play the game with a partner and we usually split the colors between us and agree on a mutually beneficial strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783477","commentId":783477,"userName":"DurinIII","timestamp":1365582661,"content":"Yeah. I think the Lore Glorifindel is ment to be \"The Flight to the Fords\" Glorifindel, in other words, passively riding through the forest, while the Spirit Glorifindel is meant to be the \"Battle of Pelenor Fields\" Glorifindel, in other words, not riding around on Asfaloth. Mechanically speaking, if Asfaloth was neutral, it would only further make the Spirit Glorifindel better than the Lore one, because right now the Lord Glorifindel has an advantage paying for Asfoloth where the Spirit Glorifindel does not. Regardless, I think they designed it this way for a reason. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783505","commentId":783505,"userName":"Dam the Man","timestamp":1365585623,"content":"DurinIII said:\n\nwhile the Spirit Glorifindel is meant to be the \"Battle of Pelenor Fields\" Glorifindel, in other words\n\n\n\nThe what now?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783514","commentId":783514,"userName":"CJMatos","timestamp":1365586883,"content":"Dam said:\n\n \n\nDurinIII said:\n\n \n\nwhile the Spirit Glorifindel is meant to be the \"Battle of Pelenor Fields\" Glorifindel, in other words\n\n \n\n \n\nThe what now?\n\n \n\n \n\n \n\nCertainly not \"Pelenor Fields\" (the great battle in the Return of the King) but the war of the Last Alliance (took place where at the Third Age is the Dead Marshes).\n\n \n\nAs to the topic, probably they done Asfaloth Lore to give an advantage to Lore Glorfindel;"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783538","commentId":783538,"userName":"JonofPDX","timestamp":1365590708,"content":"Yeah--it's kind of been said but they do the mismatched sphere thing as a means of controlling power creep (or diversifying it at least).\n\n \nPersonally, I think spirit Glorfindel is still a bit OP. Would have been better as a tactics hero (more thematic too, both in game as tactics would be penalized for questing and lore-wise as Glorfindel was a bad ass warrior). That would force you to run Spirit, Tactics, AND Lore at the table to get the most out of him, which would bring his power level down a little.\n \nI think the only reason they went spirit was they were still  trying to make secrecy work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783615","commentId":783615,"userName":"lleimmoen","timestamp":1365604426,"content":"Glorfindel did ride to battle, as in the battle in the North against the Witch-king; I was thinking Asfaloth would grant battle advantage but they took a different approach, thus making it Lore makes sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82133-neutral-asfaloth/?do=findComment&comment=783880","commentId":783880,"userName":"DurinIII","timestamp":1365662018,"content":"You guys are absolutely right, I mispoke horribly. I got Glorifindel confused with Elrond's sons Ellohir and Elladain."}]}