{"url":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/","title":"Core Set Upgrade Pack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784429","commentId":784429,"userName":"ma_Rysia","timestamp":1365833443,"content":"Hi,\n\nIs there any plans to release a some kind of upgrade pack to the Cor Set that will contain additional copies for card that was included in amount less than 3 in Core Set, so it would be possible to have tree copies of each card in deck without bying tree core sets. From my canclution it should contain 63 card (including 2 additional copies of Gandalf to make 6 of them).\n\nCard list (number in core set x count):\n\n14x1 15x1 17x1 18x1 19x2 20x1 21x1 22x1 23x1 24x1 25x1 26x1 27x1 30x1 31x2 33x1 34x1 35x1 36x1 37x2 38x2 39x1 40x1 41x1 42x2 43x1 45x1 46x1 47x1 48x1 49x1 52x1 53x2 54x2 55x1 56x1 57x2 59x1 60x2 61x1 62x1 64x1 65x1 66x1 67x1 68x2 69x1 70x1 71x2 72x1 73x2"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784434","commentId":784434,"userName":"richsabre","timestamp":1365833782,"content":"in short…no\n\nthats something alot of players would want, and have asked for, but i dont see it happening.\n\ni would certainly pay for a small pack of extra cards that werent included in the core set….most players however have gone with getting an extra core set\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784498","commentId":784498,"userName":"Rapier1","timestamp":1365849644,"content":"Personally I'm hoping they create a \"3+4\" player expansion box in the future. That includes reprints of the missing cards from the core + 3 new quests, new heroes and cards all designed with making the game work better with more people. (Which is currently encourged by just buying a second core).\n\n \n\nI'd love a little upgrade pack, but I'm certain it won't happen, and I think it's a shame because buying multiple copies of the core in this game is more wasteful than in any other LCG. (Mainly because you have 0 use for repeat encounter cards)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784499","commentId":784499,"userName":"richsabre","timestamp":1365849910,"content":"Rapier said:\n\n \n\nPersonally I'm hoping they create a \"3+4\" player expansion box in the future. That includes reprints of the missing cards from the core + 3 new quests, new heroes and cards all designed with making the game work better with more people. (Which is currently encourged by just buying a second core).\n\n \n\nI'd love a little upgrade pack, but I'm certain it won't happen, and I think it's a shame because buying multiple copies of the core in this game is more wasteful than in any other LCG. (Mainly because you have 0 use for repeat encounter cards).\n\n \n\n \n\ni think that would annoy alot of players, me incuded. the majority of players play solo only, 2 player only, or a mix of both. there are few who go into the 'group' amounts. i would support the idea of giving group players more, but i dont beleive this game should go into the direction of content that only certain people can buy. the job the game designers is to include everyone of their players as much as possible\n\nrich\n\nPS. on reading that, i realise it sounds very dismissive of 3-4 players….thats not what i mean by the above. i think people who play in 3-4 should get content, as we all should…i just dont want content i 'cant buy' becuase i dont know anyone who plays this game (or have a game place near me)\n\nPPS perhaps they could have 'player packs' each designed to your player amount….so i 'solo pack' a '2 player pack'  and a '3-4 player pack' each with cards specific to your style….then players could buy all 3 (great for ffg right?) and then when they play solo they can utilise the solo cards, and when they have friends round they can use the multi ones"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784501","commentId":784501,"userName":"Rapier1","timestamp":1365851196,"content":"richsabre said:\n\nRapier said:\n\n \n\nPersonally I'm hoping they create a \"3+4\" player expansion box in the future. That includes reprints of the missing cards from the core + 3 new quests, new heroes and cards all designed with making the game work better with more people. (Which is currently encourged by just buying a second core).\n\n \n\nI'd love a little upgrade pack, but I'm certain it won't happen, and I think it's a shame because buying multiple copies of the core in this game is more wasteful than in any other LCG. (Mainly because you have 0 use for repeat encounter cards).\n\n \n\n \n\ni think that would annoy alot of players, me incuded. the majority of players play solo only, 2 player only, or a mix of both. there are few who go into the 'group' amounts. i would support the idea of giving group players more, but i dont beleive this game should go into the direction of content that only certain people can buy. the job the game designers is to include everyone of their players as much as possible\n\nrich\n\nPS. on reading that, i realise it sounds very dismissive of 3-4 players….thats not what i mean by the above. i think people who play in 3-4 should get content, as we all should…i just dont want content i 'cant buy' becuase i dont know anyone who plays this game (or have a game place near me)\n\nPPS perhaps they could have 'player packs' each designed to your player amount….so i 'solo pack' a '2 player pack'  and a '3-4 player pack' each with cards specific to your style….then players could buy all 3 (great for ffg right?) and then when they play solo they can utilise the solo cards, and when they have friends round they can use the multi ones\n\n\n\n \n\nA focus on 3 and 4 player, doesn't mean 3 and 4 player only : I only play 2 player. I just don't think the game works at 3+ at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784503","commentId":784503,"userName":"gatharion","timestamp":1365852445,"content":"While I would very much love to have more copies of those really good cards from the core set, the available card pool is so large now that I'm okay with out them. \n\nWhat I really want though, is another pair of threat trackers (and maybe extra tokens) that I can get without having to buy another core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784513","commentId":784513,"userName":"klaymen_sk","timestamp":1365855984,"content":"I'm sure many people (including myself) will buy it. But many will be probably annoyed too. (\"I had to shell out extra $60 for two core sets with a lot of unusable extra cards and you get only what you missed! FFFFFFUUUUUUUUUUU!\")\n\n \n\nAnyways, if FFG wanted to do it, they'd do it a long time ago. Also, it is still better than Warhammer: Invasion, where if you want to own 3 copies of all cards, you have to buy even the first cycle and deluxe expansion, in addition to *just* three core sets…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784518","commentId":784518,"userName":"richsabre","timestamp":1365859358,"content":"klaymen_sk said:\n\nI'm sure many people (including myself) will buy it. But many will be probably annoyed too. (\"I had to shell out extra $60 for two core sets with a lot of unusable extra cards and you get only what you missed! FFFFFFUUUUUUUUUUU!\")\n\n \n\nAnyways, if FFG wanted to do it, they'd do it a long time ago. Also, it is still better than Warhammer: Invasion, where if you want to own 3 copies of all cards, you have to buy even the first cycle and deluxe expansion, in addition to *just* three core sets….\n\n\n\nyeah i dont feel so bad only owning 1 core set….at least everything after has been constant 3 copies. perhaps ffg will include them in a 3rd edition of the core set or something…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784533","commentId":784533,"userName":"GrandSpleen","timestamp":1365863359,"content":"richsabre said:\n\n the majority of players play solo only, 2 player only, or a mix of both. there are few who go into the 'group' amounts. \n\n\n\nRefering to your poll about this, right?  I still maintain that \"players who answer posts on game-related forums\" is NOT a representative sample of players who play the game.  I don't think it's worth drawing conclusions from that… even in this day and age there are plenty of people who play the games without seeking out the message boards :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nTo the topic at hand, I'd be happy with a core set upgrade pack. FFG has already shown us that they are not afraid to sell a product that targets only a portion of their player base (nightmare packs).  I sort of doubt that we'll ever see a pack that specifically fills the gaps left by the core set, by I imagine we'll continue to see releases that target groups.  It's marketed as a \"cooperative\" game, after all!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784565","commentId":784565,"userName":"richsabre","timestamp":1365870171,"content":"GrandSpleen said:\n\n \n\nrichsabre said:\n\n \n\n the majority of players play solo only, 2 player only, or a mix of both. there are few who go into the 'group' amounts. \n\n \n\n \n\nRefering to your poll about this, right?  I still maintain that \"players who answer posts on game-related forums\" is NOT a representative sample of players who play the game.  I don't think it's worth drawing conclusions from that… even in this day and age there are plenty of people who play the games without seeking out the message boards :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\n \n\ncorrect. do not misunderstand me, i know how statistics work…i study degree level advanced mathamatics. i am not saying my rather pathetic poll of surely  far <1% of the player base who answered is representative of the whole player base….what i am saying is that if you extrapolate that, and assume (yes, rather boldy…) that those who answered form a nice mixture of players, then you can see that the 1-2 player majority holds true\n\n \n\nnow as i remember you pointed out last time i brought it up, holding the poll of here is a rather biased affair….for a start more players are on bgg, and there are many players who dont even visit a forum…however i still hold to my original point, more players play 1-2 players than 3-4, and this shows in ffg's designing\n\nperhaps i should re do the poll, or even on bgg…perhaps ffg should do an official one…one that can circulate around better, i mean it must be useful for design research :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] . however until that happens, i think im correct in saying that my littie poll is the only data we have to work on….hence the rather unrealistic and completely unscientific extrapolation i mention above\n\nlook at it this way….it is harder to find 2 extra players to join you than 1 or none…many players have their partners join them….many europeans like myself are rather isolated in their local player bases compared to americans\n\n…however, having said all that, i completely agree with you..had this been a matter brought to me in my scientific work, i would dismiss the poll immediatly….however i need to take time off occasionally :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784578","commentId":784578,"userName":"Rapier1","timestamp":1365874625,"content":"I don't see how we're not seeing more support for 2+ players? (I don't really think their's much of a meaningful distinction between 2 and 3 in terms of how you'd design a card. There's no elegant way to say the players that aren't first and last player do X).\n\nI think we definitely see a bias in that some cards exist for multiplayer but no cards exist that benefit the single player.  What I was getting at is that the second core set is meant to be to play 3 and 4 player. But all it really does is increase the card pool and provide two more threat counters (+ more tokens).\n\nI would much prefer a dedicated 3-4 player expansion which came with threat counters and tokens but a new card pool and 3 more quests (charging the same price as the base game).\n\n \n\nIn such an expansion I would like to see the quests a little more focused on a 3 and 4 player dynamic, but not necessarily to the exclusion of less than three players. I would also like to see it get the missing cards from the first core set (just for completelness sake, and because printing them like that is more cost viable for FFG, most people will buy the new set because they want the new cards, reprinting some cards to \"complete\" the set will actually make the set cheaper to produce).\n\n \n\nI think this is more likely to get than a pack of 30 cards or whatever it is that's missing from the core, to make it a complete play set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82278-core-set-upgrade-pack/?do=findComment&comment=784588","commentId":784588,"userName":"richsabre","timestamp":1365878599,"content":"on that note i actually contacted ffg….this was after half way through dwarrowdelf we got a pack in which half of the player cards were useless to solo play (but great for coop play…which i later found out…but thats another story) and i was concerned that solo wasnt getting enough attention…so i can understand where you are coming from\n\nthe ffg guys were good enough to get back to me saying that every player amount would recieve different amount of attention at different times, but their goal is of course to make them all well built upon…something which ended up happening with solo play, but as you say…3/4 is still lacking\n\nrich"}]}