{"url":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/","title":"I Like Second Breakfast","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=784956","commentId":784956,"userName":"lleimmoen","timestamp":1365988268,"content":"I just want to show my support to Caleb and ffg for making the Second Breakfast periodic. I think it is nice of you to share thoughts behind deck-building, and I am especially looking forward to decks with the upcoming player cards. I have run similar decks to those previewed, especially the Rohan deck, so it is great to compare with one of the designers. I think it is safe to say I am among many whose anticipation for the Against the Shadow cycle is great, and the packs cannot begin coming our way soon enough. Keep up the wonderful game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=785016","commentId":785016,"userName":"Narsil0420","timestamp":1365999924,"content":"I just used the two decks with my brother. We played against Massing at Osgiliath and had a blast! The decks worked really well and I got the most use I ever have, out of the Great Yew Bow. (I think Massing is particularly suited to low threat/archery strategy). It really made the scenario seem like a walk in the park, Legolas/Bard/Glorfindel/Gandalf (plus some attachment help) took out the Nazgul in one swing! And Rohan rode to Minas Tirith, LIKE A BOSS."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=785019","commentId":785019,"userName":"lleimmoen","timestamp":1366000762,"content":"I think there is no other quest that punishes you as much for starting with higher threat as Osgiliath, and rewards you for doing otherwise. Not even Return to Mirkwood, because there your higher threat is usually justified by higher starting stats - and quickness is most needed. In Osgiliath, it seems best to build up your forces whilst staying below 27 to avoid the Wolves. It is perfect not to deal with them at all, just keep them in the staging area, their threat is 1 but their shadow effect (if recycling them) can be devastating. This Rohan deck was the first I beat it with about a year ago, I think it must have had 85% of the cards in it (as there is really not that many options for the three heroes in question)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=785023","commentId":785023,"userName":"lleimmoen","timestamp":1366001297,"content":"As for the Archer deck, I played with the idea of having Bifur instead of Brand. Yes, it would only mean one archer but it has quite a few advantages too: lower starting threat (by 4!), access to Master of the Forge (to fish for all attachments, including the essential weapons), and access to cards like Ranger Spikes to prevent enemies from engaging; not to mention Asfaloth for Glorfindel. Solo, it did handle some quests very well (at Osgiliath in particular I felt like it could not lose to), but of course some quests were hard. It could be a good supporting deck but it'd need the other deck to go with it very well (like the Rohan deck)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=785031","commentId":785031,"userName":"richsabre","timestamp":1366004637,"content":"i would also like to add my thanks to caleb, its great that they have time to share their deck building ideas with us, despite all the playtesting/ desiging and so on they have to do\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=785219","commentId":785219,"userName":"Ellareth","timestamp":1366038208,"content":"An article that introduces deck using single core set refocusing on Rohan themed deck just before diving into Gondor themed Cycle?\nSeems like exactly what we needed/wanted.\n\nme likes it XD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=785784","commentId":785784,"userName":"MikeTangoGolf","timestamp":1366142076,"content":"I agree.  Hats off to Caleb, and FFG in general, for the high level of engagement they maintain with the player community.\n\nAs a side note, I really like the strategy of keeping threat low and stealthily killing enemies in the staging area.  I'm really glad to see the game's designer does as well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82353-i-like-second-breakfast/?do=findComment&comment=785861","commentId":785861,"userName":"lleimmoen","timestamp":1366166324,"content":"Titanium said:\n\nAs a side note, I really like the strategy of keeping threat low and stealthily killing enemies in the staging area.  I'm really glad to see the game's designer does as well!\n\n\n\nIt is currently my favourite strategy also; it is just considerably harder with the battle-and-siege mechanic, as the heroes with higher attack strength tend to also have higher starting threat and not belong to the spheres with access to threat reduction; Glorfindel is just one shiny exception here again."}]}