{"url":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/","title":"AtS Heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785366","commentId":785366,"userName":"Samwise Gamgee","timestamp":1366059840,"content":"It is my opinion that speculation and conjecture offer some of the most interesting reading. I also think that the delay of the AtS Adventure Cycle has presented a great opportunity for just that.\n\nI put forth the challenge to try and guess the four remaining heroes of the cycle. We will see who has the most foresight or luck amongst us.\n\n * The Steward’s Fear – Denethor (Leadership) – One, it’s called The STEWARD’s Fear. Two, it’s based in Minas Tirith. Three, it’s a wild guess.\n * The Drúadan Forest – Ghân-buri-Ghân (Lore) – Chieftain of the Drúedain? Anybody? Well if not, maybe as an ally.\n * Assault on Osgiliath – Faramir (Tactics) – The long-awaited son of Gondor makes his debut in retaking Osgiliath with his brother.\n * The Blood of Gondor – Sam (Spirit) – Hunting through forest roads of Ithilien on the way to Mordor? Sounds like a perfect place to find another hobbit. Also, if you are going to be building a hobbit deck, you want more variety than just three hobbit heroes. Merry isn’t going to show his face till the Rohan cycle, so it’s got to be Sam, right? (So the emergence of Sam might be a stretch, but look at the handle… I have some bias)\n\nWell there are my guesses and feel free to critique them. Let’s hear your guesses. Bonus points for sphere and game mechanics/stats.\n\nP.S. – I also tried to justify any other sphere for Sam, but couldn’t do it. I think leadership and tactics deserve some hobbits, but I am not sure if Sam would fit the bill (no, not the pony). I bet if you stretched, you could make a tactics argument. Any ideas of who the leadership/tactics hobbits would be if there were any?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785441","commentId":785441,"userName":"klaymen_sk","timestamp":1366076584,"content":"Your Denethor and Faramir make perfect sense. Ghân-buri-Ghân is too quite possible, but I highly doubt about Sam. At this point (several years before War of the Ring) he is just some random Hobbit living in the Shire, however Frodo is the same and yet he exists in game already. I'd say some lesser lord or commander may appear, just like Dúnhere in the Core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785454","commentId":785454,"userName":"lleimmoen","timestamp":1366082132,"content":"Yes, I like these. Off the blocks, I think the spheres for the heroes for HoN & AtS will be Tactics (Beregond), Leadership (Boromir), Lore, Spirit, Spirit (Pippin), Lore, Leadership, Tactics (Théoden). I think it will thus mirror SoM & KD in a way (there it was Lore, Spirit, Leadership, Tactics, Tactics, Leadership, Spirit, Lore). I'd had this already in mind before Théoden was previewed and that just confirmed my speculation. So I don't think we'll see more Tactics.\n\nThen, if we are to see another Hobbit, my guess would surely go to Merry, probably as a Lore hero, he seemed to play that role (on a Hobbit level) in the books.\n\nThen I have another speculation which has thus far been true, and that when a character comes in a different type (ally and hero or vice-versa) he keeps the sphere (Beorn, Bifur, Dwalin, Gloin), but when he comes in the same type for the second time the sphere changes (Aragorn, Glorfindel, Boromir or Bofur). Now that leads me to believe Faramir hero will be Leadership, which would also make most sense for the Leadership Gondor deck that is on the cards (designers have confirmed many times they're pushing for mono-sphere decks, and Gondor has already Leadership Boromir and Imrahil most fit to represent that). I would hope Faramir steps into the role with a lower threat cost. If you take his stats from the ally version (2 willpower, 1 attack, 2 defence, 3 hit points), his threat cost could be 8, and his ability boost defence for Gondor allies; you've got Boromir boosting attack, Faramir defence, and Visionary Leader for willpower.\n\nThe above speculation, however, doesn't support my sphere distribution speculation because of one thing: in the Assault on Osgiliath (pack 4 of AtS) preview, it was all but confirmed that Faramir hero arrives in that adventure.\n\nI am also not sure about Denethor, whether we see him as a hero again or not, but I actually hope so because the core-set version has a very specific role (much more competent in a solo play) and rather strange art (I do like the picture, Denethor's face just looks a bit too creepy in that).\n\nOh, and I'd love to see Ghan-buri-Ghan but I'm afraid the Woses are mentioned to be enemies in the preview; something I don't like at all. Perhaps players will first have to get friendly with them before they become allies? I'd like to see Ghan as a hero but I doubt it very much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785480","commentId":785480,"userName":"GrandSpleen","timestamp":1366088169,"content":"Since the Dwarrowdelf cycle brought us a bunch of elves and a man of Rohan, I reckon the Gondor cycle will deliver to us the long-awaited Ent and Eagle hero series!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785508","commentId":785508,"userName":"lleimmoen","timestamp":1366097714,"content":"GrandSpleen said:\n\nSince the Dwarrowdelf cycle brought us a bunch of elves and a man of Rohan, I reckon the Gondor cycle will deliver to us the long-awaited Ent and Eagle hero series!\n\n\n\nI think most people appreciate there were no more Dwarves in the Dwarrodelf cycle, there is 10 on them now altogether. All other factions drag behind, and one of them is Gondor, so I expect to get at least two more of their heroes in the AtS."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785569","commentId":785569,"userName":"richsabre","timestamp":1366106512,"content":"ive said this since the cycle's preview (before we knew we were getting them) but i think more hobbits. i think they shall at least have the development of the eagles by the time it is done\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785595","commentId":785595,"userName":"GrandSpleen","timestamp":1366110450,"content":"I agree about more Hobbits.  Frodo and Bilbo came back to back, and I think we might see our upcoming Pippin sharing close company with a certain Brandybuck…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785602","commentId":785602,"userName":"Samwise Gamgee","timestamp":1366111732,"content":"richsabre said:\n\nive said this since the cycle's preview (before we knew we were getting them) but i think more hobbits. i think they shall at least have the development of the eagles by the time it is done\n\nrich\n\n\n\nSo when you say more hobbits, how many you were thinking? Also what do you mean by development of the eagles? Heroes, allies, attachments, events…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785608","commentId":785608,"userName":"richsabre","timestamp":1366112220,"content":"Samwise Gamgee said:\n\nrichsabre said:\n\n \n\nive said this since the cycle's preview (before we knew we were getting them) but i think more hobbits. i think they shall at least have the development of the eagles by the time it is done\n\nrich\n\n \n\n \n\nSo when you say more hobbits, how many you were thinking? Also what do you mean by development of the eagles? Heroes, allies, attachments, events…\n\n\n\ni was actually thinking more about player cards in both cases…now i look at your post title i see my reply may be a little off topic :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nbut yes, in general i mean by the end of the cycle i expect to have a good 5-6 of each allies, events and attatchments\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785616","commentId":785616,"userName":"Pharmboys2013","timestamp":1366113711,"content":"It seems the general sense is that we will receive a new Denethor, a hero Faramir, either Merry or Sam, and then ????. \n\nI think a potential hero could be Eomer. He's the last significant Rohan hero we have yet to see plus we have already seen how this cycle seems to be pushing a collaboration of Gondor and Rohan through cards like mutual accord, the inclusion of Theodan, and the associated mount. One thing that seems to conflict this however would be his sphere of influence. It would be hard to imagine he would be anything other than tactics of leadership but we have already received both of those spheres in HoN and will likely see them in the other APs through Theodan and likely the new Denethor. I suppose one could argue he could fit in Spirit but I personally would find that surprising "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785617","commentId":785617,"userName":"CJMatos","timestamp":1366113720,"content":"lleimmoen said:\n\n \n\nYes, I like these. Off the blocks, I think the spheres for the heroes for HoN & AtS will be Tactics (Beregond), Leadership (Boromir), Lore, Spirit, Spirit (Pippin), Lore, Leadership, Tactics (Théoden). I think it will thus mirror SoM & KD in a way (there it was Lore, Spirit, Leadership, Tactics, Tactics, Leadership, Spirit, Lore). I'd had this already in mind before Théoden was previewed and that just confirmed my speculation. So I don't think we'll see more Tactics.\n\nThen, if we are to see another Hobbit, my guess would surely go to Merry, probably as a Lore hero, he seemed to play that role (on a Hobbit level) in the books.\n\nThen I have another speculation which has thus far been true, and that when a character comes in a different type (ally and hero or vice-versa) he keeps the sphere (Beorn, Bifur, Dwalin, Gloin), but when he comes in the same type for the second time the sphere changes (Aragorn, Glorfindel, Boromir or Bofur). Now that leads me to believe Faramir hero will be Leadership, which would also make most sense for the Leadership Gondor deck that is on the cards (designers have confirmed many times they're pushing for mono-sphere decks, and Gondor has already Leadership Boromir and Imrahil most fit to represent that). I would hope Faramir steps into the role with a lower threat cost. If you take his stats from the ally version (2 willpower, 1 attack, 2 defence, 3 hit points), his threat cost could be 8, and his ability boost defence for Gondor allies; you've got Boromir boosting attack, Faramir defence, and Visionary Leader for willpower.\n\nThe above speculation, however, doesn't support my sphere distribution speculation because of one thing: in the Assault on Osgiliath (pack 4 of AtS) preview, it was all but confirmed that Faramir hero arrives in that adventure.\n\nI am also not sure about Denethor, whether we see him as a hero again or not, but I actually hope so because the core-set version has a very specific role (much more competent in a solo play) and rather strange art (I do like the picture, Denethor's face just looks a bit too creepy in that).\n\nOh, and I'd love to see Ghan-buri-Ghan but I'm afraid the Woses are mentioned to be enemies in the preview; something I don't like at all. Perhaps players will first have to get friendly with them before they become allies? I'd like to see Ghan as a hero but I doubt it very much.\n\n \n\n \n\n \n\nBut if your thoughts on the spheres are correct, then the first hero of the AtS cycle will not be Denethor (he is Lore on the Core version) you say that the first hero will be Lore and when we have a different version of one hero it changes sphere.\n\n \n\nSo according to your writing Denethor wil not be first hero of AtS cycle….\n\n \n\n \n\nMy thoughts are:\n\n \n\nFirst pack \"The Steward's Fear\" -  Eldacar (Spirit);\n\nSecond pack \"The Drúadan Forest\" - Merry (Lore); - wild guess…\n\nThird pack \"Encounter at Amon Dîn\" - Pippin (Spirit); previewed\n\nFourth pack \"Assault on Osgiliath\" -  Haldir (Lore) - wild guess but i would love to see one of Lorien as a hero;\n\nFifth pack \"The Blood of Gondor\" - Faramir (Leadership); -  it is a hunt in Ithilien, so who better than Faramir itself to help?;\n\nSixth pack \"The Morgul Vale\" - Théoden (Tactics) - previewed"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785619","commentId":785619,"userName":"Samwise Gamgee","timestamp":1366114642,"content":"Wouldn't they save some Rohan characters for a Rohan cycle? That's why I am kind of thinking Eomer and Merry will be saved for that installment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785624","commentId":785624,"userName":"richsabre","timestamp":1366115708,"content":"i think merry and pip will see 2 versions….shire versions and their own 'kingdom' types\n\nso rohan cycle merry will be merry#2"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785625","commentId":785625,"userName":"Pharmboys2013","timestamp":1366115797,"content":"Samwise Gamgee said:\n\nWouldn't they save some Rohan characters for a Rohan cycle? That's why I am kind of thinking Eomer and Merry will be saved for that installment.\n\n\n\nSamwise Gamgee said:\n\nWouldn't they save some Rohan characters for a Rohan cycle? That's why I am kind of thinking Eomer and Merry will be saved for that installment.\n\n\n\ni don't think we would get a Rohan cycle next. We already have a wealth of Rohan heroes, a ton of allies, and some powerful player cards for them. That's why I think it suits them better to augment the theme through the various other cycles. Or if they do make a Rohan cycle it won't be for awhile so at that point they can recycle a lot of the heroes they've already made for them.  Then again what do I know"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785629","commentId":785629,"userName":"Samwise Gamgee","timestamp":1366116506,"content":"richsabre said:\n\ni think merry and pip will see 2 versions….shire versions and their own 'kingdom' types\n\nso rohan cycle merry will be merry#2\n\n\n\nIf your thought process is correct, (they will release Shire versions of the hobbit heroes first and then follow-ons), do you think any of the first releases of the hobbit heroes will be anything other than lore and spirit?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785639","commentId":785639,"userName":"lleimmoen","timestamp":1366117838,"content":"CJMatos, I wrote above that my first (sphere distribution) and third (remaining or switiching spheres) speculations contradict each other. They may be both wrong actually. If one is true, it is likely the one about characters keeping or changing sphere: I certainly think if we see another Denethor, he won't be Lore this time round, though Lore certainly suits the character. Perhaps we get him as an ally? I doubt that also… As for Faramir I am less sure but I still think we see him as a Leadership hero. Look at the end of the Assault on Osgiliath preview, it pretty much ensures Faramir arrives with that package.\n\nNow, who else beside the two? I think we get two Hobbits, yes, and Théoden, then only one remains; if he is not to be Gondor, then I hope it is Silvan, to get Thranduil would be awesome. I'd like to get a Ranged hero from a different than Tactics sphere, but it is nowhere indicated that Thranduil actually used bow and arrows, is there?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785643","commentId":785643,"userName":"Samwise Gamgee","timestamp":1366118325,"content":"lleimmoen said:\n\nNow, who else beside the two? I think we get two Hobbits, yes, and Théoden, then only one remains; if he is not to be Gondor, then I hope it is Silvan, to get Thranduil would be awesome. I'd like to get a Ranged hero from a different than Tactics sphere\n\n\n\nI second. Another Silvan character would be awesome. And if the hero is ranged, so much the better.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785647","commentId":785647,"userName":"Pharmboys2013","timestamp":1366118787,"content":"Samwise Gamgee said:\n\nlleimmoen said:\n\n \n\nNow, who else beside the two? I think we get two Hobbits, yes, and Théoden, then only one remains; if he is not to be Gondor, then I hope it is Silvan, to get Thranduil would be awesome. I'd like to get a Ranged hero from a different than Tactics sphere\n\n \n\n \n\nI second. Another Silvan character would be awesome. And if the hero is ranged, so much the better.  \n\n\n\non that note, I would love to see a hero Haldir. He would certainly fit the qualifications: ranged, silvan, and likely Lore if the other ally to hero and visa versa examples are any indication "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=785650","commentId":785650,"userName":"DevastazioneH88","timestamp":1366119923,"content":"My guesses : 1) Faramir (he's mentioned in almost every quest card from the HoN scenarios), 2)Merry (we got Pippin, I bet we'll get Merry),  4) Mablung or Halbarad (since it's a Ranger), 5) I really don't know but I want Gwaihir…\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=786438","commentId":786438,"userName":"Colino","timestamp":1366312451,"content":"God I hope Sam is coming. I've been itching so badly to make a Hobbit deck but with lore Bilbo being so mediocre, there's a complete lack of choice.\n\nI hope he's Lore as well, the moment I saw Fast Hitch was the moment I decided I definitely wanted a Hobbit deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=786440","commentId":786440,"userName":"richsabre","timestamp":1366312711,"content":"Colino said:\n\n \n\nGod I hope Sam is coming. I've been itching so badly to make a Hobbit deck but with lore Bilbo being so mediocre, there's a complete lack of choice.\n\nI hope he's Lore as well, the moment I saw Fast Hitch was the moment I decided I definitely wanted a Hobbit deck.\n\n \n\n \n\nim pretty sure sam will be spirit given his willpower in the quest for the ring.\n\nhowever, i disagree with bilbo being mediocre….two cards per turn!!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] his stats are pretty crappy though, but i usually give him fast hitch, burning brand and dunedain warnings and use him as an effective blocker\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=786461","commentId":786461,"userName":"Raven1015","timestamp":1366318277,"content":"I'm wondering if we might see the other characters from Middle Earth Quest as heroes eventually. We got Thalin, Beravor, and Eleanor in the Core Set. Is there a possibility that Eometh, the Rohan hero, and Argalad the Elf might make an appearance at some point? It probably wouldn't please the player base that much to have more created characters in the game, but there is a chance it could happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=786462","commentId":786462,"userName":"richsabre","timestamp":1366318465,"content":"Raven1015 said:\n\nI'm wondering if we might see the other characters from Middle Earth Quest as heroes eventually. We got Thalin, Beravor, and Eleanor in the Core Set. Is there a possibility that Eometh, the Rohan hero, and Argalad the Elf might make an appearance at some point? It probably wouldn't please the player base that much to have more created characters in the game, but there is a chance it could happen.\n\n\n\nim not so sure….i used to not think much of the idea of creating ffg middle earth characters, but then i realised 1.they were done very well and were true to 'tolkien style' and 2. they keep the life of the game going\n\nso i guess i would be all for perhaps a couple more ffg heros\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=786731","commentId":786731,"userName":"legolas18","timestamp":1366380688,"content":"This isn't really about the heroes, as I don't really have any idea who they'll come out with, (and correct me if I'm wrong) but isn't the Dwalin ally the only character in the game that has Sentinel and isn't Tactics?  I'd love to see some of the other speres get ranged and sentinel.  Maybe we'll see some of that in this cycle?? Just a thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=786757","commentId":786757,"userName":"richsabre","timestamp":1366384682,"content":"legolas18 said:\n\nThis isn't really about the heroes, as I don't really have any idea who they'll come out with, (and correct me if I'm wrong) but isn't the Dwalin ally the only character in the game that has Sentinel and isn't Tactics?  I'd love to see some of the other speres get ranged and sentinel.  Maybe we'll see some of that in this cycle?? Just a thought.\n\n\n\nyeah most are tactics….i can think of only haldir right now who is lore and sentinel/ranged\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=786856","commentId":786856,"userName":"Pharmboys2013","timestamp":1366403812,"content":"richsabre said:\n\nlegolas18 said:\n\n \n\nThis isn't really about the heroes, as I don't really have any idea who they'll come out with, (and correct me if I'm wrong) but isn't the Dwalin ally the only character in the game that has Sentinel and isn't Tactics?  I'd love to see some of the other speres get ranged and sentinel.  Maybe we'll see some of that in this cycle?? Just a thought.\n\n \n\n \n\nyeah most are tactics….i can think of only haldir right now who is lore and sentinel/ranged\n\nrich\n\n\n\nboth Aragorn's have sentinel, not sure if we were just referring to allies tho"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=787103","commentId":787103,"userName":"Rapier1","timestamp":1366482077,"content":"I think Sam will be lore not spirit. Sam demonstrates a lot of \"practical\" know how throughout the lord of the rings and I think this is better reflected by Lore than spirit. (His willpower in resisting the ring and helping Frodo can be represented by giving him high willpower).\n\nOne reason I think this is because Lore doesn't fit any other hobbit we're likely to get;\n\nI'm expecting \n\nSam and Bilbo (lore)\n\nFrodo and Pippin and Merry (spirit)\n\nPippin and Merry (tactics) for when they take up arms, if we ever get heroes that are set during the Lord of the Rings.\n\nI'm not sure we'd ever get a leadership hobbit.\n\nEdit: Merry does lead the hobbits in the battle for the shire actually, so it's possible we'll see Merry in leadership either instead of tactics or spirit.\n\n \n\nAs for this cycle. I'm expecting a Denthor Spirit hero and Faramir Leadership. I'm expecting Merry to go with Pippin (though we may get Sam because of his being a better fit for Lore), Pippin only really works with 3 hobbit heroes and I'm hoping they give us some choice rather than making us play secrecy or Pippin + frodo + bilbo (Which is also 22 threat thanks to Bilbo's excesive cost). I think the \"right now\" statement in Pippin's preview was meant to hint at another hobbit coming.\n\nThe missing hero (by my count) would be a Lore hero, I'm not sure what we'd get in there. 2 hobbits + 4 Gondor heroes and one Rohan in the cycle so far (based on my count) Possibly another Rohan hero in Lore, or maybe something unrelated like an elf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=787108","commentId":787108,"userName":"richsabre","timestamp":1366483907,"content":"we still have gwaihir that has been seen in the flesh but never as an actual card….we all thought it would be in the doorstep but wasnt\n\non the sam note, i dont think he should be lore….to me lore is reflected in the more learned of middle earth. sam was practical but not a particularly well learned hobbit (compared to say frodo or bilbo). personally i would have had frodo lore. yeah he took the ring to mount doom, but it was sam who got him there\n\nso i would have had frodo lore, sam spirit.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82412-ats-heroes/?do=findComment&comment=788779","commentId":788779,"userName":"son_of_horus","timestamp":1366877286,"content":"I feel like the Ranger hero promised is either a Leadership Faramir or a Tactics Halbarad.  I would like, given the time period of the cycle, for it to be Thorongil but then you could have both him and Aragorn out.  Through my research I have found that this would cause a tear in the fabric of time that even the Doctor couldn't save us from."}]}