{"url":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/","title":"Heirs of Numenor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785557","commentId":785557,"userName":"Khamul The Easterling","timestamp":1366104634,"content":"I have adventure packs 2-4 in the Mirkwood cycle and 2,3,5 in the Dwarrowdelf. I also have one core a and KD.  Ever since I first saw the HoN cards and stuff (Cardgame db) I really wanted it.  I understand that these can be VERY tough quests.  I was wondering if you think I would be able to win at least some of the time with the card pool I have. I've heard that a Glorfindel (spirit) Loragorn, Frodo Deck does well vs these quests.  So do you think I should grab marshes, Gollum, and Return? Or do I still have some good chances of winning at least part of the time. I'm ignoring Long Dark and Shadow and Flame because they seem to have not so good player cards and from many other people Iv'e heard these 2 are pretty bad quests.  So do you think I should grab some some more expansions first or am I ready to take on HoN?\n\n \n\nThanks\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785565","commentId":785565,"userName":"richsabre","timestamp":1366105879,"content":"well there are some really good cards in the pack itself…also the first quest is not so bad, its the other two that are deadly….even with alot of lucky draws it is difficult as the start setup is so hard.\n\nmy advice would be grab a few more packs\n\nmy flight to the ford deck (the frodo/strider/glorfindel that you mention) is a very good deck….probably my best\n\ni play it two handed with a 3 hero tactics deck with legolas and the twins\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785582","commentId":785582,"userName":"CJMatos","timestamp":1366108429,"content":"richsabre said:\n\nwell there are some really good cards in the pack itself…also the first quest is not so bad, its the other two that are deadly….even with alot of lucky draws it is difficult as the start setup is so hard.\n\nmy advice would be grab a few more packs\n\nmy flight to the ford deck (the frodo/strider/glorfindel that you mention) is a very good deck….probably my best\n\ni play it two handed with a 3 hero tactics deck with legolas and the twins\n\nrich\n\n\n\n \n\nAs rich said, i also advice you to grab some more packs….\n\n \n\nIf you want dwarf decks, then Hobbit expansions are needed, along with Mirkwood last (Dáin).\n\nIf you want to follow the frodo/stride/glorfindel deck, then you will probably need some of the other packs…\n\n \n\nAs for memory, Fast Hitch, Good Meal, Renewed Friendship, Master of the Forge, Warden of Healing….\n\n \n\nPS: Rich do you have the \"flight to the ford\" published?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785603","commentId":785603,"userName":"Khamul The Easterling","timestamp":1366111769,"content":"When you say a few more packs which ones?\n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785606","commentId":785606,"userName":"richsabre","timestamp":1366111931,"content":"@cj sure, this here [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=285&efcid=4&efidt=694458] was the general idea….though its never exactly the same every time i contruct it from the ground up\n\ni think the basis for the deck whatever the player cards included is glorfindels low start threat, frodos threat increase ability and striders reset\n\nthen i just put the obvious cards in, mostly noldor.\n\nthe strategy is of course to use frodo as a shield with arwens +1 sentinel, and then reset at the last moment\n\nthere are probably better cards out now to put in the deck\n\nrich\n\nPS :@ khamul…have you checked out cardgamedb? you can see the box spoilers there….(sorry if im telling you old news)\n\ni wil have a more in depth think of which packs are best to get\n\nas cjmatos suggested, dain is a great character so id say return to mirkwood as one of them (if you like dwarves that is)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785614","commentId":785614,"userName":"Khamul The Easterling","timestamp":1366113582,"content":"Yes I've spent many hours on Cardgame db :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I'm not really wanting to go dwarves so much…. My main goal is just to get HoN ASAP spending the least amount of money I can but being able to beat the Quests at least once and a while.  I'm not to keen on getting Return because ive heard how terrible it is solo and Dain would be nice but… I think other packs would help me out more if I'm not chasing dwarves and I plan to skip The hobbit quests(at least for a while) So I guess maybe Dead marshes for Fast hitch and other cards and maybe try to get gollum or something? btw When are they going to be done reprinting Gollum and Carrok so i can get Gollum less then 8 times its worth :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785615","commentId":785615,"userName":"Khamul The Easterling","timestamp":1366113633,"content":"Yes I've spent many hours on Cardgame db :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I'm not really wanting to go dwarves so much…. My main goal is just to get HoN ASAP spending the least amount of money I can, but being able to beat the Quests at least once and a while.  I'm not to keen on getting Return because ive heard how terrible it is solo and Dain would be nice but… I think other packs would help me out more if I'm not chasing dwarves and I plan to skip The hobbit quests(at least for a while) So I guess maybe Dead marshes for Fast hitch and other cards and maybe try to get gollum or something? btw When are they going to be done reprinting Gollum and Carrok so i can get Gollum less then 8 times its worth :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785620","commentId":785620,"userName":"Khamul The Easterling","timestamp":1366114777,"content":"Oh and Rich, The guy in this link runs a deck somewhat similar to your Flight To The Ford deck.  Just thought you might want to see this link.  I found it very interesting.  \n\nHere it is -  http://boardgamegeek.com/thread/921016/solo-deck-for-all-quests-completed-through-heirs-o [http://boardgamegeek.com/thread/921016/solo-deck-for-all-quests-completed-through-heirs-o]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785743","commentId":785743,"userName":"richsabre","timestamp":1366136117,"content":"thanks for that link, i actually ran the flight to the ford deck with an archer deck (the three archers)\n\nit was super fast, the ford deck helps with card draw and threat managemet on the archer deck…..those bows can be deadly….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=785982","commentId":785982,"userName":"iznax","timestamp":1366202850,"content":"2 thinks u need to know about HoN\n\n1st solo is hard, 2+players is insane\n\n2nd its difficulty is mostly due to ''lack'' factor, in all the 3 quests there r 1,2 or 3 cards that r almost  ''game over cards'' if those never come out its way more easy\n\n(shadow effect: discard your hand !!! realy? yep :/ )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786018","commentId":786018,"userName":"Khamul The Easterling","timestamp":1366210122,"content":"Hmm ok thanks. Do you really like the quests though? I really like how there is finnaly some quests that arnt orcs, goblins, monsters, trolls, caves,  ect. I think its cool that you can fight street robbers and Haridrim and the Mumak.  And your finnaly in a city and stuff not always in the forest or moria or mountains.  Did you find the quests really fun even though they are hard? Are they pretty high on your list of favorites?  \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786037","commentId":786037,"userName":"richsabre","timestamp":1366214566,"content":"Khamul The Easterling said:\n\n \n\nHmm ok thanks. Do you really like the quests though? I really like how there is finnaly some quests that arnt orcs, goblins, monsters, trolls, caves,  ect. I think its cool that you can fight street robbers and Haridrim and the Mumak.  And your finnaly in a city and stuff not always in the forest or moria or mountains.  Did you find the quests really fun even though they are hard? Are they pretty high on your list of favorites?  \n\n \n\nKhamul\n\n \n\n \n\nthe quests are nice. i mean the artwork is stunning which is reason for me personally to play it, but then again the entire game is stunning. the first quest is very interesting, being set in an inn…..the other two i admit are just a little too hard, but they do have some of the coolest enemies in the game to fight against….haradrim elite, that card in itself is amazing.\n\nto directly answer your question though, i think the best way to describe it is how solo players felt at the start of core set release….at least i felt this way…it was a case of 'this game is f-ing hard…but i cant help loving it'\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786125","commentId":786125,"userName":"RGun","timestamp":1366239000,"content":"I've got all of the quests released to date and have been able to win them all playing solo with the exception of the PODs and Heirs of Numenor.  The quests in Heirs are very difficult and I've only been able to win the first one.  Last night I got 14/15 progress on the last stage of the Siege of Cair Andros in a desperate attempt where I threw all my characters at the Quest phase just to come 1 short and then get destroyed in the combat phase.\n\nHowever, my experience has been that the 3 quests in a deluxe expansion are initially very hard but then when you have all the cards from the follow-on cycle they are much more managable.  I think when FF does play testing and \"assigns a difficulty\" to the quests they do so based on using the complete pool of cards from the deluxe expansion and follow-on cycle.  So until you get the cards from the cycle the initial quests are going to be fairly difficult."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786158","commentId":786158,"userName":"lleimmoen","timestamp":1366247416,"content":"I have made two decks that were pretty effective in dealing with Ithilien - one was based on direct damage (Thalin, Spearman, Spear, Descendant, Gandalf, Hail of Stones, Fresh Tracks) and the other on encounter control (Denethor, Henamarth, Risk Some Light, Shadows of the Past); as I said, they did well against Ithilien but not very good overall, and I grew tired of them. Now I don't come back to HoN to much any more, mostly just Pelargir which I find very interesting and just about hard enough to be fun.\n\nI'm not overly fond of that deck in the link, I think you can do much better with the three heroes, the core Gandalf, for instance, seems to be a waste - and hard to afford; or Hasty Stroke could be replaced with the combo of Song of Wisdom and A Burning Brand on Frodo - with Master of the Forge (and Rivendell Minstrel) getting them out much more reliably.\n\nAnd yes, HoN is usually WAY easier solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786544","commentId":786544,"userName":"iznax","timestamp":1366341179,"content":"In the last Hobbit saga expansion  there r some realy hard and super balanced* quests, without any ''cheap'' ideas like HoN and many strategic options for the players. I realy like the stacture of the HoN quests i just feel they use the ''easy'' way to make the quests hard ''if you have a Hero card in play you lose'' like :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n*Balanced = the difficulty doesnt depends on the namber of pleyers or the luck of the draw\n\nsry for my english i know … :/"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786558","commentId":786558,"userName":"lleimmoen","timestamp":1366346095,"content":"iznax said:\n\nIn the last Hobbit saga expansion  there r some realy hard and super balanced* quests, without any ''cheap'' ideas like HoN and many strategic options for the players. I realy like the stacture of the HoN quests i just feel they use the ''easy'' way to make the quests hard ''if you have a Hero card in play you lose'' like :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n*Balanced = the difficulty doesnt depends on the namber of pleyers or the luck of the draw\n\nsry for my english i know … :/\n\n\n\nI very much agree with the above. I always found Osgiliath a great quest, since it is very hard, can be extremely hard, but is never crazy-all-out-hard, if you get my meaning. I especially like how some encounter cards can be both fine or terrible, given the situation when they come. That is the best way to do it, I think. Where in Ithilien, you just never want to get certain cards and almost always wish to get the certain few. I also much prefer the Hobbit quests to that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786610","commentId":786610,"userName":"Khamul The Easterling","timestamp":1366361872,"content":"So are you saying that  The Hobbit over hill and under hill is just way better than HoN? Or are you just saying you dont really like Ithilen?  As I said, I'm not really wanting to do dwarf decks(not for a while at least) so I'm planning on skipping The Hobbit.  Plus keep in mind I don't have all the money in the world so I'm trying to skip some expansions.  I've heard how bad the riddle quest is so I would only really get 2 quests from the hobbit.  Also I think it would be quite fun to fight people and bandits and stuff in HoN for a change rather than all monsters.  Do Peril in whatever and Cair Andros make up for Ithilien?(I'm thinking your saying Ithilien isnt such a great quest and hard) My main point is: Do you guyys really enjoy the cair andros and Ithilien quests as much as they look to me?(They look pretty fun to me) Are they Great quests? Or do you think that they are just not worth buying when Im not going to buy every single expansion?\n\nThanks\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786612","commentId":786612,"userName":"richsabre","timestamp":1366362235,"content":"i have to admit i have played the riddle quest both solo and with two friends…..we all disliked it. the other two are fantastic. overall i prefer the hobbit 1 to numenor. both have 1 really annoyingly hard quest, but to me the hobbit's remaining quests are much more fun than numenor's\n\nbut thats coming from me….and i really love the hobbit books, so take that as a slightly biased opinion\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786615","commentId":786615,"userName":"Khamul The Easterling","timestamp":1366362636,"content":"Oh and I'm planning to not buy (or at least not for quite a while) \n\nShadow And Flame (If you dont use Elrond then all the player cards are kinda wasted exept for the Master of the Forge.  I think having just one card to skip is pretty good.\n\n \n\nThe two Hobbit boxes (AS i've said, Im not chasing dwarf decks and I'll might but the first box but not until I Finish the Mirkwood cycle, dwarrowdelf and HoN)\n\n \n\nLake Town (Ehhh Too hard)\n\n \n\nAnd Im not sure If I should skip The Long Dark and or The Redhorn Gate.  I've heard that Long Dark is a poor and easy quest but it does have that Warden of Healing.  Redhorn has pretty bad cards other than Bofur but is On many people's top 5 list for fav quest.  \n\n \n\nAnd I am still going to buy:\n\nThe Hunt For Gollum \n\nThe Dead Marshes\n\nReturn to Mirkwood\n\nHoN\n\nMassing at Osgilliath\n\nPossibly LD or TRG\n\n \n\nDo you think I should swap one from my skip list for one from my buy list?\n\n \n\nThanks Khamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786641","commentId":786641,"userName":"lleimmoen","timestamp":1366368587,"content":"It is just so hard to give a good advice. The problem is there usually at least some great cards in each adventure pack, as you stated, even if you're not going to play Elrond, Master of the Forge is very good; similar is Warden of Healing in the Long Dark; however, if you can do without the two, and Elrond, then surely skip those two quests, the two essential packs from the Dwarrodelf would be Watcher and Foundations, the former having Arwen, Elrond's Counsel, the latter Glorfindel, Light of Valinor, Asfaloth, among others.\n\nHoN will probably be essential for some of the Gondor strategies. I really think Leadership Boromir will rule in Leadership Gondor deck. There are some good cards in there for that. As for the quests, I really like Pelargir - that is what you were talking about: fighting bandits for a change, thugs and brigands, I really enjoyed the feel of that quest. Ithilien, though I was actually winning it in the end, and Cair Andros (though I haven't played it enough perhaps) I don't care much about.\n\nI am also not crazy about Dwarves, at all, not in the game. Even when the decks work well, they're just no fun for me. And I actually think they're quite vulnerable, especially without Spirit, no matter how well they can build up. Still, the Hobbit quests are quite fun (most of them at least) - and there are some great cards for the weapons, which I think will be very good for a Tactics deck, especially Foe-Hammer, being basically the only Tactics drawing card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786699","commentId":786699,"userName":"richsabre","timestamp":1366374897,"content":"lleimmoen makes an excellent point, HoN will be central to the upcoming cycle. overall i would say just go for it and buy numenor. by the sounds of it you are far more into the theme of gondor than anything in the hobbit packs, so on that alone you will enjoy HoN more\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82433-heirs-of-numenor/?do=findComment&comment=786777","commentId":786777,"userName":"iznax","timestamp":1366388511,"content":"So far i find the 2 Hobbit expansions to be a great progress for the game (on the doorstep a huge lvl up for the game, the best expansion by far!!! ) HoN i have to admit that was a bit of a disappointment for me, its not a bad expansion but it gave me the feeling that they start running out of ideas\n\nAs far as it concerns the quests, the player cards is an other part .\n\nOfc is all a mater of taste, for example i find the riddle mechanic a realy cool one and most of the people hate it, a riddle that actualy tests the knowledge you have for your own deck makes perfect sence for me and i realy like it ."}]}