{"url":"https://community.fantasyflightgames.com/topic/82458-3rd-question-sorry/","title":"3rd Question - Sorry!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82458-3rd-question-sorry/?do=findComment&comment=785773","commentId":785773,"userName":"Yooble2","timestamp":1366140467,"content":"Sorry if im being a pain asking all these questions but new scenarios keep cropping up and i want to make sure im playing correctly.\n\nIm playing the second quest of the core set and i exhausted Faramir to give my characters +1 willpower then i revealed and the encouter card was evil storm which ended up killing Faramir. My question is with Faramir now in my discard pile, is his action effect still active until the end of the phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82458-3rd-question-sorry/?do=findComment&comment=785786","commentId":785786,"userName":"CJMatos","timestamp":1366142194,"content":"Sorry but his effect doesn't work if he is in the discard pile.\n\n \n\nThe way to overcome this is do the action after staging and before quest resolution."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82458-3rd-question-sorry/?do=findComment&comment=785796","commentId":785796,"userName":"GrandSpleen","timestamp":1366145306,"content":"Hmm.. I would think the effect persists even if Faramir is discarded.  If the card said \"while,\" it would be contigent upon Faramir's continued presence (e.g., \"Exhaust Faramir to add 1 willpower to each character while Faramir is in play, until the end of the phase\").  Without that, though, I want to say that the effect doesn't need the card to continue to be in play.  CJ has the best idea, in any case -- you can exhaust him after the staging step, before quest resolution, for the safest use.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82458-3rd-question-sorry/?do=findComment&comment=785842","commentId":785842,"userName":"ricedwlit","timestamp":1366160219,"content":"I second GrandSpleen's reasoning: the act of exhausting Faramir grants the boost to willpower until the end of the phase, regardless of whether he is still in play. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82458-3rd-question-sorry/?do=findComment&comment=785891","commentId":785891,"userName":"richsabre","timestamp":1366179984,"content":"thats a good question..i also would say that after exhausting the effect remains\n\nand dont worry….ive been playing for 2 years and still have to ask rules questions :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"}]}