{"url":"https://community.fantasyflightgames.com/topic/82532-that-crippling-1st-round%E2%80%A6%E2%80%A6%E2%80%A6/","title":"that crippling 1st round……….","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82532-that-crippling-1st-round%E2%80%A6%E2%80%A6%E2%80%A6/?do=findComment&comment=786190","commentId":786190,"userName":"richsabre","timestamp":1366257124,"content":"i wanted to make a thread to gather advice on what is perhaps the most difficult aspect of this game, so that both newcomers and oldies like me can gain something from it\n\ni talk of course about the first round, from set up to finish\n\ni find a lot of quests have a very difficult beginning, and are often lost with  the first round of playing.\n\nso what is your advice on how to handle this first round?\n\nmine are:\n\n-dont forget the mulligan. i used to not use it however i find myself using it more and more, being ever pickier about whether my hand is 'good' or not. for a hand to be good i think it needs to have at least 1 good ally, 2 key events, and 1 key attatchment.\n\n-cheap 1 cost ally. these can really help in the first round from enemy attacks. 1 cost allies are guaranteed to be able to enter play upon the first planning phase. i like to use snowbourne scout as orc fodder, he even has a benefit on entering play\n\n-song cards. sometimes i like to play song cards if i have them, in the first round and not play any other card at all. this way you have a killer second turn planning phase and can really move ahead. this only works i think if there is a good set up from the encounter deck.\n\n-not questing to get rid of enemies / not fighting to get rid of locations. i think it is best to get rid of the encounter cards brought by the set up as quickly as possible. i usually look what is more numerous and then take either a questing or fighting stance.\n\ni more often than not would rather take the threat increase and take down the set up enemies than let them linger in the staging area. if im playing two handed my tactics deck stays ready anyways. but if  there are two locations i would rather have some orc fodder take the attacks and get through the locations in the first two round\n\nadd your thoughts below if you wish :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82532-that-crippling-1st-round%E2%80%A6%E2%80%A6%E2%80%A6/?do=findComment&comment=786195","commentId":786195,"userName":"lleimmoen","timestamp":1366259513,"content":"This is a good thread. I will try to gather up some thoughts. First I have is about secrecy, I think there is an overall consensus secrecy is not a very well developed strategy - and that in itself is an understatement. However, three-hero secrecy may not be bad, as those decks pretty much function as normal with a bonus; Glorfindel is obviously key in this, he can team up with 7 or 8 (one) threat cost heroes and there you have it. There are two very good secrecy cards you can play on round 1 to get a good start, Risk Some Light and Timely Aid. For some time I was very fond of the former but since I basically gave up encounter control (at least for a while) I try to concentrate on the latter at the moment. I think this has actually been a secrecy favourite from the get-go and it is a great card to have in your opening hand when you start at 20 or below; bringing up that one extra ally (and potentially one you could otherwise never afford on round 1) may give you an essential chance against heavy odds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82532-that-crippling-1st-round%E2%80%A6%E2%80%A6%E2%80%A6/?do=findComment&comment=786236","commentId":786236,"userName":"GrandSpleen","timestamp":1366271101,"content":"The first couple of rounds can hurt!  More often I find my strategy in the first round to be quest heavy, get enemies out of the staging area, but don't plan on killing any on turn 1.  But it depends on the quest--\n\nConflict at the Carrock, We Must Away Ere Break of Day, A Journey to Rhosgobel, and a few other quests kind of encourage you to stay on the first quest card for awhile.  In those quests I want to quest slowly, so I will usually keep folks out of questing  in that case.\n\nIn Flies and Spiders, resource generation for the player with Bilbo is crucial.  We mulligan for Steward of Gondor if possible, or at least some kind of card to help generate resources. \n\nIn The Siege of Cair Andros and Into Ithilien there are locations that you want to explore as fast as possible, so we quest heavy even if it means undefended attacks (the first round will make or break you in Into Ithilien), and mulligan for cards that deal with locations like the Riddermark's Finest and Asfaloth.\n\n \n\nThis is a cool thread, keep the ideas coming!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82532-that-crippling-1st-round%E2%80%A6%E2%80%A6%E2%80%A6/?do=findComment&comment=786263","commentId":786263,"userName":"lleimmoen","timestamp":1366274799,"content":"There are certain heroes that can ensure a better opening round. Beside low threat which is essential in some quests, there are those who can help with specific things.\n\nI've always thought Éowyn was a great hero for the opening round, but battle-and-siege mechanic makes a big difference, still, in all the \"normal\" questing scenarios, she still rules the beginning.\n\nFrodo is great for absorbing a possible undefended attack which may happen on round 1 more likely than on any other round perhaps.\n\nBoromir is great to deal with several enemies, obviously, which is again a high possibility for round 1.\n\nBeorn does pretty much the same, he's even better on round 1 than Boromir but, of course, you cannot work with him as much.\n\nElladan, Elrohir, Aragorn can also get extra actions, they're just not that reliable early, and require you not spending their resources - which is very restricting in the opening round.\n\nBalin is a similar issue, yet I would value his ability higher on round 1 as a bad early shadow effect has probably been the most common way to lose a game for me.\n\nThéodred is a great help especially early in the game when that one extra recource makes a huge difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82532-that-crippling-1st-round%E2%80%A6%E2%80%A6%E2%80%A6/?do=findComment&comment=786392","commentId":786392,"userName":"richsabre","timestamp":1366304871,"content":"thanks for the replies. keep them coming :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nas for heros i have seen a lot of players saying elanor is great for set up (with her ability)….and while i agree she is the only way so far to stop a treachery at set up (i think?) i just cant seem to get the hang of her….i always find better heros.\n\ni would also like to add my vote for taking damage from undefended attacks….i think the most important thing is to clear the set up cards as quickly as possible….especially if there are alot of surge cards…and again frodo is great for this\n\nrich"}]}