{"url":"https://community.fantasyflightgames.com/topic/82591-a-two-fold-question/","title":"A two-fold question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82591-a-two-fold-question/?do=findComment&comment=786529","commentId":786529,"userName":"Nerdmeister","timestamp":1366337033,"content":"As mentioned in the title this question is two-fold. And for anyone reading this I would like for you to consider these arguments as they are being made.\n\nFirst of all try to answer this question to yourself:\n\nWhen excactly do you determine the target of an event card being played? Is it the moment you decide to play it or is it the moment it enters play?\n\n \n\nGive it some thought and then continue reading.\n\nI´m assuming at this point you have determined with yourself, which of the above possibilities appeal the most to you. Now to the second part of my question.\n\nIn the encounter set \"The Lonely Mountain\" there is a treachery card called \"Dragon-Spell\", which has the text:\n\n\"When Revealed: Attach to the hero with the most resources without Dragon-Spell attached. (Counts as a Condition attachment with the text:\n´Attached hero gets -1 [Willpower] for each resource in its resource pool. Forced: When attached hero spends resources, attached hero takes X damage. X is equal to the number of resources spent´\"\n\nNow to provide an example from our game last night, how this card is relevant to my first question: \"Dragon-Spell\" was attached very early to Glorfindel(spirit). In the very late stage of the game (stage 3b with Smaug´s damage and progress on the quest hanging very close in the balance, litterally the tiniest little edge can make all the difference of succeeding with my partner at 48 threat). Glorfindel has 8+ resources on him and no damage and a very important card in my hand: \"Fortune or Fate\" with the text \"Action: Choose a hero in any player's discard pile. Put that card into play, under its owner's control.\"\n\nNow if your answer to the first question is, that you decide on the target of an event when the event enters play (after it has been paid for), then it would follow that you could use Glorfindels resources to pay for \"Fortune or Fate\", thus killing him, and then use the effect of the card itself to put Glorfindel directly into play again (minus the dragon-spell attachment) and enabling him to ad his full willpower to questing once again.\n\nHowever if you answer to the first question is, that you decide the target the moment you announce/decide to play the card then of course it follows that Glorfindel would just die from the effort and you would have to choose another dead hero.\n\nSo what was your initial thought on the first question and has this preceeding line of reasoning made you alter what you thought was a straight-forward answer? What is the conclusion to this scenario?\n\nPS: we decided to play it so I couldn´t remove \"Dragon-Spell\" this way and that decision did end up costing us the game. The question has been lingering in my mind ever since though and I have not been able to find satisfaction in the rules or FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82591-a-two-fold-question/?do=findComment&comment=786567","commentId":786567,"userName":"richsabre","timestamp":1366351137,"content":"this may be not relavent at all, but does\n\nWhen resolving multiple effects with a shared\ncondition, players should use this order of resolution:\npassive abilities first, Forced effects second, Response\nactions third. When determining the order of effect\nresolution among abilities within those categories,\nplayers should first resolve abilities that use the word\n“when” and then resolve abilities with the word “after”.\n\n(1.37 faq)\n\nhelp?\n\nactually now i look at it, it doenst…..we know already that the effect kills him, what you are asking is has he managed to trigger the effect he paid for or has he rather pathetically died  trying? i guess it depends on when the effect hits the table…\n\nactually thats an interesting point my friend….mmm….i would like to hear grandspleens opinion on this as he is good at this sort of thing (whereas i suck, as you can tell haha)\n\nif i were to choose one, without having to back it up in the rules, i would choose he could be brought back as he has paid for the card fully….but then again i cant find anything to directly back that up\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82591-a-two-fold-question/?do=findComment&comment=786588","commentId":786588,"userName":"GrandSpleen","timestamp":1366355324,"content":"Well, let's consider Exhibits A, B, C, and D!\n\nFortune or Fate: \"Action: Choose a hero in any player's discard pile. Put that card into play, under its owner's control.\"\n\nDragon-spell: \"When Revealed: Attach to the hero with the most resources without Dragon-Spell attached. (Counts as a Condition attachment with the text:\n´Attached hero gets -1 [Willpower] for each resource in its resource pool. Forced: When attached hero spends resources, attached hero takes X damage. X is equal to the number of resources spent.´\"\n\nManual text regarding Events: \"Event cards represent maneuvers, actions, tactics, spells, and other instantaneous effects at a player’s disposal. An event card is played from a player’s hand, its text effects are resolved, and the card is then placed in its owner’s discard pile.\"\n\nManual text regarding Forced effects: \"Forced effects are initiated by specific occurrences throughout a game, and they occur automatically, whether the card’s controller wants them to or not. They are denoted by a bold “Forced:” trigger on a card. These effects initiate and resolve immediately, whenever their specified prerequisite occurs. The enemy card Marsh Adder provides an example of a forced effect that must be triggered whenever its specified trigger (“each time Marsh Adder attacks”) is met.\"\n\n \n\nI would do as Nerdmeister did, and not allow the play.  But it is very tempting to say otherwise.  The Forced effect is immediate-- I think you would resolve damage from Dragon-spell at the time that you are removing resource tokens.  If you think about an ally, you wouldn't \"play\" that ally until you were finished paying for it.  The Event should go the same way.  You haven't satisfied the cost of the card until you've finished paying for it, right?  Meaning that when you have paid for Fortune or Fate and trigger its Action, Glorfindel would be in the discard pile and a legal target for the event.  Right now, I am envisioning:\n\n1) Pay 5 resources.\n\n2) Place 1 damage on Glorfindel per resource removed.\n\n3) immediate: Glorfindel discarded when he has 5 damage tokens on him.\n\n4) Cost for Fortune or Fate has been satisfied, you may now trigger its Action.\n\n5) Glorfindel city!\n\nBut I think the designers tend to rule in the opposite way, not allowing such crazy plays :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I would like to hear their (or other users') reasoning that supports a play sequence which does not allow this play, though.  I think to disallow it, you would have to say that the damage from the Forced effect does not resolve until after you trigger the Action.  That would seem to violate the 'immediacy' of Forced effects, but I don't know!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82591-a-two-fold-question/?do=findComment&comment=786595","commentId":786595,"userName":"richsabre","timestamp":1366358610,"content":"nice reasoning, though the points you make, make me want to support allowing it more and more. i guess its one of those 'if you read too much into it' it technically is allowed but the designers obviously dint intend it\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82591-a-two-fold-question/?do=findComment&comment=787564","commentId":787564,"userName":"richsabre","timestamp":1366614936,"content":"spam has been reported\n\nrich"}]}