{"url":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/","title":"tolkien lore discussion ideas thread","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=786974","commentId":786974,"userName":"richsabre","timestamp":1366442001,"content":"i decided to make a different thread for the ideas so we can keep a list where anyone can add to as the weeks go along.\n\ni guess it may be best to do it in a poll sort of way, and you can either give your support to an idea already said, or add a new one, or both.\n\nheres my ideas, i ll keep this updated.\n\n-what if scenarios (eg. what if bilbo hadnt found the ring, what if the fellowship had stayed together at amon hen etc.)\n\n-favourite (insert….. quotes / chapters / books / enemies etc.)\n\n-little known facts about lotr (i think the drafts, letters would feature alot here….not so sure about this one as it would mean everyone having access to the source materials (which reminds me….i need to buy those letters….) )\n\n-what would you have done differently (similar to what ifs, but you can make the scenario rather than it being set…..eg. what 9 companions would you have chosen for the fellowship…..or if you were sauron what strategy would you have used in the war of the ring)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787077","commentId":787077,"userName":"Ellareth","timestamp":1366473389,"content":"Here are some discussion ideas I can think of off top of my head.\n\nDiscussion of events from specifc era as if we were in that time frame.\nFor example, during War of the Ring (Third Age)\nWe know Elves are real, talking trees are real, gigantic eagles are real, because we can go and see them at any point (although journey would be difficult)\nbut we have only heard of Valar, Morgoth, Numenor and such through loremasters and historians.\n\n \n\nAlso looking at events from different perspective should be interesting.\nLot of guess work needed for this one (due to the fact Tolkien only writes about Elves and occasionally Numenorians), but this should start some interesting debates such as were Numenorians as good as they claim? Is Gondor really true Heirs of Numenor or should that title belong to Umbar? Were Dunedains racist (not specist)? Are Elves are noble as they were portrayed (for Orcs take prisoners of War while Elves just slaughter every Orc for being Orc)?\n\n \n\nAnd since we know Red Book of Westmarch was written by the Hobbits and copied by Gondorian scribes, and we also know original copy of that Book doesn't contain true story of how Bilbo found the Ring (although Frodo and Sam made other copies containing the true story and possible theories), what other 'facts' could have been distorted to suit the need of Gondor and her allies? Druedain's chieftain mentioned their people being hunted like animals, indigeous people of White Mountains are known to have fought Numenorians, Dunlandings certainly had good reason to hate Rohirrims, why did Harad and Rhun hate Gondor so much that they fought to the last man in every battle even after orcs fled? What was the full extent of the damage Numenorians inflicted on Middle-Earth for their precious lumbers? Were 'middle men' of Middle-Earth truly evil or did they have good reason for attacking numenorians?\n\n \n\nIf we step into mythical era, we can talk about was Eru good god, what were some of evils of Melkor that ended up making the 'music' even more beautiful (obvious examples being gallent deeds of Noldor, I think), were Valar good guardian of Arda, if we were to ignore what happened outside of Arda were Melkor and Sauron evil at heart, what would Sauron do once he conquered all of Middle-Earth, how strong are Ainur compared to Children of Iluvatar, etc.\n\n \n\nWell that's more a mess than a list of ideas, but that's what I've got for now.\n\n \n\nEdit: Also we can talk about more Game related contents. What were less known events going on during the time frame (Bilbo's 111st Birthday to Frodo's departure) or what would/could be happening during within those timeframe in various regions of Middle Earth and extraporate from there to discuss relevent characters and how it effected War of the Ring and such."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787088","commentId":787088,"userName":"richsabre","timestamp":1366477186,"content":"hey ellareth\n\ngreat ideas, keep them coming\n\nseems like there could be some very indepth discussions on those points.\n\ni like bringing the game into it, we could perhaps pick a character each time and discuss certain points about them\n\nim trying to think of examples but im sure we can come up with some\n\ni also had an idea of another forum game, but one with only one answer. it would run something like this\n\nthe clues would all be about cards in the game, so one would be:\n\n'this hero met his end in moria' …..answer = balin\n\nthen you take the first letter of each answer, and add them all together to make a word. the word is the answer\n\n….sort of like a lotr lcg treasure hunt……prize = eternal forum bragging rights…. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787193","commentId":787193,"userName":"Raven1015","timestamp":1366511090,"content":"I like the idea of talking more about Harad and Rhun. They often get a bad wrap, or are just dismissed as evil, but from what's described, they did get constantly raided and attacked by the Numenoreans during the time they were under the influence of Sauron. Getting a chance to strike back against them probably made a whole lot of sense for the men of the South and East."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787211","commentId":787211,"userName":"klaymen_sk","timestamp":1366519858,"content":"richsabre said:\n\nhe\n\ni like bringing the game into it, we could perhaps pick a character each time and discuss certain points about them\n\n\n\n \n\nIf you mean something like the Master of Lore [http://masteroflore.wordpress.com/] blog does, then it's a pretty good idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787228","commentId":787228,"userName":"richsabre","timestamp":1366530696,"content":"klaymen_sk said:\n\n \n\nrichsabre said:\n\n \n\nhe\n\ni like bringing the game into it, we could perhaps pick a character each time and discuss certain points about them\n\n \n\n \n\n \n\nIf you mean something like the Master of Lore [http://masteroflore.wordpress.com/] blog does, then it's a pretty good idea.\n\n \n\n \n\nsort of like that yeah, but whereas a blog such as the one you linked, or my own tolkienology would be one person giving info to the group, i would like to open the discussion up more so anyone could contribute. personally i found towards the end of my blog i was getting less comments, probably because i wasn't 'opening up' the article for discussion. it was more of a closed affair\n\ni would like to avoid that if possible so that it keeps the thread alive.\n\nim not entirely sure how an open blog would work, but im guessing the 'bloginess' would be taken out of it and it end up more of a discussion\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787234","commentId":787234,"userName":"klaymen_sk","timestamp":1366533048,"content":"Oh, I didn't want to suggest starting a blog, or something like that, my bad. I have used it as a mere comparison to what kind of discussion you would like, because that blog does something like you have suggested, though it is not purely about characters.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787237","commentId":787237,"userName":"richsabre","timestamp":1366533528,"content":"klaymen_sk said:\n\nOh, I didn't want to suggest starting a blog, or something like that, my bad. I have used it as a mere comparison to what kind of discussion you would like, because that blog does something like you have suggested, though it is not purely about characters.\n\n \n\n\n\noh sure, i wasnt dismissing your idea as you were correct, it was indeed what i was suggesting. i am just trying to think the best way to keep such as thread alive……im not sure how such a thing would function….perhaps just a free for all?….these things tend to end up working better if they just happen naturally without bothering with any set thing…such as the favourite tolkien characters thread\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787281","commentId":787281,"userName":"klaymen_sk","timestamp":1366545566,"content":"richsabre said:\n\nki am just trying to think the best way to keep such as thread alive……im not sure how such a thing would function….perhaps just a free for all?….these things tend to end up working better if they just happen naturally without bothering with any set thing…such as the favourite tolkien characters thread\n\nrich\n\n\n\n \n\nFree for all may work, though there may be some topics, where it would be better if it was in its own thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787291","commentId":787291,"userName":"Ellareth","timestamp":1366547142,"content":"Thought about another 'forum game' idea that is sort of related to lore, sort of not.\n\nHave one person list Cards from game to form an event from the Books or Movie (must be specified if they are trying to recreate scene from book or movie) then have others try and guess it, whoever gets the right answer gets to do next question.\n\n \n\nExample:\n\nQuestion: From the Book, Elrond's Counsel (WitW), Trollshaw Scout (FoS), The Dimrill Stair (TRG), Gladden Fields (Core), Rhosgobel (AJtR), Radagast (AJtR)\n\nAnswer: After Elrond's Counsel, Elrond sends his people to scout fellowship's path. Some went through Dimrill Stairs, cross Gladden Fields to visit Radagast at Rhosgobel, but he wasn't there.\n\n \n\nThought it might be fun to see how many scenes from the book/movie we can recreate with the cards released so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787297","commentId":787297,"userName":"richsabre","timestamp":1366547696,"content":"i rather like that idea!\n\nso it would be something like this?\n\nbook: elrond - gandalf - thorin\n\nanswer = elrond is describing what gandalf's and thorin's swords are in rivendell after roast mutton chapter\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787308","commentId":787308,"userName":"Ellareth","timestamp":1366549909,"content":"richsabre said:\n\n \n\ni rather like that idea!\n\nso it would be something like this?\n\nbook: elrond - gandalf - thorin\n\nanswer = elrond is describing what gandalf's and thorin's swords are in rivendell after roast mutton chapter\n\nrich\n\n \n\n \n\nYeah, and add in Glamdrim and Orcrist as additional hint if people aren't getting it right, since there are card versions of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787485","commentId":787485,"userName":"lleimmoen","timestamp":1366595532,"content":"Sorry for joining rather late. I really like this thread, and where it's going. I want to do most (if not all) that was suggested. I want it to be Tolkien lore oriented but I don't mind to stray into the game too, it is where the boards are after all. So the game with card titles and stories seems great.\n\nI would like to discuss chapters. TORn does that but I could never join in for various reasons, why don't we have our own discussions on chapters, even chronologically? Would enough of us be up to it? I cannot promise I contribute every day but I think with rare exceptions I can have some input every week which is about how often (at the quickest) the chapters would come up, right?\n\nWhat ifs sound good too - including different perspectives. The other concept Tolkien had after the Lord of the Rings had been finished was to write about the Numenorean era from a perspective of \"dark men\". The excerpt was again a wonderful read, and I did not mind Tolkien was obviously siding with the Numenoreans once more.\n\nAs for specific from the above, I like Ellareth's mentioning of Elves slaughtering Orcs. It has a great philosophical aspect about prejudice. One could ask how many proofs you need till you become completely prejudice. In this example, an Elf meets an Orc hundred times and each time he behaves the same (malevolent), what does that tell the Elf? Does he kill the next Orc he meets right away or does he wait to see what happens? Or does he take him to the Elven psychiatrist to see what he can do about it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82651-tolkien-lore-discussion-ideas-thread/?do=findComment&comment=787561","commentId":787561,"userName":"richsabre","timestamp":1366614511,"content":"thanks for posting. i like the idea of going through each chapter chronologically. what would we discuss on each chapter?….perhaps the characters motivations in each event, how they deal with it, how they could have acted differently, if they did the right thing?\n\ni think the elves killing the orcs to a man will features as several people have now put in their vote for it.\n\nkeep the ideas coming!\n\nrich"}]}