{"url":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/","title":"Campaign LOTR","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787202","commentId":787202,"userName":"13thcaesar","timestamp":1366518016,"content":"I was thinking about LOTR campaign in the form of \"traveling\" in Middle-earth, so that the plots together a bit of it is not. It looked like it would more or less, the players after passing certain quests would have access to locations such as Lorien, Rivendell, Minas Tirith, which would take his way trip. after completing the quest will go back to, or go to another location have the opportunity to choose the next available quests. following note on something like this would look like. \">)\" Show next quests or locations, to which players get after completing the quest. Sorry for my english.\n\n \n\nI Passage Through Mirkwood\n> II\nII Journey Down The Anduin\n> LORIEN\n \nLORIEN\na) Gandalf has requested your assistance in the search for the elusive creature known as Gollum. > I A\nb) The heroes enter the mines of Moria at the behest of the White Council, carrying an important message to Balin. (*unavailable after passing Dwarrowdelf cycle  *)  > I B\nc) Celeborn has bid you escort Arwen to visit her father in Rivendell.  > I C\nd) The Lady Galadriel of Lorien has asked you to investigate the area in the vicinity of Dol Guldar. > I D\n \nI A The Hunt For Gollum\n \n > II A\n \nI B Into The Pit\n \n> II B\n \nI C The Redhorn Gate\n \n> II C\n \nI D Escape From Dol Guldur\n \n> Lorien\n \nII A Conflict At The Carrock \n \n> III A\n \nIII A A Journey To Rhosgobel\n \n> IV A\n \nIV A The Hills Of Emyn Muil\n \n> V A \n \nV A The Dead Marshes\n \n> VI A\n \nVI A Return To Mirkwood\n \n> Lorien\n \nII B The Seventh Level\n \n> III B\n \nIII B Flight From Moria\n \n> Rivendell\n \nII C Road To Rivendell\n \n> Rivendell\n \n \nRIVENDELL\n \ne) Elrond has asked you to scout the Mines of Moria on your return to Lorien. > I E (*unavailable after passing Khazad-Dum*)\nf) The White Council has sent you by ship to Gondor to help fight the threat of Mordor. > I F\nStory A) listen to stories minstrel of rivendell of Bilbo Baggins journeys > Story I A\nStory b) listen to stories minstrel of rivendell about The Battle Of Lake-Town. > Story I B\n \nI E The Watcher In The Water\n \n> II E\n \nII E The Long Dark\n \n> III E\n \nIII E Foundations Of Stone \n \n> IV E\n \nIV E Shadow And Flame\n \n> Lorien\n \nI F Peril In Pelargir \n \n> II F\n \nII F Into Ithilien\n \n> III F\n \nIII F The Siege Of Cair Andros\n \n> Minas Tirith\n \nStory I A We Must Away, Ere Break Of Day\n \n> Story II A\n \nStory II A Over The Misty Mountains Grim\n \n> Story III A\n \nStory III A Dungeons Deep And Caverns Dim\n \n> Story IV A\n \nStory IV A Flies And Spiders\n \n> Story V A\n \nStory V A The Lonely Mountain\n \n> Story VI A\n \nStory VI A The Battle Of Five Armies\n \n> Rivendell\n \nStory I B The Battle Of Lake-Town\n \n> Rivendell\n \n \nMINAS TIRITH\n \ng) There are reports of increased Orc activity around Ithilien, and you have been sent to investigate.  ( *unavailable after passing Assault On Osgiliath*) > I G\nh) Steward of Gondor, who suspects that the fanatics of Mordor began to conspire against kingdom, asking for heroes to investigate. > I H\ni) Boromir of Gondor to lead the military assault on Osgiliath. Heroes join the army. > I I\n \nI G The Massing At Osgiliath\n \n> Minas Tirith\n \nI H The Steward's Fear\n \n> II H\n \nII H The Druadan Forest\n \n> III H\n \nIII H Encounter At Amon Din\n \n> Minas Tirith\n \nI I Assault On Osgiliath\n \n> II I\n \nII I The Blood Of Gondor\n \n> III I\n \nIII I The Morgul Vale\n \n> Minas Tirith\n \n \n13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787210","commentId":787210,"userName":"Eryx_UK","timestamp":1366519790,"content":"I do something similar. I start with the stories from The Hobbit boxes, then Battle of Lake Town PoD, then do the stories in order, but I add Massing at Osgilliath PoD after the Heirs of Numinor stories."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787215","commentId":787215,"userName":"13thcaesar","timestamp":1366522276,"content":"I wanted the players to feel like they traveled through Middle-earth, and have the choice further down the road - with the currently available quests a little limited. From  Lorien example, players can go to Rivendell by Khazad-Dum or escorting Arwen. To Lorien from Rivendell can go through the cycle Dwarrowdelf (starting Watchcer in the water). to Minas Tirith far you can travel only from Rivendell. in Rivendell you hear stories about journeys of Bilbo Baggins or  about Smaug  the attack on the city on the lake. as pointed out after a trip to Rivendell by Khazad-Dum can not return to Lorien by the cycle dwarrowdelf  - the characters seem Elrond relationships with travel through Moria and he does not need to send another team to Moria. for the same reason after returning to Lorien from Rivendell by a series of Dwarrowdelf players can not return to Moria by Khazad-Dum - White council does not need to send messages to Balin. After passing Assault on Osgiliath characters can not choose Massing Of Osgiliath - Boromir would not send scouts to bounce conquered city.\n\n13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787221","commentId":787221,"userName":"Glaurung","timestamp":1366525574,"content":"This kind of think can be god for orginize play. Kind of tournanents with a path like this . Also number of heroes limited and if some heroes die cannot be used in next quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787225","commentId":787225,"userName":"13thcaesar","timestamp":1366527741,"content":"You can also make the game easier - for example, in Lorien, Rivendell or Minas Tirith, the team can regroup - players can modify decks, change the heroes. This helps in adjusting the decks to the next quests. However, after the quest, after which heroes  pass to next quest  and not to Lorien, Rivendell or Minas Tirith players must continue the journey with the same heroes and decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787226","commentId":787226,"userName":"13thcaesar","timestamp":1366528384,"content":"after the defeat in certain quests, heroes instead of dying, they can return to the starting location. for example, the players will go on the hunt for Gollum, and will fail in Conflict At Carrock, they can try again to beat the quest, or return to Lorien - not far from the quest. then they can choose a different path - another quest. but if you take the quest again - in this example, Hunt for Gollum must start from the beginning, no matter how far they got before - in this example, the Conflict At Carrock. heroes lose track of Gollum, and must take a trail again. Of course, not all quests are a possibility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787307","commentId":787307,"userName":"Ellareth","timestamp":1366549652,"content":"Feels very RPG-style, with Lorien, Rivendel and Minas Tirith as save spots where you can swap party members (Characters), equipments (attachments) or learn new skills (attachments / event).\n\nI see Lorien as beginner's town that you cannot go back to after doing certain quest (either one of Khazad-Dum related quests) with hidden dungeon for hardcore players (Dol Guldur).\n\nLove the way you fit Out-of-Time Frame expansions as tales.\n\n \n\nOnce we get more card pool, limit certain cards with certain trats until appropriate locations are unlocked (Warden of Healing cannot be added until Minas Tirith), make some of the 'powerful' card unlockable by completing 'Side Quests' that does not unlock new area (such as Hunt for Gollum), and you've gotten a very board gamey RPG style card game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787377","commentId":787377,"userName":"13thcaesar","timestamp":1366565140,"content":"Like Glaurung said you can do some kind of tournament. And include more players. for example, there are 6 players. All players are Lorien, one says he wants to escort Arwen to Rivendell and asks who is going with him. Let say, he decided to include only one player. So these two players played quest - The Redhorn Gate. The rest four players want to travel to Rivendell by Khazad-Dum. Of course, in one quest may take a maximum of 4 players. So up to 8 players can take part in this mode - creating two four-person teams, or splitting into smaller groups to form a group with any of the eight players. When  we have an extra copy of the adventure packs, we can take some of the quests at the same time. such as The Hunt for Gollum - players can compete then that the first team out to get Gollum - and the one that will make the first complete Return To Mirkwood. After completing each quest, each player individually adds up points victory, counts threat. And say, as Glaurung said when heroes die - die forever. and when all the heroes one player in the single quest die, player be eliminated from the game. If player at least one hero survived quest, even if it lost because of the treat, he may choose the new heroes of the currently available When player fail quest only by treat, just can replay quest again. players play until the Middle will remain the last player .. players count the results of all the quests in which they took part, and the result determines the winner. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787693","commentId":787693,"userName":"13thcaesar","timestamp":1366635380,"content":"This idea is good for a funny tournament.\n\n \n\n \n*  The tournament involved two 4-person groups.Each group takes place at the same time, two scenarios - Passage Through Mirkwood and Journey Down The Anduin.\n \n* If all player heroes will die in the current scenario, the player is eliminated from the game (Player counts and sums the final results of all the quests in which he participated = final result of the player).\n* If there are no scenarios are available, which the player could take that player is eliminated from the tournament (counts and sums the final results of all the quests in which he participated = final result of the player).\n* If a player's hero dies during the current quest, but the rest of the heroes survive, the player must play another quest surviving heroes.\nIf a player is eliminated from the quest because of the threat, the player must play the quest again (until it succeeds or until elimination from the tournament due to the death of all the Heroes).\n \nPlayers belonging to the group that goes to Lorien can:\n \n* Select the next path - in order from the player with the best end result.\n* Players can create new groups - 4 - persons, three-persons, two-persons or take the quest alone - if no one wants to join the player.\n* If other groups  also reside in Lorien - players can create new groups with members of other groups.\n* Players can make up your deck with new available at the time of Heroes, the place of the dead, or replace the current. Dead heroes are eliminated from the game forever and unapproachable. The heroes you are currently playing any of the other players are also currently unavailable.\n* Players can in any way modify their decks\n \nThese possibilities are also available in Rivendell and Minas Tirith.\n \nrestrictions and rules as the individual paths:\n \n* Shadows Of Mirkwood Cycle - This cycle can at the same time play any number of groups (each player / group interacts with its copy of the set of adventures). If a some player / group that completes the cycle, it becomes unavailable until the end of the tournament. If any player / group takes any scenario in this series, at the time in which another player / group completes it, the other players / groups for they fail (break played scenario, adding up your points) and return to Lorien.\n \n* Escort Arwen (The Redhorn Gate and Road To Rivendell) - at one time, only one player / group can take on this path - and is not available for the rest of the players, as long as players play one of these two scenarios. If any player / group will complete these two scenarios, the path becomes unavailable until the end of the tournament.\n \n* Khazad-Dum - This expansion may, at the same time play any number of groups (each player / group interacts with its copy of the set of adventures). At the moment in which, any player / group gets back from Rivendell to Lorien (Dwarrowdelf go through a cycle starting from a set of adventures Watcher In The Water) - Khazad-Dum becomes unavaiable to the end of the tournament (but players who at the moment are currently playing one of the three included in the the scenarios unfold them to complete the expansion - or elimination from the tournament due to the death of all the characters).\n \n* Dwarrowdelf cycle (starting Watcher In The Water) - Not for the players who finished their Khazad-Dum (practically available only for players / groups who have successfully escorted Arwen). If any player / group completes the cycle becomes not available until the end of the tournament (but players who at the moment are currently playing one of the contained in this cycle scenarios unfold it to complete the cycle - or elimination from the tournament due to the death of all the heroes ).\n \n* Expansion Saga and The Battle Of Lake-Town - These scenarios may at the same time play any number of groups (each player / group interacts with its copy of the set of adventures), but each player can only once in the tournament complete each of these scenarios.\n \n* Heirs Of Numenor Expansion, - at one time, only one player / group can take on this path - and is not available for the rest of the players, as long as players play one of these three scenarios. If any player / group will complete all three scenarios, the path becomes unavailable until the end of the tournament.\n \n* Against The Shadow Cycle - This cycle can at the same time play any number of groups (each player / group interacts with its copy of the set of adventures). If a player / group that completes the cycle, it becomes unavailable until the end of the tournament. If any player / group takes any scenario in this series, at the time in which another player / group completes it, the other players / groups for they fail (break played scenario, adding up your points) and return to Minas Tirith.\n \n* The Massing At Osgiliath - This scenario may at the same time play any number of groups (each player / group interacts with its copy of the set of adventures). If a player / group completes the this scenario, it becomes unavailable until the end of the tournament (but players / groups who at this moment are currently playing this scenario unfold it to Completion - or elimination from the tournament due to the death of all the characters).at the moment in which one of the players / groups complete cycle Against The Shadow, this scenario becomes unavailable.(However, the players / groups who at this point are currently playing this scenario unfold it to Completion - or elimination from the tournament due to the death of all the characters).\n \ntournament ends when:\n \n* All quests are completed, or are no longer available quests, who kept the remaining players would be taken.\n* All players will be eliminated (due to the death of all heroes during quest).\n \nafter the occurrence of one of the above tournament ends and each player individually adds up the results of all the quests in which he participated. the player with the best final result is the winner takes first place in the tournament.\n \nPlayer be eliminated from the tournament when:\n \n* All player  heroes will die during quest.\n* no longer available quests which player could take.\n \nScore (after passing each quest, each player individually adds up your score according to the following criteria):\n \nFinal Threat Level + Threat Cost Of Each Dead Hero + Damage Tokens on Remaining Heroes +  additional 10 points for each round of play that is taken to defeat a scenario.= Player\nSubtotal.\n \nCombined Player Subtotals - Victory Points Earned - Difficulty Level Of Scenario = Final Player Score for actual quest.\n \n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787928","commentId":787928,"userName":"KriKKe","timestamp":1366691733,"content":"This seems like a very good idea for a tournament! If someone wants to make a pdf version of a tournament setup like this, I would be very interested. Maybe I can run it at the local gamestore and get some people together that play LOTR LCG, because it seems that most people play it at home in my region.\n\n(BTW, I'm kind of new here, so hello everyone!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787983","commentId":787983,"userName":"13thcaesar","timestamp":1366707307,"content":" \n\nIt is a general concept for now the tournament, and many elements need to work out:\n \n* Scenarios from Saga Expansions, and Battle Of The Lake-Town don't have stated Difficulty level - so you need to objectively determine this level.\n \n* As these Expansion Saga, and Battle Of The Lake-Town are the stories that the heroes can hear in Rivendell that can determine if all player heroes will die in one of these scenarios, it is not eliminated and can continue to play this heroes - but it is not possible replay this scenario.\n \n* What the score for completing scenario - I do not know whether the same difficullty level of a given scenario is not too low a reward for completing it (the penalty + 10 points for each round), and grant such - Difficulty level x 10.\n \n* A cycle against Shadow has not yet been released and the content of the various scenarios of this cycle I only know of the views published by FFG - therefore possible that after the publication of this cycle, the restrictions and rules for this cycle should be modified, or even the cycle split into two paths as escort Arwen and Dwarrowdelf cycle. The heroes in this cycle can also wander into another Major sites/city which will benefit  in the same possibilities as in Lorien, Rivendell and Minas Tirith. Or, you may receive the opportunity to return to Rivendell and Lorien from Minas Tirith - in which, however, doubt the published reviews.\n \n* And of course, these rules must be tested - but I myself do not have the possibility of meeting 8 people to test it (but if someone would check it out I happy to read reports and insights and observations on this mode ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] \n \nIf however the tournament rules would be playable and worked well in practice, so, if coming new cycles and expansions,  same world of Middle-earth tournament has grown to be creating more opportunities to travel - opening up new paths, new main sites/city, or the possibility of returning to Lorien, Rivendell and Minas Tirith, and more freedom / roads in multiple traveling beetween this Main Sites/city.\n \n13thcaesar\n \n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787991","commentId":787991,"userName":"13thcaesar","timestamp":1366709274,"content":"Tournament in this form made some narrative maintains consistency, gives players feel like really traveling around Middle-Earth. It also lets allows you to create a community in the game, thanks to the freedom to create groups in the tournament. players can cooperate, compete, or change any group, if  you do not feel good in the present, or feel that chosen by the group path is not for him. However, the currently available cycles and expansion, its more like a race - if one group goes Heirs Of Numenor, the road to Minas Tirth and related scenarios on this city will be disabled for the rest of the players - closing them in Rivendell and Lorien. just as if a group returns to Lorien from Rivendell by Dwarrowdelf cycle - as a group and the rest of the players staying in Lorien stuck to the end of the tournament at this Main Location. But I think that the principle of elimination from the tournament at the time when all player heroes will die in the current scenario, the ability to reduce a little, blocking the rest of the players, and the free exercise scenarios - all the more so, some can be downright deadly for Heroes;)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=787998","commentId":787998,"userName":"13thcaesar","timestamp":1366710412,"content":"Of course there is no limit to the number of players that may be involved in this type of tournament. with fewer players can be the first two scenarios begin in smaller three-person, two-person groups or establish that these two startup scenarios, each player has to go solo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=788000","commentId":788000,"userName":"KriKKe","timestamp":1366710781,"content":"Well, I was thinking more of organized play than a tournament probably.\n\nLet's say we have three tables of four people. Then each table could represent a city with a storyline (a number of quests). Then there are up to 12 people who all have 3 heroes and a deck (like 12 small parties residing in one or the other city). Each party starts in a city so that all the tables are filled. Then the first part of the story (first quest) starts and every table tries to beat the first part of the story in their city (the first quest).\n\nAfter that the next part of the story can be played at each table, but with different arrangements of parties. Basically all the players can try to guess based on previous information what kind of decks will be better for the next quest, that is only given after rearrangements have been made for example (I don't know if that will work well, I'm just improvising for the moment). The story has to be adapted of course for the parties to be able to communicate in between quests and to travel between cities. For example, the second part of the story cannot take place the day after the first while suddenly two parties join the mission that were hundreds of miles away the day before. And of course dead heroes cannot be revived.\n\nAnother thing I was thinking of are card pool limitations/bonusses at each table, like Gondor Bonus in Minas Tirith or something but I don't know yet how to do that more concretely.\n\nAt the end as many storylines as possible have to be completed and the scores of all the quests can be added to see how well everyone has played. It's not really a tournament as all 12 players basically work together, but it seems like a lot of fun and very thematic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=788025","commentId":788025,"userName":"13thcaesar","timestamp":1366714515,"content":"I look forward to the report of the session;)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=788075","commentId":788075,"userName":"KriKKe","timestamp":1366722370,"content":"I don't think there will be a report soon, as it is only an idea that popped into my head by reading your post. I don't have all the cards of the game yet so the quests that I know are limited. Also I normally play with 2 players so I don't know how difficult quests are with another amount of players. It seems to me that this is very important to balance things out. Probably it's not the best thing to always do the quests with 4 players in 3 cities to make it both challenging and balanced. If anyone has other ideas or remarks, please post them ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=788098","commentId":788098,"userName":"Raven1015","timestamp":1366726342,"content":"Ellareth said:\n\nFeels very RPG-style, with Lorien, Rivendel and Minas Tirith as save spots where you can swap party members (Characters), equipments (attachments) or learn new skills (attachments / event).\n\nI see Lorien as beginner's town that you cannot go back to after doing certain quest (either one of Khazad-Dum related quests) with hidden dungeon for hardcore players (Dol Guldur).\n\nLove the way you fit Out-of-Time Frame expansions as tales.\n\n \n\nOnce we get more card pool, limit certain cards with certain trats until appropriate locations are unlocked (Warden of Healing cannot be added until Minas Tirith), make some of the 'powerful' card unlockable by completing 'Side Quests' that does not unlock new area (such as Hunt for Gollum), and you've gotten a very board gamey RPG style card game.\n\n\n\nYes! I've been trying to think for awhile about how to make this game feel more RPG-like with continuity between quests, and the OP has really hit on a very simple idea that has a lot of potential. It can either be adapted for tournaments, and people have come up with some good ideas, but I'm also thinking even in terms of a fun campaign mode solo or multiplayer. Particularly the idea of unlocking cards would work very well for this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880142","commentId":880142,"userName":"13thcaesar","timestamp":1380749822,"content":" \nOk, so I started LOTR campaigns based on the selection of paths. I played on three decks. To make it more thematically, I made  decks on heroes and allies only from the Kingdom of Thralundil and Erebor, and whose heroes could meet during a journey from  the Palace Of Thralundil to Lorien. So, from The Lonely Mountain and the Palace of Thralundil went group consisting of Dwarves, Silvan, and in the Valley of Anduin gaining allies among the Dunedain and the Eagles (The decks are only allies of the Dwarves, Silvan, Dúnedain and Eagles).\n\n \n\n \n\nDecks:\n\n \n\n1. Dain, Bifur, Mirlonde.\n\n2. Gimli, Thalin, Legolas.\n\n3. Dwalin, Gloin, Aragorn.\n\n \n\nHere are the results of a journey to Lorien:\n\n \n\n \n\nI. Passage Through Mirkwood (104):\n\n \n\nPlayer Subtotal:\n \n\n1. Dain, Bifur, Mirlonde - 21.\n\n2. Gimli, Thalin, Legolas - 31.\n\n3. Dwalin, Gloin, Aragorn - 32.\n\n \n\nCombined Player Subtotals - 84.\nVictory Points Earned - 0.\n\nNumber of Rounds - 2.\n\nFallen Heroes - 0.\n\n \n\n \n\nII Journey Down The Anduin (131):\n\n \n\nPlayer Subtotal:\n \n\n1. Dain, Bifur, Mirlonde - 29.\n\n2. Gimli, Thalin, Legolas - 31.\n\n3. Dwalin, Gloin, Aragorn - 38.\n\n \n\nCombined Player Subtotals - 98.\nVictory Points Earned - 7.\n\nNumber of Rounds - 4.\n\nFallen Heroes - 0.\n\n \n\nLORIEN:\n\n \n\nWhen I coming to Lorien, \"decks\" gained access to new cards:\n\n \n\n> Lorien Guide x3.\n\n> Haldir Of Lorien.\n\n> Protector Of Lorien x2.\n\n> The Favor Of The Lady x3.\n\n> The Galadhrim's Greeting x3.\n\n \n\nAnd also the possibility choice of  path:\n\n \n\n \n\na) Gandalf has requested your assistance in the search for the elusive creature known as Gollum.\n\nb) The heroes enter the mines of Moria at the behest of the White Council, carrying an important message to Balin. \n\nc) Celeborn has bid you escort Arwen to visit her father in Rivendell.\n\nd) The Lady Galadriel of Lorien has asked you to investigate the area in the vicinity of Dol Guldar.\n\n \n\nSo now I must choice my next path.\nSo that's looks  the beginning of my campaign. I introduced a thematic restriction of Heroes and cards, that I \"get\" when it reaches the appropriate \"site-city\" ( Noldor in  Rivendell, Gondor and Outlands in Minas Tirith).\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880159","commentId":880159,"userName":"Cunir","timestamp":1380751131,"content":"I like the idea that you can only access certain types of card once you reach a certain location... It's like you're meeting each hero where he lives, and after that you can recruit them for your campaign.\n\nMaybe you can do something similar with the allies. For example... You can only start using elven allies once you've recruited an elven hero into your party (which you can only do once you've met one in Lorien or rivendell). Because, let's face it, no elf is going to ally themselves with a party of dwarves -- you need an elf hero in there to gain their trust\n\nEdited October 2, 2013 by Cunir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880679","commentId":880679,"userName":"TheDisturbed1","timestamp":1380811243,"content":"I really like this idea. I think I might try something similar.\n\n \n\nI skimmed a few of the longer posts, so I apologize if this has already been suggested, but to add to the flavor of the campaign, I think I am going to limit myself to using heroes and allies that havent yet appeared in the encounter decks I havent gotten to yet.\n\n \n\nSo no using Elrond until I actually get to Rivendell. No Arwen until after the two sets in which she is an Objective Ally. Etc.\n\n \n\nIt shouldnt put too many limitations on the table, but it should make it a bit more interesting. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880732","commentId":880732,"userName":"Gizlivadi","timestamp":1380816039,"content":"This is something I've been wanting to develop since the beggining of the game. Sadly, right now I don't think the card pool is big enough to really support this adecuately, but as more areas are explored in the game, the more areas we will be able to explore like this. Also, I would like to develop a variant like this where you use a map and wander freely across Middle Earth, a la Meccg, complete with \"haven\" sites where you can modify your deck, recruit new allies or heroes, split your companies, etc. \n\n \n\nAnother idea I would love for the developers to actually make within quests (I may make a new thread for it) is the idea of \"modular\" quests, in which, within the quest itself you are given a variety of options, like, for example, choose to follow Gandalf's advice and go to location X and thus go to stage Xa, or follow your own path to location Y and thus to stage Ya, much in the style of Choose your own adventure books. In this manner you can actually choose which stage to go to (according to your deck's style, maybe one option is a battle quest which is best if you're playing tactics, the other a sneaky \"questy\" stage, best when playing secrecy) instead of randomly choosing a stage like in Passage through Mirkwood."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880746","commentId":880746,"userName":"13thcaesar","timestamp":1380817149,"content":" \n\nThe Deck is composed of two Elves of Mirkwood (Legolas and  we can say Mirlonde), Aragorn, who is known for that   traveled across the Middle-Earth and dwarves of Erebor (Dain, Bifur, Gloin, Dwalin, Gimli and Thalina - who lived to the time of the which are embedded scenarios), which is close to the Mirkwood. So that's why I chose these characters into the campaign, because I spent most thematically connected with the beginning of the expedition (Passage Through Mirkwood).\n\n \n\nThorin, Kili and Fili was killed during the Battle of the Five Armies, Balin, Oin and Ori died in Moria (which characters they learn of Khaz-Dum), so I do not have those characters in my decks.\n\n \n\nAccess to the other Heroes and the characters I receive after reaching the appropriate location:\n\n \n\nElrond, Glorfindel, Elrohir, Elladan can join the team at Rivendell (replacing one of the current Heroes), as allies and cards feature Noldor, or derived from the Rivendell - Rivendell Blade, Bow Rivendell, Asfaloth.\n\n \n\nThe same with the cards and heroes of Gondor and the Outlands - available in Minas Tirith.\n\n \n\nI also thought about the possibility of gaining access to the card after some quests, for example,  as Beornings after passing Conflict At The Carrock (except Beorn), Radagast after passing A Journey To Rhosgobel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880769","commentId":880769,"userName":"13thcaesar","timestamp":1380819367,"content":"These are the decks I play:\n\n \n\n \n\nDeck 1: Legolas, Gimli, Thalin:\n\n \n\nVeteran Axehand x3.\n\nVeteran Of Nanduhirion x3\n\nErebor Battle Master x3\n\nBofur x2\n\nLandroval x2\n\nWinged Guardian x3\n\nVassal Of The Windlord x3\n\nEagles Of The Misty Mountains x3\n\nGandalf x3\n\n \n\nDwarven Axe x2\n\nRing Mail x2\n\nSupport Of The Eagles x2\n\nBlade Of Gondolin x2\n\nGreat Yew Bow x2\n\nBlack Arrow\n\nHorn Of Gondor x2 (Yes, I know that this card should be available in Minas Tirith is one of the two exceptions in my decks).\n\n \n\n \n\nFeint x3\n\nThe Eagles Are Coming! x3\n\nKhazad! Khazad! x3\n\nHands Upon The Bow x3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880789","commentId":880789,"userName":"13thcaesar","timestamp":1380820480,"content":"Deck 2:Mirlonde, Bifur, Dain Ironfoot:\n\n \n\nDaughter Of The Nimrodel x3\n\nErebor Hammersmith x3\n\nMiner Of The Iron Hills x3\n\nSilvan Tracker x3\n\nMirkwood Runner x3\n\nErebor Record Keeper x3\n\nLongbeard Elder x3\n\nGandalf x3\n\n \n\nNarvi's Belt x2\n\nHardy Leadership x2\n\nKing Under The Mountain x2\n\nLegacy Of Durin x2\n\nCram x3\n\n \n\nLure Of Moria x3\n\nWe Are Not Idle x3\n\nTo Me! O My Kinsfolk! x3\n\nSneak Attack x3\n\nDurin's Song x3 (Protector Of Lorien x2, Haldir Of Lorien)*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82683-campaign-lotr/?do=findComment&comment=880806","commentId":880806,"userName":"13thcaesar","timestamp":1380821938,"content":"Deck 3: Aragorn, Gloin, Dwalin:\n\n \n\nSilverlode Archer x3\n\nNorthern Tracker x3\n\nDunedain Watcher x3\n\nSilvan Refugee x3\n\nZigil Miner x3\n\nLongbeard Orc Slayer x3 (Lorien Guide x3)*\n\n \n\nCelebrian's Stone x2\n\nSword That Was Broken x3\n\nRing Of Barahir x3 (The Favor Of The Lady)*\n\nUnexpected Courage x2\n\nDunedain Mark x3\n\nDunedain Warning x3\n\nSteward Of Gondor x3 (second and the last card that should be available in Minas Tirith)\n\n \n\nGrim Resolve x2 (The Favor Of The Lady)*\n\nFortune Or Fate x2 (The Favor Of The Lady)*\n\nA Test Of Will x3\n\nUntroubled By Darkness x3\n\nDesperate Alliance x3 (The Galadhrims Greeting x3)*\n\n \n\n \n\n(...)* - card replaced after reaching the Lorien"}]}