{"url":"https://community.fantasyflightgames.com/topic/82738-2-vs-3-copies%E2%80%A6/","title":"2 vs 3 copies…","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82738-2-vs-3-copies%E2%80%A6/?do=findComment&comment=787617","commentId":787617,"userName":"Noccus","timestamp":1366623404,"content":"Hi,\n\n \n\nI’ve been reading some LotR LCG discussions here and there on the web, old & new.\n\nSome interesting and some not, but what got me thinking a bit (which does not happen much) was talk about the amount of copies per card per deck, and I was quite surprised.\n\nThe general consensus seemed to rely on 3 copies per card; with this core reasoning behind it:\n\n“If the card is worth including, it’s worth adding 3 copies.”\n\nWell, I disagree and here’s why: The flexibility of your deck goes down by a third.\n\nWith 3 copies of every card you’ll have a CHANCE that you might draw said card faster sure, but you’ll quickly run out of much needed different options in your hand when not playing mono-sphere. And it seems to me most people duo-sphere, where we usually have to cut cards from our decks to keep the amount of cards to a minimum.\n\nThis is why I use 2 copies when playing alone, and even 1 of some unique cards; and must say I have almost no trouble beating quests usually….with a few exceptions.\n\nSince I started I’ve build decks myself, with some added ideas I plucked of the web.\n\nNow I’ve been playing for a few months, and thought I got the hang of it, but this 3 copy thing people swear by kind of puzzles me: Flexibility > Chance ….yes or no?\n\nOf course it depends on the deck and which card, but I’d like to know what people here generally do and their reasoning for it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82738-2-vs-3-copies%E2%80%A6/?do=findComment&comment=787630","commentId":787630,"userName":"richsabre","timestamp":1366624731,"content":"my deck building is as follows\n\n-key cards to the fuction of the deck = 3 copies (eg. steward of gonder in a resource generating deck, feint/ rivendell sword in an all elf blocking/fighting deck)\n\n-card i want to see in almost every game at some point before  i lose or win but are not absolutely key to the decks strategy = 2 copies (eg. fast hitch in a deck with 1 hobbit in….if there were more hobbits FH would move to 'key card')\n\n-card that belongs in the deck and can have a great combo if you have the right cards in play = 1 (expert treasure hunter if i have stargazer in play)\n\n \n\nthats a general guide i use, but its flexible. most cards in a deck i build i consider 'key' as i usually build for a certain function, so i mostly have 3 copies, but i certainly dont hold by the '3 or nothing' rule\n\nanother important thing to consider is you card draw and deck manipulation cards….do you have stargzer, bombur or master of the forge in play? these cards are excellent for drawing key cards out of your deck meaning you often dont need 3 copies. maybe you have ancient mathom or foe hammer, thse can go through your deck at a super fast pace, meaning you are more likely to see your whole hand\n\nfinally on the topic of raising chances, there are two cards that do this. daerons runes and we have not been idle. these two cards get rid of themselves whilst allowing you to draw another card from your deck, effectively meaning you can run with a 44 card deck. obviously less cards means a higher chance of drawing the ones you want.\n\nif we are talking whether we should go for chance or flexibilty, without talking about the chances of drawing certain cards, then i would say it depends on the deck you are building. some decks are more specific than others. in my fight to the ford deck (lore strider, spirit glorfindel, frodo) i really need asfaloth, light of valinor, master of the forge, and fast hitch really helps. in the partner to this deck, the three archers (legolas, brand, bard) i really want the yew bow out, feint and thicket of spears are key also, and i also want foe hammer, goblin cleaver, and straight shot. so all these cards gets 3 copies. black arrow is also key but you are only allowed 1 copy per deck\n\nin my dwarven decks the same applies for legacy of durin, narivs belt and erebor battle master.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82738-2-vs-3-copies%E2%80%A6/?do=findComment&comment=787659","commentId":787659,"userName":"joezim007","timestamp":1366628695,"content":"I'm actually pretty new to the game and one of my main experiments is to test this out. I feel like if you have a lot of good card drawing, then 2 copies of a lot of cards can be much more doable, but if your card drawing sucks, then 3 is a better bet for cards that are really good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82738-2-vs-3-copies%E2%80%A6/?do=findComment&comment=787678","commentId":787678,"userName":"Ellareth","timestamp":1366631622,"content":"It depends on what kind of deck you are building.\nBefore I begin, I'll let you know I usually play with trisphere deck.\n\nBefore, only source of Card Draw we had really limited Card Draw. (Pretty much Beravor/Bilbo, Lorien's Wealth, Ancient Mathom, or Valiant Sacrifice for me. And it was rare to have more than two of them in the same deck)\n\nSo it was better to have reliability by having 3 copies of same card. Some people actually ran Campire Songs and such in solo game to thin out the deck for that purpose.\n\n \n\nBut now, we have so much card draw and player deck milling that I can go through 60~70 card Dwarf deck, use Will of West to reshuffle it, and go through it again in about 7~8 turns. So I tend to include 2 copies of same cards (even key cards such as Durin's Legacy) rather than 3 copies because I know I can get them.\n\n \n\nIn the end, (like others said) it all comes down to how much draw power you have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82738-2-vs-3-copies%E2%80%A6/?do=findComment&comment=788388","commentId":788388,"userName":"Noccus","timestamp":1366793033,"content":"First, thanks for the replies.\n\nI must say I concur with most things you say, both rich & elladeth.\n\n \n\nRich, I kind of use the same idea to set up a deck; the only difference being the interpretation of the word key-card. To me anything that isn’t mandatory i.e. the deck won’t function, is not a key-card. This includes cards like light of valinor, test of will, feint or steward of gondor to name a few examples which others would normally consider key. I include them, hope, to draw them of course, but can work well enough if I don’t have these in-hand or on the table right of the bat. Multiple copies of the same card in your deck means more chance to draw the same card again once you already have it. Meaning you quite possibly loose a valuable draw turn and more dead cards in your hand. Worse, if it’s a unique card (which usually are better) it means you have no way to use it except to feed discard abilities on cards…if included in your deck. So I’ll stick with 2 copies I think, as it works fine for me. I like the flexibility it brings as mentioned in my op. Each to whatever works for him.\n\n \n\nElladeth, I can’t say I’ve seen the early days of this game with the lack of options of drawing, but I agree with you that card draw is a  powerful tool to get what you want as fast as you can. For this reason alone I do include 3 copies of cards like daeron’s runes. It, and most other draw ability cards, have never been dead cards in my hand. Yet I do not really use them in the way you mention: to fish out key-cards I have to have on the table to function. Rather, I include them to increase the options in my hand: i.e. flexibility to react on whatever the encounter deck tosses at me every turn. Though the way you describe cycling through a 60-70 card deck several times in a game really inspires me to try and build something like that. I like the idea and am going to try. Thanks!"}]}