{"url":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/","title":"More female heroes ever?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=787746","commentId":787746,"userName":"brilk","timestamp":1366650414,"content":"I just picked up the game and have really enjoyed it so far. The first thing I did when I opened the box was throw together a deck using the three female heroes. After winning my first game, I went online to find which expansions to buy to get more female heroes. I was incredibly surprised and disappointed to find out that out of the 31 heroes printed so far, the three females in the base set were it. The site was dead, so hopefully there's been at least one more female hero printed since then. I can't find set lists anywhere, though.\n\nHas there been any talk of adding additional female heroes? I get that the LOTR books were a huge sausage-fest, but I'd be really happy if the ratio improved at least a bit. I'm sure there's something to work with in the source material."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=787750","commentId":787750,"userName":"richsabre","timestamp":1366651042,"content":"hello,\n\nyou are certainly not the first to ask this, and i shall give the answer i gave the last couple of times in the least sexist way i can, so i dont end up insulting people :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nthe reason there is little female heros is as you say, there are few major female character in the books. now whether this was the era it was written in, personal choice ,chance etc….i dont think it matters….the point is though, ffg are purposely working with the book's characters which, i think everyone can agree, is a good thing….we are here afterall because of tolkien's creation\n\nnow someone could say 'just make some up' or make the lesser known female characters heros…and that is perfectly fine, but i think it just comes down to the designers concentrating on the core characters\n\n you would probably think that there would be a good few females to make heros…but i have read the trilogy more times than i can remember, and there really isnt that many.\n\ni really have no problem if ffg decide to create some female heros such as beravor, i mean she is a great creation, and is in line with tokien lore, but i dont see them doing it just for that reason…which brings me onto your question of plans for others….the answer is no, but there seems to be at least a couple of women spoiled in the upcoming gondor packs.\n\ni wouldnt fear though…we still have a lobelia sackville baggins to come..and she is worth at least 3 characters :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich\n\nPS. i'd just like to point out i dont speak for the design team, they may or may not have the same ideas as i posted here (just thought id post that as its a sesitive subject and i like being respected on this forum ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=787779","commentId":787779,"userName":"Raven1015","timestamp":1366656039,"content":"The picture is even worse if you consider that 2 out of the 3 female heroes were created by FFG (Beravor and Eleanor) and only 1 was actually in the source material (Eowyn). It seems that FFG struggled to find female heroes from the very beginning, and this remains true today. To directly answer your question, there have been no news or spoilers related to future female heroes. Arwen has showed up as an ally card, but that doesn't mean she might not be a hero later (in fact, this wouldn't surprise me). We are certain to see Galadriel at some point as a hero, and she should be one of the most powerful heroes in the game, if they are staying true to the source material (which they have so far). Beyond Arwen, a new version of Eowyn, and Galadriel, FFG is going to have to create more characters from scratch if they want to increase the female representation. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=787789","commentId":787789,"userName":"richsabre","timestamp":1366658177,"content":"yeah i cant wait for galadriel. she will be crazy powerful….certainly she will make up for the lack of female heros. and im sure her coming will bring about a few more female elves (im thinking like the minstrel)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=787794","commentId":787794,"userName":"Colino","timestamp":1366659581,"content":"No doubt Galadriel will be fantastic, it would be fitting if she were as powerful as Elrond is, who in my opinion is one of the best heroes in the game and also very well designed thematically.\n\nI'd also like to see a tactics Eowyn whenever the Rohan cycle comes around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=787799","commentId":787799,"userName":"richsabre","timestamp":1366660052,"content":"Colino said:\n\nNo doubt Galadriel will be fantastic, it would be fitting if she were as powerful as Elrond is, who in my opinion is one of the best heroes in the game and also very well designed thematically.\n\nI'd also like to see a tactics Eowyn whenever the Rohan cycle comes around.\n\n\n\nboth very valid points…..certainly in the books she was more powerful and older than elrond (im sure i remember that he was her minstrel for a while….if my memory serves me well)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=787817","commentId":787817,"userName":"Thanatopsis","timestamp":1366666014,"content":"You should try a \"Ladies of Middle Earth\" deck.\n\nThe three female heroes, plus\n\nAll the lore and spirit female allies:\n- Lorien Guide\n- Daughter of the Nimrodel\n- West Road Traveller\n- Rivendell Minstrel\n- Imladris Stargazer\n- Arwen Undomiel\n- Envoy of Pelargir\n- Silvian Tracker\n\nand all cards with female characters on them:\n- Galadrhim's Greeting\n- Protector of Lorien\n- Favor of the Lady\n\nYou have to round it out with a few staples: burning brand, test of will, unexpected courage, hasty stroke, etc. but it's not that bad of a deck. You have card draw, healing, cancellations, and high willpower. Unfortunately, you need a bunch of men to bail you out on the attack and defense side"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788023","commentId":788023,"userName":"lleimmoen","timestamp":1366714270,"content":"I like the female deck, good pics, though I don't think Lórien Guide is female.\n\nYes, Galadriel is probably a character most readers are very much looking forward to. I certainly am, probably most beside Tom Bombadil (whom I hope to see as an ally one day). I hope Galadriel has some very extreme ability (for a cost, of course). I think she might be threat cost 14, that would suit her well being one over Elrond even; 4 will, 1 attack, 3 defence, 4 hp, two extra cost for the ability sounds good to me. And Spirit, of course, not that that sphere has got less than others but if it is actually lacking something, it is the heroes…\n\nPublish [http://www.fantasyflightgames.com/edge_public/img_edge/spacer.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788039","commentId":788039,"userName":"richsabre","timestamp":1366717520,"content":"lleimmoen said:\n\n \n\nI like the female deck, good pics, though I don't think Lórien Guide is female.\n\nYes, Galadriel is probably a character most readers are very much looking forward to. I certainly am, probably most beside Tom Bombadil (whom I hope to see as an ally one day). I hope Galadriel has some very extreme ability (for a cost, of course). I think she might be threat cost 14, that would suit her well being one over Elrond even; 4 will, 1 attack, 3 defence, 4 hp, two extra cost for the ability sounds good to me. And Spirit, of course, not that that sphere has got less than others but if it is actually lacking something, it is the heroes…\n\nPublish [http://www.fantasyflightgames.com/edge_public/img_edge/spacer.gif]\n\n \n\n \n\nwe would also get her mirror, which would offer some deck peeking abilities. and nenya of course. i think she would give some sort of major defense stat buff to every character in play.\n\nrich\n\nps. what s with that publish button?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788088","commentId":788088,"userName":"Style75","timestamp":1366724300,"content":"There was also Tom Bombadil's wife, Goldberry. While she's more nature spirit than mortal, she would make a very intriguing female character for the game and hopefully would have some fun abilities.\n\nAlso, Galadriel should be a LOT more powerful than Elrond. Tolkien said she was the \"mightiest and fairest of all elves that remained in middle earth\". So if Elrond has starting threat 13, I would expect Galadriel to be a 14 or 15. She should also come with some crazy powerful abilities.\n\nOn the issue of gender, I've always found it interesting that Tolkien included so few female characters, but the most powerful character in the books is female. I'm sure there's been some kind of psychoanalysis written about that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788095","commentId":788095,"userName":"lleimmoen","timestamp":1366725637,"content":"Haha, I don't know what the button is, I actually responded right after that but that didn't get through at all.\n\nI also find Tolkien's approach to female characters interesting. They are rare in both quantity and quality. Goldberry is another good call. I am really looking forward to that Old Forest couple. I know some people think these characters should not come as player cards, and I understand their point; but my desire to play with these iconic characters is just too great to wish otherwise. There could be an interesting consdition when these allies (as I see them) could be played.\n\nGaladriel, on the other hand, must be a hero, now that Elrond is. But I do not think we see her in this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788102","commentId":788102,"userName":"Captain Poe","timestamp":1366726926,"content":"FFG has not made an additional made up characters since the core set. Since Tolkiens writings lack female characters, there is some what limited options. You have Arwin and Gladriel, but outside of that, the arent really any realy qualifying characters. I guess they could make a tactics eowyn or something, but that doesnt really help get more options for characters.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788110","commentId":788110,"userName":"richsabre","timestamp":1366728190,"content":"lleimmoen said:\n\n \n\nGoldberry is another good call. I am really looking forward to that Old Forest couple. I know some people think these characters should not come as player cards, and I understand their point; but my desire to play with these iconic characters is just too great to wish otherwise. There could be an interesting consdition when these allies (as I see them) could be played.\n\n \n\n \n\nthis exactly……no matter how sacred they are, this game just cant end (whenever that will be….may our beards grow long before it happens) without having seen those two…i think that goes without saying :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788145","commentId":788145,"userName":"gatharion","timestamp":1366734731,"content":"I'd very much like to see Tom Bombadil and Goldberry in the game, but I suspect it will be in the form of allies for a particular quest.\n\n \n\nGaladrial and a more martial Eowyn are certainly needed. Aside from that, I just don't know. I wouldn't mind a few more FFG made up ladies (there will be an invented female elf in the next Hobbit movie, because Jackson was having the same problem), but I'd be lying if I said that I'd be especially excited about more invented female characters. Much, if not most, of the time my decks are constructed around characters I want to play, rather than abilities I want to have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788191","commentId":788191,"userName":"Raven1015","timestamp":1366741291,"content":"I suppose they could always throw in Rosie Cotton at some point ;-)\n\nIt's too bad that FFG likely won't be able to ever get rights to the Silmarillion, as that work has a lot of very interesting and powerful female characters in it that would make great hero cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788205","commentId":788205,"userName":"richsabre","timestamp":1366743009,"content":"tolkien gets alot of bad comments about the women thing, but i think we have to remember that tolkien based middle earth on various medieval and post medieval cultures…all of whom would not have had place for women in fighting and so on, and given that war and danger is the basis for the novels, its hardly surprsing that women dont feature\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788258","commentId":788258,"userName":"Pharmboys2013","timestamp":1366755742,"content":"it was mentioned briefly before, but if FFG goes the route of making non-canon female heroes i think it would be a brilliant idea to make Tauriel whom nearly all tolkien fans will be familiar with after the next hobbit movie.  I can see licensing issues mucking up those proceedings although so it may be more likely we will only see new versions of eowyn and arwen along with the long awaited galadriel"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788339","commentId":788339,"userName":"richsabre","timestamp":1366779442,"content":"Pharmboys2013 said:\n\n \n\nit was mentioned briefly before, but if FFG goes the route of making non-canon female heroes i think it would be a brilliant idea to make Tauriel whom nearly all tolkien fans will be familiar with after the next hobbit movie.  I can see licensing issues mucking up those proceedings although so it may be more likely we will only see new versions of eowyn and arwen along with the long awaited galadriel\n\n \n\n \n\nsurprise surprise i would absolutely hate that…(not that im picking at your idea….just the thought in general :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )..grrr…..it makes my beard wither to think of a game focused on the books take a PJ invention (she is right? ..im avoiding the hobbit films on principle). but as you say, it would never be allowed to happen anyways\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788364","commentId":788364,"userName":"John85","timestamp":1366787695,"content":"Style75 said:\n\nThere was also Tom Bombadil's wife, Goldberry. While she's more nature spirit than mortal, she would make a very intriguing female character for the game and hopefully would have some fun abilities.\n\nAlso, Galadriel should be a LOT more powerful than Elrond. Tolkien said she was the \"mightiest and fairest of all elves that remained in middle earth\". So if Elrond has starting threat 13, I would expect Galadriel to be a 14 or 15. She should also come with some crazy powerful abilities.\n\nOn the issue of gender, I've always found it interesting that Tolkien included so few female characters, but the most powerful character in the books is female. I'm sure there's been some kind of psychoanalysis written about that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\nThere is a short article in Vol.7 of Tolkien Studies that deals with some issues of gender (in the sense of nouns having gender) entitled \" 'Elves (and Hobbits) always refer to the Sun as She': Some Notes on a Note in Tolkien's The Lord of the Rings\" by Yvette L. Kisor (2007). She indicates that Tolkien has followed the use of Germanic languages in making the (more powerful) Sun \"She\" and the Moon \"He\". This is consistent use by Elves, Hobbits, Dwarves, and Men. Gollum however refers to all beings external to himself as \"it\", with the exception of Sauron (\"He\") and Shelob (\"She\"). The author further points to the fact that although \"named\" women are few in number, if not downright absent from the two primary works (tH and tLotR). They do have wonderful power (e.g. Galadriel, as already mentioned, Eowyn, even Gilraen to an extent, and Arwen, if you look at Jackson's take). I believe this has to do with Tolkien's religious belief (Catholicism) which is woven into Middle Earth (I don't think I need to explain that he is not an allegorist to this crowd). In any case the intercession of Galadriel on behalf of the Fellowship (giving sanctuary in Lorien and gifts on their departure), and Eowyn on behalf of her father to my mind shows two images of the Blessed Virgin Mary: Galadriel resisting temptation, being so powerful, protecting the fellowship, etc. and Eowyn \"crushing the head of the serpent\" (or in this case the serpent's servant), cf. Gen 3:15, in slaying the witch-king and his fell-beast. Tolkien's women are few in number, but they are among the most powerful, brave, and virtuous (interesting word there) in Middle-Earth. It certainly shows he was no sexist.\n\nJust a couple of thoughts.\n\nedit: Rich, I think that bit about \"women not featuring\" is unfair when one sees the ways they do feature in the novels. I, too, would be angry if Tauriel had a role in the game (unlikely, I think)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788369","commentId":788369,"userName":"Pharmboys2013","timestamp":1366788403,"content":"richsabre said:\n\nPharmboys2013 said:\n\n \n\nit was mentioned briefly before, but if FFG goes the route of making non-canon female heroes i think it would be a brilliant idea to make Tauriel whom nearly all tolkien fans will be familiar with after the next hobbit movie.  I can see licensing issues mucking up those proceedings although so it may be more likely we will only see new versions of eowyn and arwen along with the long awaited galadriel\n\n \n\n \n\nsurprise surprise i would absolutely hate that…(not that im picking at your idea….just the thought in general :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )..grrr…..it makes my beard wither to think of a game focused on the books take a PJ invention (she is right? ..im avoiding the hobbit films on principle). but as you say, it would never be allowed to happen anyways\n\nrich\n\n\n\nhaha I put the word \"nearly\" in that post just for you rich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788384","commentId":788384,"userName":"richsabre","timestamp":1366791688,"content":"Pharmboys2013 said:\n\n \n\nrichsabre said:\n\n \n\nPharmboys2013 said:\n\n \n\nit was mentioned briefly before, but if FFG goes the route of making non-canon female heroes i think it would be a brilliant idea to make Tauriel whom nearly all tolkien fans will be familiar with after the next hobbit movie.  I can see licensing issues mucking up those proceedings although so it may be more likely we will only see new versions of eowyn and arwen along with the long awaited galadriel\n\n \n\n \n\nsurprise surprise i would absolutely hate that…(not that im picking at your idea….just the thought in general :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )..grrr…..it makes my beard wither to think of a game focused on the books take a PJ invention (she is right? ..im avoiding the hobbit films on principle). but as you say, it would never be allowed to happen anyways\n\nrich\n\n \n\n \n\nhaha I put the word \"nearly\" in that post just for you rich\n\n \n\n \n\n@pharmboys2013…. sorry, upon re reading my reply to you it sounds terribly dismissive…it wasnt meant to come out that way, i was just expressing the thought in general. taking a subjective view, i do very much doubt it would happen. the game has rights to the trilogy and the hobbit literature (i beleive) but obviousy not anything created for the films. to get the rights to do this im guessing they would have to pay (and im guessing a lot) and probably have to get rights for the film in general. i would rather they spent their money on other things, even if i were a film fan\n\nnow thats not to say i would mind something similar to her ffg-created. im guessing she is perhaps a female variant of legolas? (the film legolas that is)\n\n@john, interesting thoughts, thanks for sharing those\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788394","commentId":788394,"userName":"Rapier1","timestamp":1366793858,"content":"One of the two characters from the other lord of the rings game that FFG made is a female elf I believe. So I expect they'll be put in eventually.\n\n \n\nOne of the problems is that I think a lot of people cried about the three made up characters (even though we have made up quests for them to go on… I don't really see the diference). I believe the two remaining are a rohan rider and a female elf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788396","commentId":788396,"userName":"Pharmboys2013","timestamp":1366794324,"content":"Rich: no offense taken, I understand what you mean. \n\nOn a side note, while it may be awhile till we see another version of arwen, it would be great to have the above mentioned tactics version of her that remained its high willpower. Would help make mono tactics more legitimate outside of battle/siege quests "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788486","commentId":788486,"userName":"Raven1015","timestamp":1366810057,"content":"It would be very thematic if a new version of Eowyn had a way of converting her willpower into attack. After all, her success in battle was based more on her spirit and bravery than outright prowess with weapons.\n\nI think any discussion on Tolkien and gender needs to take in the Silmarillion as well (I mentioned this in a previous post, but not in any detail). A lot of times, critics leave out this material, which adds a lot to the the picture of Tolkien's treatment of women. Off the top of my head, we have:\n\n- Luthien: Beren definitely was a heroic figure, but I would argue that Luthien was the more powerful of the two. In fact, she takes the leading role in getting them into Angband, successfully confronting Morgoth, putting him to sleep and stealing a silmaril from his crown. I think this has to go down as one of the greatest feats of any of the Children of Illuvutar ever.\n\n- Melian: Granted, she was a Maia, and not of the race of Elves or Men, but she is definitely treated as a woman. I think it is safe to say that she is the most powerful figure in Middle-Earth at the time (save Morgoth and perhaps Sauron). She is able to construct a \"shield\" that protects her realm against all foes for thousands of years. She also is gifted with great foresight and wisdom.\n\n- Haleth: Possibly the most revealing of the three characters, in that she was not a transcendent being like Melian or an elf like Luthien but of the race of mortal men. Still, when most of her family was slain and her people were in trouble, she became the Chieftain of her people and led them successfully for many years. She was said to be full of valour and a strong will.\n\nThat's not an exhaustive list by any means, but the three that stick out most in my mind. I don't think we should overstate the case, in that in some ways Tolkien's female characters do represent some traditional notions of what it means to be a woman, at least by today's standards, but by the standards of his day, he actually was further along than many other authors of the time.\n\nSimilarly, I've heard some people say that Tolkien was racist, in that the behavior of races (elves, men, orcs) seems to be determined by their race and not by their own personalities, which could somehow be translated into real world applications. For example, I saw one post where someone said this is true because orcs are always evil, every single one, and elves are always good. I smiled at that second claim (\"elves are always good\") and thought, someone needs to read the Silmarillion!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788489","commentId":788489,"userName":"richsabre","timestamp":1366810883,"content":"Raven1015 said:\n\n \n\nSimilarly, I've heard some people say that Tolkien was racist, in that the behavior of races (elves, men, orcs) seems to be determined by their race and not by their own personalities, which could somehow be translated into real world applications. For example, I saw one post where someone said this is true because orcs are always evil, every single one, and elves are always good. I smiled at that second claim (\"elves are always good\") and thought, someone needs to read the Silmarillion!\n\n \n\n \n\nthis was one of the things i wanted to discuss in the lore threads (i cant remember who suggested it now) so while i dont want to hijack the thread, i just wanted to agree- the free peoples of middle earth are certainly not decended from angels….but on the orc thing….i think they were purposely all made evil because they couldnt be anything else due to their corrupted beginnings….so as a race, yes, they were all to an orc, pure evil.\n\nothers however, it is not so clear….i mean take trolls….they seemed to be more dim witted than evil, and yet their beginnings were similar to orcs. even one of the 3 hobbit trolls (william?) says to let bilbo go. same with the giants. gandalf specifically says that he gets help from a few decent ones in blocking up passages….so, interesting thoughts. i may open a thread on it (though not the racist part, as its best to avoid such things on forums i believe)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=788966","commentId":788966,"userName":"Mr Coffee","timestamp":1366908841,"content":"On the topic of female heroes… if FFG decides to eventually break out of their set timeframe and include \"historical\" charactcers, Luthien obvously becomes an amazing possibility!  You could possibly even work something out of Nienor Niniel or Morwen (although probably better as allies… or horribly doomed heroes…).\n\nTaking that idea of non-male heroes out a bit farther, it will be interesting to see if they aver develop a non-humanoid hero… I know that a lot of us had hoped for Gwahir as a hero, and now that they have Beorn in the game, it'd be cool to see some form of  \"bear-specific\" cards that cued off of him (like a \"stance\" card or something)…  But even more than those two, I would get all school-girly if they ever had a Huan hero card…. hell, I'd take ANY version of Huan they put in this game!  One of my favorite Middle-Earth \"characters\"…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=789128","commentId":789128,"userName":"Rapier1","timestamp":1366949692,"content":"FFG will do  the historical characters if/when they get the licence to the Silmarillion content.\n\nAlthough they may never get that since it's much more rarely licenced."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=791059","commentId":791059,"userName":"Rubinon","timestamp":1367463593,"content":"I haven't seen Ioreth mentioned here. She certainly has a larger role than some of the characters already made into heroes (Elladan & Elrohir, for example), and she would be a fitting lore heroine with a powerful healing abilty. Just not sure how good her stats could reasonably be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82754-more-female-heroes-ever/?do=findComment&comment=791251","commentId":791251,"userName":"gatharion","timestamp":1367504254,"content":"Rubinon said:\n\nI haven't seen Ioreth mentioned here. She certainly has a larger role than some of the characters already made into heroes (Elladan & Elrohir, for example), and she would be a fitting lore heroine with a powerful healing abilty. Just not sure how good her stats could reasonably be.\n\n\n\n \n\nGood call! I had forgotten about her. Yeah, I can't think why she wouldn't be a Lore Hero with a strong healing focus. Since she's from Gondor, now would be the time for her to show up."}]}