{"url":"https://community.fantasyflightgames.com/topic/82768-return-to-mirkwood/","title":"Return to Mirkwood","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82768-return-to-mirkwood/?do=findComment&comment=787792","commentId":787792,"userName":"Khamul The Easterling","timestamp":1366658800,"content":"I have heard many differant opinions about this senario.  Most say its bad solo but i've heard quite a few say its one of thier their favorite quests solo.  I am a solo player (athough I could switch to two handed any time) and I have expansions 2-4 in the Mirkwood cycle and 2,3,5 in the Dwarrowdelf. I also have KD.  I have a few questions.  I know that everyone has differant opinions, but please answer these questions in your opinion:\n\n1. Were all the bad comments about solo Return to Mirkwood when people just had the Mirkwood cycle or is it still generally bad for solo with all the new expansions?\n\n2. What makes this senario bad for solo play?\n\n3. What do you players that play two handed think of Return to Mirkwood?\n\n4. Do you like this for solo play?\n\n5. Is this quest one of your favorites solo or mulitplayer?\n\n6. What are you final comments about this quest?\n\n \n\nI'm a bit confused with people saying differant things about this senario, so im trying to get some more opinions.\n\nThanks so much,\n\nKhamul\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82768-return-to-mirkwood/?do=findComment&comment=787795","commentId":787795,"userName":"richsabre","timestamp":1366659656,"content":"Khamul The Easterling said:\n\n \n\nI have heard many differant opinions about this senario.  Most say its bad solo but i've heard quite a few say its one of thier their favorite quests solo.  I am a solo player (athough I could switch to two handed any time) and I have expansions 2-4 in the Mirkwood cycle and 2,3,5 in the Dwarrowdelf. I also have KD.  I have a few questions.  I know that everyone has differant opinions, but please answer these questions in your opinion:\n\n1. Were all the bad comments about solo Return to Mirkwood when people just had the Mirkwood cycle or is it still generally bad for solo with all the new expansions?\n\n2. What makes this senario bad for solo play?\n\n3. What do you players that play two handed think of Return to Mirkwood?\n\n4. Do you like this for solo play?\n\n5. Is this quest one of your favorites solo or mulitplayer?\n\n6. What are you final comments about this quest?\n\n \n\nI'm a bit confused with people saying differant things about this senario, so im trying to get some more opinions.\n\nThanks so much,\n\nKhamul\n\n \n\n \n\nhey\n\n1. i was one of the first people to win this solo (or at least post about it on here…im sure others had as well but didnt write about it) and post the deck on the boards….im not being arrogant here or whatever, i just wanted to point out how crazily luck based it was with the then current card pool. so yes, most comments stem from RTM era….my own bad opinion included\n\n2. the reason its bad is the threat gain from the player who has gollum. solo there is only you so you get ALL THe threat each turn. not only that but the 'good' locations that have good effects when explored are useless for solo play. all together it was a poorly designed solo quest\n\n3.havnt tried it yet….going to though!\n\n4.for one handed no i dont…..i only won it with a 'rush deck' of all the rohan spirit cards out at that time.\n\n5.neither\n\n6. the only way to win this i think with the card pool out at that time is a rush deck like i said above. mono sphere rohan spirit deck….and lots of luck\n\nthats how i won it, not alot of solo people had at that time…..and im saying it was just luck when it did….you need a really nice encounter draw. it certainly become one of those 'win it once just to say you have' type quests.\n\nim sure its easier now though….i havnt tried it in a long while. cards like song of earendil with a two handed deck would work well. and of course theres elronds counsel which we didnt have for a 1 handed solo play.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82768-return-to-mirkwood/?do=findComment&comment=787802","commentId":787802,"userName":"GrandSpleen","timestamp":1366660388,"content":"Khamul The Easterling said:\n\nI have heard many differant opinions about this senario.  Most say its bad solo but i've heard quite a few say its one of thier their favorite quests solo.  I am a solo player (athough I could switch to two handed any time) and I have expansions 2-4 in the Mirkwood cycle and 2,3,5 in the Dwarrowdelf. I also have KD.  I have a few questions.  I know that everyone has differant opinions, but please answer these questions in your opinion:\n\n1. Were all the bad comments about solo Return to Mirkwood when people just had the Mirkwood cycle or is it still generally bad for solo with all the new expansions?\n\n2. What makes this senario bad for solo play?\n\n3. What do you players that play two handed think of Return to Mirkwood?\n\n4. Do you like this for solo play?\n\n5. Is this quest one of your favorites solo or mulitplayer?\n\n6. What are you final comments about this quest?\n\n \n\nI'm a bit confused with people saying differant things about this senario, so im trying to get some more opinions.\n\nThanks so much,\n\nKhamul\n\n \n\n\n\nI can offer only limited input here, since I rarely play solo, but I think I can answer several of your questions.\n\nRtM is one of the most challenging quests solo because of the \"guarding Gollum\" mechanic.  One player guards Gollum, and as a result there are several very nasty encounter card effects that will target them.  Raise your threat by 8, discard 10 cards come to mind.  Additionally, you have to raise your threat by an additional 3 every round if you have Gollum -- you can juggle the threat burden in multiplayer, but in solo games that means a sure 4 threat per round (3 plus the regular refresh).\n\nAs if that weren't bad enough, the quest cards themselves have text like: the player with Gollum can't play any cards.  Basically, as a solo player you are severely are mercilessly crippled.  This reduces the fun factor unless you are die-hard for a challenge.\n\nConsidering cards that have been released after Return to Mirkwood, there are just a very few cards that might help to surmount some of the challenges posed to the solo player in this scenario.  Vilya + Elrond can help you continue to play cards even under the quest card restriction mentioned above.  Add Imladris Stargazer to the mix to make this a bit more strategic.  There're a few more options for threat management now, too (Elrond's Counsel, Lore Aragorn).  And a little bit more help pulling cards out of the discard pile (Hama, To Me! O My Kinsfolk!).  Still, the challenge of this scenario is considerable for the solo player, and in ways that could be considered ureasonable.\n\nI think it's great fun as a 2-player game, so you might enjoy it playing 2-handed.\n\n "}]}