{"url":"https://community.fantasyflightgames.com/topic/82790-multiple-copies-of-ranger-spikes/","title":"multiple copies of ranger spikes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82790-multiple-copies-of-ranger-spikes/?do=findComment&comment=787957","commentId":787957,"userName":"richsabre","timestamp":1366701675,"content":"if i have 2 copies in the staging area and an enemy comes out, are they both put onto that enemy at the same time (which i think is the correct way) or is one considered to have been placed, meaning the other isnt eligible to be placed onto the same enemy (much more useful but i dont think this is right)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82790-multiple-copies-of-ranger-spikes/?do=findComment&comment=787997","commentId":787997,"userName":"Tracker1","timestamp":1366709989,"content":"Both copies of ranger spikes attach when the enemy comes off the encounter deck.\n\nWhen enemies are added to the staging like the trolls in the hobbit quest, I believe you can place a copy of ranger spikes on different trolls, because all trolls are coming at the same time.  Although I am not 100 % sure on this one.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82790-multiple-copies-of-ranger-spikes/?do=findComment&comment=788029","commentId":788029,"userName":"monkeyrama","timestamp":1366715433,"content":"Does the answer to this relate to the way in which the player triggers simultaneous effects? Can't remember the FAQ wording off the top of my head, but if the first player decides the order to trigger them, the first Spike would attach, and then the second Spike would have no eligible target to attach to. This could well be wrong, but this seems possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82790-multiple-copies-of-ranger-spikes/?do=findComment&comment=788031","commentId":788031,"userName":"monkeyrama","timestamp":1366715795,"content":"That said, here's the FAQ:\n\n \n\n(1.37) Timing of effect resolution\nWhen resolving multiple effects with a shared \ncondition, players should use this order of resolution: \npassive abilities first, Forced effects second, Response\nactions third. When determining the order of effect \nresolution among abilities within those categories, \nplayers should first resolve abilities that use the word \n“when” and then resolve abilities with the word “after”.\n \nSpikes says:\n \nPlay Ranger Spikes into the staging area unattached.\nIf unattached, attach Ranger Spikes to the next eligible enemy that enters the staging area.\nPlayers do not make engagement checks against attached enemy. Attached enemy gets -2 [Threat]\n \nSo I think the second Spike just attaches to the enemy as well, since it isn't ineligible just because it's been spiked once. :/"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82790-multiple-copies-of-ranger-spikes/?do=findComment&comment=788033","commentId":788033,"userName":"GrandSpleen","timestamp":1366716402,"content":"Yeah, I would attach them both to the same enemy.  If the card says \"limit 1 per enemy,\" the story would be different… but as it is, an enemy can have one copy attached to it and still be eligibile for further copies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82790-multiple-copies-of-ranger-spikes/?do=findComment&comment=788066","commentId":788066,"userName":"richsabre","timestamp":1366721613,"content":"all of those makes sense i suppose\n\nthanks!"}]}