{"url":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/","title":"Tolkien Lore Topic #1 &#039;Evil In Middle Earth&#039;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788494","commentId":788494,"userName":"richsabre","timestamp":1366811945,"content":"hello, welcome to the first of the tolkien lore topics. this is meant as a disucssion, not as me writing an article, so feel free to take it where you want…there is no thread hijacking here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\ni thought i would do a topic i have seen on the threads a few times over the last few days…on the topic of evil in middle earth. were all orcs evill by nature? was it right for elves and men to slaughter them and show them no mercy? how do we explain the deeds of the elves in the first ages of middle earth? and so on….\n\nhere are my thoughts.\n\nORCS and TROLLS: it is interesting as i said in another thread, that given both of these creature's beginnings, confusing as they were (for more info on orc's beginnings and the confusion there see my tolkienology thread 5 Origins of Orcs [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=629838]) that each of them behave differently. if we look at orcs, we see complete evil. they were founded in evil and every single one of them act in the most evil ways possible. This i believe is comepletely due to their beginnings by Melkor, they cannot function any other way.\n\nTrolls however seem different. They are more dim witted that orcs, and seem to be evil by default….because killing and eating men/dwarves/elves is seen as evil and its pretty much all they do. There are different types of trolls of course, the Olog Hai we know to be a different breed, and they dont really feature much in the books, but i think its safe to say they were a far more deadly and cunning breed than your standard cave troll.\n\ni think the way the trolls were portrayed in the films was actually done very well, and indeed who can't feel pity for the poor troll in moria when it dies?\n\neven William the troll (hobbit) calls bilbo a 'poor little blighter' and tells the others to let him go, though he had already had his fill of mutton anyways. but this behaviour portrayed by William is certainly not orc-ish. an orc would have not shown any mercy at all. in fact the only time we see orcs give mercy is when they wish to take thier enemies alive for what we can assume is a far worse ending than death.\n\na good example of this is when Azog slew thror, he spared his companion Nar, however only so he cuold take news of Azog's evil to the other dwarves (which ironically proved his undoing).\n\nso i think there is no saving orcs. this leads me to the point of the free peoples showing no mercy. we see during the war of the ring, evil men offered to be taken prisoner, but orcs are given no such treatment. this, in my opinion, is completely in line with the good/evil of middle earth and is hardly surprising…i mean, tolkien was keen to show there was no redemption for orcs and goblins, and this is why the free peoples of middle earth act as they do.\n\ni hope this thread takes life, and please add your thoughts on what i have written and add your own ideas as well. i will attempt the issue of elves here as well, but i think i need to do some researching first ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788503","commentId":788503,"userName":"lleimmoen","timestamp":1366813332,"content":"Ágætis byrjun, Richard.\n\nThere's quite a bit to discuss. I start with orcs being slaughtered, and orcs taking prisoners. Of course, orcs show no mercy in the latter as they only take prisoners to enslave them and sometimes perhaps even for sport. Now I actually have a question, were there any Free Peoples' prisons? I think the only time we read of inprisonment is by the evil ones, or evil individuals being inprisoned (like Melkor). But I gather big cities in Gondor or Númenor would have prisons, I just don't remember reading anything about them.\n\nI was really fond of William in the Hobbit. I actually think it is one of those things that wouldn't have been there in the book had Tolkien written it a little later, but I'm very glad it is there, it gives it a special flavour.\n\nWhat I find interesting is the amount of evil (of some sort) or at least shady Elven characters in the First Age, compared to the Third. You would think everything was less spoilt in the beginning but we actually see several examples of almost pure evil done by Elves coming straight from Valinor, Faenor and some of his sons, for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788507","commentId":788507,"userName":"richsabre","timestamp":1366813839,"content":"lleimmoen said:\n\n \n\nÁgætis byrjun, Richard.\n\nThere's quite a bit to discuss. I start with orcs being slaughtered, and orcs taking prisoners. Of course, orcs show no mercy in the latter as they only take prisoners to enslave them and sometimes perhaps even for sport. Now I actually have a question, were there any Free Peoples' prisons? I think the only time we read of inprisonment is by the evil ones, or evil individuals being inprisoned (like Melkor). But I gather big cities in Gondor or Númenor would have prisons, I just don't remember reading anything about them.\n\nI was really fond of William in the Hobbit. I actually think it is one of those things that wouldn't have been there in the book had Tolkien written it a little later, but I'm very glad it is there, it gives it a special flavour.\n\nWhat I find interesting is the amount of evil (of some sort) or at least shady Elven characters in the First Age, compared to the Third. You would think everything was less spoilt in the beginning but we actually see several examples of almost pure evil done by Elves coming straight from Valinor, Faenor and some of his sons, for example.\n\n \n\n \n\nTakk lleimmoen ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\ni dont recall any free people's prisons either….but as you say there must have been some in the white city and other strongholds. i think the behaviour of the elves of the 1st age stem from tolkien's early writting. the same with thanduil in the hobbit. i mean he never did anything remotely evil, but he was said to have a greed for treasure, and him being willing to sacrifice the lives of his elven soldiers just to get it is a bit off for anything the elves would do in the trilogy\n\nstil, silvan were said to be less wise than noldor\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788513","commentId":788513,"userName":"Raven1015","timestamp":1366814706,"content":"Great topic choice!\n\nI'm going to tackle this from a few different angles. One is from the perspective of a story-teller. On a practical level, orcs serve as a convenient horde of enemies who can be dispatched without raising thorny questions of morality (reminds me of the foot soldiers in the ninja turtles cartoon who were robots, so the turtles destroying them en masse was no big deal). This is one reason why I think so many other fantasy authors after Tolkien have taken up orcs as convenient baddie mobs.\n\nOk, looking at it from the perspective of the story itself and taking the world on it's own terms, I have always just assumed that orcs were evil because they were produced by Melkor (either by corrupting elves or men), and thus Melkor's darkness is built into their very beings. It is interesting however that the \"free peoples\", who are usually thought of as the \"good guys\" show no such unwavering commitment to good. I believe that the issue may come down to free will. Men and Elves have been given free will by Illuvatar (this is really stressed in the case of Men, but seems to hold true for Elves as well), and so they may do dark deeds as well as good. However, orcs don't have free will. This may seem like a strange statement, but I base it on a few things:\n\n1) Free will seems to be a gift that can only be given by Illuvatar. He is the only one who can create living, sentient beings, and it seems to me that he is the only who can create beings with free will as well. Melkor must corrupt existing beings to \"create\" his own race, but can't create them with free will.\n\n2) Now one might say, if Melkor is using beings with free will, Elves and Men, as the base material for his orcs, shouldn't that free will continue? I think the answer is no because he is essentially transforming them into something new. Also, Melkor's main focus is dominion. Above all, he craves bending everything in creation to his will. As such, it would make sense that the process of corruption also entailed the destruction of the free will of orcs.\n\nNow when I say orcs don't have free will, I don't mean they are automatons that mindlessly obey the commands of Melkor and Sauron. I don't mean that they don't have the ability to decide what they are going to have for breakfast on a particular morning. What I mean is that they don't have the ability to choose to move away from evil and darkness, whereas Men and Elves can choose between good and evil with their actions.\n\n \n\nAs for why the Elves of the Third Age seem to be much more virtuous than those of the First Age, that is a good question. I feel like it may be that since Elves are immortal, those we see in the First Age represent the rash, hot-headed arrogance of the young, while those in the Third Age represent the wisdom of hard-earned experience. Those who chose the wrong path perished long ago, while those who remain remember the lessons of the past.\n\n \n\nAs a final note, I heard somewhere that Tolkien was considering revising his conception of the orcs in later life, and was unhappy with the way they were so one-dimensionally evil."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788525","commentId":788525,"userName":"richsabre","timestamp":1366816356,"content":"all great points Raven\n\ni agree with the lack of free will to move away from evil. i seem to remember several references throughout the hobbit and/or trilogy where it is stated that the orcs of the mountains, despite being under rule from the likes of azog, bolg, and the great goblin, still were under the will of sauron, and would act almost sub consiously to his will.\n\n \n\non a similar note i was re reading the appendix A today on the dwarves, and saw an interesting comment on the balrog perhaps being already awoken by sauron's will (as opposed to being awoken by the dwarves mining.)\n\nas for tokien changing his mind before he died i wrote this in the chapter i linked above…according to the morgoth's ring history book (which i used a source for it) christopher tokien says it appeared his father was indeed changing his mind\n\nSTART QUOTE\n\nAN ANSWER TO THE PROBLEM OF CHRONOLOGY\n\nAt the end of this note, Tolkien finally gives us a formed answer to the problem of the timeline and how orcs fit into it.\n\nThe thought of orcs was created in the mind of Melkor- he bade his spirits take hideous forms to terrify the newly awakened elves, and it is these the elves see at Cuivienen, and their intent was to mock and cause terror. However the actually core breeding of orcs was left to Sauron, who Tolkien states was ever cooler in thought than his master, and during Melkor’s time of captivity, it was Sauron who bred the vast armies that were available at his return. It was from men that these orcs were created.\n\n…..and yet again we run into a problem. For this to work men would have to awake much earlier to be taken during Melkor’s captivity. Therefore it was likely an unfinished task of Tolkien before he died to slightly bring forward men’s emergence into the world.\n\nCONCLUDING THOUGHTS\n\nWell as you can see, there really isn’t an answer that was ever officially taken. Tolkien, if he had lived to change the timeline may have settled on men, or he may have changed his mind again…………….\n\nEND QUOTE\n\nno matter how the orcs were created, it is clear, as you say, that they loose as senese of what race they used to be. there is no evolution in middle earth (though it is likely the hobbits evolved as they arent mentioned any where else..though i dealt with that in another of my chapters). therefore, given they are effectively a new race, and this race was bred of evil, then it is easy to see that with the orcs things are a very black and white affair indeed\n\nrich\n\nPS. if you havnt already read it, i would recommend morgoth's ring as it is the one that directly deals with the orc issues"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788538","commentId":788538,"userName":"Raven1015","timestamp":1366818029,"content":"This is the second time in as many days that Morgoth's Ring has come up for me. I think it's time for me to check it out!\n\nP.s. How Hobbits fit into Tolkien's cosmology would be good fodder for another topic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788551","commentId":788551,"userName":"richsabre","timestamp":1366819736,"content":"Raven1015 said:\n\nThis is the second time in as many days that Morgoth's Ring has come up for me. I think it's time for me to check it out!\n\nP.s. How Hobbits fit into Tolkien's cosmology would be good fodder for another topic.\n\n\n\nyeah the histories are great, i really need to pick a few more up myself….i seem to learn something new everytime i delve into one.\n\nand agreed….at first i was worried there wouldnt be enough topics, but now i see how wrong i was :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788556","commentId":788556,"userName":"richsabre","timestamp":1366820386,"content":"i think i should have put in my first post, given the topic, of how we define evil in middle earth.\n\nnow i dont wish to bring religion into, as this isnt about it, but its worth saying as an athesit, its hard for me personally to state what exactly evil is, without having to resort to '……X is an evil act' and so on.\n\nnow tolkien however, being a religious man, and even more importantly, middle earth having set gods and (for want of a better word) angels, it is not so difficult.\n\ni think this is an important point to note. middle earth is by nature a much less subjective world than the one we live in today and i think this partially explains the whole issue of orcs being completely evil.\n\ni also think this is partially to blame when tolkien gets criticised for being too simplistic in his plot lines….i think those who say so, have not taken into account the nature of middle earth itself\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788586","commentId":788586,"userName":"John85","timestamp":1366824871,"content":"richsabre said:\n\ni think this is an important point to note. middle earth is by nature a much less subjective world than the one we live in today and i think this partially explains the whole issue of orcs being completely evil.\n\ni also think this is partially to blame when tolkien gets criticised for being too simplistic in his plot lines….i think those who say so, have not taken into account the nature of middle earth itself\n\nrich\n\n\n\nI think it's also important to note that those who criticize the \"simplistic\" and \"black and white\" nature of good and evil in Middle-Earth ought to also consider that post-modernism (and hence the lack of any sort of objectivism, i.e. overarching truths) was just starting to creep into academic favor toward the end of his life. Furthermore, Tolkien, being a Catholic, would have believed in objectivity. As you say rich, folks need to consider the nature of Middle-Earth (and that of its author)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788592","commentId":788592,"userName":"richsabre","timestamp":1366825655,"content":"John85 said:\n\n \n\nrichsabre said:\n\n \n\ni think this is an important point to note. middle earth is by nature a much less subjective world than the one we live in today and i think this partially explains the whole issue of orcs being completely evil.\n\ni also think this is partially to blame when tolkien gets criticised for being too simplistic in his plot lines….i think those who say so, have not taken into account the nature of middle earth itself\n\nrich\n\n \n\n \n\nI think it's also important to note that those who criticize the \"simplistic\" and \"black and white\" nature of good and evil in Middle-Earth ought to also consider that post-modernism (and hence the lack of any sort of objectivism, i.e. overarching truths) was just starting to creep into academic favor toward the end of his life. Furthermore, Tolkien, being a Catholic, would have believed in objectivity. As you say rich, folks need to consider the nature of Middle-Earth (and that of its author).\n\n \n\n \n\nit especially interesting i think to observe that despite there being a definite god system laid down in middle earth (and even people present who observed them), we see no one in middle earth actively engaging in religion…..i wonder why this is so? surely if there were organized religion, we woul see it, or at least hints of them….and yet as far as i remember there is none….\n\n…now im not saying there should be 'our world' religious aspects (churchs etc.) as obviously this is a different world and god system we're talking about.\n\nnow plenty of people liken characters and events to that of our world, and the signs are of course there if you want them, but its interesting to see no direct talk of religion in middle earth (in fact i dont think the word 'religion' is mentioned once.)\n\nrich\n\nEDIT - just remembered, i think the silmarillion talks of evil men in the 1st age worshipping melkor…or am i mis remebering?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788610","commentId":788610,"userName":"Ellareth","timestamp":1366827789,"content":"Trying to define evil is hard.\nBut identifying something as good or evil should be relatively easier.\n\nFrom the Hobbits we know Trolls can sympathize and kills 'free people' because they need to eat. Killing for food is hardly definable as evil.\n\nAlso from the Hobbits, we know Orcs take prisoners, and does not harm or cruelly mistreat prisoners (even the ones that would eventually be sentenced to death for being king of Dwarves, whom they had warred for centries), until they realized the prisoners carried elven made weapons.\n\nFrom the Two Towers, we know Orcs are not all trecherous traitors and that some Orcs are loyal to their master.\n\nFrom the Return of the Kings we know not all Orcs wants to fight or kill. Smaller and weaker breed of Orcs simply wants to be left alone.\n\nAlso from the Return of the Kings, some of the fighting Orcs have no other choice but to follow their masters orders and fight against 'free people' because they know those so called 'free people' would kill Orcs on sight.\n\n \n\nExcept under command of supreme leaders such as Morgoth or Sauron, only 'evil' deeds committed by Orcs are territorial war agaisnt Dwarves for control of mountains and occasional raids against nearby human settlements. Both of these acts are out of neccessity, in order to provide what they need to survive and prosper. I think 'Orc raids' are no more 'evil' than 'tree logging' or 'hunting games'.\n\nAnother thing to consider is that Orcs 'fear' Elves and anything elvish, while Elves are more disgusted than frightened by the Orcs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788625","commentId":788625,"userName":"richsabre","timestamp":1366829582,"content":"thanks for posting ellareth\n\ni would say the goblins in overhill and underhill chapter were treating the company poorly. they whipped them down to goblin town, whilst implying the horrible things they were intending to do with them. even though the great goblin doesnt go beserk until he finds their weapons, i still think the company were at best fated for, as the chapter says, slaving until they died for want of air or light\n\ni agree on the return of the king though. its interesting hearing the talk with gorbag and shagrat wanting to set up with a few of their more loyal followers.\n\nstill, i hold by my belief of orcs were never capable of anything but evil, and by evil i mean the 'old fashioned' evil of torture and death of innocent people.\n\nyou make another interesting point about the orc raids. i agree many must have been out of neccisit, for supplies. but many would have been for slaves (obviously not  a needs to survive) and we can assume, given orcs lust for death and pain, many raid were for the sheer joy of it.\n\n \n\nthe elves may be seen in a bad light and i agree with that, but i think it again comes down to whether you believe orcs to be beyond any redemption or not.\n\nanother point is orc young. we know they exist from the hobbit (goblin imps that gollum ate). now obviously these young would not take part in wars or raids, so here i think is a group of orcs who are innocent….after all they have done no evil by default due to their age. but would a company of elves/dwarves/men kill them regardless? i think so\n\nin the appendix, it is said that great evil as done by both sides in the war of goblin and dwarves, and i can imagine, when the dwarves are destroying each goblin settlement up and down the misty mountains, that they left none alive….young or not.\n\nstill, it was war, and it depends whether you believe in the whole 'casualties of war' thing…afterall soldiers are soldiers, so it comes down to, who is the evil, the man who kills, or the one who tells him to do so?\n\nthe answer to this question is of course dependant on the condition of the killing. as already has been pointed out, the orcs were forced into war and killing, so cant be held 'evil' in this case, though in others they were just kiling for the joy of it\n\n….mmm…i ve rather contradicted myself here havn't i?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788639","commentId":788639,"userName":"Raven1015","timestamp":1366832563,"content":"Wow, lots of interesting stuff so far. I'll try to respond to a few things that stuck out for me:\n\n* I've also always found the lack of organized religion interesting. There is a clear basis for such a religion established in the Silmarillion, but there never seems to be a directive given to the Elves or to Men to spread knowledge about Illuvatar and worship of him. You would think this might be the case given Tolkien's own strong beliefs. Because of Tolkien's methodical nature, I find it hard to believe that this is an accident. It seems he decided to intentionally exclude such an institution from his world. Actually, I think I remember reading an interviewing with George RR Martin where he said the lack of religion in Tolkien always struck him and was part of the inspiration for including so much religion in A Song of Ice and Fire.\n\n* Obviously, there are lots of acts that could be considered evil in Tolkien's world, but I feel like the number one evil seems to be the craving of power and dominion over others. It is this that is Melkor's \"original sin\", and what set him on the road to darkness more than anything else. Again, this is the case with Sauron as well, and the One Ring is the embodiment of this notion of dominion as evil. This makes me wonder about the status of orcs then. I realize that I contradicted myself a bit earlier saying the orcs have no free will and thus can't turn from evil. If they don't have this choice, can we consider them truly evil then? It looks to me like their evil is not in seeking to exert dominion (although they do go after slaves and that seems to be their main source of labor), but rather they are considered evil because they are the manifestation of Melkor's quest for dominion. In other words, they are domination in physical form. \n\n* Ellareth, you bring up some interesting points. I like how you try to look at things from the other side of the equation. While we may say that orcs were evil to begin with, what if they wanted to seek a different path at some point but never could because they were eternally pigeon-holed as evil by Elves and Men and Dwarves? This turned into an eternal cycle of mutual violence. From this perspective, it would be perfectly logical for them to support Sauron as the \"free peoples\" are never going to accept them. Without any hint of such complexity or impulses in orcs though, its hard to explore that line of thinking any further, but its possible. There may be some salvation for orcs in that conversation you guys are mentioning, where they talk about leaving and starting something on their own (of course, they probably would be out to raid and kill, but that's another matter!). It seems that they are ruled by fear, and by the power of Sauron's dominion, rather than any love for him or devotion to his cause. Of course, isn't that part of the nature of domination (evil) itself?\n\n* The troll point that was originally brought up is fascinating. From what I remember, weren't trolls supposed to be a mockery of the Ents, made from stone? As such, a similar logic should be applied to them as with orcs (lack of free will, evil by nature), but yet they don't seem to be as single-minded. Whether this is because they are just too dim-witted or some other reason, I'm not sure. Maybe the trolls resemble Ents in that they don't get as involved in matters as orcs do (although they do still get used for war time and time again)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788652","commentId":788652,"userName":"Ellareth","timestamp":1366836220,"content":"richsabre said:\n\n \n\nanother point is orc young. we know they exist from the hobbit (goblin imps that gollum ate). now obviously these young would not take part in wars or raids, so here i think is a group of orcs who are innocent\n\n \n\n \n\nI know I am contradicting my earlier self, (since I was on the Orcs-were-actually-not-evil side)\nbut would orc younglings be innocent?\n\nIf the Orcs are condamned to evil because they are result of perversion of children of iluvatar or maiar, every Orc should be 'naturally' evil so lack of experience due to age wouldn't matter at all.\n\nWe know 'fea' or soul comes from out of the world from Iluvatar, and Orcs are not new type of race but a perversion of another.\nAssuming Iluvatar must send fea to every birth (or he cannot stop fea from being sent, either way), does an elven (or human) fea experience some kind of unimaginable pain when it enters deformed Orc body and as a result become evil? (like how childhood abuse could result in abusive adult).\n\nHmm… It's been a while since I read HoME and I need to reread them to refresh my memory at some point,\nbut if fea is innocent and every Orc is evil, what happens that makes an Orc an evil being?\n\nUnless, of course, Orcs are not evil at all and is only portrayed so in the eyes of Men and Elves.\nI cannot even begin to imagine how elves would be discribed among Orcs, but looking at how Orc's first guess was a 'bloody-handed Elves' when Cirith Ungol has been breached by Sam, I might go as far as to say Elves may look 'eviler' in eyes of Orcs than Orcs are in eyes of Elves.\n\n \n\nRaven1015 said:\n\n \n\n* Obviously, there are lots of acts that could be considered evil in Tolkien's world, but I feel like the number one evil seems to be the craving of power and dominion over others. It is this that is Melkor's \"original sin\", and what set him on the road to darkness more than anything else. Again, this is the case with Sauron as well, and the One Ring is the embodiment of this notion of dominion as evil. This makes me wonder about the status of orcs then. I realize that I contradicted myself a bit earlier saying the orcs have no free will and thus can't turn from evil. If they don't have this choice, can we consider them truly evil then? It looks to me like their evil is not in seeking to exert dominion (although they do go after slaves and that seems to be their main source of labor), but rather they are considered evil because they are the manifestation of Melkor's quest for dominion. In other words, they are domination in physical form. \n\n \n\n \n\nThis is an interesting point. I think you are onto something\n\nI agree with you that wanting to rule over others could be considred as the original sin.\nI'm trying to think if any other race besides 'evil' had slaves, as enslaving other is as close as you can get to Melkor's original sin.\n\nNumenoreans obviously had slaves for oars, but that must've been after they have fallen and became cruel overlords that their descendents admitted they were doing evil deeds.\nI can't imagine any of the \"non-evil\" Elves or Dwarves having slaves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788697","commentId":788697,"userName":"lleimmoen","timestamp":1366850931,"content":"I believe the only religious type of worship is mentioned in Númenor when Sauron corrupts most of its people to worship Melkor.\n\nThis is a side topic, but had I not heard it stated that Tolkien was catholic, I would have never thought it. I would have thought he was making a statement about religion at times, and mostly a negative one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788708","commentId":788708,"userName":"lleimmoen","timestamp":1366853160,"content":"Coming back to evil, yes Ellareth, I think what orcs do in general is nothing extra evil, set in the current world, or especially up to the 21st century, orcs would be more of a good guys in the whole scheme of things. But let us stick with Middle-earth.\n\nI think there are signs of how orcs look at Elves. And yes, they find them evil. Even Smeagol does so, right? And there's an interesting aspect to it, Smeagol doesn't imagine it, the Elven rope really burns him, and the Elven bread tastes foul."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788737","commentId":788737,"userName":"John85","timestamp":1366868915,"content":"I think the bit several of you posted about a lack of organized religion in Middle-Earth is interesting, especially since Tolkien is often quoted (at least in things I read) on the LotR, it is \"a fundamentally religious and Catholic work.\"\n\nBefore I make any of these comparisons I want to underline the point that I know that he did not like allegory and that he did not employ allegory. Nevertheless Tolkien was a Catholic and Middle-Earth is suffused with Catholicism just as his life was.\n\nI'll also note (actually my wife noted) that there are funerary and burial rites mentioned in LotR (at least), which have religious overtones, so there's a little bit of \"religion\" in the books.\n\nNow I'm going to note some parallels in summary (you can also view any of several articles, perhaps even a book or two on the subject (I've linked one below)):\n\n- Eru can create (Hebrew bara) as God can create, from nothing; Melkor (and Sauron) can only distort (like Satan). In other words, God did not create evil (but permits it because of Will), thus Eru did not create the Shadow (although he did create Melkor, as God created Satan); Evil mocks Good (and God); Good is the default, Evil comes later.\n\n- Eru may not be mentioned in TH or LotR, but he is most certainly present in the sense of Divine Providence (the finding of the Ring by Bilbo, the sparing of Gollum, the Eagles in the Battle of the Five Armies (and everywhere else they show up) and other \"eucatastrophic\" moments, the knocking of the skull down the well by Pippin in Moria (Gandalf dies and is brought back as White), etc.\n\n- Frodo, Gandalf, and Aragorn embody the Christological offices of priest, prophet, and king, respectively. All furthermore undergo some form of a sacrificial death.\n\n- Galadriel (and others like Varda) are Marian figures. The former's Marian nature is explicitly acknowledged in a letter, \"I think it is true that I owe much of this character to Christian and Catholic teaching and imagination about Mary,\" I think it fair to assume that the character would be very different or entirely absent if Tolkien were something other than Catholic. I discussed some of Galadriel's Marian qualities in another post. The praise of Varda (Elbereth) in O Elbereth! Gilthoniel! bears similar themes and images to one of the beloved Marian hymns Ave Maris Stella, notably the Queen as a source of light and guidance and her association with the sea.\n\n- Lembas (called \"wafers\" more than once), the elven waybread (bread for journeys), is rather Eucharistic; I think this is self-explanatory, but I can attempt to elaborate if people are interested.\n\nHere's one article I used in writing this; it has a bit more detail: http://www.decentfilms.com/articles/faithandfantasy [http://www.decentfilms.com/articles/faithandfantasy]\n\nI'll note once more I know Allegory is not at work, rather Tolkien's mind was so entirely Catholic that he could not help but to create a world that was likewise Catholic (if not explicitly so)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788759","commentId":788759,"userName":"richsabre","timestamp":1366871889,"content":"so many interesting points…..i will not attempt to answer all points straight away, but give another point not yet raised…\n\nthe question is an old one in middle earth - where do orcs go on death? ….and hence, do orcs even have fae, or can they exist as mere puppets (and therefore are not evil at all…no more so than a robot is)\n\nearly on when tolkien favouried 'orcs from elves' method of creation, some wondered if it were the halls of mandos, but in the end with him swaying to the 'orcs from men' would they share the same fate as men…i.e. 'the gift of men'?\n\nin other words, the question can be stated as anothero old one, are orcs immortal.? again i note my chapter 5 origins of orcs which attempts to deal with this, as it all depends on where orcs actually came from.\n\n(sorry for long quote, though it does have a point (see bold near bottom of post) ….though feel free to skip to the quotes end, you dont need to have read it to get my final point, though it does add substance to it\n\n-----------------------------------------------------------------------------------------------------------------------------------------\n\nSTART QUOTE\n\nWHERE DO ORCS COME FROM? ARE ORCS IMMORTAL?\n\nIf we take the (almost fully accepted, but certainly not final) theory that orcs are corrupted elves then this raises a bit of a question- are orcs immortal? What happens to them in death? The elves are immortal, and are neither affected by illness nor age, however are still vulnerable to forced death (ie mortal wounds). When this happens they go to Mandos’ halls where they await their time to return. So does the same happen to orcs?\n\nThe problem with all these breeding theories is that Tolkien constantly changed how orcs came in being. He already tended to change his mind a lot, which was a habit he had, so paired with this, we see many different changes that Tolkien makes, and he never really settles on one single theory. In later life, he became dissatisfied with the Silmarillion theory of orcs from elves, and began trying to come up with a better answer.\n\nTo find the answer to my question we must therefore determine whether orcs were in fact derived from elves, for if they are not, then that certainly helps us out a lot (and in typical Tolkien fashion opens up even more questions).\n\nSo I am going to discuss various notes Tolkien made, and will refer to them as note A B C etc. and give in the title the general theory he was putting forth. I have placed important areas in bold.\n\nNOTE A- Orcs came from beasts/elves\n\nTolkien in this note stated these facts (at the time) about orcs-\n\n1. Only Eru could create life with independent will- which orcs seem to have as they can both serve and rebel their masters\n2. Therefore orcs must be made from some corruption of something else already living\n3. Orcs were already present before the awakening of men. The newly awakened elves by the lake of Cuivienen were terrified of being taken by creatures that Melkor sent, however much of this was rumours sent by Melkor himself (though the Silmarillion does indeed say many were taken). Early Orcs couldn’t be men.\n4. Eru as stated would not give independence to Melkor’s creations, unless…he though them ultimately redeemable and could be saved (finished with a ? beside it)\n5. Melkor could not corrupt an entire race- the case of orcs had to be inheritable at some point, and this must have been the work of Eru (if indeed this last point is a fact, which Tolkien didn’t state either way). Therefore the orcs from elves theory is put into doubt.\n6. Other species with free speech and will are not yet accounted for ie. beasts such as the eagles- some of which were Maiar in eagle form. Therefore could then some of the greater orcs be Maiar? Some of the lesser ones that Melkor is said to have turned to his service early on? If so then do they become earth bound as they become older and more corrupt? This would explain how some orcs seem to be immortal. (the great goblin is a strong contender for a lesser maiar…see NOTE C)\n7. Speech however cannot be seen as proof of an independent spirit. Even though orcs spoke, much of it just rhymed off records set by Melkor, and even Sauron is later said to have devised a speech for his orcs. Therefore orc speech can be seen as the equivalent of a parrot speaking- it is merely copying. Even the orc’s treachery and hate for their masters still placed them as carrying out their master’s ultimate goal- evil. This points to orcs being no more than lifeless beasts made to mock the forms of elves.\n\nTolkien then ends the note with stating that saying Melkor could not wholly corrupt anything was going too far. Melkor could be seen as starting this off with ‘lifeless’ beasts, then mating the end results with the later elves to further create the true orcs. Therefore there is a strong possibility that there is elf blood in the early orcs. Thusly in death they go to the halls of Mandos and are held in prison to the end.\n\nThe problem here is that in a single note- Tolkien is contradicting himself, as stated by his son Christopher (editor of the histories). Tolkien states at the start that orcs can be no more than beasts, and in fact Christopher ends by stating his father had written at the bottom of the passage yet again orcs are beasts. However by the end he is starting to state they may be from elves, and have their blood in them. Therefore why conclude at the end, after stating the theory of crossing beasts with elves, that orcs are beasts. Was this a final word on the note? So that we may disregard all of it?\n\nThis is just the start of what becomes an ever more complicated set of notes. It is difficult to discern what Tolkien left, and what he later discarded as an old idea.\n\nNOTE B- Mixed origins\n\nIn a separate note Tolkien explains how Melkor, though not having powers to create, did have great powers of distortion and corruption of those who came within him. He then concludes that orcs had mixed origins, and were mostly likely a mixture of corrupted elves, and later men, and most likely had in their ranks (leaders) who were fallen maiar. This would explain how some orcs had exceptionally long lives, and some did not. The ones that crop up again were leaders of the orcs and were likely maiar.\n\nNOTE C-Early orcs maiar/spirits\n\nHere again we have Tolkien writing a completely different note on orcs, dated later on from 1959/60.\n\nIn this text Tolkien explains how the orcs of later wars at least (after Melkor’s return from captivity) were capable of craft and speech- and concludes that these orcs were not the same orcs the elves had feared at their awakening in Cuivienen, which was very early on in the history of Arda. He therefore states that the ‘early’ orcs were in fact corrupted maiar, taking elf-like forms in mockery of them. Tolkien then goes on to write the following…\n\nNOTE D- Orcs came from men\n\nTolkien starts with the same passage as note c- that orcs of later years were much different to the terror that the elves saw after their awakening. He then makes two very important (and related) notes, the first regarding the theory that orcs were corrupted men. The second on a point that arises from it.\n\n1- Those who state orcs derived from men cannot be correct regarding these early orcs. Men had not awoke then, only elves had, so therefore it was not possible for men to be taken when they were alive in middle earth yet!\n\n2. However soon after this, when Melkor returned from captivity he very quickly had a huge army of orcs to attack elves with. How? If they were not elves, and men had not awoken (because we must assume given the speed the army was raised the orcs had to already exist during Melkor’s captivity), then where did they suddenly come from? (for an answer to this see the chronology heading).\n\nTolkien then states\n\n“the view of the origin of orcs thus meets with difficulties of chronology. But though men may take comfort in this, the theory remains nonetheless the most probable.”\n\nHe then goes on to explain many similarities between men and orcs- most notable the ability to become ill, and die of old age (for here Tolkien states that orcs had a lesser life span compared to the Edain).\n\nThis last point he goes on to explain, as we know of several orcs who are seen to have a longer lifespan than men. He thus says, as previously stated, that those orcs (usually great captains) who in the early days lived long lives and crop up several times were in fact fallen maiar, who having business to direct orcs, took their forms.\n\nNote: there is an interesting footnote here that states Boldog comes up several times as an orc in the history of middle earth. It is theories that instead of Boldog being a name it is in fact a title for the orc-maiar beings, which were still maiar, just less formidable than balrogs for instance.\n\nAfter this Tolkien states a point that the men could be corrupted to an ‘orc-like’ level of existence, and then be forced to mate with other orcs, creating a more formidable breed of orc (see half orcs/goblin men), and that Saruman likely found this lore many thousands of years later.\n\nEND QUOTE\n\n-----------------------------------------------------------------------------------------------\n\ni think after re reading what i wrote over a year ago, that it is a very confusing subject with no clear answer. however i do think that in general, most tolkien lore fans would agree that tolkien was ever swaying more to orcs from men, and probably would have edited parts of his works to make it fit.\n\nif this is true, this certainly means orcs are not immortal.\n\nit also means that their fea are free to leave their bodies upon death like men….which brings me back to Ellareth's point on what exactly happens with their body and soul. i mean, are we even certain they have a soul  within them? i cant remember (i will try and find it in the histories), but is it possibe for a middle earth being to be alive without one?\n\nif so this would support the idea of orcs not being evil, as this would point directly to them being mere puppets to their master's (melkor or sauron) will….(and hence my rather lengthy quote on thier beginnings above).\n\nhowever, werent the dwarves, when created without Eru's knowledge, denied existance until he declared them alive and accepted them into existance? this would counter the idea above the beings could exist without fae…and hence they must have at least some free will, instead of being mere puppets\n\ni woud like to know if there are any passages anywhere where it is explictly stated orcs had fae….i am not sure if it was ever stated directly, i mean we cant even agree where they came from\n\ni think evidence given in morgoths ring points that they did have fea, and were not mere puppets. the reason is similar as in the quote…they had the ability to rebel against their masters.\n\nthis adds weight to the fact  that orcs were not mindless beings, and thier evil acts (at least some of them) can certainly be attributed to them\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788773","commentId":788773,"userName":"richsabre","timestamp":1366876017,"content":"John85 said:\n\nI'll note once more I know Allegory is not at work, rather Tolkien's mind was so entirely Catholic that he could not help but to create a world that was likewise Catholic (if not explicitly so).\n\n\n\ni agree on this point. in fact (and my personal beliefs have nothing to do with this) i think any fantasy setting should steer clear from direct links to our real world and events/beliefs in them. to me it breaks the immersion of the setting. i think tolkien, despite as you say not helping to have indirect links, sets middle earth as its own place and time, and personally i find his world far more believable than any that have came after it\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788783","commentId":788783,"userName":"lleimmoen","timestamp":1366877776,"content":"John85, very interesting points, yes. Just one thing, the inclusion of these things doesn't necessarily leads toward the author being catholic, rather to his knowledge of catholicism and its symbolism. It is a bit stupid to give myself as an example, but I also write in my own language, and I am not siding with any church or religion as such, but I do insert religious references, perhaps more often than Tolkien did. When I first read Silmarillion, I thought the whole part about Eru and the Valar in the beginning was a mockery of the Genesis. But of course, there's no arguing about it, Tolkien was catholic. It is just sometimes people who want to see things will see them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788785","commentId":788785,"userName":"richsabre","timestamp":1366878086,"content":"lleimmoen said:\n\n \n\nJohn85, very interesting points, yes. Just one thing, the inclusion of these things doesn't necessarily leads toward the author being catholic, rather to his knowledge of catholicism and its symbolism. It is a bit stupid to give myself as an example, but I also write in my own language, and I am not siding with any church or religion as such, but I do insert religious references, perhaps more often than Tolkien did. When I first read Silmarillion, I thought the whole part about Eru and the Valar in the beginning was a mockery of the Genesis. But of course, there's no arguing about it, Tolkien was catholic. It is just sometimes people who want to see things will see them.\n\n \n\n \n\ni agree and i think this is part of why tolkien's work are masterpieces….the act of reading them is a very subjective experience, and each reader will get something different from them. for me, with my beliefs, i do not feel like his beliefs are intruding upon my own whatsoever, but someone who does have a religion may think thay it works in harmony with their beliefs…….\n\n…and some people say tolkien's work is too simplistic ( / shakes head in dissapointment :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788842","commentId":788842,"userName":"John85","timestamp":1366888158,"content":"lleimmoen said:\n\nJohn85, very interesting points, yes. Just one thing, the inclusion of these things doesn't necessarily leads toward the author being catholic, rather to his knowledge of catholicism and its symbolism. It is a bit stupid to give myself as an example, but I also write in my own language, and I am not siding with any church or religion as such, but I do insert religious references, perhaps more often than Tolkien did. When I first read Silmarillion, I thought the whole part about Eru and the Valar in the beginning was a mockery of the Genesis. But of course, there's no arguing about it, Tolkien was catholic. It is just sometimes people who want to see things will see them.\n\n\n\nI agree that these points don't lead to Tolkien being Catholic. Rather I see these points (or interpretations, if you prefer) as a reflection of Tolkien's faith. As you say \"Tolkien was [C]atholic\". Furthermore he was Catholic in a time when that perhaps meant more than it does now. Sure some people will find anything if they look for them, but given Tolkien's beliefs, his quote, etc. it seems awfully convincing that Middle-Earth is at least a reflection of a Catholic world.\n\nRich, you said something about Middle-Earth being it's own place and time, certainly it is, that's why it's so convincing (as a fantasy world). I'm not saying that one need know, believe, perceive, etc. any of these points in reading the novels to enjoy them (which is more or less the point you made, reading is a subjective experience), I'm just pointing them out.\n\nSimplistic indeed! (rofl)  cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif] sure why not a crab"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788876","commentId":788876,"userName":"richsabre","timestamp":1366894367,"content":"John85 said:\n\n \n\nSimplistic indeed! (rofl)  cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif] sure why not a crab\n\n \n\n \n\ni couldnt agree more! cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788884","commentId":788884,"userName":"Raven1015","timestamp":1366895513,"content":"I think Tolkien's work appears simplistic on the surface, but the more you dig into it, the more complex it becomes. I can see why people have that opinion, but I think they're more commenting from the perspective of the post-modern world of fantasy literature where characters tend to be morally gray and villains have in-depth backgrounds and motivations. I agree with you all that I don't think Tolkien is simplistic at all, but it takes time and thought to uncover the complexities. As a final side note, sometimes so-called complex works today are only superficially so, anyone can throw in an anti-hero and random violence and call their work deep.\n\nOk, enough of that. The question of where orcs go, whether they have fae, etc., is an interesting one. I guess the hard part is it is unclear exactly what the corruption process was and what exactly it did. This is even more important, in my opinion, then where exactly orcs came from (though that is not an unimportant question). What did Melkor do to elves or men to turn them into orcs? This is important because it would give us clues as to whether the souls and thus free will of the original orcs was stripped away in the process. Is it even possible to do this? Or perhaps it was more that Melkor darkened or corrupted the fae of the original orcs, so that while they retain their spirits/souls, they will have a tendency towards wicked deeds just like Melkor? Again, is it even possible to do this? In the first case, if the fae of original orcs were stripped away, then presumably this is true of their descendants as well, and when they die, they don't go anywhere. They are just bodies that cease to be \"alive\". In the second case, with corrupted fae, then presumably even a darkened spirit would go somewhere. Perhaps as with Saruman's incorporeal spirit at the end of LOTR, where he is barred from returning West and must wander around formless, the corrupt spirits of orcs are also barred from either going West or going where Men go when they die, and thus they also must wander the earth. If so, given how many orcs get killed throughout the course of the various stories, that's a heck of a lot of wandering orc spirits! Still, I have to say that the second case seems more likely, as the orcs as we see them, don't appear to be automatons, and appear to have a level of free will. But as I said before, it doesn't appear that they are able to choose the path of good, so that's why it seems their fae have somehow been corrupted at a base level.\n\nFor the religion aspect, I definitely see the influence of his Catholic beliefs on the world. But it is also not intrusive. You can choose to see and explore it, if you wish, and explore it in-depth, or not bother with it at all. I think this is what Tolkien means about the difference between allegory and applicability. Again, I wonder about Tolkien's motivations for leaving out organized religion. Perhaps he feared that including such an element would leads to too much intrusion, and I think it would fundamentally alter the feel of the world he created. There is tons of exploration of christian values in his works, in a way that is moving to me, even though I am an agnostic and have no strong religious beliefs, because those explorations seem valuable in a general sense for all humans. Including organized religion seems both unnecessary and like a great big cudgel over the head in that context. Some people I think might criticize this exclusion for making his world \"unrealistic\", but Tolkien wanted to make his own world on its own terms, not a realistic facsimile of a medieval world with fantasy elements thrown in, like George Martin's Westeros (I'm a fan of his work by the way, but comparing the two isn't very useful). Also, the myths and faerie stories that Tolkien drew on for inspiration did not include religion in the sense of an institutional force in the world."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788891","commentId":788891,"userName":"lleimmoen","timestamp":1366896320,"content":"Raven1015 said:\n\n \n\nAs a final side note, sometimes so-called complex works today are only superficially so, anyone can throw in an anti-hero and random violence and call their work deep.\n\n \n\n \n\nExactly, and a perfect example is GoT, I do not want to go into argument about it, since even a thought of it is a little uncomfortable but there are some followers of that work who think Tolkien was shallow with his characters; they probably prefer so-called colourful characters that one can hardly connect with since it is so hard to feel for them, waves of the wanna-be deep characters that make you feel indifferent about them.\n\nI myself find the fantasy genre being some of the worst reading that exist, although of course it is hard to nagivate oneself in the flood of countless volumes.\n\nBack to the topic. I also prefered the version where orcs were twisted Elves. It has a great bearing about the fact that nothing can be beautiful enough so that it couldn't become ugly. I also think the physique and stature is more likely with orcs and Elves than orcs and men."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788914","commentId":788914,"userName":"richsabre","timestamp":1366899717,"content":"it is an interesting point on how exactly orcs were corrupted and twisted into creation….i refer to my above post, specifically\n\nMelkor could be seen as starting this off with ‘lifeless’ beasts, then mating the end results with the later elves to further create the true orcs.\n\nwhat i personally think happened is that melkor used maia (as some think the 'immortal orcs' were) and then bred with men or elves (depending on the period)…….what is interesting, is, is this possible?\n\nwe know from the silmarillion that offspring between maia and human is possible from Luthien….so were orcs mated in this way, between an evil maia in orc form, and elven/human women?….a nasty but inevitable thought i think.\n\nif this is true, then elves/men werent corrupted by acts against them, but the race of men/elves were corrupted through breeding with evil itself\n\n \n\n@lleimmoen: i agree with you. fantasy works can be the worst for resorting to cliche in the world of literature. i think the beauty of tolkien's work compared against others is the use of sources and inspiration (though i guess the fantasy scene wasnt as packed then as it is now) and the lack of graphic violence….now im not one who thinks books should leave this out, but if a sense of war and death can be created without resorting to graphic scenes, then i think its all the more effective\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788973","commentId":788973,"userName":"Mr Coffee","timestamp":1366909634,"content":"richsabre said:\n\nhello, welcome to the first of the tolkien lore topics. this is meant as a disucssion, not as me writing an article, so feel free to take it where you want…there is no thread hijacking here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\n \n\nWell then….  PINEAPPLE.\n\n \n\nThat is all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788975","commentId":788975,"userName":"richsabre","timestamp":1366909894,"content":"benhanses said:\n\nrichsabre said:\n\n \n\nhello, welcome to the first of the tolkien lore topics. this is meant as a disucssion, not as me writing an article, so feel free to take it where you want…there is no thread hijacking here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\n \n\nWell then….  PINEAPPLE.\n\n \n\nThat is all.\n\n\n\ncucumber? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/?do=findComment&comment=788981","commentId":788981,"userName":"Mr Coffee","timestamp":1366911036,"content":" \n\nNow that I've gotten that ridiculousness of the pineapple out of my system, I thought I'd throw in just a few thoughts in response to some of the excellent posts here!\n\n*Edit… I am making some of these responses to some ideas/comments as I am reading through, so apologies for coming late to the conversation and if I restate anything that has already been said.  I'll try and just keep re-editing this singular reply so as not to clutter this thread up with all my ramblings…\n\nIn thinking about some of the nasty deeds that were performed by some of the first-age elves (obviously most notably Feanor and his brood) that was mentioned by a couple folks on here in comparison to the more \"noble\" appearance of Elves later in ME history/Tolkien's writings:  I don't think it is necesarily a drastic change or diverging from a \"natural progression\" of a race that is ages old…  It is quite clear that Tolkien expresses that the Elves (and Men, Dwarves, Balrogs, Spiders, etc) of older times were not only more numerous, but more \"potent\" (for lack of a better term) than the later version.  Elrond, Galadriel, Aragorn, Thorin, etc are a fleeting rememberance of the glory that each of these races used to possess in greater numbers.  In that vein, the motives and passions of a more potent citizenry of the ME world would definitely lead to greater deeds, both notorious and grand.  That being said, I'd like to think that the Elves have gained communal knowledge and wisom as time has progressed, possibly demonstrated no better than by Galadriel herself.  Initially created as a character that fell from grace as a follower of the sons of Feanor, and originally sworn to repossess the Silmarils at ALL costs, we see that after thousands of years of fighting evil and living in ME, she has now gained the wisdom and ability to resist the temptation of the ring when presented to her. \n\nAll that to say, the Elves definitely committed some evil acts early in the history of their race, but I believe that it can be more attributed to the hot-headedness and false pride of those characters than an innate \"evil\" that may have been lurking in them (I won't cover much on the free-will\" discussion,as that has been covered well already).  My personal response to characters like the sons of Feanor and even Thranduil interests me, because I realized that I actually view them as borderline villains because of their roles in the stories.  But when I stop and evaluate them through the kaleidescope of my own emotions and how I think I probably would react in their given situations, I think as a hot-headed individual myself that I can easily see myself doing many of the same things…\n\n \n\nRaven1015 said:\n\n \n\n1) Free will seems to be a gift that can only be given by Illuvatar. He is the only one who can create living, sentient beings, and it seems to me that he is the only who can create beings with free will as well. Melkor must corrupt existing beings to \"create\" his own race, but can't create them with free will.\n\n2) Now one might say, if Melkor is using beings with free will, Elves and Men, as the base material for his orcs, shouldn't that free will continue? I think the answer is no because he is essentially transforming them into something new. Also, Melkor's main focus is dominion. Above all, he craves bending everything in creation to his will. As such, it would make sense that the process of corruption also entailed the destruction of the free will of orcs.\n\nNow when I say orcs don't have free will, I don't mean they are automatons that mindlessly obey the commands of Melkor and Sauron. I don't mean that they don't have the ability to decide what they are going to have for breakfast on a particular morning. What I mean is that they don't have the ability to choose to move away from evil and darkness, whereas Men and Elves can choose between good and evil with their actions.\n\n \n\nAs for why the Elves of the Third Age seem to be much more virtuous than those of the First Age, that is a good question. I feel like it may be that since Elves are immortal, those we see in the First Age represent the rash, hot-headed arrogance of the young, while those in the Third Age represent the wisdom of hard-earned experience. Those who chose the wrong path perished long ago, while those who remain remember the lessons of the past.\n\n \n\nAs a final note, I heard somewhere that Tolkien was considering revising his conception of the orcs in later life, and was unhappy with the way they were so one-dimensionally evil.\n\n \n\n \n\nAs an initial reaction to the free-will (or lack thereof) possibilities for orcs, I was thinking about how the various orcs/goblins/uruks quarraled amongst themselves in how to deal with their captives in LOTR.  Also, if Illuvator is the sole source of free-will in ME, where does that leave the Dwarves, since they were not created by Illuvator, but rather by Aule (granted, then it becomes a level of degree/semantics, as he did submit his creations to the song of Illuvator, whereas Melkor obviously did not).  Still, it raises the question of free-will's source in ME..\n\n \n\n\n\n> I think there are signs of how orcs look at Elves. And yes, they find them evil. Even Smeagol does so, right? And there's an interesting aspect to it, Smeagol doesn't imagine it, the Elven rope really burns him, and the Elven bread tastes foul.\n\nHe definitely despises them… but on a not-really-related concept, does the rope literally burn him and the bread truly foul?  Or are those both figments of imagination?  I guess it's really more a question of the power of the mind… that his hatred of them that was in his mind created a physical manifestation.  Was there a similar response from him in raction to the orcs/goblins that tortured him?  If not, then why not?  Although captured by Elves/Aragorn at one point, I don't recall any talk of them mistreating him… so where would this extra level of hatred be derived from?  Personally, I'd have a lot more hatred for someone that tortured me, i would think…"}]}