{"url":"https://community.fantasyflightgames.com/topic/82896-orc-raiders-question/","title":"Orc Raiders Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82896-orc-raiders-question/?do=findComment&comment=788824","commentId":788824,"userName":"Khamul The Easterling","timestamp":1366885215,"content":"So when a Orc Raiders engages you it says \"discard two attachments you control.\"  Do you have to discard two attachments that are on a character? Or can you discard two attachments from your hand?(Or one from your hand a one attached to a charachter.)  I'm pretty sure you can just discard any attachment even if its from your hand right? \n\nThanks "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82896-orc-raiders-question/?do=findComment&comment=788827","commentId":788827,"userName":"richsabre","timestamp":1366885491,"content":"im pretty sure 'attatchment you control' is one you have put into play.\n\ni do not think you control an attatchment in your hand\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82896-orc-raiders-question/?do=findComment&comment=788839","commentId":788839,"userName":"Khamul The Easterling","timestamp":1366887643,"content":"Hmmm Ok. I guess I'll go with that.  \n\nI'm playing your Flight to the Ford deck lately (20 games already) and Road to Rivendell can be brutal.  I can never keep Asfaloth and Valinor on glorf becasue of the Orc raiders and Black Uruks.  Right now I'm only 3-2 on RtR haha.  It can be really tough sometimes and quite easy other times. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82896-orc-raiders-question/?do=findComment&comment=788871","commentId":788871,"userName":"richsabre","timestamp":1366893553,"content":"Khamul The Easterling said:\n\nHmmm Ok. I guess I'll go with that.  \n\nI'm playing your Flight to the Ford deck lately (20 games already) and Road to Rivendell can be brutal.  I can never keep Asfaloth and Valinor on glorf becasue of the Orc raiders and Black Uruks.  Right now I'm only 3-2 on RtR haha.  It can be really tough sometimes and quite easy other times. \n\n\n\ni have varied the Flight to the Ford deck by switching out strider with elrond, thats if you want that extra point of willpower and defense\n\nif youre struggling (and play 2 handed) try it with a mono tactics deck, make sure you put in feints and thicket of spears\n\nim currently running hama, beorn and legolas, and its quite a powerful deck to compliment the ford deck\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82896-orc-raiders-question/?do=findComment&comment=788883","commentId":788883,"userName":"Khamul The Easterling","timestamp":1366895227,"content":"Then it looks like you would have a problem with threat on your flight to the ford deck cause strider would help take care of the threat gain from frodo's defending.  Or do you mainly quest with frodo and not defend big attacks as much now?  Did you add some Glad Greetings in for a sort of replacement?  I dont think it would work as well with Elrond intead of Strider but I guess you know how it works casue you've played it. \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82896-orc-raiders-question/?do=findComment&comment=788917","commentId":788917,"userName":"richsabre","timestamp":1366899970,"content":"well if you run elrond, its one point higher, but frodo is out of place…what i am actually running now is what i meant to post. these are\n\nbeorn/hama/legolas and glorfindel/elrond/eowyn.  \n\nthe general idea is to have thicket of spears and feint recyced by hama and have that deck engage as many enemies as possible. the other deck can be protected by lowered threat (galadrims + elronds counsel) and beorns sentinel, which he doesnt have to exhaust to do.\n\nthe spirit/lore deck quests like crazy with asfaloth and legolas helping place tokens. attacthments are got easier by master of the forge and mathom\n\nonce the lore/spirit deck gets threat lowered enough i put song of earendil in play to help with the tactics decks threat\n\nrich"}]}