{"url":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/","title":"New player deck question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789153","commentId":789153,"userName":"Nickpes","timestamp":1366965286,"content":"Got into this game two weeks ago playing with my wife, only core set yet.\n\nWe make mixdecks but stay at 30 cards per deck. Is this a good number or it wou;d be better t have 50 ?  Till now we play only the first senario and manage to win without much difficulty this way\n\n \n\nthanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789154","commentId":789154,"userName":"richsabre","timestamp":1366965479,"content":"hello, welcome\n\nyour question depends on how you want to play the game. despite there being no 'official' minimum deck requirement, the majority of players play with the tournament rules deck…(and what i may say has become the accepted amount by most players)..that is a minimum of 50 cards in a deck.\n\nif you dont want to play with this, 30 cards is of course beneficial due to you having higher chances of drawing key cards out of your deck. it does mean that your deck will not be very varied and may struggle, unless you are bulding decks for specific quests. this is especially true if you are playing mixed decks\n\nso in summary, it depends what rules you want to play with\n\nas you build your collection it is likely you will move to 50 card decks due to the increase in useful cards you will wish to include in your deck\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789167","commentId":789167,"userName":"DurinIII","timestamp":1366968965,"content":"Everything Rich just told you. Welcome to the game, indeed! It is a fun one! No doubt you are most likely already a Lord of the Rings fan if you purchased this game in the first place. As far as Tolkien-esque games are concerned, this is the best one on the market. The art is superb and the gameplay a blast! Hope you enjoy it! \n\nJoseph"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789191","commentId":789191,"userName":"Nickpes","timestamp":1366973094,"content":"Thanks for the answers. \n\n \n\nSo it's up to us then and how we want to make our decks depending our strategy. We are newbies so a lot of work and mix ahead.\n\nSince apart from the core set we also have \"hunt for Gollum\", \"Journey to Rhosgobel\" \"Watcher in the Water\" and \"Shadow and Flame\" (just to have my favourite characters, we are not even close to try any of these, also have Massing at Osgiliath, love the Witch King) we may try some of those card in our decks for our core adventures\n\n \n\nDurinIII yes I'm a Tolkien fan, first read Silmarillion back in 1997 (tough book to start with) , then Lord of the Rings a couple of years after.\n\nFor a reason I cannot explain while I had Hobbit also I read it when I heard that it is going to be a movie. I thought that I was not going to like it but eventually loved it as the others\n\n \n\nWhile playing a lot of Board games never had one with cards like this and I really love it. Strange it may seem but my wife also loves it while she doesn't like any of Tolkiens works \n\n \n\nagain thanks\n\nnikos\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789420","commentId":789420,"userName":"iznax","timestamp":1367034479,"content":"I play with my wife to (and solo most of the time) and we use a combat deck and a support/questing deck, a very simple but effective way for most of the quests. There is no specific method to build a ''role'' deck, you just use heroes and cards you think are the best for the job, i dont like to give a sample deck to new players because the deckbuilding part of the game is 50% of the fun .\n\nP.S. Where r you from Nikos? my name is Nikos to :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789469","commentId":789469,"userName":"DurinIII","timestamp":1367056617,"content":"Nikos; Glad your wife is enjoying the game too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789497","commentId":789497,"userName":"Nickpes","timestamp":1367062761,"content":"Well I use a deck most of tactics and lore while my wife has Spirit and a bit of Leadership and we find those combinations good, but we haven't played a lot of games to try other stuff. We have two babies and time is limited, we wait for them to sleep in order to play :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\niznax said:\n\nP.S. Where r you from Nikos? my name is Nikos to :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\n\n \n\nI live in the small city of Anavyssos, near Athens-Greece (though since your name is Nikos most propably you are Greek too)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/82945-new-player-deck-question/?do=findComment&comment=789701","commentId":789701,"userName":"iznax","timestamp":1367127691,"content":"I live in the small city of Anavyssos, near Athens-Greece (though since your name is Nikos most propably you are Greek too)\n\n\n\nYep i'm Greek and i live in Athens :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] if u like u can check my site http://boardgamenewsonline.gr/ [http://boardgamenewsonline.gr/] it is a board gaming news portal and i'll love to keep in touch so we can talk more about lotr lcg (i realy love this game).\n\nTake care and have fun !"}]}