{"url":"https://community.fantasyflightgames.com/topic/83014-treasure-conditions/","title":"Treasure conditions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83014-treasure-conditions/?do=findComment&comment=789572","commentId":789572,"userName":"GrandSpleen","timestamp":1367082412,"content":"This is really a minor question, but how do you all interpret the limitations on using Treasure cards in your deck?  Specifically, rule number 1.  Here's the text from the Hobbit box inserts:\n\n \n\nA player is permitted to add a treasure card to his deck if\nboth of the following conditions are met:\n1. The player has discovered the specific treasure card he\nwishes to use through game text in a previous scenario using\nthe same group of heroes he is currently playing with.\n \n \nDoes this mean that you can use a Treasure (in the correct scenario) if you are using the same heroes for EVERY player in the game, or for just the one player who is putting treasures into his/her deck?\n \nFor example: you win treasures in a 2-player game.  Can you use those treasures when playing solo?  Or when playing with 3 players?  The larger \"group of heroes\" has changed, but if you only understand \"group of heroes\" to refer to the heroes controlled by the player who wants to use treasure cards, the group hasn't changed after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83014-treasure-conditions/?do=findComment&comment=789574","commentId":789574,"userName":"richsabre","timestamp":1367082592,"content":"i have only managed to get a few of the treasure cards yet, but i see it as\n\nsay player A discovers treasure, then player A can use it if their heros remain the same, even if joined in a 2 player game where player B changes his heros….still, i could be wrong\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83014-treasure-conditions/?do=findComment&comment=790306","commentId":790306,"userName":"Nerdmeister","timestamp":1367296824,"content":"We have been playing the hobbit expansion as one long campaign in correct order two times with two different deck setups. No changes in either hero or deck setup (except from treasure cards) between scenarios.\n\nBasically we play it as if taking on a hard challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83014-treasure-conditions/?do=findComment&comment=868771","commentId":868771,"userName":"Nenya","timestamp":1379451146,"content":"This is a rookie question, but here goes.  I have also been playing the hobbit saga quests as one long campaign.  After playing the first quest (We Must Away, Ere Break of Day), I acquired the treasures that were in the troll cave.  When I set up to play Over the Misty Mountains Grim, do I add my discovered treasures to my 50 card deck, or do I take out one card for each treasure I add?  Thanks for your help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83014-treasure-conditions/?do=findComment&comment=869008","commentId":869008,"userName":"GrandSpleen","timestamp":1379475826,"content":"You just add the treasures into your deck.  Also, there is no maximum deck size, so you would never need to remove cards to make room for others, anyway.\n\n \n\nThere is a 50-card minimum if you want your deck to be tournament legal.  50 cards is pretty well accepted as the minimum for standard play, tournament or not.  Treasures don't count toward the 50-card minimum, according to the rules insert for the two Hobbit expansions, so a tournament-legal deck with Sting, Glamdring, and Orcrist in it would need to have at least 53 cards (50 plus the 3 treasures)."}]}