{"url":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/","title":"Lonely Mountain 2B and Smaug the Golden Question (Forced Effect timing)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=789841","commentId":789841,"userName":"arandhawa","timestamp":1367177921,"content":"I'm currently on quest 2B of the Lonely Mountain quest on the Hobbit: On the Doorstep and I have 5 progress tokens on Smaug the Golden. I then quest successfully and trigger the first Forced effect on quest 2B. This requires me to place a 6th progress token on Smaug the Golden, make a burgle attempt and if successful take a treasure under the Lonely Mountain and then move to Stage 3 if I want.\n\nMy question is.. After immediately placing the 6th token on Smaug the Golden do I\n\n1)  immediately resolve his Forced effect (where after putting the 6th progress token on him I advance to stage 4A) and THEN finish up the rest of the first forced effect on 2B(make a burgle attempt,etc.)? If I do this and move to Stage 4A does that invalidate stage 2B's remaining effect since it's out of play?\n\nor\n\n2)do I finish the forced effect on Quest 2B (which after placing the 6th token on Smaug the Golden I would make a Burgle attempt and if successful take a treasure card under Lonely mountain and advance to stage 3) and then deal with Smaug the Golden's Forced effect of having placed the 6th progress token? If I do this second option wouldn't that invalidate Smaug the Golden's Forced Effect since by moving to Stage 3 I put him out of play and bring in Smaug the Magnificent?\n\n \n\nAny help would be appreciated.\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=789969","commentId":789969,"userName":"Nerdmeister","timestamp":1367219554,"content":"Ran into the same scenario the other night. We did it by putting 4A into play and ignoring the rest of the text on 2B."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1646531","commentId":1646531,"userName":"TwiceBorn","timestamp":1433298734,"content":"> I'm currently on quest 2B of the Lonely Mountain quest on the Hobbit: On the Doorstep and I have 5 progress tokens on Smaug the Golden. I then quest successfully and trigger the first Forced effect on quest 2B. This requires me to place a 6th progress token on Smaug the Golden, make a burgle attempt and if successful take a treasure under the Lonely Mountain and then move to Stage 3 if I want.\n> \n> My question is.. After immediately placing the 6th token on Smaug the Golden do I\n> \n> 1)  immediately resolve his Forced effect (where after putting the 6th progress token on him I advance to stage 4A) and THEN finish up the rest of the first forced effect on 2B(make a burgle attempt,etc.)? If I do this and move to Stage 4A does that invalidate stage 2B's remaining effect since it's out of play?\n> \n> or\n> \n> 2)do I finish the forced effect on Quest 2B (which after placing the 6th token on Smaug the Golden I would make a Burgle attempt and if successful take a treasure card under Lonely mountain and advance to stage 3) and then deal with Smaug the Golden's Forced effect of having placed the 6th progress token? If I do this second option wouldn't that invalidate Smaug the Golden's Forced Effect since by moving to Stage 3 I put him out of play and bring in Smaug the Magnificent?\n> \n>  \n> \n> Any help would be appreciated.\n> \n>  \n> \n> Thanks!\n\n \n\nThread necromancy due to having encountered this very situation yesterday.\n\n \n\nContrary to what Nerdmeister suggested, I think option 2 above is just as valid an interpretation of the appropriate way to resolve the situation. The Forced effect on Quest stage 2B allows you to move straight to Stage 3 after completing a successful Burgle attempt, and the \"When Revealed\" effect on Stage 3B removes Smaug the Golden from play and would consequently invalidate his Forced effect instructing the players to advance to stage 4 instead (once a 6th progress token is placed on him). \n\n \n\nQuesting successfully on stage 2B occurs before placing the progress token on Smaug the Golden, so it seems to me that the Forced effect on the quest card should be resolved fully before resolving the Forced effect on Smaug the Golden… and the latter can't be resolved once Smaug the Golden has been removed from play due to the When Revealed effect of Stage 3B, which occurs as part of the Forced effect from stage 2B.\n\n \n\nAny other thoughts on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1646551","commentId":1646551,"userName":"CJMatos","timestamp":1433300286,"content":"I agree with TwiceBornh on the fact that the Stage 2B Forced effect must be fully resolved before going to the Smaug the Golden Forced effect.\n\n \n\nThough i have to say one thing:\n\n \n\nQuest Stage 2B says, at the finish of first forced effect (the one in question here), \"Then, the players may advance to stage 3\".\n\n \n\nThe word may means you do not have to go to stage 3 and can wait to resolve Smaug the Golden Forced effect and advance to stage 4A, if they want to continue fight Smaug and try catching another treasures..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1646620","commentId":1646620,"userName":"DukeWellington","timestamp":1433305819,"content":"The mechanics are structured to allow you to try and steal all the treasure. The word \"may\" is there specifically to allow you to keep stealing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1646660","commentId":1646660,"userName":"TwiceBorn","timestamp":1433310491,"content":"> I agree with TwiceBornh on the fact that the Stage 2B Forced effect must be fully resolved before going to the Smaug the Golden Forced effect.\n> \n>  \n> \n> Though i have to say one thing:\n> \n>  \n> \n> Quest Stage 2B says, at the finish of first forced effect (the one in question here), \"Then, the players may advance to stage 3\".\n> \n>  \n> \n> The word may means you do not have to go to stage 3 and can wait to resolve Smaug the Golden Forced effect and advance to stage 4A, if they want to continue fight Smaug and try catching another treasures...\n\n \n\nYes, duly noted.\n\n \n\nI was in a situation where I absolutely wanted to go straight to stage 3 and quest like mad as I had just burgled the fifth treasure and had only one copy of Dawn Take You All in hand with which to prevent Smaug the Magnificent from slaughtering my party. I also managed to have Escort from Edoras x 3 and OHUH Gandalf on the table in the following round for that one mad push to victory… only placed two excess tokens on stage 3. If I had come short, I definitely would have been slaughtered… I checked the encounter deck out of curiosity, and Smaug would have made at least 5-6 consecutive attacks against a 95% exhausted party had we gone to the next Combat phase.\n\n \n\nAnyway, glad that you gentlemen confirmed that my win was \"valid.\"\n\n \n\nIt was my second attempt straight solo (progression style) against The Lonely Mountain (managed to beat it several times without too much trouble 2-handed), and I barely pulled that victory by the skin of my teeth. Totally epic finish! Of course, I could have won much sooner and more easily had I not been so greedy… :-)\n\nEdited June 3, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1739939","commentId":1739939,"userName":"Emilius","timestamp":1439831683,"content":"I have asked to Caleb for this question that we faced last night:\n\nThe answer is:\n\n\"Hi,\n\nWhen you resolve the Forced effect on stage 2B, you resolve it sentence by sentence. The first sentence instructs you to place 1 progress on Smaug. If that is the 6th progress on Smaug, then Smaug’s Forced effect kicks in and redirects you to stage 4A, removing stage 2B from play. Since stage 2B’s text is no longer active, you do not resolve the next sentence on it. Instead, you must resolve the ‘when revealed’ effects on stage 4A.\n\nTherefore, when you place the 6th progress on Smaug at stage 2B, you do not make a burgle attempt, instead you advance to stage 4A. You must defeat stage 4B in order to return to stage 2B.\n\nI hope you’re enjoying The Lonely Mountain!\n\nCheers,\n\nCaleb\"\n\nHope this helps\n\nEdited August 17, 2015 by Emilius"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1762076","commentId":1762076,"userName":"TwiceBorn","timestamp":1440831323,"content":"Thanks for that, Emilius... even though I find that ruling extremely frustrating, and I now wish that I had remained blissfully ignorant of it.\n\n \n\nI have great respect for Caleb (as a designer, and also due to his accessibility to the community), but it REALLY annoys me when developers provide responses that are inconsistent with the official FAQs, doubly so when an expansion's rules insert could/should have addressed ambiguous situations (and if I recall correctly, there are several significant ones in the Hobbit sets).\n\n \n\nAccording to the FAQ:\n\n \n\n(1.24) Questing Successfully \n\nQuesting successfully and the physical placement of progress tokens are two separate game occurrences that happen in sequence during the Quest Resolution step. As soon as the players determine that the total committed Willpower is greater than the total Threat in the staging area, they are considered to have quested successfully. Any Forced or passive effects initiated by questing successfully resolve before physically placing progress tokens. \n\nExample: Tom has just successfully quested during stage 1B of The Hunt Begins (SoM 11), and he will be placing enough progress to advance to the next stage. However, he must first resolve the Forced effect (which resolves immediately upon the occurence of “questing succesfully”) before placing progress tokens on the quest.\n\n \n\nAlso:\n\n \n\n(1.02) Simultaneous Effect Timing If two or more conflicting effects would occur simultaneously, the first player decides the order in which the effects resolve.\n\n \n\nIt seems pretty clear to me that the wording of FAQ 1.24 indicates that a Forced effect must be resolved fully before any tokens are placed on a quest card (and/or, in this case, on Smaug the Golden)... it says nothing of resolving Forced effects \"sentence by sentence\" (across Forced effects that span two different cards), which just feels like a ruling issued on the fly nearly 3 years after the Hobbit saga expansions were released. And, if one accepts that both my interpretation and that of Caleb are valid/consistent with the rules and FAQ (and that the differing interpretations effectively create conflicting effects that would occur simultaneously), then FAQ 1.02 ultimately should prevail and allow the first player to decide in what order to resolve the Forced effects on stage 2B and Smaug the Golden. If the developers had intended otherwise, then IMO, they should have made that explicit in the scenario rules insert.\n\n \n\nI think I'm especially bitter because of how hard I fought to burgle all the treasures and escape successfully against all odds, in a manner that I (and other players on these boards) agreed was legitimate... only to have that win invalidated by what feels to me like an ad hoc ruling. Yes, it's only a game and I shouldn't take it seriously, and yes, I can ignore the answer from the devs... but these kinds of inconsistencies and shifting rules just drive me nuts, and deflate one's sense of accomplishment after the fact...\n\n \n\nHow many times do we have to win in this game only to find out later that we really did not win due to ambiguous rules wording/situations and debatable developer rulings?\n\n \n\n[End of rant]... \n\nEdited August 29, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1762286","commentId":1762286,"userName":"PocketWraith","timestamp":1440848922,"content":"I also find it a frustrating ruling, but at least some of it does make sense.\n\n> According to the FAQ:\n> \n>  \n> \n> (1.24) Questing Successfully \n> \n> Questing successfully and the physical placement of progress tokens are two separate game occurrences that happen in sequence during the Quest Resolution step. As soon as the players determine that the total committed Willpower is greater than the total Threat in the staging area, they are considered to have quested successfully. Any Forced or passive effects initiated by questing successfully resolve before physically placing progress tokens. \n> \n> Example: Tom has just successfully quested during stage 1B of The Hunt Begins (SoM 11), and he will be placing enough progress to advance to the next stage. However, he must first resolve the Forced effect (which resolves immediately upon the occurence of “questing succesfully”) before placing progress tokens on the quest.\n\nWhere it refers to physically placing progress tokens there it refers to placing progress as a result of questing successfully per the usual framework of the game. Placing progress on Smaug the Golden is not done per the usual framework as a result of questing successfully, it's done by a Forced effect which triggers upon questing successfully, a crucial distinction in this instance.\n\n \n\nThe 'sentence by sentence' thing is more debatable though. This has been brought up in at least one other ruling, for Doom, Doom, Doom in Journey in the Dark - remove the token, put The Balrog into play, and then it attacks you - but that instance referred only to the text on one single card, whereas this spans two separate cards, which is much less clear. If Smaug's effect was a passive rather than Forced that would make more sense as passives take precedence. Alternatively this ambiguity could be cleared up if the quest effect said \"After questing successfully, place one progress on Smaug the Golden and resolve his effect.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1762298","commentId":1762298,"userName":"sappidus","timestamp":1440849820,"content":"> It seems pretty clear to me that the wording of FAQ 1.24 indicates that a Forced effect must be resolved fully before any tokens are placed on a quest card (and/or, in this case, on Smaug the Golden)...\n\nI think your parenthetical here is minimizing the crux of the issue here... 1.24 is referring to quest progress placed as a result of game framework effects, but progress is placed on Smaug from an *encounter* card effect, and card text overrides all. I mean, to me at least, it seems pretty clear that the design intention was to simulate a timer and that you therefore shouldn't be able to try make one last burgle attempt if the timer goes off... I'm sure the scenario would have been designed differently in these modern days of the Time keyword and all. (EDIT: aka exactly what PocketWraith said while I was writing this post, lol)\n\nNonetheless, I certainly understand where you're coming from with the 1.02 citation. And who of us can't empathize the frustration with a ruling that invalidates one of our hard-fought wins? As someone who progression-styled the entire game just this year, I can't tell you the number of times I've thought I've beaten a scenario, only to find out totally randomly that some obscure ruling makes me go back and do the **** thing again. Yeah, it's super-annoying, but I just consider it part of the game at this point. And there's always that Silver Rule: any reading of the rules that makes it harder for the players is the correct one.\n\nWhat did Catullus say? \"I hate and I love...\"\n\nEdited August 29, 2015 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=1762669","commentId":1762669,"userName":"TwiceBorn","timestamp":1440872494,"content":">  \n> \n> If Smaug's effect was a passive rather than Forced that would make more sense as passives take precedence. Alternatively this ambiguity could be cleared up if the quest effect said \"After questing successfully, place one progress on Smaug the Golden and resolve his effect.\"\n\n \n\nAgreed. I guess I sometimes wonder how it is that play testers fail to catch some of what I consider to be the more obvious rules ambiguities in scenarios and why those ambiguities aren't explicitly addressed in rules inserts... but perhaps insufficient play testing is part of the problem?\n\n \n\nAnyhow, it was just a late night vent, I'm over it... thanks to you and sappidus for recognizing my post for what it was and for responding in a way that did not belittle me or my experiences. :-) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=2224635","commentId":2224635,"userName":"staurasi","timestamp":1463645983,"content":"I usually play Expert Treasure-Hunter on Bilbo in this scenario\n\n\"Response: After attached hero quests successfully, name a card type and discard the top card of your deck. If the discarded card is the named type, take it into your hand\"\n\nand trigger its response after fullfilling instructions on stage 2B, in other words after the burglar attempt. This is very handy beacause I often know whats' the topmost card after a burglar attempt.\n\nNow, considering that I must resolve Forced effect on stage 2B sentence by sentence, i'm wondering if I'm doing it right. Maybe Expert Treasure-Hunter response triggers after placing the token on Smaug and just before the burglar attempt? What do you think?\n\nEdited May 19, 2016 by staurasi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=2225821","commentId":2225821,"userName":"NathanH","timestamp":1463693424,"content":"> I usually play Expert Treasure-Hunter on Bilbo in this scenario\n> \n> \"Response: After attached hero quests successfully, name a card type and discard the top card of your deck. If the discarded card is the named type, take it into your hand\"\n> \n> and trigger its response after fullfilling instructions on stage 2B, in other words after the burglar attempt. This is very handy beacause I often know whats' the topmost card after a burglar attempt.\n> \n> Now, considering that I must resolve Forced effect on stage 2B sentence by sentence, i'm wondering if I'm doing it right. Maybe Expert Treasure-Hunter response triggers after placing the token on Smaug and just before the burglar attempt? What do you think?\n\n \n\nThe whole of the Forced effect from stage 2B will resolve before the Response effect from Expert Treasure-Hunter triggers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83067-lonely-mountain-2b-and-smaug-the-golden-question-forced-effect-timing/?do=findComment&comment=2226384","commentId":2226384,"userName":"staurasi","timestamp":1463727827,"content":"Thank you NathanH! Glad to hear that I was doing it right."}]}