{"url":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/","title":"How do you build your deck? AND ALSO What my next buy should be?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/?do=findComment&comment=790221","commentId":790221,"userName":"vermillian2","timestamp":1367271448,"content":"Hi!\n\nI have all of FFGs LCGs. I really enjoyed this one, until I realized that everyone was making specific decks for specific scenarios… not just building 'one deck to rule them all' sort of thing… which sort of ruined the fun for me…\n\nHow do you guys play? Do you know what scenario you're fighting off against and build a deck to beat that, or build a deck and surprise yourself with a scenario?\n\nALSO\n\nI'm thinking about my next buy. I have the core set and the first two expansion packs… my decks really aren't that playable and I'd like to have 2-4 decks together so I cna get some friends and show them how to play together.\n\nSuggestions on a deluxe expansion that'd give me some things I'd need?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/?do=findComment&comment=790227","commentId":790227,"userName":"Ellareth","timestamp":1367272683,"content":"vermillian said:\n\n until I realized that everyone was making specific decks for specific scenarios…\n\n\n\nWhile it is true some prefer to build scenario specific quests (esepcially for more difficult quests),\nthere are many who builds a deck for several (if not all) quests or a cycle.\n\nAs for which expansions to get next, I would normally suggest get them in release order.\nHowever, if you are having problem finding earlier expansions due to shortage of supply, Hobbit Saga expansions should be excellent additions to your collection while waiting for the reprints of earlier expansions to hit the store."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/?do=findComment&comment=790235","commentId":790235,"userName":"hildargo","timestamp":1367274352,"content":"Some quests do require a deck specifically tuned to it (looking at you, Journey to Rhosgobel). At this point, I think that there are a couple of builds that are like the 'One Deck to Rule Them All' that can tackle most scenarios. The Dwarf trait is particularly powerful in the game right now, so I would suggest picking up Return to Mirkwood for Dain Ironfoot, who gives a global boost to all Dwarf characters in play. Also, the Hobbit expansions have some incredibly powerful and synergistic Dwarf cards in them. Another 'power' build is an Elrond/Vilya deck, where you use Elrond and his ring, along with player deck manipulation, to play the most powerful and expensive cards for free. Elrond is in the final pack of the Dwarrodelf cycle, Shadow and Flame. Another pack that I would recommend you pick up is Foundations of Stone, which has the Spirit version of Glorfindel, with the same stats as the Core Set version, only with a threat value of 5. In addition, there are some extremely powerful player cards in that AP."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/?do=findComment&comment=790263","commentId":790263,"userName":"lleimmoen","timestamp":1367285492,"content":"You can still try and build the One Deck to Rule them All. It is just that with so many different quests, you will hardly win them all, it is nigh impossible now, I believe, and it will get harder as we go on, no matter how good the player cards will be.\n\nHowever, I think you might find it fun to build several decks, each great at certain things. You don't have to be specific about certain quests but about certain strategy. Then, if you take one (or more, depending on preference) against a quest, you pick the one (or those) you feel most fit against the scenario.\n\nSometimes it does feel like cheating, and, with experience, you can probably dismantle any of the current quests if you pick the 50 cards that work best just against it. It may be also amusing to try but I for one am lazy to re-sleeve before every new quest I want to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/?do=findComment&comment=790401","commentId":790401,"userName":"richsabre","timestamp":1367318902,"content":"vermillian said:\n\nHi!\n\nI have all of FFGs LCGs. I really enjoyed this one, until I realized that everyone was making specific decks for specific scenarios… not just building 'one deck to rule them all' sort of thing… which sort of ruined the fun for me…\n\nHow do you guys play? Do you know what scenario you're fighting off against and build a deck to beat that, or build a deck and surprise yourself with a scenario?\n\nALSO\n\nI'm thinking about my next buy. I have the core set and the first two expansion packs… my decks really aren't that playable and I'd like to have 2-4 decks together so I cna get some friends and show them how to play together.\n\nSuggestions on a deluxe expansion that'd give me some things I'd need?\n\n \n\n\n\nto echo what others have said i also tend to build decks for many quests…certainly not all of them as this is, agains as pointed out, near impossible. i think it makes things interesting though, making players really think about thier decks in new light.\n\ni would also suggest in order but i see many players cant get the packs. the problem with later packs is that they will be very difficult with your current card pool. id probably suggest khazad dum\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/?do=findComment&comment=790416","commentId":790416,"userName":"GrandSpleen","timestamp":1367320429,"content":"And even if you can't win every scenario with one deck (or one pair of decks), you can win nearly all of them if you're a little flexible-- trade out 5 to 10 cards in your deck for a particular scenario, and you're good to go.  Even when picking cards for a specific scenario, you don't have to redesign your whole deck from the ground up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83132-how-do-you-build-your-deck-and-also-what-my-next-buy-should-be/?do=findComment&comment=790552","commentId":790552,"userName":"richsabre","timestamp":1367338515,"content":"grandspleen makes a good point, even though there is no one deck, you can easily change decks to deal with different quests.\n\neven given this, i have managed to win 3/3 core set, 5/6 mirkwood, 3/3 khazad dum, 5/6 dwarrowdelf all with the same or a very similar deck"}]}