{"url":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/","title":"Cards You Never Play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790282","commentId":790282,"userName":"lleimmoen","timestamp":1367290272,"content":"We pretty much know what cards are the all-around favourites. Now let us see, if you are willing to share, what are cards that you dislike (playing).\n\nI could think of many but I will start with a couple only.\n\nRadagast I think is quite terrible. You only get 2 willpower (other stats being even worse) for 5 resources. It takes five rounds for him to pay it back, that is if you can find better use of his resources than those you paid for him. I guess in a mono-Tactics deck he can find his place but if there is a character who now needs a better second version, it is Radagast for me. Or at least he needs some great creature cards to cooperate with (Ents, anyone?). But even then you will probably be able to pay for them without Radagast's aid.\n\nThe other is the Favour of the Lady. I really like the art, to the point I was keeping the card in a deck for a very long time (given its usefulness). But it is ever harder to justify its inclusion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790287","commentId":790287,"userName":"Nerdmeister","timestamp":1367291841,"content":"lleimmoen said:\n\nRadagast I think is quite terrible. You only get 2 willpower (other stats being even worse) for 5 resources. It takes five rounds for him to pay it back, that is if you can find better use of his resources than those you paid for him.\n\nSeems to me that according to that logic all allies are useless unless they pay their cost back in full. You do still get a quester out of it that you´d be willing to pay 2 resources for (I´m guessing) if only taking his willpower into account. With his decent amount of hp (which you may or may not agree with) I´d say Radagast would be worth 3 ressources without his ressource ability.\n\nAnyway you could try and combo him with A Very Good Tale if you´re running an ally heavy deck (which would probably be best considering his ability). If you do that, I think you´ll find that combo can work well both to get him cheaply into play, if you haven´t already got him, and if you use him to power the event you´ll find that his high cost suddenly works in your favor as you´ll get to put in stronger allies because of it. Just my 2 cent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790299","commentId":790299,"userName":"lleimmoen","timestamp":1367295252,"content":"Thanks for the 2 cents, much appreciated, no need to be offensive though, your opening sentence makes no sense other than to mock.\n\nI agree A Very Good Tale is decent combo for Radagast. It is much better for the likes of Citadel Custodian, as we might soon see in a Gondor deck, but I guess it works fine for Radagast. It is perhaps I get a bit annoyed when a famed character is rather weak - just compare the stats with Gandalf; if it was a made-up character I probably would not have mentioned it. But overall, my view stands (for now), I never really got anything good out of playing Radagast, the Eagle deck did well enough without him. Finally for here, since you asked, I think the cost is ok, I would like the stats or the ability be better; the character would hardly be overpowered if it came with 3 willpower and 2 defence; or, alternatively, if there was more to pay with the resources.\n\nBut what are some cards you do not like playing, since Radagast is probably not one of them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790318","commentId":790318,"userName":"Nerdmeister","timestamp":1367303265,"content":"lleimmoen said:\n\nThanks for the 2 cents, much appreciated, no need to be offensive though, your opening sentence makes no sense other than to mock.\n\n\n\nI sincerely apologize if it came off that way. It was not meant in any way to be offensive but I do see your point. Maybe it´s just part of the way I communicate though that is no excuse.\n\nAs to which cards I don´t like playing that is quite a tough question for me. I always try to see the potential in each card and experiment. It is not really a way I am accustomed to thinking.\n\nOne that does come to mind, which I haven´t been playing with, would perhaps be Out of Sight spirit event. It costs 5 (but has secrecy 3) and makes it so enemies cannot attack you in the phase it is played. I play mostly with a friend of mine and we usually have one play a quester and the other plays an enemy-cleaner with spirit and tactics practically never paired. So this card hasn´t had much opportunity to come into it´s own. I do imagine it to be quite useful in a solo secrecy deck or perhaps a tactics/spirit deck against a swarm encounter set.\n\nO Elbereth! Gilthonial! (spirit) is a card that rubs me a bit the wrong way. For a cost of 4 (secrecy 4) you can put an enemy which just attacked you on the bottom of the encounter deck but afterwards you have to raise your threat to the engagement cost of said enemy if it is lower. The card seems to be good for something like Mûmak or other high-profile enemies (who are not immune to player card effects). It does rub me a bit the wrong way to include cards for the benefit of one (or two at the most) specific enemy cards. If the game plays just right it can be very good but (without having tested it much yet) I suspect it will be not much use most of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790326","commentId":790326,"userName":"Rubinon","timestamp":1367305710,"content":"Nerdmeister said:\n\nO Elbereth! Gilthonial! (spirit) is a card that rubs me a bit the wrong way. For a cost of 4 (secrecy 4) you can put an enemy which just attacked you on the bottom of the encounter deck but afterwards you have to raise your threat to the engagement cost of said enemy if it is lower. The card seems to be good for something like Mûmak or other high-profile enemies (who are not immune to player card effects). It does rub me a bit the wrong way to include cards for the benefit of one (or two at the most) specific enemy cards. If the game plays just right it can be very good but (without having tested it much yet) I suspect it will be not much use most of the time.\n\n\n\n \n\nAnd it's spelled wrong! That's annoying me most. But maybe that leaves the possibility of an Oh Elbereth! Gilthoniel! with a better effect ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790332","commentId":790332,"userName":"lleimmoen","timestamp":1367307379,"content":"Thanks for more income and kind words, Nerdmeister. Good you mention the two. Yes, it is a shame to print Gilthoniel like it was. As for the card itself, I originally thought it strong but it is very situational. Beside the Mumak which is a great target, the trolls in Roast Mutton are very fit for it, too. But I have never got much out of the card, despite including it in a couple decks. As for Out of Sight, I have recently played it in my first ever mono-Spirit deck. It is decent when you are bordering secrecy at the start, and later you might be able to afford it even without the discount. Of course, if there is a Tactics deck around to help, this card has little use but in mono-solo it was very good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790334","commentId":790334,"userName":"DurinIII","timestamp":1367307781,"content":"That Istari search card from Lore Sphere. There are currently only two cards in the game that are Istari, Radagast and Gandalf, and to play the search card as of now, seems like a complete waste of space. There are many other cards I never play, but I don't have the time right now to list them!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790344","commentId":790344,"userName":"Nerdmeister","timestamp":1367309143,"content":"DurinIII said:\n\nThat Istari search card from Lore Sphere. There are currently only two cards in the game that are Istari, Radagast and Gandalf, and to play the search card as of now, seems like a complete waste of space. There are many other cards I never play, but I don't have the time right now to list them!\n\n\n\nNow here I must disagree. Word of Command is a very powerful card imo. First of all if you include 3 of these (along with your Gandalves; hmm plural Gandalf) it means that you can easily include alot of unique attachments and allies in just 1 copy and thus boost the potential of your deck significantly. I have used it like that myself in a few decks and found it to be very useful in this manner.\n\nAlso remember that you can use Word of Command at the end of the round, after Gandalf has readied but before he is discarded, to get maximum bang for your buck. Searching your entire deck for just 1 ressource is pretty **** awesome. Only downside, as you´ve said yourself, it that you have to have an istari to power it as well. With the new Gandalf from hobbit expansion, that downside is mitigated somewhat though"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790346","commentId":790346,"userName":"richsabre","timestamp":1367309352,"content":"great thread…i would say the guy from dale who costs 3 resources to move 1 progress around….mmmm……\n\nsecondly that tactics event that allows you to do something like discard a card and play it depending on how many characters are in play\n\nanyways, obviously a secrecy thing so will be better when/if that ever gets going properly, but for now, with 3 heros in play, its pretty bad\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790348","commentId":790348,"userName":"Khamul The Easterling","timestamp":1367309506,"content":"I dont see much point in Meneldor's Flight unless you have tons of tactics resorces to spare to use it on Thorondor.  \n\nI never use Dwarven Axe.  I think Dwarrowdelf axe is always better\n\nI'm not too fond of The End Comes which reads After a Dwarf character leaves play, shuffle the encounter discard pile back into the encounter deck. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790351","commentId":790351,"userName":"lleimmoen","timestamp":1367310723,"content":"There was a huge argument about Meneldor's Flight, some players thinking it could save Vassal or Guardian from discarding, but it cannot, so it really only properly comboes with Descendant, and thus it is a terrible card. Wonder if that every changes, yes. And the End Comes, wow, has anyone ever got a play out of that one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790354","commentId":790354,"userName":"richsabre","timestamp":1367311038,"content":"i can think of only 2 reasons for the end comes\n\n1. getting a clue card or similar back\n\n2. after using the likes of gilthoniel and similar, getting rid of the inevitable pile of deadly cards that you have put on the bottom of the deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790366","commentId":790366,"userName":"Nerdmeister","timestamp":1367312202,"content":"In regard to The End Comes. There is one specific treachery card that comes to mind from Road to Rivendell set called Orc Ambush and has the text: \"When Revealed: All Orc enemies in the staging area engage the first player. If there are no Orc enemies in the staging area, return all Orc enemies in the encounter discard pile to the staging area, if able.\"\n\nSeems The End Comes might have been almost custom made for this specific incident. And yes, that excact combo did actually save our party on one occasion but it still doesn´t quite justify the card :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790421","commentId":790421,"userName":"GrandSpleen","timestamp":1367321258,"content":"I gotta give Radagast my love as well!  I like being able to throw The Riddermark's Finest into a tactics deck to enable some location management.  I suspect his Creature-buying ability will only become more powerful in the future.\n\nPaired with Elrond, he can make your Misty Mountain Eagles a stalwart defender indeed.  And as mentioned above, he empowers you to use Word of Command.  But one of the other nice things about Radagast is that he does open up more options for resource management.  His high cost makes him a hard buy, but when you are making 4 decks for 4 players and using only a single card pool, your options grow thin.  Resoureceful, Wealth of Gondor, Steward of Gondor, Gloin, etc., all get tied up in other decks, and then here comes Radagast to save the day! \n\nAs for cards that I never use, I find myself WANTING to use things like Short Cut and A Watchful Peace, but haven't found a good opportunity yet.  A Watchful Peace has good potential in the Siege of Cair Andros, but I haven't attempted that quest since I won it the first time. \n\nThere is another card that is pretty limited in its usefulness -- I forget the name and am not at liberty to look it up right now.  Taking Initiative?  It reads something like \"discard the top card of your deck.  If the cost of that card is greater than the number of characters you control, deal 2 damage to one enemy and draw 2 cards.\"  This will pretty much work only in the early game for a secrecy deck, and even then it's a hard gamble.  After all, in a secrecy deck you are likely to include many low-cost cards!\n\nI never found much use for Keen-eyed Took either, but I'm happy to say that I made a deck with him and Expert Treasure Hunter just the other day.  Haven't tried it out yet…. hope it works!  Even if it does, though, that combo is only good for 1 card draw per Took."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790431","commentId":790431,"userName":"richsabre","timestamp":1367322876,"content":"GrandSpleen said:\n\nThere is another card that is pretty limited in its usefulness -- I forget the name and am not at liberty to look it up right now.  Taking Initiative?  It reads something like \"discard the top card of your deck.  If the cost of that card is greater than the number of characters you control, deal 2 damage to one enemy and draw 2 cards.\"  This will pretty much work only in the early game for a secrecy deck, and even then it's a hard gamble.  After all, in a secrecy deck you are likely to include many low-cost cards!\n\n \n\n\n\nthats the one i was trying to remember..\n\nalso i think alot of the cards i use get used for theme reasons so im fortunate i can use cards some players woudnt want to"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790467","commentId":790467,"userName":"lleimmoen","timestamp":1367327607,"content":"Oh yeah, I found Taking Initiative terrible even in a 2-hero secrecy, and with Imladris Stargazer in the deck, I don't think you can prepare much better than that, and still the card was quite useless. Anyone had any luck with that one?\n\nSame here for Short Cut, such a nice theme for a Hobbit deck but I can hardly see using it. Perhaps some locations will change my mind.\n\nI was using, on the other hand, Watchful Peace in an encounter control deck, and it wasn't essential but very useful at times. It helped me win Ithilien several times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790548","commentId":790548,"userName":"richsabre","timestamp":1367338270,"content":"there are alot of cards i dont think particularly useful but are beautiful so i play them anyways. love of tales is one of them\n\nhowever a card that is neither beautiful or useful in my eyes is bombur ally……"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790583","commentId":790583,"userName":"hildargo","timestamp":1367345280,"content":"Power In The Earth from the Core Set. What garbage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790588","commentId":790588,"userName":"richsabre","timestamp":1367346435,"content":"hildargo said:\n\nPower In The Earth from the Core Set. What garbage.\n\n\n\nwell if you have a 1 threat location with a high number of progress points its useful…but certainly not vital…pretty though\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790701","commentId":790701,"userName":"DevastazioneH88","timestamp":1367382169,"content":"A lot of them…and I have to mention Taking Initiative because I always thought it has a cool effect, so I tried to include it in a couple decks (mostly secrecy), I also tried a thematic Elladan/Elrohir deck built like that (it was awful). Well it was rather disappointing as you can imagine…I mean…I started to think it's badly phrased…maybe they meant it backwords…how can you have so few charcters in play when you start with three ?…and most importantly, even if you discard, say, gandalf, gildor, haldir ecc…I think you lost something…not gained…\n\n \n\nAnother card I never play is Silvan Tracker. It is an awsome card. good stats, great ability, fair cost….but for now I never had that many silvan in play to justify his being in my decks (anyway when the elves take the lead I'll surely use him a lot)\n\n \n\nOther cards I can think of : The Favour of the Lady, Power in the Earth, Beorning Beekeeper, Song of Earendil, The End Comes, Damrod (maybe he'll be usuful though), Veteran of Nanduhirion, Brok Ironfist…..Then there are cards I never played though I know they're useful in a certain type of deck or another, so I won't mention them since they're not \"useless\" in my opinion…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790706","commentId":790706,"userName":"Glaurung","timestamp":1367384035,"content":"DevastazioneH88 said:\n\nA lot of them…and I have to mention Taking Initiative because I always thought it has a cool effect, so I tried to include it in a couple decks (mostly secrecy), I also tried a thematic Elladan/Elrohir deck built like that (it was awful). Well it was rather disappointing as you can imagine…I mean…I started to think it's badly phrased…maybe they meant it backwords…how can you have so few charcters in play when you start with three ?…and most importantly, even if you discard, say, gandalf, gildor, haldir ecc…I think you lost something…not gained…\n\n \n\nAnother card I never play is Silvan Tracker. It is an awsome card. good stats, great ability, fair cost….but for now I never had that many silvan in play to justify his being in my decks (anyway when the elves take the lead I'll surely use him a lot)\n\n \n\nOther cards I can think of : The Favour of the Lady, Power in the Earth, Beorning Beekeeper, Song of Earendil, The End Comes, Damrod (maybe he'll be usuful though), Veteran of Nanduhirion, Brok Ironfist…..Then there are cards I never played though I know they're useful in a certain type of deck or another, so I won't mention them since they're not \"useless\" in my opinion…\n\n\n\nAll the cards you mention really unuseful cose they not develop the idea until the end like a secrecy for example.\n\nIS really unbalanced since we have a crazy powerful cards for dwarfes like We are not idle, Legacy of Durin or Dain and so on. The hobbit saga really destroy all balance of players cards……this is really bad in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790841","commentId":790841,"userName":"richsabre","timestamp":1367412629,"content":"DevastazioneH88 said:\n\nOther cards I can think of : The Favour of the Lady, Power in the Earth, Beorning Beekeeper, Song of Earendil, The End Comes, Damrod (maybe he'll be usuful though), Veteran of Nanduhirion, Brok Ironfist…..Then there are cards I never played though I know they're useful in a certain type of deck or another, so I won't mention them since they're not \"useless\" in my opinion…\n\n\n\ni disagree on a few of these;\n\n-brok- i keep him in an all dwarf deck for when a hero dies. i mean i never play him properly for the cost, he's just a useful back up for free\n\n-song of earendil-  i think this is a very useful card for a two handed deck, one with good threat management (aragorn, galadrims, counsel), the other with a high threat such as a tactics or leadership deck. im mean you can have galadrims target the other deck, but the other methods arent so flexible, so its useful for the other deck to not have to raise its threat during the refresh phase or during doomed X\n\n-damrod - im think a boromir type sacrifice when you are surrounded by orcs and face topping out at 50 due to a failed quest next turn. damrod can lower your threat substantially in this case.\n\n \n\nveteren is an ok card. i like the theme and love the art. i play him in decks but battle master is far better.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=790935","commentId":790935,"userName":"DevastazioneH88","timestamp":1367433023,"content":"Yeah you may be right but consider that everything you said about those cards have a very bad drawback :\n\nBrok replaces a hero (not generating a resource though)…I never let my heroes die because I base my strategy on them and if I let one of them die I may give up 7 or 8 times out of ten (10/10 if it's an early turn)…So with so many cards in the card pool would I really want to add him ?…well I wouldn't (and never have)..\n\nSong of Earendil is a good card, it has a card draw ability and in a multi game may be quite useful…still I prefere sneak attack+gandalf, g. greeting, and elrond 's counsel…especially because if you play dwarven tomb you can get both g. greeting and elrond's counsel back…this is why when my girlfriend and I build multi decks we always exclude s. of earendil…in the end I have to agree with you though…it's not so bad a card.\n\nDamrod is a 4 resources ally with average stats (Gildor is much better for 5, haldir is much better for 4, elfhelm is much much better for 4, northern tracker is better for 4, faramir is better for 4…even eomund is better for 3) and with a poor ability for that many resources (especially spirit resources…not leadership). So in the end it always comes to \"would I want to add him instead of one of these others because I might find miself in a pinch in turn 11 with 48 threat…?…nope…I better build my deck not to get there and if I do I'm quite sure damrod will not be able to save me anyway…\n\n \n\nVeteran of Nanduhirion is not a horrible card (at least when it came out it wasn't) but he costs 4 resources and has 3(minus1) HP, 0 wp and 2 defense (2 defense is good for a dwarf but if I have 4 tactics resources available I'll spend them for something else most of the time…I'm bound to have something better in my hand)..so let's face it, the only reason we'd play him is because of his attack of 3…my point is…the battle master costs 3 resources and has a much greater attack value if you have a few dwarves in play; veteran axhand costs only 2 (half the cost), so you can put 2 of them (4 attack) for the same price, plus the theme of dwarves is to get as many allies in play as possible, and most of the unique dwarves have 2 attack (+1 with dain)…so…when I have to put cards in to fill my slots do I put him in ?…no I don't……I like the art though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=791051","commentId":791051,"userName":"ana4","timestamp":1367460975,"content":"Cards like Silvan Tracker I am not worried about, it is time for them to come out strong, I actually think this one will be very strong. It is just a bit strange the card came out so early.\n\nSong of Earendil can be very powerful, especially in combo with Wandering Took; wonder how long that stays untouched by the hand of god, ehr… I mean the designers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=791286","commentId":791286,"userName":"Mr Coffee","timestamp":1367510443,"content":"For me Keeping Count is one of the most frustrating cards to come along.  Not necessarily the worst, just… frustrating.  I was so excited to have a card developed that played off the \"game\" that Gimli and Legolas played…  and that card just fell flat on its face for me.  Have never bothered to try and be creative with it…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=791304","commentId":791304,"userName":"richsabre","timestamp":1367513201,"content":"benhanses said:\n\nFor me Keeping Count is one of the most frustrating cards to come along.  Not necessarily the worst, just… frustrating.  I was so excited to have a card developed that played off the \"game\" that Gimli and Legolas played…  and that card just fell flat on its face for me.  Have never bothered to try and be creative with it…\n\n\n\ni tried it in an all tactics deck, which was pretty useless as when one got ahead of the other, the other hero caught up….nice and thematic but pretty useless. actually it worked well once when i had legolas doing all the killing and then had bard with black arrow and about +4 from the keeping count.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=791307","commentId":791307,"userName":"Rapier1","timestamp":1367513387,"content":"Veteran of Nanduin needs an ability based on a wounded dwarf or something like that.\n\n \n\nThen again, honestly Battle-master is op and that's the problem. If Battle master wasn't around Veteran would see more play.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=791329","commentId":791329,"userName":"Mr Coffee","timestamp":1367517781,"content":"richsabre said:\n\nbenhanses said:\n\n \n\nFor me Keeping Count is one of the most frustrating cards to come along.  Not necessarily the worst, just… frustrating.  I was so excited to have a card developed that played off the \"game\" that Gimli and Legolas played…  and that card just fell flat on its face for me.  Have never bothered to try and be creative with it…\n\n \n\n \n\ni tried it in an all tactics deck, which was pretty useless as when one got ahead of the other, the other hero caught up….nice and thematic but pretty useless. actually it worked well once when i had legolas doing all the killing and then had bard with black arrow and about +4 from the keeping count.\n\nrich\n\n\n\nEAXCTLY what I had in mind…\n\nHumorously,  I had started typing out about the only scenario that I thought it might be useful, and it was pretty much the same as you described above… lol.  Pretty much \"benching\" one of your heroes from attacking for multiple turns in order to get the other one built up a lot… kind of crippling your own deck's usefulness that way, in my mind. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=791506","commentId":791506,"userName":"klaymen_sk","timestamp":1367574455,"content":"benhanses said:\n\n \n\nFor me Keeping Count is one of the most frustrating cards to come along.  Not necessarily the worst, just… frustrating.  I was so excited to have a card developed that played off the \"game\" that Gimli and Legolas played…  and that card just fell flat on its face for me.  Have never bothered to try and be creative with it…\n\n \n\n \n\n \n\nThe only use I see for it is in a quest with Battle keyword. Slap it on your main attacker and one on some support hero. Attacker will pump up the other hero, who will be more useful in questing. It doesn't help Keeping Count to suck less, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=791527","commentId":791527,"userName":"DevastazioneH88","timestamp":1367579302,"content":"Keeping Count is another card I always thought has an inverted phrasing (like taking initiative)…it would be useful if it was the contrary…the hero that kills gains +1 attack if the other copy has one less resource…this is really a bad card (also because you need to have two of them in play :/)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=794508","commentId":794508,"userName":"Boris_the_Dwarf","timestamp":1368306671,"content":"Rapier said:\n\nVeteran of Nanduin needs an ability based on a wounded dwarf or something like that.\n\n \n\nThen again, honestly Battle-master is op and that's the problem. If Battle master wasn't around Veteran would see more play.\n\n \n\n \n\n\n\n \n\nI think this touches on the real problem of \"Living Card Games.\" Since you get everything when you buy a pack/deluxe box/core set. you get the best, the average, and the terrible - but the cards seem built around the collectible game design philosophy where most people just play with whatever random cards they get, or the singles they buy/trade for to supplement. What that means is that when there is a good card in a new pack or box set, the older card it obsoletes has to be cut. There's rarely room for both.\n\nDecisions about which cards to play also center around the spheres. If you are a solo player, you are running spirit or you are losing consistently. If you are playing with a partner, both of you are playing in tandem or you are losing consistently. Out of approximately 300 some cards that have been made, only about 50-75 of them are useable in 2 player settings, and I guarantee they revolve around spirit for questing, tactics for fighting, and lore for healing/card drawing. You can take out tactics if you are in it for solo play (again, for those looking for consistent win percentages).\n\nUltimately, the solution is to give the spheres more independent strengths rather than top-down design that forces players to build their decks the way the designers create them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83142-cards-you-never-play/?do=findComment&comment=794570","commentId":794570,"userName":"DevastazioneH88","timestamp":1368330753,"content":"Actually if you can build a good deck you can win solo even without spirit (maybe not 10/10 but 7 or 8 /10)…When I play solo I almost always use at least one tactics hero (sometimes two) and still I get to win 3/3 or something less in most scenarios. The eagle build is awsome if you add Leadership, and starting with a threat lower than 29 allows you to win consistently (maybe not in scenarios like RTM or JTR) without heavy modifications. I built tons of decks and I have come to the conclusion that spirit is essential in multiplayer but not so in solo, while without tactics you can almost always say farewell when the scenario instructs you to kill one or more enemies (most of the times large trolls), without spirit you can do fairly well in quest heavy scenarios (just add celebrian's stone, gandalf+sneak attack, faramir, dunedain quest and so on)…the only problem is when you have to cancel a nasty treachery, but in many scenarios the vast majority of treachery cards deals a damage to exhausted characters, raises your threat by one or two, reveals an additional card…not so bad (in solo play)…it's quite different if you get a sleeping sentry or something as nasty, but it happens that you can't cancel even when running a spirit hero due to a test of will being the only cancel in the game (with the difference that running one of them in solo means you have a lower amount of total HP to absorb damage)…I really think one can build almost any deck with his chosen combination of heroes and spheres if his strategy is good and he swaps a few aimed cards for every scenario. And about the 50/75 cards thing you mentioned I have to disagree completely. While in solo the pool might be smaller (yet I used at least more than twice the numbersyou've given), in multi we used almost all of them except for the very bad ones (wich were bad even in the very beginning)…"}]}