{"url":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/","title":"Who&#039;s the new Hero &quot;Contest&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791544","commentId":791544,"userName":"DevastazioneH88","timestamp":1367580505,"content":"So guys, the new AP is just one  week away (after almost one year without APs, the last came out in july 2012)…anybody wants to speculate on who's going to be the new hero ? I always thoght we'd see Faramir but I'd like to what you all think !\n\n \n\nThese are the most expected :\n\n \n\n- Faramir - we've been searching for him for three scenarios in HoN so it would be almost disappointing not to get him (also because his name is in almost every HoN quest card).\n\n \n\n- Denethor - Well it's a Gondor themed cycle and the first AP is called \"The STEWARD's Fear\"…so getting the Steward of Gondor would be only logical. Moreover, the last article was almost telling us : \"It'll be Denethor, it'll be Denethor, it'll be Denethor\"….\n\n \n\n- Sam - There is a high chance that hobbits will be for this cycle what elves have been for the previous one (and we got 4 out of 6 elven heroes from Khazad-Dum), so why not Samwise the Brave, one of the all time favourite among LOTR fans throughout the world ? The only problem with Sam is that we've already seen Pippin in AP3 and I can't imagine Merry not being around in either AP 2 or 4, so with Sam we'd get 3 hobbits in the first 4 APs and I think (even though I compared Khazad-Dum elves with this cycle hobbits) it'd be a bit too much (both because in tolkien lore there aren't as many hobbits as there are elves and because since it's also a Gondor themed cycle and we don't have many Gondor heroes to build decks around I'd expect at least 3 or 3 Gondor heroes).\n\n \n\n- Merry - We've seen Pippin, so it's only a matter of time before we get him, it'll be either AP 2, 4 or 5 (if not this one).\n\n \n\n- Other - ??? -\n\n \n\nWell…thess are the most \"Common\" option, what do you guys think ? If you'd like to vote I'll keep the count and we'll see who guessed right :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] My vote goes to Faramir.\n\n \n\nso : Faramir 1, everyone else 0 \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791551","commentId":791551,"userName":"richsabre","timestamp":1367581217,"content":"DENETHOR. without a doubt. id bet my already questionanble reputation on it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791555","commentId":791555,"userName":"Khamul The Easterling","timestamp":1367581662,"content":" \n\nI think Pippin should have been in this one but he isnt so…. I'm going to guess Faramir. \n\nI dont think its Denathor cause I'm thinking it would be wierd to be Denathor when you are being summened by Denathor.\n\nI dont think its Merry becasue Merry doesnt have anything to do with Minis Tirith really.  Pippin is more of the Minis Tirith guy.\n\nThe same as above with Sam but even more. \n\nAnd I do think that its likely to be an other. Not sure whitch though.  \n\n \n\nFinal thoughts: I just dont think any of these feal right for some reason.  I'm guessing Faramir cause he isnt a hero yet and fits the quest.  But I will not be suprised at all if its an other.\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791567","commentId":791567,"userName":"DevastazioneH88","timestamp":1367583549,"content":"So up to now :\n\n \n\nFaramir 2\n\nDenethor 1\n\nMerry 0\n\nSam 0\n\nOther 0"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791579","commentId":791579,"userName":"leptokurt","timestamp":1367584665,"content":"The Superior Spiderman."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791601","commentId":791601,"userName":"AjiTae","timestamp":1367587776,"content":"A Captain of the Outlands, like Duinhir or Hirluin.\n\nI think Faramir will come later on, and I don't believe Denethor will be edited again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791609","commentId":791609,"userName":"Sprenger","timestamp":1367588690,"content":"I think Faramir will be in the fourth Chapter pack. Pippin is confirmed in the third and the Rohan King is in the last one. \n\n \n\nI doubt we will get any dwarfs during this cycle. Elfs make the most sense. I'm sure we won't get a tactics hero in this pack. Best bet will be a spirit or a lore hero. So my guess will be Eomer. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791611","commentId":791611,"userName":"GrandSpleen","timestamp":1367588871,"content":"I'm gonna say Sam.  We have evidence for Hobbits, and like others have said, Denethor would be a strange choice given the narrative focus and the summons coming from Denethor himself.\n\nThat said, there is no reason to predict any sort of relationship between the hero and the pack they are released in.  Frodo came out with Conflict at the Carrock.  Hama came out with The Long Dark (I think), and Dain with Return to Mirkwood.  Only the big box sets have established a quest/hero relationship. \n\nSo, for a backup guess, I will go with Thranduil!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791614","commentId":791614,"userName":"Khamul The Easterling","timestamp":1367589536,"content":"Yeah good point GrandSpleen on questhero relations.  I dont really know what I was thinking.  But yeah I can't wait to see Rich get wrong on his Denethor guess when he's soooo sure :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791616","commentId":791616,"userName":"Rubinon","timestamp":1367589602,"content":"Since I brought her up in the other thread, I'll bring her up here: Ioreth as a Gondor lore heroine. Where, if not in Minas Tirith?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791617","commentId":791617,"userName":"richsabre","timestamp":1367589740,"content":"Khamul The Easterling said:\n\n \n\nYeah good point GrandSpleen on questhero relations.  I dont really know what I was thinking.  But yeah I can't wait to see Rich get wrong on his Denethor guess when he's soooo sure :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] \n\n \n\nKhamul\n\n \n\n \n\nsometime it takes a crazy person to come up with a crazy idea……that is where i come in…muhahahahahah cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791649","commentId":791649,"userName":"Ellareth","timestamp":1367596925,"content":"I want it to be Denethor so badly.\nAt the same time given how hereoes are summoned by Denethor, it would feel wrong to have Denethor as playable character in this pack.\nBut as someone pointed out, hero and questline didin't match up previously so if Denethor can't have the final AP of Cycle, I want him to have first AP of Cycle.\n\nCome on…. Leadership Denethor with built in threat reduction that works well with Palantir.\nPlease let it be Denethor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791654","commentId":791654,"userName":"richsabre","timestamp":1367597159,"content":"yeah….some support …..:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791659","commentId":791659,"userName":"Pharmboys2013","timestamp":1367598400,"content":"Gut still tells me Denethor so i'll go with him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791670","commentId":791670,"userName":"Gizlivadi","timestamp":1367600109,"content":"Not Denethor. At first I didn't want to make a statement about it cause I just didn't want to be so wrong, but now I don't care. It's not gonna be Denethor. I don't get how some people \"deduce\" from the article it's \"obvious\" it will be him, since it's called the Steward's Fear. If anything, what the article sorta confirms is that it's not gonna be him since he's the only one NOT participating in the quest, and if you then say that the story itself does not determine the heroes in each scenario, then it's even more clearly it won't be Denethor. I sorta wish it was, and maybe, just maybe it will be him, but I'm pretty sure it won't, at least from what we can deduce from the articles. That said, I think it's either gonna be Faramir, maybe a Hobbit, or just some character no one has named yet, like Halbarad or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791709","commentId":791709,"userName":"DevastazioneH88","timestamp":1367606155,"content":" \n\nUp to now :\n \n \nFaramir 3\n \nDenethor 3\n \nDuinhir/Hirluin 1\n \nEomer 1\n \nSam 1\n \nThranduil 1\n \nIoreth 1\n \nHalbarad 1\n \nMerry 0\n \n \n \nI would not really like to see an outlands captain to be sincere. And Ioreth seems a weak choice for a hero, maybe an ally, who knows ? as for the others…I'd love to get Thranduil but I really think we won't see any elf hero in this cycle (because I think elves are going to be in the next expansion). Halbarad wuold be great (when the preview for the 4th AP came out I thought the ranger hero would be him !). As for Eomer…one of the greatest…but if he comes out now…who will they put in when the Rohan expansion comes out ? Anyway all of these heroes would be great and are likely to come out soon (er or later)…in the end we might even get the Tactics Eowyn the vast majority of us wanted a few months ago XD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791719","commentId":791719,"userName":"richsabre","timestamp":1367607365,"content":"it could shock us all and be someone completely random like farmer maggot…..yeah lets go with that, maggot all the way!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791726","commentId":791726,"userName":"DevastazioneH88","timestamp":1367609410,"content":"Farmer Maggot's ability would be like…\"after one or more hobbit heroes commit to a quest the first player must make a sneak test, if he fails they get -1 WP and Farmer Maggot deals 1 damage each, if they're successful they get +1WP and Farmer Maggot heals one damage from each of them XD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791919","commentId":791919,"userName":"CJMatos","timestamp":1367671719,"content":" \n\nCJMatos said:\n\n \n\nMy thoughts are:\n\n \n\nFirst pack \"The Steward's Fear\" -  Eldacar (Spirit);\n\nSecond pack \"The Drúadan Forest\" - Merry (Lore); - wild guess…\n\nThird pack \"Encounter at Amon Dîn\" - Pippin (Spirit); previewed\n\nFourth pack \"Assault on Osgiliath\" -  Haldir (Lore) - wild guess but i would love to see one of Lorien as a hero;\n\nFifth pack \"The Blood of Gondor\" - Faramir (Leadership); -  it is a hunt in Ithilien, so who better than Faramir itself to help?;\n\nSixth pack \"The Morgul Vale\" - Théoden (Tactics) - previewed\n\n\n\n \n\nAs said in other topic, these are my thoughts\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=791924","commentId":791924,"userName":"Khamul The Easterling","timestamp":1367672320,"content":"!!!!!!! Haldir!!!!! Yes!! thar would be so awesome!! He's one of my favorite characters!!!  Wow that would be so awesome. Now I'm so excited….I really want to see him.  \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792001","commentId":792001,"userName":"Glaurung","timestamp":1367685376,"content":"Khamul The Easterling said:\n\n!!!!!!! Haldir!!!!! Yes!! thar would be so awesome!! He's one of my favorite characters!!!  Wow that would be so awesome. Now I'm so excited….I really want to see him.  \n\nKhamul\n\n\n\n]\n\nHaldir as a lore ally already long time in game. He include in Journey to Rhosgobel pack. One of the most best art in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792003","commentId":792003,"userName":"legolas18","timestamp":1367685712,"content":"Still, we could see Haldir as a hero.  Most likely not in this next pack, but there's nothing stopping them from making a Haldir hero.  It's just like Faramir, he's been an ally, but they're going to remake him into a hero.  If it were randomly Farmer Maggot, I would… I don't know what I'd do.  Probably jump up and down in anger and happiness at the same time… cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792005","commentId":792005,"userName":"CJMatos","timestamp":1367685807,"content":"Glaurung said:\n\nKhamul The Easterling said:\n\n \n\n!!!!!!! Haldir!!!!! Yes!! thar would be so awesome!! He's one of my favorite characters!!!  Wow that would be so awesome. Now I'm so excited….I really want to see him.  \n\nKhamul\n\n \n\n]\n\n \n\nHaldir as a lore ally already long time in game. He include in Journey to Rhosgobel pack. One of the most best art in the game.\n\n\n\n \n\nI meant Haldir as a lore Hero"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792080","commentId":792080,"userName":"kezle2","timestamp":1367707976,"content":"I would love to see either Faramir or Halbarad but Faramir seems the most likely (and the one I'm most interested in seeing especially since Halbarad seems like a bit of a long shot)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792136","commentId":792136,"userName":"lleimmoen","timestamp":1367720343,"content":"I hope it is Denethor, though it would be strange as I also feel the hero is either Lore or Spirit. They cannot do another Lore Denethor, can they? And Leadership seems much better for Denethor… well, though I still hope it is Denethor, I do not think it will be him. I do not think it will be Faramir either since I believe it was all but confirmed he is coming in Assault on Osgiliath, of course they could be making fool of us and the ranger could be someone like Halbarad but I don't see that is their style. But if neither Denethor nor Faramir, who then? I think a captain of the Outlands would make sense. I believe it will be one of those."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792506","commentId":792506,"userName":"DevastazioneH88","timestamp":1367814204,"content":" \n\n \nFaramir 4\n \nDenethor 3\n \nany Captain of the Outlands 2\n \nEomer 1\n \nSam 1\n \nThranduil 1\n \nIoreth 1\n \nHalbarad 1\n \nEldacar 1 \n \nMerry 0\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792613","commentId":792613,"userName":"Mr Coffee","timestamp":1367841379,"content":"So here's my (un)educated thoughts about the heroes for this cycle.  I don't think we'll see Denethor OR Faramir as heroes this cycle at all.  And possibly no other Gondorian heroes either.  My reasoning is as follows:\n\nShadows of Mirkwood basically mirrored Aragorn's pursuit of Gollum through the Mirkwood.  Did we see Aragorn or any elves as heroes?  Nope, we got a couple hobbits (Bilbo, Frodo), a Gondorian Prince and warrior (Imrahil and Boromir), an unaffiliated archer (Brand), and a Dwarf Lord.\n \nThe Dwarrodelf was kicked off by a glut of Dwarf themed goodies in the Khazad-dûm expansion.  Did we see a bunch more dwarves in the following cycle?  Nope… we got a gigantic human/elf love-fest…  two manly hunks (Aragorn and Hama) and a elvish family reunion (Elladan, Elrohir, Glorfindel, Elrond… I know Glorfindel isn't technically family, but hey, he'd been around the fam for a couple millenia…).\n \nSo there is really POOR precedence for everyon thinking we're getting ANY Gondorian heroes out of this next cycle.  The only SLIM chance of getting Denethor rests in the fact that Elrond was the \"quest-giver\" at the beginning of the Dwarrodelf cycle and showed up at the end as a hero.  But we already know we are getting Theoden at the end of this one (possibly as a preview of the next locale to be explored???  YES PLEASE!), so I may have already defeated that possibility…\n \nEverybody keeps talking about not seeing certain Rohan heroes or elven heroes until the cycles in their locales, but that also doesn't make sense to me since it doesn't jive with the pattern either.  And as for some of the \"big names\" from those races, I don't think there's any reason for us to expect they are saving them for the expansions for those areas either… we got Bifur and Dwalin in KD.  Hardly the dwarven names that spring to mind as premier names…\n \nSo what do we know already?\n\nThird pack \"Encounter at Amon Dîn\" - Pippin (Spirit); previewed\n\nSixth pack \"The Morgul Vale\" - Théoden (Tactics) - previewed\n\nWe already have 2 of the six heroes.  Neither of them Gondorian.  I think we may see some \"filling in\" of the races/groups that are a bit light.  Noteably Hobbits and NON-Noldorian Elves (at least I hope so).   And we know we ARE gettin gsome good hobbit cards to support (see article for Encounter at Amon Din).  I would really like to see Haldir and Thranduil soon.  Merry and Sam go without saying (I get the feeling that the prevailing thought is that we will definitely see Merry because we know we are getting Pippin, but I'd prefer to get Sam if I had my druthers)…  Those would be four of my top logical candidates (Thranduil, Haldir, Sam, Merry), assuming they don't go with lesser-know or created characters. \n\nBut I'm also going to mention what I think would be a cool darkhorse candidate… Celeborn.  I would have said Galadriel, but I think FFG is going to sit on her for a while… don't have any specific reasons other than she is Noldorian and Celeborn is not.  I think as the Lord of Lothlorien, he could provide some sort of boost to the Silvan elves (since many of them had been assimilated into that kingdom, I think it would be appropriate).\n\nThey have released 2 hobbits in a row before (Bilbo and Frodo, back to back), so I wouldn't assume they'd avoid that again, but three in a row?  Possibly not…  I do think they would be keen to release Pippin and Merry back to back as a nod to their comradeship, so….\n\nFirst pack \"The Steward's Fear\" - Sam\n\nSecond pack \"The Drúadan Forest\" - Haldir/Thranduil\n\nThird pack \"Encounter at Amon Dîn\" - Pippin (Spirit); previewed\n\nFourth pack \"Assault on Osgiliath\" - Merry\n\nFifth pack \"The Blood of Gondor\" - Haldir/Thranduil/Celeborn\n\nSixth pack \"The Morgul Vale\" - Théoden (Tactics) - previewed\n\n \n\nLike I said.  Completely uneducated guesses… but I do like to think I put a little thought into it  cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]\n\nNow, FFG, throw us some complete surprises!!  Love this game!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792623","commentId":792623,"userName":"Pharmboys2013","timestamp":1367842663,"content":"Benhanses:  the one point I differ with you on in regards as to why we won't see any more Gondor heroes is your comparison with the dwarves and the Darrowdelf cycle.  At the start of Darrowdelf there were already 6 unique dwarves while there are currently only 5 unique Gondor heroes.  It also stands likely that FFG was aware that they were planning on he hobbit boxes and wanted to save more dwarves for those saga expansions.  If FFG really wants to flesh out the Gondor trait, I feel they need to include at least 1 or 2 more heroes just to have more options for deck building.  Still hope ur right on Haldir although…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792694","commentId":792694,"userName":"legolas18","timestamp":1367857500,"content":"Benhanses, you raise great points.  I would LOVE to see any of the Haldir/Celeborn/Thranduil possibilities.  Personally, I think that it would be cool if Celeborn had some boost to all elves, not just Silvan, and act as a kind of Elf Dain. But maybe that would be too powerful… Although I definitely agree that I think we'll see at least one more hobbit besides Pippin in the cycle, if not two."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792730","commentId":792730,"userName":"Mr Coffee","timestamp":1367865279,"content":"legolas18 said:\n\nBenhanses, you raise great points.  I would LOVE to see any of the Haldir/Celeborn/Thranduil possibilities.  Personally, I think that it would be cool if Celeborn had some boost to all elves, not just Silvan, and act as a kind of Elf Dain. But maybe that would be too powerful… Although I definitely agree that I think we'll see at least one more hobbit besides Pippin in the cycle, if not two.\n\n\n\nWell, I think it goes without saying that\n\n1) we all agree that Dain is a dwarven beast, and\n\n2) that he is probably a bit too strong (unless you're Glaurung, in which case of course Dain is the single most broken hero in the game complice [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/guinyo.gif]), and that\n\n3) we will more than likely see some sort of \"booster\" hero for each of the main races or keywords/traits. \n\n \n\nIt's easy enough to do a overall racial boost like Dain.  I'd much rather prefer it be based around another keyword/element, such as a kingdom (Gondor/Rohan) or trait (Ranger/Dunedain… I'd really LOVE to see some cohesion for these!).  That keeps it a bit more specific and not so over-powerful.  I think Celeborn (or Galadriel) would be a natural choice for a boost if it was supposed to involve BOTH Noldor and Silvan… but I think it would be AMAZING if they could eventually develop very separate identities for these two branches in the game, as they were very different sort of folk in Middle-Earth (that's a generalization I kno.. there were cross-over exceptions)…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792748","commentId":792748,"userName":"DevastazioneH88","timestamp":1367868572,"content":"The Elves are my favourite race…so I would love to see them developed a bit further (even because in order to play a decent solo elven deck one must necessarily use Elrond, Legolas and Glorfindel (spirit) ). Therefore I'd really love to see Haldir as a Hero…or Galadriel, or even Celeborn (not to mention Gil-Galad XD…I know they won't unless we get a Silmarillion Saga Expansion)…that said I really think this time we'll se at least a couple Gondor/Dunedain/Outlands Heroes…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=792818","commentId":792818,"userName":"lleimmoen","timestamp":1367887775,"content":"On the topic of Elves, I think they could take two different approaches to Noldor and Silvan, making Noldor strong more by individuals and Silvan as a team (I know it sounds terrible but it is early in the morning here). I believe there might not be many global cards for Noldor but great specific ones like there are already: Elrond's Counsel, Arwen, Glorfindel, I hope there shall be many more; of course they need support too like weapons and allies. But I feel it will be Silvan who get more of being united as Silvan Tracker suggests - though it is not very strong at the moment, obviously. Either way I am very much looking forward to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=793019","commentId":793019,"userName":"Mr Coffee","timestamp":1367934948,"content":"lleimmoen said:\n\nOn the topic of Elves, I think they could take two different approaches to Noldor and Silvan, making Noldor strong more by individuals and Silvan as a team (I know it sounds terrible but it is early in the morning here). I believe there might not be many global cards for Noldor but great specific ones like there are already: Elrond's Counsel, Arwen, Glorfindel, I hope there shall be many more; of course they need support too like weapons and allies. But I feel it will be Silvan who get more of being united as Silvan Tracker suggests - though it is not very strong at the moment, obviously. Either way I am very much looking forward to it.\n\n\n\n \n\nPerhaps this is me being too specific in my \"wish list\" for this game, but I agree with the basic idea you have, but a littel different twist…  It would be difficult to say the Noldor were more stand-offish than the Silvan so should be more solitary figures while the Silvan are more team related… I always kind of think of them in the generic fantasy terms of \"high elves\" (Noldor) and \"low or wood elves\" (Sindarin, Silvan)… I think the Silvan have already had a few built-in mini-boosts for them, but I think it would be great to have the Noldor be the \"bigger, stronger\" characters (similar to your thoughts), and then have the Silvan elves start fitting into the Secrecy theme…  It would kill two birds with one stone!  Some people have been wanting more Silvan love, and we have ALL been wondering when they are going to make Secrecy more viable…  The characters that have been Silvan so far already lend themselves to this well… Mirkwood runner is a good attacker for Secrecy decks, etc….  I think it would be great if FFG could enhance both of these areas all at once!  That'll be my new motto/slogan:\n\n \n\n\"SILVAN FOR SECRECY!!!\"\n\n \n\n… (cue thunderous applause) …\n\ncangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=793128","commentId":793128,"userName":"AjiTae","timestamp":1367954314,"content":"http://boardgamegeek.com/thread/973501/card-info [http://boardgamegeek.com/thread/973501/card-info]\n\nWhat do I win ? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=793218","commentId":793218,"userName":"lleimmoen","timestamp":1367972705,"content":"Yeah, seriously. I am on a winning side for a change.\n\nps: As for the Elves, yeah, secrecy needs further developing if it is not to be just forgotten, which would certainly be a shame having a dozen or so cards with little to do with them. And yes, Hobbits and Elves seem a natural application for secrecy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83317-whos-the-new-hero-contest/?do=findComment&comment=793323","commentId":793323,"userName":"DevastazioneH88","timestamp":1368003836,"content":"To AjiTae…You're the man ! XD This was an amazing guess ! I have to say, Bravo !"}]}