{"url":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/","title":"Errata&#039;s legitimate?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/?do=findComment&comment=791464","commentId":791464,"userName":"Nizi","timestamp":1367565649,"content":"It's a little troubling how many errata's this game has for being relatively new. A lot of them don't even seem that broken to me. I haven't played that much, but it still seems a bit unnecessary, unless one's really looking to break every card whenever possible. Broken cards aren't fun, but it's the player that ultimately breaks it.\n\nCards like that resource miner that could sometimes provide 3 resources don't seem that broken unless you manipulate your deck to pull a 5c or something. With the errata it just seems weak, with a decent chance to get, what, 1 resource out of it at the cost of a tap? There seem to be better cards, unless you do actually manage to make it so that it consistently taps for 2, but even then you have to build around it and it doesn't seem to be worth it imo.\n\n'Nori' was indeed powerful sometimes in the sense that one could lose 7-8 threat over the course of a game. This is good but it's far from broken. Again, now it just seems less good than the alternatives and if I want to play right I'd probably have to remake the deck as this ruling will lead to more losses.\n\nSome errata's are definately justified, like the Nazgul, who is meant to play like a \"boss\" character. It would be stupid if he was indeed 'snared' or 'pacified' by one sole card.\n\nI'm not complaining or anything - besides, the player eventually has control over the rules he chooses to apply: this is no competitive game in its essence - but I'm just wondering why. Are there decklists that demonstrate the power of said cards? But again, it's up to the player to restrain himself a little.\n\nFinally, I chose not to apply the new rules that score points according to the number of turns. First because I simply don't play with points, and second because it just doesn't matter that much unless one is set on grinding out points in an efford to maximise the number."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/?do=findComment&comment=791471","commentId":791471,"userName":"richsabre","timestamp":1367567223,"content":"i agree……many of these cards are only errated just becuase a few players couldnt resist breaking the game just becuase they could. i mean if you seek to make a deck which completely exploits a card then why play the game at all? surely theres no fun in it in a non-competative game.\n\n…..now however i have several errated cards which are worse than uselss. the miner is a good example. not just that, but cards which were understandably errated get shafted too much….thrors map was a favourite in my deck and undboubtably powerful, now it s just a waste of a space in a deck. and has completely ruined the fun\n\ni suppose people willl say just dont play with the erratas, but im a player that likes to play to the official rules.\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/?do=findComment&comment=791742","commentId":791742,"userName":"gatharion","timestamp":1367615728,"content":"I try to keep some of the errata in mind, but since I don't ever utilize the extra cheesy combos, I don't worry too much about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/?do=findComment&comment=791818","commentId":791818,"userName":"HeavyKaragh","timestamp":1367648192,"content":"Erratas that could be avoided with some more play test (Master of Lore, Troll Key and Purse) are the most annoying ones.\n\nI think Zigil Miner is too good resource genereator for a sphere not supposed to be good at that. I stil use it a lot, because that single resource point can make the difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/?do=findComment&comment=791836","commentId":791836,"userName":"gatharion","timestamp":1367655696,"content":"I don't enjoy the meta-game element of having some insight into what cards I would discard for the Zigil miner and as such, I never even used him much before the errata."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/?do=findComment&comment=801700","commentId":801700,"userName":"bthermans","timestamp":1370365366,"content":"Marginal0 said:\n\nCards like that resource miner that could sometimes provide 3 resources don't seem that broken unless you manipulate your deck to pull a 5c or something. With the errata it just seems weak, with a decent chance to get, what, 1 resource out of it at the cost of a tap? There seem to be better cards, unless you do actually manage to make it so that it consistently taps for 2, but even then you have to build around it and it doesn't seem to be worth it imo.\n\n\n\nIt is very easy to build a deck with almost only 3 resource cards. This means that every miner gives three extra resources to a hero of your choice. This is way better than Steward of Gondor - which is unique and will only give resources to a single hero, so you cannot change the resource color based on the cards you have drawn, especially since the errata that you cannot replay unique cards to switch it to a different character. And even so is the Steward still strong enough to use as a corner stone for a deck. Add to this that the miner is a dwarf as well, which can be subject to a host of bonuses and the errata is definitely necessary\n\n \n\nMarginal0 said:\n\n'Nori' was indeed powerful sometimes in the sense that one could lose 7-8 threat over the course of a game. This is good but it's far from broken. Again, now it just seems less good than the alternatives and if I want to play right I'd probably have to remake the deck as this ruling will lead to more losses.\n\nSome errata's are definitely justified, like the Nazgul, who is meant to play like a \"boss\" character. It would be stupid if he was indeed 'snared' or 'pacified' by one sole card.\n\n\n\nI build a deck around this character - Try a reduction of 15 to 20 threat each game: Kili & Fili, A very Good Tale, Stand and Fight, To me! Oh my Kinsfolk, Timely aid) and about 30 dwarves. Without the errata Nori gave an average of 2 threat reduction per turn, which is now reduced to about 1, which is still insanely good.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83311-erratas-legitimate/?do=findComment&comment=801739","commentId":801739,"userName":"GrandSpleen","timestamp":1370378711,"content":"bthermans said:\n\nMarginal0 said:\n\nI build a deck around this character - Try a reduction of 15 to 20 threat each game: Kili & Fili, A very Good Tale, Stand and Fight, To me! Oh my Kinsfolk, Timely aid) and about 30 dwarves. Without the errata Nori gave an average of 2 threat reduction per turn, which is now reduced to about 1, which is still insanely good.\n\n \n\n\n\nI agree the Zigil Miner needed his errata.  Nori on the other hand is by no means a gamebreaker, and is pretty comparable to the Lore Aragorn in terms of the amount of threat he can reduce if you compare games of equal length.  Add to that Aragorn's flexibility (he can help you recover from early bad luck with Doomed or unsuccessful questing, or he can modiy your final score) and Nori's inflexibility (must be in a Dwarf deck), and I don't think there was any good reason to errata Nori."}]}