{"url":"https://community.fantasyflightgames.com/topic/83509-immune-to-player-card-effects/","title":"&quot;Immune to player card effects&quot; ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83509-immune-to-player-card-effects/?do=findComment&comment=792872","commentId":792872,"userName":"PESKPESK","timestamp":1367905215,"content":"I desperately need clarification on which cards can be used against an enemy who is \"Immune to player card effects\" (like The Nameless Fear, Blog, Smaug etc.) and how do you figure that out?\n\n \n\nAfter a tip from Brandon T I found this link on\n\n \n\nhttp://boardgamegeek.com/thread/970104/immune-to-player-card-effects-official-answer [http://boardgamegeek.com/thread/970104/immune-to-player-card-effects-official-answer]\n\n \n\nBut as I see it we need FFG to clarify which cards work against enemies with \"Immune to player card effects, I'm not even 90% sure on how to figure out which cards work and which don’t. If FFG made list of cards that Immune to player cards are actually immune to, it would be super great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83509-immune-to-player-card-effects/?do=findComment&comment=792874","commentId":792874,"userName":"richsabre","timestamp":1367905871,"content":"i would also like this. i think it comes down to how you read 'targets the card'\n\ni would also like one for the general immune rules….for instance a player asked whether errand rider can move resource from beorn…im thought no, but then im not so sure so im awaiting a clarification from caleb\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83509-immune-to-player-card-effects/?do=findComment&comment=792996","commentId":792996,"userName":"richsabre","timestamp":1367932117,"content":"i actually got a ruling from caleb about the above….rather surprising:\n\nHi Richard,\nA hero's resource pool belongs to but is separate from the hero. Beorn's immunity to player card effects does not extend to his resource pool. So it is possible to use the Errand-rider to move resources to or from Beorn's resource pool.\nCheers,\nCaleb\n\nim actually rather surprised at that ruling…but thanks to caleb for replying"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83509-immune-to-player-card-effects/?do=findComment&comment=793032","commentId":793032,"userName":"PESKPESK","timestamp":1367937275,"content":"There has been a update from Caleb on BGG  \"There was some miscommunication between me and my coworkers when we discussed your question last time. I'm pretty sure the fault is mine, so I wanted to write back to correct my original answer:\n\nThe effects of both Hands Upon the Bow and Quick Strike target a character, so an enemy's immunity would not prevent those cards from working. (The bit about \"against any eligible enemy target\" on Quick Strike is not targeting the enemy but reminding the players that a non-ranged character cannot attack an enemy engaged with another player.)\n\nI apologize for the confusion. We do take player questions and rules issues seriously as it is our goal to provide you with the most enjoyable (and least frustrating) gaming experience possible. Please don't hesitate to write back with any other rules questions you might have. I will endeavor to answer them correctly the first time!\" I hope this means FFG now will understand the need for a FAQ post on the subject."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83509-immune-to-player-card-effects/?do=findComment&comment=793162","commentId":793162,"userName":"gatharion","timestamp":1367962344,"content":"Yes, I got a similar message from Caleb. \n\nHands Upon the Bow CAN be used because it just specifies a condition in which a character can make an attack and cards like Smaug and Bolg are not immune to being attacked.\n\nThe seemingly similar Great Yew Bow, however, could NOT be used against Smaug or Bolg though because it specifies \"choose an enemy\" on the card and a card that is immune to player card effects can not be eligible to be chosen in such a manner. Dunhere likewise cannot be used, for the same reason."}]}