{"url":"https://community.fantasyflightgames.com/topic/83742-forest-spider-question/","title":"Forest Spider question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83742-forest-spider-question/?do=findComment&comment=794517","commentId":794517,"userName":"Khamul The Easterling","timestamp":1368308500,"content":"So I was playing a solo game of passage through mirkwood and I got a caught in a web. So I attached it to Brand.  Then I was defending and I got Forest spider as a shadow card.  it says \"The Defedning Player must choose and discard 1 attachemnt he controls.  Rich said in a previous question that An \"attachment you control\" means an attachment in play, not in your hand.  So I did not have any attachments except fot the \"carght in a web\" which reads \n\nWhen Revealed: The player [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/caught-in-a-web-core#] with the highest threat level attaches this card to one of his heroes. (Counts as a Condition attachment with the text: \"Attached hero does not ready during the refresh phase unless you pay 2 resources from that hero's pool.\")\n\nSo it says It counts as an attachment (condition is the kind of attachment).  So can I discard caught in a web to resolve the shadow effect?\n\n \n\nThanks,\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83742-forest-spider-question/?do=findComment&comment=794563","commentId":794563,"userName":"Dam the Man","timestamp":1368325255,"content":"No:\n\n\"(1.06) Control of Non-objective Encounter Cards\n\nPlayers do not gain control of encounter cards unless\ncontrol of the card is explicitly granted by a card\neffect. When an encounter card (such as Caught in a\nWeb, CORE 86) becomes an attachment and attaches\nto a character, that character’s controller does not gain\ncontrol of the attachment.\" (FAQ, p.4)\n \nAnd FS Shadow only allows you to discard an attachment you control. In this case it would do nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83742-forest-spider-question/?do=findComment&comment=794572","commentId":794572,"userName":"richsabre","timestamp":1368330911,"content":"ah i think this is my fault for not being clear when i answered your question about 'in play attatchments'\n\nif i remember rightly, you asked whether an attatchment you control is in hand or play? what i meant to say is you never control one that is  in your hand, but you also dont control one that is an encounter  card\n\nrich"}]}