{"url":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/","title":"Solo Mono Challenge 2: Grasping Experience","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=794657","commentId":794657,"userName":"leptokurt","timestamp":1368352786,"content":"Hi folks and welcome to the second edition of my Solo Mono Challenge. This time players shouldn't be shy of water, as they're confronted with some of the meanest enemies in this game so far:\n\nTENTACLES!\n\nYes, this time we're gonna meet the Watcher in the Water. The scenario will be played as usual. There's one slight rule change to make the game a bit easier (and hopefully more interesting):\n\n \n\nEverytime a player defeats a tentacle enemy during the combat phase, they can choose one of the following:\n\n1) A hero gets an extra resource.\n\n2) The player adds one progress token on any location.\n\n3) The player reduces their threat level by 1.\n\n4) During stage 1 only: the player may peek at the top card of the encounter deck.\n\n \n\n \n\nScoring system and tournament rules:\n\nThe players have three attempts for each of the four spheres. After each approach the players have to replace one of their heroes. A hero that was replaced can not be used again. A hero that was a replacement can not be replaced. Example:\n\nRich builds a tactics deck with Boromir, Beregond and Gimli. After the first attempt, he replaces Gimli with Elladan, as he likes the art of that card very much. In his third attempt he is not allowed to bring Gimli back into play, and he can not replace Elladan. He thus chooses to replace Boromir with Thalin.\n\nEach victory scores 1 point. The player with the most points wins the challenge. In case of a tie the player with the highest starting threat of all his hero combos wins.\n\nEach deck may only contain cards from the chosen sphere plus any neutral cards.\n\n \n\nThe deadline is May 31th, 8 pm CET.\n\n \n\nHave fun!\n\n \n\n \n\nClarification:\n\nOnce a player has started his first game, he is not able to start the challenge anew. This means the players have only one attempt to approach this tournament.\n\n \n\n \n\n \n\n \n\nFINAL RESULTS\n\n \n\n1. leptokurt ~ 11 points\n\n2. Benhanses ~ 9 points\n\n3. Pharmboys2013 ~ 8 points\n\n4. Glowwyrm ~ 7 points\n\n5. Khamul the Easterling ~ 2 points\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=794842","commentId":794842,"userName":"Pharmboys2013","timestamp":1368399137,"content":"oh man, some new rule changes…  \n\nwhile i plan on attempting this it likely wont be until after i get my hands on the steward's fear and get to play with that a bit….plus Mithrandir's Advice will be quintissential for mono lore"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=795082","commentId":795082,"userName":"Pharmboys2013","timestamp":1368463371,"content":"First Sphere: Tactics\n\nRound 1: Thalin, Legolas, Beregond  - LOST\n\n     got land locked from the beginning and just coudlnt get anywhere questing with via Thalin, was hoping to make some progress via Legolas and blade of gondolin but Mountain Wargs got sent back to the staging area precicsely 4 times\n\nRound 2: Gimili, Legolas, Beregond - WON\n\n     Won this out of some good draw and even better luck.  Had Bofur and Eagles of the Misty Mountains in my opening hand and had them both out by turn 3 which helped with questing.  Quested with Gimili and also allowed him to take the undefended attacks from the tentacles.  I actually passed through this stage via the Doors of Durin.  I discarded an extra bofur and support of the eagles from my hand.  The top card of the encounter deck was Stagnant Creek.\n\nRound 3: Gimili, Legolas, Bard- WON\n\n    In this game i made Bard my primary quester and once again got Bofur and Eagles of the MIsty Mountains into play quickly to clear away locations.  On the last stage i was able to engage the Watcher right away and was able to take him out with a beefed Gimili (from taking prior damage blocking), legolas with black arrow, and a few vassal of the windlords\n\nTotal Points:  2\n\nReflection:\n\nTactics did a lot better than i figured it might.  I thought the lack of willpower would be crippling but considering theres 2 quest stages and very few cards in the encounter deck have a threat level higher than 2 i didnt have too much difficulty questing sans round 1.   Also, i feel like each time i killed a tentacle i almost exclusively picked the extra resource to allow me to play someone expensive like more Eagles of the misty mountains or Radagast\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=795234","commentId":795234,"userName":"Pharmboys2013","timestamp":1368496037,"content":"2nd Sphere: Leadership\n\nRound 1: Theodred, Aragorn, Prince Imrahil- WON\n\n     The combo of theodred and aragorn just never gets old for me.  quested to the second stage quite easily and took down the watcher with some repeated use of gandalf via sneak attack\n\nRound 2: Theodred, Aragorn, Boromir - WON\n\n     Easily my favorite combination of mono leadership characters.  I literally beat the quest with this combo in just a couple minutes.  At the second round i passed the doors of durin by using shadow of the past (which should be like illegal for his challenge haha) and placing striking tentacle on top then discarding sneak attack from my hand\n\nRound 3: Theodred, Balin, Boromir - WON\n\n    I really missed aragorn's attack stat on this one, but it was still nice to buff Balin with Theodred to make sure he could use his ability if necessary.  Killed the watcher thanks to a nicely timed Gandlaf, a boosted Boromir from dunedain signal, and some augmented citadel guards from boromir's ability\n\nTotal points: 5"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=795409","commentId":795409,"userName":"leptokurt","timestamp":1368535471,"content":"You're looking fine again, Pharmboys! Yes, tactics does well in this scenario. I played it even without all the benefits granted for defeating a tentacle with only one coreset and won most of the games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=795848","commentId":795848,"userName":"Pharmboys2013","timestamp":1368661691,"content":"3rd Sphere: Lore\n\nRound 1: Aragorn, Berevor, Denethor - LOSS\n\nJust a complete failure of a game in this one.  The setup encounter card was an tentacle enemy, i staged the first turn into another tentacle enemy, they both had their negative effects hit so i had 4 damage on aragorn and 3 damage on berevor (from 1 having to be undefended and the other having my own atk go against one of my characters).  on turn 2 i staged into another tentacle enemy.  once again all three had shadow or tentacle cards revealed for their effects so i called it a loss (with 2 of my heroes dead) and moved on\n\nRound 2: Aragorn, Glorfindel, Denethor - WON\n\nHad a good setup this game getting Hennamarth riversong in my opening hand.  revealed a tentacle on top so i laid down a ranger spikes with my other 2 opening resources.  easily cleared stage 1.  on stage 2 i used denethor to scry to top card (was warg lair) discarded warden of healing for the victory.  Didnt have to engage or fight a single enemy thanks to some encounter deck manipulation\n\nRound 3: Glorfindel, Denethor, Elrond -WON\n\nI knew going in i had a really high threat, but in this quest it doesnt matter cause all those tentacle enemies have such low engagement costs theres just no avoiding them.  i was a little scared when undisturbed waters came out the first turn and shot my threat up to 39, but after clearing stage 1, i only had 1 tentacle enemy engage me who was thankfully dispatched in one turn.  i won via scyring the top with denethor revelaing striking tentacle then discarding secret paths from my hand\n\nTotal Points: 7\n\nReflection:\n\nI knew going in that this deck would have a decent chance if only becasue of Denethor who's ability makes him the MVP for beating this scenario.  I never really cared about a high starting threat as it was never an issue.  Looking back, despite the one loss, i feel like lore is better suited to beat this quest than tactics or leadership even are just because of how they can trap the tentacle enemies and manipulate the encounter deck to easily pass the doors of durin.  Also, an awesome card i enjoyed using is the new event, Mithrandil's Advice.  Not only does it have really great art, but drawing 3 cards for 1 resource just felt awesome\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=795964","commentId":795964,"userName":"Pharmboys2013","timestamp":1368701474,"content":"4th Sphere: Spirit\n\nRound 1: Glorfindel, Frodo, Eowyn - WON\n\nI struggeled mightely but still pulled out the victory with this team of heroes.  After cruising to the 2nd stage i was trapped there for several turns having to endure repeated attacks from wargs, tentacles, and the passive damage from the watcher.  Thankfully as I was close to death (a threat of 46 from constantly blocking with frodo) Imaldris stargazer pulled a shadow of the past and i was able to throw wrapped! on top of the deck and discard westfield horsebreaker from my hand for the victory.  Considering how difficult this match was with the ideal hero lineup i should have figured the next two rounds would end badly…\n\nRound 2: Glorfindel, Frodo, Dunhere - LOST\n\nThings started in this matchup very badly.  During the set up, disturbed waters was revelaed increasing my threat by 5, i had to reveal another card since there was no threat in the staging area as the set up requires and a tentacle came out.  I staged into stagnant waters which revelaed an additional tentacle enemy and increased my threat by 5 again.  Plus the extra tentacle made me quest negatively so in just 1 turn my threat increased by 12.  Both tentacles had their negative effects trigger.  The following turn antoher tentacle came out during staging and i just called it a game\n\nRound 3: Glorfindel, Eleanor, Dunhere - LOST\n\nAnother quick defeat, had a few tentacles revelaed within the first two turns and that was basically it with only 1 chump blocker avaliable and Eleanor's paltry defense.  Just a mess\n\nTotal Points: 8\n\nReflection:\n\nFor this quest in particular, Spirit seems the least developed to handle its challenges.  It lacks the firepower or tactics and leadership and the encounter manipulation of lore which is so crucial to complete the second stage.  I had a lot of fun in this challenge however going back and tackling a quest I had barely touched previously (I started playing this game last summer and bought everything avaliable around the time Foundations of Stone was released so there are some quests i have previously avoided playing a lot like this one)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796320","commentId":796320,"userName":"Khamul The Easterling","timestamp":1368792513,"content":"Hey, although i'm not going to do well on this at all, I'll give it a try since only 1 player is playing so far so Pharmboy's will have somebody to beat. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nI only have FoS, RtR, TWitW, TCatC, AJtR, THoEM and KD but still that does have some pretty good cards so yeah anyways ill give it a try.  It might be a little while but ill do the contest.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796620","commentId":796620,"userName":"Khamul The Easterling","timestamp":1368875314,"content":"1st Sphere: Spirit\n\nRound 1: Glorfindel, Frodo, Dwalin - WON\n\nThe combination of these heroes turned out to do good.  I got and UC and 2 Arwens to boost Frodo's defense and defend multiple attacks.  I killed the Watcher in this game.  \n\nRound 2: Frodo, Eowyn, Dwalin - WON\n\nI shuffled the deck really good but I still got an UC again in hand.  I also got another Arwen so Frodo was a great defender.  I engaged the watcher and then with a stargazer I got cards with the letter  T, and S whitch are fairly common in this E.D.  Then I just threw down my entire hand hopeing for the best and I got a striking tentacle or something.  \n\nRound 3: Eowyn, Dunhere, Dwalin - WON\n\nYet AGAIN I got an UC so was able to deal with \"Wrapped!\" better.  I got a T and S again and went for the Doors of Durin and got lucky again.  I feel so bad always just doing the Doors of Durin and getting lucky and winning on this contest.  But I think Spirit and Mabye a bit of Lore will be the only ones that I will do that on.  \n\nTotal Points: 3\n\nDwalin was actually good and I kept him in all 3 rounds.  His good attack and def were helpfull in defeating enemies.  I had some fairly lucky draws in rounds 2 and 3.  Round 1 I just BARELY won.  So yeah I'm suprised how well I did.  \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796646","commentId":796646,"userName":"leptokurt","timestamp":1368883397,"content":"Wow, I'm quite shocked how Spirit got its ass spanked by the tentacles, Pharmboys! Other than that, I think your results are awesome. Thank you both for your little descriptions - that's what the fans want to hear, after all!\n\nUnfortunatly I am very busy right now, but I hope to finish one cycle over the weekend. Going to start with Tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796662","commentId":796662,"userName":"lleimmoen","timestamp":1368889981,"content":"Khamul, I do not want to spoil it, I am sure you did very well but Arwen is unique…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796685","commentId":796685,"userName":"leptokurt","timestamp":1368896822,"content":"lleimmoen said:\n\nKhamul, I do not want to spoil it, I am sure you did very well but Arwen is unique…\n\n\n\nCompletely missed that. Thanks!\n\n \n\nKhamul, I'd suggest you replay those games in which you had more than one copy of Arwen in play at the same time. I don't want to be too strict with the rules, but to be fair to the other players I'd suggest that you only get 0.5 points for a win in a replay for each of these games. Hope you're ok with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796705","commentId":796705,"userName":"Khamul The Easterling","timestamp":1368905059,"content":"Ahhh.  Yes I knew that…. I did all 3 games at like Midnight so I guess thats why.  Well, I think im going to do all the rest of the spheres first and then finish the spirit last.  I don't mind the score thing, that does sound fair :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  But the thing that is a bit a drag is that I have to do them all over again.  I don't have all the time in the world so…..yeah I think ill get the rest of them done before the due date.  Thanks for pointing that out lleimmoen. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796706","commentId":796706,"userName":"Khamul The Easterling","timestamp":1368905299,"content":"btw the first game was the only one thatI had 2 Arwens  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796771","commentId":796771,"userName":"leptokurt","timestamp":1368928054,"content":"Khamul The Easterling said:\n\nbtw the first game was the only one thatI had 2 Arwens  \n\n\n\nIt's enough if you replay that game.\n\n \n\nBtw, it's not very polite to let Arwen wait that long!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796814","commentId":796814,"userName":"Khamul The Easterling","timestamp":1368954464,"content":"Yeah well I took apart thw whole entire deck….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=796815","commentId":796815,"userName":"Khamul The Easterling","timestamp":1368954642,"content":"Yeah well I took apart thw whole entire deck….. she's just going to have to wait……you know she will be used to it.  She's used to plenty of waiting and sadness and stuff if you know what I mean.  She'll be fine. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797188","commentId":797188,"userName":"leptokurt","timestamp":1369048810,"content":"Like I promised, I started my approach with the  tactics sphere:\n\n \n\n1st attempt: Legolas, Beregond, Gimli\n\n \n\nWIN\n\n \n\nOk, that was close. My threat was up to 47 when I took out the Watcher with Legolas (+Rivendell Blade), Gimli (+3 ATT), Landroval, Eagleas of the Misty Mountains and the Citadel Spear. Got two Mountain Wargs, only one tentacle enemy right at the start and lots of locations. Drawing Radagast and EotMM saved my ass, plus having two copies of Gandalf in my hand.Shadows of the Past helped my to avoid a tentacle enemy after the Watcher entered the arena during the combat phase.\n\n \n\n \n\n2nd attempt: Legolas, Boromir, Gimli\n\n \n\nWIN\n\n \n\nLots of treachery cards, so I was almost through stage 1 after 3 rounds. Played Bofur on turn 1, had a Defender of Rammas and a Vasall of the Windlord plus one Gandalf. Put the damage of the Striking Tentacle (setup card) on Gimli. Had to wait wo turns before I could engage the Watcher. All in all this approach was rather easy, my threat was at 35 after playing a second Gandalf. I even opened Durin’s Doors!\n\n \n\n \n\n3rd attempt: Thalin, Boromir, Gimli\n\n \n\nWIN\n\n \n\nThis time I changed my deck a bit, adding 3 Gondorian Spearmen and 2 Chain Mails. Got a Black Uruk during the setup and a Striking Tentacle during round 1. Put the damage of the ST on Gimli. After that life was rather easy. One Gandalf helped to lower my threat. At the end of stage 1 I played Hail of Stones to kill the Grasping Tentacle that was just revealed. I could thus move into stage 2 and engage the Watcher immediatly. Killed him during my next turn and finished the second stage on turn afterwards.\n\n \n\n \n\nAll in all a rather good start. Only the first game was a problem, the other two went smoothly. Of course I didn't face too many tentacles. Once the staging area was empty I had enough time to build up my WP. Without Gandalf threat managment is a pain in the ass. That's why I used Boromirs ability only once or twice. For my deck I chose the Eagles approach over the Dwarves, as it offers more WP which I considered o be more important than gathering ATT value. Beregond + Spear is a good method to get rid of these tentacles without attacking them. I was bit hesitant to replace him first, but Boromir is also a monster in this adventure (nevermind that he didn't get that much to do). Gimli is also shining, as his 5 HP are a gamesaver everytime the Striking Tentacle shows up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797359","commentId":797359,"userName":"Mr Coffee","timestamp":1369075504,"content":"Leptokurt…. as I mentioned in the thread for your previous challenge (which I just didn't have the time to attempt), I was anxious for you to post another one of these!   I still don't have as much time as I would like, BUT I was able to get a start on it (3 spirit hands and 2 leadership hands so far), and I will post those results soon.  But I thought you might like to know that this challenge has ALREADY provided me with one of my more satisfying/enjoyable moments playing this game! \n\nSo thanks!   reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]\n\nI actually talked about it in another thread, (monkeyrama's \"Narrative Moments [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=820572#820692]\") in a bit more detail, some of which I will include when I put my notes up here for my attempts… but not all, since there is a lot of editorial and contextual material I include in that posting… but I thought I would mention it here and include the link in case you were interested in reading it…  It really was some of the most fun I've had with this game to date!\n\nI'll post my current results soon!  (don't have my notes with me here at work… lol)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797484","commentId":797484,"userName":"leptokurt","timestamp":1369116859,"content":"benhanses said:\n\nLeptokurt…. as I mentioned in the thread for your previous challenge (which I just didn't have the time to attempt), I was anxious for you to post another one of these!   I still don't have as much time as I would like, BUT I was able to get a start on it (3 spirit hands and 2 leadership hands so far), and I will post those results soon.  But I thought you might like to know that this challenge has ALREADY provided me with one of my more satisfying/enjoyable moments playing this game! \n\nSo thanks!   reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]\n\nI actually talked about it in another thread, (monkeyrama's \"Narrative Moments [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=820572#820692]\") in a bit more detail, some of which I will include when I put my notes up here for my attempts… but not all, since there is a lot of editorial and contextual material I include in that posting… but I thought I would mention it here and include the link in case you were interested in reading it…  It really was some of the most fun I've had with this game to date!\n\nI'll post my current results soon!  (don't have my notes with me here at work… lol)\n\n\n\nThanks, I really appreciate your kind feedback! :-)\n\nI read about your meeting with Stagnant Creek. Have to say that I was tempted to change the text of this card, because it really is a *****, but then it would have made the scenario a bit too easy (I thought about something like \"choose 1: add a tentacle enemy or remove an ally from play, if possible\"). I got it twice during my third tactics approach, but never got a tentacle enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797639","commentId":797639,"userName":"Mr Coffee","timestamp":1369147346,"content":"leptokurt said:\n\n \n\n \n\nThanks, I really appreciate your kind feedback! :-)\n\nI read about your meeting with Stagnant Creek. Have to say that I was tempted to change the text of this card, because it really is a *****, but then it would have made the scenario a bit too easy (I thought about something like \"choose 1: add a tentacle enemy or remove an ally from play, if possible\"). I got it twice during my third tactics approach, but never got a tentacle enemy.\n\n \n\n \n\n \n\nI did get Stagnant Creek a few times in the 6 games I played for the challenege (so far), but have been pretty lucky with it so far, only getting a tentacle one one draw (that I can remember off the top of my head….\n\nAs I'll explain in a second, the card I have come to hate most in this encounter is:  Black Uruk.  Goodbye LoV… Goodbye SoG… Goodbye StwB… I hate that **** card!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797675","commentId":797675,"userName":"Mr Coffee","timestamp":1369152112,"content":"Well, since it seems like everyone started tackling this challenge by running out the Tactic decks, I thought I'd do the exact opposite and start with Spirit… especially since it seemed that with the poor combat abilities that sphere has, this would be a bit of a challenge.  It sure ended up feeling that way.\n\nFirst thing… this was my first time playing the game again after about a 4-5 month break, so my first couple of hands seemed sluggish as I made sure I was rememering the flow and details of the rounds as I went on…  and for my Spirit decks, I completely overlooked the card the EVERY deck should have for this encounter, Shadow of the Past… sure didn't do myself any favors on that one!  (I remembered it for my Leadership decks, thank god).\n\nRound 1 heroes:  Glorfindel, Eowyn, Eleanor - lost\n\nFor some reason I thought the questing ability of Eowyn, combined with Glorfindel's dual quest/attack stats would make this the best 1-2 combo for the scenario.  I only included Eleanor for her treachery negation and because I figured she would be the \"wink link\" to pair with what I thought were the best two Spirit heroes for this quest….  all that to say, this was my worst game.  In a way, I was glad that it happened right off the bat, since it forced me to rethink my hero combinations and deck-focus.  I had a decent opening draw, meaning that I got Light of Valinor (the rest was typical fare) to be able to play on Glorfindel, which I couldn't pass up of course.  That was pretty much the highlight of the entire round, as it all went downhill from there… lol.  I got a Striking Tentacle for the setup, then a Grasping Tentacle for the questing encounter draw.  Okay, not TOO bad as I had a chump to burn (Imladris Stargazer) and was able to kill the Grasping Tentacle with Glorfindel without it triggering its ability… I took the resource reward.  To make a long story short, within the next few rounds I pulled a Black Uruk (lost my LoV, so no more free questing for Glorfindel), which will be a recurring theme in my narrative, but still moved to 2B on that turn, so out dropped the Watcher and Doors.  The next few draws pulled me in some more tentacles, and I just couldn't keep up with putting out enough allies to both absorb the tantacle attacks AND the 3 damage from the Watcher each round.  Eowyn went down to a Striking Tentacle, and that was pretty much the game. That being said, I was able to have the necessary progress tokens on site 2B to win, just couldn't get enough to take out the Watcher, and didn't have good cards in my hand to win the Door riddle…\n\n \n\nRound 2 heroes: Glorfindel, Frodo, Eleanor - won\n\nI really thought my next set was going to be Glorfindel, Eowyn, and Frodo… but after seeing that even in a loss I was able to quest what I needed, I decided to keep Eleanor's \"escape\" ability on the table, and sacrifice the extra willpower.  My initial draw was (what I thought) pretty good- LoV again, Gandalf, Ancient Mathom, Bofur, and a few others.  I thought I was gone from the setup and first encounter draws, though.  My setup draw was a Warg Lair, which meant starting with that site plus a Mountain Warg before I had even started questing!  ****.  Then I pulled a Striking Tentacle during the quest… getting sucky pretty quick.  But with LoV on Glorfindel and using Bofur's \"quest out of hand ability\" (which is pretty much where he stayed all game until near the end) I was able to quest with them and Frodo during the early rounds to keep the progress tokens steadily growing… I also played the Ancient Mathom on Warg Lair, and travelled there right away.  With my low starting threat I avoided dealing with the wargs, and was able to get rid of the Tentacles with Glorfindel.  Round two I pulled a Black Uruk again… goodbye LoV… again.  But I was able to get rid of the Warg Lair, which meant I got to draw 4 cards (1 from the site text, and 3 from Ancient Mathom) and this turned out to be huge for me  (Hello LoV!!).  The rest of the game was basically a cycle of using Frodo's ability to absorb damage from tentacles and the Watcher into threat, then using Elrond's Counsel and The Galadhrim's Greeting to reduce my threat when I needed…  All of a sudden I found myself in a position I didn't think I would be… a chance to take on the Watcher directly with Spirit.  I played Gandalf (finally!) out my hand and opted for the 4 damage… I quested minimally and didn't pull a tentacle to block me from engaging the Watcher.  So I again used Frodo's ability to absorb damage into threat, then attacked with Glorfindel, Gandalf, Eleanor, and some Northern Tracker's and The Riddermarks Finest to get me the rest of the damage I needed to catch that bastard in my tuna nets.  The Fellowship wipped up some on-the-spot sushi rolls!\n\n \n\nRound 3 heroes: Glorfindel, Frodo, Dunhere- won\n\nI saved what I thought would be the best combo for last (Glor's quest/attack… Frodo's defending… Dunhere attacking the staging area), and it indeed turned out to be my best game with Spirit…  First, my draw was about as perfect as I could hopre for. LoV, Resourceful (since I started with 20 threat!), 2 Northern Trackers, Bofur, Ancient Mathom, and Lorien Guide… so my opening hand basically gave me all the allies I needed for questing, site control, extra resources, card draw, and Glorfindel's god-mode all at once!  My setup draw was a Stair Falls, about as safe a draw as I would hope for in this encounter… which of course I dropped the Mathom on right away, with LoV and Resourceful on Glorfindel.  That left me unable to play Bofur on the first turn, but I felt okay with my heroes alone on the first round (I quested with Glorfindel and Frodo hoping to save Glor and dunhere to travel to the stairs, or attack if needs be)…. Out pops a Wrapped.  ****.  Still not a bad draw, as it just means I can't travel to the Stairs right away (exhaust 2 to do so), and had to use Glorfindel to cut Frodo free…  Still, about as nice a opening round as I could've wished for with an all-Spirit deck…  getting that Resourceful out really set me up for the reast of the game, as getting 4 resources per turn really made it a lot faster to get my Trackers and Guids out quickly… To make a longer story shorter, throughout the game I was able to get a couple more Ancient Mathoms to cash in, and had a handful of cards to burn…. so eventually discarded 5 cards on the Doors with the letters D, B, T, S, W… which gave me something like a 75% chance to hit… and the encounter deck discarded a Bitter Wind to match my Bofur! …. and stumbling into Moria went my rag-tag Fellowship….\n\n \n\nThoughts:  Started off rough, but shook off the cobwebs as the hands went along.  Turns out that Frodo was the champ for this scenario.  His ability to absorb damage into threat pretty much acted as \"action potential\" for my other heroes and allies, since I could save them to do other things than defend all the time.  I just made sure I kept a healthy supply of threat reduction cards in my hand for when they were needed…  Obviously, remembering to include Shadows of the Past would have made each hand much easier, and maybe even given me a chance to pull out that first game after it started heading south…  That being said, Ancient Mathom filled in that void by putting a lot of cards in my hand over the final two games, so I just kept throwing cards at the Doors until something finally stuck!\n\nI HATE BLACK URUK!!!!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797679","commentId":797679,"userName":"leptokurt","timestamp":1369152635,"content":"benhanses said:\n\nleptokurt said:\n\n \n\n \n\nThanks, I really appreciate your kind feedback! :-)\n\nI read about your meeting with Stagnant Creek. Have to say that I was tempted to change the text of this card, because it really is a *****, but then it would have made the scenario a bit too easy (I thought about something like \"choose 1: add a tentacle enemy or remove an ally from play, if possible\"). I got it twice during my third tactics approach, but never got a tentacle enemy.\n\n \n\n \n\n \n\nI did get Stagnant Creek a few times in the 6 games I played for the challenege (so far), but have been pretty lucky with it so far, only getting a tentacle one one draw (that I can remember off the top of my head….\n\nAs I'll explain in a second, the card I have come to hate most in this encounter is:  Black Uruk.  Goodbye LoV… Goodbye SoG… Goodbye StwB… I hate that **** card!\n\n\n\nThat's why I never put stuff on my questing heroes. Ok, LoV and Celebrian's Stone are a differnt call. 90 percent of my attachments were given to my defending heroes (Dain for leadership, Beregond and Boromir for tactics)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797683","commentId":797683,"userName":"leptokurt","timestamp":1369152966,"content":"Time for some leadership:\n\n \n\n \n\n1st attempt: Gloin, Dain Ironfoot, Thorin Oakenshield\n\n \n\nWIN\n\n \n\nDwarf deck for the win! This time I got three tentacle enemies during stage 1. Setup was a Warg Lair plus the Warg inhabitant. The Warg kept me company until the end of the game, as I only got a shadow effect once, and that was the turn in which I had to attack the Watcher. It was an enemy heavy game, fortunatly I got some Snowbourn Scouts to take some hits and A Very Good Tale to fill up my ranks. Took me two turns to kill the boss, and if my dwarfs hadn’t been lured to Moria, I wouldn’t have made it (as we are speaking of narrative moments, this was indeed one). My final threat was at 45, my hand was empty. But now excuse me, there’s still a Warg out there that’s causing trouble in the Moria neighbourhood…\n\n \n\n2nd attempt: Theodred, Dain Ironfoot, Thorin Oakenshield\n\n \n\nWIN\n\n \n\nOne of the worst setups that I ever got in this scenario. Wrapped followed by Stagnant Creek. Fortunatly I got no tentacle enemy again. And if that wasn’t enough threat in the staging area, my fellowship also had to travel through a Perilous Swamp. I took a glance at my Sneak/Gandalf combo to calm myself. Everything was fine! And indeed I got through stage 1 without any problems, as my party was led by Faramir and got support of some dwarf allies. I didn't even use Sneak Attack. Then came The Watcher, but Gandalf approached just in time (slaying a Mountain Warg on his way) to help my fellowship to overome the mighty enemy. I think that was the first time that my heroes did take almost no wounds. Only Dain took a little scratch from a Striking Tentacle, but everyone else was quite fine (well, everyone beside the dead Errant Rider).\n\n \n\n \n\n3rd attempt: Theodred, Dain Ironfoot, Boromir\n\n \n\nWIN\n\n \n\nOuch, eventually I got flooded with tentacle enemies! But my fellowship hold the line, though Theodred was slain midgame by a mean and nasty Striking Tentacle. Lots of dead allies, but also a lot of resources to buy replacements. Thanks to Faramir qusting wasn’t a problem, and Path of Need left me free of sorrows when my fellowship approached Durin’s Doors. However, I got three tentacle enemies in a row and couldn’t engage the Watcher. Then I got a location, killed the Watcher and enjoyed the sight of 30 progress token lying on the adventure card. Overall that Dwarf/Gondor deck worked excellent. So far I really cannot complain about bad luck: another Stagnant Creek without a tentacle!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797690","commentId":797690,"userName":"Mr Coffee","timestamp":1369154168,"content":"leptokurt said:\n\n \n\nThat's why I never put stuff on my questing heroes. Ok, LoV and Celebrian's Stone are a differnt call. 90 percent of my attachments were given to my defending heroes (Dain for leadership, Beregond and Boromir for tactics).\n\n\n\nYup.  Definitely a needed tactic for this encounter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797694","commentId":797694,"userName":"Mr Coffee","timestamp":1369154921,"content":"leptokurt said:\n\n1st attempt: Gloin, Dain Ironfoot, Thorin Oakenshield\n\n \n\nWIN\n\n \n\nDwarf deck for the win!\n\n \n\n\n\n \n\nI REALLY wanted to try and run with dwarves as well for the Leadership part of this challenge, but I wasn't sure how well the deck would work once I started rotating the dwarves out for other heroes… so I chickened out… glad it worked for you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=797700","commentId":797700,"userName":"Mr Coffee","timestamp":1369156456,"content":"On to Leadership!\n\n \n\nRound 1 heroes: Aragorn, Theodred, Prince Imrahil- won\n\nI didn't take as many notes this time around for Leadership as I did for my Spirit run, but I will say this: Leadership obviously handled the defending and attacking a lot easier than the \"blues\" did, and while questing was a bit tougher for sheer numbers, Leadership doesn't really suffer in that area either.  Faramir made up for any \"shortages\"…  This first game was crazy fast.  I started with Steward of Gondor, Sword that was Broken, Sneak Attack, Snoburn Scout, Warrior of Lossarnach, and Shadow of the Past (now that I remembered to use this card)… Since both \"s\" and \"w\" have a decent chance of popping up in this encounter deck, I knew I already had a good chance of winning the Door Riddle, I just needed to quest my way to site 2B.  Long story short, StwB on Aragorn pretty much cruised me through all the questing and Shadow of the Past helped me set up a win with Sneak Attack and Striking Tentacle.\n\n \n\nRound 2 heroes: Aragorn, Theodred, Balin- won\n\nThis was a nail-biter with me ending up on 49 threat on the final turn, facing the possibility of threating out of the game… I had a For Gondor in my hand for multiple turns but kept turning out the Bitter Wind that dicarded all my resources to keep me from being able to play it… finally got enough resources on that final turn, engaged the Watcher, burned a chump defender, then hit him with my heroes and allies boosted with For Gondor for the win…\n\n \n\nRound 3 heroes: Boromir, Theodred, Balin- won\n\nThis was a good starting hand again… Path of Need, Shadow of the Past, SoG, Sneak Attack, and a few others…  I thought the addition of Boromir with a bunch of my Gondor allies would definitely lead to a defeat of the Watcher again, but in the end it was Shadows of the Past plus a Snoburn Scout/Striking Tentacle combination that let me win this one relatively easy.  Getting SoG out first turn led to being able to play Faramir a few turns later when I drew him, and the questing was ridiculously easy from there on out…  I think if I had needed to, I could have easily taken on the Watcher eventually, there just wasn't any need to once I got the right tentacle to pop out… killed it… recycled it to the top of the deck… activate the doors.   Probably my easiest hand in this challenge as of yet.\n\n \n\nThoughts:  Leadership definitely was able to handle a lot of the nastiness of this deck a bit more directly than my previous Spirit decks.  With that being said, I was pretty fortunate in all three games.  Decent starting hands, and nothing particularly nasty in the setup or initial encounter cards.  By the time anything difficult DID pop up, my table was pretty much established already.  I would like to think that it came down to my superior playing ability… but the reality is that I just got real decent draws to start, and didn't do anything to shoot myself in the foot….  These games made it apparent how Shadow of the Past would pretty much be the make or break for most games/decks for this encounter…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=798591","commentId":798591,"userName":"Mr Coffee","timestamp":1369395677,"content":"For some dang reason, the enter key on my home computer doesn't function here on FFG's forum (or any of the text options), but the rest of the keyboard does.  Weird.  So \"cut and paste\" all of my structure from my Leadership post, then edit all the text… annoying… lol…. ON TO LORE!\n\n \n\nRound 1 heroes: Denethor, Beravor, Glorfindel- won\n\nThe setup draw for this was Black Uruks… which seemed appropriate given how much I've documented my hatred for them… lol.  I mulliganed my first hand into a draw of Erebor Hammersmith, Daeron's Runes, Gleowine x2, Haldir, Dori, and Shadow of the Past… Daeron's Rune pulled out Mithrandir's Advice and Burning Brand (discard Gleowine), and Mithrandir's Advice pulled Forest Snare, Rumor from the Earth, and a Warden of Healing.  Can't complain with that starting hand!  After that, this hand turned into a steady rhythm of Denethor defending the couple Black Uruks that popped out for no damage (and they kept discarding tentacles for their shadow cards!  that alone was probably a pivotal part of the success this hand)… and I just kep using Rumor and Henmarth to check the deck to see what was coming, Denthor to defend… everyone else to quest or draw cards (Beravor and Gleowine)…   Finally had enough minions on the table to engage the Watcher head-on.  Denethor + Burning Brand + Protector of Lorien made it possible to engage him without him doing any real damage, then I attacked him over two turns with Glorfindel, Beravor, and a small army of 1/2-attack allies… lol.\n\n \n\nRound 2 heroes: Denethor, Beravor, Aragorn- won\n\nThis was pretty much an identical story to the one above.  Aragorn easily replaced Glorfindel (who didn't use his healing at all the first round) as the attacker in the party, Denethor defended everything thrown at him (with the help of PoL and BB again), and the rest was just questing, using a couple Ranger Spikes and Forest Snares advantagiously, and then going after the Watcher.  Went a little quicker this hand after seeing the \"flow\" of how the fiorst one worked…\n\n \n\nRound 3 heroes: Denethor, Bilbo, Aragorn- lost\n\nJust on of those games where you are reminded that strategy is great…. but CARD DRAW is king… lol.  Basically, all I nned to say is that my hand started with NO allies in it… and the opening setup was a Mountain Warg, followed by a Wrapped on Bilbo (tying up Denethor to exahuast to fre him), followed by draws of 2 Balck Uruks, Warg Lair (that pulled out Mountain Warg), and a second Warg Lair (and another Mountain Warg)… and a Striking Tentacle.  I actually nearly survived… I was able to get Gandalf and a couple Forest Snares out to snag some of the Wargs… but it was just too much.  Bilbo went down to the Tentacle, and with no other allies left and short a resource in a deck with expensive toons… just was done.\n\n \n\nThoughts:  Lore is definitely a good sphere to handle this challenge.…  as long as you are getting the adequate card draw, using resources wisely, and being able to scout the encounter deck to anticipate what's coming.  Game three I had none of that going.  Easy to see the outcome there.  I WAS surprised that neither of my two wins were via the doors, which I assumed would have been the primary way for this sphere to win with its ability to get cards in hand.  Not saying I couldn't have… it was just a more satisfying way to win by taking out the Watcher.  I believe I actually had the cards I needed in game 2 to use the doors, but it was on the same turn as I knew I would kill the Watcher, so chose to finish that way… All in all, I felt like Lore offered me the most \"flexibility\" of the spheres so far.  (Leadership would be close, but their specialty lies in being able to pay for the cards, whereas Lore just filled my hand with options…)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=798865","commentId":798865,"userName":"leptokurt","timestamp":1369470837,"content":"1st attempt: Eowyn, Glorfindel, Frodo\n\n \n\nWIN\n\n \n\nStarted with a Thrashing Tentacle and a Warg Lair. The additional Warg stayed in the staging area while Frodo (supported by Arwen and, later, Unexpected Courage) kept the tentacle busy. Ancient Mathom rewarded me with three extra cards, plus I got some early Resourceful and Elrond’s Counsel, so I had both resources and cards. However, I didn’t get Shadow of the Past, but after a while of traveling locations and killing a Striking Tentacle I had enough allies out to fight the Watcher successfully.\n\n \n\n \n\n2nd attempt Eowyn, Glorfindel, Dwalin\n\n \n\nWIN\n\n \n\nGot a really bad start with wrapped and Grasping Tentacle plus Striking Tentacle on turn 1. Fortunatly I had 2 Elrond’s Counsels to lower my threat to 17. I didn’t realize though that I didn’t have to engage Striking Tentacle (engaged it out of habit). I was able to play Bofur for 1 resource and the Stargazer for 2. Stargazer took the hit while Glorfindel soaked up the 4 HP by Striking Tentacle. The latter was killed immediatly. After that I got a lot of enemies (4 tentacles) and some locations. I was back against the wall for about 4-5 turns, but lowering my threat level really helped me to play the new Gandalf. Once I got Shadow of the Past I finished stage 1, opened the Doors and made it through (after 12 turns!)\n\n \n\n \n\n3rd attempt: Eleanor, Glorfindel, Dwalin\n\n \n\nLOSS\n\n \n\nWow, Mountain Warg, Warg Lair plus Mountain Warg on turn 1 plus two locations afterwards made quest progress impossible. Not having Arwen or LoV (or Eowyn, that is) made things even worse. One location was Stagnant Creek, and this time I got a Striking Tentacle – game over after 5 turns!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=799045","commentId":799045,"userName":"Glowwyrm","timestamp":1369515033,"content":"New to the forums, and new to the game (only been playing since March and have a fairly limited cardpool), but the challenge looked fun so I gave it a go. Also, thanks to the other players on the forum.  Reading the playthroughs really helped me develop my deck/strategy.\n\nTactics:\n\nAttempt 1: WON\n\nHeroes: Legoals, Gimili, Boromir\n\nThis was the closest and most difficult game.  Started with locations being revealed from the encounter deck and struggled to make progress.  Eventually, some enemies showed up and I eked out the first stage because of Legolas.   A hulked out Gimli plus ally-Beorn and his ability killed the Watcher, and I finished the stage the next turn when Legolas put his hands on the bow and killed the Stirking Tentacle that had been revealed from the encounter deck.  Finished with 49 threat in the nick of time.\n\n \n\nAttempt 2: WON\n\nHeroes: Legolas, Boromir, Thalin\n\nThe MVP of this game was Hobbit Gandalf, who showed up early and carried the questing.  Thalin's ability plus a spear of the citadel on Boromir helped kill enemies quickly.  I stayed aggressive, let my threat skyrocket, and charged quickly to stage 2.  Killed the watcher, quested past the doors, and finished with 46 threat in only a handful of rounds (forgot to keep track, I rarely score my games).\n\n \n\nAttempt 3: WON\n\nHeroes: Legolas, Beorn, Thalin\n\nThis attempt was my luckiest one.  Had an Uruk and a Mountain Warg early on, but killed them in the first couple of turns. Then I hit a run of 5 straight treacheries, that kept the threat in the staging area low and kept my questing going.  By the time I got to the watcher, I had no enemies out, one location, and an army of allies to take him down.  Quested past the doors and won easily.\n\n \n\nOverall, it was a fun experience.  I played aggresively, took lots of chances, and most of them paid off (Worst thing that happened was that I ended up with a grasping tentacle on Legolas in the second game which stunk, but Gandalf covered for that.  Worst thing that could have happened was threating out in the first two games, which nearly happened).    Looking forward to the other spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=799104","commentId":799104,"userName":"Glowwyrm","timestamp":1369538999,"content":" \n\nOof, Spirit, my limited hero selection led to some interesting combinations.  \n\nAttemp 1: LOST\n\nHeroes: Glorfindel, Eowyn, Nori\n\nI learned a lot on the fly through this playthrough.  I went through stage 1 too quickly, and so I didn't have enough allies out to take on the Watcher.  I stalled for several turns, hoping for a Gandalf, but when he finally came, I had lost too many allies, my threat shot up so that I got overwhelmed by enemies and died from damage.  Nori+Arwen was a pretty good defender.\n\nAttempt 2: WON\n\nHeroes: Glorfindel, Eowyn, Dunhere\n\nI took my time, questing slowly on purpose to make it through the first stage.  Gandalf showed up, my army of allies took the Watcher down, and I finished relatively easily.  Glorfindel got grabbed by a tentacle that he was trying to destroy, which meant that he was only good for question and soaking up damage.  He valiantly sacrificed himself so that his companions could make one more attack on the Watcher and win the game.\n\nAttempt 3: WON\n\nHeroes: Glorfindel, Dunhere, Dwalin\n\nDwalin + Arwen defense boost made a great defender against regular atttacks.  Turned over severl thrsahing tentacles and black uruks, but was typically able to take one down each turn.  Once Gandalf showed up, I pressed on to stage two,  Unfortunately, I was stuck with a thrashing tenatcale that kept killing my allies and prevented me from engaging the Watcher.  Eventually, I got a good break and killed it, engaged the Watcher next turn and took another two to kill it.  Sadly, Glorfindel died again, as he defended against the Watcher so that his comrades in arms could take the Watcher down.\n\n \n\nSpirit was tough, but patience and Gandalf carried the day.  Glorfindel suffered a lot of abuse: he died in every playthrough, the Black Uruk discarded Light of the Valinor in every playthrough (I should have seen that coming), and he had a grasping tentacle attached to him in the last two.  Still, Spirit did better than I thought it would; it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=799181","commentId":799181,"userName":"leptokurt","timestamp":1369566124,"content":"Hi and welcome, Glowwyrm! Glad you're enjoying the challenge so far.\n\n \n\n \n\nHere is my final runthrough with lore:\n\n \n\n1st attempt: Elrond, Denethor, Beravor\n\n \n\nWIN\n\n \n\nI wasn’t convinced of these Masters of Lore, but I have to say that they can be pretty useful. I was able to play two of them during turns 2 and 3 and could thus play one card for 2 resources less each round afterwards. Setup was a Black Uruk and round 1 wrapped one of my heroes. I could kill the Uruk with Mirkwood Runner, and afterwards I used Beravor’s ability pretty much every turn. Progress was slow, but as I got no tentacle enemies I was quite safe. However, just when I wanted to enter stage 2 I got a Striking Tentacle which killed Denethor, but Rumours of Earth told me the secret of Durin’s Doors so I could enter Moria before the Watcher could hurt my fellowship. I didn’t even have the time to play my two Gandalfs.\n\n \n\n \n\n2nd attempt: Glorfindel, Denethor, Beravor\n\n \n\nWIN\n\n \n\nLore is playing this scenario like a fiddle. The Spikes keep the tentacles away and the numerous ways of manipulating the encounter deck make openeing the Doors very easy. A very uneventful game, especially as I had two Warden of Healing to heal all the damage afflicted to my fellowship.\n\n \n\n \n\n3rd attempt: Glorfindel, Denethor, Aragorn\n\n \n\nWIN\n\n \n\nOk, so lore is probably the best mono sphere. Another game with no problems at all. I got lot of locations and treacheries, but like I already said, lore offers so many opportunities to avoid nasty encounters while providing you with cheap allies and synergies all over the place – it’ simply amazing! Denethor is the champ of this scenario. A good defender with a totally useful power was key to all three wins.\n\n \n\n \n\n \n\nRESULT: 11 / 12 (highest starting threat: 32)\n\n \n\n \n\nWith hindsight I probably should have made this scenario harder instead of easier. I’d like to hear some input from those who have been playing how hey felt about the scaling of this challenge. Would you prefer a challenging challenge or a more relaxed approach?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=799710","commentId":799710,"userName":"Mr Coffee","timestamp":1369756874,"content":"leptokurt said:\n\n \n\n \n\nI wasn’t convinced of these Masters of Lore, but I have to say that they can be pretty useful. I was able to play two of them during turns 2 and 3 and could thus play one card for 2 resources less each round afterwards…\n\n \n\n\n\n \n\nI found them pretty useful in 2 of my Lore attempts as well… particularly in a mono-sphere deck where there wasn't any Leadership to lend its resource-generating abilities.  I think it would be hard to see time in a normal deck for me, but for those encounters where you need to stick to one or two colors (say, a Lore and Spirit deck), I caould see it making it in there to help with the cost of those spendier green allies…\n\nFor this scenarios, I found that it truthfully meant the difference between playing only one ally on a turn while sitting on extra resources and being able to get a second ally out on the same turn, which really helped with the Tentacle control for this encounter…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=799738","commentId":799738,"userName":"Khamul The Easterling","timestamp":1369760074,"content":"Not able to continue this due to only 3 leadership heroes (well I have 4 but its Elrohir so…..)  I just happen to not have the packs with leadership guys. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]  \n\nSorry.  I am prob getting a bunch more packs soon.  Currently I have over half the expansions so i'm catching up.  \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=799761","commentId":799761,"userName":"Mr Coffee","timestamp":1369766007,"content":"So, I've thoroughly enjoyed this challenge, and look forward to the next!  …. (but I also will probably not play through the Watcher in the Water encounter again.  For a year or two.. lol)…\n\nFor my final sphere, I end where it seems everyone else is starting…. Tactics!\n\n \n\nRound 1 heroes: Legolas, Gimli, Beregond - won\n\nThe setup draw for this was Disturbed Waters (+5 threat), Ill Purpose (no effect), and Grasping Tentacle… and then pulled a Thrashing Tentacle for the first quest pull.  Crappy way to start, but not the worst.  Fortunately, my opnening hand (after a mulligan of an all-ally inital draw), was a Feint, a couple of Gandalfs, Defender of Ramas, Winged Guardian, Beorn, and Dwarven Axe.  Beregond defended the Grasping, and I let the Thrashing go undefended to get the wounds on Gimli…  Legolas and DoR attacked the  Grasping to get 2 progress tokens (Legoals ability) and a resource (challenge reward).  This was pretty much the cycle this entire hand fell into.  Beregond (and defensive allies) defend; Gimli quests (occasionally attacks), and Legolas attacks for progress tokens.  Eventually, I was able to get Beorn, Gandalfs, and some Eagles into play to handle the questing to free Gimli up.\n\nWhat made this game interesting to me was:  1)  It was the first time I've ever mono-sphered anything with Tactics.  In fact, it was the first time I've ever used more than a single Tactics hero for an encounter (so I was a little unsure if I had put together a deck that would flow well).  2)  Because of Tactics inability to get willpower on the table, I had to get creative (read: lucky), in that I never really pulled any more locations or enemies than what I could handle with the allies on the table….\n\nIn fact, the end of this hand was the single most interesting end of this encounter (and possibly any encounter) I have had yet… When I hit the second quest site, I pulled the Watcher into engagement immediately.  Beregond (with the Spear of the Citadel) was able to keep the Watcher minimized, and Gimli (plus wounds and a Dwarven Axe), Legolas, Gandalf, and a couple allies were able to take the Watcher down pretty easily.  Legolas placed my first 2 progress tokens on the Doors of Durin (which get transferred to site 2B).  I thought I would have no problem questing out the remaining 3 progress tokens I needed to win… But by that time my threat was sitting at 41 (Gandalf had already lowered my threat TWICE in the encounter), and I knew I needed to get it done quick.  But out flopped Perilous Swamp and Stair Falls (for 6 threat) into the staging area, and I realized that I was gonna have a hard time questing with my few characters that actually had willpower to end the encounter.  My threat had creeped back up into the mid 40's and I couldn't risk another Disturbed Waters creeping out… fortunately, I drew up a second copy of Shadow of the Past, killed a Striking Tentacle with Legolas (which gave me another 2 progress tokens), played SotP, and riddled my way past the doors to move it to the victory display.  Now I had BOTH the Watcher and the Doors defeated, and STILL hadn't enough progress tokes to win!!  I ended that round at 47 threat… In a way, I was almost hoping to draw Disturbed Waters, since it would have been a crazy to say that I had beaten both the Watcher and the Doors in the same game… AND STILL LOST… lol.  But, as fate would have it, I quested everything I could that had willpower (Gimli, Legoals, Beorn, and some Eagles) and got the needed final progress token when a Bitter Winds dropped out…\n\n \n\nRound 2 heroes: Legolas, Gimli, Bard - won\n\nAfter the lengthy synopsis of the last hand, this one will be quicker…  This one started out nasty:  Warg Lair + Mountian Warg for setup; Stagnant Creek + Striking Tentacle for first quest pull.  BUT I had a decent opening hand, I travelled to the Creek, played Feint to hold the Warg in place (with no attack), let the Tentacle go undefended to get the 4 wounds on Gimil, and then had a Rivendell Blade on Legolas to get rid of the Tentacle.  After that, things settled back into the \"quest for little, defend, attack for progress tokens\" routine.  Questing was a tad easier this time with Bofur and Eagle of the Misty Mountains in play….  End result:  Gandalf, Gimli, Bard, EotMM (plus a few eagle pumps) take out the Watcher (no questing tricks needed this time).\n\n \n\nRound 3 heroes: Gimli, Bard, Hama - lost\n\nHonestly, I think this game was lost more because I chose to keep Gimli over Legolas more than anything.  I was really thinking I needed him for the Watcher confrontation….  Hama actually saved my bacon repeatedly by pulling back Feint into my hand.  But it was just one of those hands that started off shaky and didn't get any better.  My initial hand draw wasn't great, so I mulliganed… and didn't get much better.  I dropped a Ring Mail on Gimli and that was about all I could do for the first round, which saw me start with a Stagnant Creek pulling out a Thrashing Tentacle, then Black Uruk popping out during questing and discard my Ring Mail…   When it came down to it, I just couldn't get the cards I needed into my hand to do ANYTHING in the questing area… I was able to get Feint and Blade Mastery that Hama kept pulling into my hand.  But I got absolutely NO allies into my hand for questing purposes, or ones that I could decently rely on to defend/attack for my heroes to commit to the quest all the time.  I went 5 or 6 rounds getting only a single progress token (which then insultingly got removed with a shadow effect, after all that work to get it!), just spinning my wheels to keep Hama pulling those events to save my bacon.  But then Bard went down to a Tentacle attack that went unguarded (after it pulled another tentacle for that result) and it was just a downhill slide from there…\n\n \n\nThoughts: Tactics is definitely the \"fight the world\" sphere, that's no news on here… what impressed me was good it was at not only defending/attacking it was, but the ability to really manage when even outnumbered decently… of course, offset by the fact that there's virtually no willpower in the sphere (again nothing new).  I think what the last hand really showed me was how amazing Legolas' ability is; definitely in a mono-sphere deck, but then paired in a non-Spirit deck (Leadership or Lore) could really help close that questing gap and help esacpe that blue addiction and safety net… lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=799909","commentId":799909,"userName":"leptokurt","timestamp":1369809385,"content":"@Khamul:\n\nIf you don't have enough heroes, you could proxy some of those you don't have to complete leadership.\n\n \n\n@ Benhanses:\n\nI really like your game descriptions. Keep it on, you got a talent for this!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=800407","commentId":800407,"userName":"Mr Coffee","timestamp":1369925591,"content":"leptokurt said:\n\n@ Benhanses:\n\nI really like your game descriptions. Keep it on, you got a talent for this!\n\n\n\n \n\nThanks!  The reality of it is… I'm not the best gamer in the world… I'm probably pretty average, if anything.  This is the only game of its nature that I am into, so people who have spent years playing Magic, L5R, what-have-you really pick up how these card games fit together a lot quicker than I do (or at least I assume so, by hearing how they all beat nightmare mode single handedly… 50 times in a row… with only one hero in play… while limiting themselves to cards that only start with the letter \"Z\"… from another game)…  So I'm quite content getting 9 out of 12 for this particular challenge…  Moreso because I really felt like I tried something I never had before (mono-sphere), found that I could be successful with it, and felt like I took the time to learn some of the internal workings of each of the \"colors\".  Did I build the best decks possible… probably not.  But part of the enjoyment of doing multiple attempts with the same spheres was learning from what mistakes I had early… tinkering with the decks a bit to correct those and allow for changes in the heros.  And in the process of focusing on the mono aspect of this game, I actually started thinking of how some of those mechanics would fit in well with other spheres from time to time.  I really enjoy the self-educational part of this game! \n\n \n\nAs for the \"descriptions\" part… I'm simply \"blessed\" with the proverbial \"gift of gab\".\n\n \n\nLooking forward to the next challenge!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=800618","commentId":800618,"userName":"Glowwyrm","timestamp":1370001911,"content":"Lore\n\nAttempt 1: WON\n\nHeroes: Denethor, Aragorn, Glorfindel\n\nThis game was a piece of cake, and I was never in serious danger.  I started with a mountain warg at the beginning of the game (a recurring them for my lore playthroughs), played a ranger spikes, and got a stair falls for my first encounter card in staging.  I defended the mountain warg, he got a shadow card with no effect, and so he jumped back into the staging area and right into my ranger spikes.  It was awesome, and I didn't worry about him the rest of the game.  I got locations on the next few turns, which gave me an opportunity to play some allies, and I chraged through the locations with glorfindel on Asfaloth.  I played it slow, trapped a Black Uruk in some more ranger spikes, then cruised on to stage two.  I survived the damage from the Watcher, learned the password to the Doors of Durin with Denethor, opened them, the quested to victory the next turn.  Piece of cake.  I thought lore was going to do really well at this challenge.\n\n \n\nAttempt 2: LOST\n\nHeroes: Denethor, Aragorn, Berevor\n\nMy first attempt was seriously misleading as to how the rest of my lore attempts would go.  Starting encounter card was a Mountain Warg again, but I didn't have any ranger spikes this time.  First staging card was a warg lair, which brought out another mountain warg, and I was pretty much sunk.  I was questing unsuccessfully as my thrwat went up, and the mountain wargs never stuck around long enough for me to kill them.  Eventually I drew a striking tentacle that took out beravor (aragorn was maxed on damage from the warg attacks), and I was sunk.  I played it to the finish, my heroes and allies were overwhlemed by enemies, and that was it.  \n \n\nAttempt 3: LOST\n\nHeroes: Denethor, Elrond, Berevor\n\nSame story as the last game.  Mountain warg was revealed during setup, mountain warg was the first encoutner card.  I didn't draw any ranger spikes despite my best attempts.  I struggled to quest because I had to hold back defenders, and I kept drawing more enemies from the encounter deck.  Got overwhelmed by damage and lost in the first few turns.\n\n \n\nLore was a massive bummer. Going in, I though I'd be able to open the doors on almost every attempt.  But I struggled with constant early pressure from enemies.  I probably should have started with lower threat heroes, but I didn't have many options in that regard.  My only successful playthrough was the only one I got a Master of Lore and Ranger Spikes out.  The first one helped me save a resource a turn,  which added up to a lot, and the second dealt with those pesky wargs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=800635","commentId":800635,"userName":"Glowwyrm","timestamp":1370004114,"content":"Leadership\n\nAttempt 1: LOST\n\nHeroes: Aragorn, Theodred, Gloin\n\nThis was a tough one to lose.  I had a great setup up going in to the Watcher, with an army of allies ready to go and take him down.  Then, on the turn when I quested to defeat stage 1, I flipped a Thrashing Tentacle from the encounter deck.   I couldn't engage the Watcher because of the tentacle, and for three turns attacking it, I flipped over a tentacle enemy and ended up taking out an ally.  Between that and the damage from the Watcher, my army of allies dwindled.  By the time I engage the Watcher, I struggled to get enough attack power to do lasting damage on him.  I made a desperation attempt to open the doors, but failed.  I eventually succumbed to the damage and lost.\n\n \n\nAttempt 2: WON \n\nHeroes: Aragorn, Theodred, Balin\n\nThe only time I won with leadership came on the playthrough when it was least likely.  I flipped over 5 straight tentacle enemies from setup and my first few turns.  I defeated most of them, but a striking tentacle took down Theodred and a grasping tentacle ended up on Aragorn.  I was questing well, with a Sword that was Broken and Faramir on the table, and I had good card draw going with King Under the Mountain out, but I had a dead hero and the other two had damage pile on them.  So I charged to stage two and discarded and extra copy of the Sword that was Broken plus a few extra crads from hand in an attempt to open the doors.  I discarded a Stagnant creek from the encounter dec, opened the doors and cheered!  I quested to victory the next turn and won.\n\n \n\nAttempts 2: LOST\n\nHeroes: Aragorn, Boromir, Balin\n\nThis was a tough game to lose.  I drew an ideal starting had, with Steward of Gondor, King Under the Mountain, Sword that was Broken and A Very Good Tale.  I started drawing cards and pumping out resources and allies from the first turn and felt great.  However, my setup card was a Stagnant Creek, and I discarded a tentacle enemy from the top of the encounter deck.  Threat jumped from 32 to 37.  My first encounter card was Disturbed Waters, so my threat was all the way up to 43 at the end of turn one.  A fairly uneventful turn two, which set me up to move on to stage 2 the next turn.  I was set with a Gandalf plus Sneak attack in hand to damage the Watcher this turn, then take the Watcher down on turn four and quest to victory….but I flipped over ANOTHER DISTURBED WATERS!!!!  49 threat and I was sunk.  I was set to cruise to victory, but I ended in defeat, threating out after 3 turns.  \n\n \n\nOverall, it was a fun challenge, but tough, and I'm looking forawrd to the next one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=801151","commentId":801151,"userName":"leptokurt","timestamp":1370191706,"content":"That sounds like an unbelievable series of misfortune, Glowwyrm! I'm glad that you still had some fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=801156","commentId":801156,"userName":"leptokurt","timestamp":1370192938,"content":"And the winner is….\n\n \n\n*drumroll*\n\n \n\nME! ME! ME!\n\n \n\n*celebrates*\n\n \n\nNo seriously, I have to admit that I had a big advantage, especially with leadership and tactics, as I've been testing these two spheres against TWitW to find a good balanced challenge for you. Nonetheless I am quite impressed how good the mono decks worked in this scenario. There certainly has been an ongoing power creep during the Dwarrowdelf cycle and HoN.\n\nTactics and Leadership are tied for being the best mono sphere in this scenario while Lore has been surprisingly ineffective compared to these two. I already saw Spirit taking the last place before the challenge started. That's why the next challenge will be something more related to questing.\n\nThanks to everyone who participated and to Ileimmoen for kindly pointing out some rule errors that I missed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=801508","commentId":801508,"userName":"Pharmboys2013","timestamp":1370298158,"content":"very fun challenge and i'm looking forward to the next one!\n\nalso…for the next quest that is \"more related to questing\"…dont pick the hills of emyn muil\n\nsincerely, everyone"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=802477","commentId":802477,"userName":"Khamul The Easterling","timestamp":1370730115,"content":"Or actually you could do THoEM but change the rules to make it harder and more fun.  That would be really cool I think.  \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83757-solo-mono-challenge-2-grasping-experience/?do=findComment&comment=802573","commentId":802573,"userName":"leptokurt","timestamp":1370778933,"content":"Khamul The Easterling said:\n\nOr actually you could do THoEM but change the rules to make it harder and more fun.  That would be really cool I think.  \n\n \n\nKhamul\n\n\n\nI'm currently working on Road to Rivendell. I have a few ideas to make this scenario tougher and to handle Sleeping Sentry. Have to do some gameplay testing yet, but I hope I will be able to start the next challenge next weekend."}]}