{"url":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/","title":"Questions about game before I buy, please help","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/?do=findComment&comment=795081","commentId":795081,"userName":"Rogue 4","timestamp":1368463331,"content":"OK, so I play the Star Wars LCG and used to play the old Decipher Lord of the Rings quite a bit and was wondering about getting into this game. But first a few questions:\n\n1) Do I HAVE to buy two cores if I want 4 players to play? With all the adventure packs out now, wouldn't those replace another core?\n\n2) I have 3 other guys/gals that want a co-op game, will this satisfy us?\n\n3) Are the first adventure packs sold out?\n\n4) Please give me your honest pinons about how I should go about buying this game (in what order (other than the core of course) adventure packs, expansion packs, saga packs).\n\n \n\n \n\nThanks for any input.\n\n \n\nJim Sharp"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/?do=findComment&comment=795088","commentId":795088,"userName":"richsabre","timestamp":1368463844,"content":"1. you dont need to buy 2 core sets to play 3-4 players if you are willing to use pen and paper to write down threat tracking. not a problem i do it with 1 core set and 3 handed\n\n2.yeah sure- the more cards the better, but you should get along fine\n\n3.yes pretty much (maybe a few here and there), reprints on the way - not sure when but i think its on the ffg upcoming page\n\n4.i have played the game as and when it came out and id recommend this. makes sense story wise and its how the designers worked on the game chronologically\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/?do=findComment&comment=795105","commentId":795105,"userName":"Rogue 4","timestamp":1368466642,"content":"Thanks Rich, so to clarify, just buy the adventure packs and others according to their release date?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/?do=findComment&comment=795107","commentId":795107,"userName":"richsabre","timestamp":1368466974,"content":"well you certainly dont have to, but its important to note that you HAVE to buy the deluxe packs before the smaller ones in the corresponding cycle (sorry forget to mention this rather important point!)\n\nthe core set acts as the deluxe pack for the mirkwood cycle so you are ready to go there\n\nthe khazad dum pack is for the dwarrowdelf cycle\n\nhiers of numenor is for against the shadow cycle\n\nhobbit saga packs 1 and 2 dont need any other packs than core set\n\nso….you could buy any of the mirkwood cycle packs straight away and it really doesnt matter on the order if you dont want to follow the storyline\n\nand you can buy any of the dwarrowdelf packs in any order once you have khazad dum\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/?do=findComment&comment=795174","commentId":795174,"userName":"SiCK_Boy","timestamp":1368480077,"content":"Just so you have more than one opinion to base yourself on, here are my thoughts.\n\nOn question 1, I think you need at least 2 Core sets for 4 players to allow proper mixing of spheres. If all 4 players are willing to stick to a single sphere each, then a single Core would do. But there are still a number of staples in the Core set that are only coming as 2 of. There's a good chance more than 1 player with Leadership will want to play Sneak Attack, for example. Buying a bunch of expansions at once will make things easier, and no, you don't NEED 2 Core sets, but I think it will greatly contribute to the deckbuilding and enjoyment of the game for a 4 players group.\n\nYes, the game will satisfy a group, especially if you pace out your gaming sessions. With all the scenarios available, there's enough material to keep a dedicated group busy for a long while.\n\nSome of the early AP seem to be sold out now, but they'll all get reprinted at some point or other. Just be patient and don't blow astronomical amount of cash on any out-of-print AP right now. None of them are \"mandatory\" to enjoy the game.\n\nAs for buying order, besides the obvious (needing the deluxe to play the related cycle AP), I think you would be better to focus on the later expansions for the quality of scenarios (the early AP did not scale all that well for 4 players), but the earlier scenarios have a number of important player cards you'll want to give your group versatility (like the songs). If you are on a limited budget / buying schedule, I would start with the latest and, if / when you hit a difficulty with a scenario, look up spoilers and go for AP that will augment your card pool to help win those scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/?do=findComment&comment=795201","commentId":795201,"userName":"Rogue 4","timestamp":1368486474,"content":"Thanks to both for the feedback, now just need a good source to buy the core sets from. Any suggestions? I see minature market has the core somewhat cheap, any other place I should look?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/83809-questions-about-game-before-i-buy-please-help/?do=findComment&comment=795205","commentId":795205,"userName":"gatharion","timestamp":1368487650,"content":"I've been playing 3-4 player with just a single core set since the game came out. We use dice for threat trackers."}]}