{"url":"https://community.fantasyflightgames.com/topic/84002-what-do-you-think-of-the-spoiled-boon-card/","title":"What do you think of the spoiled boon card?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84002-what-do-you-think-of-the-spoiled-boon-card/?do=findComment&comment=796551","commentId":796551,"userName":"Cunir","timestamp":1368859716,"content":"i like FFG's new boons and burdens idea, but i notice that the boon card which has been spoiled is really just another event card.\n\nit says…\n\nSet-up: Attach to the ring bearer.\n\nAction: Add Mr Underhill to the victory display to choose an enemy engaged with you. Until the end of the round, that enemy cannot attack you.\n\ni'm guessing that we wont have to put them into our player decks to be drawn later -- like we currently have to do with the treasure cards -- because if we had to do that then they really would just be another event card. seeing as they've printed the word \"set-up\" on it, i think they will probably allow us to attach them to frodo at the very beginning of the game.\n\nbut what do you think will happen when we use it? i know that we can only use it once per quest, because it goes straight into the victory display, but what about the next quest in the story? if we use it, will we still be able to carry it forward to the next quest, or will it be gone forever? it's got the keyword \"permanent\" on it, so maybe we will be able to keep it forever. if that's the case, then i can see frodo becoming quite a powerful character later on in the story if he manages to attach multiple boons to himself.\n\nbut if it's just a one-time use thing, then i'd always be reluctant to use it in case i need it further on in the story.\n\n….\n\nit will be really good if they have boons for other characters too. the quest could say something like \"if you win the quest using this particular character (from the actual story), then you get a boon for him\". and it can only be attached to him, and him alone. so that will encourage us to use that character in all the subsequent quests too. we will start building up the characters and make them more powerful as they progress through the story.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84002-what-do-you-think-of-the-spoiled-boon-card/?do=findComment&comment=796599","commentId":796599,"userName":"Eryx_UK","timestamp":1368870957,"content":"It is one of those mechanics that I would like to see appear in regular packs not just in specific storyline ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84002-what-do-you-think-of-the-spoiled-boon-card/?do=findComment&comment=796653","commentId":796653,"userName":"Rapier1","timestamp":1368886059,"content":"I think it will be one use. But if you don't use it in the first scenario you'll get to keep it and use it again later.\n\nThematically it represents Frodo's initial disguse Which obviously only worked as a trick once against the shadow.\n\n \n\nHowever I think some of the other boons will be like treasures are now (you get them for acheiving something special), but they won't be discarded but will then remain in play for the rest of the story. (Being in play during set up at the start of every future game in the saga)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84002-what-do-you-think-of-the-spoiled-boon-card/?do=findComment&comment=796750","commentId":796750,"userName":"Glaurung","timestamp":1368921042,"content":"I like the idea of burden and boon cards. I dont like treasures idea from hobbit (in my opinion treasures cards is too powerful and broken the balance so i never play them). BD look really like a really good designers job. This Caleb sound like really deep guy trying to bring game on the whole new level.\n\nCannot wait to play this new campaign mode with a Burden and boon cards. Hope it will be better them abanndod and annpying nightmare idea from the cose set since i play it and no challnege just a boring rutine.  Really really hope for new campaign mode.\n\nAbout Boon. I lkie since is a good additional for you + it doesn look very powerful just a good card. Mechanic is really fit a book idea! I was 7 years old when i read book first time. Now when i play this game i go back to my old times which is amazing!"}]}