{"url":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/","title":"Bending the rules for better play experience","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=796958","commentId":796958,"userName":"Style75","timestamp":1368988328,"content":"I just finished an evening playing back to back sessions of Redhorn Gate. In both sessions, I had the locations Celebdil and Fanuidhol end up coming out as shadow cards which doomed me to attempting to cycle through the encounter deck in order to draw them again, ultimately failing due to nasty treacheries. There's been a few quests like this where essential cards can end up discarded as shadow cards (Hunt for Gollum springs to mind) and I've decided to bend the rules a little bit with the following house rule:  if a quest essential card is discarded as a shadow effect, add it to the staging area instead of discarding it. In the case of Redhorn Gate, this is still an unpleasant shadow effect as it immediately puts 3 threat into the staging area, but at least it doesn't doom the whole game into a game of stalling for time until a card comes out of the encounter deck.\n\nWhat do you all think of this house rule? Does it make the game too easy or is it a sensible response to shabby game design? Do you see any problems with a houserule like this? Any comments would be appreciated. Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=796995","commentId":796995,"userName":"Khamul The Easterling","timestamp":1368996276,"content":"Well on Rhosgobel I do this sometimes.  Redhorn gate I have heard can be really frustrating when you dont get the victory point locations.  I do not have the redhorn gate yet (coming in a few days) but I've read like every review on every expansion on this whole internet :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] and found that it can be very annoying when you dont get those locations.  So i'd say that if you are wanting to twist that rule you said by puting a victory point location as a shadow into the staging area because the game is too hard, then I wouldnt do it at all.  That's just part of the quest.  But if it is making you frustrated and your getting really annoyed, then I would say you should do that rule.  Because its not fun playing the game when you arn't happy and getting frusrated and mad.  But again, if you are having an okay time and just doing it for difficuly reasons then I wouldn't.\n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=796996","commentId":796996,"userName":"Khamul The Easterling","timestamp":1368996343,"content":"Well on Rhosgobel I do this sometimes.  Redhorn gate I have heard can be really frustrating when you dont get the victory point locations.  I do not have the redhorn gate yet (coming in a few days) but I've read like every review on every expansion on this whole internet :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] and found that it can be very annoying when you dont get those locations.  So i'd say that if you are wanting to twist that rule you said by puting a victory point location as a shadow into the staging area because the game is too hard, then I wouldnt do it at all.  That's just part of the quest.  But if it is making you frustrated and your getting really annoyed, then I would say its a good idea to change that rule and let it go in the staging area instead of being discarded.  Because its not fun playing the game when you arn't happy and getting frusrated and mad.  But again, if you are having an okay time and just doing it for difficuly reasons then I wouldn't.\n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797005","commentId":797005,"userName":"starhawk77","timestamp":1368997938,"content":" \n\nIf it helps you enjoy the scenario more, then it's fine. I tend to think a better solution is to include Shadow of the Past in your player deck, since that will allow you to retrieve key encounter cards (including Gollum in TDM, should he be discarded as a shadow card) without breaking the rules. SotP is a criminally underutilized card that makes quests like AJtR, TDM, and TRG considerably less luck-dependent. Even if you aren't playing one of those quests, you can use it to recycle benign encounter cards.\n\nUltimately, though, it's your game experience. If you enjoy your variant and don't mind bending the rules, then go for it. But give SotP a try.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797063","commentId":797063,"userName":"leptokurt","timestamp":1369016981,"content":"starhawk77 said:\n\n \n\nIf it helps you enjoy the scenario more, then it's fine. I tend to think a better solution is to include Shadow of the Past in your player deck, since that will allow you to retrieve key encounter cards (including Gollum in TDM, should he be discarded as a shadow card) without breaking the rules. SotP is a criminally underutilized card that makes quests like AJtR, TDM, and TRG considerably less luck-dependent. Even if you aren't playing one of those quests, you can use it to recycle benign encounter cards.\n\nUltimately, though, it's your game experience. If you enjoy your variant and don't mind bending the rules, then go for it. But give SotP a try.\n\n \n\n\n\nThis.\n\nShadow of the Past is one of the best cards in this game. It belongs in every deck. When the game challenges you with a problem, you can almost always solve it by adding the right cards in your player deck. Bending the rules is ok (for example, when you play Return to Mirkwood solo), but it should only be done if the scenario is outright unfair and otherwise unplayable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797065","commentId":797065,"userName":"Legolas of Darkwood","timestamp":1369017363,"content":"I'd go with \"a sensible response to shabby game design!\"\n\nActually I would not be too hard on the game since really bad combinations can always happen in a card game. What you are doing is basically compensating for the rare but possible instance that very bad luck on the draw would condemn you to an extremly long game and a likely loss in the end. If you still want to try - try, but if you don't I wouldn't feel bad to bend the rules here, since this was certainly not an intendedand part of the quest. \n\nActually your house rule sounds bretty good to me. In situations like that we were even more extreme and simply exchanged the top two cards of the encounter deck. A game of LotR can take pretty long and sometimes be very exhausting. In a solo game I might continue for the challenge, but playing with friends or my GF I know from experience that these situations need to be mitigated, or otherwise the evening will most likely end with everyone beeing pissed off."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797085","commentId":797085,"userName":"richsabre","timestamp":1369027296,"content":"id also say if it makes the game more fun then go for it. remember it may need to be altered in future quests where the difficulty relies on the fact key cards can be put out of play …..then id say just go for shadow of the past\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797093","commentId":797093,"userName":"Style75","timestamp":1369028428,"content":"The problem I have with Shadow of the Past for this situation is that it feels like a imperfect fix to a game design mistake. I actually like SotP for its ability to control the encounter deck, but in this case it is conditional: 1. you need to draw it from your deck 2. you need to keep two resources on hand to be able to play it. If you don't meet both of these conditions, then shadow of the past won't work in this situation. It just seems wierd to me that you need to include very specific cards in your deck and you hope you meet their conditions in order to make a scenario play properly. I really dislike it when scenarios force the player into playing very specific decks. One of the reasons I play customizable deck games is to try out wide varieties of strategies, and with this game in particular, thematic decks. Had the designers just included  a line like \"shadow: add this card to the staging area\" there would be no issue at all. Without it, the difficulty feels like it's been gimicked up through a bad luck card draw. It's too bad because I really like Redhorn Gate. I've spent a lot of time in the Rockies and this scenario is very evocative of high mountain expeditions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797218","commentId":797218,"userName":"Rapier1","timestamp":1369052475,"content":"Given that FFG have just released suggested cards to remove (if it makes the game more enjoyable for you).\n\n \n\nI think that this kind of rule bending is certaintly okay if the alternative is people not having fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797269","commentId":797269,"userName":"Cunir","timestamp":1369059836,"content":"i'm all for bending the rules too, if it makes it more enjoyable. it's only a game after all. that's actually one of the things that i like about this game… it's nice and easy to tweak a bit\n\ni dont like playing two-handed because it seems a bit artificial to me, so i've adjusted the solo rules a bit to let me play with 5 heroes at once. and i play with different \"nightmare\" rules too, for a campaign mode. i dont like the way you are supposed to hand in all your weapons and attachments at the end of the quest and start again… it doesn't seem much like a continuation doing that. especially when they make you keep your threat and wounds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84068-bending-the-rules-for-better-play-experience/?do=findComment&comment=797521","commentId":797521,"userName":"Eryx_UK","timestamp":1369125380,"content":"I'm still trying to find a way to modify the rules so that solo play is fairer and plays better. So far the only things I have found work so far is two resources for each hero at the start of the game (from the easy mode) and having four heroes but not counting the threat of the lowest one.\n\nI tried the idea of not needing a resource match to play cards, so you could build a deck from any spheres cards, but I found that you just end up with the same cards used all the time.\n\nStill trying ideas out but solo play is still a pain in the backside to play most quests."}]}