{"url":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/","title":"Passage through Mirkwood","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797118","commentId":797118,"userName":"Tyveil2","timestamp":1369034439,"content":"So I just got the game and trying to play it solo to learn.\n\nI have chosen Eowyn and Dunhere as my heros.\n\nWith Eowyn, I start with 4 willpower, I can discard a card each turn to add +1 willpower, and the deck comes with power of the lady attachment, which adds an additional +1.  So Eowyn effectively has 6 willpower.  The quest starts with 3 threat.  If I quest with all of my players, I'll have at a minimum 7 willpower, likely more, so I gain 4 progress+ per turn.  This means quest 1A takes 2 turns to complete, 2A takes 1 turn to complete.  Then I have to kill a spider.  Since my threat level starts at 17, I'm not getting attacked by anything that reaches staging, and the game takes only a handful of turns to complete.  Am I doing something wrong?  Completely underwhelmed by the difficulty of the game?  I haven't played through 3A yet, because the first 2 stages went so fast I figured I must be doing something wrong.  Please enlighten me.  Thanks.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797129","commentId":797129,"userName":"Khamul The Easterling","timestamp":1369036716,"content":"You shouldn't be always gaining 4 progress per turn cause remember you need to draw a card out of the encounter deck after you commit characters to the quest and then some stuff with more threat will come out.  So from what you said in your post, your not revealing caads from the encounter deck after you commit characters to the quest.  \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797130","commentId":797130,"userName":"Nickpes","timestamp":1369036807,"content":" \n\ntyveil said:\n\n If I quest with all of my players, I'll have at a minimum 7 willpower, likely more, so I gain 4 progress+ per turn.  \n\n\n\nafter you exhaust your heroes you have to draw a card from the encounter deck, so the threat always goes up  each turn unless you lower it by killing enemies etc.\n\nThis happens EACH turn, so you constantly add enemies or locations at the encounter stage\n\n \n\nI do not think you do that from what I read \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797131","commentId":797131,"userName":"Nickpes","timestamp":1369036849,"content":"hm khamul was 3 seconds faster  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797132","commentId":797132,"userName":"Tyveil2","timestamp":1369036964,"content":"I am revealing cards from the encounter deck.  They've been cards that have an effect and then get discarded.  The first draw was \"all players discard all event cards in their hands\".. no event cards in my hand = no negative effect.  2nd draw was \"all heroes take 1 point of damage\".. so all my heros took 1 point of damage.  Did I just get lucky on the draws?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797136","commentId":797136,"userName":"Khamul The Easterling","timestamp":1369038032,"content":"Well then you are doing it all right if the cards are just treacheries but thats rare that that would happen so it wont go like that agian most likely.  And 3b is the hardest part of the senario just to let you know.  Thats were the challenge is.  \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797143","commentId":797143,"userName":"Tyveil2","timestamp":1369038560,"content":"Thanks I'll play all the way through next time.  Just seemed like I must be doing something wrong as the quests flew by."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=797154","commentId":797154,"userName":"Kcall07","timestamp":1369040766,"content":"Also, when the enemies become engaged with you, you will have exhaust many of your characters to defend and attack, making it even harder to build up enough willpower to counter the threat in the staging area. You started with two heros and low starting threat, which is great to avoid the forest spider for a while. But you may struggle with just two in a typical game, unless you get some good allies out early. A lot of the enemies are really tough.\n\nSo yes, I think you got a lucky first couple of draws. But in other games (and indeed, as could have been later in that game) things can soon get out of hand. One thing you don't have to worry about in this game is a lack of challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=798098","commentId":798098,"userName":"mr.thomasschmidt","timestamp":1369268234,"content":"Welcome to the game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I also wanna encourage you and tell you that Passage through mirkwood is by far the easiest quest in all the game. The next ones are more difficult. Especially Journey down the Anduin. I think I tried it +30 times before beating it solo. And Escape from Dol G. is the toughest solo quest. Using only the core set I think it's only doable if you play 2 handed with 3 heroes each. After that the difficulties vary very much. Great game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=798543","commentId":798543,"userName":"Tyveil2","timestamp":1369389853,"content":"Thanks for the responses.\n\nI changed my deck to be a 50 card deck and have mixed 2 types to do so (Leadership and Spirit) using bits from my second core set to bump my good cards to 2 or 3x each.  I've played Passage through Mirkwood two more times and have beat it both times.  I'm getting a better feel for the game and the theme/flavor is very rich.  It's been fun but so far not real challenging, I haven't had a single hero die.  I think the high spirit strengths from the spirit sphere makes passage pretty easy.  It's probably time to move on to the next quest.  I also have the Khazad Dum expansion and Watcher on the Water."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=798587","commentId":798587,"userName":"richsabre","timestamp":1369395183,"content":"be prepared for a completely different experience in the other quests - you shall certainly find that challenge there\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=798870","commentId":798870,"userName":"Tyveil2","timestamp":1369471989,"content":"Tried the Anduin quest twice and I get destroyed in the first few turns.  Yikes!  That hill troll is mean!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=798960","commentId":798960,"userName":"richsabre","timestamp":1369494110,"content":"tyveil said:\n\nTried the Anduin quest twice and I get destroyed in the first few turns.  Yikes!  That hill troll is mean!\n\n\n\nits a tough one when you first go at it- but it really is a great quest. try searching in 'drowning on the anduin FFG' for a tip thread\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=798994","commentId":798994,"userName":"asfaloth","timestamp":1369500798,"content":"Sorry about my english.\n\nRemember, characters commited to a quest get exhausted till the end of the round so If you only have two heroes I really find strange that you have enough strength to deal with all the enemies and locations so easily. You can have one lucky quest commintment phase with discarded treacheries and Threat value 0 that time, but eventually after two or three rounds, you will have more enemies and locations on the stage area adding their threat values up and ready for attacking you in the combat phase. You will need your heroes and allies to defend and attack them therefore your heroes (specially Dunhere) will not can to commit to the quest freely.\n\nAnyway \"Passage through Mirkwood\" is very easy, like a tutorial to learn the game although I think that with only two heroes (hence only two resources tokens, two characters at the beginning to commit to the quest, defend etc)  there must be some difficulty some time.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84091-passage-through-mirkwood/?do=findComment&comment=799311","commentId":799311,"userName":"dicjones","timestamp":1369602473,"content":"I just finished passage through mirkwood for a second time. First time, I came close with the Tactical deck and the three core set heroes. I just got swamped with locations that I couldn't get out of the staging area. Second attempt I was sitting at 46 threat with 8 progress tokens left to finish. I figured my goose was cooked. Drew Gandalf from my player deck and my oh my how the momentum shifted. I beat it the next turn.  Seems to me the tactics deck takes a few turns to get going but once you get some allies down it can really steamroll the quest deck."}]}