{"url":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/","title":"Druadan Forest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798933","commentId":798933,"userName":"SiCK_Boy","timestamp":1369488835,"content":"Has the new expansion been spoiled or discussed somewhere? I'm asking because I picked it up yesterday (went to get the latest SWLCG pack and found out they had both the ANR and LOTR latest expansions as well). So, any question about it (haven't played it yet), just shoot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798935","commentId":798935,"userName":"Dain Ironfoot","timestamp":1369489267,"content":"it's not supposed to be in stores until 5/31, according to FFG's page - i've not seen anyone who has it or discuss it on any of the various message boards.\n\nStar Wars was supposed to be out yesterday.\n\nso, you are saying you have the 2nd AP?! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798941","commentId":798941,"userName":"Jekzer","timestamp":1369490818,"content":"Of course, if you want to share with us the knowledge about the new AP …\n\n1) Hero, new player cards.\n\n2) DL of the quest and what is that prowl mechanic.\n\n3) Other details that you want to share, when you play it (fun, difficult, easier than TSF, if it continues the plot on the rulesheets, just the way TSF did…).\n\nJust what you want to share!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798959","commentId":798959,"userName":"richsabre","timestamp":1369494044,"content":"really? thats very fast….my supplier only got stewards in last week!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798966","commentId":798966,"userName":"Gizlivadi","timestamp":1369496113,"content":"You got Druadan Forest? Mind if you spoil it for us? Just the player cards for now… I'm pretty interested."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798971","commentId":798971,"userName":"SiCK_Boy","timestamp":1369497117,"content":"Mirlonde (Unique)\n\nHero – Lore\n\n8 threat\n\n2/2/1/3\n\nSilvan\n\nEach hero you control with a printed Lore resource icon gets -1 threat cost.\n\n \n\nNew female hero… not sure who she is (I’m sure someone will have the reference), however. And she’s the first of a recurring theme in player cards favoring playing with a maximum number of heroes sharing a single printed sphere icon.\n\n \n\nForlong (Unique)\n\nAlly – Leadership\n\n3 cost\n\n1/1/1/3\n\nOutlands\n\nWhile you control Outlands allies that belong to 4 different spheres, ready Forlong af the beginning of each phase.\n\n \n\nStrength of Arms\n\nEvent – Leadership\n\n2 cost\n\nPlay only if each hero you control has a printed Leadership resource icon.\n\nAction: Ready each ally in play.\n\n \n\nMighty Prowess\n\nAttachment – Tactics\n\n1 cost\n\nSkill\n\nAttach to a Tactics hero. Limit 1 per hero.\n\nResponse: After attached hero attacks and destroys an enemy, deal 1 damage to another enemy that shares a trait with the enemy just destroyed.\n\n \n\nTrained for War\n\nEvent – Tactics\n\n2 cost\n\nPlay only if each hero you control has the printed Tactics resource icon.\n\nAction: Until the end of the phase, if the current quest has no keyword it gains battle. (Characters quest using Attack instead of Willpower.)\n\n \n\nSylvan Refugee\n\nAlly – Spirit\n\n1 cost\n\n2/0/0/1\n\nSilvan\n\nForced: After a character leaves play, discard Sylvan Refugee.\n\n \n\nAgainst the Shadow\n\nEvent – Spirit\n\n2 cost\n\nPlay only if each hero you control has the printed Spirit resource icon.\n\nAction: Until the end of the phase, Spirit characters use their Willpower instead of Defense.\n\n \n\nHarbor Master\n\nAlly – Lore\n\n3 cost\n\n1/2/0/2\n\nNoldor\n\nResponse: After a card effect adds any number of resources to the resource pool of a hero you control, Harbor Master gains +1 Defense until the end of the round.\n\n \n\nAdvance Warning\n\nEvent – Lore\n\n2 cost\n\nPlay only if each hero you control has a printed Lore resource icon.\n\nAction: Until the end of the phase, enemies do not make engagement checks.\n\n \n\nWhite Tower Watchman\n\nAlly – Neutral\n\n3 cost\n\n1/0/2/3\n\nGondor\n\nIf each hero you control belongs to the same sphere of influence, you may assign damage from undefended enemy attacks to White Tower Watchman instead of a hero your control.\n\n \n\nAs for the quest, it’s difficulty level 6. I won’t describe all the cards, but the basic story is that you follow the bad guy from Steward’s Fear into the forest, only to find them dead, butchered by the Wose. You then need to escape the forest, but are taken into a major ambush before you can leave. In the final battle, instead of killing the enemy, you fight using Willpower as you actually try to convince these woodmen that you aren’t one of the bad guys.\n\n \n\nProwl X: When a card with prowl is revealed from the encounter deck, the players, as a group, must discard the specified number of resources from their heroes’ resource pools. If the players do not have enough resources to match the specified value, then they must discard as many resources as they can.\n\n \n\nThe rule insert also gives a bit of heads up regarding the next quest. As you leave the forest, you spot columns of smoke from various farmsteads and towns in Anorien. Evil has come to these lands and it’s people will be in need of help… leading to Encounter at Amon Din.\n\n \n\nAs you can guess, the encounter deck is full of cards abusing you if you don’t have resources on your heroes. There’s also a good number of enemies with the Archery keyword.\n\n \n\nThe big bad guy is Drû-buri-Drû. You can’t defend with allies against him. If he’s in the victory display, all characters have +1 willpower and +1 defense. You must have him in your victory display. The last stage of the quest is a Siege quest, and as indicated, you need to fight enemies with your willpower (drû-buri-drû being the wose’s chief, if you beat him, he helps you convince the rest of the tribe to leave you in peace, hence the boost your characters get in order to mop up that last stage).\n\n \n\nEncounter cards include: Druadan Drummer, Druadan Elite, Druadan Hunter, Druadan Thief, Ancestral Clearing, Garden of Poisons, Glade of Cleansing, Men in the Dark, Stars in Sky and Leaves on Tree.\n\nThe quest is played using Druadan Forest and Brooding Forest (the little leaf icon from Heirs of Numenor).\n\n \n\nAny other question, just ask!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798974","commentId":798974,"userName":"Gizlivadi","timestamp":1369497570,"content":"Thanks for the spoiler! But wow, a ffg created new hero… that's… dissapointing. But anyway, some of the other cards seem pretty good. Won't judge just yet I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798976","commentId":798976,"userName":"TheLightdarker","timestamp":1369497815,"content":"Welp, looks like Forlong is easily a contender for best Ally in the game. I don't want to proclaim \"broken beyond all comprehension\" quite yet, but wow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798979","commentId":798979,"userName":"Dain Ironfoot","timestamp":1369498406,"content":"TheLightdarker said:\n\nWelp, looks like Forlong is easily a contender for best Ally in the game. I don't want to proclaim \"broken beyond all comprehension\" quite yet, but wow.\n\n\n\nyup. it's shocking to me that, if haldir, gildor, and beorn are 4, 5, 6 and aren't nearly as strong, that this dude is only 3.\n\ni didn't want to try outlands before - now i really don't want to. haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798981","commentId":798981,"userName":"richsabre","timestamp":1369498787,"content":"thanks!  - this cycle is really throwing some curve balls isnt it?!!\n\nwhats the art like for the hero?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798983","commentId":798983,"userName":"hildargo","timestamp":1369499280,"content":"FFG's new Easy Mode: play Outlands. sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif] In all seriousness, looks like a pretty solid AP for the player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798984","commentId":798984,"userName":"SiCK_Boy","timestamp":1369499473,"content":"The hero is drawn by Magali Villeneuve. It's a women, standing up but slightly turned (her body facing the right, with her head turned toward the viewer). She's got a sword strapped to her back. There are mountains (rocky area) and a foaming river in the background (could be the ford near Elron'd place). She wears a brown or dark green garment; nothing much elfic about her except the ears. Long flowing brown hairs and she's got some kind of shale (not sure about the word) floating in the wind along with her hairs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798986","commentId":798986,"userName":"richsabre","timestamp":1369499609,"content":"SiCK_Boy said:\n\nThe hero is drawn by Magali Villeneuve. It's a women, standing up but slightly turned (her body facing the right, with her head turned toward the viewer). She's got a sword strapped to her back. There are mountains (rocky area) and a foaming river in the background (could be the ford near Elron'd place). She wears a brown or dark green garment; nothing much elfic about her except the ears. Long flowing brown hairs and she's got some kind of shale (not sure about the word) floating in the wind along with her hairs.\n\n\n\nsounds great…..thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798989","commentId":798989,"userName":"Gizlivadi","timestamp":1369499911,"content":"Ok, so is Mirlonde affected by her own effect? I suppose that's the case, so she essentially costs 7."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798992","commentId":798992,"userName":"SiCK_Boy","timestamp":1369500546,"content":"Yes, she is. But she still has crappy stats… When I first saw her, I thought: Oh, maybe there'll be a couple secrecy cards in there! But instead, all you get is these \"play a single sphere\" cards, which I can't say I find all that impressive except for the Leadership one. There could be a combo somewhere I don't get, but honestly, I didn't find the player cards all that impressive (ok, I'm sure going to try Forlong, but besides that? Mighty Prowess might be nice in the Khazad Dum scenarios with all these orcs…)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798993","commentId":798993,"userName":"richsabre","timestamp":1369500760,"content":"well i can see the one that readies allies in play being great for dwarves…and i think many of the cards will become better as the cycle progresses. so far i am happy with what i have seen from this cycle. it feels as if the game is really 'charging forward'…and the design team are doing a great job\n\nthanks for sharing by the way ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=798996","commentId":798996,"userName":"richsabre","timestamp":1369500892,"content":"TheLightdarker said:\n\n \n\nWelp, looks like Forlong is easily a contender for best Ally in the game. I don't want to proclaim \"broken beyond all comprehension\" quite yet, but wow.\n\n \n\n \n\nat first look i agree- but the stats are low. i mean, its +1 to wilpower in questing phase, then you can have him defend and if he survives then he can attack with 1 attack\n\nnow of course this can be boosted, and i think this is where the power lies…but certainly not all that powerful on its own\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799006","commentId":799006,"userName":"hildargo","timestamp":1369502919,"content":"I'm really excited to put together a mono-Lore deck. Mirlonde/Beravor/Aragorn for a starting threat of 27. I think that's pretty good, especially with the ablities and stats of the other two heroes. You get 3 cards for one resource with Mithrandir's Advice. Toss in Love of Tales with some songs for some resource acceleration and those key cards in other spheres. Not to mention A Good Harvest in case you need to play some of those cards but you don't have the songs in play yet. Just some ideas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799017","commentId":799017,"userName":"Redblock","timestamp":1369506545,"content":"I wonder if harbor master effect is cumulative (he gets + 1 defence for each card). If it is there is space for combo making.  Overall I like this pack, it gives new direction to decbuilding (monosphere) and still adds to some existing decks, not like first one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799021","commentId":799021,"userName":"Ohnomycocoa","timestamp":1369507157,"content":"There's a minor combo with silvan tracker And Mironde - if it's in play she will heal one damage when readied as she is silvan. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799025","commentId":799025,"userName":"kyrie","timestamp":1369507894,"content":"The new lady hero is kind of a let down… I would be tempted to use her in a mono-lore deck is she reduced each threat by 2 instead of 1. That would make a mono-lore deck have -6 threat, instead of -3. As someone mentioned already, Elrond's Counsel does that for free! I don't think -6 threat would have been overpowered, seeing how that would be the only ability the hero would give right at the start of the game (perhaps bring you down to secrecy level). -3 feels like a waste of a hero slot…but these are just initial thoughts. I am sure there will be some who can make a good deck with her. If so, Iook foward to seeing those!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799026","commentId":799026,"userName":"richsabre","timestamp":1369508105,"content":"you must remember that silvan is perhaps the poorest devleoped race in the game. in time i see that she shall become more useful….afterall, thinking at it like this- FFG pruposely created this character..they had no real narrative to go on or anything, therefore for them to make a weak hero seems a bit too much of an oversight for me\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799027","commentId":799027,"userName":"Tracker1","timestamp":1369508175,"content":"richsabre said:\n\nTheLightdarker said:\n\n \n\nWelp, looks like Forlong is easily a contender for best Ally in the game. I don't want to proclaim \"broken beyond all comprehension\" quite yet, but wow.\n\n \n\n \n\nat first look i agree- but the stats are low. i mean, its +1 to wilpower in questing phase, then you can have him defend and if he survives then he can attack with 1 attack\n\nnow of course this can be boosted, and i think this is where the power lies…but certainly not all that powerful on its own\n\nrich\n\n\n\nrichsabre said:\n\nTheLightdarker said:\n\n \n\nWelp, looks like Forlong is easily a contender for best Ally in the game. I don't want to proclaim \"broken beyond all comprehension\" quite yet, but wow.\n\n \n\n \n\nat first look i agree- but the stats are low. i mean, its +1 to wilpower in questing phase, then you can have him defend and if he survives then he can attack with 1 attack\n\nnow of course this can be boosted, and i think this is where the power lies…but certainly not all that powerful on its own\n\nrich\n\n\n\nBy the time his ability starts to work his stats will at the very minimum be: 2/2/2/ 3 or 4 depending on if you have the hunter or herdsmen in.  That could take a few rounds to set up before his ability will work, but by mid game he'll be solid.  He will almost certainly have 3 or 4 for each stat category by the end of the game, readying each phase.  Crazy, it will be like the OHaUH Gandalf, except each phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799028","commentId":799028,"userName":"kyrie","timestamp":1369508256,"content":"richsabre said:\n\nyou must remember that silvan is perhaps the poorest devleoped race in the game. in time i see that she shall become more useful….afterall, thinking at it like this- FFG pruposely created this character..they had no real narrative to go on or anything, therefore for them to make a weak hero seems a bit too much of an oversight for me\n\nrich\n\n\n\n \n\nThat's true! Perhaps this could mean we have some sweet silvan synergy to look forward to in the near future!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799030","commentId":799030,"userName":"richsabre","timestamp":1369508316,"content":"ah- i overlooked the fact he was outlands himself (doh….)\n\n@kyrie-i am quite sure that we shall see more silvan in this cycle. we have seen predictions for them for some time, and its good to see them\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799033","commentId":799033,"userName":"Pharmboys2013","timestamp":1369510534,"content":"I am intrigued but somewhat let down by the new hero. If she had better stats or was the -2 per hero  I would be much more excited but -3 total is kind of underwhelming that's practically 1 treachery or 1 phase of unsuccessful questing and then that's negligible. Who am I kidding tho, I'll still give her a shot especially if the art is good. I'm glad the silvan trait is slowly being developed more as well. Crossing my fingers extra hard for a lore Haldir hero in the 5th AP. \n\n1 last note, I'm not unhappy that they're making solo sphere themes heroes (though I don't prefer them) but if they make Faramir's ability solo sphere focused ill be crushed "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799085","commentId":799085,"userName":"Xaanalinos","timestamp":1369527944,"content":"Actualy its realy nice that they want us to created mono sphere decks. Its way easier to create 4 decks without buying another expansions for 3-4 players. Already we got for spirit - rohan deck (questing like crazy and now even some def also), leadership - outland deck (hirluin + theodred) which is quite nice for solo playing and tactic eagle deck. Now we could make lore deck with new hero + bilbo secrecy deck or just add denethor for some taking enemies. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799087","commentId":799087,"userName":"TheLightdarker","timestamp":1369528358,"content":"richsabre said:\n\nyou must remember that silvan is perhaps the poorest devleoped race in the game. in time i see that she shall become more useful….afterall, thinking at it like this- FFG pruposely created this character..they had no real narrative to go on or anything, therefore for them to make a weak hero seems a bit too much of an oversight for me\n\nrich\n\n\n\n\n\nI think someone is forgetting about Esgaroth and Dale! sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799088","commentId":799088,"userName":"Zalrus9","timestamp":1369528578,"content":"TheLightdarker said:\n\nrichsabre said:\n\n \n\nyou must remember that silvan is perhaps the poorest devleoped race in the game. in time i see that she shall become more useful….afterall, thinking at it like this- FFG pruposely created this character..they had no real narrative to go on or anything, therefore for them to make a weak hero seems a bit too much of an oversight for me\n\nrich\n\n \n\n\n\nI think someone is forgetting about Esgaroth and Dale! sonreir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/sonreir.gif]\n\n \n\n\n\n \n\nNot to mention beorning!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799097","commentId":799097,"userName":"lleimmoen","timestamp":1369533105,"content":"Well, I was a bit hesitant to comment this early but I will.\n\nMirlonde seems very good to me. Again, not outside a mono-Lore (or major-Lore in some rare combo, perhaps with either Glorfindel). Her stats are very decent, considering she costs 7, right? 2 willpower, 2 attack for 7 is good, especially once we get more Silvan love. It is bound to be coming though we might wait some time. Silvan Tracker seems a must in a mono-Lore with Mirlonde. The problem for the majority of Silvan allies is the 1 hp, and I do wonder whether we see a card that boosts that in the future. They might have a hard time keeping up with the other quickly expanding factions, if we don't.\n\nForlong is good but I don't think I'll play more than a copy. From my experience, though my deck is quite good at putting Outlands into play, it is often usually mid-game when I have an Outlands ally from every sphere. Of course Forlong is good without the extra readying, given the more hp. The readying will be good for A Very Good Tale, for instance, but since you will have already had many Outlands in play, that might not matter too much. So really, what you get will usually be one extra action (quest + combat).\n\nI am surprised to see Leadership and Lore mono-events being what they are. I was expecting something to deal with the usual weaknesses of the spheres. Like card draw for Leadership and especially resource acceleration for Lore. The two events given surely have lots of potential but for now Leadership-Lore Outlands decks seems too good to me to pass for either mono-deck.\n\nI always love to see more Elves. However, they are quite random in what they do, and again, with the existing expanded factions, Silvan and Noldor might have to wait to be truly competitive (though of course you can do a hell of a lot with Glorfindel, or Elrond to an extent). The Refuge is especially intriguing, 2 willpower for the cost of 1, just so very nice.\n\nAnd I was very much looking forward to the White Tower Guard, but again, that was when I was thinking of mono-Leadership Gondor deck, but now with the Gondor trait being still under-developed, I don't have such a deck.\n\nThe Tactics attachments seems pretty underwhelming, but I'm might be missing a combo here, perhaps a future one.\n\nOverall, I like the cards very much, as always pretty much, the one thing I'm still missing in this cycle is more Gondor. Now, there won't be a Gondor hero coming next, so I hope for Faramir and another Gondorian in packs 4 & 5. And especially I hope in many more allies, and other synergies for the great nation. Cause as it is, their Outlands regions seem just so much more powerful than their original main force."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799117","commentId":799117,"userName":"klaymen_sk","timestamp":1369543437,"content":"SiCK_Boy said:\n\nThe hero is drawn by Magali Villeneuve.\n\n\n\n \n\nSo again a beautiful hero art as all Magali's pictures are. Nice. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nOhnomycocoa said:\n\nThere's a minor combo with silvan tracker And Mironde - if it's in play she will heal one damage when readied as she is silvan. \n\n\n\n \n\nAnd if more Silvan Trackers are in play, she'll get more healing, so she can soak some attacks in such case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799122","commentId":799122,"userName":"DevastazioneH88","timestamp":1369545444,"content":"I have to say I'm quite disappointed…I may like that she's a made up character (though there are so many characters in tolkien lore…well maybe not many female characters…anyway)…but her ability is really poor (good stats though)…I would have liked her much more if her ability would be minus 1 threat to lore or silvan heroes (choose 1 at the beginning of each game)…that would be great, you could use her efficiently with legolas or any other silvan that will come out…(granting us a few choices for a good secrecy silvan deck)…but like this…just disappointing…in a mono lore she might be useful…but in a mono lore where will you get resources ? who will you kill enemies with ? (yeah there are some decent fighters but what when you have to deal a lot of damage ?) how will you ready your heroes ?…she might be good in multi but in solo I don't see her as a playable character…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799124","commentId":799124,"userName":"Rapier1","timestamp":1369547234,"content":"What I want to know is how do you have this pack already?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799138","commentId":799138,"userName":"Ohnomycocoa","timestamp":1369554028,"content":"klaymen_sk said:\n\nSiCK_Boy said:\n\n \n\nThe hero is drawn by Magali Villeneuve.\n\n \n\n \n\n \n\nSo again a beautiful hero art as all Magali's pictures are. Nice. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nOhnomycocoa said:\n\n \n\nThere's a minor combo with silvan tracker And Mironde - if it's in play she will heal one damage when readied as she is silvan. \n\n \n\n \n\n \n\nAnd if more Silvan Trackers are in play, she'll get more healing, so she can soak some attacks in such case.\n\n\n\nNice !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799141","commentId":799141,"userName":"SiCK_Boy","timestamp":1369556210,"content":"Rapier: It was available at my FLGS. I seriously have no idea why they had it this early. I live in Gatineau (Ottawa area), Canada. Normally, expansion packs are available at the date FFG posts the \"available now\" news on their front page; I've seen it happen a couple time when it was available a day or two earlier, but that was usually after some preview / spoiler had already surfaced somewhere (and I've had case where it was late by as much as a week). In my case, I went to the store to pick up the latest Star Wars FP that was announced on Friday, and I just saw they not only had it, but also The Druadan Forest and Future Proof from Netrunner (which is also theoretically supposed to release on the 31st). Which was great since the store pays the taxes for you if you buy 3 boardgames (LCG counts as boardgame at that store), so I got all 3."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799146","commentId":799146,"userName":"SiCK_Boy","timestamp":1369557203,"content":"I'm really not familiar with image hosting; if someone has better instructions on how to share images, let me know. In all cases, here's a link to a Flickr account I just created: http://www.flickr.com/photos/96454752@N05/8841180232/ [http://www.flickr.com/photos/96454752@N05/8841180232/]. Let me know if it works. I have scans of all the cards (I scan them for use on OCTGN). Not sure if I'll upload them all, but since there were questions about the new hero, here it is. Feel free to repost if you can somehow make it appear directly in the forum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799153","commentId":799153,"userName":"richsabre","timestamp":1369559076,"content":"Thanks Sickboy- looks great\n\n8841180232_7622bcc199_o.jpg [http://farm6.staticflickr.com/5467/8841180232_7622bcc199_o.jpg]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799155","commentId":799155,"userName":"Redblock","timestamp":1369559620,"content":"Art is really great, and link works, so waiting for other card scans.\n\n \n\nMono lore deck with her can be very strong. My vision is her, Denethor and Bifur for starting threat of 20. Deck Idea is simple, 3 copies of Rivendell minstrel to fetch songs, any number of songs from sphere, or multiple spheres you want to use, and after that you can add whatever cards you want, can work as 3 character secrecy deck with spirit added. Bifur is good in this deck as song target."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799157","commentId":799157,"userName":"richsabre","timestamp":1369559905,"content":"if you want to do the links then go onto the image,\n\nclick one of the sizes and then right click on the image.\n\nthen click view image\n\nthen copy the URl\n\nthen go onto FFG site and new post.\n\nthen at top right there is add image icon\n\npaste the url into the bar\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799165","commentId":799165,"userName":"Pharmboys2013","timestamp":1369561517,"content":"Wow that art is fantastic. Thanks for posting. Def gonna try and use her now"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799229","commentId":799229,"userName":"Gizlivadi","timestamp":1369578797,"content":"The player cards are not very outstanding, but then again most of those will actually see play I suppose, if not all of them. They're not amazing, except for Forlong but I don't see any completely useless card. And that art, man, I will buy this at least for the art only. However I'm sad to see that the Gondor trait got shafted again. By the second Dwarrodelf AP, Dwarves were already a powerful archetype, and this isn't the case for Gondor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799267","commentId":799267,"userName":"CJMatos","timestamp":1369586222,"content":"Gizlivadi said:\n\n \n\nThe player cards are not very outstanding, but then again most of those will actually see play I suppose, if not all of them. They're not amazing, except for Forlong but I don't see any completely useless card. And that art, man, I will buy this at least for the art only. However I'm sad to see that the Gondor trait got shafted again. By the second Dwarrodelf AP, Dwarves were already a powerful archetype, and this isn't the case for Gondor.\n\n \n\n \n\nI see Silvan Refugee getting litle play time…\n\nInspite being a 2 willpower for 1 cost, the ability is a bit hard…\n\n \n\nEdit: I consider it being worst than Escort from Edoras (has a similar effect and quests at 4 willpower) and West Road Traveller…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799320","commentId":799320,"userName":"Glaurung","timestamp":1369607088,"content":"Gizlivadi said:\n\nThe player cards are not very outstanding, but then again most of those will actually see play I suppose, if not all of them. They're not amazing, except for Forlong but I don't see any completely useless card. And that art, man, I will buy this at least for the art only. However I'm sad to see that the Gondor trait got shafted again. By the second Dwarrodelf AP, Dwarves were already a powerful archetype, and this isn't the case for Gondor.\n\n\n\nAnd i think is right. We dont need some more powerful broken think. Now players cards is not to powerful but quite interesting to build up something new!\n\nI like all silvan cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799329","commentId":799329,"userName":"Gizlivadi","timestamp":1369610275,"content":"CJMatos said:\n\n \n\nGizlivadi said:\n\n \n\nThe player cards are not very outstanding, but then again most of those will actually see play I suppose, if not all of them. They're not amazing, except for Forlong but I don't see any completely useless card. And that art, man, I will buy this at least for the art only. However I'm sad to see that the Gondor trait got shafted again. By the second Dwarrodelf AP, Dwarves were already a powerful archetype, and this isn't the case for Gondor.\n\n \n\n \n\nI see Silvan Refugee getting litle play time…\n\nInspite being a 2 willpower for 1 cost, the ability is a bit hard…\n\n \n\nEdit: I consider it being worst than Escort from Edoras (has a similar effect and quests at 4 willpower) and West Road Traveller…\n\n \n\n \n\nIt's funny they made this card. I always thought that characters in this game are mostly of very little value, with all those cheap chump blockers you don't mind sending to their deaths… it doesn't feel right to me, and having so many of those makes this card so much worse. If only characters were harder to kill… But oh well, I see myself using the refugee in some elven deck I guess. Elves need cheap questers too, not just Rohan.\n\nAlso, I see this card now in a secrecy deck (hope they develop secrecy better in the future) as the cheap quester so vital in the first few turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799346","commentId":799346,"userName":"leptokurt","timestamp":1369614110,"content":"I'm quite happy about the new cards. Milronde might not have the best stats, but her ability is helpful. Mono lore decks are already pretty strong, but mono lore decks with a low starting threat - wow!\n\n \n\nNow I only have to wait until August before this stuff will be sold in Germany.\n\n \n\n*shakes fist at translators*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799347","commentId":799347,"userName":"lleimmoen","timestamp":1369614520,"content":"I find pretty much all cost 1 allies interesting just for the cost. I wonder whether we shall see a 0 cost ones in the future. I often play Citadel Custodian for 0 but it is obviously not the same thing. As for the Refugee, I am still bound to think we shall see some sort of Silvan (or Noldor) protection, safety cushion of sorts, thus their strategy based on characters staying in play (as opposed to leaving it - as with Rohan or Eagles) will have a solid ground in Silvan Refugee."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799364","commentId":799364,"userName":"klaymen_sk","timestamp":1369623434,"content":"Gizlivadi said:\n\nThe player cards are not very outstanding, but then again most of those will actually see play I suppose, if not all of them. They're not amazing, except for Forlong but I don't see any completely useless card. And that art, man, I will buy this at least for the art only. However I'm sad to see that the Gondor trait got shafted again. By the second Dwarrodelf AP, Dwarves were already a powerful archetype, and this isn't the case for Gondor.\n\n\n\n \n\nFFG have three APs to change it (one was metioned that it will enhance Outlands) and I hope they will do so.\n\n \n\nGlaurung said:\n\nAnd i think is right. We dont need some more powerful broken think. Now players cards is not to powerful but quite interesting to build up something new!\n\nI like all silvan cards.\n\n\n\n \n\nWho says anything about broken cards? Proper playtesting would help. Also Outlands decks are nothing to sneeze at. At the expense of developing Gondor, I may add."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799375","commentId":799375,"userName":"muemakan","timestamp":1369629433,"content":"leptokurt said:\n\nI'm quite happy about the new cards. Milronde might not have the best stats, but her ability is helpful. Mono lore decks are already pretty strong, but mono lore decks with a low starting threat - wow!\n\n \n\nNow I only have to wait until August before this stuff will be sold in Germany.\n\n \n\n*shakes fist at translators*\n\n\n\n \n\n \n\nYes, what a pitty. The German players still only have \" Heirs of Numenor \" as ther latest product. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799386","commentId":799386,"userName":"richsabre","timestamp":1369631692,"content":"lleimmoen said:\n\nI find pretty much all cost 1 allies interesting just for the cost. I wonder whether we shall see a 0 cost ones in the future. I often play Citadel Custodian for 0 but it is obviously not the same thing. As for the Refugee, I am still bound to think we shall see some sort of Silvan (or Noldor) protection, safety cushion of sorts, thus their strategy based on characters staying in play (as opposed to leaving it - as with Rohan or Eagles) will have a solid ground in Silvan Refugee.\n\n\n\ni also like 1 cost allies- they are very useful for when you have the likes of elrond in a deck….in my lore/spirit deck i can include 1 cost allies from any sphere and be able to play them immediatly without the need for songs\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799400","commentId":799400,"userName":"richsabre","timestamp":1369639923,"content":"what keywords are used on the quest? the one where you fight with willpower- is that 'ambush' (i can remember)\n\nthanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799467","commentId":799467,"userName":"SiCK_Boy","timestamp":1369672386,"content":"Siege (meaning you quest using Defense instead of Willpower)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799471","commentId":799471,"userName":"fgerken","timestamp":1369674972,"content":"leptokurt said:\n\nI'm quite happy about the new cards. Milronde might not have the best stats, but her ability is helpful. Mono lore decks are already pretty strong, but mono lore decks with a low starting threat - wow!\n\n \n\nNow I only have to wait until August before this stuff will be sold in Germany.\n\n \n\n*shakes fist at translators*\n\n\n\nThe problem that the stuff isnt out in germany yet, isnt the fault of the translator. Its FFG printing policy because of the success of Star Wars and Netrunner. Heidelberger is wating for its stuff, the translations are all done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799522","commentId":799522,"userName":"Pharmboys2013","timestamp":1369694958,"content":"hmm. siege makes it instantly tougher to quest through (althought maybe not for mono tactics).   Mono spirit can also be quite good at this using their new event: against the shadow.\n\nvery excited to play it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799556","commentId":799556,"userName":"Narsil0420","timestamp":1369714766,"content":"I wanted to add my two cents about Mirlonde. Although we always want our heroes to have some stunning power, It's also good to get some low threat heroes as well. You can't play with all Elronds and Aragorns or your threat will be through the roof! It's nice to have a good selection of minor heroes as well to pair with the big boys. Mirlonde is a beautiful addition in that sense and she even addresses the downside of using other big heroes.\n\nI'm starting to plan an Elrond/Mirlonde deck with Silvan Tracker for some uber healing that can soak up archery damage!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799572","commentId":799572,"userName":"klaymen_sk","timestamp":1369720540,"content":"muemakan said:\n\nYes, what a pitty. The German players still only have \" Heirs of Numenor \" as ther latest product. \n\n\n\n \n\nWhat? \"Only\" Heirs of Númenor? Czech translation has only the start of the first cycle coming out. Luckily I play the English version, but those who don't speak English in Czech Republic and Slovakia are pretty much left only with the core set for now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=799661","commentId":799661,"userName":"Glaurung","timestamp":1369742845,"content":"Narsil0420 said:\n\nI wanted to add my two cents about Mirlonde. Although we always want our heroes to have some stunning power, It's also good to get some low threat heroes as well. You can't play with all Elronds and Aragorns or your threat will be through the roof! It's nice to have a good selection of minor heroes as well to pair with the big boys. Mirlonde is a beautiful addition in that sense and she even addresses the downside of using other big heroes.\n\nI'm starting to plan an Elrond/Mirlonde deck with Silvan Tracker for some uber healing that can soak up archery damage!\n\n\n\nGood point. agree"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=800178","commentId":800178,"userName":"Glaurung","timestamp":1369875960,"content":"So please to be so kind ane tell us about a encounter deck and quest cards? How is it ? Interesting mechanic? What about feeling when you play?\n\nthis really feels like you in the forest and so on……..thanks in advance"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=800242","commentId":800242,"userName":"SiCK_Boy","timestamp":1369893851,"content":"Sadly, I cannot tell you that for the simple reason that I haven't played the scenario yet. In fact, I haven't played any scenarios released after Foundations of Stones, even though I've kept buying expansions as they came out. I only restarted playing recently and I've been trying updated decks against the earlier scenarios. I haven't seen a lot of demand for spoiled encounter / quest cards, so I'm not sure it's needed. If you have specific questions, I can answer them, but I think I gave a good overview of the quest earlier in this post already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=800695","commentId":800695,"userName":"Mr Coffee","timestamp":1370023617,"content":"Harbor Master\n\nAlly – Lore\n\n3 cost\n\n1/2/0/2\n\nNoldor\n\nResponse: After a card effect adds any number of resources to the resource pool of a hero you control, Harbor Master gains +1 Defense until the end of the round.\n\n \n\nWell, with the new Lore hero helping create a possible secrecy deck in the future, this ally would look pretty good paired in a deck with Theodred (and Glorfindel to stay in secrecy for at least a round), Resourceful, and Steward of Gondor… That's a fairly easy/quick way of getting +3 defense on this guy EVERY turn… Other possibilities off the top of my head- A Tactics/Lore (combat/healing deck) that includes Horn of Gondor.  Shoot, even just moving resources around (Parting Gifts, Errand Rider) should qualify for giving him a defensive buff…  then there's Zigil Miner, etc….\n\nAnd he should be an auto-include in a deck with Bifur!\n\n \n\n \n\nWhite Tower Watchman\n\nAlly – Neutral\n\n3 cost\n\n1/0/2/3\n\nGondor\n\nIf each hero you control belongs to the same sphere of influence, you may assign damage from undefended enemy attacks to White Tower Watchman instead of a hero your control.\n\n \n\nPeople can hate on him if they want, but with the shift to Monosphere decks that the game seems to be trying to get us to do, this guy seems like more than just canon fodder.  I see \"action potential\" here.  That's one less hero you need to assign as a defender per turn that can either Quest or Attack…  For example, two enemies on the table.  You can defend one with the Watchman, then (assuming he survives and takes little or no damage from a lesser enemy), you can let the second enemy go undefended and just take the damage to Watchman, freeing up your heros to get an extra action to attack the enemies back… He's a nice situational answer to those pesky tentacles that like to attack undefended as well (Watcher in the Water)… lol. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=800704","commentId":800704,"userName":"richsabre","timestamp":1370025202,"content":"there was some talk over on the rules forum so i just wanted to point out (incase some hadnt seen it) that the tower guard works with song card…..i asked about good meal and songs and caleb said that songs work fine so the same applies for him\n\nalso….i thought the harbour master was a female? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=800940","commentId":800940,"userName":"Mr Coffee","timestamp":1370107542,"content":"richsabre said:\n\nthere was some talk over on the rules forum so i just wanted to point out (incase some hadnt seen it) that the tower guard works with song card…..i asked about good meal and songs and caleb said that songs work fine so the same applies for him\n\nalso….i thought the harbour master was a female? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n\n\n \n\nGood news about the songs/spheres then!  (makes sense since it doesn't appear that his game text cites \"printed\" spheres.\n\n \n\nI hadn't seen the pictures of the new cards prior to posting my thoughts about the card… lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84329-druadan-forest/?do=findComment&comment=800962","commentId":800962,"userName":"Spurries","timestamp":1370118994,"content":"SiCK_Boy said:\n\nSadly, I cannot tell you that for the simple reason that I haven't played the scenario yet. In fact, I haven't played any scenarios released after Foundations of Stones, even though I've kept buying expansions as they came out. I only restarted playing recently and I've been trying updated decks against the earlier scenarios. I haven't seen a lot of demand for spoiled encounter / quest cards, so I'm not sure it's needed. If you have specific questions, I can answer them, but I think I gave a good overview of the quest earlier in this post already.\n\n\n\n \n\nI have not played either(will tomorrow) but there is a mechanic where insetad of damage in the 3rd card(siege) you place progress on the enemy.  Then when the progress token equals the enmies hit points, you put the enemy in the vistory display and the progress on the quest.  This can help with bad siege decks."}]}