{"url":"https://community.fantasyflightgames.com/topic/84341-can-i-give-a-sneak-attacked-ally-to-another-player/","title":"Can I Give a Sneak-Attacked Ally to Another Player?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84341-can-i-give-a-sneak-attacked-ally-to-another-player/?do=findComment&comment=799054","commentId":799054,"userName":"conykchameleon","timestamp":1369518704,"content":"Sneak Attack: Put 1 ally card into play from your hand. At the end of the phase, if that ally is still in play, return it to your hand.\n\nCan I Sneak Attack Gandalf (or someone else if you're doing it wrong haha) into play under another player's control? There doesn't seem to be anything preventing it, but I just wanted to make sure there wasn't something I was missing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84341-can-i-give-a-sneak-attacked-ally-to-another-player/?do=findComment&comment=799215","commentId":799215,"userName":"CJMatos","timestamp":1369576612,"content":"I believe no\n\nFrom the rules on core set\n\nControl and Ownership\nA player “owns” his heroes and the cards that he has\nchosen for the player deck he is playing. A player\n“controls” all cards that he owns, unless another player\nor the encounter deck takes control of the card through\na game effect. Any time a card leaves play, it reverts to\nits owner’s hand, deck, or discard pile (as directed by\nthe effect forcing the card out of play).\n \nWhen a player plays an ally card, it comes into play\nunder his control and is placed in his play area. If\nanother player takes control of that ally, it is moved to\nthe controlling player's play area. Ally cards cannot be\nplayed under the control of another player, they can\nonly change control through card effects.\n \nWhen a player plays an attachment card, he has the\noption of giving control of that card to another player\nby attaching the card to one of that player’s characters.\nPlayers always assume control of attachments that\nhave been played on their characters. If control of\nthat character changes, so does the control of any\nattachments on that character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84341-can-i-give-a-sneak-attacked-ally-to-another-player/?do=findComment&comment=799268","commentId":799268,"userName":"conykchameleon","timestamp":1369586629,"content":"I understand what you're saying, but those rules are only governing when you \"play\" a card. It has already been established that \"play\" is different than \"put into play\", and I can find no such restriction on \"put into play\"."}]}