{"url":"https://community.fantasyflightgames.com/topic/84387-favorite-art/","title":"Favorite art","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799473","commentId":799473,"userName":"GrandSpleen","timestamp":1369677672,"content":"Hi all!\n\nI am -- to be perfectly honest -- not that into art, and I tend to read card text much more carefully than I examine the art.  But!  Even I do appreciate cards that are pleasing to the eyes, and with that in mind I'd like to start a thread for us all to mention some of our favorite card art.\n\nI'll list some of my favorites by card type.  Feel free to follow suit or just chime in with whatever you'd like to say.\n\nFavorite hero art: Aragorn (Lore), honorable mention to Beregond.\n\nAlly: Descendant of Thorondor\n\nAttachment: Ever My Heart Rises.  Honorable mention to Dwarven Axe, but only after somebody pointed out that you can see a dwarf's reflection in the metal.  Like others, I thought this was a bloodstain before looking more closely at it!  I kind of life Thror's Map as well.\n\nEvent: A Watchful Peace, Short Cut\n\nEnemy: Moutain Warg (Misty Mountains set)\n\nTreachery: A Chance Encounter (Deeps of Moria set) -- this one makes me chuckle\n\nLocation: probably the hardest category, with some many good choices.  I like Lake in the Cavern (Dugeons Deep and Caverns Dim) & Ithilien Road (Into Ithilien)\n\nObjective: Shadow Key (Escape from Dol Guldur)\n\nTreasure: Bilbo's Magic Ring\n\nQuest card: Approaching Cair Andros (Siege of Cair Andros 4) and TEndless Caves (Foundations of Stone 4B), the latter being very thematic.  I also want to mention Ambush on the Shore (Journey Down the Anduin card 3).\n\nOk, your turn!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799484","commentId":799484,"userName":"Zalrus9","timestamp":1369682586,"content":"Hi!\n\nHero Art: Gotta say Beorn. His art very well portrays what he does on the quest: mauling things and taking names. Much better art than his ally incarnation, to be sure. Beregond's a close second, because I love that armor.\n\nAlly Art: Decendant of Thorondor. Love me some Eagles (in fact, that was one of the reasons I picked up this game), and the Decendant probably best portrays the size and power of those bad birds.\n\nAttachment: King Under The Mountan. Portrays Thorin's goal very well. \n\nEvent: Probably Feint, as it's very good at portraying what's happening.\n\nEncounter Card: Nameless Fear. Very scary looking because you can't quite see him.\n\nTreachery: Counter-Spell. Really disheartening, but very evocative.\n\nObjective: Prisoner\n\nTreasure: Glamdring\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799496","commentId":799496,"userName":"Gizlivadi","timestamp":1369686564,"content":"Hero: Boromir (leadership). I'm not THAT big a fan of Villeneuve, but I still admit she's one of the best artists for this game. And I love how Boromir looks in that illustration… one of her best pieces IMO. Honorable mention to Frodo Baggins as well.\n\nAlly: Lots of really good ones, many average ones, and some are pretty mediocre. However, my main problem with the art in this game in general is the abuse of exagerated contrast and chiaroscuro (I guess thats how you spell it in English) techniques. Most of the times, I completely DESPISE illustrations that show a dimly-lit background and the dark sillhouette of the character in question (I'm looking at you, Lorien Guide) or the ones that are just so dark that you can't make anything out of it except for some details (Miner of the Iron Hills is the best example, though there are many others).  That said, I'm probably gonna go with Hunter of Lamedon. I like the colors more than everything, but I also think the posture and how it shows most of his body is very well done. Other cool arts are Bofur  (both versions), Haldir and Fili and Kili.\n\nAttachment: I particularly like Love of Tales and Path of Need.\n\nEvent: Definately Radagast's Cunning. Honorable mention to Rumor from the Earth and Lure of Moria.\n\nEnemy: Crebain I think, though Attercop, Attercop is also very cool.\n\nTreachery: Kind of a tough one, but I enjoy Through the Mist and Whip Lash (wish that had been Durin's Bane card art)\n\nLocation: Again, most people say here's the best art for this game, and while there are some absolutely beautiful ones here, I think there are many that are just bland or boring, like many from the core set like Gladden Fields or Mountains of Mirkwood, which are pretty much a dark, blurry mess, and some from the Moria scenarios like Upper Hall. However, my favorite ones gotta be The West Bank from hunt for Gollum and Doors of Durin.\n\nObjective: Bilbo's Magic Ring\n\nTreasure: Bilbo's Magic Ring\n\nQuest card: Many cool ones. Into the Fire, Battle in Dale (and pretty much anything by Adam Schumpert), the Chris Rahn ones, Through the Forest… ****, there are just so many amazing ones in this category.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799531","commentId":799531,"userName":"Pharmboys2013","timestamp":1369700453,"content":"Hero:  Glorfindel (spirit) - maybe too obvious of a choice but I just love this card.  Anytime i show new people this game and they remark about how good the cards look i always go \"wait till you see this one\" and fetch Glorfindel from the hero pile.  Just a beauty.  (honorable mention- Boromir (leadership) Elrond)\n\nAlly: Gildor Inglorion - as if my avatar didnt display my affection for the character and the art of it.  Just a very cool picture in my opinion.  Sooooo many good choices though (honorable mention- Arwen, Eagles of the Misty Mountains, Hennamarth Riversong)\n\nAttachment: Blood of Numenor - love the action shot of what i assume is ment to be Boromir and Faramir witht he tattered flag and desolate background.  (Honorable mention: Vilya, Sword that was Broken)\n\nEvent: Hands Upon the Bow - Very difficult to pick a favorite, so many good ones.  Between the great action shots like Feint and Foe-Hammer and the more cerebral ones like Good Harvest, Dawn Take You All, and Galadrim's Greeting there is a lot to like in this category\n\nEnemy: Durin's Bane - Just an absolutely epic portayl of the balrog IMO.  The detail in the flames and the off centercharacter with the large whip in the front just makes a very cool picture i enjoy looking at.  (Honorable Mention- Orc Arcblasters and the new Telemnar's Bane (love the mask))\n\nTreachery: Freezing Cold - A frozen moustache…thats all there needs to be (Honorable Mention- Gollum's Bite, Whiplash)\n\nLocation: Doors of Durin - kind of feels like a cop out, but its a good illustration of a very iconic image.  Besides, most of the location's a very dark and gloomy.  I do also like some of the brigher ones like Hobbit-Lands for example\n\nObjective: Celador….although none of them are really that great, this is easily the best of the bunch…wish he was an ally so I could use him more regularly\n\nTreasure: Sting- Even though this is a darker card and I like more colorful ones, I think this is my favorite portrayl of Bilbo yet and I like how the blade shimmers in the blackness (Honorable Mention: Bilbo's Magic Ring, The Arkenstone)\n\nQuest Card: A pretty good lot here: the seething lake, on the doorstep, pretty much each one from the battle of five armies quest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799550","commentId":799550,"userName":"lleimmoen","timestamp":1369711352,"content":"Some obvious choices, I like Magali Villeneuve's art too. I agree on Boromir, that one really does it for me, the look of a passionate stretegist. Glorfindel is at least as good though. And I'm very happy for that because those are two of my favourite characters as well. The Elves are usually great. Favour of the Lady is beautiful (and a shame for being such a poor card), hopefully Galadriel will look similar to that. Lórien's Wealth, Haldir, Gildor, all great.\n\nHenamarth Riversong. I think this is an odd choice for many but I have been in love with that picture too.\n\nI really like Dúnhere, I wish Jeff Himmelman did most of the Rohan. It would have been nice if there were a specialist for each faction, or so. It would give thematic decks a very good look, I feel.\n\nBen Zweifel is my favourite for locations. I wish he did even more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799561","commentId":799561,"userName":"richsabre","timestamp":1369716965,"content":"great thread.\n\ni have to say first and most of all that the art in this game is amazing- it is probably my second favourite part of the game (apart from the setting), and while i do not love all of it, there isnt a piece i really dislike. as for the artists, despite respect to magali villeneuve for being a master of fantasy illustration (and many of my favourites are hers), i do feel a lot of the other equally amazing artists often get over looked….\n\n \n\nhero: probably Hama or lore Aragorn. both very atmospheric pieces. im also particularly fond of Balin and Bard…so hard to choose\n\nally: i think radagast and wandering took really pick out what i picture in my mind when i read those words\n\nattatchmets: dunedain chache is beautiful, but i think my favourites are good meal, healing herbs and love of tales…again its great hobbit lore\n\nevents: i think events and locations are where most of the best art is…but a few cards stand out here - peace and thought, to the eyrie, parting gifts, striders path, short cut, light the beacons, dawn take you all and a watchful peace\n\nlocations: one of my favourites for a long time has been the old ford, but there are so many others. alot of my favourites are in the moutain quests such as rehord gate, road to rivendell and emyn muil\n\nencounter cards: one of my favourites is a new one out of the on the doorstep - bodyguard of bolg, vanguard of bolg is amazing (think thats what its called)…it really does look like what i pictured when i first read the hobbit\n\noverall: so much to choose from, i could write pages and not choose, but i think out of all of those it is those which get close to what i picture in my mind when i read the books, and those are probably peace and thought, love of tales, striders path, the old ford and short cut\n\nrich\n\nEDIT - edited because i forgot locations and encounter cards!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799638","commentId":799638,"userName":"Khamul The Easterling","timestamp":1369740370,"content":"I don't have all the expansions up to date, but have over half of them.  I hope I can still contribute.\n\nHero: Strider or Hirluin\n\nAlly: Ithilien Tracker\n\nAttachment: Ring Mail.  Magali Villeneuve's art is always the best I think.\n\nEvents: uhhh not sure.\n\nLocations: I really like \"The North Stair\"\n\nEnemy: Mumak, Haradrim Elite, Harbor Thug.\n\nTreachery: Southron Support, Maybe old Wives Tales?\n\nQuest Card: 3B of ThfG\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799689","commentId":799689,"userName":"richsabre","timestamp":1369748863,"content":"actually i was looking at the spoilers for amon din and i think that pippin will become a favourite when i get the actual card….\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799729","commentId":799729,"userName":"Samwise Gamgee","timestamp":1369758767,"content":"I would agree. I like Villeneuve's take on the hobbits including the two Biblo's from the Hobbit and Pippin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799744","commentId":799744,"userName":"richsabre","timestamp":1369761686,"content":"Samwise Gamgee said:\n\nI would agree. I like Villeneuve's take on the hobbits including the two Biblo's from the Hobbit and Pippin.\n\n\n\nim not so fond of the bilbos, but i think thats becuase i have a very specific image of bilbo from when i first read the hobbit when i was young. sort of like the hobbit of 'love of tales'\n\ni quite like the actual bilbo hero though, and frodo is great, though again not what i imagine….though its of course impossible for an artist to cater to everyone's images!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799750","commentId":799750,"userName":"Samwise Gamgee","timestamp":1369762987,"content":"To each his own. I never really liked the portrayal of hobbits as almost kids (i.e., Frodo hero). It is true they were small, but Bibo was 50 years old (middle-aged for a hobbit) at the time of The Hobbit. I prefer the not old, but more mature look of the hobbits. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799916","commentId":799916,"userName":"DevastazioneH88","timestamp":1369811221,"content":"I'll try to contibute…though for me it's almost impossible to name one card per category…there are so many great ones ! anyway…\n\np.s. beware I love M. Villeneuve's art \n\n \n\nHERO : LEGOLAS and HAMA are the best for me…but there are so many others that I love, like Elladan and Elrohir, Nori, Ori, Dwalin, Strider, Eleanor, Thalin, Frodo , Boromir (both), Beregond, Beravor, Beorn, Bard…\n\n \n\nALLY : Arwen, Bofur (tactics), Citadel Custodian, Damrod, Daughter of the Nimrodel, Dunedain Watcher, Eagles of the Misty Mountains, Elfhelm, Envoy of Pelargir, Erestor, Ethir Swordsman, Fili and Kili, Gandalf (both but the first one better), Gildor, Gondorian Spearman, Haldir, Henamarth RIversong, Imladris Stargazers, Ithilien Tracker, Landroval, Longbeard Orc Slayer, Lorien Guide, Mirkwood Runner, Northern Tracker, Silvan Tracker, Son of Arnor, Trollshaw Scout, Warden of Healing, Winged Guardian….these are the ones I like the most…but If I had to choos just a few of them I'd say ARWEN, ELHELM, KILI, GONDORIAN SPEARMAN, HALDIR, GILDOR, LONGBEARD ORC SLAYER, MIRKWOOD RUNNER, SILVAN TRACKER AND WINGED GURADIAN\n\n \n\nATTACHMENT : Steward of Gondor, Song of Wisdom, Song of Travel, Song of Kings, Song of Earendil, Song of Battle, Self Preservation, Ring Mail, Protector of Lorien, Power in the Earth, Light of Valinor, King under the Mountain, Gondorian Shield, Ever My Heart Rises, Dwarrowdelf Axe, Blood of Numenor, Asfaloth….to name those I like the most : STEWARD OF GONDOR; SONG OF WISDOM, RING MAIL, EVER MY HEART RISES, BLOOD OF NUMENOR…\n\n \n\nEVENT : A Test o Will, A Watchful Peace, Daereon's Runes, Dawn Take you All,  Desperate Alliance, Ever Vigilant, Feint, Fortune or Fate, Gaining Strenght, Gandalf's Search, Gildor's Counsel, Hands upon the Bow, Hasty Stroke, Light the Beacons, Lorien's Wealth, Lure of Moria, Mithrandir's Advice, Needful to Know, Out of the Wild, Peace and Thought, Rear Guard, Short Cut, Sneak Attack, Strenght of Will, The Eagles are Coming, The Galadhrim's Greeting, Word of Command…Absolute Favourites : HANDS UPON THE BOW !!! A WATCHFUL PEACE, DAWN TAKE YOU ALL, FEINT, GAINING STRENGHT, NEEDFUL TO KNOW; OUT OF THE WILD; REAR GUARD; STRENGHT OF WILL, THE EAGLES ARE COMING.\n\n \n\nas for encounter card I'll be less specific,\n\n \n\nLOCATION : I really like most of the locations in this game, the vast majority of them are awsome and really improve the overall gaming atmosphere. The ones by Ben Zweifel, for exemple, are extraordinary….That said I couldn't name one or some…because It'd be easier for me to name the ones I don't like (very rare).\n\n \n\nENEMY : my all time favourite : The Nameless Fear !\n\n \n\nTREACHERY : Counter Spell would be my favourite but there are many others I really find very good !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799930","commentId":799930,"userName":"Khamul The Easterling","timestamp":1369815360,"content":"Oh! And I LOVE Pippin's art.  Lots of the time the backround art of the hreoes are not so great but on Pippin's…….. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=799947","commentId":799947,"userName":"richsabre","timestamp":1369818714,"content":"Samwise Gamgee said:\n\n \n\nTo each his own. I never really liked the portrayal of hobbits as almost kids (i.e., Frodo hero). It is true they were small, but Bibo was 50 years old (middle-aged for a hobbit) at the time of The Hobbit. I prefer the not old, but more mature look of the hobbits. \n\n \n\n \n\nindeed- same applies for frodo. even taking into account the years frodo was a ring bearer before setting out from bag end, i still dont imagine him as that young. i also picture him a lot fatter, at least when setting out (even he admits the walking would do him good reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif])\n\nbut i think that the love of tales / wandering took style hobbits are closest to my idea of hobbits…though the ages / weights and even heigths of course differ depending on who im picturing\n\nim just thankful that my images of chracters havnt been inspired by anything other than my own imagination (ok….maybe a little by the great lotr illustrators such as Howe and Nasmith…(gandalf is the obvious choice here…and it seems every other artist agrees) but even they are a bit off for me personally)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84387-favorite-art/?do=findComment&comment=800019","commentId":800019,"userName":"Samwise Gamgee","timestamp":1369833834,"content":"richsabre said:\n\nindeed- same applies for frodo. even taking into account the years frodo was a ring bearer before setting out from bag end, i still dont imagine him as that young. i also picture him a lot fatter, at least when setting out (even he admits the walking would do him good reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif])\n\nbut i think that the love of tales / wandering took style hobbits are closest to my idea of hobbits…though the ages / weights and even heigths of course differ depending on who im picturing\n\nim just thankful that my images of chracters havnt been inspired by anything other than my own imagination (ok….maybe a little by the great lotr illustrators such as Howe and Nasmith…(gandalf is the obvious choice here…and it seems every other artist agrees) but even they are a bit off for me personally)\n\nrich\n\n\n\nYes. I, too, imagined an older, fatter Frodo. And, I agree that a great aspect of it being a book is that everyone has their own imaginations of these characters.\n\nP.S. Wandering Took IS a fun hobbit style."}]}