{"url":"https://community.fantasyflightgames.com/topic/84402-nightmare-variant-tournament-at-my-local-game-store-june-23/","title":"Nightmare Variant Tournament at my Local Game Store, June 23.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84402-nightmare-variant-tournament-at-my-local-game-store-june-23/?do=findComment&comment=799584","commentId":799584,"userName":"DurinIII","timestamp":1369723330,"content":"My local game store, The Gamer's Armory (Cary, NC) is hosting a FF sanctioned Nightmare variant tournament for LOTR LCG on June 23. I am excited to participate, plus, the prizes are new Nightmare cards. \n\nAnyone else's local game store announced a tournament in June? I am just curious is FF is trying to get us all on the same page with the tournament format. I have the rules sent to me from my game store on how play will proceed. If any of you are interested in seeing it, let me know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84402-nightmare-variant-tournament-at-my-local-game-store-june-23/?do=findComment&comment=799610","commentId":799610,"userName":"Tracker1","timestamp":1369732358,"content":"I'd like to see the rules.  How did the store get it officialy senctioned by FFG?  My FLGS might be interested in this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84402-nightmare-variant-tournament-at-my-local-game-store-june-23/?do=findComment&comment=799651","commentId":799651,"userName":"Glaurung","timestamp":1369741634,"content":"Wow sounds cool! Shame i cannot be there….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84402-nightmare-variant-tournament-at-my-local-game-store-june-23/?do=findComment&comment=799706","commentId":799706,"userName":"DurinIII","timestamp":1369755120,"content":"This is what the write-up says, guys:\n\nWe will be using contents from the Season Season 1 Game Night Kit for this Tournament….\ng prepare yourself for some different items with this kit that make it especially dangerous for LotR players: Nightmare Decks.\n\nThe Entry Fee will be $10.00 per person\n\n \n\nTournament Structure: \n\nThe Tournament will follow the Fantasy Flight Game Night Kit Tournament Rules. The Game Night Kit includes rules for running a Race Against the Shadow Tournament! \n\nEach player brings a legal The Lord of the Rings: The Card Game deck to the event.  Deck-building rules are on page 27 of the core rulebook.  Legal decks contain a minimum of 50 cards and a maximum of 3 heroes.  Each match, each team will be paired against one other team.  Each team will provide its own copy of the announced scenario, and their opponents may check the encounter deck for completeness.  Each team will begin with 45 minutes on the clock for a match length of 90 minutes.  At the TO's discretion, depending on the general amount of time it takes to complete a scenario, this number can be adjusted up to 60 minutes or down to 30 minutes.  Any adjustment to the time controls will be announced when pairings are posted.  In a Race Against the Shadow match, each round is broken into three phase groups.  Teams alternate play through these phase groups, playing their cards and advancing through their quests, then observing their opponents' phase groups.  The team that finishes the scenario without the other team finishing in the same Phase Group is awarded a Match Win and 5 points. If the team that played first completes the scenario first, the other team has their next phase group to attempt to complete the scenario. If both teams complete the scenario in the same phase group, the team with the lower score wins.  If the scores are also the same, the match is a Draw and each team is awarded 2 points. If both teams are eliminated in the same round, or if neither team completes the scenario, the match is a Modified Loss and each team is awarded 1 point. If a single team is eliminated, the other team is awarded a Match Win and 5 points. If a team exhausts its allotted time, it is eliminated and the opposing team is awarded a Match Win and 5 points.\n\n \n\n Prizes will be awarded using the Season One 2013 Game Night Kit…contents are listed below: \n\n * One Passage Through Mirkwood Nightmare Deck\n * One Journey Down the Anduin Nightmare Deck\n * One Escape from Dol Guldur Nightmare Deck\n * One deck box featuring art from Khazad-dum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84402-nightmare-variant-tournament-at-my-local-game-store-june-23/?do=findComment&comment=799974","commentId":799974,"userName":"Tracker1","timestamp":1369824122,"content":"Cool, let us know how it goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84402-nightmare-variant-tournament-at-my-local-game-store-june-23/?do=findComment&comment=801095","commentId":801095,"userName":"DurinIII","timestamp":1370171697,"content":"Will do, Tracker1! Glaurung, wish you could be here too! I need you on my team to beat these quests! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nAs far as the tournament being \"officially sanctioned\" by FF,  they are sending \"official\" Nightmare varient cards to the game store, but I am almost 99% positive there will not be a FF staff rep present; like back in the day when the \"Black Riders\" would dispatch from Decipher to local game stores to monitor events. Ahhh, I remember those days, when the Decipher LOTR CCG was chugging along beautifully. I was involved in several of those tournaments. Good times! "}]}