{"url":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/","title":"Favorite enemy","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=800491","commentId":800491,"userName":"Khamul The Easterling","timestamp":1369953809,"content":"What is your favorite enemy to fight?  And Just to go with it, what is you least favorite?\n\nI love fighting Goblin Taskmaster for some reason.  I also love beating the hill troll in many differant ways.  Also I like fighting Muck Adders due to the art.  \n\nLeast favorite would prob be all the goblins and orcs which sadly, covers almost all the enemys.  It looks like most of the creature fighting is in the past since, with HoN, SF and Druadan FOrest, we are getting more actuall people enemies which I very muck like. \n\nSo yeah please share :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=800508","commentId":800508,"userName":"Pharmboys2013","timestamp":1369958891,"content":"I always like fighting the big boss enemies whether it be the trolls from conflict at the carrock, the witch king as i'm fleeing from osgilith, the watcher in the water as i'm praying i can get through the doors of durin, the balrog and smaug who are just two insanely powerful enemies.  Even the \"villians\" in the steward's fear are a fun challenge i enjoy taking on"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=800553","commentId":800553,"userName":"DevastazioneH88","timestamp":1369977021,"content":"Well I love the \"Villain\" oriented Packs…so I'd say Durin's Bane…I also liked the proper villains in the steward's fear (that is becoming more and more my favourite scenario…)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=800570","commentId":800570,"userName":"richsabre","timestamp":1369987289,"content":"well, what i am really looking forward to is the ringwraiths…especially the witch king.\n\nmy currently favourites are probably some of those in the redorn and road to rivendell. some of my favourites areas in middle earth are the 'wilds' ….places which are treacherous to travel. so i really like the mountain goblin in the redhorn gate….it is exactly how i picture goblins.\n\nim also quite fond of fighting wargs.\n\nmy least favourite has to be that patrol leader…..the amount of times ive hit it with a 1 kill shot only to have it cancelled.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=800611","commentId":800611,"userName":"Gunny_J","timestamp":1369999461,"content":"I enjoyed battling the Watcher in the Water. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=800938","commentId":800938,"userName":"Mr Coffee","timestamp":1370107241,"content":"Pretty sure the Ringwraiths will end up as my favorite overall.\n\n \n\nWargs of any type are my least favorite… grumble, grumble…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=801127","commentId":801127,"userName":"legolas18","timestamp":1370184582,"content":"For some odd reason, I always get a rush of excitement when Chieftain Ufthak comes out. I just really like to kill him… reir [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/reir.gif]\n\nLeast favorite would definitely be wargs. I always get a feeling of dread when Wargs are drawn.. Probably why I've never even tried to beat the last quest in Over Hill and Under Hill."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84531-favorite-enemy/?do=findComment&comment=801197","commentId":801197,"userName":"DurinIII","timestamp":1370205860,"content":"My favorite enemies are the ones with the least amount of capability to beat the hell out of my characters. But in all seriousness, I love the art on all of the enemy cards though I can't say I particulalry \"like\" any of the enemies in the game. My least favorite enemy to fight in Anduin (I use this example because I have recently been fighting it), is that blasted Wolf-rider who surges another encounter card. He is easy to kill, but it is his darn surge ability that annoys me, also, he is even more annoying when you draw him as a shadow card. "}]}