{"url":"https://community.fantasyflightgames.com/topic/84619-nightmare-question/","title":"Nightmare Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84619-nightmare-question/?do=findComment&comment=800982","commentId":800982,"userName":"Khamul The Easterling","timestamp":1370125189,"content":"Not talking about nighmare decks, talking about the \"expert game\" thing mentioned in the rules book.  \n\n1. When you place the last progress token on Passasge through Mirkwood  quest for example, when your moving to JDtA, do you keep all your allies and attachments and stuff out there?  And do you discard your hand?  Or do you just wipe the whole thing clean except for damage, threat, and stuff?  \n\n2. And if you dont discard your hand and and allies ect.  Do you draw a new 7 cards in the next game?\n\n \n\nThanks, \n\nKhamuol\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84619-nightmare-question/?do=findComment&comment=801013","commentId":801013,"userName":"Nerdmeister","timestamp":1370137028,"content":" \n\nNightmare Variant\n\nThis section elaborates upon the \"nightmare\" play variant that is introduced on page 27 of the Core Set rulebook.\n\nWhen playing the \"nightmare\" variant each player’s threat, wounds, and discard pile do not reset when setting up a new scenario.\n\nTo reset the other game elements at the beginning of a new \"nightmare\" scenario, perform the following steps in order:\n\n1) All non-hero cards in play and in hand are shuffled into their owner’s decks. All encounter cards are returned to their encounter sets so they are available for the next scenario, if needed. This includes cards in players’ victory display.\n\n2) All unspent resources are discarded from the heroes’ resource pools.\n\n3) Each player draws a new starting hand per the regular setup rules of the game. A single mulligan may be taken by each player at this time.\n\n4) A player cannot start a scenario with a threat level that is lower than the combined threat cost of his heroes. If a player’s threat is lower than the starting threat cost of his heroes, he must increase his threat to that value.\n\n5) Follow all setup instructions for the new scenario.\n\nEach scenario should be scored separately, and then all the scores added together at the end of the variant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84619-nightmare-question/?do=findComment&comment=801066","commentId":801066,"userName":"Khamul The Easterling","timestamp":1370161140,"content":"Okay thanks.  I seached it on the internet but couldn't find it.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84619-nightmare-question/?do=findComment&comment=801228","commentId":801228,"userName":"Khamul The Easterling","timestamp":1370213517,"content":"Another to go along with it:\n\nCan Srtider use his ability in all 3 games? Or just once in 3 games? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84619-nightmare-question/?do=findComment&comment=801285","commentId":801285,"userName":"Nerdmeister","timestamp":1370232856,"content":"Even though they are part of the same campaign, each quest is it´s own game in regards to once-per-game-abilities. Loragorn is a perfectly valid way of trying to manage your threat during nightmare."}]}