{"url":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/","title":"A More Leisurely Breakfast","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801547","commentId":801547,"userName":"Hannibal_pjv","timestamp":1370315199,"content":"The Easy mode article:\n\nhttp://www.fantasyflightgames.com/edge_news.asp?eidn=4165 [http://www.fantasyflightgames.com/edge_news.asp?eidn=4165]\n\n \n\nNice to hear about the development of the easy mode. I still IMHO would like to see allso an alternate easy mode with spesific easy mode deck. Some helping cards or replacements, because some removed cards ads an atmosphere to those quest. So an easier version of those cards and some helping cards would be good in story wice.\n\nBut I think that this system is ok, but an story driven alternative upgrade kit would allso be really nice to have. Maybe in the next year or later :-)\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801550","commentId":801550,"userName":"Nerdmeister","timestamp":1370316265,"content":"I don´t think FFG will be able to get enough people to pay +200$ (guessing) in order to release easy mode decks for all quests. Easy mode is more for casual players and nightmare is for hardcore players. Of those 2 groups which do you think will most readily part with their money?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801562","commentId":801562,"userName":"Ellareth","timestamp":1370321317,"content":"Easily one of the best articles released so far in my opinion.\nI was hoping to see insight and the process of development when they first announced the 'Second Breakfast' articles, and here it is!\n\nThey awknowledged increase in player card is a problem to existing Quests, so they are almost forced to make the newer quests tougher to compensate for that, and also awknowledge that doing so caused a problem where newer players cannot simply pick up Core Set + newest Delux / Cycle.\n\nArticle explains why they had chosen this specific approach to solve above mentioned problem; taking out cards from encounter deck can fix-up difficulty without implementation of complex rules (or omission of rules, which may decrease the enjoyment) and without requiring extra purchases.\n\nThe article also stresses that Easy Mode is not only for those who are new to the game, but is also great for those who wish to play with more thematic, creative and inovative decks. Now that they mention it, maybe I will give a non-ally deck a try with Easy Mode and see how it goes (by the way, I also support the name of 'Easy Mode'. Had they went with 'Thematic Mode' or 'Story Mode' or some other words while the objective of variant is clearly to lower difficulty, I would've thought they were tring to beguile the players.)\n\nAnnouncements for upcoming expansions and spoiler articles are great, but this is the kind of article that I want to see more often; where they discuss the basic design concept behind game mechanics (or variants or a specific card), and why they chose to go with the option they chose amongst many others. Luckily it says next Second Breakfast article will talk about designing of Nightmare Deck, so I think we will be getting more of these kind of articles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801582","commentId":801582,"userName":"richsabre","timestamp":1370331533,"content":"its nice to see the designers interacting with us and listening to our opinions. Its also nice to see an honest self-review of the game\n\nkeep it up.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801593","commentId":801593,"userName":"Glaurung","timestamp":1370335492,"content":"For me im not intreresting at all in the easy mode.\n\nI like when game is hard and difficult and i belive Tolkien game should be like this. Truly to say this game is not really hard. Every competive game is more harder like AGOT or SW or Magic. you play againts a player and is always more cool then encounter deck.\n\nAnd i happy the main stream of the game wil be same level of difficulty, maybe even more harder what i aslo welcome since they make a easy mode. So now everyone will be happy.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801619","commentId":801619,"userName":"leptokurt","timestamp":1370341882,"content":"Glaurung said:\n\nFor me im not intreresting at all in the easy mode.\n\nI like when game is hard and difficult and i belive Tolkien game should be like this. Truly to say this game is not really hard. Every competive game is more harder like AGOT or SW or Magic. you play againts a player and is always more cool then encounter deck.\n\nAnd i happy the main stream of the game wil be same level of difficulty, maybe even more harder what i aslo welcome since they make a easy mode. So now everyone will be happy.\n\n \n\n\n\nHmmh, I wonder if your first two paragraphs will make people angry enough to ignore the third."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801620","commentId":801620,"userName":"richsabre","timestamp":1370342379,"content":"….probably….though that of course is a topic as old as this forum…comiendo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/comiendo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801647","commentId":801647,"userName":"Gunny_J","timestamp":1370350442,"content":"Nerdmeister said:\n\nI don´t think FFG will be able to get enough people to pay +200$ (guessing) in order to release easy mode decks for all quests. Easy mode is more for casual players and nightmare is for hardcore players. Of those 2 groups which do you think will most readily part with their money?\n\n\n\nAt first read, I totally agreed with your statement and feel that the strategy is perfect from a business standpoint.  Then, I took a second and thought about it from my own personal experience trying \"easy mode\" Into Ithilien.  I removed almost half the deck after applying the \"easy mode\" guidance.  That is way too much.  I don't believe the difficulty to be the cards.  I think it is the frequency of revealing those cards.  Into Ithilien is ruthless.  I find myself begging the deck for an archer enemy card that does automatic damage to me…before I even engage it??\n\nTherefore, I don't think that removing cards is the real solution.  The cards are great and make the theme of the quest special.  I think the addition of easier cards is the best solution.  I believe a single pack of general \"easy mode\" cards to add to decks would be better.  That way, the theme is untouched and the probability of drawing certain cards is lessened, which lessens the difficulty of the quest based on probability of card draw.  If FFG made a single generically \"easy mode\" card pack, you would only need about 5-10 of them per encounter deck.  The could be generally themed, so you knew you were getting the \"easy mode\" break.  That is just my opinion.  What do you all think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801663","commentId":801663,"userName":"Style75","timestamp":1370353676,"content":"Excellent article and I'm very happy to see that the designers recognize the problem with increasing difficulty and trying to get new players into this game. I'm very happy with easy mode but the big concern I have is with the distribution of instructions on how to play using easy mode. Right now the PDF is available through the support section of the product webpage and linked in an article on the FFG site that came out over a week ago. How will new players find out about this? This material should be given to all retailers to ensure that new players see that easy mode is an option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801682","commentId":801682,"userName":"chrsjxn","timestamp":1370359473,"content":"Gunny_J said:\n\nAt first read, I totally agreed with your statement and feel that the strategy is perfect from a business standpoint.  Then, I took a second and thought about it from my own personal experience trying \"easy mode\" Into Ithilien.  I removed almost half the deck after applying the \"easy mode\" guidance.  That is way too much.  I don't believe the difficulty to be the cards.  I think it is the frequency of revealing those cards.  Into Ithilien is ruthless.  I find myself begging the deck for an archer enemy card that does automatic damage to me…before I even engage it??\n\nTherefore, I don't think that removing cards is the real solution.  The cards are great and make the theme of the quest special.  I think the addition of easier cards is the best solution.  I believe a single pack of general \"easy mode\" cards to add to decks would be better.  That way, the theme is untouched and the probability of drawing certain cards is lessened, which lessens the difficulty of the quest based on probability of card draw.  If FFG made a single generically \"easy mode\" card pack, you would only need about 5-10 of them per encounter deck.  The could be generally themed, so you knew you were getting the \"easy mode\" break.  That is just my opinion.  What do you all think?\n\n\n\nAdding more cards isn't going to guarantee a lower frequency of awful cards in each individual game. It's just going to make the difficulty more random, which they're definitely trying to avoid.\n\nRemoving the cards makes the quests more consistent, which lets them have more control over the difficulty level of the quest. And it guarantees no truly awful states. Like you'll never have to face two Hill Trolls at the same time. You'll never have a first turn Sudden Pitfall force you to restart the game. Never have three Hunters From Mordor guarding clues."},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801694","commentId":801694,"userName":"jrd","timestamp":1370363635,"content":"Gunny_J said:\n\nNerdmeister said:\n\nTherefore, I don't think that removing cards is the real solution.  The cards are great and make the theme of the quest special.  I think the addition of easier cards is the best solution.  I believe a single pack of general \"easy mode\" cards to add to decks would be better.  That way, the theme is untouched and the probability of drawing certain cards is lessened, which lessens the difficulty of the quest based on probability of card draw.  If FFG made a single generically \"easy mode\" card pack, you would only need about 5-10 of them per encounter deck.  The could be generally themed, so you knew you were getting the \"easy mode\" break.  That is just my opinion.  What do you all think?\n\n\n\nI tend to agree - it's not usually one card or another that's the problem, it's the unrelenting stream of difficult-to-manage enemies (or sometimes locations). In a recent two-player game against one of the latest quests, we had 20 threat in the staging area on turn 1. Then we got shot for a few points of archery damage, then we were engaged by two tough enemies. All on turn 1. I don't mind tough quests, but it's really hard to build decks which can withstand the full-on slaughter that seems to be becoming the norm recently. \n\nHow about having a few cards which scaled according to how well the players are doing? For example:\n\n\"If there are more enemies in play than the number of players, discard this card without effect\"\n\n\"Each player discards down to 5 cards\"\n\n\"If any of the players have a threat of 40 or higher, put this card into play as an ally under control of the player with the highest threat\"\n\n\"Add 1 resource to each hero with no resources\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/84709-a-more-leisurely-breakfast/?do=findComment&comment=801850","commentId":801850,"userName":"Hannibal_pjv","timestamp":1370442887,"content":"jrd said:\n\n \n\nGunny_J said:\n\n \n\nNerdmeister said:\n\nHow about having a few cards which scaled according to how well the players are doing? For example:\n\n\"If there are more enemies in play than the number of players, discard this card without effect\"\n\n\"Each player discards down to 5 cards\"\n\n\"If any of the players have a threat of 40 or higher, put this card into play as an ally under control of the player with the highest threat\"\n\n\"Add 1 resource to each hero with no resources\"\n\n \n\n \n\n \n\nThat is something that I have been thinking too. It would be nice to see \"balance\" cards in future quests. If you are willing to help with Burgler mode that I have been developing. It is somewhat side tracked at this moment because of my Dune ccg project, but I will definitely continue on it and any \"Burglar\"-card ideas will be welcome. Most of my original ideas are pure helping cards, but that kind of balance cards can be even better.\n\nOne idea that can be considered is to make: Errata versions of those removed cards. So you would not remove them, but replase with fan-made \"errata\" cards. It is something that would be hard for FFG to do because of cost factor, but printable easy mode cards would be guite good alternative… Have to think about that too…\n\nThe link to Burglar article: http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=773130 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=773130]\n\n\nAllso another thing that I have been thinking is to have one help deck to the whole cycle. SO in Mirkwood cycle you have some generic help cards and others in Dwarrowdelf-cycle. So they would be much cheaper to produce. But errata cards would be too expensive to do in that way! So in there PDF-is just fine. The easy mode is very good because it is easy to do. Anything else need some tinkering…"}]}