{"url":"https://community.fantasyflightgames.com/topic/85068-heroes-required-for-0-point-summoning/","title":"Heroes required for 0-point summoning?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85068-heroes-required-for-0-point-summoning/?do=findComment&comment=803428","commentId":803428,"userName":"Olorin93","timestamp":1371123246,"content":"Hello. I'm new to the game and unsure about the rules. I just realised that Elrond can summon any ally regardless of sphere, which got me thinking… Attachments and events etc with 0 resource requirement to summon - do they even require a hero to be summoned?\n\nFor example - I have a [spirit] attachment card in my deck, but only [Leadership] and [Lore] heroes. The cost to summon the attachment is 0, so I don't have to use resources from a [spirit] hero pool. Do I still need a [spirit] hero in play? Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85068-heroes-required-for-0-point-summoning/?do=findComment&comment=803662","commentId":803662,"userName":"kyrie","timestamp":1371205734,"content":"Hey, good question. Although it might seem strange, YES, you still need a \"resource match\" even if the event/attachment has a cost of zero. From p. 12 of the Rulebook, \"Cards with a cost of zero do not require a resource to be spent in order to pay their cost, but they do require at least one hero under that player’s control to have a resource icon that matches the card’s sphere.\" Elrond's special ability allows him to \"bend\" this rule, although only for playing allies.\n\nAlso, be sure to keep in mind that when you play a card which costs more than one resource (like the attachment \"Unexpected Courage\"), you need multiple resources of the same sphere of influence in order to play it (two Spirit resources to play \"Unexpected Courage\"). The reason I say this is because I made the mistake when first playing that as long as you had one resource match you could use resouces of any sphere to pay for the rest of the cost of the card. However, this is not the case with this game. Neutral cards are the only exception; you can use any sphere to pay for those cards. Hope this helps, and happy questing!\n\n \n\n-kyrie"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85068-heroes-required-for-0-point-summoning/?do=findComment&comment=803823","commentId":803823,"userName":"Olorin93","timestamp":1371271010,"content":"Thanks! This is what I suspected, though I missed it in the Rulebook. I recently ordered some adventure packs and will try various card combinations to see what works best.\n\n(Sorry about double-posting this topic, either my connection or this webpage was acting up a few days ago.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85068-heroes-required-for-0-point-summoning/?do=findComment&comment=804571","commentId":804571,"userName":"DukeWellington","timestamp":1371551330,"content":"Also, the ring Vilya allows Elrond to play card \"at no cost\". In the official FAQ put out by fantasy flight there is a distinction between \"no cost\" and \"0 cost\". When something is no cost you do not need a sphere match, when something costs 0 then you do need to match the sphere."}]}