{"url":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/","title":"hobbits to the rescue","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804337","commentId":804337,"userName":"richsabre","timestamp":1371469347,"content":"new preview!!!\n\ncant wait to get my hands on some more hobbits!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804344","commentId":804344,"userName":"Mr Coffee","timestamp":1371471353,"content":"When looking at that deck build they put together for the article, all I can think of is Monty Python's Search for the Holy Grail, and the continued cry of, \"RUN AWAY!\" every time they get into a fight… lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804410","commentId":804410,"userName":"Pharmboys2013","timestamp":1371491389,"content":"it was a nice article, but i cant help but be a little bit disappointed there were no new player cards shown.  They didn't even include small target which was spoiled along with Pippen and hobbit sense way back in December…yea thats right December. oh wells, still looking forward to it just wanting something else to discuss"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804463","commentId":804463,"userName":"legolas18","timestamp":1371513273,"content":"I feel like the deck they showed would have a hard time getting below twenty threat and staying there. They have a lot of the Secrecy related cards, so the low threat would be important. I wish Bilbo's threat was 7. Or even 8 would have been nice. Oh well. I'd have to actually try out the deck to see how well it would work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804506","commentId":804506,"userName":"lleimmoen","timestamp":1371526620,"content":"I try to say this nicely as I really appreciate any new articles, and the designers' try to sort of \"stay in touch\". Sharing decks, with ideas behind them, is certainly intriguing. And there's certain something that is quite intriguing about this deck; however, there are few problems I see. Starting at 22 and going for secrecy whilst both Frodo and Pippin's abilities are based on raising threat, that seems madness. The threat reduction only has two copies of the Greeting and Gandalf, with Sneak Attack only available after a Song of Kings had been played. Now, that Leadership approach is quite strange also, especially Timely Aid: first you need the song, then you need secrecy (paying 4 is really not nice) to get an ally: but there are only nine (9!) in the entire deck. The card draw is good though, and I really like the flavour of the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804524","commentId":804524,"userName":"richsabre","timestamp":1371535283,"content":"hobbit decks would work well with song of earendil. get a strider /spirit deck to take all the hobbits threat so they can keep secrecy running\n\nrich\n\nps. pippin is now officially my favourite hero art cafe [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cafe.gif] (im drinking coffee…it has nothing to do with pip)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804612","commentId":804612,"userName":"Gizlivadi","timestamp":1371562031,"content":"I wonder if the writer of this article actually tested this deck. It seems pretty weak to me. Rarely, if it ever does, its threat will go below secrecy threshold, and that doesn't really make much sense, seeing as it includes so many secrecy cards. Most of them are wasted cards in my opinion. Also, since this is supposed to be THE hobbit pack, I suppose the only hobbit cards in it are pretty much the ones already spoiled (the two events and Pippin), since this is a hobbit deck and there were no other hobbit synergy cards included in it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804626","commentId":804626,"userName":"Thorongil","timestamp":1371564263,"content":"lleimmoen said:\n\nStarting at 22 and going for secrecy whilst both Frodo and Pippin's abilities are based on raising threat, that seems madness. The threat reduction only has two copies of the Greeting and Gandalf, with Sneak Attack only available after a Song of Kings had been played. Now, that Leadership approach is quite strange also, especially Timely Aid: first you need the song, then you need secrecy (paying 4 is really not nice) to get an ally: but there are only nine (9!) in the entire deck. The card draw is good though, and I really like the flavour of the deck.\n\n\n\nI agree that Timely Aid is a little strange in a deck with only 9 allies, but if I was playing it, I'd wait until I had a better sense of the ratio of allies remaining in the deck. There are two copies of Will of the West, so maybe I'd wait until I recycled a number of allies into a thinner deck and used Timely Aid to get a cheaper copy of Gildor Inglorion or Northern Tracker. At any rate, you know it's not likely to be a first turn card since you have to both lower your threat and get a Song of Leadership to set it up.\n\nStill, it's worth noting the deck has actually 8 cards that lower threat. In addition to Gandalf and The Galadhrim's Greeting, it has 3 copies of Elrond's Counsel. Again, if you draw through a deck quickly enough, you can start to see the cards you want when you loop them with Will of the West. In the end, I can see drawing 5 cards from Peace, and Thought in the same turn as 1 from Bilbo and 2 from Daeron's Runes, plus your base draw, to get 8 draw, or 11 if you Sneak Attack Gandalf for 3 draw. If you're cycling 11 cards in a turn, you might get 2 or more copies of Elrond's Greeting from a thin deck and reduce your threat by 6 for basically free.\n\nIt's too bad there aren't more Hobbit cards. I was really hoping for a new Hobbit ally, or something, but it's interesting to see that the strategy is to hide from enemies. I can't imagine that it would work in scenarios like Into Ithilien, but it might work in some."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804630","commentId":804630,"userName":"Style75","timestamp":1371564716,"content":"I like the idea of this deck but I keep thinking about what happens to all those enemies you are sending to the staging area? Nothing. And next round they'll be threat you have to deal with. I can see the staging area getting blocked full of enemies and becoming a wall of threat so large that no progress can be made. You won't be attacked, but you'll still lose because at the end of the day you still have to put progress on those quest cards. I really want to make a workable hobbit deck, but I don't think this is it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804647","commentId":804647,"userName":"richsabre","timestamp":1371567169,"content":"Style75 said:\n\n \n\nI like the idea of this deck but I keep thinking about what happens to all those enemies you are sending to the staging area? Nothing. And next round they'll be threat you have to deal with. I can see the staging area getting blocked full of enemies and becoming a wall of threat so large that no progress can be made. You won't be attacked, but you'll still lose because at the end of the day you still have to put progress on those quest cards. I really want to make a workable hobbit deck, but I don't think this is it.\n\n \n\n \n\ni would think that hobbits will get more ways to deal with those enemies in staging. things like 'thrown stone' or 'hobbit bow' which can deal direct damage\n\nid also love to see something showing the dunedain's watch over the shire\n\n'dunedain watch'\n\nafter an enemy is sent back to the staging area, reduce its threat to 0 until the end of the round"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804656","commentId":804656,"userName":"Mr Coffee","timestamp":1371568911,"content":"I had the same thoughts that Thorongil and Style had while looking at the deck they created for the article.  Granted, some of the events DON'T return enemies to the staging area… but basically, the deck boils down to this: \n\nPlay the \"evade\" cards to keep enemies in front of you but unable to attack, while racing against the clock to quest out before your threat gets driven up by Frodo and Pippin.  You can prolong this by playing the threat reduction cards, which get fueled by the deck's draw and recycle mechanics.\n\nIn theory, it's doable.  As long as you get all the right cards in your hands (like every other deck).  And we tend to not like decks that are contingent on specific card combos to be successful (in this case, the Song and threat reduction to try and set up secrecy).  The downside I see is more based around WHICH encounter you are playing.  Forget anything with a battleground in it.  Forget anything that has a requirement to kill XYZ big enemy…\n\nHere's where I reserve judgement.  It's really the FIRST attempt at anything all-Hobbits.  like every other group in the game, it's gonna take time for more strategies to get fleshed out (ie- there will need to be more cards).  My first reaction was somewhat disappointed in not only the deck, but those newer hobbit-dedicated cards (Small Target, etc).  BUT, if we go off track record, every time FFG gives us a glimpse, this forum has a history of fairly negative reaction… then the \"rest\" of what FFG DIDN'T spoil gets revealed, and we all gush about how much we love this game, how amazing the company is, etc… lol.\n\nI don't think that there will necessarily be an immediate mind-blowing revelation in this next pack that will make Hobbits an instant \"beat any encounter\" race.  But I LOVE the fact that they are at least giving them something now slowly.  It's an LCG (and a young one at that).  The cards will come…. (I'm looking at you, \"The Black Riders\" expansion)…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804689","commentId":804689,"userName":"GrandSpleen","timestamp":1371576008,"content":"If nothing else, I would like to try this kind of deck simply because I have never played such an event-heavy deck.  That kind of configuration seems to me to be much more heavily influenced by circumstance, and its success is more heavily dependent on the skill of the player.  It takes more calculation on the player's part with regards to the timing of your event plays.  With ally- and attachment-heavy decks you pretty much want to play all your cards ASAP (with the exception of cards that have \"when entering play\" type abilities).  This deck still needs it allies and attachments to be successful, but with 29 events it is certainly different from anything else I have seen proposed by players on this forum.  Gotta applaud it for originality at the very least.\n\nOne benefit is that there are fewer encounter cards overall that really cripple you if you depend on events to succeed.  But the ones that do target event cards would paralyze this deck: \"no event cards may be played,\" \"discard all events,\" \"when an event card is played, this enemy makes an immediate attack.\"  Ouch!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804700","commentId":804700,"userName":"Pharmboys2013","timestamp":1371579657,"content":"a silver lining i see in the preview article is that since no other cards from the pack were shown, maybe that means all the other player cards are trait specific (or at least a majority of them) so it wouldnt have made sense to spoil them in the hobbit deck.  It would be nice to get some Gondorian weapons or some more silvan allies, even ranger and outlands cards would be cool too"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804722","commentId":804722,"userName":"legolas18","timestamp":1371585515,"content":"In order to even use Elrond's Counsel, you'd need a unique Noldor character, which obviously, none of the hobbits are. You'd have to get someone like Gildor out first, which would mean either a lot of saving up on Bilbo's part, or going the Put the Song of Leadership on Someone In Order to Use Timely Aid Way. It just isn't really ideal. But I agree, this is a first attempt on a pure hobbit deck. I suppose they'll get much stronger in the future.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804751","commentId":804751,"userName":"Nerdmeister","timestamp":1371594639,"content":"legolas18 said:\n\nIn order to even use Elrond's Counsel, you'd need a unique Noldor character, which obviously, none of the hobbits are. You'd have to get someone like Gildor out first, which would mean either a lot of saving up on Bilbo's part, or going the Put the Song of Leadership on Someone In Order to Use Timely Aid Way. It just isn't really ideal. But I agree, this is a first attempt on a pure hobbit deck. I suppose they'll get much stronger in the future.\n\n \n\n\n\nArwen is in the deck and is also a unique Noldor character. I´d propose trying to get her out to fuel Elrond´s Counsel rather than Gildor, since you can afford her on a single round´s worth of resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804753","commentId":804753,"userName":"Nerdmeister","timestamp":1371594829,"content":"lleimmoen said:\n\nThe threat reduction only has two copies of the Greeting\n\nFFG has previously been punked for building their example decks using more than one copy of a core set. I think Galadrim Greeting only has two copies in core."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804771","commentId":804771,"userName":"leptokurt","timestamp":1371606235,"content":"Nerdmeister said:\n\nlegolas18 said:\n\n \n\nIn order to even use Elrond's Counsel, you'd need a unique Noldor character, which obviously, none of the hobbits are. You'd have to get someone like Gildor out first, which would mean either a lot of saving up on Bilbo's part, or going the Put the Song of Leadership on Someone In Order to Use Timely Aid Way. It just isn't really ideal. But I agree, this is a first attempt on a pure hobbit deck. I suppose they'll get much stronger in the future.\n\n \n\n \n\n \n\nArwen is in the deck and is also a unique Noldor character. I´d propose trying to get her out to fuel Elrond´s Counsel rather than Gildor, since you can afford her on a single round´s worth of resources.\n\n\n\nArwen also helps to build up the Bilbo-Defense which concists of Bilbo equipped with several Fast Hitches, Burning Brand and Arwen to boost his defense to three. That's my main issue with the hobbit theme - it already offers you a way to handle multiple enemies, so all these new cards, as good developed as they are, are rather useless.\n\nI hope that the hobbits will get some kind of weak power of attacking/damaging enemies in the staging area. They're obviously good at hiding, so they should be able to hurt an enemy before he can see them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804773","commentId":804773,"userName":"Ellareth","timestamp":1371606694,"content":"Nerdmeister said:\n\nlleimmoen said:\n\n \n\nThe threat reduction only has two copies of the Greeting\n\n \n\nFFG has previously been punked for building their example decks using more than one copy of a core set. I think Galadrim Greeting only has two copies in core.\n\n\n\n \n\nAww but the deck does require multiple copies of Core Set as it has x3 Test of Will and Sneak Attack.\n\nThe Deck in the article is by no means a cutting-edge deck.\nI doubt the deck will be able to win against any scenarios with consistency unless you are playing easy mode in multiplayer game.\nI mean.. I don't even see a way for this deck to kill a Forest Spider. Reveal any of below 20 threat enemy in first turn (East Bight Patrol, Dol Guldur Orcs, King Spider) and the deck might actually even struggle against Passage Through Mirkwood.\n\nHaving said that, with the recent introduction of Easy Mode, I don't see a problem with seeing inefficient thematic decks from time to time; the deck does try to be 'inovate' people away from using allies as chump blocker and instead focus on few unique allies with lot of events.\nIf I was to play this deck, I would probably get rid of some of the Secrecy Cards, include Rivendell Minstrels and Dunedain Attachments, add few more readying effects (Miruvor, more Fast Hitch, an Unexpected Courage), and call it an Eriador deck.\n\nBut I'm very pleased Secrecy cards are back on the spotlight, perhaps this is a hint we will see more Secrecy pretty soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804804","commentId":804804,"userName":"richsabre","timestamp":1371622709,"content":"leptokurt said:\n\nI hope that the hobbits will get some kind of weak power of attacking/damaging enemies in the staging area. They're obviously good at hiding, so they should be able to hurt an enemy before he can see them.\n\n\n\nas i said previously i think this will surely happen, along with threat reducing help from 'dunedain protection' cards. this will help with the problem of enemy build up\n\ni really dont see the designers overlooking such a problem as the build up in the staging area. if nothing else, its perhaps more deadly than allowing them to attack piece by piece.\n\ni think there will be plenty of effects that when an enemy is prevented from doing something it gets -1 something\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804905","commentId":804905,"userName":"ana4","timestamp":1371652353,"content":"Yes, hobbits need either a way to get rid of enemies - it would be cool instead of killing them you could just shuffle them back into the encounter deck - very hobbit-like, I must say. Or, they need a way to accumulate enourmous amount of willpower. The given deck, unfortunately, does neither.\n\nI wasn't expecting Elrond's Counsel without Noldor heroes. With a single copy of each Noldor ally, it may be hard to get that applied, especially as Gildor is expensive and Erestor almost as expensive and out of a sphere you don't even possess from the start. Well, I am a bit befuddled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804912","commentId":804912,"userName":"richsabre","timestamp":1371653563,"content":"Ana said:\n\nYes, hobbits need either a way to get rid of enemies - it would be cool instead of killing them you could just shuffle them back into the encounter deck - very hobbit-like, I must say.\n\n\n\ni like this idea.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804919","commentId":804919,"userName":"Thorongil","timestamp":1371655417,"content":"Ana said:\n\nYes, hobbits need either a way to get rid of enemies - it would be cool instead of killing them you could just shuffle them back into the encounter deck - very hobbit-like, I must say. Or, they need a way to accumulate enourmous amount of willpower. The given deck, unfortunately, does neither.\n\n\n\nWhat about O Elbereth! Gilthonial!?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=804929","commentId":804929,"userName":"richsabre","timestamp":1371657921,"content":"Thorongil said:\n\nAna said:\n\n \n\nYes, hobbits need either a way to get rid of enemies - it would be cool instead of killing them you could just shuffle them back into the encounter deck - very hobbit-like, I must say. Or, they need a way to accumulate enourmous amount of willpower. The given deck, unfortunately, does neither.\n\n \n\n \n\nWhat about O Elbereth! Gilthonial!?\n\n\n\nthe problem with the card is that if you go through the encounter deck you have a host of bad cards waiting for you at the bottom\n\nshuffling would be better in some cases (unless you had used cards such as risk some light)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=805045","commentId":805045,"userName":"Nerdmeister","timestamp":1371694146,"content":"richsabre said:\n\nThorongil said:\n\n \n\nAna said:\n\n \n\nYes, hobbits need either a way to get rid of enemies - it would be cool instead of killing them you could just shuffle them back into the encounter deck - very hobbit-like, I must say. Or, they need a way to accumulate enourmous amount of willpower. The given deck, unfortunately, does neither.\n\n \n\n \n\nWhat about O Elbereth! Gilthonial!?\n\n \n\n \n\nthe problem with the card is that if you go through the encounter deck you have a host of bad cards waiting for you at the bottom\n\nshuffling would be better in some cases (unless you had used cards such as risk some light)\n\nrich\n\n\n\nThough the problem might be mitigated somewhat for a solo experience as only one card (surge not withstanding) is drawn each quest-phase. Depending on the circumstances you can chance it, that you won´t see that particular enemy again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=805057","commentId":805057,"userName":"ana4","timestamp":1371699543,"content":"Thorongil said:\n\nAna said:\n\n \n\nYes, hobbits need either a way to get rid of enemies - it would be cool instead of killing them you could just shuffle them back into the encounter deck - very hobbit-like, I must say. Or, they need a way to accumulate enourmous amount of willpower. The given deck, unfortunately, does neither.\n\n \n\n \n\nWhat about O Elbereth! Gilthonial!?\n\n\n\nIt should be Gilthoniel actually.\n\nAnd yes, something of the like - but more specific to the Hobbits (like you can only play the card when you have a Hobbit). And also without the need to suffer the blow first - though that's fine too.\n\nThe card I like very much is the Small Target but that one didn't make the cut here, it seems. One still needs some encounter control to have more than just a statistical chance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=805148","commentId":805148,"userName":"Pharmboys2013","timestamp":1371728057,"content":"i think it says a lot about this preview article that we've spent 2 pages essentailly just criticizing the deck list"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=805154","commentId":805154,"userName":"Tracker1","timestamp":1371729195,"content":"Pharmboys2013 said:\n\ni think it says a lot about this preview article that we've spent 2 pages essentailly just criticizing the deck list\n\n\n\nWell here is a comment about the quest; it has to be the easiest quest to date if the deck they showed us beat it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=805156","commentId":805156,"userName":"richsabre","timestamp":1371731216,"content":"at least its keeping the forum quite active (sort of)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85225-hobbits-to-the-rescue/?do=findComment&comment=805189","commentId":805189,"userName":"Pharmboys2013","timestamp":1371742281,"content":"richsabre said:\n\nat least its keeping the forum quite active (sort of)\n\nrich\n\n\n\nha, quite right"}]}