{"url":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/","title":"Concerning quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=804891","commentId":804891,"userName":"Khamul The Easterling","timestamp":1371648123,"content":"So when you guys are like \"I want to play LOTR Card Game\" and you sit down to were you have your stuff and your going to pick a quest to play but your not sure which yet, what quests are you like \"I just really dont want to play that one\" or \"that quest is so boring now\" or \"ughh I really dont like that quest\"  name all the quests that you think that of.  \n\nFor me I'd say prob: \n\nPassage Through Mirkwood (Too easy) \n\nThe Siege of Cair Andros (Man I can't even get a start in this one……)\n\nA Journy to Rhosgobel (I wish you didnt have to include ranged guys cuz those bats and stuff are so annoying.  Otherwise I wouldn't hate this quest so much)\n\nInto the Pit (played so many times I'm just pretty darn sick of the Khazad-Dum feel.)\n\n \n\nHow bout you guys?\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=804892","commentId":804892,"userName":"richsabre","timestamp":1371649137,"content":"good thread.\n\nI think i am so obsessed with this game there are non i find boring to the point that i dont want to play them anymore\n\ni think for a long while i overplayed hunt for gollum, as it was my favourite, so i didnt play it for  a while, though im starting to play it more as its more challenging 2/3 handed\n\ni found the hobbit riddle quest to be annoying first few times i played it, though i did win it 3 player i havnt tried it since.\n\nithillien and siege of cair andros are hard but i wouldnt say that stops me from playing them, im just waiting until i build the right deck for it.\n\n \n\ni think most of my descisions are based on\n\n- firstly and most importantly, theme. if i feel like the mines of moria then ill pick up one of those, if i feel like something brighter ill go for something like rehorn gate\n\n- what decks i have built. as we know a lot of quests need purpose built decks…not all, but those such as rhosgobel and some of the later ones\n\n \n\neven though mirkwood is easy, i still play it when im testing deck ideas, or have a weaker theme deck\n\ni think theres a place for all the quests, even the easy ones.\n\nrich\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=804894","commentId":804894,"userName":"Khamul The Easterling","timestamp":1371649653,"content":"How often do you play TLD and SAF\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=804895","commentId":804895,"userName":"richsabre","timestamp":1371650004,"content":"Khamul The Easterling said:\n\nHow often do you play TLD and SAF\n\nKhamul\n\n\n\nshadow and flame not so much. it would probably come under one of those 'rhosgobel' type quests.\n\nthe long dark i played a lot solo when it came out because it was so easy. less so now with the expanding card pool, as i can beat more quests than i used to.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805022","commentId":805022,"userName":"GrandSpleen","timestamp":1371686563,"content":"To be honest, a big factor in my quest choice lately has been time committment.  I'll play quests that don't require me to significantly alter my deck for a chance at victory (like Cair Andros).  I do have fun doing that, but I'm pretty busy lately and would rather spend my time playing the game than playing the metagame, if you will.  \n\nSo I haven't played Into Ithilien or Siege of Cair Andros for awhile, or other quests that just tend to take a long time like Flies and Spiders or Into the Pit (even though Into the Pit is one of my favorite scenarios).  Lately I've been preferring the short and sweet ones like Watcher in the Water and A Journey to Rhosgobel.  That last one does need some specific deck building, but it's as simple as throwing in about 5 healing cards to decks I'm already using."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805313","commentId":805313,"userName":"monkeyrama","timestamp":1371806697,"content":"These days I find I only have the time to play a small number of quests, so I usually play the most recently published, and ones that share an encounter deck pool with it. That means lately it's been all Steward's Fear and Peril in Pelargir. When I get to pick, Foundations of Stone or some Kazad Dun quests come out, and I largely don't play the Mirkwood cycle any more. I have been meaning to play through it with some decks, but I don't have the time. Sadly. I agree with GrandSpleen: time is the big decider, and right now, I play with the two decks I've got built, and play scenarios I know I'll enjoy (PiP ftw!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805412","commentId":805412,"userName":"Glaurung","timestamp":1371853839,"content":"What is a point to play old quests like a SOM? They are boring and easy compare new cycle. Yes nightmare sure will change it and i will back to them.\n\nI really love KD but now is to easy with a new cards. So really cannot wait KD nighmare cards!\n\nI play last cycle quests now and HON. Those quests a incridible!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805430","commentId":805430,"userName":"Ellareth","timestamp":1371862342,"content":"I usually like to build a deck and try to play through Core Set -> SoM -> MaO -> Khazad -> Dwarrowdelf -> Hobbit Sagas -> Laketown -> HoN -> AtS.\nObviously I won't be able to play them all in one sitting most of the times, so I have majority of the quest and encounter cards packed away in their own boxes and have the cards needed to play the Cycle I'm playing at the moment and the player cards ready in the Core Set box.\n\nSo when I want to play, I would take out my 'current' player deck and the next quest in the line, shuffle them up and start playing.\nTrying to decide which quest to play would take too much time as I am quite indecisive when it comes to deciding what I want.\n\nGlaurung said:\n\nWhat is a point to play old quests like a SOM? They are boring and easy compare new cycle.\n\n\n\nSometimes it's nice to play LotRLCG without having massive sugar surge afterwards. XD.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805464","commentId":805464,"userName":"richsabre","timestamp":1371883607,"content":"Glaurung said:\n\n \n\nWhat is a point to play old quests like a SOM? They are boring and easy compare new cycle. Yes nightmare sure will change it and i will back to them.\n\n \n\n \n\ntheme?\n\nif you arent playing them then try this- build a non crazy powerful deck based around a tolkien theme and then take it against mirkwood.\n\nthat way you gain a new liking to the old packs and you also dont have £60 of packs lying around turning to dust\n\nsee thats the beauty of this game, unlike say lotr online game, where the early areas are basically just pretty places to walk after your character is too powerful, you can scale this game to fit you by making theme decks…you dont even have to wait for nightmare or easy mode!\n\npersonally the mirkwood packs have always been my favourites\n\nrich\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805805","commentId":805805,"userName":"DukeWellington","timestamp":1372022556,"content":"This is a great thread idea.\n\nI pretty much like all the quests, the Hobbit Saga quests are my favorite. For a long time I hated the Willyador quest (JtR) because it was so crazy different from the others that I couldn't build one deck to beat them all so I would skip it. Now I like the wierd ones better. If I had to pick some quests I don't like here would be the list:\n\nDown the Anduin (played the absolute crap out of this one, so it is boring now)\n\nEmyn Muil (this quest is seriously chump easy and mostly just waiting to win; the only challenge is to see how fast you can beat it)\n\nRedhorn Gate (this one is wierd, so I kinda like it, but the deckbuilding options are so limiting because you must have willpower and asfaloth or northern tracker)\n\nThe Long Dark (for some reason I could never get into the flavor on this one; it just seems long and… dark, in a boring way)\n\nRiddles in the Dark (actually I love this quest, but I have beat it enough to be done with it, all that shuffling and guessing--too much work)\n\nCair Andros (again this one is totally different than the other quests, so that is something, but seriously, you just put mono tactics maximum defense--that is literally THE only deck that can beat it, seems lame)\n\nSo that is my list, but honestly, I would play those quests if somebody else wanted to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805826","commentId":805826,"userName":"nismojoe","timestamp":1372029330,"content":"DukeWellington said:\n\nCair Andros (again this one is totally different than the other quests, so that is something, but seriously, you just put mono tactics maximum defense--that is literally THE only deck that can beat it, seems lame)\n\n\n\nOutlands works good on Cair Andros once it gets traction.  I've also been having a good amount of solo success with Outlands vs Battle of the 5 Armies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805863","commentId":805863,"userName":"Glaurung","timestamp":1372042037,"content":"richsabre said:\n\nGlaurung said:\n\n \n\nWhat is a point to play old quests like a SOM? They are boring and easy compare new cycle. Yes nightmare sure will change it and i will back to them.\n\n \n\n \n\ntheme?\n\nif you arent playing them then try this- build a non crazy powerful deck based around a tolkien theme and then take it against mirkwood.\n\nthat way you gain a new liking to the old packs and you also dont have £60 of packs lying around turning to dust\n\nsee thats the beauty of this game, unlike say lotr online game, where the early areas are basically just pretty places to walk after your character is too powerful, you can scale this game to fit you by making theme decks…you dont even have to wait for nightmare or easy mode!\n\npersonally the mirkwood packs have always been my favourites\n\nrich\n\n \n\n\n\nyes i understand your idea but……. I waiting for nightmare to play old quests. I see example of HFG in the one of the lat articles fro FFG and this is really exite me! I love to play on challenge level, i like to scare the Enemies when they come. If you play for example with super powerfull Otlands deck agaisnt the PTM nightmare, the last thing what you want to see is Ungoliatn spown (nightmare version). When revealed effect is: Make every questing characters -2 will power and if someone have a 0 discard him. Most of the time for outlands is mean every one is dead. Then you really pray for: no spown please, please.\n\nthat what i like! This is sound really Tolkiently (if i can say like this) for me. The emenies is really scary and that how you really feel the Mirwood forest and near is a Dol-Guldur.\n\nCannot wait for KD nighmare!!! Sure it will be incridieble."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85313-concerning-quests/?do=findComment&comment=805910","commentId":805910,"userName":"Khamul The Easterling","timestamp":1372064878,"content":"Yes I am also VERY exited about the nightmere packs for the Mirkwood cycle.  I'm also exited for The Seventh Level nightmere.  They will probably make the quests seem new again which I think is great.  "}]}