{"url":"https://community.fantasyflightgames.com/topic/85365-i-need-help/","title":"I Need Help","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85365-i-need-help/?do=findComment&comment=805178","commentId":805178,"userName":"Mogloth","timestamp":1371739773,"content":"OK, so I bought the core set for LOTR yesterday. I've tried reading the rulebook. Man, is that boring. The best thing I did to fully understand how the game plays is I found a YouTube channel called Watch It Played or something. Very helpful.\n\n \n\nAnyway. I need help. I have played about 20 games almost so far. I have yet to win once. I tried straight up with all 4 starter decks. I have even combined 2 spheres to make one deck. I keep getting stomped. Hard.\n\n \n\nAnd I am only trying out the Passage Through Mirkwood quest. This quest is listed as a 1 difficulty in the rule book. 1. And I am 0-20 right now. \n\n \n\nWhat the heck am I doing wrong? Do I SERIOUSLY need to buy adventure packs just to stand a chance at this quest? If that's so, then how did people manage to beat it before Hunt for Gollum debuted?\n\n \n\nFor my deckbuilding, all I essentially did was combine the starter decks of 2 spheres. Maybe took out a couple of cards. Currently I have tactics/lore and spirit/leadership.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85365-i-need-help/?do=findComment&comment=805213","commentId":805213,"userName":"richsabre","timestamp":1371748435,"content":"hello\n\nwithout you saying your understanding of the rules its hard to say where youre going wrong\n\nit may be you are playing the games incorrectly, making it harder for yourself\n\nthis is not a certainty however, i assume you're playing solo? this game is difficult solo with just the core set, even the 'level 1' quest\n\ni remember when i got the game before any other packs were out, it took me quite a while to win consistently playing mirkwood, so perhaps its just that.\n\ni started winning consistently when i built 50 card decks that were built purposely for each quest. i would recommend spirit and lore for a lot of them. questing in solo is key before anything else, something just 'rushing' through works.\n\n0-20 is rather high though. how are you loosing most often? threat or death?\n\nso my advice would be to first try and read through the rules book again. there were still rules a few months ago after 2 years of play that i needed clarification on.\n\nalso try some two handed decks. one spirit/lore the other tactics/leadership\n\nand try to give them each a specific task. lore/spirit quests and draw cards, the other attacks and defends and generates resources\n\nalso here are some 'must have' cards:\n\n-steward of gondor - 2 extra resources per turn can help you buy almost anything\n\n-test of will - there still isnt a card that can touch this for 'must have' in a deck\n\n-hasty stroke - similar to above in core set card pool\n\n-galadrims greeting - lower all players threat, or your own by more\n\n-unexpected courage - ready 1 extra per turn\n\n-feint - stop an enemy attack\n\n \n\nrich\n\nPS - card packs will make things easier, especially for solo player early on. however this is not, in my opinion, a pay-to-win game. i think the main reason is the core set difficulties were a little hit and miss.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85365-i-need-help/?do=findComment&comment=805222","commentId":805222,"userName":"Mogloth","timestamp":1371751455,"content":"Well, me being a gamer, I feel I have a fairly decent understanding of the rules. Of course, I could always be wrong on some of them. That goes with the territory. \n\n \n\nI have been playing the full regular game. Solo. One deck only. Shadow effects. \n\n \n\nJust a few minutes ago, I won my first game. I had decided to stop using shadow effects. I was playing a Spirit Leadership deck. With Eowyn, Aragorn, and Eleanor. Core only. I just combined the 2 pre made decks. \n\n \n\nSomewhere along the way I may have skipped a step or two. Like adding a threat at the end of the round. I feel like what helped me most in this game was getting to use Galadrim's Greeting twice. Kept anything from aggroing. And I had Steward of Gondor on Aragorn. That was nice. I believe I also had Celebrian's Stone on Aragorn as well. And I have yet to draw A Test of Will during a game.\n\n \n\nI was always losing by just getting run over by the monsters. With bad luck of the draw you can aggro 2 monsters that first turn in Pasage Through Mirkwood. And if you spent 2 heros on the Quest Phase then you're looking at a world of hurt from the get go. And it would just compound from there. \n\n \n\nNot doing the shadow effects seems to make it a little better, but it feels like cheating in order to win. Maybe that's just me though. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85365-i-need-help/?do=findComment&comment=805223","commentId":805223,"userName":"richsabre","timestamp":1371752495,"content":"what proportion of your deck is allies? cheap allies are a must have i think, even just to sacrifice so you can push ahead and quest.\n\nthis rush strategy isnt something i would do a lot, and its not particularly fun, but it gets a few wins when you need them\n\nfor instance, when faced with the option, i would sometimes commit almost all of my forces to the quest if i knew that there was only going to be 1 enemy that round.\n\nof course surge can really mess things up here, but in general, if you have a test of will handy, and no enemies in staging area, and you are playing solo, then go for it on the quest.\n\neven with no allies, you could let one of your heros take the damage undefended then heal. this is risky, but sometimes its worth it.\n\nafter playing this game since its release i think i have a good grasp of the general approach you need to win- you need to adapt to each quest, each will need different strategies.\n\nfor instance, mirkwood has certain ways to help you win. the forest road is a help- even if you think that extra 1 threat per turn is not so bad, you can commit all your heros to the quest, then travel to it and ready to defend.\n\noften, if you are questing fast, its perhaps best to slow down before key points, in this case 3b where you may get beorns path (easy) or the spawn (hard).\n\nif you get the spawn you'll want plenty of allies, and probably a feint or forest snare and then a way of killing it.\n\ni would recommend trying 2 handed, for a long time i said i wouldnt try it becuase it didnt feel like the true 'solo' experience, but now its the only way i play, along with 3 handed\n\nyou get so much more out of the games mechanics, and as i said, in the early quests your win rates increase a lot.\n\nrich\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85365-i-need-help/?do=findComment&comment=805227","commentId":805227,"userName":"Mogloth","timestamp":1371754293,"content":"Well, there's really not much to deck building as I only have 1 core set. I may take a few cards out, but that's about all. 2 spheres. \n\n \n\nI just came across an official set of Easy Mode Rules. In looking those over, it seems to take out some of the cards that were just stomping me into a mudhole. Caught In A Web, Hummerhorns, Necromancer's Reach, CHIEFTAIN UFTHAK!!!!!! Man, that chieftain made a laughingstock out of me. \n\n \n\nI'm guessing I'll stick to easy mode until I can manage to get some more cards therefore allowing myslef to actually start constructing decks. \n\n \n\nThanks for replying. I was just ready to throw my cards out a window.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85365-i-need-help/?do=findComment&comment=805239","commentId":805239,"userName":"Pharmboys2013","timestamp":1371760656,"content":"since you are just at the basic level of deck building make sure to optimize your hero line up.  Try and specialize 1 for questing, 1 for attacking, and 1 for defending to keep things simple (although i realize theres not a ton of great defenders in the core set).  Optimize chump blockers if you dont have a stud defender like gondorian spearman or snowbourn scout\n\nsome hero combos to try:\n\nGlorfindel - Eowyn - Denethor\n\nQuest with Eowyn, attack with glorfindel, and defend with denethor.  plus theres a lot of really good lore and spirit cards in the core set  so you could make this work\n\n \n\nAragorn - Theodred - Anyone\n\nThis combo of the ill fated prince and the reluctant king has been fantastic since day one. you basically get to use aragorn twice for free. Use the last hero spot to supplement whatever sphere you want\n\n \n\nEowyn/Glorfindel - Legolas - Gimli\n\nQuest with your spirit or lore hero, soak up damage with gimli and legolas can snipe enemies and help progress.  Using the lore sphere can help heal Gimli if he takes more damage than you're comfortable with\n\n \n\nCard combos\n\nSneak attack plus gandalf\n\ncitadel plate plus gimli\n\nGloin plus self preservation"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85365-i-need-help/?do=findComment&comment=805268","commentId":805268,"userName":"mr.thomasschmidt","timestamp":1371775138,"content":"Welcome to this great game. I just wanted to chip in with my two cents. I know you said you got a food understanding of the rules and that you watched someone at YouTube. My two advices is first to watch the FFG official video where they explain all the rules. They have a link in the product page under support. It's 4 or 5 videos about 3-5 min each. It really made my day when I first saw them even though I also thought I had understood the rules :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The second thing is getting the UNOFFICIAL COMPLETE CARD LIST AMD FAQS. I think the latest version is 7.1. You can find it at boardgamegeek.com. Or PM me and I'll find the exact link for you. You'll definitely gonna need it for all those small situations when suddenly you get in doubt how a certain card works in a certain situation. Well, and off cause, keep posting and asking here at the forum. Most people here are really nice and helpful and really try to help you out because most of us has been there ourself :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] keep it up. Oh, and when you get tu Journey down the Anduin search this forum. Most people have been stuck in one way or another in this particular quest and there's a lot of good advises to get :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] personally I didn't have much problems with the 1st quest but the Anduin quest, man, I think I went 0-50 before figuring it out ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] so keep it up"}]}