{"url":"https://community.fantasyflightgames.com/topic/85387-expansions-question/","title":"Expansions Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85387-expansions-question/?do=findComment&comment=805311","commentId":805311,"userName":"Mogloth","timestamp":1371806568,"content":"So, I only have the core set. And it appears that at least Hunt for Gollum is not in production right now. So, since I would be unable to do the Mirkwood packs fully, can I move on to other sets? Or do I need to get Mirkwood before moving on?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85387-expansions-question/?do=findComment&comment=805315","commentId":805315,"userName":"richsabre","timestamp":1371806936,"content":"a fellow gamer recently found a store that stocks mirkwood- look for a thread called 'get mirkwood here' on the main thread page\n\n \n\nif you cannot, then it doesnt matter. however - ….you need to have the deluxe set 'khazad dum' before you can play any of the following 'dwarrowdelf cycle' or alternatively you can skip that cycle and move onto the current one 'against the shadow' cycle. to buy that you need the hiers of numenor deluxe pack\n\nthat is how the packs work - deluxe set, then cycle and so on….\n\nthere are 'saga packs', currently 2..those are the hobbit ones. you do not need anything else than core set to play them\n\n \n\nso right now your options are\n\n-try to get mirkwood packs\n\n-buy khazad dum then you can get any of the 6 dwarrowdelf packs (in any order if you wish)\n\n-buy hiers of numenor then you can get any of the against the shadow packs (only 2 are out at the moment)\n\n-buy the hobbit saga packs (again in any order if you wish)\n\n-you could also get the POD packs, escape from osgilliath and battle for laketown\n\nthese are both hard quests, but can be played with just core set\n\n \n\nit is just my opinion, but the quests certainly get harder (in general that is) as the packs go on. so hiers of numenor is much more difficult than khazad dum, so if you cannot get any mirkwood packs, i would go for khazad dum first, then the packs from that cycle\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85387-expansions-question/?do=findComment&comment=805375","commentId":805375,"userName":"John85","timestamp":1371837690,"content":"richsabre said:\n\n[…]\n\n-buy hiers of numenor then you can get any of the against the shadow packs (only 2 are out at the moment)\n\n[…]\n\nthese are both hard quests, but can be played with just core set\n\n \n\nit is just my opinion, but the quests certainly get harder (in general that is) as the packs go on. so hiers of numenor is much more difficult than khazad dum, so if you cannot get any mirkwood packs, i would go for khazad dum first, then the packs from that cycle\n\nrich\n\n\n\nRich is correct (as usual), that being said, FFG has tried to make Heirs a viable entry point from the Core set with the release of the Outlands characters. It is a limited strategy but it is viable (and I think that is what FFG was going for; obviously buying all 12 APs, 2 Deluxe Exp., and 2 Saga Exp. is great too, but the unavailability of the early APs and expense is certainly off-putting for new players)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85387-expansions-question/?do=findComment&comment=805379","commentId":805379,"userName":"Mogloth","timestamp":1371839078,"content":"OK. Thanks for the replies. I was worried that I would need to go find the Mirkwood stuff before Khazad Dum. But, if I can jump straight to Moria and bypass Mirkwood and not really be affected, then that is a good thing.\n\n \n\nNow, I just need to find someone with money burning a hole in their pocket. Heh.\n\n \n\n "}]}