{"url":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/","title":"Encounter at Amon Din","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805386","commentId":805386,"userName":"Raven1015","timestamp":1371841349,"content":"Just thought you all would be interested to check out a player card from Encounter at Amon Din that I had a chance to spoil on my blog. Enjoy!\n\n \n\n http://talesfromthecards.wordpress.com/2013/06/21/exclusive-spoiler-encounter-at-amon-din/ [http://talesfromthecards.wordpress.com/2013/06/21/exclusive-spoiler-encounter-at-amon-din/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805387","commentId":805387,"userName":"Gizlivadi","timestamp":1371842118,"content":"So FFG officially lets the fan bloggers of the game spoil cards now? Amazing, that's all I can say. As for the card, I think that actually letting you discard it to cancel a surged card without the random factor is good enough; after all, you have to discard him. But it looks okay to me, though I think that in a deck without good scrying it will maybe be a bit underplayed. Not impressed, but it's a cool little effect that can sometimes save you. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805431","commentId":805431,"userName":"Ellareth","timestamp":1371863248,"content":"So that's why there wasn't a spoiler in the last article!\nRecognizing and giving special treats to dedicated fans was (I think) a great move.\n\nLampwright will be a very welcome addition to almost any deck I have that has Spirit.\nI don't know if they will always make it to the final cut, but I know they will definitely be runners up at the very least.\n\nBeing an ally with cost of 1 is good enough by itself as it can be used as chump blocker on turn 1.\nLampwright brings up number of 1 cost ally for Spirit to 2 (3 copies each, so 6 cards total), which means now Spirit can expect to draw chump blocker almost every game like Leadership used to.\n\nUnless I am very much mistaken, trait Gondor is bound to be as powerful as Outlanders or Dwarves by the end of this Cycle, so an Gondor ally that can be played with cost of 1 resource can't go wrong.\n\nOn top of that, he comes with the ability that helps you prevent things from getting out of hand.\nYou still need to guess the type of the card that surges, so the card isn't too powerful, but the effect is still very good.\nAre there already one or two enemies engaged with you and you drew card with surge? Discard Lampwright and guess Enemy.\nAre there locations piling up in staging area and there is a possible danger of threat locking? Discard Lampwright and guess Location.\nAre you in control of situation and only way things could go wrong is if nasty treachery somehow wiping half your characters? Discard Lampwright and guess Trechery."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805436","commentId":805436,"userName":"GongShowHost","timestamp":1371865481,"content":"Just chiming in to say that it is super cool Fantasy Flight let you preview the card! This should be more common! It is only good for the game and community."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805441","commentId":805441,"userName":"Glaurung","timestamp":1371868636,"content":"GongShowHost said:\n\nJust chiming in to say that it is super cool Fantasy Flight let you preview the card! This should be more common! It is only good for the game and community.\n\n\n\nYes i like the idea too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805466","commentId":805466,"userName":"richsabre","timestamp":1371884306,"content":"Raven1015 said:\n\n \n\nJust thought you all would be interested to check out a player card from Encounter at Amon Din that I had a chance to spoil on my blog. Enjoy!\n\n \n\n http://talesfromthecards.wordpress.com/2013/06/21/exclusive-spoiler-encounter-at-amon-din/ [http://talesfromthecards.wordpress.com/2013/06/21/exclusive-spoiler-encounter-at-amon-din/]\n\n \n\n \n\nthanks! the card looks great…. but how does one get chosen for such things?\n\nsome will know that i recently posted a lotr website for a friend and i also had my own in the early stages of the game (hence why i ask)\n\nnot to sound like im being critical of your good work here…because im certainly not, and you have certainly deserved the chance to do this Raven….\n\n…but i hope that ffg let other bloggers have a go also… (just for people's info i dont include my own in this as it was tolkien-themed….im not that jealous burla [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/burlon.gif])\n\ni actually asked for a player (or players) to be the one(s) who writes spoiler articles when ffg cant…so it would be good if we had that- it would really get this forum going more.\n\nwhat would be a great idea is sharing the spoilers out between blogs. im not sure how many there are, not that many still being updated i guess, but then all of them would get visitors and the forum would be lively with different discussions….which is never a bad thing!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805483","commentId":805483,"userName":"Rapier1","timestamp":1371891066,"content":"If it was cancel the surge effect (as your blog suggests) it wouldn't have the potential to nullify a card. (if you don't resolve the surge effect you don't draw the next card).\n\nI'm not sure that would be worth including.\n\n \n\nThe potential for this card to nullify something horrible (sudden pitfall, sleeping sentry level of power I mean) is easily the best part of the card. Far better than just ignoring suge.\n\n \n\nAlso as the blog post eludes too - they are intending to give us means to explore and manipulate the encounter deck. When Palantier was first revealed I felt that the potential threat costs were too high for what wouldn't really help that much (it would in clutch games, but most games you're either overwhelmed and can't afford the cost, or coasting and doing fine anyway). With cards like this though, the cost associated with those cards is ofset by superior ability to synergise to help you win (in the overwhelming situation you might well risk the threat, to potentially make this and the next turn easier).\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805493","commentId":805493,"userName":"Pharmboys2013","timestamp":1371895671,"content":"very cool write up and excellent preview of what i think is a tremendously useful card.  as was already alluded to you the article and in this thread, just having the potential to block whatever kind of card would hurt you most at the time is clutch and really should drive the decision each time unless you've already used cards like risk some light or palantir to know what it is.\n\ncongrats on the opportunity to reveal a card too raven, a very rewarding experience i'm sure!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=805635","commentId":805635,"userName":"Raven1015","timestamp":1371959079,"content":"Thanks for reading everyone! I agree that it was an amazingly awesome gesture for FFG to let me spoil a card, and it really says a lot about them as a game company, and their willingness to embrace and encourage the community, rather than stifle it. I'll just address a couple of things.\n\nRich, I'm not in the know about their future plans for this sort of thing, so don't take anything I say as official. That disclaimer out of the way, I can't imagine that this will be the last time this happens, and I'm guessing that they'll want to reach out to as much of the community as possible. So I would look at this as more of an initial foray and sign of things to come. Again, I'm not speaking for them, but that would be my take.\n\nRapier, you bring up a very interesting distinction between cancelling the surge through preventing another card being drawn and cancelling the surge by nullifying the card that is drawn. I view both as cancellation, which is why I framed it in those terms in the article, but the point you bring up is ripe for discussion. Which is better? I think it's actually a very complicated question. In many cases, nullify would be better, but in some, preventing a card being drawn altogether might be more beneficial, depending on the order of cards in the encounter deck, whether cards will be discarded as shadows, etc. Anyway, as it is, I like the nullifying effect, and the sense of control you have in terms of at least avoiding what you really most want to avoid.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806397","commentId":806397,"userName":"Narsil0420","timestamp":1372258902,"content":"Upcoming page now says July 5th for the release date!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806497","commentId":806497,"userName":"Raven1015","timestamp":1372296331,"content":"Narsil0420 said:\n\nUpcoming page now says July 5th for the release date!\n\n\n\n \n\nWoo-hoo! That is much earlier than I was expecting for some reason. Can't wait."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806572","commentId":806572,"userName":"richsabre","timestamp":1372331407,"content":"lucky americans with your early release dates grrr…..enfadado [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/enfadado.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806642","commentId":806642,"userName":"Gizlivadi","timestamp":1372354366,"content":"richsabre said:\n\nlucky americans with your early release dates grrr…..enfadado [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/enfadado.gif]\n\n\n\n \n\nLucky you all with you… own release dates!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806737","commentId":806737,"userName":"Tornak2","timestamp":1372404798,"content":"Best AP so far.  It's just like the Battle of Lake-Town but you have a better chance to stand against the enemy.\n\nThe story is great and just a good level of difficulty.  Done it twice (one fail and one win) since yesterday.  Hope you will all get it soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806752","commentId":806752,"userName":"Glaurung","timestamp":1372408939,"content":"Tornak said:\n\nBest AP so far.  It's just like the Battle of Lake-Town but you have a better chance to stand against the enemy.\n\nThe story is great and just a good level of difficulty.  Done it twice (one fail and one win) since yesterday.  Hope you will all get it soon.\n\n\n\n \n\nWow wow wow. You got it already! Cool. Details please and some card info too. If some pictures will be amazing. thanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806763","commentId":806763,"userName":"Jekzer","timestamp":1372412615,"content":"Yeah Tornak, if you want to share with us some knowledge about the player cards, encounter cards, story… we'll be pleased to read! cangrejo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/cangrejo.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806781","commentId":806781,"userName":"Gizlivadi","timestamp":1372418019,"content":"Glaurung said:\n\nTornak said:\n\n \n\nBest AP so far.  It's just like the Battle of Lake-Town but you have a better chance to stand against the enemy.\n\nThe story is great and just a good level of difficulty.  Done it twice (one fail and one win) since yesterday.  Hope you will all get it soon.\n\n \n\n \n\n \n\nWow wow wow. You got it already! Cool. Details please and some card info too. If some pictures will be amazing. thanks\n\n\n\nI second this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806810","commentId":806810,"userName":"Tornak2","timestamp":1372426431,"content":"Unfortunaly, I don't have my cards in front of me cause I'm at work, but if I remember well :\n\n \n\nDenethor (Leadership)\n\nAlly (cost 4)\n\n3 Will\n\n1 Prowess\n\n2 Defense\n\n3 HP\n\n-1 Willpower for each damaged hero you control.  If Denethor ever gets 0 Willpower, discard from play.\n\n \n\nUnknown name (the card shows a crown) (Leadership)\n\nAttachment (cost 1)\n\nTitle\n\nMay be attach to Gondor or Outland hero.\n\nIf every hero you control has a printed (lead.) symbol, … gets the following ability :\n\nEvery time you play a (4 spheres symbols) outland character, draw one card.\n\n \n\nGondorian Discpline (Tactic)\n\nEvent (don't remember the cost but sure it is under 3)\n\nPrevent two damages\n\n \n\nUnknown name (the card shows either a book or a scroll) (Tactic)\n\nAttachment (cost 4)\n\nCost may be reduce by the number of heroes you control with a printed (tactic symbol)\n\nDiscard to play a card in your discard pile as if it were in your hand.\n\n \n\nHobbit-sense (neutral)\n\nas you already know it\n\n \n\nThe two spirit card, you have already seen them in various spoilers.\n\n \n\nOne of the Lore card is a gondorian ranger\n\ncost 3 (or 2)\n\nWill 0\n\nAtt 2\n\nDefense ?\n\nHp ?\n\nIf … attacks and damages an enemy, move the enemy to the staging area.\n\n \n\nI have no clue about the second Lore card.\n\nQuite sorry if there are missing information, that is the best I could do right now.  Hoping that it gives a additionnal thrill while waiting for the AP to come.\n\nTornak\n\nP.S. Thanks to the guy I played LOTR with at Regent Park (London, UK) on June 3, 2013.  Sorry I don't remember your name.  That experience showed me that on every aspect, British are truly welcoming and made it worth the 7 hours flight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806814","commentId":806814,"userName":"Tornak2","timestamp":1372428113,"content":"The two spirit card I was talking about are Minas Tirith Lampwright and Small Target"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806816","commentId":806816,"userName":"Gizlivadi","timestamp":1372428588,"content":"Many thanks! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806830","commentId":806830,"userName":"richsabre","timestamp":1372434126,"content":"denethor is very dissapointing….well, the theme is good and makes sense, but i would prefer him being just 1 cheaper.\n\nthe rest look great as usual. looking forward to the pictures\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806897","commentId":806897,"userName":"Glaurung","timestamp":1372462207,"content":"richsabre said:\n\ndenethor is very dissapointing….well, the theme is good and makes sense, but i would prefer him being just 1 cheaper.\n\nthe rest look great as usual. looking forward to the pictures\n\nrich\n\n\n\nYes Denethor sound a bit strange but 3 will power not bad……… Tome is really powerful card, cost 4 but effect is amazing.\n\nReally wonna now about encounter deck…..To be honest i really wait for Osgiliath and Morgul vale. I feel like those 2 quests most difficult and interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806931","commentId":806931,"userName":"lleimmoen","timestamp":1372479201,"content":"Thanks! Would you mind filling the gaps once with the cards?\n\nThe Leadership attachment is perfect for mono-Outlands decks. Denethor is not, sadly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806952","commentId":806952,"userName":"Tornak2","timestamp":1372494275,"content":"Hi, got the cards.\n\n \n\nGondorian Discipline (tactic)\n\nCost 0 (even better than las post)\n\nEvent\n\ngondor\n\nResponse : Cancel up to 2 points of damage just dealt to a Gondor character.\n\n \n\nThe picture is the same as the cover of AP Assault on Osgiliath.\n\n-----------------------\n\n(Unique) Book of Eldacar (Tactic)\n\nCost 4\n\nAttachment\n\nRecord\n\nAttach to a (tactic icon) hero.\n\nReduce the cost to play Book of Eldacar by 1 for each hero you control with a printed (tactic icon) ressource icon.\n\nAction : Discard Book of Eldacar to play any (tactic icon) event card in your discard pile as if it were in your hand.  Then, place that event on the bottom of your deck.\n\n------------------------------\n\nIthilien Archer (lore)\n\nCost 3\n\nAlly\n\nGondor, Ranger\n\nRanged\n\nResponse : After Ithilien Archer attacks and damages an enemy, return that enemy to the staging area.\n\n---------------------------------\n\nIthilien Pit (lore)\n\nCost 1\n\nAttachment\n\nTrap\n\nPlay Ithilien Pit into the staging area unattached.\n\nIf unattached, attach Ithilien Pit to the next eligible enemy that enters the staging area.\n\nAny character may chose attached enemy as the target on an attack.\n\n \n\nArt : Dramatic scene of an (very weel drawn by Davil Gaillet) orc with a pony tail trying to get out of a pit (duh), his right hand trying to reach a root or something like that and all you see in the background are legs, weapons and shields of Free People warriors.\n\n---------------------------------\n\n(Unique) Denethor (leadership) ally is exactely like my last posts (unfortunaly it seems…)\n\n---------------------------------\n\n(Unique) Lord of Morthond (leadership)\n\nCost 1\n\nAttachment\n\nTitle\n\nAttach to a Gondo or Outlands hero.\n\nIf each hero you control has the printed (lead. icon) ressource icon, Lord of Morthond gains :\n\n''Response : After you play a (all 4 icons) ally, draw 1 card.''\n\n-------------\n\n \n\nEven though the last card doesn't say ''If attached to Hirluin the Fair,…'', IMO it it pretty much the only hero on wich that card can be attached.  If you don't play Hirluin, you would have to use three other leadership heroes and pretty much all the attachment song cards to get the benefits of the card Lord of Morthond.  Seems to me it would be a lost of card space.\n\n \n\nI usually play Napolitan deck with leadership, lore and spirit when playing solo and momo-sphere leadership with 3 other players.  Since the two lore cards are so awesome, it think I will use mono-lore for the next few games. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806953","commentId":806953,"userName":"Tornak2","timestamp":1372494985,"content":"richsabre said:\n\ndenethor is very dissapointing….well, the theme is good and makes sense, but i would prefer him being just 1 cheaper.\n\nthe rest look great as usual. looking forward to the pictures\n\nrich\n\n\n\n \n\nHey,\n\nKnow that you all like to see pictures as soon as possible, but both camera and cell phone are broken right now.  Don't think anything will be repaired nor replaced until the AP gets to your nearest store.\n\nYou will have to use your imagination until then, but isn't it the beauty of the game ? Not the art of the cards, not the power of the card but to fell you are part of the adventure along with your heroes striking orcs or negociating with Woses.\n\n \n\nOliver"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806987","commentId":806987,"userName":"Khamul The Easterling","timestamp":1372505949,"content":"I agrew with Glaurung.  The quest always is always more interesting to me than the player cards. (But I do like the player cards) Is the quest Enemy Heavy? Location Heavy? Or treachery? Gosh I'm really wanting a hard quest soon since both TSF and DF are pretty easy. (Solo at least) You would think we would get mostly hard quests now nice we got 1 med and 1 easy.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=806994","commentId":806994,"userName":"Gizlivadi","timestamp":1372506945,"content":"Tornak said:\n\nrichsabre said:\n\n \n\ndenethor is very dissapointing….well, the theme is good and makes sense, but i would prefer him being just 1 cheaper.\n\nthe rest look great as usual. looking forward to the pictures\n\nrich\n\n \n\n \n\n \n\nHey,\n\nKnow that you all like to see pictures as soon as possible, but both camera and cell phone are broken right now.  Don't think anything will be repaired nor replaced until the AP gets to your nearest store.\n\nYou will have to use your imagination until then, but isn't it the beauty of the game ? Not the art of the cards, not the power of the card but to fell you are part of the adventure along with your heroes striking orcs or negociating with Woses.\n\n \n\nOliver\n\n\n\nSo there's no card with the picture of this AP's box?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807001","commentId":807001,"userName":"GrandSpleen","timestamp":1372509173,"content":"Gizlivadi said:\n\nSo there's no card with the picture of this AP's box?\n\n\n\nSometimes it's an encounter card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807002","commentId":807002,"userName":"Gizlivadi","timestamp":1372509502,"content":"GrandSpleen said:\n\nGizlivadi said:\n\n \n\nSo there's no card with the picture of this AP's box?\n\n \n\n \n\nSometimes it's an encounter card.\n\n\n\nMost of the times, though this one really feels like a character card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807015","commentId":807015,"userName":"Pharmboys2013","timestamp":1372514390,"content":"my thoughts:\n\ngondorian discipline- i think its a card that may seem better after use especially in multiplayer, but currently is kind of underwhelming. Especially since the only two tactics gondor heroes are Beregond and Boromir, the former of which should almost never have to take any damage\n\nBook of eldacar- awesome card, even better to think we'll get one of these for each sphere. i like how it doesnt render Hama obsolete either and is still quite usable even if using 2 tactics heroes rather than 3\n\nithilien archer- pretty good i guess…much more useful in multiplayer than solo since sending things back to the staging area is generally bad unless you have another player you're with who is more equipped to engage them.  With a leadership boromir he has a 3 ranged attack which is quite good.  Also combos well with ranger spikes and the new trap\n\nIthilien pit- interesting card albeit only useful in multiplayer.  practically gives every character ranged so long as they are attacking that enemy. worth running a copy or two if playing with others. will be good against \"boss\" like enemies\n\nDenethor- kind of disapppointing (i suppose only because he has an uninteresting \"ability\") but i'll still use him especially if the art is cool. 4 cost isnt a huge issue especially in leadership.  If he's included with any deck that has healing he'll be quite useful….also its worth noting that this breaks FFG's trend only changing spheres if a character stays the same type of card…anything/anyone is fair game now!!\n\nLord of Morthond- really like this card and should be auto include in all solo leadership decks regardless of if they are outlands or not.  With all of leaderships cheap allies this will be super helpful in a sphere that traditionally lacks card draw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807121","commentId":807121,"userName":"lleimmoen","timestamp":1372555606,"content":"No, the Ithilien Pit allows players to attack the trapped enemies even in the staging area, which makes it a very game-changing Lore card, I say. And suddenly the Advance Warning makes all the more sense.\n\nI also think Gondorian Discipline combos wonders with Tactics Boromir.\n\nAnd Lord of Morthond is simply amazing.\n\nDenethor, however, I cannot be more disappointed.\n\nps: Thanks so much for sharing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807141","commentId":807141,"userName":"DevastazioneH88","timestamp":1372566215,"content":"I don't get why everyone's so disappointed by Denethor…He's a 4 cost (leadership) ally with 3 WP (the only other ally with 3 WP is Gildor who is lore and costs 5). Moreover, he as 2 DEF, 3 HP and 1 ATK (he would be a 9 threat hero)…and, though I'm repeating myself, he costs only 4 (wich is more like 3 in the leadership sphere)…ok he has a pretty bad ability but you can use him to quest when none or one of your heroes are damaged and to defend when 2 of your hereos are damaged. He gets discarded if he evere gets to 0 WP ?…So what ?…you can deal a lot of damage to Aragorn if you have him as a hero (instead of dealing it to other heroes) since he has the chance to raise his HPs with artifacts; in a monosphere deck you can defend with the white tower watchman and, if you don't, you can still deal damage to him, even if exhausted; If you're running tactics you can prevent damage from being dealt to a gondor character and, if you are REALLY running tactics you'll be able to defend quite efficiently so you won't get many heroes damaged; you're running lore ? Well you can heal your heroes…Spirit ? Shadow cancel, so you will know if your defense gets breached by an attack, and if it does, you cancel that shadow …and there are many other ways to prevent damage or to avoid damging more than one hero, like Frodo for example…\n\nI don't know if I explained myself…\n\nIn my opinion he's a great add to the game. I'll obiously need to try him but I really don't see why everyone's so disappointed in him…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807159","commentId":807159,"userName":"Tracker1","timestamp":1372574497,"content":"Tornak said:\n\nHi, got the cards\n\n---------------------------------\n\n(Unique) Lord of Morthond (leadership)\n\nCost 1\n\nAttachment\n\nTitle\n\nAttach to a Gondo or Outlands hero.\n\nIf each hero you control has the printed (lead. icon) ressource icon, Lord of Morthond gains :\n\n''Response : After you play a (all 4 icons) ally, draw 1 card.''\n\n------------\n\nEven though the last card doesn't say ''If attached to Hirluin the Fair,…'', IMO it it pretty much the only hero on wich that card can be attached.  If you don't play Hirluin, you would have to use three other leadership heroes and pretty much all the attachment song cards to get the benefits of the card Lord of Morthond.  Seems to me it would be a lost of card space\n\n\n\nIn an earlier post you said this only functions when you play outlands characters.  Is it really any ally, not just outlands?\n\nIf it is any ally, it seems like any mono-leadership deck could benifit.  Even a deck without a gondor or outlands hero if you runSteward of Gondor your all set.\n\nThis card functions like Legacy of Durin, but it says play the ally rather then play from hand.  Is there a difference.  I've got the play from hand and put into play distinction, but where does play stand?  I assume it means play from your hand, but it's easier if it just says that on the card "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807166","commentId":807166,"userName":"richsabre","timestamp":1372576343,"content":"DevastazioneH88 said:\n\nI don't get why everyone's so disappointed by Denethor…He's a 4 cost (leadership) ally with 3 WP (the only other ally with 3 WP is Gildor who is lore and costs 5). Moreover, he as 2 DEF, 3 HP and 1 ATK (he would be a 9 threat hero)…and, though I'm repeating myself, he costs only 4 (wich is more like 3 in the leadership sphere)…ok he has a pretty bad ability but you can use him to quest when none or one of your heroes are damaged and to defend when 2 of your hereos are damaged. He gets discarded if he evere gets to 0 WP ?…So what ?…you can deal a lot of damage to Aragorn if you have him as a hero (instead of dealing it to other heroes) since he has the chance to raise his HPs with artifacts; in a monosphere deck you can defend with the white tower watchman and, if you don't, you can still deal damage to him, even if exhausted; If you're running tactics you can prevent damage from being dealt to a gondor character and, if you are REALLY running tactics you'll be able to defend quite efficiently so you won't get many heroes damaged; you're running lore ? Well you can heal your heroes…Spirit ? Shadow cancel, so you will know if your defense gets breached by an attack, and if it does, you cancel that shadow …and there are many other ways to prevent damage or to avoid damging more than one hero, like Frodo for example…\n\nI don't know if I explained myself…\n\nIn my opinion he's a great add to the game. I'll obiously need to try him but I really don't see why everyone's so disappointed in him…\n\n\n\nwhile i agree with most of what you say, i think the problem for me is, all the above is just a pain to set up in a game…..basically he is just not worth setting up a strategy where you minimise damage on your heros, just for him.\n\nif he had an additional ability or was cheaper then i think he would be worth setting up a deck to work round him, but i just see him as a rather difficult ally to place in a deck\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807169","commentId":807169,"userName":"lleimmoen","timestamp":1372577618,"content":"I would rather have the Lord of Morthond say any Gondor or Outlands ally (and only attachable to a Gondor hero) but as it is, it is a super powerful card. Of course, one can play it with the Steward attached to a Dwarf, but can it get any more lame than that? Haha. I guess I go for Bilbo-esque a bit too much, although I like to win as much as the next Boromir.\n\nSpeaking of theme, it is what really bugs me about Denethor. If there ever was an ally who did exactly what this Denethor's version does, I wouldn't be so disappointed. But I don't quite get this from the theme perspective, why would you make a random Erebor Battle Master the biggest killing machine and then have Denethor being quite average. Because it is what the card is unless there's a synergy which I cannot see. First off, the expensive allies got worse, much worse since the core set. It is in general so much more beneficial to have a swarm of cheap allies, especially when they're Dwarves or Outlands. But I suspect any faction will get there eventually, certainly Gondor shall, once the Visionary Leader (if he does what I think) is out.\n\nAs for \"play from hand\" vs. \"enters play\", I think \"play\" is just a typo from \"play from hand\" - unless we hear otherwise. It has already happened with Erebor Hammersmith (and probably more). I don't think there's a between…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807172","commentId":807172,"userName":"lleimmoen","timestamp":1372578017,"content":"richsabre said:\n\nwhile i agree with most of what you say, i think the problem for me is, all the above is just a pain to set up in a game…..basically he is just not worth setting up a strategy where you minimise damage on your heros, just for him.\n\nif he had an additional ability or was cheaper then i think he would be worth setting up a deck to work round him, but i just see him as a rather difficult ally to place in a deck\n\nrich\n\n\n\nExactly. Who would bother deck-building around an ally when there are just so many other options. And healing is not one of them in the Leadership sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807286","commentId":807286,"userName":"Pharmboys2013","timestamp":1372607364,"content":"Just thinking, if you use aragorn as one of your heroes and attach sword that was broken…Denethor can never be discarded from his effect.  Couple this with ally faramir and possibly visionary leadership and he could still have 3 WP stay in play despite having damage on all 3 heroes.\n\nalso, ithilien pit is wayyyy better now, didnt think you could attack them still in the staging area but i suppose that makes more sense. really good for decks with low starting threat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807823","commentId":807823,"userName":"Tornak2","timestamp":1372871665,"content":"> Gizlivadi said:\n> \n>  \n> \n> So there's no card with the picture of this AP's box?\n> \n>  \n> \n>  \n> \n> Sometimes it's an encounter card.\n\nIt is.  It's the picture of a lord that shall not die during the quest or everyone lose. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807826","commentId":807826,"userName":"Tornak2","timestamp":1372872478,"content":"> Tornak said:\n> \n>  \n> \n> Hi, got the cards\n> \n> ---------------------------------\n> \n> (Unique) Lord of Morthond (leadership)\n> \n> Cost 1\n> \n> Attachment\n> \n> Title\n> \n> Attach to a Gondo or Outlands hero.\n> \n> If each hero you control has the printed (lead. icon) ressource icon, Lord of Morthond gains :\n> \n> ''Response : After you play a (all 4 icons) ally, draw 1 card.''\n> \n> ------------\n> \n> Even though the last card doesn't say ''If attached to Hirluin the Fair,…'', IMO it it pretty much the only hero on wich that card can be attached.  If you don't play Hirluin, you would have to use three other leadership heroes and pretty much all the attachment song cards to get the benefits of the card Lord of Morthond.  Seems to me it would be a lost of card space\n> \n>  \n> \n>  \n> \n> In an earlier post you said this only functions when you play outlands characters.  Is it really any ally, not just outlands?\n> \n> If it is any ally, it seems like any mono-leadership deck could benifit.  Even a deck without a gondor or outlands hero if you runSteward of Gondor your all set.\n> \n> This card functions like Legacy of Durin, but it says play the ally rather then play from hand.  Is there a difference.  I've got the play from hand and put into play distinction, but where does play stand?  I assume it means play from your hand, but it's easier if it just says that on the card \n\n \n\nAs I said earlier, I was not sure I would remember every single word on the cards on my first post because I was at work wihout the AP.  \n\n \n\nThe card ''Lord of Morthond'' and other cards are exactly as the description I made on June 29. \n\n \n\nYou were right Tracker1 when you wrote, you can still use Lord of Morthond without Hirluin and outlands, but it would not be as efficient.  I still have the impression the card was made only for one hero, but as many complained FFG built an all Aragorn armoury, they may have only changed the way of presenting it for another character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807831","commentId":807831,"userName":"Tracker1","timestamp":1372873210,"content":">  \n> \n> As I said earlier, I was not sure I would remember every single word on the cards on my first post because I was at work wihout the AP.  \n> \n>  \n> \n> The card ''Lord of Morthond'' and other cards are exactly as the description I made on June 29. \n> \n>  \n> \n> You were right Tracker1 when you wrote, you can still use Lord of Morthond without Hirluin and outlands, but it would not be as efficient.  I still have the impression the card was made only for one hero, but as many complained FFG built an all Aragorn armoury, they may have only changed the way of presenting it for another character.\n\nThanks for letting me know. I've been wondering. I used legacy of durin as a proxy, and played as an ally played from hand, and it works really well. I used hurluin, imrahil, and theodred, and took down laketown, ithillien, siege, shadow and flame, and others. Really good mono leadership deck solo, almost as good as when i run beravor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807903","commentId":807903,"userName":"Khamul The Easterling","timestamp":1372880503,"content":"Hey so how about the quest?  What's it like? Location Heavy? Enemy Heavy? big boss like the last 2 AP? Super easy? Super hard? Glaurung and I really want to know....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807916","commentId":807916,"userName":"chrsjxn","timestamp":1372881558,"content":"Ithilien Pit seems so niche. Especially since most enemies that are really big can't have attachments.\n\n \n\nThe standout card in the pack definitely seems to be Lord of Mothrond, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807937","commentId":807937,"userName":"lleimmoen","timestamp":1372883519,"content":"> Ithilien Pit seems so niche. Especially since most enemies that are really big can't have attachments.\n\nHmm, I think the Pit is meant for any (legal) enemy really, it is always better to have the chance to strike them first..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=807993","commentId":807993,"userName":"Pharmboys2013","timestamp":1372891455,"content":"I'm really excited to use ithilien pit with low threat decks. For example it's going to be excellent in a Denthor/Spirfindel/Mirlonde I was using before so that I can exclusively use Denethor to scry the deck and avoid using him to defend. Anborn will make all these better too"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808085","commentId":808085,"userName":"kyrie","timestamp":1372916213,"content":"Just picked up Amon Din today and found that the attachment \"Lord of Morthond\" only allows you to draw a card when you play Lore, Spirit, or Tactics allies (not Leadership allies as was previously mentioned in this thread!). To me, this limits the card a bit, seeing how Errand Riders, Snowbourn Scouts, and the leadership Outlands allies (Forlong & Warrior of Lossarnach) will not trigger the card's response (neither will Envoy's of Pelargir for that matter).\n\n \n\nThis does not inspire me enough to take out Beravor from my hero line-up of the Outlands Deck to go mono-leadership..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808123","commentId":808123,"userName":"ana4","timestamp":1372925234,"content":"> Just picked up Amon Din today and found that the attachment \"Lord of Morthond\" only allows you to draw a card when you play Lore, Spirit, or Tactics allies (not Leadership allies as was previously mentioned in this thread!). To me, this limits the card a bit, seeing how Errand Riders, Snowbourn Scouts, and the leadership Outlands allies (Forlong & Warrior of Lossarnach) will not trigger the card's response (neither will Envoy's of Pelargir for that matter).\n> \n>  \n> \n> This does not inspire me enough to take out Beravor from my hero line-up of the Outlands Deck to go mono-leadership...\n\nIt makes the card much more interesting; and inspires me to try harder for the mono-Leadership Outlands deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808176","commentId":808176,"userName":"Tracker1","timestamp":1372935277,"content":"> Just picked up Amon Din today and found that the attachment \"Lord of Morthond\" only allows you to draw a card when you play Lore, Spirit, or Tactics allies (not Leadership allies as was previously mentioned in this thread!). To me, this limits the card a bit, seeing how Errand Riders, Snowbourn Scouts, and the leadership Outlands allies (Forlong & Warrior of Lossarnach) will not trigger the card's response (neither will Envoy's of Pelargir for that matter).\n> \n>  \n> \n> This does not inspire me enough to take out Beravor from my hero line-up of the Outlands Deck to go mono-leadership...\n\n Wow, that's a big difference.  Then it really only is good for Hurluin/outlands.  I can't imagine any other mono-leadership deck using it.  Unless aragorn with the stone or songs are used.  This really limits the usefulness of the card.  Bummed.\n\nBut, I guess it still has a chance of triggering at most 12 times with non-leadership outlands allies.  It's better than nothing, but not enough to remove Beravor from an outland deck. Maybe there will be more outlands allies coming too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808245","commentId":808245,"userName":"Glaurung","timestamp":1372950003,"content":"Yes all this new cards is really cool but what about a quest? This is most important cose if quest is not good doesn matter how good a players cards since it will be boring anyway.\n\nPlease tell us about the encounter deck and quest! Thank you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808288","commentId":808288,"userName":"Pharmboys2013","timestamp":1372956151,"content":"wow lord of morthond is a complete bummer. maybe once the mono leadership booster faramir we all know is coming is out he will be good enough to potentially drop Berevor and make a leadership outlands deck with Hirluin, Theodred, and Faramir..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808289","commentId":808289,"userName":"richsabre","timestamp":1372956504,"content":"> wow lord of morthond is a complete bummer. maybe once the mono leadership booster faramir we all know is coming is out he will be good enough to potentially drop Berevor and make a leadership outlands deck with Hirluin, Theodred, and Faramir...\n\ndo we actually know for sure faramir will be a mono booster? maybe he will like his adventures multi-sphered?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808298","commentId":808298,"userName":"Pharmboys2013","timestamp":1372957457,"content":"no we dont know but it seems like a pretty strong assumption; i personally would prefer if he wasnt but the speculation based on theodan and mirlonde's abilities makes sense"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808300","commentId":808300,"userName":"richsabre","timestamp":1372957662,"content":"indeed i agree, though ffg do have a habit of surprising us.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808306","commentId":808306,"userName":"kyrie","timestamp":1372958550,"content":"Just took my first attempt at the new quest. The mechanics are pretty interesting, as you need to find the right balance of Rescued Villagers to Dead Villagers. The second stage allows you to take undefended attacks in the form of removing rescued villagers, i.e., save your heroes but let the people be slaughtered (real funny btw). It's quite easy to save Villagers because they give you Lord Alcaron at the beginning as an objective ally (1 WP, 2 AT, 2 DF, 3 HP, w/ ability to exhaust to save a villager).\n\n \n\nThere seemed to be a balance of locations and enemies and there is a final Orc Boss (Ghulat) at the end whose attack is equal to number of dead villagers (real powerful towards the end).\n\n \n\nI tried playing with a Hobbit Secrecy deck and did ok until a double enemy surge and a shadow card which increased my threat by 9 and then I threated out. I was able to Elbereth Githonial the boss enemy quite easily but my little hobbits just couldn't get enough willpower to power through the end (Protector of Lorian worked well for the most part with lots of card draw from Peace, and Thought, but it could only do so much).\n\n \n\nThe quest seems like it would be pretty easy though with an Outlands deck or Dwarf deck or Elf deck in solo mode. It seems like it would be similar to Druadan Forest quest in that with more players it becomes more difficult due to the synergy among the encounter deck.\n\n \n\nI am really happy with it overall, especially the theme in saving villagers or just letting the orcs slaughter them as you stand by safely watching the people die and the village burn  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]. This will be a good quest to try more hobbits and other fun theme decks due to the average difficulty level (5).\n\nEdited July 4, 2013 by kyrie"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808307","commentId":808307,"userName":"Gizlivadi","timestamp":1372958551,"content":"I kinda prefer him being a mono leadership booster, but that somehow can also work with rangers/lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808310","commentId":808310,"userName":"Pharmboys2013","timestamp":1372959031,"content":"true like ally Denethor breaking the sphere tradition"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808558","commentId":808558,"userName":"Glaurung","timestamp":1373007472,"content":"> Just took my first attempt at the new quest. The mechanics are pretty interesting, as you need to find the right balance of Rescued Villagers to Dead Villagers. The second stage allows you to take undefended attacks in the form of removing rescued villagers, i.e., save your heroes but let the people be slaughtered (real funny btw). It's quite easy to save Villagers because they give you Lord Alcaron at the beginning as an objective ally (1 WP, 2 AT, 2 DF, 3 HP, w/ ability to exhaust to save a villager).\n> \n>  \n> \n> There seemed to be a balance of locations and enemies and there is a final Orc Boss (Ghulat) at the end whose attack is equal to number of dead villagers (real powerful towards the end).\n> \n>  \n> \n> I tried playing with a Hobbit Secrecy deck and did ok until a double enemy surge and a shadow card which increased my threat by 9 and then I threated out. I was able to Elbereth Githonial the boss enemy quite easily but my little hobbits just couldn't get enough willpower to power through the end (Protector of Lorian worked well for the most part with lots of card draw from Peace, and Thought, but it could only do so much).\n> \n>  \n> \n> The quest seems like it would be pretty easy though with an Outlands deck or Dwarf deck or Elf deck in solo mode. It seems like it would be similar to Druadan Forest quest in that with more players it becomes more difficult due to the synergy among the encounter deck.\n> \n>  \n> \n> I am really happy with it overall, especially the theme in saving villagers or just letting the orcs slaughter them as you stand by safely watching the people die and the village burn  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]. This will be a good quest to try more hobbits and other fun theme decks due to the average difficulty level (5).\n\nSound like against one more easy quest......\n\nLooks like they give us very powerful outlands and after give us some snacks to eat it. And now need to wait for another year to play nihtmare mode easy mode and standart we gor straight away. Why not got a nightmare too. Since Hon i start to get more and more disappointed"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808569","commentId":808569,"userName":"kyrie","timestamp":1373011728,"content":">  \n> \n> > Just took my first attempt at the new quest. The mechanics are pretty interesting, as you need to find the right balance of Rescued Villagers to Dead Villagers. The second stage allows you to take undefended attacks in the form of removing rescued villagers, i.e., save your heroes but let the people be slaughtered (real funny btw). It's quite easy to save Villagers because they give you Lord Alcaron at the beginning as an objective ally (1 WP, 2 AT, 2 DF, 3 HP, w/ ability to exhaust to save a villager).\n> > \n> >  \n> > \n> > There seemed to be a balance of locations and enemies and there is a final Orc Boss (Ghulat) at the end whose attack is equal to number of dead villagers (real powerful towards the end).\n> > \n> >  \n> > \n> > I tried playing with a Hobbit Secrecy deck and did ok until a double enemy surge and a shadow card which increased my threat by 9 and then I threated out. I was able to Elbereth Githonial the boss enemy quite easily but my little hobbits just couldn't get enough willpower to power through the end (Protector of Lorian worked well for the most part with lots of card draw from Peace, and Thought, but it could only do so much).\n> > \n> >  \n> > \n> > The quest seems like it would be pretty easy though with an Outlands deck or Dwarf deck or Elf deck in solo mode. It seems like it would be similar to Druadan Forest quest in that with more players it becomes more difficult due to the synergy among the encounter deck.\n> > \n> >  \n> > \n> > I am really happy with it overall, especially the theme in saving villagers or just letting the orcs slaughter them as you stand by safely watching the people die and the village burn  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]. This will be a good quest to try more hobbits and other fun theme decks due to the average difficulty level (5).\n> \n> Sound like against one more easy quest......\n> \n> Looks like they give us very powerful outlands and after give us some snacks to eat it. And now need to wait for another year to play nihtmare mode easy mode and standart we gor straight away. Why not got a nightmare too. Since Hon i start to get more and more disappointed\n> \n>  \n\nIt is pretty easy. Just tried another attempt (#2) with Hobbit Secrecy deck FFG put up (with a few modifications, added in Faramir and the new Denethor to improve questing power). I just quested heavily, did not attack a single enemy, only engaged one because of super low hobbit threat (ended game with 14 threat!). Used Gandalf to put damage on Boss Enemy and just heavy quested with all three Hobbits, Arwen, Faramir, and Denethor for easy victory. I am beginning to like the Hobbits a bit more and think I will explore more combinations with them. The deck FFG posted with the Hobbits which everyone complained about is actually pretty good, but could use a few adjustments to increase questing power since. Hobbits are good for any traditional types of questing, but it would be crushed against Battle questing obviously.\n\n \n\nI am just excited for the new cards and quest (it's like Christmas morning comes once every month these days). I hope you can get your new pack soon so you can try out the new Hobbit synergy and encounter deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808577","commentId":808577,"userName":"Tracker1","timestamp":1373014966,"content":"Sounds like they tailored this quest for a hobbit themed deck. I'm hopping hobbit decks wii be able to stand up to tough scenarios, and that ffg does not just start to make easy quests so this trait can be successful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85399-encounter-at-amon-din/?do=findComment&comment=808608","commentId":808608,"userName":"richsabre","timestamp":1373023811,"content":"im really trying hard not to look at the quest details on this thread, so forgive me if this has been addressed, but are there any picture spoilers about yet of the player cards?\n\nrich"}]}