{"url":"https://community.fantasyflightgames.com/topic/85430-attercop-attercop-attercop-attercop-encounter-deck-mulligan/","title":"Attercop Attercop Attercop Attercop (encounter deck mulligan)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85430-attercop-attercop-attercop-attercop-encounter-deck-mulligan/?do=findComment&comment=805591","commentId":805591,"userName":"tripecac","timestamp":1371934643,"content":"On my second attempt of (2-handed) Return to Mirkwood, the encounter cards I drew during setup were:\n\n1) Attercop, Attercop\n2) Attercop, Attercop\n\nNeedless to say, I didn't bother continuing.\n\n \n\nMy questions are:\n\n1) Would you mulligan too?  Or would you regard that opening setup as a \"challenge\" and go for it?\n\n2) When you mulligan the encounter deck, do you also re-shuffle and re-draw your own cards?  Or do you just re-draw the encounter deck?\n\n3) How many encounter deck mulligans do you allow yourself before forcing yourself to play, no matter what?\n\n4) Are there other quests which have notorious setup draws?  Which are the worst?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85430-attercop-attercop-attercop-attercop-encounter-deck-mulligan/?do=findComment&comment=805596","commentId":805596,"userName":"Gizlivadi","timestamp":1371937377,"content":"As a Magic and a numerous other tcg's player, I often consider playing against the encounter deck as playing against any other opponent. Having that in mind, if my opponent has two Attercops or two Hill Trolls in play before the game even begins, yeah, I'm probably going start over. Granted, I have three heroes in play, but they can only do one thing each, while enemies in the staging area each do three things. Fortunately, I've never had to start a game over more than two times, so it really depends on the draws how many times I would do it for a game. Also, good or bad, I keep the hand I drew whenever I feel I have to do it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85430-attercop-attercop-attercop-attercop-encounter-deck-mulligan/?do=findComment&comment=805652","commentId":805652,"userName":"richsabre","timestamp":1371969142,"content":"1. i would either count that as a loss, and restart the whole game, player hand included or i would go for it. i would more often go for it than not as id rather have a go and lose then have to reset the whole game\n\n2.as above, its not so much a mulligan as a 'loss and restart'…so everything\n\n3.i will only ever restart if both of these conditions come up simultaneously 1.extremely poor draw ans 2. its a very hard quest im trying to win after dozens of losses\n\n4.most certainly the ones with a lot of surge cards in. those can be the worst. or those than exhaust all of your heros straight off.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85430-attercop-attercop-attercop-attercop-encounter-deck-mulligan/?do=findComment&comment=805702","commentId":805702,"userName":"GrandSpleen","timestamp":1371986392,"content":"I agree with rich-- wouldn't use the term mulligan for this.  I call it a forfeit and restart.  I do this sometimes on the first round, but not typically during setup.  Usually we'll forfeit if we lose a hero on round 1 or something awful like that.  I keep track of all my wins and losses, and include the forfeits in that count."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85430-attercop-attercop-attercop-attercop-encounter-deck-mulligan/?do=findComment&comment=805766","commentId":805766,"userName":"legolas18","timestamp":1372008396,"content":"Yeah, I do this sometimes if I draw encounter cards like that in the first round, and I know that I'm going to lose. But thankfully it doesn't happen too often."}]}