{"url":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/","title":"Frodo damage timing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=805623","commentId":805623,"userName":"Nerdmeister","timestamp":1371950442,"content":"This has probably been discussed a long time ago, but I can´t seem to find an answer for it in rules or FAQ. And since I´ve recently included Frodo for the first time in a long while this question popped up.\n\nWhen using Frodo´s ability to prevent damage, is the damage still considered to have taken place?\n\nThis is an important distinction when card effects play off wether a character has been damaged or not, such as with Hill Troll and Muck Adder.\n\n \n\nThe situation where it became relevant though was when we played Peril in Pelargir last night and we wanted to attach Alcaron´s Scroll to Frodo. The explicit intent was to have an enemy damage Frodo (making him unattach the scroll thus preventing the active location from sending too many enemies) and cancel it´s damage as per Frodo´s ability:\n\n\"Response: After Frodo Baggins is damaged, cancel the damage and instead raise your threat by the amount of damage he would have been dealt. (Limit once per phase.)\"\n\nThe point is that as I´m reading Frodo he says \"after Frodo Baggins is damaged\", suggesting that the damage is considered to have taken place (and effects triggered by damage having met their requirement) even if later cancelled. I do seem to remember a ruling stating otherwise at some point though I can´t be sure.\n\nAgain, I think this was answered quite a long while ago but maybe I just need a memory jock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=805659","commentId":805659,"userName":"richsabre","timestamp":1371969827,"content":"the amount of time ive spent trying to get an answer to this…..i cant even remember if there's an official ruling either\n\nheres a thread on muck adder vs. frodo from when he was released\n\nhttp://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=535389&efpag=0 [http://www.fantasyflightgames.com/edge_foros_discusion.asp?efid=201&efcid=4&efidt=535389&efpag=0]\n\n \n\nMr. Radiskull hasnt been on here for a while but he was excellent at rules, and i think he makes a good point….here is what he said\n\n On the other hand, if Frodo takes 5 damage, wouldn't he die \"immediately\", which in my view is even faster than Forced:, thus not enabling him to use his ability?  But FFG has stated that Frodo works against Hummerhorns.  So it stands to reason that the text \"if Muck Adder damages…\" should be read as \"if Muck Adder successfully damages…\", and Frodo would get to cancel the damage.\n\n \n\nFrodo's text could have just as easily read \"if Frodo Baggins is damaged, heal that damage and…\" but it does not.  Surely there is a difference between what I've just written and Frodo's actual text.  I'm all for Frodo surviving the Muck Adder.\n\n \n\nperhaps it has been clarified and im forgetting…….\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=805714","commentId":805714,"userName":"Nerdmeister","timestamp":1371991951,"content":"Thanks for the link, Rich.\n\nUnfurtunately there doesn´t seem to be a definitive answer in that topic. It basically ends with a \"this needs to be addressed in a FAQ\" pensativo [http://www.fantasyflightgames.com/edge_scripts/ckeditor/plugins/smiley/images/pensativo.gif]\n\nLot´s of interesting points though (most of which are part of my original concerns)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=805735","commentId":805735,"userName":"richsabre","timestamp":1371997680,"content":"yes, thats the problem, theres lots of threads but no answer….i wonder why this isnt in the faq? perhaps someone should contant caleb if no one has a clarification on this\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=805768","commentId":805768,"userName":"DukeWellington","timestamp":1372008832,"content":"I agree it should be addressed in FAQ but here is what my ruling would be if it were up to me.\n\nFrodo should read \"whenever Frodo would take damage, cancel that damage and instead…\" Then the Muck adder can keep the same text because it would be clear that Frodo never actually takes damage. I would say that, unfortunately, if you want Frodo to drop the scroll you can't use his ability.\n\nBut I don't work for FFG so…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=808205","commentId":808205,"userName":"booored","timestamp":1372942839,"content":"your both wrong.... and here is why.\n\n \n\nffg_muck-adder-catc.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_muck-adder-catc.jpg]ffg_frodo-baggins-catc.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_frodo-baggins-catc.jpg]ffg_alcarons-scroll-hon.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_alcarons-scroll-hon.jpg]\n\n \n\nOk.. so what you need to look at here is the type of effect not what they effects are doing...\n\n \n\nFrodo is a RESPONSE, Muck Adder and the Scroll are FORCED RESPONSE\n\n \n\nFAQ 1.4 (p5)\n\n(1.09) Forced Responses\nForced responses resolve immediately when their\nspecified prerequisite occurs, and before any response\neffects that also can be triggered off the same\nprerequisite.\n\n \n\nManual (p23)\n\nResponses\n\nResponses are always optional, and can\nbe triggered by their controller in response to (i.e.\nimmediately after) a specified game occurrence\n\n \n\n \n\nSO.. this is how it breaks down or.. how it SHOULD break down...\n\n \n\nThe forced effects occour befor the response, so dmg happens.... then the forced effect troggers....  The forced effect kills Frodo or chnages possession of the scroll BEFORE the respnse can trigger as the timing windows are clearly stated in the FAQ that forced responses trigger first.\n\n \n\nThis is why Frodo says \"cancel\" as the effect timing rules require the smg to be placed THEN his effect to trigger.\n\n \n\nPS  - WOW.. how good is it to have formatting in the forums now!!\n\nEdited July 4, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=808283","commentId":808283,"userName":"ricedwlit","timestamp":1372955769,"content":"Wow - it all comes down to timing. For the Muck Adder, since applying the damage also requires we discard the character, then Frodo ends up stripped of his text and hence cannot apply his Response to cancel the damage.  \n\n \n\nContrast this with the Hummerhorns, which merely states:\n\n \n\nForced: After Hummerhorns engages you, deal 5 damage to a single hero you control.\n\n \n\nFrodo gets the damage, but since he hasn't  been removed from play he is able to cancel the damage. (All of this before the ever constant passive effect of \"if your damage > your hit points then you are discarded\" is checked).\n\n \n\nNeat!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=813716","commentId":813716,"userName":"mr.thomasschmidt","timestamp":1373787627,"content":"> Wow - it all comes down to timing. For the Muck Adder, since applying the damage also requires we discard the character, then Frodo ends up stripped of his text and hence cannot apply his Response to cancel the damage.  \n> \n>  \n> \n> Contrast this with the Hummerhorns, which merely states:\n> \n>  \n> \n> Forced: [/size]After Hummerhorns engages you, deal 5 damage to a single hero you control.[/size]\n> \n>  \n> \n> Frodo gets the damage, but since he hasn't  been removed from play he is able to cancel the damage. (All of this before the ever constant passive effect of \"if your damage > your hit points then you are discarded\" is checked).\n> \n>  \n> \n> Neat!\n\nBut how can he cancel the damage when it is dealt to him BEFORE his response trigger? He only has two hit points and should then be removed shouldn't he? Or does his effect trigger between the damage is dealt and you choose which hero to deal the 5 damage to?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=813717","commentId":813717,"userName":"booored","timestamp":1373788373,"content":"We are getting into wanky rules lawyer territory here... but the deal is that taking damage is a separate effect than being discarded.\n\n \n\nYou take wounds, and then you check the wounds if it is in excess then you discard. This is in fact 2 events. The response takes place after the damage is placed but before it is applied. This is why they use the word \"apply\" in the rules and why the card for Frodo says \"cancel\"\n\nEdited July 14, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85437-frodo-damage-timing/?do=findComment&comment=813778","commentId":813778,"userName":"mr.thomasschmidt","timestamp":1373806474,"content":"Okay. Thanks for clearing that"}]}