{"url":"https://community.fantasyflightgames.com/topic/85540-thoughts-on-mirlonde-after-having-used-her/","title":"Thoughts on Mirlonde after having used her","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85540-thoughts-on-mirlonde-after-having-used-her/?do=findComment&comment=806334","commentId":806334,"userName":"DevastazioneH88","timestamp":1372236787,"content":"Well, I was one of those who didn't like her when we saw her online…but now that I've used her…I have to say she's awsome…if every monosphere hero is goning to improve monosphere so much I'm really looking forward to have them.\n\nMy conclusions are based on a solo monolore deck my girlfriend and I built. We got to defeat the steward's fear twice in row (losing the third) and we won like 6 times out of 7 against The Druadan Forest. Our deck is based on encounter control (cards like rumours from the earth, henamarth riversong, denethor and risk some light are the core of this deck). Well I have to say I'm really impressed (said by a guy who alost never used lore before). I like monosphere much more than outlands so far. Really looking forward to have the leadership monosphere booster Faramir ! (oh by the way, my third hero was Aragorn (TWitW)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85540-thoughts-on-mirlonde-after-having-used-her/?do=findComment&comment=806388","commentId":806388,"userName":"richsabre","timestamp":1372256641,"content":"yes i am very much looking forward to getting her in a week or so. i run a mono lore deck as a third support deck, and she is destined for a place in that deck along with bilbo and strider.\n\nlore is by far my favourite sphere\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85540-thoughts-on-mirlonde-after-having-used-her/?do=findComment&comment=806723","commentId":806723,"userName":"Glaurung","timestamp":1372396733,"content":"richsabre said:\n\nyes i am very much looking forward to getting her in a week or so. i run a mono lore deck as a third support deck, and she is destined for a place in that deck along with bilbo and strider.\n\nlore is by far my favourite sphere\n\nrich\n\n\n\nStrange actually. You stay in England and still didn get a DF pack. I stay in Bangkok and get it already week before."}]}