{"url":"https://community.fantasyflightgames.com/topic/85642-black-forest-bats-thalin/","title":"Black Forest Bats &amp; Thalin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85642-black-forest-bats-thalin/?do=findComment&comment=806958","commentId":806958,"userName":"JimFear","timestamp":1372496948,"content":"Wondering how these 2 cards interact with each other.\n\nThalin's ability reads- \"While Thalin is commited to a quest, deal 1 damage to each enemy as it is revealed by the encounter deck.\"\n\nBlack Forest Bats reads- \"When Revealed: Each player must choose 1 character currently commited to a quest and remove that character from the quest. (The chosen character does not ready).\"\n\nHere's the question: If I choose to remove Thalin from the quest, does his ability resolve on the bats before he is removed from the quest? Both cards have the same term (when revealed) so I'm not sure which gets resolved first. I played it as if Thalin does no damage, but I'm not entirely sure that's correct.\n\nCan someone help me clarify?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85642-black-forest-bats-thalin/?do=findComment&comment=806967","commentId":806967,"userName":"nismojoe","timestamp":1372498538,"content":"Last I recall, While Thalin is questing, anything with 1hp or anything that would be killed upon reveal is immediately discarded and nothing on the card triggers…not doomed, not surge, not when revealed, nothing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85642-black-forest-bats-thalin/?do=findComment&comment=807162","commentId":807162,"userName":"richsabre","timestamp":1372575625,"content":"i also agree with this. the FAQ states that they are instantly killed\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85642-black-forest-bats-thalin/?do=findComment&comment=807207","commentId":807207,"userName":"JimFear","timestamp":1372590497,"content":"Thank you guys for the replies.\n\nI played it the opposite way because the game likes to throw you curve balls like that, and I was on board for the extra challenge. But I'll have Thaliln's ability resolve first from now on.\n\n \n\n "}]}