{"url":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/","title":"Speculation next two Heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807186","commentId":807186,"userName":"Tracker1","timestamp":1372585194,"content":"I think it's a good chance we will see Faramir next AP.  With so many ranger and trap cards going to lore my guess is that he will be lore as well.  Unless he is leadeship with ability to play ranger cards of any sphere.\n\nA wild guess for the 5 th AP is Aragorn Spirit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807217","commentId":807217,"userName":"Glaurung","timestamp":1372592895,"content":"Tracker1 said:\n\nI think it's a good chance we will see Faramir next AP.  With so many ranger and trap cards going to lore my guess is that he will be lore as well.  Unless he is leadeship with ability to play ranger cards of any sphere.\n\nA wild guess for the 5 th AP is Aragorn Spirit.\n\n\n\nI also think we should get a Faramir. And maybe anohter Elf. Maybe Galadriel at last!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807221","commentId":807221,"userName":"Khamul The Easterling","timestamp":1372594352,"content":"Really want Thuranduil.  Really really want him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807222","commentId":807222,"userName":"Alex6222","timestamp":1372594656,"content":"I think we will see Faramir until the 5th AP. I REALLY hope we get another Outland hero, a ledership one would be better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807223","commentId":807223,"userName":"Nickpes","timestamp":1372594683,"content":"I doubt there will be a Gondor Hero … As after Khazad dum there were no dwarve heroes in the cycle that followed, I guess the same will happen know with Gondor\n\n \n\nHaving this in mind I also hope for Thranduil. Galadriel should be way too powerfull if ever made so I do not think it will happen but I would love it\n\n \n\nPS: Is it just me that most of my favourite Tolkien heroes are from Sillmarillion ? Thumbs up for Fingolfin :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807225","commentId":807225,"userName":"richsabre","timestamp":1372594967,"content":"im going for thranduil or faramir\n\nthranduil will give a dain/theoden boost and faramir will be mono sphere based\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807261","commentId":807261,"userName":"Pharmboys2013","timestamp":1372605627,"content":"even though Faramir would be a great fit in lore with all the rangers and traps, he seems pre-destined to be the mono-leadership booster hero in the 4th AP which is already confirmed to have a \"ranger hero\".  one would think that last remaining hero would be a mono-spirit booster but who it would be, i have no idea…an elf either noldor or silvan would make sense or maybe i'm just hoping that so that a character as important as Thranduil or Galadriel can be left for a more useful design choice.  Celeborn on the other hand i think would be a good fit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807290","commentId":807290,"userName":"lleimmoen","timestamp":1372607976,"content":"If you read the preview for Assault on Osgiliath (toward the end), you'll know we're getting Faramir (with almost a certainty). I hope he's Leadership mono-booster, but there's a strong point for Lore, as the Rangers and Traps come in that Sphere. Also, now that the previous charactger/sphere rules were shattered, there would be the same ally-hero shift for Denethor and Faramir, if Faramir were Lore. On the other hand, if he's Leadership, One could have the hero brothers and their dad as an ally (but you can already have the reduced family in the Leadership sphere anyways)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807310","commentId":807310,"userName":"legolas18","timestamp":1372614418,"content":"I also really hope it's an elf for the fifth pack. There are only 7 elf-heroes, and only 6 if you don't count the Glorfindel duplicate. I'm hoping mostly for a Haldir hero, but Celeborn, Galadriel, or Thranduil would all do nicely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=807396","commentId":807396,"userName":"lleimmoen","timestamp":1372648825,"content":"legolas18 said:\n\nI also really hope it's an elf for the fifth pack. There are only 7 elf-heroes, and only 6 if you don't count the Glorfindel duplicate. I'm hoping mostly for a Haldir hero, but Celeborn, Galadriel, or Thranduil would all do nicely.\n\n\n\nYeah, the last unspoiled hero (fifth pack) will most likely be Spirit and I too hope we get another Elf: Galadriel, Celeborn, Thranduil all seem great candidates. To this day I wonder why we were not getting more Silvan love when we were in the Mirkwood area, because I can't see the game returning there any time soon; it was a great thematic opportunity to get the Wood Elves and their craft; however, the latter we get the Elves, the more interesting they may be. Look what happened to the Rohan cards from the Mirkwood cycle, they were quite strong for the cycle itself but I wouldn't like to play a Rohan deck against the Númenor quests (or the Hobbit, or the subsequent probably)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=811066","commentId":811066,"userName":"Mr Coffee","timestamp":1373415487,"content":"Personally, I'm really hoping we don't see Galadriel for quite some time.  She's one of my least favorite characters in the Ring Cycle, and had to be wrinkled backwards into the history of Middle-Earth after she was included in the the War of the Ring stories.  Thranduil is another character I could do without for awhile.  My distrust of him runs deep from my love of reading The Hobbit as a child.... lol.  (was SOOOO glad we didn't see him as a hero in either of The Hobbit boxes)...\n\n \n\nI would like to see more elven (Silvan) heroes though.  And I have been on record here for quite some time stating that I think Celeborn should be an excellent candidate as a hero in the near future.  I would like to toss an additional name out there for consideration:  Cirdan the Shipwright.  One of the oldest and wisest elves living during the time of the WOTR.\n\n \n\nI know that that there isn't as much of a story built around those two compared to Galadriel now (to draw theme and strenghts/abilities from), but I think there are some very strong possibilities for those two.  I think a lot of people were surprised that Elrond didn't provide some form of Elven bonus.  But I think his ability fits him perfectly, and is hardly crippling.  Celeborn, however, as Lord of Lothlorien, would be the PERFECT candidate to introduce some sort of (Silvan) Elven trait bonus.  Perhaps a healing/hit-point bonus (to keep those Mirkwood Runners alive longer!)...\n\n \n\nAnd I think it would be great to see Cirdan out there, simply because I'd relish the thought of how they would do his artwork, simply because he was one of the rare elves that actually grew a beard (perhaps it's a petty reason for me... lol).  But I think that as the bearer of Narya, which he later wisely gave to aid Gandalf, that he could have some sort of Istari bonus that focused on making Radagast and Gandalf 2 more playable (let's be honest... most of us still use the core Gandalf.  He's just too **** good).  Not to mention that he should also be in the running to be a target for Narya along with Gandalf whenever they get around to creating that artifact in the game.\n\nEdited July 10, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=811073","commentId":811073,"userName":"Pharmboys2013","timestamp":1373416344,"content":"i'm dying in anticipation for the reveal of the \"ranger\" hero (whom has just got to be Faramir) i've already resigned myself to assuming he'll be a mono-sphere leadership booster but regardless if he is anything short of awesome i may run away to the depths of dul guldor and go crazy.\n\n \n\nI would be more than happy to see Celeborn or Cirdan be tentative mono spirit booster\n\n \n\n*all assuming the next two heroes round out the mono booster theme of this cycle*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=811168","commentId":811168,"userName":"Bullroarer Took","timestamp":1373426926,"content":"Faramir is all but given and I hope we get Thorongil, but I doubt it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=811176","commentId":811176,"userName":"Pharmboys2013","timestamp":1373427866,"content":"i think it may be slightly too early to have a 3rd Aragorn already.  I would think that they'll avoid triples of heroes until we've had at least 1 of all the major characters...although if any character was going to get a 3rd hero version first it'll be him...it would be interesting in regards to the naming tho.  They would probably still have to call him Aragorn on the card with the unique symbol or else people could end up with two of the same character in play because of a technicality.  The player base would probably still reference him as Thorongil as long as the art and flavor text reflected it for the same reasons everyone calls the lore aragorn strider   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=811250","commentId":811250,"userName":"legolas18","timestamp":1373437496,"content":"I can't wait to get Narya and Nenya. Which also means that there has to be a Galadriel and (cross my fingers) a hero Gandalf. Cirdan would be a good hero to have as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=811309","commentId":811309,"userName":"Tracker1","timestamp":1373453680,"content":"Here is a wild guess. Faramir will be something like Oin, two sphere leadership lore, he will be lore and his ability will be something like when you control x number of ranger allies faramir gains leadership. When faramir gains leadership gondor allies gain +1 willpower.\n\nHow's that sound?\n\nOr maybe he will just be a momo leadership buff, but ihope his ability is not restricted to monosphere only.\n\nWho knows we may not even get Faramir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=811348","commentId":811348,"userName":"Pharmboys2013","timestamp":1373460936,"content":"i really like your faramir ability in how it ties together both ranger status but can still buff gondor characters.  would love to see that on the card (even though im fully aware it likely wont be)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812108","commentId":812108,"userName":"lleimmoen","timestamp":1373545554,"content":"Círdan is a good choice. Of course theme doesn't always count here but if there should be an Elf in the Gondor cycle, it may as well be Círdan as the see route between Pelagir and Grey Havens is an intriguing one. More so, we have already got Harbour Master."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812115","commentId":812115,"userName":"lleimmoen","timestamp":1373546547,"content":"And yeah, Leadership and Ranger booster for Faramir, it sounds too good to be true. Since his ally version is very powerful, the hero may be a bit of a let-down. Then, since we've been waiting so long for such a beloved character, it might not be. I do believe ffg listens to its customers, and reads these boards... I remember when there was an outcry (sort of, I was certainly trying my best) about Lore Glorfindel not being among the best, ffg tried hard to make the Spirit version better (though the reasoning may differ, of course). Faramir is a character many readers and gamers are looking forward to, he may as well be another Glorfindel-kind-strong?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812172","commentId":812172,"userName":"Glaurung","timestamp":1373553219,"content":"What about Gwaihir? We see the picture already but he still not here.......The eagles need a leader!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812188","commentId":812188,"userName":"Pharmboys2013","timestamp":1373554804,"content":"> Círdan is a good choice. Of course theme doesn't always count here but if there should be an Elf in the Gondor cycle, it may as well be Círdan as the see route between Pelagir and Grey Havens is an intriguing one. More so, we have already got Harbour Master.\n\n \n\nwhile fictitious, we did get Mirlonde so i'm not sure that would be their motivation"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812200","commentId":812200,"userName":"lleimmoen","timestamp":1373555994,"content":"Yeah, I realize they probably meant Mirlonde coming from Lindon (judging by the sea waves in the picture) rather than Mirkwood. Then another character from Grey Havens is unlikely.\n\n \n\nThe Eagles do indeed need Gwaihir (and probably more than that) to become a big hit (though I see their potential, they still seem to me quite incomplete as a faction)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812201","commentId":812201,"userName":"richsabre","timestamp":1373555995,"content":"i would love to see cirdan, i would particularly like to see some sort of reference to his trust in gandalf as the wisest of the istari in his ability\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812227","commentId":812227,"userName":"Mr Coffee","timestamp":1373558936,"content":"> i would love to see cirdan, i would particularly like to see some sort of reference to his trust in gandalf as the wisest of the istari in his ability\n> \n> rich\n\n \n\nMy other thought (in addition to some tie into the Istari) for Cirdan was that he could provide some form of Elven \"buff\", or rather some benefit based on elves leaving play (based on his being the lord of the Grey Havens, which of course was the \"jumping off\" point for the elves on their way from ME).\n\nDisregarding what his stats would be for the moment, perhaps something like this:\n\n \n\nSilvan.  Noble.\n\nWhile Cirdan is in play, Istari gain +1 Willpower.  If Gandalf is in play, you may spend one (Leadership) resource to reduce your threat by 2 (once per turn).\n\nWhenever a Noldor or Silvan elf leaves play, you may (choose 1):  gain 1 (Leadership) resource, ready 1 Noldor or Silvan ally, or pay 1 (Leadership) resource to ready 1 Noldor or Silvan hero.\n\n \n\nI wasn't sure which sphere to include him in, but his history clearly shows him as a major elven leader, so decided that it fit him well.  And whereas I would expect a character like Thranduil or Gil-Galad to have more of a \"Dain\"-like permanent elven boost, it seemed to fit Cirdan's character more to give him situational abilities (those choices... that I think are still quite useful).  For his interaction with Gandalf, I wanted something that would reflect him willingly giving up Narya (the resources) to knowingly gain some greater good (the threat reduction)... (this would then help fuel keeping Gandalf's second version on the table more consistently).  It can be tough to think of abilities that are both useful and fit theme as well.\n\n \n\nThoughts on these abilities?\n\n \n\n> And yeah, Leadership and Ranger booster for Faramir, it sounds too good to be true. Since his ally version is very powerful, the hero may be a bit of a let-down. Then, since we've been waiting so long for such a beloved character, it might not be. I do believe ffg listens to its customers, and reads these boards... I remember when there was an outcry (sort of, I was certainly trying my best) about Lore Glorfindel not being among the best, ffg tried hard to make the Spirit version better (though the reasoning may differ, of course). Faramir is a character many readers and gamers are looking forward to, he may as well be another Glorfindel-kind-strong?\n\n \n\nAgree with this 101%.  As much as we've all been clamoring for a Faramir hero, I really do LOVE his ally version.  It is in every deck I play that has leadership in it.  Such a good card!  It will take a very good hero card for me to remove using him as an ally.  I mean, if his hero card is only so-so, then what is the incentive to include it over other strong leadership hero cards if I can still just use his great ally card?  For this reason, I am somewhat secretly hoping that his hero version is NOT leadership, but rather a Lore-sphere Ranger/Secrecy hero.... for now.  (followed by a second hero later depicting him as a Gondorian leader).  Simply making him a mono-sphere hero (aka Mirlonde, although I actually like her for what she does) WILL be a let-down for such an anticipated character (my personal favorite human/man character in the Ring Cycle).\n\n \n\n> What about Gwaihir? We see the picture already but he still not here.......The eagles need a leader!\n\n \n\nYup.  Definitely due for him.\n\nEdited July 11, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812238","commentId":812238,"userName":"richsabre","timestamp":1373559671,"content":"yes- sounds a great card. certainly a 13 threat one though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812257","commentId":812257,"userName":"Mr Coffee","timestamp":1373560565,"content":"Oh, he would definitely have some solid stats...  But I don't think his abilities are TOO overpowered that they would HAVE to be a 13 threat hero...  The Istari bonus is only going to be effective on those turns that Gandalf is on the table (but I also included that to try and make Radagast more playable... more creature allies would also help that...).  And his elven-based abilities are solid as well, but since your goal should hopefully be to keep your allies on the table (elves aren't exactly like the Eagles where you're trying to pop them in and out all the time)...\n\n \n\nI was thinking something along the lines of:\n\n \n\n11 threat (maybe 12?)\n\n3 WP\n\n2 Attack\n\n2 Defense\n\n4 HP\n\n \n\nBut the stat arrangement would really be based on how someone was depicting his character at a point in time:\n\n- As the lieutenant to Gil-galad in the early wars?  Swap the attack and WP. \n\n- As the staunch defender of Falas (and later the Grey Havens) holding out against Morgoth and Sauron?  Swap the Wp and defense.\n\n- As the leader of one of the last elven strongholds in ME, providing a safe location for the elves' final journey?  That's what I was thinking of with those stats and abilities... If the abilities seem too strong, then I could see leaving the stats adding up to 11 while bumping his threat up to 12, perhaps?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85677-speculation-next-two-heroes/?do=findComment&comment=812265","commentId":812265,"userName":"richsabre","timestamp":1373561108,"content":"its hard to tell....i remember suggesting before we had elrond that he should be able to play all allies because he was a minstrel in the early years of middle earth. i dont know if ffg did his effect for that reason, but its hard to tell where they mainly take thier material. same could be applied with glorfindel's 3 attack\n\nrich"}]}