{"url":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/","title":"Faramir vs Denethor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809084","commentId":809084,"userName":"lleimmoen","timestamp":1373097581,"content":"I mean seriously, this is quite beyond joke to compare the two Leadership allies. Ok, one can in his mind form an idea that one character is stronger than another, but in the game, this shouldn't be just that. I understand equality will not always be possible, but making it different is what the goal should be.\n\n \n\nFaramir and Denethor have all the same stats, save willpower. Denethor's is a point greater, One would then think, perhaps Faramir's ability be a notch stronger than Denethor's. What one gets, however, is a very good ability on one hand, and a totally terrible one on the other, not an ability, a great disability in fact. I still have a hard time to grasp this mischief, was there a misprint? I'm afraid not.\n\n \n\nI mean Faramir should almost always find three characters to boost their willpower, you wouldn't put him in a deck where he wouldn't, right? So at the very least he's as good a willpower booster as Denethor's at his very best. Plus, Faramir has to be neither exhausted nor committed to the quest which is beneficial in so many instances (Necromancer's Reach, Blocking Wargs).\n\n \n\nIs this really what the designers are trying to tell us? That one of the major characters in the books just sucks when compared to his son? If they believe that, I think there would be a better way to show it, perhaps by introducing a specific treachery or condition in some scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809092","commentId":809092,"userName":"Glaurung","timestamp":1373099378,"content":"Denethor is not a fighter he is a ruler. And in the time of book he already quite old man.... so he is a good quester but he has he flaws since he is really quickly get disscourage (Damage on heroes). He is really thematic. Same as his lore hero version"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809095","commentId":809095,"userName":"booored","timestamp":1373099961,"content":"there is no9 theme in this game, get that in your head. the theme stops at the art and the names.If you go looking for logical comparisons to the source you will have all sorta of problems. eagles flying in the mines Moria for example. This game is more abstract than thematic, and imo this is the way to go.. sacrificing gameplay for theme is a bad bad idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809103","commentId":809103,"userName":"lleimmoen","timestamp":1373102958,"content":"Well, any response is better than none I suppose, but neither of you really address the topic of this thread.\n\n \n\nGlaurung, whilst I agree that Denethor is a ruler, it doesn't justify him being a very poor ally - in comparison with Faramir (at the very least). More so, I believe the ally version depicts a younger, and certainly more active Denethor than the hero version.\n\n \n\nBoored, thematic or not, I was talking about how useless the card is, in comparison to Faramir (at the very least). I agree a game doesn't need to be thematically perfect, using Eagles in Moria is quite fine with me, for instance, but when I get two ally cards of the same sphere and cost, I do not like to see one of them being so obviously better than the other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809104","commentId":809104,"userName":"mr.thomasschmidt","timestamp":1373103221,"content":"> there is no9 theme in this game, get that in your head. the theme stops at the art and the names.If you go looking for logical comparisons to the source you will have all sorta of problems. eagles flying in the mines Moria for example. This game is more abstract than thematic, and imo this is the way to go.. sacrificing gameplay for theme is a bad bad idea.\n\nAs you say, that's your opinion. And who are you? Not somebody who's opinion means more than others. So don't pick on those who like the thematic in this game. It might not be as effective but sacrifice gameplay over thematic isn't a bad bad idea. It's just another approach. Not better or worse than any other take on the game. People can playboy the way they like without having to be insulted. Try and get THAT in YOUR head!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809106","commentId":809106,"userName":"booored","timestamp":1373103558,"content":"@lleimmoen [https://community.fantasyflightgames.com/index.php?/user/163561-lleimmoen/]\n\n \n\num.. am I missing something here... Are you talkign about a new Faramir, or the one in core? I do not remember seeing a new Faramir.\n\nEdited July 6, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809107","commentId":809107,"userName":"klaymen_sk","timestamp":1373103926,"content":"I am puzzled as well. Mainly because of the OP's talking about Faramir not needing to be exhausted, when he in fact has to exhaust to provide his willpower boost.\n\nhttp://www.lotrlcg.com/Card/Focus/1014 [http://www.lotrlcg.com/Card/Focus/1014]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809108","commentId":809108,"userName":"booored","timestamp":1373104065,"content":"also his boost affects others, not himself AND the core Farimier is a total boss.. as in super powerful "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809118","commentId":809118,"userName":"leptokurt","timestamp":1373108046,"content":"I don't think you can use Faramir as a base to create new 4 cost heroes. Faramir is one of the best cards there is, I would even say it is overpowered. The new Denethor is fine as it is. It's created for a mono leadership deck obviously, as you want to play it as early as posible. It also combos nicely with \"Sneak Attack\". If his WP goes low you still have a more than average defender, furthermore he can quest when you have the \"siege\" keyword.\n\n \n\nI think the developers are doing fine with the new player cards in general, and Denethor is a good example how to create a card that requires optimal gameplay to be useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809121","commentId":809121,"userName":"leptokurt","timestamp":1373108493,"content":"> I am puzzled as well. Mainly because of the OP's talking about Faramir not needing to be exhausted, when he in fact has to exhaust to provide his willpower boost.\n> \n> http://www.lotrlcg.com/Card/Focus/1014 [http://www.lotrlcg.com/Card/Focus/1014]\n\nI think Illeimmoen was talking about nasty treachery effects like \"Blocked by Wargs\" not effecting Faramir. I think he is well aware that Faramir has to be exhausted to trigger his effect. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited July 6, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809122","commentId":809122,"userName":"lleimmoen","timestamp":1373109268,"content":"> I am puzzled as well. Mainly because of the OP's talking about Faramir not needing to be exhausted, when he in fact has to exhaust to provide his willpower boost.\n> \n> http://www.lotrlcg.com/Card/Focus/1014 [http://www.lotrlcg.com/Card/Focus/1014]\n\nI will try and un-puzzle you. For Faramir (core set) to boost the willpower of other characters, he needs not to be exhausted during the staging (thus he avoids getting hit by Necromancer's Reach, for instance). He can exhaust after the encounter cards have been revealed.\n\nAlso, he needs not to commit to the quest in order to boost willpower, thus he avoids the getting hit by Blocking Wargs, for instance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809123","commentId":809123,"userName":"lleimmoen","timestamp":1373109853,"content":"> I don't think you can use Faramir as a base to create new 4 cost heroes. Faramir is one of the best cards there is, I would even say it is overpowered. The new Denethor is fine as it is. It's created for a mono leadership deck obviously, as you want to play it as early as posible. It also combos nicely with \"Sneak Attack\". If his WP goes low you still have a more than average defender, furthermore he can quest when you have the \"siege\" keyword.\n> \n>  \n> \n> I think the developers are doing fine with the new player cards in general, and Denethor is a good example how to create a card that requires optimal gameplay to be useful.\n\nHmm, I only partly agree. As I said, of course not every card needs to be powerful in every situation. But one would have to think very hard to find a use for the ally Denethor, or in other words, I cannot think of any practical situation when the ally version of Faramir would be inferior to Denethor. I don't mind getting cards that cannot do much, I have nothing against the Love of Tales, for example, although I have never put it into a good use. But why make an ally like Denethor when there's just nothing he can do better than Faramir? If he had the same attributes as the hero version, one could easily consider him for defence, but he doesn't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809125","commentId":809125,"userName":"richsabre","timestamp":1373111763,"content":"lots of things to reply to here....\n\nfirstly the topic at hand. i agree that denethor is a very poor card. i can actually see the themeatic 'reasons' for his card text....the worse things look to him, the worse his willpower is.\n\n...however, this card is just too much. i cannot think, not counting any super powerful gondor power card in the future, of any deck i would put him in.\n\n \n\nthis is actually strange because i love getting not-so-powerful cards that are heavy on the theme side. it allows me to include them in weaker decks for the easy quests...\n\n \n\nnow onto theme. i do not wish to derail a thread that is not mine...and neither do i want to uphold my own 'cliche' by defend what im know throughout the forum to love... however i must point out the following cards:\n\n \n\nStrider - resets threat ...why? - because he comes to the 4 hobbits aid in bree\n\nLore Denethor - card peeks...why? - becuase he has a palantir\n\nFrodo- cancels damage...why? because he cheats death how many times?\n\nEowyn- high willpower+increase...why? because she wasnt prepared to watch her people die without her being one of them\n\nBoromir- self sacrifice ability...obvious\n\nGandalf- comes in and out of the game....he is flying (sometimes literally) around middle earth trying to save everyone during the war of the ring\n\nGood Meal- allows you to play events for less....people travel better after a good meal\n\nThorin- i actually remember the designer talking about how he wanted thorin powerful but only once he had enough followers...showing his stubborn ways.\n\n \n\ni can do that with almost any card in this game, save perhaps a few. denethor, whilst being one i can do this with, is still dissapointing becuase his ability is so terrribly imbalanced against his stats\n\n \n\nin general however the designers do a great job of getting the card's feel correct...and coming from someone who has such high standards of lore...then this is a great compliment\n\n \n\nnow onto denethor- i would have least have expected him either\n\n-1 cost less\n\n-2 stat increases across his stats\n\n \n\nthen perhaps i would. what is worst is that this is the last time we shall see denethor...certainly until the return of the king saga packs which is years away. Also i am not fond of the lore denethor either....so it looks as if denethor wont feature much in my playing.\n\n \n\nrich\n\nEdited July 6, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809136","commentId":809136,"userName":"booored","timestamp":1373115711,"content":">  \n> \n> > I am puzzled as well. Mainly because of the OP's talking about Faramir not needing to be exhausted, when he in fact has to exhaust to provide his willpower boost.\n> > \n> > http://www.lotrlcg.com/Card/Focus/1014 [http://www.lotrlcg.com/Card/Focus/1014]\n> \n> I will try and un-puzzle you. For Faramir (core set) to boost the willpower of other characters, he needs not to be exhausted during the staging (thus he avoids getting hit by Necromancer's Reach, for instance). He can exhaust after the encounter cards have been revealed.\n> \n> Also, he needs not to commit to the quest in order to boost willpower, thus he avoids the getting hit by Blocking Wargs, for instance.\n> \n>  \n\n \n\nriiight... lol..I thought you were saying the new denathor makes faramir unplayable. Not the otherway around. Ok.. this thread is starting to make sense!\n\n \n\nyeah I agree. There is little reason to run this card |INSTEAD of faramir. But why are they in competition. I guess the real question is why not run both? a 4 cost 4 will is not that bad.. most 3 will are 5 cost and leader has hardly any high will cards, let alone one that is 4 cost for 3... in fact there are hardly any unless you are talkign about Dain and other dwarfs even so. 4 cost 3 will 4 with faramir isn't exactly a \"bad\" card if you looking for will in general, and VERY good for leadership.\n\nEdited July 6, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809150","commentId":809150,"userName":"DevastazioneH88","timestamp":1373119216,"content":"Totally agree with boored's last post. As for Lore Denethor, I love him...play him in an encounter control deck and you will almost always know what's coming, then if you don't like it, you just change it...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809168","commentId":809168,"userName":"Narsil0420","timestamp":1373121953,"content":"I like this new Denethor, his weakness is really thematic which is great. What we're seeing here is just the difference between Boromir style and Bilbo style players.\n\nAlso if you think about his stats without bias, they're just as good as most heroes, as they point out in the Team Covenant video. Maybe we're expecting too much from our allies..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809189","commentId":809189,"userName":"Pharmboys2013","timestamp":1373123629,"content":"while a direct comparison obviously shows Denethor as the weaker card; i tend to agree with boored's last post that there is no need to but them in direct comparison.  Used together they are a very strong questing tandem in leadership decks...and despite their high cost if there is one sphere where this doesnt matter its leadership\n\n \n\nplus once the faramir hero we all know is coming is released it just gives us options having both a hero and ally version of both characters\n\n \n\nso sure i'm bummed that his \"ability\" isnt better but i'm happy to have the new cards to play with and will try to find good situations for him"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809238","commentId":809238,"userName":"Gizlivadi","timestamp":1373130542,"content":"lleimmoen, I think you should take into consideration the fact that they make the cycles as a whole, not necessarily as separate packs, and considering that we will soon get Visionary Leadership, which as we all hope will give all Gondor characters +1 willpower, then that would make Denethor a lot more playable than he is now. Sorry if this was already said. I didn't read the whole thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809257","commentId":809257,"userName":"Pharmboys2013","timestamp":1373134560,"content":"Just used them both in a gondor themed deck to take on encounter at amon din...worked wonderfully as my leadership/tactics deck was in dire need of will power"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809280","commentId":809280,"userName":"legolas18","timestamp":1373139987,"content":"AND if you don't want him to be discarded, just get a copy of Sword that was Broken on Aragorn, and there you have it. No matter how hard you try to get four heroes damaged, it's just not gonna happen. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809286","commentId":809286,"userName":"lleimmoen","timestamp":1373141722,"content":"Glad most of you guys like him, in a way. I've never said he was unplayable, I only said he's terrible in comparison to Faramir. And the comparison makes sense because they're both Leadership 4-cost unique allies with 1 attack, 2 defence, 3 hit points. I get it that they may work together but I think I'll always prefer cheap allies to cooperate with Faramir. One can buy a lot for 4 resources, even with Leadership, though of course the cost of 4 is much more affordable within the sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=809299","commentId":809299,"userName":"Gizlivadi","timestamp":1373142619,"content":"He's still not that good in my opinion, but having another high willpower character in leadership is always good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836292","commentId":836292,"userName":"Rapier1","timestamp":1376166539,"content":"I would have preferred him to be more extreme and cost 5. (I'd have liked him to be willpower 5 but lose 2 per damaged hero - with a cost of 5). Alternatively I'd like him to be just as he is with willpower 4. I've always seen him as being one of the most strong willed characters (although he contended with greater forces and failed of course). However willpower 4 would lose the nice effect of having him abandon you, which is probably worth him being how he is.\n\n \n\nI don't think he's in competition at at all with ally Faramir - ally Faramir gives you good willpower if you want a lot of weak allies (he's amazing in that context, obviously far better) this new Denethor ally gives you good willpower if you want to focus on heroes (items/buffs/artifacts) and won't have that many weak allies, arguably Faramir is still likely to give you +3 or more. but Denethor does have the advantage of being able to give you that willpower even if allies are killed off. Overall Faramir is more versatile and thus a \"better\" card, but I think they are different enough that you'd probably want both and may pick Denethor first occasionally.\n\n \n\nFor example; If you want a situation where he seems better than his son- how about a secrecy deck? With two heroes he can never be discarded from damaged heroes; with less heroes the boost from Faramir isn't as good however Denthor still gives 3 wp. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836306","commentId":836306,"userName":"Troymk1","timestamp":1376168075,"content":"Forget theme\n\n \n\na 4 cost card should be directly comparable to a 4 cost card. \n\n \n\nThat's called game design "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836309","commentId":836309,"userName":"13thcaesar","timestamp":1376168356,"content":"Denethor ally can be good in Outlands deck - Denethor with Sword Of Morthond can even have 7 willpower, 5 attack, 6 defense, and 7 HP. \n\nBut Framir can be better with Sword Of Morthond - maybe can have max 6 willpower but have great ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836330","commentId":836330,"userName":"faith_star83","timestamp":1376170958,"content":"Well, from a Deck Builder's point of view I think that Denethor and Faramir do directly compete each other. As has been said, they are both 4Cost Leadership allies, which means they are likely to compete for the same slot in a deck. And there I would - given the current metagame - always prefer Faramir because he is less likely to end up being close to useless.\n\n \n\nIn general it seems (probably no accident, too) that the core set cards are powerful...very powerful. There are already so many new cards out, but still there are many staples coming from the core set, which is a bit surprising. I would expect that the new Denethor should be more powerful in a pure Gondor deck given the current cycle's theme. This would reward me for building a thematic deck with lots of cards from the new cycle, something many players like.\n\n \n\nSo, rather than debuffing Denethor conditionally I'd have added some Gondor-related conditional buff such as Base willpower 2, but +1 WP for every Gondor hero or so. At 4 cost this would give me a 5 WP ally in a purely Gondor Deck. Insane! Admittedly a bit too strong, but you get the idea :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nEdited August 10, 2013 by faith_star83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836336","commentId":836336,"userName":"Rapier1","timestamp":1376171527,"content":"> Denethor ally can be good in Outlands deck - Denethor with Sword Of Morthond can even have 7 willpower, 5 attack, 6 defense, and 7 HP. \n> \n> But Framir can be better with Sword Of Morthond - maybe can have max 6 willpower but have great ability.\n\n \n\nBad Shot.\n\nDenethor ally is definitely better for the sword of mothrond buff. Giving it to Faramir instead would mean he can give you 6 willpower OR his great ability.  (And with all the outlands cards in play you'd definitely get more out of Faramir using his abiity than questing even at WP 6).\n\nAlthough you would clearly want Faramir and Denethor in said deck, this is a good example of how having them both would be really good. (Showing that the two can work together).\n\nAdditionally Gondor is clearly a trait about resource generation, so I think running two 4 cost allies will not be difficult as the theme evolves.\n\nAlthough I do think Faith_Star83 raises a good point - I would argue that Faramir with his massive global buff is far far too good, rather than Denethor being weak. Like many of the early cards this is a sign of an unfortunate card design as the game was first created. I think that Faramir will probably stand as one of the best 4 cost allies for the entire life of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836340","commentId":836340,"userName":"13thcaesar","timestamp":1376172466,"content":"Denethor with Sword of morthond can  be good in outlands deck on 2 or more players, when another player chose  Faramir hero. for example I want play Campaing Lotr on 4 players. one player play Archers deck (Legolas, Bard the Bowman and Faramir), so in my Outlands deck Denethor and Sword Of Morthond  can be a good choose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836577","commentId":836577,"userName":"Glaurung","timestamp":1376213798,"content":"I think Denethor ally and that new sword is useless cards.\n\nThere is always question, what you will do with this card in bad situations?\n\nif you draw Denethor and all your heroes have a wound you cannot even play him! Ups! I dont need this card in my deck.\n\nAnd sword??? What is that. Better to put one more ally.\n\nWhat a point of this card? Sound interesting but practically there is a lot more effective cards for play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836587","commentId":836587,"userName":"ana4","timestamp":1376215052,"content":"Morthond's Sword is quite underwhelming. Were it not unique, then maybe, as a unique card it would probably be crazy to have more than one in a deck. As that, it is nice to upgrade a Gondor ally into an Outlands ally (though thematically absurd), but probably makes little difference in a game. As repeated many times, why is it that Outlands outshine Gondor? They were supposed to be the least strong of the two. I like that they get better when together but still, perhaps there should have been a Gondor Leader to unite them (and thus give them the power).\n\n \n\nComing back to Denethor, it is just hard to justify playing such a card, really. There is no trick in it (or it seems so), it is just a poor design, especially given the easy comparison to the allies of the same sphere and cost (or similar). And why the Steward works just the same in a non-Gondor deck is beyond me... He would actually work better with the likes of Elrond or the Lore sphere - not very supportive of the idea of making mono-sphere theme decks, really!\n\nEdited August 11, 2013 by Ana"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836591","commentId":836591,"userName":"Rapier1","timestamp":1376215959,"content":"The sword is amazing.  Outlands is all about weak useless allies that buff each other, the sword lets you give their super buffs to a strong ally instead. \n\nHow about having a white tower watchman that has 6 hp and defense 3 (as well as 4 wp and 3 attack), and if you run 3 purple heroes it can also take the damage of an undefended attack. \n\nOr what about giving it to a knight of Minis Tirith (giving it an impressive attack 6). \n\nIf you have a lot of outlands allies in play it's the most cost effective buff in the game. (with 3 spirit heroes on the new craftsman ally you can get willpower 6 on a 3 cost ally + 1 for the sword). \n\nObviously all of these require you to get out and keep out a stack of outlands allies, but that's the whole concept of the outlands trait anyway.\n\nDenethor ally is a much harder sell. He's definitely situational. His situation is (I feel) in decks with few allies, where Faramir may not be the best choice. Also decks with healing so you can negate the penalty to his wp. \n\nEdited August 11, 2013 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836597","commentId":836597,"userName":"ana4","timestamp":1376216633,"content":"Remember, the Outlands only boost the player who controls them. So it doesn't work with the Knight (unless you run three Tactics heroes for the Outlands, which I'm sure doesn't work). It is more lucrative for the likes of the Watchman, or even making Envoy or Errand-rider a quick champion. It is nice, surely, but I guess it won't matter that much once you've already had many Outlands out in play. Perhaps I'm wrong, and I will certainly try the card out..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836602","commentId":836602,"userName":"rekath16","timestamp":1376217869,"content":"I have Denethor in my Gondor Deck, solo I play Easy Mode and I could play Denethor in the first round what helps a lot for questing. Also I drew him already many times with A very good story, so for free such a nice guy, why not?\n\n \n\nThe drawback is his \"ability\" (lol) 2 or 3 times I had to cancel my turn and rethink everything cause a third hero would have taken a damage and then poor denethor disappears in the void. :-/\n\n \n\nBut I like him. Faramir is also in that deck so whatever :-D"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836603","commentId":836603,"userName":"leptokurt","timestamp":1376217963,"content":"The big advantage with Denethor is that he is very useful early in the game. With all the resource synergies that Gondor offers, you can play him on turn one already. He offers 3 WP immediately without exhausting one of your heroes. That's a huge benefit when you start a quest, as the first turn is crucial in many scenarios. For solo players Faramir needs some time to fully use his potential. Also, with Gondor you mostly have an overflow of resources, so why not spent the for an ally that has great stats?\n\n \n\nI wouldn't say that Denethor is super powerful, but he's not without use.\n\n \n\n \n\n \n\nEdit: crossposted with rekath. Very Good Tale is of course also a nice synergy.\n\nEdited August 11, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836606","commentId":836606,"userName":"MyNeighbourTrololo","timestamp":1376218619,"content":"I think this Denethor ally is a bad design. He costs too much, offers no good stats and possesses a drawback text which will get him killed. His real costs is 3 tops. \n\nEdited August 11, 2013 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836624","commentId":836624,"userName":"Rapier1","timestamp":1376220912,"content":"> Remember, the Outlands only boost the player who controls them. So it doesn't work with the Knight (unless you run three Tactics heroes for the Outlands, which I'm sure doesn't work). It is more lucrative for the likes of the Watchman, or even making Envoy or Errand-rider a quick champion. It is nice, surely, but I guess it won't matter that much once you've already had many Outlands out in play. Perhaps I'm wrong, and I will certainly try the card out...\n\nYou can run the knights without 3 tactics heroes. at 3 cost for 3 attack it's still good. (you lose the reaction ability that lets them attack as soon as you play them)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836712","commentId":836712,"userName":"Glaurung","timestamp":1376231300,"content":"> The sword is amazing.  Outlands is all about weak useless allies that buff each other, the sword lets you give their super buffs to a strong ally instead. \n> \n> How about having a white tower watchman that has 6 hp and defense 3 (as well as 4 wp and 3 attack), and if you run 3 purple heroes it can also take the damage of an undefended attack. \n> \n> Or what about giving it to a knight of Minis Tirith (giving it an impressive attack 6). \n> \n> If you have a lot of outlands allies in play it's the most cost effective buff in the game. (with 3 spirit heroes on the new craftsman ally you can get willpower 6 on a 3 cost ally + 1 for the sword). \n> \n> Obviously all of these require you to get out and keep out a stack of outlands allies, but that's the whole concept of the outlands trait anyway.\n> \n> Denethor ally is a much harder sell. He's definitely situational. His situation is (I feel) in decks with few allies, where Faramir may not be the best choice. Also decks with healing so you can negate the penalty to his wp. \n\nthat what i mean. If you have already a lot of Outlands allies in the game you dont need sword or something. You just need go quest quickly and win the game. yes you can play sword to some gondor ally but this  is just for fun......this card is just a fun..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836957","commentId":836957,"userName":"13thcaesar","timestamp":1376257646,"content":"Sword is great on 2 or more players, when one play Outlands deck. Another player who have in deck gondor ally and have leadership hero can put this attachment in deck and play in own gondor ally. Or even player who playing Outlands deck can play sword on some gondor ally in another deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836963","commentId":836963,"userName":"13thcaesar","timestamp":1376258311,"content":"like Ithilien Archer - with sword he can have high statistic and he are Ranged. Or Warden Of Healing, he have 1 HP, so quickly can die, with sword he can have high HP, and healing don't afraid he quickly fall."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836964","commentId":836964,"userName":"13thcaesar","timestamp":1376258470,"content":"And we have two AP to release, so still can show up some good gondor ally. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836982","commentId":836982,"userName":"13thcaesar","timestamp":1376259481,"content":"you do not need to have any Outlands allies in a game to the sword was useful. Just warden of healing with a sword and two anfalas herdsman. When some nasty card be revealed which deal 1 damage to all allies, wandering survives, and can then heal anfalas herdsman"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=836994","commentId":836994,"userName":"Gizlivadi","timestamp":1376262021,"content":"> you do not need to have any Outlands allies in a game to the sword was useful. \n\n \n\nlol you mean many  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837000","commentId":837000,"userName":"leptokurt","timestamp":1376263087,"content":"Heard of the new treachery card?\n\n \n\nNo?\n\n \n\nIt's called:\n\n \n\n \n\n \n\nNostalgia\n\n \n\nForced: Every Outlands character goes home to mummy.\n\n \n\n“He drew a deep breath. 'Well, I'm back,' he said.”\n\nSanwise Gamgee, The Return of the King"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837003","commentId":837003,"userName":"richsabre","timestamp":1376263202,"content":"i havent been following this thread so have no idea what that means leptokurt, but it did make me laugh, so well done"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837022","commentId":837022,"userName":"Gizlivadi","timestamp":1376266203,"content":"Sword of Morthond basically gives you an incredibly strong ally, in case you need an ally to have a great amount of something if you wanna do it with just that character and save your other outlands allies for something else, for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837051","commentId":837051,"userName":"klaymen_sk","timestamp":1376268944,"content":"> Sword is great on 2 or more players, when one play Outlands deck. Another player who have in deck gondor ally and have leadership hero can put this attachment in deck and play in own gondor ally. Or even player who playing Outlands deck can play sword on some gondor ally in another deck\n\nNope. Outlands characters' boosts work only for the other Outlands characters controlled by the same player. So playing the swordon a other player's Gondor ally who has no Outlands characters esentially gives him a worthless trait."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837198","commentId":837198,"userName":"Glaurung","timestamp":1376287121,"content":"Outlands i crazy powerful....... But for NM is ok"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837295","commentId":837295,"userName":"lleimmoen","timestamp":1376300391,"content":"The funny thing is there would be an easy, and thematic, way to fix the Denethor's ally problem. Just add \"When Denethor enters play, search your deck for 1 Gondor card and add it to your hand.\" This could of course bring your Steward of Gondor, for instance. Or even better perhaps \"After you play Denethor from your hand, search your deck for 1 title card and add it to your hand.\" Which could bring either Steward of Gondor or Lord of Morthond. This addition would make the card intriguing for me, and an obvious inclusion (perhaps even more than a single copy), and would stop me from ranting about the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837341","commentId":837341,"userName":"Tracker1","timestamp":1376305448,"content":"> Outlands i crazy powerful....... But for NM is ok\n\nJust got 1st season NM packs, outlands solo was able to handle PTM and JDtA.\n\nI cant imagine any other solo deck being able to win JDtA. Have you been successful with any others?\n\nAs for Denethor ally card, it's pretty poor. I cant imagine ever playing it, except for theme. You could use the sword with him, but as Glaurung said, it would be just for fun, outlands does not really need it. Errand Rider is a better target for the card if it is worth using."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837350","commentId":837350,"userName":"Glaurung","timestamp":1376305926,"content":"> > Outlands i crazy powerful....... But for NM is ok\n> \n> Just got 1st season NM packs, outlands solo was able to handle PTM and JDtA.\n> \n> I cant imagine any other solo deck being able to win JDtA. Have you been successful with any others?\n> \n> As for Denethor ally card, it's pretty poor. I cant imagine ever playing it, except for theme. You could use the sword with him, but as Glaurung said, it would be just for fun, outlands does not really need it. Errand Rider is a better target for the card if it is worth using.\n\nYes i done it with other decks as well. But still even with outlands deck there is big chance to lose. I found it fair enough.\n\nWhat about HFG? I heard it was easy for you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837352","commentId":837352,"userName":"Glaurung","timestamp":1376306044,"content":"> The funny thing is there would be an easy, and thematic, way to fix the Denethor's ally problem. Just add \"When Denethor enters play, search your deck for 1 Gondor card and add it to your hand.\" This could of course bring your Steward of Gondor, for instance. Or even better perhaps \"After you play Denethor from your hand, search your deck for 1 title card and add it to your hand.\" Which could bring either Steward of Gondor or Lord of Morthond. This addition would make the card intriguing for me, and an obvious inclusion (perhaps even more than a single copy), and would stop me from ranting about the card.\n\nCool idea! Shame designers, poor useless Denethor. But art is cool anyway!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837720","commentId":837720,"userName":"MyNeighbourTrololo","timestamp":1376328998,"content":"> Just got 1st season NM packs, outlands solo was able to handle PTM and JDtA.\n> \n> I cant imagine any other solo deck being able to win JDtA. Have you been successful with any others?\n> \n> \n> \n>  \n\nI've just beated NM JTtA with solo spirit/tactics deck, from my 4th or 5th try(I don't remember exactly). I did it in OCTGN, because I can't afford this card pool irl, I respected 1 core set card pool restriction when I built it though. Still, my win seemed very lucky - no Marshland Outlaws, no returning slain troll back with uncancellable treachery, etc. Had plenty of those in my first 4 runs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837727","commentId":837727,"userName":"Rapier1","timestamp":1376329345,"content":"> The funny thing is there would be an easy, and thematic, way to fix the Denethor's ally problem. Just add \"When Denethor enters play, search your deck for 1 Gondor card and add it to your hand.\" This could of course bring your Steward of Gondor, for instance. Or even better perhaps \"After you play Denethor from your hand, search your deck for 1 title card and add it to your hand.\" Which could bring either Steward of Gondor or Lord of Morthond. This addition would make the card intriguing for me, and an obvious inclusion (perhaps even more than a single copy), and would stop me from ranting about the card.\n\nThis is a nice idea. He'd be too good for 4 cost though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837767","commentId":837767,"userName":"Troymk1","timestamp":1376331674,"content":"> The funny thing is there would be an easy, and thematic, way to fix the Denethor's ally problem. Just add \"When Denethor enters play, search your deck for 1 Gondor card and add it to your hand.\" This could of course bring your Steward of Gondor, for instance. Or even better perhaps \"After you play Denethor from your hand, search your deck for 1 title card and add it to your hand.\" Which could bring either Steward of Gondor or Lord of Morthond. This addition would make the card intriguing for me, and an obvious inclusion (perhaps even more than a single copy), and would stop me from ranting about the card.\n\nI think that is a great suggestion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837788","commentId":837788,"userName":"Pharmboys2013","timestamp":1376333266,"content":"With only unrevealed 2 leadership cards left in this cycle it would be nicely fitting to still see an ally with that effect.  \n\n \n\nI kind of secretly have been hoping we'd see a Bergil ally (although id be suprised as his stats and sphere placement would be kind of tricky as he is only a child) but that would actually be a nice ability for him"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837804","commentId":837804,"userName":"MyNeighbourTrololo","timestamp":1376334471,"content":"Imagine if Deneothor had some resource-generating ability... he's Steward of Gondor, after all.\n\n \n\nAction: Exhaust Denethor to give add 1 resource to resource pools of up to 2 different heroes.\n\nEdited August 12, 2013 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837846","commentId":837846,"userName":"richsabre","timestamp":1376336902,"content":"i feel with events such as ever vigilant, strength of arms, and common cause, this could be rather too poweful. if it was limited then its a good idea"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837888","commentId":837888,"userName":"Troymk1","timestamp":1376338515,"content":"How about if simply he generated a resource each round?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=837958","commentId":837958,"userName":"Pharmboys2013","timestamp":1376341684,"content":"> i feel with events such as ever vigilant, strength of arms, and common cause, this could be rather too poweful. if it was limited then its a good idea\n\n \n\ncommon cause only works on heroes right? unless it was errata'd awhile ago and i never realized it.  Not that it matters much for me personally because i have not once included it in my decks, havent found that niche use for it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85905-faramir-vs-denethor/?do=findComment&comment=838057","commentId":838057,"userName":"richsabre","timestamp":1376347337,"content":"oh yeah probably. i was going from memory there so probably got that one wrong"}]}