{"url":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/","title":"The steward&#039;s fear: how did you beat it?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809341","commentId":809341,"userName":"Gizlivadi","timestamp":1373147144,"content":"Yesterday I got a copy of the Steward's fear, and proceded to build an outlands deck right away, using Hirluin, Beravor and Theodred. Then I tried it solo, played it 5 times and lost all of them. What's up with that? Most of the times I managed to swarm the table with outlanders and make a very powerful army, but still lost because my deck has a lot of card draw and 4 OUT OF 5 times I played it the plot was Up in Flames which ended up killing me, and every time I played it Daughter of Beruthiel was the villain enemy. Outside of that, the deck worked wonderfully and most of the times (when zealous traitor didn't kill each of my allies early on) all of my outlanders were pretty powerful on their own, but that was not enough though. How do you win this quest without having to use Spirit and Will  of the west? Is it just me or is the Steward's Fear actually a pretty hard scenario?\n\nEdited July 6, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809342","commentId":809342,"userName":"legolas18","timestamp":1373147568,"content":"I have played it once so far, and I beat it on the first try... Of course, I have no doubt that it was luck, and possibly because I had three players. But I can definitely imagine it being pretty difficult solo... I'll have to try it again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809350","commentId":809350,"userName":"richsabre","timestamp":1373148883,"content":"i have beat it 3 times, once two handed with outlands and a support deck, the other two was a secrecy deck.\n\ntake a look in the strategy section at 'the alliance deck' thread (glorfindel/theodred/bifur). it was actually changed with the help of my gaming friend and together we won it twice- once with an old style score of -3.\n\n \n\nmanaging the encounter deck is key. risk some light is a great card. we went through our deck and used will of the west in case we got the plot card that loses the game if you lose your hand\n\n \n\ni played the entire game keeping under 20, and managed to get it to 0 before winning....the victory points from the clues got to -3...however i actually didnt need to use them, i only claimed them before winning to lower the score\n\n \n\nthe deck is super fast card draw...it has  a lot of card draw....and this is where the deck wins so much. and resourceful...cant say how great that card is. ...here set up hand is another key thing. you need to mulligan for either a resourceful, light of valinor, timely aid or risk some light.\n\n \n\ntreachery cards are top priority here. risk some light helps, but you want test of wills handy..dwarven tomb helps here, as does the basic strategy of getting your deck out quickly\n\n \n\nwith threat so low you rarely need to engage enemies, especially with faramir boosting willpower. the beauty of this is that the traitor and so on dont hit you with their ability. you of course need to keep staging area clear-ish. asfaloth helps here, but you dont want to use it too much in the staging area as you want to clear those whilst active.\n\n \n\nive just realised thats quite a rambling post...so to summarize..how i won it most successfully was:\n\n \n\n-secrecy deck\n\n-high card draw to get....\n\n-encounter deck manipulation to....\n\n-keep the really awful treacheries away for when i cant cancel them, or to get locations to the top quicker\n\n-use asfaloth in a strategic way to make sure you arent 'wasting' locations in staging area. also dont use trackers ability to place progress unless its just to get the quest points less for later on\n\n-keep will of the west handy for the plot card you dont want\n\n-henemarth is good for solo to scout, however if you get the other plot card that give +1 card you need the risk some light\n\n-keep low threat throughout. so zealous traitor doesnt hit. use elronds counsel and dwarven tomb.\n\n-i used 1 copy of each of the unique elf allies...i love the theme mainly but it works for some reason\n\n-gildor\n\n-erestor\n\n-arwen\n\n-riversong\n\ni also  used\n\n-northern tracker\n\n-gleowine\n\n-faramir\n\n-gandalf\n\n-elfhelm\n\n \n\nattatchments\n\n-resourceful\n\n-steward\n\n-asfaloth\n\n-light of valinor\n\n \n\nevents\n\n-risk some light\n\n-test of will\n\n-tomb\n\n-dearons runes\n\n-wealth of lorien\n\n-elronds counsel\n\n-will of the west\n\n-sneak attack\n\n-timely aid\n\nrich\n\nEdited July 6, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809363","commentId":809363,"userName":"DevastazioneH88","timestamp":1373152462,"content":"Beat it both solo and multi (though in multi only three times with synergic dwarven decks). Solo with a gondor deck with aragorn (core), Boromir (core) and eleanor (a couple times); with a tactics/spirit event recycle deck (Legolas, Hama, Glorfindel), with an outlands deck (Hirluin, Denethor, Glorfindel) and with a monolore deck (Aragorn, Denethor, Mirlonde)...after a lot of tries though, I think that no matter how good your deck is, if you don't get a little hand from Mrs luck there's no way you're gonna win. First of all if you get triple surged during turn one or triple underworlded you're pretty dead, then if you reveal dark alliance as plot (and you're playing solo) you're dead (I don't think I ever defeated this scenario while dark alliance was the plot). IMO this scenario is easier with legolas + hands upon the bow, a good quester (possibly spirit for cancel) and any third hero (obviously not a useless one like brand) or with at least two lore heroes in your deck (so you can play lore cards more easily) because cards like mirkwood runner are awsome  against the enemies from this scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809366","commentId":809366,"userName":"Gizlivadi","timestamp":1373152792,"content":"Thanks a lot rich. Did you beat it with that deck solo? Also what do you do to get rid of enemies? You keep them in the staging are to avoid engagement which is fine, but what do you do when they start piling up? Also, sadly I do not have gildor (THOEM is the only adventure pack I don't have), and I get that he would help me greatly. But can it be done without him? \n\n \n\nAlso Devastazione, which Boromir do you use again? I suppose the tactics one.\n\nEdited July 6, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809371","commentId":809371,"userName":"richsabre","timestamp":1373153740,"content":"> Thanks a lot rich. Did you beat it with that deck solo? Also what do you do to get rid of enemies? You keep them in the staging are to avoid engagement which is fine, but what do you do when they start piling up? Also, sadly I do not have gildor (THOEM is the only adventure pack I don't have), and I get that he would help me greatly. But can it be done without him? \n> \n>  \n> \n> Also Devastazione, which Boromir do you use again? I suppose the tactics one.\n\nno problem. it was pretty much that deck yes. most of the events x 3. each of the unique allies x1. tracker x3. attatchments x3 apart from asfaloth and steward x1. not sure if that adds up as i may be a little out as i dont have the cards in front of me\n\n \n\nthe enemies was a strange thing actually. i have never played the strategy of keeping them there. we engaged the dissidents as they dont have much of a bad ability if you are not location heavy, which in solo was the case here. we used arwens +1 to give a elfhelm (an ally i forgot to list) extra defense, who was ready incase of threat increase. glorfindel with the light was ready as was a tracker if i chose not to quest with him, or riversong.\n\n \n\nthe other ones stayed there until we could tell whether we could engage them without it being too much of a problem. the traitor we generally kept untill we could sneak a gandalf in. the pickpocket was only engaged when we has some many cards the chances of discarding a key one was low enough, or we had dwarven tomb if we lost a test of will.\n\n \n\nat the end the hand of castamir was killed with two gandalfs - one per turn, though we had enough allies in play to take him down the normal way if we didnt have the gandalfs.\n\n \n\nall this probably sounds a bit 'situational' with the strategy, such as using gandalfs or asfaloth, or timely aid and so on, but the such high card draw and resource rate means that 'needing' these cards to some extend isnt a bad thing.\n\n \n\nrisk some light was also very useful as we didnt run any hasty strokes, so we could tell what cards were coming for a shadow effect if we decided to engage (that was with the 2 cards coming per turn through the plot card + the shadow card giving the 3 you can place how you wish)\n\nhope this helps....and gildor is an amazing ally, expensive but this deck can handle it. it could be done without him, faramir is a key card to get out quickly i think, and gildor is a bonus\n\nrich\n\nEdited July 6, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809372","commentId":809372,"userName":"scwont","timestamp":1373153955,"content":"> Thanks a lot rich. Did you beat it with that deck solo? Also what do you do to get rid of enemies? You keep them in the staging are to avoid engagement which is fine, but what do you do when they start piling up?\n\nRanger Spikes are brilliant for neutralising enemies in this scenario, especially as several have nasty abilities that trigger when they engage you.\n\n \n\nPlenty of willpower and location control also helps (fairly obvious perhaps, but it despite sharing some encounter cards it is a bit different from the Battle/Siege heavy Heirs of Numenor quests).\n\n \n\nWill of the West is essential in case of Up in Flames, especially if you're running lots of card draw or other cards that drain your own deck (e.g. A Very Good Tale). I include a mix of Dwarven Tomb and Will of the West in case the latter ends up in the discard pile before you can use it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809447","commentId":809447,"userName":"Glaurung","timestamp":1373173358,"content":"Steward is tricky cose of the Plot card. But in 2 and more player game you can be more flexible again plot in solo game not.\n\n \n\nIn multy player game you can quest quickly and get lot of locations and explore them to move but in solo you can get stuck with enemies and vualya you have not enough time. Vilian is not so powerful as a Plot cards so there is no big chance but Plot yes this is the Heart of the problem. Solo game and Multy player game in this quest is really different. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809461","commentId":809461,"userName":"Gizlivadi","timestamp":1373177289,"content":"I agree on that the villain is not the main problem. I killed Daughter of Beruthiel in the same round that she was revealed so that's not what I'm concerned about. It's the plot, and the fact that it managed to kill me before I could put 15 progress on the last quest. Thanks all of you, I'll try your suggestions. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809522","commentId":809522,"userName":"DevastazioneH88","timestamp":1373190068,"content":"@ Gizlivadi: Yep, Tactics one. He and Eleanor have been really powered up by Gondorian Shield"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809648","commentId":809648,"userName":"Alex6222","timestamp":1373218277,"content":"> Yesterday I got a copy of the Steward's fear, and proceded to build an outlands deck right away, using Hirluin, Beravor and Theodred. Then I tried it solo, played it 5 times and lost all of them. What's up with that? Most of the times I managed to swarm the table with outlanders and make a very powerful army, but still lost because my deck has a lot of card draw and 4 OUT OF 5 times I played it the plot was Up in Flames which ended up killing me, and every time I played it Daughter of Beruthiel was the villain enemy. Outside of that, the deck worked wonderfully and most of the times (when zealous traitor didn't kill each of my allies early on) all of my outlanders were pretty powerful on their own, but that was not enough though. How do you win this quest without having to use Spirit and Will  of the west? Is it just me or is the Steward's Fear actually a pretty hard scenario?\n\nUp in Flames is the killer for Outland decks. Everytime i reveal it i know there´s a 95% chance that i will loose. I have only managed to win once against Up in Flames and was only because A Prisoner decided to show up. Against the other Plots Outland don´t have much trouble so just keep an eye for the Traitor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809704","commentId":809704,"userName":"Gizlivadi","timestamp":1373226925,"content":"The traitor is killer, I agree. Strangely enough, the third time I played the quest I managed to reveal all 3 clues and used them in what I thought was the best way possible (had just cleared the first stage, then I put 3 tokens on roots of mindolluin with the secret map, thus put a resource on the second stage, then added the other 3 resource tokens on the stage with the prisoner and the history scroll, but since the deck has a lot of card draw/filtering with hunter of lamedon, a very good tale, peace and thought, beravor and daeron's runes, up in flames still killed me :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] I still think though that this is a very good quest and it's definately one of my favourites.\n\nEdited July 7, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809730","commentId":809730,"userName":"richsabre","timestamp":1373230395,"content":"> I still think though that this is a very good quest and it's definately one of my favourites.\n\nyes- what i like most of all is the fact they ended the quest with a piece of writing that you could only read once you have completed it. this is exactly what we asked for during the early days of the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=809740","commentId":809740,"userName":"Gizlivadi","timestamp":1373231199,"content":"I agree completely, it gives the whole cycle a feeling of importance and urgency despite being essentially fanfiction, something that the Dwarrodelf cycle didn't have. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=811209","commentId":811209,"userName":"gatharion","timestamp":1373432381,"content":"I found The Steward's Fear pretty easy.\n\n \n\nAbout the roughest game I had was when I tried an Outland's Deck. Mostly because of multiple Zealous Traitors killing off my allies. Any deck that wasn't so reliant on allies though did just fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=824624","commentId":824624,"userName":"player1761766","timestamp":1375011489,"content":"After it sitting on my shelf for over two months, I finally played Steward's Fear this morning, and somehow managed to beat it solo. Possibly the villain/plot helped here - Telemnar's Bane, who landed in the staging area straight onto my ranger spikes, and Unholy Alliance. I wouldn't say it was easy, but I definitely have mixed feelings about how good this quest is. It was just an incredible experience through 1B and 2B, I was enraptured by it all, even as my guys were being beat up and such, but then 3B was a bit of an anti-climax. I'd discovered the plot, I defeated the villain, and then I was doing - what? Hanging about while I could get the remaining progress tokens on the quest? Telemnar's Bane was defeated with either 3 or 5 progress on there, so the game was thematically over when I had done what was required of me, so what the hell? I wish 3B had been better designed, with another unique progress variant on it like the other two. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=824742","commentId":824742,"userName":"Gizlivadi","timestamp":1375026417,"content":"I've played this quest over 15 times with different decks and have never managed to beat it.\n\nEdited July 28, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85932-the-stewards-fear-how-did-you-beat-it/?do=findComment&comment=824853","commentId":824853,"userName":"GrandSpleen","timestamp":1375035895,"content":"> After it sitting on my shelf for over two months, I finally played Steward's Fear this morning, and somehow managed to beat it solo. Possibly the villain/plot helped here - Telemnar's Bane, who landed in the staging area straight onto my ranger spikes, and Unholy Alliance. I wouldn't say it was easy, but I definitely have mixed feelings about how good this quest is. It was just an incredible experience through 1B and 2B, I was enraptured by it all, even as my guys were being beat up and such, but then 3B was a bit of an anti-climax. I'd discovered the plot, I defeated the villain, and then I was doing - what? Hanging about while I could get the remaining progress tokens on the quest? Telemnar's Bane was defeated with either 3 or 5 progress on there, so the game was thematically over when I had done what was required of me, so what the hell? I wish 3B had been better designed, with another unique progress variant on it like the other two. \n\n \n\nFair enough, fair enough.  But consider your statement.  \"I'd discovered the plot, I defeated the villain, and then I was doing - what? Hanging about while I could get the remaining progress tokens on the quest? \"\n\n \n\nYou're allowing the plot and villain cards to represent what they are intended to represent, but you are not allowing the progress tokens to be anything more than an abstract unit.  Progress tokens, though, are supposed to represent whatever the game needs them to.  In Redhorn Gate they are your progress up the mountain... in A Journey to Rhosgobel they represent your travels to Rhosgobel, and then your efforts to scour the forest for Athelas.\n\n \n\nIn the Steward's Fear, if you get Up in Flames, the progress tokens represent your efforts to put out the fire.  With Poisoned Counsels you are removing corrupted politicians from power.  With Unholy Alliance perhaps you are rounding up the Orcish agents of Mordor within the city, or perhaps sealing off their subterranean passage into the city (as suggested by the card art).  Discovering the plot is one thing, but you still have to do something about it before you can call it a victory.\n\nEdited July 28, 2013 by GrandSpleen"}]}