{"url":"https://community.fantasyflightgames.com/topic/85965-end-text/","title":"End Text","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/85965-end-text/?do=findComment&comment=809734","commentId":809734,"userName":"richsabre","timestamp":1373230592,"content":"My favourite thing about stewards fear was the end text on the insert that you could only read after completing the quest.\n\n \n\ni remember in the early days of the game many players didnt like the fact that the 3b (or whichever was last) just 'ended' without even a paragraph of concluding text.\n\n \n\nhowever this is exactly what we wanted....only better of course.\n\n \n\ni have a question- has it been confirmed anywhere that ffg are planning to continue this?\n\n \n\ni would assume yes, only stewards was a theme heavy quest, so perhaps it was just this.\n\n \n\nif a designer's reading this, then please continue - and thanks!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/85965-end-text/?do=findComment&comment=809746","commentId":809746,"userName":"Pharmboys2013","timestamp":1373231894,"content":"rich, i'm not sure if you've attained druadan forest and encounter at amon din yet but they both also have the \"end texts\".  Encounter at amon din actually as a really lengthy \"beginning\" text that takes up the whole front of the package insert!  I'm sure you'll love it.  This one even discusses the events of Heirs of Numenor quests too\n\n \n\ni'm sure all the APs in this cycle will have feature these and hopefully future cycles as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85965-end-text/?do=findComment&comment=809752","commentId":809752,"userName":"Khamul The Easterling","timestamp":1373232915,"content":"Yeah, like I said before, to me it made me feel like I was reading a book and then stopped reading to take part in some of the adventure and then read the book again.  Pretty sweet. I love it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/85965-end-text/?do=findComment&comment=809753","commentId":809753,"userName":"richsabre","timestamp":1373233364,"content":"thats great! cannot wait until my packs arrive!"}]}