{"url":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/","title":"quote your favourite sentence(s) from the lotr","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812247","commentId":812247,"userName":"richsabre","timestamp":1373560038,"content":"...or paragraph. also can be from any tolkien work (cant edit titles anymore). so many to chose from, here's one of mine\n\n \n\n\"The night deepened. There came the soft sounds of horses led with stealth along the lane. Outside the gate they stopped, and three black figures entered, like shades of night creeping across the ground. One went to the door, one to the corner of the house on either side; and there they stood, as still as the shadows of stones, while night went slowly on. The house and the quiet trees seemed to be waiting breathlessly.\"\n\n \n\np.172 A knife in the Dark. The Fellowship of the Ring.\n\n \n\nThis has to be perhaps my favourite passage from tolkiens work. It probably isnt an obvious one, but my image of first reading this wouldn't have looked out of place in some horror film...imagine walking along and seeing 3 black figures standing, still as stone, out of the corner of your eye? its even worse that its implied that they stay like that for most of the night..unmoving..shivers....\n\nEdited July 11, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812249","commentId":812249,"userName":"Khamul The Easterling","timestamp":1373560271,"content":"can it be from the hobbit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812251","commentId":812251,"userName":"richsabre","timestamp":1373560366,"content":"> can it be from the hobbit?\n\n \n\nsure- i couldnt edit the title when i realised it would be better from all tolkien\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812255","commentId":812255,"userName":"Nickpes","timestamp":1373560530,"content":"\"End? No, the journey doesn't end here. Death is just another path... One that we all must take. The grey rain-curtain of this world rolls back, and all turns to silver glass... And then you see it. \nPippin [http://www.imdb.com/name/nm0101710/]: What? Gandalf?... See what? \nGandalf [http://www.imdb.com/name/nm0005212/]: White shores... and beyond, a far green country under a swift sunrise.\"\n\n \n\nIt was my signature before the update, I will have it again soon\n\nEdited July 11, 2013 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812260","commentId":812260,"userName":"richsabre","timestamp":1373560802,"content":"yes that is a nice quote- interesting that they took part of the passage from frodo's dream in the chapter 'fog on the barrow downs' and applied it to the siege of minas tirith. i think sir ian's acting was supreme in that scene\n\nrich\n\nEdited July 11, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812276","commentId":812276,"userName":"lleimmoen","timestamp":1373561760,"content":"Oh, what a massive thread. I'll start with the most philosophical one (in my eyes, of course).\n\n \n\n\"He that breaks a thing to find out what it is has left the path of wisdom.\"\n\n- Gandalf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812280","commentId":812280,"userName":"richsabre","timestamp":1373561978,"content":"> Oh, what a massive thread. I'll start with the most philosophical one (in my eyes, of course).\n> \n>  \n> \n> \"He that breaks a thing to find out what it is has left the path of wisdom.\"\n> \n> - Gandalf\n\noh yes- thats a great one. as someone who is following the path of science...i hold myself guilty of that haha (though not directly of course....yet.. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]  )\n\nEdited July 11, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812285","commentId":812285,"userName":"DevastazioneH88","timestamp":1373562124,"content":"One of my favourite has always been: \" We live now upon an island amid many perils, and our hands are more often upon the bowstring than upon the harp.\" \n\n \n\nwhat's curious is they used this sentence as flavour text for Hands upon the Bow (one of my favourite cards XD)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812291","commentId":812291,"userName":"Nickpes","timestamp":1373562661,"content":">  \n> \n>  \n> \n> yes that is a nice quote- interesting that they took part of the passage from frodo's dream in the chapter 'fog on the barrow downs' and applied it to the siege of minas tirith. i think sir ian's acting was supreme in that scene\n> \n> rich\n> \n>  \n> \n>  \n\n \n\nWell , I do not thing the hole scene is at the book at all as it appears in the movie ... and yes Sir Ians acting was superb\n\n \n\nIt is one of the many differences between movie and book, but it was a nice scene after all that stuck into my mind\n\nEdited July 11, 2013 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812300","commentId":812300,"userName":"Mr Coffee","timestamp":1373562917,"content":"The world is indeed full of peril and in it there are many dark places.  But still there is much that is fair.  And though in all lands, love is now mingled with grief, it still grows, perhaps, the greater. - Haldir\n\n \n\n'Faithless is he that says farewell when the road darkens,' said Gimli.\n'Maybe,' said Elrond, 'but let him not vow to walk in the dark, who has not seen the nightfall.'\n'Yet sworn word may strengthen quaking heart,' said Gimli.\n'Or break it,' said Elrond.\n\n \n\nWar must be, while we defend our lives against a destroyer who would devour all; but I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend. - Faramir\n\n \n\n \n\n* My favorite story in all of Middle Earth lore is The Children of Hurin (in its many forms)... (followed by the Fall of Gondolin- in conjuction with Tuor's story).  A few from that tale:\n\n \n“A man that flies from his fear may find that he has only taken a short cut to meet it.”\n \n“I will not walk backward in life.”\n\n \n\nNow when Túrin learnt from Finduilas of what had passed, he was wrathful, and he said to Gwindor: \"In love I hold you for your rescue and sake-keeping. But now you have done ill to me, friend, to betray my right name, and call my doom upon me, from which I would lie hid.\"  But Gwindor answered: \"The doom lies in yourself, not in your name.\"\n\n \n\n \n\n* And speaking of Tuor and Gondolin:\n\n \n\nFor a while Ecthelion stood silent, looking at Tuor, and slowly awe filled his face, as if in the grey shadow of Tuor's cloak he saw visions from far away. Then he bowed, and went to the fence and laid hands upon it, and gates opened inward on either side of the pillar of the Crown. Then Tuor passed through, and coming to a high sward that looked out over the valley beyond, he beheld a vision of Gondolin amid the white snow. And so entranced was he that for long he could look at nothing else; for he saw before him at last the vision of his desire out of dreams of longing.\n\nThus he stood and spoke no word. Silent upon either hand stood a host of the army of Gondolin; all of the seven kinds of the Seven Gates were there represented; but their captains and chieftains were upon horses, white and grey. Then even as they gazed on Tuor in wonder, his cloak fell down, and he stood there before them in the mighty livery of Nevrast. And many were there who had seen Turgon himself set these things upon the wall behind the High Seat of Vinyamar.\n\nThen Ecthelion said at last: \"Now no further proof is needed; and even the name he claims as son of Huor matters less than this clear truth, that he comes from Ulmo himself.\"\n\nEdited July 11, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812306","commentId":812306,"userName":"Nickpes","timestamp":1373563396,"content":"As for the book .... there are many many I like , but this one, early in first book, I liked a lot \n\n \n\n\"Go not to the Elves for counsel, for they will say both no and yes\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812311","commentId":812311,"userName":"richsabre","timestamp":1373563541,"content":"> As for the book .... there are many many I like , but this one, early in first book, I liked a lot \n> \n>  \n> \n> \"Go not to the Elves for counsel, for they will say both no and yes\"\n\ngood quote. that whole conversation between gildor and frodo is a great piece\n\nrich\n\nEdited July 11, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812319","commentId":812319,"userName":"Khamul The Easterling","timestamp":1373563890,"content":"\"Alas! alas!\" cried Legolas, and in his fair elvish face there was great distress. \"The tidings that I was sent to bring must now be told. They are not good, but only here have I learned how evil they may seem to this company. Smeagol, who is now called Gollum has escaped.\"\n\n\"Escaped?\" cried Aragorn. \"That is ill news indeed. We shall all rue it bitterly, I fear. How came the folk of Thranduil to fail in their trust?\"\n\n\"Not through lack of watchfulness,\" said Legolas; \"but perhaps through over-kindliness. And we fear that the prisoner had aid from others, and that more is known of our doings than we could wish. We guarded this creature day and night, at Gandalf's bidding, much though we wearied of the task. But Gandalf bade us hope still for his cure, and we had not the heart to keep him ever in dungeons under the earth, where he would fall back into his old black thoughts.\"\n\n\"You were less tender to me,\" said Gloin with a flash of his eyes, as old memories were stirred of his imprisonment in the deep places of the Elven-king's halls.\n\n\"Now come!\" said Gandalf. \"Pray do not interrupt, my good Gloin. That was a regrettable misunderstanding, long set right. If all the grievances that stand between Elves and Dwarves are to be brought up here, we may as well abandon this Council.\"\n\nGloin rose and bowed, and Legolas continued. \"In the days of fair weather we led Gollum through the woods; and there was a high tree standing alone far from the others which he liked to climb. Often we let him mount to the highest branches, until he felt the free wind; but we set a guard at the tree's foot. One day he refused to come down, and the guards had no mind to climb after him: he had learned the trick of clinging to boughs with his feet as well as with his hands; so they sat by the tree far into the night.\n\nIt was that very night of summer, yet moonless and starless, that Orcs came on us at unawares. We drove them off after some time; they were many and fierce, but they came from over the mountains, and were unused to the woods. When the battle was over, we found that Gollum was gone, and his guards were slain or taken. It then seemed plain to us that the attack had been made for his rescue, and that he knew of it beforehand. How that was contrived we cannot guess; but Gollum is cunning, and the spies of the Enemy are many. The dark things that were driven out in the year of the Dragon's fall have returned in greater numbers, and Mirkwood is again an evil place, save where our realm is maintained.\n\n\"We have failed to recapture Gollum. We came on his trail among those of many Orcs, and it plunged deep into the Forest, going south. But ere long it escaped our skill, and we dared notcontinue [http://www.iment.com/maida/tv/lordoftherings/gimlilegolasquotes.htm] the hunt; for we were drawing nigh to Dol Guldur, and that is still a very evil place; we do not go that way.\"\n\n \n\nThat is my favorite part in all the books "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812332","commentId":812332,"userName":"richsabre","timestamp":1373564291,"content":"the whole chapter of the council is a great chapter. there is much debate among the tolkien world whether it goes on for too long, and i certainly do not agree. it is an essential part in setting the 'epic scene'. the first book was fine without this setting, as it is a different pace to the 2nd  and further books.\n\n \n\nit also of course introduces the fellowship in a natural way\n\nrich\n\nPS- did you type that? must of taken a while!\n\nEdited July 11, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812335","commentId":812335,"userName":"Mr Coffee","timestamp":1373564479,"content":"Fingolfin (ultimate badass warrior king) upon the defeat at Dagor Bragollach, rides alone to Angband to challenge Morgoth to single combat.  Orcs fled as he thundered his way to the stronghold.  Arriving, he beats on the gates and issues his challenge (and insults).  And Morgoth, greatest of dark lords, responded:\n\n \n\n \n\n\"That was the last time in those wars that he passed the doors of his stronghold, and it is said that he took not the challenge willingly; for though his might was greatest of all things in this world, alone of the Valar he knew fear. But he could not now deny the challenge before the face of his captains; for the rocks rang with the shrill music of Fingolfin's horn, and his voice came keen and clear down into the depths of Angband; and Fingolfin named Morgoth craven, and lord of slaves. Therefore Morgoth came, climbing slowly from his subterranean throne, and the rumour of his feet was like thunder underground. And he issued forth clad in black armour; and he stood before the King like a tower, ironcrowned, and his vast shield, sable unblazoned, cast a shadow over him like a stormcloud. But Fingolfin gleamed beneath it as a star; for his mail was overlaid with silver, and his blue shield was set with crystals; and he drew his sword Ringil, that glittered like ice.\"\n \n \nI love, love, LOVE that section.  His description gives me chills as he contrasts the overwhelming darkness that was Morgoth with the cutting brightness of Finglofin.  And just how powerful was Fingolfin??  He has the stones to ride alone into the enemy's greatest stronghold (and they all flee from him as he approaches), and then Morgoth himself, a virtual deity,  basically says,  \"****.  I have to fight him.  Can't look like a wuss in front of my minions...\"\n \nThis is why I love the older stories... Not to take anything away from the third age (which I also love), but everything was bigger, badder, more epic in the first/second age... Balrogs and dragons everywhere...  Elven lords killing those Balrogs single-handedly... Men marrying elves.  Elves marrying goddesses..... Islands being raised.  Then demolished.  Continents being destroyed..... sigh.\nEdited July 11, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812337","commentId":812337,"userName":"Khamul The Easterling","timestamp":1373564506,"content":"naw ctr c ........ ctr v  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  \n\n \n\nI like all the mysterious stories and characters in the books more than all the main parts and characters.  That quote fits that perfectly    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812338","commentId":812338,"userName":"kyrie","timestamp":1373564558,"content":"One of mine is my signature. It's from Bilbo's speech at his 111th birthday party.\n\n \n\n\"I don't know half of you half as well as I should like; and I like less than half of you half as well as you deserve.\" - Bilbo Baggins"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812345","commentId":812345,"userName":"richsabre","timestamp":1373564731,"content":"> One of mine is my signature. It's from Bilbo's speech at his 111th birthday party.\n> \n>  \n> \n> \"I don't know half of you half as well as I should like; and I like less than half of you half as well as you deserve.\" - Bilbo Baggins\n\nhow many needed to work that one out the first time they read it? :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]  (i was only 10 so its not so bad...)\n\n \n\n> naw ctr c ........ ctr v   :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n> \n> I like all the mysterious stories and characters in the books more than all the main parts and characters.  That quote fits that perfectly    \n\nhave you read the Unfinished Tales? if not i think you would like it as it is filled with those types of 'backstories' similar to what you quoted\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812355","commentId":812355,"userName":"Nickpes","timestamp":1373565349,"content":">  \n> \n> > As for the book .... there are many many I like , but this one, early in first book, I liked a lot \n> > \n> >  \n> > \n> > \"Go not to the Elves for counsel, for they will say both no and yes\"\n> \n> good quote. that whole conversation between gildor and frodo is a great piece\n> \n> rich\n> \n>  \n\nIndeed .... Frodos answer I quoted was a clever one to Gildors about wizards, but yet again Gildor gave a nice answer too ... I agree the hole conversation was great"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812357","commentId":812357,"userName":"player1761766","timestamp":1373565586,"content":"And this is what he saw.\n\nThree very large persons sitting round a very large fire of beech-logs. They were toasting mutton on long spits of wood, and licking the gravy off their fingers. There was a fine toothsome smell. Also there was a barrel of good drink at hand, and they were drinking out out of jugs. But they were trolls. Obviously trolls. Even Bilbo, in spite of his sheltered, life, could see that: from the great heavy faces of them, and their size, and the shape of their legs, not to mention their language, which was not drawing-room fashion at all, at all.\n\n \n\nI love this for so many reasons! It's really very cute, with a sort of Edwardian whimsy about the narration  :rolleyes: [//content.invisioncic.com/Mfantflight/emoticons/default_rolleyes.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812358","commentId":812358,"userName":"lleimmoen","timestamp":1373565598,"content":"Fingolfin is indeed the ultimate tragic hero. In a way I am glad Silmarillion is not being done (in the game), because I couldn't stand anything less than perfect for Fingolfin (and I'd probably have to have him in every deck). The passage depicting his duel with Morgoth is classic, especially Fingolfin's ride to his doom."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812359","commentId":812359,"userName":"Nickpes","timestamp":1373565600,"content":">  \n> \n> Fingolfin (ultimate badass warrior king) upon the defeat at Dagor Bragollach, rides alone to Angband to challenge Morgoth to single combat.  Orcs fled as he thundered his way to the stronghold.  Arriving, he beats on the gates and issues his challenge (and insults).  And Morgoth, greatest of dark lords, responded:\n> \n> ......................\n> \n>  \n\n \n\n \n\nI have stated in another thread that Fingolfin is my favourite Tolkien hero, and the combat with Morgoth is the reason ... GREAT , thanks  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812364","commentId":812364,"userName":"lleimmoen","timestamp":1373566049,"content":"\"The wide world is all about you: you can fence yourselves in, but you cannot for ever fence it out.\"\n\n- Gildor\n\n \n\nThat Tolkien guy was a rather clever fellow, was he not? This above is of course meant for Hobbits but can be applied to many a people. Timeless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812414","commentId":812414,"userName":"richsabre","timestamp":1373572331,"content":"> \"The wide world is all about you: you can fence yourselves in, but you cannot for ever fence it out.\"\n> \n> - Gildor\n> \n>  \n> \n> That Tolkien guy was a rather clever fellow, was he not? This above is of course meant for Hobbits but can be applied to many a people. Timeless.\n\nexcellent passage!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812423","commentId":812423,"userName":"Mr Coffee","timestamp":1373572836,"content":"> \"The wide world is all about you: you can fence yourselves in, but you cannot for ever fence it out.\"\n> \n> - Gildor\n> \n>  \n> \n> That Tolkien guy was a rather clever fellow, was he not? This above is of course meant for Hobbits but can be applied to many a people. Timeless.\n\n \n\nIf there had been a stronger connection from Gildor to the first age, I would almost think he was saying this whistfully in rememberance of Doriath and the Girdle of Melian..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812431","commentId":812431,"userName":"danpoage","timestamp":1373573358,"content":"I have always loved the nuance of Tolkien's perspective on people, their place in the world, and how it relates to things like love and war. This quote is an excellent summation of this more enlightened understanding that life is not so much about \"good\" and \"evil\" but each person fighting for what they believe is right:\n\n“The enemy? His sense of duty was no less than yours, I deem. You wonder what his name is, where he came from. And if he was really evil at heart. What lies or threats led him on this long march from home. If he would not rather have stayed there in peace. War will make corpses of us all.”"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812446","commentId":812446,"userName":"Gizlivadi","timestamp":1373574168,"content":"Well yeah, Faramir in the lotr was this sort of catalyst for Tolkien's view of the world, one which wasn't quite as simple as a hobbit but not as powerful as Gandalf. I like that passage a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812463","commentId":812463,"userName":"richsabre","timestamp":1373575489,"content":"\"Then who would you take up with? asked Strider. A fat inkeeper who only remembers his name because people shout it at him all day?\"\n\n \n\nStrider, Strider, Fellowship of the Ring\n\n \n\nclassic .... :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png] as you can probably tell im re (re, re, re etc.) reading the fellowship so im re discovering some of my favourite passages\n\nEdited July 11, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812482","commentId":812482,"userName":"Ellareth","timestamp":1373577260,"content":"\"...... So! With the left hand thou wouldst use me for a little while as a shield against Mordor, and with the right bring up this Ranger of the North to supplant me,\n\n'But I say to thee, Gandalf Mithrandir, I will not be thy tool! I am Steward of the House of Anarion. I will not step down to be the dotard chamberlain of an upstart. Even were his claim proved to me, still he comes but of the line of Isildur. I will not bow to such a one, last of a ragged house long bereft of lordship and dignity.\"\n\n \n\n...\n\n \n\n\"I would have things as they were in all the days of my life... and the days of my longfathers before me: to be the Lord of this City in peace, and leave my chair to a song after me, who would be his own master and no wizard's pupil. But if doom denies this to be, then I would have naught: neither life dimished, nor love halved, nor honour abated.\"\n\n \n\n- Denethor, The Pyre of Denethor.\n\n \n\n \n\n \n\nOne of the passages I think that defines Denethor's characteristics.\n\nHe's not corrupted or greedy for power; he just wants what is rightfully his.\n\nEven in his last deteriating moments, he sees the truth in matters, present and future.\n\n \n\nGandalf had been working to put Aragorn on throne of Gondor for decades.\n\nIsildur's line has no claim on throne of Gondor, as proven before when King Arvedui of Arnor tried to claim Kingship of Gondor.\n\nDuring rein of King Elessar, Steward Faramir was removed from Minas Tirith to Emyn Arnen, where he was to rule Ithilien.\n\n \n\nShame on Aragorn for taking the easy way of usurping the Southern Kingdom instead of reuniting the Northern Kingdom.\n\nShame on Gandalf for helping heir of Isildur's usurp the throne of Gondor, instead of helping its rightful ruler without second agenda.\n\nEdited July 11, 2013 by Ellareth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812486","commentId":812486,"userName":"richsabre","timestamp":1373577870,"content":"i think the moment Earnur was lost in minas morgul....foolish though it was, the next king to come to either kingdom, north or south, had the right to rule both. the stewards were there for that reason and that reason only, to rule until the time came. remember that ultimatly, both kingdoms were decended from the same line...very far back.\n\n \n\ninfact that oath the stewards took was to 'hold rod and rule in the name of the king, until he shall return'\n\nrich\n\nEdited July 11, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812496","commentId":812496,"userName":"Khamul The Easterling","timestamp":1373579467,"content":"> have you read the Unfinished Tales? if not i think you would like it as it is filled with those types of 'backstories' similar to what you quoted\n> \n>  \n> \n>  \n> \n> rich\n> \n>  \n\nI do not since I do not own it.  I own the Hobbit and LOTR but not any of the others.  I've got by reading tons of Wikipedia.  Does sound very interesting though.  I should see if it's at a library.  Besides, it has Khamul in it :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] (only very short bit though) \n\nEdited July 11, 2013 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86182-quote-your-favourite-sentences-from-the-lotr/?do=findComment&comment=812513","commentId":812513,"userName":"richsabre","timestamp":1373581841,"content":">  \n> \n> > have you read the Unfinished Tales? if not i think you would like it as it is filled with those types of 'backstories' similar to what you quoted\n> > \n> >  \n> > \n> >  \n> > \n> > rich\n> > \n> >  \n> \n> I do not since I do not own it.  I own the Hobbit and LOTR but not any of the others.  I've got by reading tons of Wikipedia.  Does sound very interesting though.  I should see if it's at a library.  Besides, it has Khamul in it :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] (only very short bit though) \n> \n>  \n\ndo so, and the history series if you feel up to some heavier research :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]. my favourite is the meeting between gandalf and thorin in bree.\n\nrich\n\nEdited July 11, 2013 by richsabre"}]}