{"url":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/","title":"&quot;Saga mode&quot; for future packs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=812567","commentId":812567,"userName":"Gizlivadi","timestamp":1373588254,"content":"Hey, since there's many people posting ideas and suggestions for this game, I thought I'd post one that occurred to me some time ago.\n\n \n\nI think it would be awesome if they made some sort of \"saga packs\" that required another previous adventure pack(s) to be bought and that also required certain heroes or certain cards of a certain \"theme\" from a previous adventure pack, and that the scenario in this pack recreated exactly that story with those heroes and the cards whose lore fits in the story.\n \nFor example, how awesome it would be if they made a \"Battle of Dale\" saga pack that required Dain Ironfoot and Brand as heroes in the game (could be both in one deck or in separate decks), and that you could use a bunch of dwarven cards and men or dale related cards and play a scenario that told the story of the Battle of Dale and how dain and brand fought the orcs together and all that.\n \nI think this idea would be great and would also inmensely increase the replayability of past packs and cycles. This way, they could have recreated the scenarios from fotr such as watcher and redhorn gate with the story of that scene of the fotr. It would have been awesome and they wouldn't have to \"repeat\" it in the saga expansions. I think they could do this in the future to \"save\" them scenarios in future saga expansions, but they could obviously still do normal, \"unique\" adventure packs with their own story. What do you think? (I hope somebody at ffg is reading this lol)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=812578","commentId":812578,"userName":"richsabre","timestamp":1373589026,"content":"sounds an interesting idea. what would be in the pack? because it sounds that only really the quest cards would be included just like POD packs, so they wouldnt 'interfere' (sounds a bad word choice but you know what i mean) with the standard pack releases\n\nmy only two concerns here are\n\n1- it requires people to already have pack X, which isnt what an lcg is about. now this of course is dependant on whether the lcg format is true to the fact you can 'pick and mix'...i for one wouldnt like to go into ithillien without at least 75% of the packs behind me\n\n2- the quests dont allow for any customisation, hence i feel they actually have less playability than usual quests.\n\n \n\nother than that im all for packs that give us more challenges based off the stories and narratives from the books. i am keen to get my hands on anything that gives that 'nostalgia' feel that i mentioned in a previous post, which is of course sort of lost on the main packs\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=812587","commentId":812587,"userName":"Gizlivadi","timestamp":1373589559,"content":"I agree that goes against the \"essence\" of lcg's, and that they always try to appeal to their \"lowest common denominator\", which are people who only have the Core Set. But it mustn't always be like that. There are still lots of people who have many expansions and will buy more and it wouldn't hurt to make a little product just for them. \n\n \n\nIt could include quest cards and a special encounter set based on the story, and could also be played with another \"neutral\" encounter set that could be matched with the other.\n\nEdited July 12, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=812589","commentId":812589,"userName":"richsabre","timestamp":1373589860,"content":"mmm...the more i think about it, the more i think i like the idea....perhaps its the idea of extra packs for those who have them all :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nbut yes, i think if something like this ever happens, it would be POD packs for sure, that way those who only have a few packs dont feel like they 'have to' buy them to keep up, and those who follow the game more closely get more content\n\nrich\n\nEdited July 12, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=812593","commentId":812593,"userName":"Gizlivadi","timestamp":1373590147,"content":"Yeah, I guess this is basically what they're doing for this kind of scenarios. But for some reason I just cannot have myself to like POD packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=812776","commentId":812776,"userName":"richsabre","timestamp":1373633197,"content":"> Yeah, I guess this is basically what they're doing for this kind of scenarios. But for some reason I just cannot have myself to like POD packs.\n\ni am undecided about POD. I see their point in a games design, but i hope they dont over do that POD packs thing, as they take away from the real thing\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=816448","commentId":816448,"userName":"Hannibal_pjv","timestamp":1374108371,"content":"These sounds a lot like SW lcg Challenge Deck Scenarios. But who knows, maybe there will just extra adventure packs without player cards. But I would allso bought all of these too, so why not :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86204-saga-mode-for-future-packs/?do=findComment&comment=816454","commentId":816454,"userName":"Pharmboys2013","timestamp":1374108696,"content":"I'd buy them, for sure. I like the idea of thematic \"challenge\" quests with some perquisites"}]}