{"url":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/","title":"Dwarrowdelf cycle Favorites","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813277","commentId":813277,"userName":"Khamul The Easterling","timestamp":1373685370,"content":"What's your top 2 favorite Dwarrowdelf cycle quests (in order)?  Why?\n\n \n\nMine would be:\n\n1. Foundations of Stone - I like because it has 5 different quest stages and I like quests that are rather long and have many quest stages and are complex.  Favorite parts of the quest are stage 1b and 2b. \n\n \n\n2. The Watcher in the Water - It's a very relaxed quest and you always know what the deal is and what's happening.  The encounter deck cards aren't very bad at all but when you get a few tentacles in play in can be a but challenging.   \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813283","commentId":813283,"userName":"richsabre","timestamp":1373686691,"content":"oh this one is an easy one for me- certainly\n\n1.redhorn gate\n\n2.road to rivendell\n\n \n\ni really love the theme and story in both. i like the adventuring aspect as it really captures the feel of the fellowships trek through the mountains. road to rivendell is 2nd because of the annoying aspects of certain cards (you can guess which), but i still love the quests overall.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813299","commentId":813299,"userName":"Pharmboys2013","timestamp":1373690486,"content":"1. Foundations of Stone\n\n2. Redhorn Gate\n\n \n\nLoved the darrowdelf cycle as a whole, other than the long dark, i really enjoy re-playing all of the scenarios.  Aside from Shadow and Flame you can take anyone deck and go through the whole cycle and likely be successful yet the quests still feel totally different from each other "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813303","commentId":813303,"userName":"Glaurung","timestamp":1373691113,"content":"Waiting for Nightmare ones!!!! All will be amazing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813322","commentId":813322,"userName":"GrandSpleen","timestamp":1373696722,"content":"1) Watcher in the Water -- love the theme.  It's a straightforward quest and not so difficult, and it lets me use one of my favorite cards (Straight Shot, haha).\n\n2) Redhorn Gate.  Challenging the mountain is also a cool theme, and the gusts of winds near the top of Caradhras right as you get to quest card 3 often make for a dramatic ending."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813354","commentId":813354,"userName":"DevastazioneH88","timestamp":1373707783,"content":"1) Shadow and Flame - it's the scenario with the toughest enemy but it's constructed so well that if you play with a good deck you can do it, struggling maybe if the encounter deck plays tricks, but you can make it. I also like starting at 0 threat so I can play timely aid (in my opinion the second best secrecy card). I obviously like the fighting aspect of the scenario being a tactcis love guy, but I really enjoy the climatic story (which is the climatic end of the cycle). Really awsome, probably my absolute favourite (even if the steward's fear is pretty amazing as well).\n\n \n\n2) The Redhorn Gate - This scenario offers everything, high threat locations, decent enemies (not really tough but challenging if there are a few mountains in play), tricky treacheries...all in all is pretty balanced (except in the final stage where your 0 WP guys die). I love the story and how you have to deckbuild pretty well to make it work. The only aspect I don't like is the 5 VP you need to win that sometimes slow the game to a pretty boring level (but that's just once in a while)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813458","commentId":813458,"userName":"Alex6222","timestamp":1373732292,"content":"1. Foundations of Stone- it has always been in my top 5 quests and i like it because of the different challenges it can bring upon you. Very cool with the nameless things and the Lost and Alone card.\n\n \n\n2. The Redhorn Gate- i like it because of the theme and the art in this quest is simply amazing. I also like that you feel like an endless journey waiting for the location with VP to come up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813755","commentId":813755,"userName":"monkeyrama","timestamp":1373800227,"content":"1. Redhorn Gate - I guess for the theme, as others have mentioned, but also because I've always found it to have a good narrative feel to it, and slightly weaker decks can go in and still stand a chance.\n\n2. Foundations of Stone - I loved the interesting mechanics for this one, and it felt a like a nice difficulty. Multi-player it is really rather interesting too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813785","commentId":813785,"userName":"rekath16","timestamp":1373807852,"content":"1. Foundations of Stone - It's such an incredible fun to play a Multiplayer-Game, former Dain Ironfoot-synergies have no longer importance and make it much harder to beat them. It's so cool when the WP-deck gets the 4-encounter-quest card and the figher guy gets the 17-WP-quest-deck. The Sudden Pitfall is surely a candidat for the most hated card ever, Goblin Followers can destroy your strategy in one turn. I love it.\n\n \n\n2. The Redhorngate - Brrrr it's so cold there and you really feel it. In my personal difficulty rate it got a 8 due to the High-Threat-Locations, the strong enemies and the amount of WP needed. Maybe I love that scenario so much cause of the scene in the movie where the fellowship tries to beat the Caradras, which me impressed so much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813810","commentId":813810,"userName":"Khamul The Easterling","timestamp":1373812416,"content":"Interesting....Redhorn Gate is in everyone's list except for me.  I don't like how you have to have to build your deck around making sure 1 willpower heroes don't die. (Not to mention all your allies) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813823","commentId":813823,"userName":"richsabre","timestamp":1373813839,"content":"> Interesting....Redhorn Gate is in everyone's list except for me.  I don't like how you have to have to build your deck around making sure 1 willpower heroes don't die. (Not to mention all your allies) \n\nfaramir is key here. or just make sure you dont have any 1 willpower allies commited to the quest\n\nyou can also use trackers and asfaloth to put progress on caradhras so its just under being explore (so it doesnt come back) then clear it with asfaloth next turn\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813930","commentId":813930,"userName":"Khamul The Easterling","timestamp":1373828838,"content":">  \n> \n> > Interesting....Redhorn Gate is in everyone's list except for me.  I don't like how you have to have to build your deck around making sure 1 willpower heroes don't die. (Not to mention all your allies) \n> \n> faramir is key here. or just make sure you dont have any 1 willpower allies commited to the quest\n> \n> you can also use trackers and asfaloth to put progress on caradhras so its just under being explore (so it doesnt come back) then clear it with asfaloth next turn\n> \n> rich\n> \n>  \n\nRight.  But you have to build a deck that has all that stuff, which is no problem, but if your current deck does not have those key cards, your in trouble so it limits me to only being able to play it when I have a deck with those key cards and lots of the time, I have heroes with not enough will power or not Faramir or something so Redhorn is one of those quests were I can only sometimes play that quest making it not my favorite.  Plus, it is quite annoying when those victory point locations go away.  And I actually don't like the freezing cold card.  I think its more annoying than challenging and fun.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813937","commentId":813937,"userName":"richsabre","timestamp":1373829227,"content":"well thats true- but you can still quest without the 1 willpower allies and heros. i think most decks will have at least a few key questers that will survive. longbeard mapmaker can be increased willpower, or get protector of lorien on and thats a +3 willpower there. or other attatchments like the dunedain one, sword that was broken on strider, dains increase and so on\n\n \n\ni realise that these still need to be built in a way, but i still think most decks will already have some sort of way to deal with caradhras, even if it is in the staging area for its full 9 progress points.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=813944","commentId":813944,"userName":"Khamul The Easterling","timestamp":1373829853,"content":"Yeah, well the way I play the game is I pick a quest and I play it like 3-5 times and then put it away and then pick another quest and play it 3-5 times and keep going until i get through all the quests and then start over again (changing player decks all the meanwhile) Redhorn gate is kinda one of the last ones I haven't done yet while playing my little do each quest like 4 times an moving on to another thing so its been a while since I played it.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86255-dwarrowdelf-cycle-favorites/?do=findComment&comment=815897","commentId":815897,"userName":"player1761766","timestamp":1374052543,"content":"Foundations of Stone. I love those Nameless Things! \n\n \n\nMy second choice is a difficult one, because I only kinda-like some (Redhorn Gate, Long Dark) and hate others (Shadow and Flame, Watcher in the Water), remaining ambivalent about Road to Rivendell. I think, as I have to pick one, it'll be Long Dark. It's a bit like Dead Marshes, but in Moria, and with more orcs and goblins. Foundations of Stone is the real stand-out pack for me, the rest are all on much lower rungs. "}]}