{"url":"https://community.fantasyflightgames.com/topic/86301-newbie-with-a-few-easy-questions/","title":"Newbie With A Few Easy Questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86301-newbie-with-a-few-easy-questions/?do=findComment&comment=813658","commentId":813658,"userName":"faramirrocks","timestamp":1373773751,"content":"1) Can I Use \"Stand and Fight\" to bring Gandalf back from the discard pile?\n\n2) How does the \"Wandering Took\" work in a solo game?\n\n3) So I killed the giant spider U-Spawn before getting to the final quest card that required that I kill it.  It went to the discard pile, which I had to shuffle by the time I picked up the final quest card requiring its' death.  Did I still win?\n\n \n\nThis game truly rocks!\n\n \n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86301-newbie-with-a-few-easy-questions/?do=findComment&comment=813687","commentId":813687,"userName":"mr.thomasschmidt","timestamp":1373777602,"content":"Hi. Welcome to this fantastic game and no less fantastic forum :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] to answer your questions.\n\n1. Unfortunately not. That's the short answer.\n\nThe long on is: This has been up many times and almost everybody has been in doubt of this. So in the end someone wrote and got an answer from Nate, the maker of the game, and he explained the rules regarding this card. The problem is that it is formulated a little cryptic. Cause the last words in the () that says can belong to any spher, is what it's all about. This is supposed to mean that the ally MUST belong to a spher and Gandalf is neutral. Some has arguments that the neutral might be spher on its own but this I believe was turned down by Nate.\n\n2. The wandering took's effect can't be used in solo play unless you play double handed. That is, playing a two player game where you control two decks. He has to be switched from on player to another befor his effect is triggered. And if you play with two decks you take the role as two players thus being able to switch him back and forth.\n\n3. I'm a little uncertain on this but I'm pretty sure you don't have to fight it again unless you are unlocked enough to get it in the staging area a second time.\n\nMy suggestion to you is to go to boardgamegeek.com and search Lord of the rings. Pick this game and go down to files.\n\nSomewhere amongst these sites is a link to an unofficial FAQ & CARDLIST. This has almost all the answers you'll ever have for every card in the game. The newest is version 7.1\n\nHappy gaming :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86301-newbie-with-a-few-easy-questions/?do=findComment&comment=813721","commentId":813721,"userName":"booored","timestamp":1373788688,"content":"> 1) Can I Use \"Stand and Fight\" to bring Gandalf back from the discard pile?\n> \n> 2) How does the \"Wandering Took\" work in a solo game?\n> \n> 3) So I killed the giant spider U-Spawn before getting to the final quest card that required that I kill it.  It went to the discard pile, which I had to shuffle by the time I picked up the final quest card requiring its' death.  Did I still win?\n> \n>  \n> \n> This game truly rocks!\n> \n>  \n> \n> Thanks.\n\n \n\n1) No\n\n2) It is a 2 cost Spirit ally with 1 will 1 attack defence and 2 life...  this is pretty good in its own right.. but the card text has no meaning in solo.. there are many many cards like this.\n\n3) There are 2 quest cards, one requires you to search for spider and one HAS to be Uspawn. In this case then no.. you need to pull it again form the yard or the deck into the table. BUT if you are playing the other quest end where you just need to quest for a while, if you have killed it already, or just never draw it you still win, as the win condition is just that it can not be in play. there is no tutor for it.\n\n \n\nMake sure you have a look at the FAQ, it has many fixes and corrections.. [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4]"}]}