{"url":"https://community.fantasyflightgames.com/topic/86489-long-dark/","title":"Long Dark","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=815719","commentId":815719,"userName":"Khamul The Easterling","timestamp":1374029155,"content":"Hey guys, this quest has a very small amount of comments and reviews anywhere online and so I thought I'd bring it up so people can answer:\n\n \n\n1. How often do you play this quest? Hardly ever? Quite often? Just below or above average?\n\n \n\n2. What do you really like about it?\n\n \n\n3. What do you hate about it?\n\n \n\n4. What quest would you compare it to in difficulty for solo play?\n\n \n\n5. How about for 3-4 players?\n\n \n\n6. What are you final comments about this quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=815746","commentId":815746,"userName":"Pharmboys2013","timestamp":1374031887,"content":"1.  Hardly ever, as mentioned in a different threat i can probably count the number of times i've played this on one hand\n\n \n\n2. Goblin Sneak and  Goblin Warlord have really fantastic art design\n\n \n\n3. the \"lost\" mechanic (is that even what its called? dont remember) is just such a strain on gameplay since most player deck try to execute as much card draw to get things running as possible.  Plus nothing is quite as disheartening as pitching several cards from your hand then not even passing the test.\n\n \n\n4. not sure like i said i need to replay it soon\n\n \n\n5. see 4.\n\n \n\n6.  it comes across as a quest with a poor design choice in an otherwise fantastic cycle, will try it again soon to see if it still deserves my criticisms"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=815770","commentId":815770,"userName":"Glaurung","timestamp":1374034500,"content":"This is really good quest but a problem is when you play solo or even 2 player is too easy most of the time since the encounter deck just cannot show his power and combos by revealed ony 1 or 2 cards per round. Everything is change in 3 4 player game.\n\n \n\nSuddenly easy quest becoming really hard ans interesting. Lot of cards with lost effect on the table and if you losing at least one time lost effect, this can cost you a game.\n\n \n\nReally cool quest but only in the case of 3 players up.\n\n \n\nFor solo most of the time is boring and easy. Nightmare will change it for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=815860","commentId":815860,"userName":"player1761766","timestamp":1374049982,"content":"I really liked The Long Dark! I much prefer a quest-quest, rather than the endless parade of goblins and orcs to kill. This was the first Dwarrowdelf pack I could complete on my first try, as well, so I really have fond memories for it because of that  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nI love the locate tests and the lost mechanics, it makes for a really thematic quest. The best card is probably Vast and Intricate, which made me groan with a kind of exasperated delight when I turned it over. I love a good card that can make bad stuff happen thematically! I also believe this was the first pack that had dwarfy treasures in the encounter deck? Well, a treasure. Definitely makes the game more interesting. \n\n \n\nIt's a lot like Hills of Emyn Muil, then, which is my favourite quest I think, though I have only played this one once, according to my bgg stats. I've been saving it for when I have the energy to have a campaign through the mines, but because Shadow and Flame is such a silly quest, I always feel like passing it over. \n\n \n\nIn short, I really like it. It makes you feel like you're really lost in the mines, so it gets the thematic thumbs-up from me! Just a shame there are still so many orcs and goblins to get in the way. Easy mode should have got rid of some of them, rather than the more interesting cards!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=815915","commentId":815915,"userName":"richsabre","timestamp":1374057564,"content":"i agree with spalanzani, its a nice quest. i find it rather too easy solo though. im not sure i have ever lost it solo, and not much multiplayer\n\n \n\n1. i play this game an embarrasing amount so i wont post numbers here, but i probably play this pack 4th mostly out of the dwarrowdelf packs.\n\n \n\n2.it was easy during the time it came out and for a solo player with tough quests that was good. actually the whole cycle was about right for me. every single quest was not too hard or too difficult in the cycle. great art of course  (the mine in the blue shade is amazing) and an interesting take on the story\n\n \n\n3.the lost mechanic isnt hard enough in solo play. its rare you can say that in the early games but it is probably the 3rd easiest quest to win\n\n \n\n4.probably emyn muil mixed with a bit of passage through mirkwood, but harder than them both by a little\n\n \n\n5.cant remember now, but i seem to remember it still being one of the easiest. as i say the lost mechanic just isnt much of a threat to the game\n\n \n\n6.overall this quest probably appeals to those who want an easier quest to play through who have a more limited card pool and want of less enemies.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=816462","commentId":816462,"userName":"Pharmboys2013","timestamp":1374110646,"content":"Just played this again for the first time in a long time, wasn't as bad as I remembered it haha. Won quite easily with a good score of 83. Grant it I did use my Mirlonde, Glorfinfel, and Denethor deck which is really good against this kind of quest but regardless I'll take it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=816485","commentId":816485,"userName":"booored","timestamp":1374114215,"content":"> 1. How often do you play this quest? Hardly ever? Quite often? Just below or above average?\n\n \n\nNow and then. I tend to play most of the quest pretty regularly. I have a few favs and fast track new quests, but generally I randomize my quest choice or play entire cycles in order.\n\n \n\n> 2. What do you really like about it?\n\n \n\nWell I think the Lost Test is pretty cool. Reminds me of a more brutal Escape Test. I also think it is very well themed and has a good abstract relation to wandering around in the dark. Game time in cards games is traditionally called \"the clock\". The time it will take you to win vs your opponent. While there is no clock in this game apart form a few quests like Rhasgobel, clocks in other games are directly linked to card draw and player curves. So discarding cards is a way of simulating loosing time. This is nto only clever but also a nod to old school tcg players and hits a geek nerve in me.\n\n \n\nPlus Stray Gobin is a fantastic card. The game needs, no requires more of these kind of dynamic stats enemies that can scale perfectly to different player counts. One of my favs from Khaz.\n\n \n\nffg_stray-goblin-kd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_stray-goblin-kd.jpg]\n\nffg_goblin-sneak-tld.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_goblin-sneak-tld.jpg]ffg_goblin-warlord-tld.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_goblin-warlord-tld.jpg]\n\n \n\nIt also has some of my fav goblin art in the game so far, but then I am a warhammer (table top not card game) fan and the art reminds me of warhammer.\n\n \n\n \n\n> 3. What do you hate about it?\n\n \n\nThis quest is badly designed as a all rounder. It is a 4 player quest, 3 is ok... but any other mode it is pretty trivial. This is one of those quest I am very very very keen for the Nightmare cards. To bring this cool quest into solo and 2 player mode.\n\n \n\n \n\n> 4. What quest would you compare it to in difficulty for solo play?\n\n \n\nHunt for Golum I guess. Hills isn't even a quest it is just a way to test your draw timings :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I think for solo it is one of the easiest for sure.\n\n \n\n> 5. How about for 3-4 players?\n\n \n\nNot much ti add to what I said in point 3. 3-4 players this quest shines. 4 the most. There is a lot of quests in this game, and a quest not being able to scale correctly isn't really an issue when you have so many to choose from. I like that this is a really fun interesting quest that is challenging in 4 players.\n\n \n\n \n\n> 6. What are you final comments about this quest?\n\n \n\nreally good quest and one I go to on those rare occasions I have a 4 player deck constructed and friends around to play it that do not want to play way better 4 player games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=816522","commentId":816522,"userName":"Khamul The Easterling","timestamp":1374118269,"content":">  \n> \n>  \n> \n> Hills isn't even a quest it is just a way to test your draw timings :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\nExactly :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I wonder what they will do for nightmare mode to make it harder and how much harder it will be.  \n\n \n\nThanks everyone for the answers.  Going to play my first actual 3 player game (with three humans) in a couple days. Can't wait.  We have time for 3 games so we're going to play Long Dark, Foundations of Stone, and Return to Mirkwood.  Do you guys agree that those are prob the best quests to play 3 player when you play solo 95% of the time?  If not what other quests would be really awesome instead?  Have everything except for Hobbit 2, MaO, Laketown, and Amon Din"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=816539","commentId":816539,"userName":"Glaurung","timestamp":1374121297,"content":"Boored is right. Im not so good english typer so he say what is in my mind about LD.\n\nYes sure nightmare mode for LD will be amazing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=818194","commentId":818194,"userName":"Glaurung","timestamp":1374348451,"content":">  \n> \n> >  \n> > \n> >  \n> > \n> > Hills isn't even a quest it is just a way to test your draw timings :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> > \n> >  \n> \n> Exactly :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  I wonder what they will do for nightmare mode to make it harder and how much harder it will be.  \n> \n>  \n> \n> Thanks everyone for the answers.  Going to play my first actual 3 player game (with three humans) in a couple days. Can't wait.  We have time for 3 games so we're going to play Long Dark, Foundations of Stone, and Return to Mirkwood.  Do you guys agree that those are prob the best quests to play 3 player when you play solo 95% of the time?  If not what other quests would be really awesome instead?  Have everything except for Hobbit 2, MaO, Laketown, and Amon Din\n> \n>  \n\nMao is amazing you should get it. For 3 players Long dark, Dol-Guldor, Flight from Moria are really good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=819117","commentId":819117,"userName":"jrd","timestamp":1374509004,"content":"The Long Dark has a good encounter deck but rather bland quest cards. Also the suggested DL of 7 seems rather high.\n\n \n\nI have produced a couple of variant quests which use The Long Dark cards which I suggest you try if you want to get a bit more use from your Long Dard cards - take a look at http://jrd.eu5.org/lotr_cardgame/lotr_cardgame.html [http://jrd.eu5.org/lotr_cardgame/lotr_cardgame.html]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=819387","commentId":819387,"userName":"Khamul The Easterling","timestamp":1374528772,"content":"> I have produced a couple of variant quests which use The Long Dark cards which I suggest you try if you want to get a bit more use from your Long Dard cards - take a look at http://jrd.eu5.org/lotr_cardgame/lotr_cardgame.html [http://jrd.eu5.org/lotr_cardgame/lotr_cardgame.html]\n\nAnybody else tried this new quest? jrd, could I have some more comments on this quest of yours?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=819704","commentId":819704,"userName":"jrd","timestamp":1374563211,"content":">  \n> \n> > I have produced a couple of variant quests which use The Long Dark cards which I suggest you try if you want to get a bit more use from your Long Dard cards - take a look at http://jrd.eu5.org/lotr_cardgame/lotr_cardgame.html [http://jrd.eu5.org/lotr_cardgame/lotr_cardgame.html]\n> \n> Anybody else tried this new quest? jrd, could I have some more comments on this quest of yours?\n> \n>  \n\nQuest #1 uses the first two stages of The Long Dark with the last 3 stages of Foundations of Stone to produce a long and challenging quest. There is just a new \"stage 0\" card for this quest.\n\nQuest #2 - \"You have decided to embark upon a difficult and dangerous quest to search the lowest levels of Moria for Durin’s long-lost axe, helm and greaves. Ignoring the doubters who say your task is impossible, you have vowed not to return until you have reclaimed Durin’s legacy.\"\n\nThis quest uses The Long Dark and Foundations of Stone encounter cards, together with new quest cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=819919","commentId":819919,"userName":"Khamul The Easterling","timestamp":1374590220,"content":"Well yeah but I mean what do you think of them when you played them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86489-long-dark/?do=findComment&comment=819937","commentId":819937,"userName":"jrd","timestamp":1374591486,"content":"> Well yeah but I mean what do you think of them when you played them?\n\nI think Quest #1 is really great, much better than The Long Dark and a bit better (and longer) than Foundations of Stone.\n\nQuest #2 is OK, but not one of my best. It is often a long, tough slog, which I'm sometimes in the mood for, sometimes not.\n\nI like the way both quests make you choose between playing cards and keeping them in your hand to use in locate tests.\n\n \n\nBit, I'm the author, so I'm biased :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}