{"url":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/","title":"Does &quot;The Black Riders&quot; need cards from earlier expansions?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/?do=findComment&comment=816592","commentId":816592,"userName":"Nick Demus","timestamp":1374131676,"content":"I´m sorry if that question has been asked before, but I couldn´t find any answer to this...\n\n \n\nI´m only a few months into playing and don´t have that many cards yet (Core Set + Mirkwood I + II). I´m wondering whether \"The Black Riders\" is a fresh start (playable with the Core Set only) or should I have all previous cards to have a chance against the scenarios.\n\n \n\nThere are many great ideas lurking in that expansion, and I want to buy and play this one as soon as possible, so...?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/?do=findComment&comment=816593","commentId":816593,"userName":"booored","timestamp":1374131758,"content":"Not technically but in reality.. yes. To have a good player experience the designers are expecting you to have access to a larger card pool than just 1 copy of core and the saga pack. You could probably get by if you really wanted but I think you would struggle. Though there is nothing stopping you trying. If you are concerned about this I would get the core+the saga expansions and then if you need more you can go from there. If the quests are to hard you can always remove the cards for \"easy\" mode as well.\n\n \n\nStill I am pretty sure most would agree that having aces to a larger card pool will provide a much more enjoyably deck building and game player experience.\n\nEdited July 18, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/?do=findComment&comment=816622","commentId":816622,"userName":"scwont","timestamp":1374137435,"content":"> I´m sorry if that question has been asked before, but I couldn´t find any answer to this...\n> \n>  \n> \n> I´m only a few months into playing and don´t have that many cards yet (Core Set + Mirkwood I + II). I´m wondering whether \"The Black Riders\" is a fresh start (playable with the Core Set only) or should I have all previous cards to have a chance against the scenarios.\n> \n>  \n> \n> There are many great ideas lurking in that expansion, and I want to buy and play this one as soon as possible, so...?\n\nIt's hard to answer your question definitively since Black Riders hasn't been released yet, so we don't know what the scenarios are actually like in terms of difficulty.\n\n \n\nMy guess is yes, it should be possible to play (and enjoy) with just the Core set + Black Riders, since:\n\n \n\n1. This is the first expansion with Easy mode \"built in\" (at least, incorporated into the printed cards) in advance.\n\n2. The saga expansions in particular are specifically playtested to make sure they work well together with just a Core set.  In fact there's an interview, just published today, where Caleb Grace (lead designer for the game) talks about this very thing: http://talesfromthecards.wordpress.com/2013/07/17/interview-caleb-grace-lead-developer/ [http://talesfromthecards.wordpress.com/2013/07/17/interview-caleb-grace-lead-developer/]\n\nEdited July 18, 2013 by scwont"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/?do=findComment&comment=816641","commentId":816641,"userName":"chrsjxn","timestamp":1374140441,"content":"You could build solid decks just using the Core set and the cards from the Hobbit expansions, so it should be about the same this time around.\n\n \n\nEspecially since all the heroes in the first box are hobbits, and all of the spoiled cards so far have really good hobbit synergy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/?do=findComment&comment=816670","commentId":816670,"userName":"Nick Demus","timestamp":1374145627,"content":"Wow, that sounds great! Thank you all for the quick responses. Now I´m really looking forward to get this box. :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/?do=findComment&comment=816684","commentId":816684,"userName":"Glaurung","timestamp":1374147909,"content":"Actually is really interesting format to play Core+Hobbit or Core +Black rider and play as a Compaign mode.\n\n \n\nSo in hobbits set you will use then Bilbo events then since other powerful player cards from other pack is not allowed.\n\n \n\n \n\n  That make game more challenge and interesting!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86571-does-the-black-riders-need-cards-from-earlier-expansions/?do=findComment&comment=817360","commentId":817360,"userName":"Dain Ironfoot","timestamp":1374214091,"content":"> To have a good player experience the designers are expecting you to have access to a larger card pool than just 1 copy of core and the saga pack.\n\n \n\nThis actually isn't entirely accurate. To quote the lead designer of the game:\n\n \n\n\"I developed this practice during my first assignment:The Hobbit: Over Hill and Under Hill Saga Expansion. I figured that the Saga Expansions might attract new players to the game, and if I was an interested customer looking at the back of the box, I would see that the core set was required to play. That would mean that a minimum investment of seventy dollars was required for me to play the first Hobbit expansion. If that was my $70, I would want a great experience right out of the box. So I wanted to be absolutely sure that a new player could build a fun deck and have a really great time with only the cards in those two products. That lead to me to play-test the scenarios in that box with both my established player decks and decks made with only the player cards from the Core Set and The Hobbit: Over Hill and Under Hill. And now I do it for each new set as well.\"\n\nEdited July 19, 2013 by Dain Ironfoot"}]}