{"url":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/","title":"Burden Antidotes - Reviving Little Used Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=817491","commentId":817491,"userName":"Pacificus","timestamp":1374238910,"content":"I am going to go out on a limb and predict that a Burden called Morgul Wound will debut with Black Riders or very soon thereafter.  This got me thinking about how such a card would be be countered and it occurred to me that one very cool way would be to target a thematically appropriate but otherwise weak existing card.  In the case of Morgul Wound it would include text along the lines of \"May be removed from attached character by play of Lore of Imladris\"  Another example might be a Burden called Shadow of Mordor that say adds 1 Threat to all locations and which would be countered by Power in the Earth. Are there other cards that deserve to be revived?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=817501","commentId":817501,"userName":"lleimmoen","timestamp":1374239778,"content":"Nothing to do with Burdens, only with \"under-used\" cards. I've always liked the intriguing Son of Arnor. But I think it is generally not highly regarded. The combo with Sneak Attack or Stand and Fight was there since the core set. Then Vilya brought a new trick, but still, though I like the card a lot, I don't think I've played it in more than 1/10 of the decks I've built. But now (or a little later) when Sam is out, I think Son of Arnor will gain a new dimension. It is the same sphere and can bring the extra enemy from the staging area. It also combos nicely with Peace and Thought. Having Pippin and Sam together (their abilities contemplating each other), one can exhaust them both to draw five cards, then play Son of Arnor to lower the threat in the staging area, ready Sam, draw another card and boost the questing. I'm definitely going to revive that one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=817655","commentId":817655,"userName":"Pacificus","timestamp":1374254484,"content":"Son of Arnor is a good example of a cool sounding (and looking) card that never arrived.  With the new Hobbits it certainly seems like it might see a revival without even needing to be singled out as a Burden antidote.  :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=817663","commentId":817663,"userName":"richsabre","timestamp":1374255072,"content":"one of my favourite cards has always been love of tales...but to this day i cannot find a use other than its beauty to put it into a deck. i would love to see some cards that combo well with it. its also themeatic with the black rider pack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=818095","commentId":818095,"userName":"Pacificus","timestamp":1374329552,"content":"I could easily see Love of Tales as one of perhaps a couple different antidotes to a Burden that reduces Willpower to reflect how the quest gradually weighed down the Fellowship and then Frodo/Sam. Perhaps call it, well, \"Heavy Burden\"  :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=818939","commentId":818939,"userName":"Volstruis","timestamp":1374485370,"content":"Love of Tales is a fantastic card. Mono green, card draw, splash songs, there's even a developer deck that makes excellent use of it in a very similar way. Song of earendil even gives you a card and up to 2 resources for free. Durin's song makes Bifur a questing champion in that deck and gives you extra resources to boot.\n\n \n\nThese forums are awash with people bashing great mechanics because they're not quite as buff as Elrond/Vilya, Dainspam and Outlandery. \n\n \n\nI promise you 'love of tales' does not need to be 'saved' ... \n\nEdited July 22, 2013 by Volstruis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=818949","commentId":818949,"userName":"richsabre","timestamp":1374488095,"content":"> Love of Tales is a fantastic card. Mono green, card draw, splash songs, there's even a developer deck that makes excellent use of it in a very similar way. Song of earendil even gives you a card and up to 2 resources for free. Durin's song makes Bifur a questing champion in that deck and gives you extra resources to boot.\n> \n>  \n> \n> These forums are awash with people bashing great mechanics because they're not quite as buff as Elrond/Vilya, Dainspam and Outlandery. \n> \n>  \n> \n> I promise you 'love of tales' does not need to be 'saved' ... \n\nEDIT....i talked a load of rubbish that wasnt even relevant\n\n \n\nbasically my point was (though i completely got mixed up with my cards) is that love of tales takes rather too much setting up....especially in a mono lore deck (which i have tried it in as you point out). the problem with putting songs in a mono deck is that you need to put the respective spheres in to get use of those songs (otherwise they are just a 'add 1 resource to heroes pool' type card...which isnt particularly effective given how much this takes to set up), and this waters down the deck...this watering down is the worst thing you can do to a mono sphere deck.\n\n \n\nalso you are more likely to draw song cards before the love of tales, which you can of course only put 3 of in any deck. so that leaves you with waiting with them in your hand which is a waste of putting in someone like master of the forge which takes up even more deck space...though this isnt much of a problem in mono lore given he is lore anyways, and an amazing card.\n\n \n\nso, my point is that i wasnt bashing love of tales- its a wonderful card, one of my favourites to play in a theme deck, however this thread is about giving old cards new life, and my point still stands, love of tales could use a bit of this, as i dont think it has realised its full potential\n\nrich\n\nEdited July 22, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=818985","commentId":818985,"userName":"Volstruis","timestamp":1374494977,"content":"Sorry dude, my mood this morning was not ideal! I totally get what you mean. I think Love of Tales relies on pretty brutal card-draw, so starting with heroes like beravor, bilbo and bifur. Mithrandir's advice, those craftsmen (who fetch attachments) etc. Once you set up though, those songs are like little drops of heaven.\n\n \n\nIt is a very very specific build though, in that regard I totally agree. In this instance you might often be forced to play those songs to get your colours out before you can tales anyway.\n\n \n\nI think my post may have a lot to do with general anti-secrecy sentiment I see, and in general people wailing on really great cards that IMO were built with very specific builds in mind (like the one above) but can't just be slapped into any build like Sneak Attacking Gandalfs.\n\n \n\nApologies for the rant :$\n\nEdited July 22, 2013 by Volstruis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=818994","commentId":818994,"userName":"richsabre","timestamp":1374496826,"content":"hey, no problem :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] . its good to see the lesser used cards getting some love\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86655-burden-antidotes-reviving-little-used-cards/?do=findComment&comment=823446","commentId":823446,"userName":"Rubinon","timestamp":1374869231,"content":"As much as I am in favor of reviving cards that collect dust in the binder, I'm against making them silver buillets (or, as you called it. antidotes) against specific other cards. There was a lot of that in the Decipher SW-CCG (one interrupt that canceled another interrupt), and it never sat well with me. I much prefer the things you said about the son of arnor: How the mechanics of a new card gave an old card a much needed boost."}]}