{"url":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/","title":"Is there really going to be six saga boxes for LotR?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817459","commentId":817459,"userName":"lleimmoen","timestamp":1374235612,"content":"It seems some of you are taking it as a certainty there will be six saga boxes? What do you base the assumption on? Is there a visible proof in one of those campaign logs they mentioned?\n\n \n\nIt would be great to have that many, and it would make sense, since there are six books in the LotR novel.\n\n \n\nNow though, creating 24 heroes can be tricky, if they are going to be based on the books only. Certainly manageable, but only with many duplicates of those we've got already.\n\n \n\nIf you think about it, in a way the game has only scratched the surface in terms of development of most of the main factions; however, we've already seen a vast majority of the most important characters. It seems obvious we will see many, probably most, if not all, at least twice throughout the game (hoping the game will indeed continue through all the six saga boxes and parallel cycles).\n\n \n\nA side question, how many cycles will we have seen before the final saga box is released? I'm torn between two or three (after AtS, of course). Even if you \"only\" get two more cycles before the saga has finished, it will be 16 more heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817547","commentId":817547,"userName":"Pharmboys2013","timestamp":1374243439,"content":"While we have not been told specifically; there is some pretty strong points that would say we will receive 6 boxes\n\n1. The hobbit was broken up into saga expansions starting the trend\n\n2. The quest log which was discussed in the campaign mode article has 18 open quest spaces in it (6 boxes x 3 quests = 18)\n\n3. The black riders box's last quest is the flight to the ford which is literally the last chapter of \"book\" one in the fellowship; hard not to imagine each box will also follow this design\n\nI don't mind duplicates of our heroes but it will be nicer once more traits are properly fleshed out. Perhaps it's because most of my prior card playing experience has also revolved around licensed products where practically every expansion brought a new version of every character that I'm numb to the prospect of getting duplicates or even triplicates.\n\nI would say we get 2 more cycles before the final saga expansion. It seems like we get 1 cycle per year (although AtS's delays helped this). Purely a guess but I'm figuring we maybe get a saga expansion 1 every 4 months or so"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817625","commentId":817625,"userName":"lleimmoen","timestamp":1374251035,"content":"Thanks for the response. Great points overall.\n\n \n\nI am quite convinced, there will be six boxes. It will be interesting how this is done however, since Frodo seems bound to be the central \"additional\" hero throughout the saga, yet he and his story line does not appear in two of the six books of the Lord of the Rings. How will they do the quests of the \"sub-plots\"? I have almost no idea. I was initially thinking quests like the Battle of Helm's Deep or Pelennor Fields will be done in PoD, like Lake-town, but now I think (and hope) they shouldn't. It may well be that a quest will have parallel features like in Riddles in the Dark, with Frodo struggling through Dead Marshes, Ithilien or Mordor whilst other heroes fight elsewhere. And we can still get Assault on Lórien or the Battle of Dale as PoD.\n\n \n\nI am not fond of duplicates, I was very happy to see the second Glorfindel but I still can't get why we're getting two Pippins in such a short time, especially when Gondor is crying for help. But with 40+ heroes coming over the next two years or so (I think a deluxe plus a cycle per year is a fair trade, especially when two saga boxes also arrive that year), there will have to be plenty of duplicates throughout."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817643","commentId":817643,"userName":"Pharmboys2013","timestamp":1374252709,"content":"someone said this in another topic but i think its a brilliant idea to have Gandalf as the alternative thematic hero (with his own unique sphere) for the boxes not featuring Frodo.  This works in regards to the books to since each book after the fellowship breaks is exclusive between what the remaining fellowship is doing and what frodo and sam are doing (except for book 6 which includes a lot of resolution). For example the break down for the saga expansions could be this:\n\n \n\nBook I: Black Riders - unique hero: Frodo\n\n \n\nBook II: Fellowship - unique hero: Frodo (Gandalf could maybe go here although it would not be as fitting given his peril in Moria)\n\nBook III: Rohan/Helms Deep/Isengard - unique hero: Gandalf\n\n \n\nBook IV: Dead Marshes/Ithilien/Shelob - unique hero: Frodo\n\n \n\nBook: V: Siege of Minas Tirith/Pelennor Fields/Black Gate - unique hero: Gandalf\n\n \n\nBook VI: Tower of Cirith Ungol/Mount Doom/??? - unique hero: Frodo\n\n \n\nGandalf would always be in control by the first player have a mithrandir or Istari sphere or something like that and serve the same purpose as bilbo did and frodo will have in the saga expansions.  it doesn't severally limit deck building options either as there is obviously no current Gandalf hero (nor do i think they would make one unless it was in this fashion)\n\nEdited July 19, 2013 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817669","commentId":817669,"userName":"Samwise Gamgee","timestamp":1374255878,"content":"I also thought that Gandalf could be the new hero, but, thematically, I am not sure it makes sense for the game to be over Gandalf dies. Maybe Aragorn is more appropriate, but still not the same quest ending theme as Frodo or Bilbo's demise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817679","commentId":817679,"userName":"Pharmboys2013","timestamp":1374256817,"content":"Aragorn would be a decent substitution as well, but it ruins my stern prediction of him being a hero in the next box! haha.  \n\n \n\nAlso if Aragorn was the unique hero, that might mean if we see Anduril it would be either a boon or attachment that could only be played with aragorn's unique resources...which would be a total bummer for those wanting to use the legendary sword in other quests"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817708","commentId":817708,"userName":"lleimmoen","timestamp":1374260266,"content":"These are good ideas but the Burdens (which are permanent for the whole campaign) specifically mention Ring-bearer, right? I don't think neither Aragorn nor Gandalf can pass as such (though Gandalf was, but of a very different Ring).\n\n \n\nI have a feeling Frodo will be consistent throughout the whole campaign.\n\nEdited July 19, 2013 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817721","commentId":817721,"userName":"richsabre","timestamp":1374261091,"content":"will the burdens not just be specific to the hero? so if once the breaking occurs and so on, frodo gets his burdens and boons from black rider and saga 2, and then we have 2 subclasses of burdens\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817732","commentId":817732,"userName":"Cunir","timestamp":1374262031,"content":"i think it will be great if the ring can be passed to other heroes, temporarily making them the ring bearer. maybe they could allow us to do it through an event card. of course there would have to be big drawbacks to doing it. but imagine if we could pass the ring to someone like boromir, that would be well cool, and in keeping with the story too (sort of). they could give him a willpower or attack boost, in return for a big threat rise each round, or something like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817739","commentId":817739,"userName":"Samwise Gamgee","timestamp":1374262798,"content":"In keeping with titles, they could use a boon title card that adds ring-bearer and some kind of transfer mechanic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817740","commentId":817740,"userName":"richsabre","timestamp":1374262947,"content":"> if we could pass the ring to someone like boromir, that would be well cool, and in keeping with the story too (sort of). they could give him a willpower or attack boost, in return for a big threat rise each round, or something like that.\n\ni think the risk of doing that would have to be shown to be massive....im not sure what the threat increase would have to be!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817770","commentId":817770,"userName":"Mr Coffee","timestamp":1374266042,"content":"Agreed.  As much as I have been open to FFG needing to take certain \"liberties\" with the core of the storyline for purposes of telling new stories in the game (eg, creating new characters, etc), I would have a pretty strong reaction to changing something THAT central to the heart of the Ring Cycles story... If they had anyone other than the known ring-bearers (Bilbo, Frodo, Sam, etc), I think that would be a bit beyond what I would like to see..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817833","commentId":817833,"userName":"SiCK_Boy","timestamp":1374274430,"content":"Regarding the number of heroes, it doesn't say anywhere that each Saga box has to bring 4 new heroes. Khazad-Dum only included 2 heroes, if I remember correctly, so they could slow down the pace of printing new heroes in subsequent big boxes and saga expansions.\n\n \n\nI also support the theory of 6 boxes with 3 quests each, aligned on the \"books\" making up The Lord of the Rings. For the books where Frodo is not involved, they may just decide to change the concept and not even use a token mandatory hero.\n\n \n\nI am doubtful concerning Gandalf as, based on the 2 versions in printing, he would have to be pretty powerful. Having the players getting a hero that strong would require the quest to be much more difficult than a normal quest; I'm not sure it would work well with the idea of the saga expansions being enjoyable only with a single Core set...\n\n \n\nMaybe they could make it so that the players are forced to use certain heroes during these scenarios (ex: must use either Aragorn, Gimli or Legloas during the 3 hunters quest; must use Merry or Pippin during the attack on isengard scenario, etc.) instead of giving an \"extra\" one... but then, with the new rules established for dead heroes during the saga, it could lead to some paradoxes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817855","commentId":817855,"userName":"Gizlivadi","timestamp":1374277637,"content":">  For the books where Frodo is not involved, they may just decide to change the concept and not even use a token mandatory hero.\n> \n>  \n> \n>  \n\n \n\nThis please. Frodo ringbearer for the Frodo quests is fine, but I hope they keep the rest as simple as possible, since with all the objective, treasure, boons, burdens and \"token\" heroes, this game is becoming too gimmicky for my taste.\n\nEdited July 19, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=817891","commentId":817891,"userName":"Samwise Gamgee","timestamp":1374281067,"content":"I disagree. I am pleased that they are adding a mode of game play that attempts to bring a continuity between quests. I also like the level up aspect of the boons. One can always play it in \"non-campaign\" mode as well and just forget the campaign cards. I understand if you are a fan of the straight game and I think they will continue to have APs to cater to that preference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=818033","commentId":818033,"userName":"klaymen_sk","timestamp":1374309173,"content":"> Regarding the number of heroes, it doesn't say anywhere that each Saga box has to bring 4 new heroes. Khazad-Dum only included 2 heroes, if I remember correctly<snip>\n\n \n\nKD is a deluxe expansion, not a saga. The only saga expansions are the Hobbit boxes and those indeed contain four heroes (plus Bilbo Baggins).\n\nEdited July 20, 2013 by klaymen_sk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=818059","commentId":818059,"userName":"player1761766","timestamp":1374316397,"content":"As soon as Black Riders was announced - maybe even after the Hobbit boxes were announced - I'd been kinda assuming we'd be seeing duplicate heroes. So I'm kinda okay with the idea of seeing them, even though it does seem a bit much to get another Pippin so soon. I suppose it's a natural course for the game that started out restricted to before the main book, but is now re-treading its steps. But I suppose it gives us options!\n\n \n\nRegarding the Gandalf hero idea, I agree it would mean upping the difficulty of the quest to compensate, and given how much I decry the current level of difficulty already, this can't be a good thing! But the rulebook did make mention of 'epic' quests where threat can go beyond 50, maybe that would tie in? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86651-is-there-really-going-to-be-six-saga-boxes-for-lotr/?do=findComment&comment=818065","commentId":818065,"userName":"richsabre","timestamp":1374317254,"content":"> But the rulebook did make mention of 'epic' quests where threat can go beyond 50, maybe that would tie in? \n\ngood point! its about time we saw that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}