{"url":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/","title":"A couple of noob questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/?do=findComment&comment=818510","commentId":818510,"userName":"Haarku","timestamp":1374419337,"content":"Hi forum,\n\n \n\nI've played a few games with the Core Set now (both solo and co-op with my son) and have a couple of questions.  I'd appreciate it if you can help clear these up for us.\n\n \n\n1. Damage\n\n \n\nIf damage is dealt outside of combat, does a character's defence reduce it? For example, let's say Forest Spider is in play in the staging area.  I play Gandalf from my hand and choose to deal 4 damage to one enemy in play.  Does the Forest Spider take 4 damage (and get removed from play) or only 3 (after its Defence Strength of 1)?\n\n \n\n2. Caught in a Web\n\n \n\nSticking with the Forest Spider theme, I had a situation where Legolas was in play with the Caught in a Web card attached to him.  During the Combat Phase, the Shadow card dealt was Forest Spider, which required me, as the defending player, to discard 1 attachment I controlled.  My question is whether it was a legal move to discard the Caught in a Web.  The Rules of Play say \"players always assume control of attachments that have been played on their characters\" (p25) so it could be argued that this is OK.  However, it felt like a bit of a cheat.  What does the forum think?\n\n \n\nThanks for your help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/?do=findComment&comment=818543","commentId":818543,"userName":"richsabre","timestamp":1374426188,"content":"1. damage outside of attacks ignores defense. it would take 4\n\n2.i am sure that this was officially clarified somewhere, but you do not control encounter attatchments, so the answer would be no...i will try and find the source for this and post it\n\nEDIT here it is, from the FAQ\n\n(1.06) Control of Non-objective Encounter Cards\nPlayers do not gain control of encounter cards unless\ncontrol of the card is explicitly granted by a card\neffect. When an encounter card (such as Caught in a\nWeb, CORE 86) becomes an attachment and attaches\nto a character, that character’s controller does not gain\ncontrol of the attachment.\n\nrich\n\nEdited July 21, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/?do=findComment&comment=818602","commentId":818602,"userName":"Migwald","timestamp":1374437975,"content":"Welcome to the game. I also play co-op with my son and have great fun trying to beat the encounter deck. I' ve nothing to add to Rich's reply ( he's right of course), the game poses plenty of problems and 'what if' situations, but if you assume the worst outcome possible, that's usually the right one!\n\nI hope you enjoy the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/?do=findComment&comment=818624","commentId":818624,"userName":"richsabre","timestamp":1374439980,"content":"indeed! also the FAQ i mention is is the lotr lcg product page on this site, under support\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/?do=findComment&comment=818914","commentId":818914,"userName":"Haarku","timestamp":1374481526,"content":"Thanks for the responses.\n\n \n\nI did try looking through the rulebook and FAQs before posting questions but I must have missed that one!\n\n \n\nRegarding the Caught in the Web issue, it did feel like a bit of a cheat to get out of it in that way.  I agree that, in the future, I should just assume that the worst outcome for my poor heroes is the correct answer.\n\n \n\nAfter 20 years or so of adventure games like this, I should have learned this by now! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nApart from playing with my son, I've tried Passage Through Mirkwood with all four starter decks on my own and won with Leadership and Spirit.  I then tried Journey Down the Anduin with Spirit and failed miserably.  Having read this and other forums for advice, I have had a go at constructing my own 50-card deck mixing the Sprit and Tactics spheres.  My thinking is that solo decks need to be good at fighting and questing to succeed.\n\n \n\nI completed Passage Through Mirkwood with this deck and it played fairly well.  Resource generation seems to be a bit of an issue but I will have a go at Anduin and see how I get on.  I do realise that only having the Core Set restricts my card pool but my current thinking is that I should try all the orignial scenarios before going for any expansions.\n\n \n\nWhat do you all think?  Is it worth trying the remaining two scenarios with a deck constructed solely from the Core Set or is it not possible to win with these cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/?do=findComment&comment=818930","commentId":818930,"userName":"richsabre","timestamp":1374483126,"content":"hello again,\n\nit seems like you are an experienced gamer, so the short answer is: yes if you want to (or can) dedicate the time to the game. as someone who has obsessively played this game since the start i have lost a lot, but no more so than when just core set was out.\n\n \n\nanduin is certainly possible mulithanded, and its also possible solo though more difficult, both with just the core set\n\nescape from dol guldur is hard multihanded but near impossible solo with just core set.\n\n \n\ni know the idea of lcgs are to buy packs when and which you want them, but this game really does get more into its possibilities and potentials once you have a cycle of 6 packs or so.\n\n \n\nfor general advice i would say stay away from the starter decks once you have left mirkwood behind. spirit is almost a must run sphere in core set era play, as you need 'test of will' and 'hasty stroke'. i usually run lore/spirit solo, and use a tactics support deck\n\nleadership i play less, and its usually in 3 sphere decks.\n\n \n\nif you have any questions id be happy to help you out. welcome to the game!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86758-a-couple-of-noob-questions/?do=findComment&comment=819478","commentId":819478,"userName":"booored","timestamp":1374536292,"content":"> Regarding the Caught in the Web issue, it did feel like a bit of a cheat to get out of it in that way.  I agree that, in the future, I should just assume that the worst outcome for my poor heroes is the correct answer.\n\n \n\nYeah this is a great rule of thumb. If you read the card, almost always the worst option will be correct :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] This game is in fact pretty unforgiving and has a brutal streak in it.\n\n \n\n \n\n> What do you all think?  Is it worth trying the remaining two scenarios with a deck constructed solely from the Core Set or is it not possible to win with these cards?\n\n \n\nFor me deck construction is one of the most interesting aspects of this game so I strongly recommend you do this. If you only have 1 copy of core then I think you may have problems with Anduin and zero chance with Escape for solo. Though you have a ok chance at both two player but expect many losses until you work it out, either way you will have to construct the decks to get by these."}]}