{"url":"https://community.fantasyflightgames.com/topic/86829-lotr-lcg-a-2-player-game-after-all/","title":"LOTR: lcg. A 2 player game after all ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/86829-lotr-lcg-a-2-player-game-after-all/?do=findComment&comment=819091","commentId":819091,"userName":"iznax","timestamp":1374507385,"content":"After having played this game for almost 2 years (and being one of my favorite board/card games of all time  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  ) i have reached the conclusion that 2 is the ideal number of players for this game, most (almost all) of the quests are quite problematic when played above or below this number and most (almost all) of the complains i have heard or read (including mine) comes from a solo,3 or 4 player perspective\n\nWhat are your thoughts and your opinions on this subject guys ?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86829-lotr-lcg-a-2-player-game-after-all/?do=findComment&comment=819098","commentId":819098,"userName":"Khamul The Easterling","timestamp":1374508071,"content":"I think that probably 2 player works the best for all the quests, and it seems like they test most of the quests 2 player.  \n\n \n\nBut I think the more the players, the more fun.  Even though the quest might not work quite as well, I always think its fun with 3-4 players and a huge mess of cards and complications over the table.(Or floor) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86829-lotr-lcg-a-2-player-game-after-all/?do=findComment&comment=819103","commentId":819103,"userName":"richsabre","timestamp":1374508394,"content":"not so sure. i have been a solo player from the start until around 1 year ago when i started playing 2/3 handed\n\n \n\nas for the quests...well, i have noticed that everything after the hobbit pack onwards has actually been easier for solo than multiplay\n\n \n\ni dont think that the designers are aiming for a certain 'sweet spot' around the 2 player mark, i just think they are trying to make it as even as possible, and the variations in difficulty represent this....mirkwood was hard for solo, easy for 2/3/4 player. onwards it appears to be the opposite in general\n\n \n\nso, does this game work best for 2 handed? i would say yes, on average, most quests are averaged in 2 player and are either easier or harder depening on if you go above or below.\n\n \n\nwhether this makes it a 2 player game i doubt it. it is interesting that an old post i made complaining about the lack of solo cards (this was around the time of redhorn gate release) trigger a rather harsh reply from most of the forum that this game was most certainly not predominently a solo game, but a 2 player game.\n\n \n\nat the time i did not agree, as i was keen to defend this games solo aspects...which i might add i still do, but i do see, now having played 2 handed, that a lot of the design aspects work better 2 handed rather than others\n\nrich\n\nEdited July 22, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/86829-lotr-lcg-a-2-player-game-after-all/?do=findComment&comment=819220","commentId":819220,"userName":"Glaurung","timestamp":1374516120,"content":"Different deck buildings for solo 2 players or 3 4 players game. That what make this game cool also."},{"commentUrl":"https://community.fantasyflightgames.com/topic/86829-lotr-lcg-a-2-player-game-after-all/?do=findComment&comment=819282","commentId":819282,"userName":"iznax","timestamp":1374521275,"content":"Glaurung that is true indeed. Rich about 1st cycle (mirkwwod), it seems like beyond it the designers thought ''OH ! we shouldn't playtest it only with 2'' hahahaha :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/86829-lotr-lcg-a-2-player-game-after-all/?do=findComment&comment=819299","commentId":819299,"userName":"richsabre","timestamp":1374523468,"content":"> Glaurung that is true indeed. Rich about 1st cycle (mirkwwod), it seems like beyond it the designers thought ''OH ! we shouldn't playtest it only with 2'' hahahaha :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n:lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png] im pleased to see that it is much more streamlined now, though mirkwood still remains my favourite cycle\n\nrich"}]}