{"url":"https://community.fantasyflightgames.com/topic/87133-do-i-need-to-play-expansions-in-order/","title":"Do I need to play expansions in order","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87133-do-i-need-to-play-expansions-in-order/?do=findComment&comment=822618","commentId":822618,"userName":"nicks","timestamp":1374797026,"content":"I just got the base game and I'm enjoying it. I was going to order \"The shadows of Mirkwood\" series but it doesn't come out until august.\n\n \n\nIn the meantime I ordered the Khazad Dum expansion and the first three adventures of Dwarrowdwelf.\n\n \n\nShould I wait for the re-prints of Shadows of Mirkwood to come out in August and plays those before starting khazad dum and continuing?\n\n \n\nAny help would be appreciated"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87133-do-i-need-to-play-expansions-in-order/?do=findComment&comment=822693","commentId":822693,"userName":"richsabre","timestamp":1374803370,"content":"no you do not. if you want to have the narrative of a cycle i would recommend playing the packs within a cycle in order, but the cycles themselves do not carry over so you can play dwarrowdelf before mirkwood fine.\n\njust remember that you need a deluxe pack to play the cycle after it- so you need khazad dum to play dwarrowdelf cycle, hiers of numenor to play against the shadow cycle.  mirkwood doesnt need this as the core set actcs as the pack\n\n \n\nthe biggest impact that mixing packs from different cyles not in the order of time release is that difficulty will vary more than intended due to your limited card pool compared to the current card pool of the more recent packs\n\nrich\n\nEdited July 26, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87133-do-i-need-to-play-expansions-in-order/?do=findComment&comment=822747","commentId":822747,"userName":"Khamul The Easterling","timestamp":1374811094,"content":"Start with Khazad-Dum and Dwarrowdelf cycle. thats the way to go.  Go with Mirkwood after if you have the money or still like the game.  "}]}