{"url":"https://community.fantasyflightgames.com/topic/87234-next-buy/","title":"Next buy","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=823733","commentId":823733,"userName":"Khamul The Easterling","timestamp":1374893301,"content":"As you know, I have done 2-3 threads already on next buys but when I look at the expansions I do not have, and try to make a list, its so hard and changes pretty much every day :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  I don't have all the money in the world so I only buy a few expansions at a time.  Well anyways I hope you don't mind helping me out.  It's rather exciting as my list grows thin :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I do not have the following: \n\n \n\n \n\nThe Hunt for Gollum\n\n \n\nThe Dead Marhses\n\n \n\nThe Long Dark\n\n \n\nShadow and Flame\n\n \n\nOn the Doorstep\n\n \n\nThe Battle of Laketown\n\n \n\nEncounter at Amon Din \n\n \n\n \n\nI usually like getting ones that have the best quest.  Although I do like building decks I pretty much decide my buy on the quest and just am happy with the player cards that come with them.  I never buy a expansion only because of the player cards.  So now that you know what I'm looking for, if you could make a top 3 list of the next expansions I should get out of the list I made, that would be great!!\n\n \n\nThanks,\n\nKhamul\n\nEdited July 27, 2013 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=823773","commentId":823773,"userName":"Glaurung","timestamp":1374900654,"content":"My suggestion is:\n\n \n\nBattle Lake town. Very cool quest.\n\n \n\nShadow and Flame. Also ok\n\n \n\nHunt for Gollum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=823799","commentId":823799,"userName":"TheLightdarker","timestamp":1374905193,"content":"For a player on a budget, it seems to me that The Hobbit: On the Doorstep would by far provide the most value for your money. Not only do you get a significantly greater number of Hero and player cards than you would in an adventure pack, but you also get three entertaining, radically different and in their own way challenging scenarios. They're no Lake-town level of difficulty, for sure, but I enjoy them nevertheless. Plus, checking prices on Amazon, it only costs about 30-40% more than an Adventure Pack / Print on Demand scenario. For the remainder of your purchases, I would suggest you pick up Lake-town only when you want a significant challenge. Otherwise:\n\nShadow and Flame (reasonably fun, can be challenging) > Encounter at Amon Din (kinda fun, interesting theme - easy, but maybe more difficult than the other APs you don't own yet) > The Long Dark (can be fun with many players) > The Hunt for Gollum (I have some great memories of this quest, and it can be pretty fun, at times) > The Dead Marshes (can be fun or annoying)\n\nEdited July 27, 2013 by TheLightdarker"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=823853","commentId":823853,"userName":"richsabre","timestamp":1374913671,"content":"the hunt for gollum, if you can find it (get it?)\n\n \n\non the doorstep\n\n \n\namon din\n\n \n\nthose are the best, most enjoyable quests in my opinion\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=823955","commentId":823955,"userName":"rekath16","timestamp":1374930348,"content":"Amon Din"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=823996","commentId":823996,"userName":"Khamul The Easterling","timestamp":1374934037,"content":"OK yeah well Mirkwood is supposedly reprinted and will be available in August.  But you never know.....I remember when it was thought it would be available this last spring.  \n\n \n\nThanks for the replies guys.  Is all the hype about Amon Din just cause its new or is it really an ok quest?   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824009","commentId":824009,"userName":"Nickpes","timestamp":1374935953,"content":"On the doorstep .... Cause there is Smaug and lots of great deck cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824054","commentId":824054,"userName":"Dain Ironfoot","timestamp":1374940692,"content":"> OK yeah well Mirkwood is supposedly reprinted and will be available in August.  But you never know.....I remember when it was thought it would be available this last spring.  \n> \n>  \n> \n> Thanks for the replies guys.  Is all the hype about Amon Din just cause its new or is it really an ok quest?   \n\n \n\namon din, while thematically interesting, is a breeze. i threw together a deck in a minute (literally) and beat it easily in multiplayer.  it's so easy (probably as easy as passage through mirkwood) that i don't see myself re-playing it a lot.\n\n \n\ni'm not the type to complain about easier quests - but when this one ends i've always had the reaction: \"wait...that's...it?!\" it's over before you know it!\n\n \n\nif you are looking for even a moderately challenging quest - this is one to avoid.\n\nEdited July 27, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824059","commentId":824059,"userName":"richsabre","timestamp":1374941108,"content":"> Thanks for the replies guys.  Is all the hype about Amon Din just cause its new or is it really an ok quest?   \n\nwell going off your previous post in reply to my losing it 3 times, im guessing you will not like it, as (i have been told) that it is too easy.....not sure what to say on that as it appears we approach the game very differently, but i would recommend it for its storyline and narrative\n\ni love it, but as i say, thats me\n\nrich\n\nEdited July 27, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824099","commentId":824099,"userName":"Glaurung","timestamp":1374944401,"content":"> > OK yeah well Mirkwood is supposedly reprinted and will be available in August.  But you never know.....I remember when it was thought it would be available this last spring.  \n> > \n> >  \n> > \n> > Thanks for the replies guys.  Is all the hype about Amon Din just cause its new or is it really an ok quest?\n> \n>  \n> \n> amon din, while thematically interesting, is a breeze. i threw together a deck in a minute (literally) and beat it easily in multiplayer.  it's so easy (probably as easy as passage through mirkwood) that i don't see myself re-playing it a lot.\n> \n>  \n> \n> i'm not the type to complain about easier quests - but when this one ends i've always had the reaction: \"wait...that's...it?!\" it's over before you know it!\n> \n>  \n> \n> if you are looking for even a moderately challenging quest - this is one to avoid.\n\nWelcome to the club. This feeling i have already 1 year. Things was change with HON but now is back again..... i really lost my hook to play this game for now...... i will make a break for now....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824113","commentId":824113,"userName":"Dain Ironfoot","timestamp":1374945845,"content":">  \n> \n> >  \n> > \n> > > OK yeah well Mirkwood is supposedly reprinted and will be available in August.  But you never know.....I remember when it was thought it would be available this last spring.  \n> > > \n> > >  \n> > > \n> > > Thanks for the replies guys.  Is all the hype about Amon Din just cause its new or is it really an ok quest?\n> > \n> >  \n> > \n> > amon din, while thematically interesting, is a breeze. i threw together a deck in a minute (literally) and beat it easily in multiplayer.  it's so easy (probably as easy as passage through mirkwood) that i don't see myself re-playing it a lot.\n> > \n> >  \n> > \n> > i'm not the type to complain about easier quests - but when this one ends i've always had the reaction: \"wait...that's...it?!\" it's over before you know it!\n> > \n> >  \n> > \n> > if you are looking for even a moderately challenging quest - this is one to avoid.\n> \n> Welcome to the club. This feeling i have already 1 year. Things was change with HON but now is back again..... i really lost my hook to play this game for now...... i will make a break for now.....\n> \n>  \n\n \n\ni still find druadan forest to be quite tough in multiplayer - i'm surprised you've found it so easy. i've played it many, many times (with all sorts of different decks and with different players) and i've only won it once. things can change so quickly in that particular quest - you can have lots of resources, a lot of willpower committed to the quest - and then all of a sudden all of your resources are gone, folks get removed from the quest, and you have archery 8+ on the table, and a 10 threat location in the staging area.\n\n \n\nregardless, the first three have been different - but we'll have to see what the final 3 APs have in store for us!\n\nEdited July 27, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824117","commentId":824117,"userName":"richsabre","timestamp":1374946120,"content":"the answer to those who find this game too easy is simple- stop making good decks!!!!!\n\ntry theme decks, try all hobbit decks, all dunedain decks, mono decks, secrecy decks, 2 and 1 hero decks. try decks with 90% attatchments and little allies...try a deck with no allies!\n\n \n\nKhamul asked me a  few days ago if i try to lose, and whilst the answer is no, i do believe that losing is a great part of this game, as it freshens the challenge up, so what i do try to do is make decks that probably will die, and then tweak them until they are good. i can make a deck that will kill probably 80% of the games quests easily, but that gets old quick (so in a way i guess i do try to lose)\n\n \n\nthis game has not run its course for you ultra-winners out there and i really do believe people who dont try this are missing out, even if you dont enjoy the theme so much, theres a whole other game out there to be enjoyed.\n\n \n\n...and if you are doing these things already and still winning too much to be enjoyable, then perhaps i need to re read the rule book\n\nrich\n\nEdited July 27, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824138","commentId":824138,"userName":"Khamul The Easterling","timestamp":1374947814,"content":"> the answer to those who find this game too easy is simple- stop making good decks!!!!!\n> \n> try theme decks, try all hobbit decks.......\n\nNo, I disagree.  I don't you should have to make decks that don't work very good or not be able to use your cool decks that work well to play quests.  I think the quests should be harder.  And thank goodness they are solving this with NM but jeez....its taking way too long.  Lots of the quests are ruined from all the powerful player cards.  I don't think using all the junk cards is the way to solve making the game too easy.  I think its fun to use new cool powerful cards.  \n\n \n\nI guess you don't mind crushing senario's but think the fun of the game is making hard decisions on what to do, and losing lots and having to tweak your deck and stuff to win.  But all these latest quests you dont even have to do anything you win right away np.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824203","commentId":824203,"userName":"Tracker1","timestamp":1374952781,"content":"HoN quests were great not only because they were challenging, but they shook up my deckbuilding, and i had to think creativity about how to handle the new challenge. Any quest that breaks me out of my deck building rut is an excellent quest. A quest is boring when it provides no challenge to my deck building, this usually means the quest was easy, since it offers no new real challenge. It may offer a different mechanic or theme, but in the end I did not have to do anything to my deck to work for the victory. Its pretty disappointing to wait for a month or more and get an easy victory first attempt.\n\nMaybe ffg should not give us such strong player cards if they make these quests to easy. Maybe NM mode will make me eat my words.\n\nAnyway, what i've had to do to still enjoy the game is do what Rich suggested, and that is making decks that are still good, but not top tier. So, for these decks i forget about how fast i can win etc. what I shot for is can I get the deck to work exactly the way i want it to. Do all the synergies work, do my heroes get the attachments etc.\n\nFor instance, i'm working on a deck right now with Great Yew Bow and Legolas. I want to maximize this combo with low threat, so Legolas really uses this bow. I played JDtA and beat it in 14 rounds, which sucks right, well here is the rest of the story i finished with 5 threat and only had to engage one enemy the whole game. Legolas picked of enemies in the staging area almost the whole game. So, to me i was satisfied with that since i set a goal for my deck building, and made an easy scenario more challenging. This deck also worked on Amon Din. Decks like these are not going to win every time, and they will never stand up to the most difficult challenges, but they are still satisfying to play and bring new life into easier and old scenarios.\n\nBut, when it's all said and done. It should not be on my shoulders to make the scenarios more difficult by making weaker decks, although that's what's what i'm doing, and enjoying it. It is the responsibility of the developers to provide a sufficient challenge that is not only a hard to beat, but also makes me dig into my player cards to come up with interesting solutions to new problems.\n\nLast note on what to buy.\n\nShadow and Flame\n\nbattle of Laketown\n\nTHfG since you will be able to get NM mode soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824272","commentId":824272,"userName":"richsabre","timestamp":1374957564,"content":"yes, i still agree that it is the designers job to challenge us, but i think that there are many players out there still struggling, and wanted this shift in difficulty. i know i always say to newcomers 'wait for the later packs and buy expansions first' but thats not really the idea of the lcg format (though thats a whole other discussion i know)\n\n \n\nits a complex scenario thats a balance...it will sway either way, whether we as players want it to or not...there's always going to be hit and misses which are dependant on your personal play level...and those hit and misses may be packs or may be entire cycles, and players will have to accept that and do what they can, like tracker1 suggests- at least for the time being until easy mode and nightmare mode are available to play...then we are all happy right?\n\nrich\n\nEdited July 27, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824305","commentId":824305,"userName":"Spurries","timestamp":1374960227,"content":"Tracker, mind sharing your legolas deck?  Sounds very cool"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824355","commentId":824355,"userName":"Khamul The Easterling","timestamp":1374965159,"content":"> at least for the time being until easy mode and nightmare mode are available to play...then we are all happy right?\n> \n> rich\n\nBy the time they're done coming out with a few NM packs, I'll be like 3-4 years older :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  Sooooo sloooow. -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]  -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]  -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]  -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]  -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]  -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824366","commentId":824366,"userName":"GrandSpleen","timestamp":1374966231,"content":"Khamul, On the Doorstep is one of my favorite expansions, but you will probably find the quests too easy for your taste.  Flies and Spiders is another Foundations of Stone with a spider theme.  The Lonely Mountain is easy to finish, but very very challenging to 'complete.'  You have to burgle treasure from Smaug in that quest, but only have to do it once to win.  You can continue to try and get all the treasure, but it's a challenge.  And bad luck with the encounter deck may decimate your party (Smaug smoked 6 characters in one turn last time I played).  The last quest, The Battle of Five Armies, is a medium-difficulty quest with a cool theme.  It is pretty straight forward-- no major curveballs, just a mechanic where multiple quest cards are in play at once."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824418","commentId":824418,"userName":"Khamul The Easterling","timestamp":1374975240,"content":"Thanks for the reply GrandSpleen (and all others).  I'm not like \"all quests that are not super hard are really stupid and I hate them\" its just not that fun when you win every game and your just like \"quest for a ton, beat the stage, then easily defend whatever enemy and demolish it with like 13 attack and reset threat and do the same for next round.\" thats too simple.  The main reason I like the game is cause its really complicated and lots of stuff happening and lots of hard decisions to make and its a rather close game that you are actually trying to win.(not just winning super easy) for example I like Peril in Pelagir, its usually a sure win, but lots more thinking I think and more happening and stuff.  So as long as there is plenty going on and stuff to think about and decisions to make, unlike THoEM, and its a fairly difficult quest, I will usually like the quest.  So yeah it doesnt have to be super hard, I just like lots of stuff happening and there to be actually decisions to make.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824439","commentId":824439,"userName":"Tracker1","timestamp":1374977416,"content":"> Tracker, mind sharing your legolas deck?  Sounds very cool\n\nAs requested in Strategy and Deck Building forum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824537","commentId":824537,"userName":"Glaurung","timestamp":1374992496,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > OK yeah well Mirkwood is supposedly reprinted and will be available in August.  But you never know.....I remember when it was thought it would be available this last spring.  \n> > > > \n> > > >  \n> > > > \n> > > > Thanks for the replies guys.  Is all the hype about Amon Din just cause its new or is it really an ok quest?\n> > > \n> > >  \n> > > \n> > > amon din, while thematically interesting, is a breeze. i threw together a deck in a minute (literally) and beat it easily in multiplayer.  it's so easy (probably as easy as passage through mirkwood) that i don't see myself re-playing it a lot.\n> > > \n> > >  \n> > > \n> > > i'm not the type to complain about easier quests - but when this one ends i've always had the reaction: \"wait...that's...it?!\" it's over before you know it!\n> > > \n> > >  \n> > > \n> > > if you are looking for even a moderately challenging quest - this is one to avoid.\n> > \n> > Welcome to the club. This feeling i have already 1 year. Things was change with HON but now is back again..... i really lost my hook to play this game for now...... i will make a break for now.....\n> > \n> >  \n> \n>  \n> \n> i still find druadan forest to be quite tough in multiplayer - i'm surprised you've found it so easy. i've played it many, many times (with all sorts of different decks and with different players) and i've only won it once. things can change so quickly in that particular quest - you can have lots of resources, a lot of willpower committed to the quest - and then all of a sudden all of your resources are gone, folks get removed from the quest, and you have archery 8+ on the table, and a 10 threat location in the staging area.\n> \n>  \n> \n> regardless, the first three have been different - but we'll have to see what the final 3 APs have in store for us!\n> \n>  \n\nJust add couple of Healer. And forget about archery damage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824541","commentId":824541,"userName":"Glaurung","timestamp":1374992742,"content":">  \n> \n> > the answer to those who find this game too easy is simple- stop making good decks!!!!!\n> > \n> > try theme decks, try all hobbit decks.......\n> \n> No, I disagree.  I don't you should have to make decks that don't work very good or not be able to use your cool decks that work well to play quests.  I think the quests should be harder.  And thank goodness they are solving this with NM but jeez....its taking way too long.  Lots of the quests are ruined from all the powerful player cards.  I don't think using all the junk cards is the way to solve making the game too easy.  I think its fun to use new cool powerful cards.  \n> \n>  \n> \n> I guess you don't mind crushing senario's but think the fun of the game is making hard decisions on what to do, and losing lots and having to tweak your deck and stuff to win.  But all these latest quests you dont even have to do anything you win right away np.  \n> \n>  \n\nSure agree 100%. I use my brain to make cool deck and i should to get proper challenge. If i must to play without all my power for what then need my skill as a player and deck builder? Si wrong advice Rich \n\nSolution is easy. NM right in the AP from the start. Easy Normal and NM. Then is ok."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824542","commentId":824542,"userName":"Glaurung","timestamp":1374993437,"content":"> HoN quests were great not only because they were challenging, but they shook up my deckbuilding, and i had to think creativity about how to handle the new challenge. Any quest that breaks me out of my deck building rut is an excellent quest. A quest is boring when it provides no challenge to my deck building, this usually means the quest was easy, since it offers no new real challenge. It may offer a different mechanic or theme, but in the end I did not have to do anything to my deck to work for the victory. Its pretty disappointing to wait for a month or more and get an easy victory first attempt.\n> \n> Maybe ffg should not give us such strong player cards if they make these quests to easy. Maybe NM mode will make me eat my words.\n> \n> Anyway, what i've had to do to still enjoy the game is do what Rich suggested, and that is making decks that are still good, but not top tier. So, for these decks i forget about how fast i can win etc. what I shot for is can I get the deck to work exactly the way i want it to. Do all the synergies work, do my heroes get the attachments etc.\n> \n> For instance, i'm working on a deck right now with Great Yew Bow and Legolas. I want to maximize this combo with low threat, so Legolas really uses this bow. I played JDtA and beat it in 14 rounds, which sucks right, well here is the rest of the story i finished with 5 threat and only had to engage one enemy the whole game. Legolas picked of enemies in the staging area almost the whole game. So, to me i was satisfied with that since i set a goal for my deck building, and made an easy scenario more challenging. This deck also worked on Amon Din. Decks like these are not going to win every time, and they will never stand up to the most difficult challenges, but they are still satisfying to play and bring new life into easier and old scenarios.\n> \n> But, when it's all said and done. It should not be on my shoulders to make the scenarios more difficult by making weaker decks, although that's what's what i'm doing, and enjoying it. It is the responsibility of the developers to provide a sufficient challenge that is not only a hard to beat, but also makes me dig into my player cards to come up with interesting solutions to new problems.\n> \n> Last note on what to buy.\n> \n> Shadow and Flame\n> \n> battle of Laketown\n> \n> THfG since you will be able to get NM mode soon.\n\nActually what we do now with my friend to make us more happy and make game more challenge\n\nI  have this idea a some time ago after when FFG present us new campaign mode.\n\n \n\nPlay thought all Hobbits quest and use only cards from Core set and both Hobbit expansion including a heroes. You cannot change your deck but you can change a heroes from quest to quest and if Hero dies you cannot use him anymore. And add 1 to starting threat to the next game for all players for each dead hero. So we have a quite limited pool of the cards, limited pool of the heroes and if we lose some cool ones we cannot win in the end probably. \n\nMy friend was very sceptic about this idea. But i convince him to try it. And.....we play until 6 in the morning! Very cool! Very interesting format. The game bring to us new edges! We make a first quest but didn get any treasures so but all heroes still alive. So now next one. I suggest this format, pretty exiting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87234-next-buy/?do=findComment&comment=824631","commentId":824631,"userName":"player1761766","timestamp":1375012199,"content":"Well, I only ever go for interesting quests, not going for all this how-easy-it-is-to-beat stuff. The story is all-important to me! Who cares how many orcs pile up in the discard pile? That just reduces what is actually an excellently-themed game to mere mechanics.\n\n \n\nBut anyway, I'd go for:\n\nThe Hunt for Gollum\n\nThe Dead Marshes\n\nOn the Doorstep (I've not played the last quest in this yet, but the first one is excellent, and the second not all that bad, either)."}]}