{"url":"https://community.fantasyflightgames.com/topic/87451-exhaustive-rule-sheet-for-solo-players/","title":"Exhaustive rule sheet for solo players","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87451-exhaustive-rule-sheet-for-solo-players/?do=findComment&comment=826419","commentId":826419,"userName":"Cunir","timestamp":1375176235,"content":"I've put together an exhaustive rule sheet for solo players, containing every single rule and all the latest FAQs too. it's totally up-to-date. I think i've managed to get every single rule on there, crammed onto a double-sided pdf.\n\n \n\nI was hoping someone might want to look it over to see if i've made any mistakes or missed anything out. i'm happy to make changes to it\n\nhttp://www.boardgamegeek.com/filepage/93105/solo-player-rule-sheet-pdf [http://www.boardgamegeek.com/filepage/93105/solo-player-rule-sheet-pdf]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87451-exhaustive-rule-sheet-for-solo-players/?do=findComment&comment=836745","commentId":836745,"userName":"Cunir","timestamp":1376235209,"content":"a couple of things i was wondering... if a card has two different effects on it, like \"surge\" and \"guarded\", is there a particular order in which each should be done, or do you just use the order that they are printed? \n\nthere's are the words that i'm wondering about -- doomed, surge, prowl, ambush, guarded. i'm assuming that \"when revealed\" always come first\n\nand what happens if you draw 2 encounter cards, and the first one has the word surge. do you deal with the second encounter card before the extra surge card has been drawn, or you do you deal with the first encounter card, then the extra surge card, and then the second encounter card?\n\nand also, if one of your characters is wounded, and you manage to return it to your hand through a card effect, do the wounds stay on it (for when you manage to play it again)?\n\nEdited August 11, 2013 by Cunir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87451-exhaustive-rule-sheet-for-solo-players/?do=findComment&comment=836782","commentId":836782,"userName":"Kepagt","timestamp":1376238308,"content":"Great job! Thank You."}]}