{"url":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/","title":"What do you want from The Black Riders?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828241","commentId":828241,"userName":"Gizlivadi","timestamp":1375314650,"content":"Seeing as The Black Riders will be released in a couple of months if not earlier, I wanted to ask you all what would you especially like to see in this expansion, be it in terms of lore, mechanics, player card quality and traits, etc\n\n \n\nWell, the first thing I would love to see in this expansion is obviously the Barrow-downs and the Barrow-wights, but I fear that we will not get that in the Black Riders. Also, I would like to see some encounter card interaction with the Ring-bearer trait since so many if not all of the scenarios in the LOTR saga expansions will be played with a ring-bearer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828246","commentId":828246,"userName":"richsabre","timestamp":1375314930,"content":"good thread. here is my list\n\n \n\n1.old forest and barrow downs.they are my favourite chapters of the entire lotr. i also think they will not be in :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n2. more theme quests (yes, this will not be liked by most of the forum) ...so less enemies, and more clever ways of progressing and winning.lots of sneaking and hiding.\n\n3. hobbits hobbits and more hobbits.\n\nBagginses, Boffins, Tooks, Brandybucks, Grubbs, Chubbs, Burrowses, Hornblowers, Bolgers, Bracegirdles, Goodbodies, Proudfoots (Proudfeet!!)...and last but not least Sackville-Bagginses !\n\nrich\n\nPS- incase you are wondering i did indeed copy that list :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828251","commentId":828251,"userName":"Ellareth","timestamp":1375315539,"content":"I'll start by stating the obvious; Bombadil, Goldenberry, Oldman Willow.\n\n \n\nAlso some of the more less-known characters as Unique allies.\n\nNot all hobbits are fit to be in the game, but there are the patrols (Sam's friend or cousin who have claimed to have seen a walking tree springs to my mind), some of Bilbo's relatives and friends that are good with lore (Rory Brandybuck or someone named similar that guessed Bilbo's true intention during 111th party).\n\nIf Hirluin could be a hero, those hobbits can certainly be an ally atleast.\n\n \n\nAnd perhaps most importantly, artwork that are beautiful and true to the book.\n\nI was very happy to see Sam with scar on his scalp. I've almsot forgotten he was wounded when he killed his first Orc in Moria, but Caleb and other developers remembered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828258","commentId":828258,"userName":"richsabre","timestamp":1375316579,"content":"i think all hobbits have a place in the game...even in minor ways. for instance my first thought months ago of hobbits was 'postal services' and 'post master' that allow you to ship attatchments from a character to another.\n\nalso 'post bag' to let you carry +1 restricted attatchment\n\n \n\nthat way even the non adventurous hobbits get a place in the game without breaking the true lore\n\ni would also like to see inkeepers and other non military postitions. i think this is the perfect pack for some weaker more themeatic characters\n\nrich\n\nEdited August 1, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828260","commentId":828260,"userName":"Khamul The Easterling","timestamp":1375317086,"content":"> Bagginses, Boffins, Tooks, Brandybucks, Grubbs, Chubbs, Burrowses, Hornblowers, Bolgers, Bracegirdles, Goodbodies, Proudfoots (Proudfeet!!)...and last but not least Sackville-Bagginses !\n> \n>  \n> \n>  \n\nahhh haha thats also a good part in movie :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  \n\n \n\n> 2. more theme quests (yes, this will not be liked by most of the forum) ...so less enemies, and more clever ways of progressing and winning.lots of sneaking and hiding.\n\nI think that would make a good quest.  Like that kind of Idea.  But not all the quests.  I want a good fighting one too.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828267","commentId":828267,"userName":"Khamul The Easterling","timestamp":1375317779,"content":"1. Khamul :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I want to fight myself.  (btw when I'm playing a game and I reveal a Marsh Adder I'm always like \"hey look its a glaurung!\"  Or when I'm playing the Hobbit quests and I have Glamdring I'm always like \"why do I have Rich as an attachment? this is so wierd\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] haha\n\n \n\n2. I want at least 1 hard quest that they can leave us on with lots of replay value while waiting for Fellowship of the Ring #2.  \n\n \n\n3. Like Rich said some kind of unique quest with a different way o progressing like they did in SF and DDaCD, but better.  \n\n \n\n4. Some card that boosts Hobbits attack since its so low.  \n\n \n\n5. Mainly, since its the heart of the game, good fun quests.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828496","commentId":828496,"userName":"JsBingley","timestamp":1375347649,"content":"I just want things like \"agenda\" in  A Game of Throne LCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828528","commentId":828528,"userName":"iznax","timestamp":1375351665,"content":"I like to see more focus on the ''campaign element'' of the game to enhance the ''RPG'' feeling that already has, with the new cycle they are doing that with the story, so i hope they will do this with the gameplay part as well ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828540","commentId":828540,"userName":"richsabre","timestamp":1375353239,"content":"oh yes- and secrecy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828541","commentId":828541,"userName":"Glaurung","timestamp":1375353342,"content":"I dont know what to say..... i wont a good game, challenge, see real brain food in Tolkien story. Wonna see interesting situation, difficult decisions, epic fight and so on.\n\nBut.... after 2 last quests i start feel like a boy in a small pants.\n\nI need NM straight away. Then ok."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828601","commentId":828601,"userName":"Gizlivadi","timestamp":1375359605,"content":"Glaurung, why don't you just copy what you just posted and paste it in your signature? That way you'll keep yourself from writing the same thing over and over again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828612","commentId":828612,"userName":"Glaurung","timestamp":1375360524,"content":"> Glaurung, why don't you just copy what you just posted and paste it in your signature? That way you'll keep yourself from writing the same thing over and over again.\n\nWhy you tell me what i need to do? I never tell anyone what to do and how to type and so on.\n\nThis is my position and i do it maybe not even for you or for other players. I do it maybe for designers.\n\nBe cool and look after yourself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828624","commentId":828624,"userName":"Gizlivadi","timestamp":1375361631,"content":"It's cool man, I wasn't trying to be rude or ill-mannered. It's just what other people have said, but I have nothing against you, and I thought that your last post was like the apotheosis of all your latest posts which is kinda funny. Anyway sorry and I meant no offense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828651","commentId":828651,"userName":"Chaos101","timestamp":1375364825,"content":"> oh yes- and secrecy\n\nI think this would be a perfect expansion for more secrecy cards. The idea of the Hobbits sneaking around....\n\nLets hope."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828652","commentId":828652,"userName":"Khamul The Easterling","timestamp":1375365071,"content":">  Wonna see interesting situation, difficult decisions, epic fight and so on.\n\nexactly"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828720","commentId":828720,"userName":"richsabre","timestamp":1375370515,"content":">  \n> \n> >  Wonna see interesting situation, difficult decisions, epic fight and so on.\n> \n> exactly\n> \n>  \n\ni think we all want that!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828736","commentId":828736,"userName":"lleimmoen","timestamp":1375372223,"content":"What I want to see most (by far) is Tom Bombadil and Goldberry as allies. I don't think I will ever forgive ffg if they don't work these iconic (!) characters into the game. There's no point of having them as objectives as the story line doesn't move through the Old Forest, it seems, and who would really want them as objectives, only to see them in a single quest? So they have got to be allies, though I will understand if there be great restriction to play them (or keep in play).\n\n \n\nNow, to quote a fellow board member's great line: ffg, obey me, or face my utter powerlessness!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828747","commentId":828747,"userName":"Gizlivadi","timestamp":1375373161,"content":"lleimmoen, that's exactly my opinion on objectives in general, and of course, it applies to Bombadil and Goldberry. I wish we eill see them as allies, but I doubt it just as I doubt we will see the Old Forest and the Barrow-downs in this expansion.\n\nEdited August 1, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828784","commentId":828784,"userName":"lleimmoen","timestamp":1375375914,"content":"Yeah, I like objectives when they're generic, like an Ithilien Ranger, but not for famous characters from the book.\n\n \n\nI think they pretty much confirmed the story bypasses the Old Forest. But still, can they really leave the two out? We've got the likes of Dúnhere or Elfhelm, Damrod or Anborn, and that's great, but can they leave out Tom Bombadil, a character who is easily the top 10 most memorable Tolkien character? That would indeed be a great shame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=828787","commentId":828787,"userName":"richsabre","timestamp":1375376161,"content":"i also agree on that. i will be most dissapointed not to see the barrow downs. i am pretty sure we will only get a hint of them, much like 'hobbit lands' location in the hobbit saga....so 'barrow downs' and 'the old forest' shall both be locations.\n\n \n\nso does this mean no goldberry/bombadil...well, they are limited to their 'bounds' in lore...but that doesnt mean much given that we can throw together some pretty wacky combos of characters...i do not see why we cannot have them, as even taking a very literal view of the theme, they can be in the black rider expansion completely in the breeland scenario (he did afterall know butterbur)\n\n \n\ni hope they will be allies with some sort of gandalf ability....high power then out of play. bombadil should be a large threat reduction...like discard him from play to reduce your threat by X where X is the threat of all cards in play\n\n \n\nPS- i remember a quote from the books which i think should be realised if bombadil is an ally. i cant remember it fully but gandalf says he is a 'moss gatherer' whilst gandalf himself is a 'stone doomed to rolling'....bombadil should have little activity but strong when he is in play\n\nrich\n\nEdited August 1, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829073","commentId":829073,"userName":"Samwise Gamgee","timestamp":1375396629,"content":"I could see Goldberry and Bombadil as objective allies or even event cards. An example event card could do something like Beorn's Hospitability by healing and readying characters. It could also be used to stop enemies from attacking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829094","commentId":829094,"userName":"Alex6222","timestamp":1375399059,"content":"I want to be chased by the 9 black riders in the ford (to suicidal?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829136","commentId":829136,"userName":"SleepyLynx","timestamp":1375406081,"content":"It would be thrilling indeed to be chased by 9 black riders! :x (yes I am masochistic)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829206","commentId":829206,"userName":"Pharmboys2013","timestamp":1375415224,"content":"I expect the 1st quest to be a quest of evasion where you're punished if not completing \"objectives\" like not questing successfully makes you add a angular to the staging area, the 2nd quest will be a more traditional battle quest possibly even like the troll quests, I'm thinking the 3rd quest the flight to the ford will be one you are encouraged to complete quickly as the encounter deck will make it harder to achieve victory the more turns that go on.\n\nAs for the player cards, I'm thrilled with the hobbits and what we've seen so far. I like having the option of not just secrecy but having cards that give players the capacity to complete quests without massive attack values etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829322","commentId":829322,"userName":"Ithilien Ranger","timestamp":1375435446,"content":"I'd like to replay the adventures closely and hope the three scenarios cover most of the adventure of Book I. If that means that Nazgul, evil trees, wights and shady Bree-folk constitute the only enemies all the way to Rivendell, so be it. I've never been a big fan of Tom Bombadil, but I'm interested to find out how he's being handled. \n\n \n\nAs for player cards, I'm indifferent to the last Hobbit hero (Fatty, Bilbo, Rosie, Farmer Maggot?). For player cards I do hope for some cards useful in non- Hobbit decks. Support for Ranger decks has been hinted at with one previewed card, but I could also imagine a pony attachment for Dwarves (and Hobbits, of course), Daggers of Westernesse, food attachments and plenty of Event cards for general use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829632","commentId":829632,"userName":"Gizlivadi","timestamp":1375461186,"content":"Regarding Bombadil, I think that the general consensus and an accurate speculation is that we're not gonna see him here, as well as the Old Forest, Barrow-downs, etc. What I think will happen in the future is that in a possible \"Eriador\" cycle we'll see him in an adventure pack and he'll be an objective, and possibly in the far future we'll have him as an ally. That's my take on it, and I hope I'm wrong because this is the perfect expansion for him but I don't think we'll see him for a long while.\n\nEdited August 2, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829693","commentId":829693,"userName":"Cunir","timestamp":1375464325,"content":"my big wish is just for a load of named locations -- the same ones that we visit in the book. i'd much rather visit the old forest than just any old generic forest location. i want to see hobbiton, bree and the prancing pony, farmer maggots farm, bombadil's house... then it will feel like we are really playing the book\n\n \n\ni hope they don't put a load of enemies in where there are none in the book, either. i play LOTROnline and they've got a load of goblins and orcs just a short walk from hobbiton. i hope FFG don't do something like that. \n\nEdited August 2, 2013 by Cunir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829720","commentId":829720,"userName":"lleimmoen","timestamp":1375466277,"content":"> Regarding Bombadil, I think that the general consensus and an accurate speculation is that we're not gonna see him here, as well as the Old Forest, Barrow-downs, etc. What I think will happen in the future is that in a possible \"Eriador\" cycle we'll see him in an adventure pack and he'll be an objective, and possibly in the far future we'll have him as an ally. That's my take on it, and I hope I'm wrong because this is the perfect expansion for him but I don't think we'll see him for a long while.\n\nYeah, I really fear you're right, and hope so much you're wrong. Because really, they shouldn't come up with the logic crap that Bombadil doesn't go wandering Middle-earth. He's much more likely to wander through it (and he probably has done) than Eagles flying into Moria. No excuse ffg, I know it is hard to design but please, please, pretty please, give us Bombadil and Goldberry.\n\n \n\nAre you up for a petition Richard?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829752","commentId":829752,"userName":"Gizlivadi","timestamp":1375468386,"content":"Actually, I would sign or help to redact a petition but Black Riders was designed and completed long ago, and I fear it's too late to do anything :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=829795","commentId":829795,"userName":"richsabre","timestamp":1375471221,"content":"> Are you up for a petition Richard?\n> \n>  \n\nsure- but i think 1 petition from me is enough for this game...i dont want to gain a reputation as an upstart haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=830968","commentId":830968,"userName":"DurinIII","timestamp":1375629583,"content":"I think we WILL actually see Bombadil, Old Forest and Barrow-Downs in this first Black Rider saga set. I reason this because the set is called \"Black Riders.\" To me, this means the entire point of the set is to highlight the journey out of the shire while being chased by the Nine. Nate French has so far been extremely sympathetic towards the books' plot in the creation of this game. I see the quests looking something like this:\n\n \n\nQuest 1: \"Escape from the shire\" -This is where Bombadil, Old Forest and Barrow Downs would come in. We wouldn't be fighting Black Riders in this quest just yet, but certain treachery cards would bear their impending doom upon us. \n\n \n\nQuest 2: \"Safely to Bree\" (Or something to this affect). Aragorn is an objective type of ally in this scenario who joins the companions. Weathertop is stage 3 of this Quest.\n\n \n\nQuest 3: \"Flight to the Ford\" -We have to make it to Rivendell in this one. The Black Riders come on strong.\n\n \n\nWell, this is my wishful guessing of what to expect! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831040","commentId":831040,"userName":"Gizlivadi","timestamp":1375637836,"content":"Something I was very dissapointed with in the preview is that The One Ring, the focus of the entire story and one of the most powerful artifacts in Middle Earth, does absolutely nothing. The only thing it does is have some rules written on it, but no actual ability or any kind of ingerence in the game. You could pretty much ignore it and nothing would be lost. Bullsh*t. At least give it a stat booster or ANYTHING. But no, it's just some rules everybody's gonna remember anyway and nothing else.\n\nEdited August 4, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831048","commentId":831048,"userName":"lleimmoen","timestamp":1375638553,"content":"Yeah, it's not impossible to still include the Old Forest and Barrow-downs. The reason for the detour was after the Black Riders. And even Bombadil mentions them. It is not like the story doesn't move ahead in those three chapters, though it does certainly move around a bit. However, having done all of that in quest one (of the three) would mean we will have done eight chapters in one quest, leaving four for the other two (I know the chapter count doesn't always count and the first two chapters will be represented only very slightly, probably)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831053","commentId":831053,"userName":"Gizlivadi","timestamp":1375638858,"content":"> I think we WILL actually see Bombadil, Old Forest and Barrow-Downs in this first Black Rider saga set. I reason this because the set is called \"Black Riders.\" To me, this means the entire point of the set is to highlight the journey out of the shire while being chased by the Nine. Nate French has so far been extremely sympathetic towards the books' plot in the creation of this game. I see the quests looking something like this:\n> \n>  \n> \n> Quest 1: \"Escape from the shire\" -This is where Bombadil, Old Forest and Barrow Downs would come in. We wouldn't be fighting Black Riders in this quest just yet, but certain treachery cards would bear their impending doom upon us. \n> \n>  \n> \n> Quest 2: \"Safely to Bree\" (Or something to this affect). Aragorn is an objective type of ally in this scenario who joins the companions. Weathertop is stage 3 of this Quest.\n> \n>  \n> \n> Quest 3: \"Flight to the Ford\" -We have to make it to Rivendell in this one. The Black Riders come on strong.\n> \n>  \n> \n> Well, this is my wishful guessing of what to expect! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI kinda like this setup except that we know for a fact that Gildor is gonna be in the first scenario, and that means the focus will be the Black Riders as well. The other two are very likely to be like that, but honestly the last thing I would want to see is more objectives, ESPECIALLY an Aragorn objective. No need for that at all, objectives should be a last resort device. My guess is that he's gonna be an ally card in the pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831136","commentId":831136,"userName":"Pharmboys2013","timestamp":1375647285,"content":"> Something I was very dissapointed with in the preview is that The One Ring, the focus of the entire story and one of the most powerful artifacts in Middle Earth, does absolutely nothing. The only thing it does is have some rules written on it, but no actual ability or any kind of ingerence in the game. You could pretty much ignore it and nothing would be lost. Bullsh*t. At least give it a stat booster or ANYTHING. But no, it's just some rules everybody's gonna remember anyway and nothing else.\n\nI get what you mean, but at the same time it's not really used in the books either. Correct me if I'm wrong but I think the only two times its used throughout the course of the stories is by Frodo at weather top and by Sam shortly after the encounter with Shelob and Frodo is taken away. It wouldn't be that faithful if the card effect had some powerful ability whenever it was never used as a weapon in the books. We know its important and the gravity it lends to the quests and that's fine enough I think"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831141","commentId":831141,"userName":"Gizlivadi","timestamp":1375648207,"content":">  \n> \n> > Something I was very dissapointed with in the preview is that The One Ring, the focus of the entire story and one of the most powerful artifacts in Middle Earth, does absolutely nothing. The only thing it does is have some rules written on it, but no actual ability or any kind of ingerence in the game. You could pretty much ignore it and nothing would be lost. Bullsh*t. At least give it a stat booster or ANYTHING. But no, it's just some rules everybody's gonna remember anyway and nothing else.\n> \n> I get what you mean, but at the same time it's not really used in the books either. Correct me if I'm wrong but I think the only two times its used throughout the course of the stories is by Frodo at weather top and by Sam shortly after the encounter with Shelob and Frodo is taken away. It wouldn't be that faithful if the card effect had some powerful ability whenever it was never used as a weapon in the books. We know its important and the gravity it lends to the quests and that's fine enough I think\n> \n>  \n\n \n\nI also get what you mean, but what I was thinking about is that they should have given the ability Frodo has to the One Ring. It makes a lot more sense, and in the case they want to expand and possibly make other ring bearer heroes, they can keep the ability the One Ring gives (that is, exhausting it to become \"invisible\" and replace the encounter card) in the ring itself to allow for more compatibility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831194","commentId":831194,"userName":"Pharmboys2013","timestamp":1375654689,"content":"I can see the logic in that; fair enough"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831271","commentId":831271,"userName":"DurinIII","timestamp":1375663556,"content":"Good points all! Hey rich, my reasoning of including so much in one quest is based on the fact that they did just that in the Hobbit Saga sets. There are a mere 6 quests from the start of the book to the very end. One could easily argue that the Hobbit story could have been stretched far beyond 6 quests, however, seeing as how the LOTRs is far more of an intricate and developed story you may be right!\n\n \n\nI am so exited to see the main story come to life!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=831547","commentId":831547,"userName":"Eryx_UK","timestamp":1375710966,"content":"The barrow downs is one of my favourite parts of the story, so I really want to see that part of the story in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87580-what-do-you-want-from-the-black-riders/?do=findComment&comment=832632","commentId":832632,"userName":"Nickpes","timestamp":1375810372,"content":"Well ... here we can get a glimpse of what to expect \n\n \n\nhttp://www.fantasyflightgames.com/edge_news.asp?eidn=4286 [http://www.fantasyflightgames.com/edge_news.asp?eidn=4286]"}]}