{"url":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/","title":"Lack of Gondor Synergy","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=828874","commentId":828874,"userName":"Dain Ironfoot","timestamp":1375383216,"content":"So, I've been doing some thinking.\n\n \n\nFrom the announcement article: \"Its 165 new cards (three copies of each of player card) transport players to the realm of Gondor, where new heroes and allies stand firm against the armies of Mordor in thrilling battles, sieges, and three new scenarios!\" \n\n \n\n\"Heirs of Númenor gives you the opportunity to command some of Middle-earth’s greatest heroes in a region at war against the forces of evil.\"\n\n \n\n\"As with the game’s first deluxe expansion, Khazad-dûm [http://www.fantasyflightgames.com/edge_npm.asp?eidm=103], Heirs of Númenor transports The Lord of the Rings: The Card Game to a new region...\"\n\n \n\nI've been wondering if cycles really focus on traits or if they are simply a region to play in. In other words, the Dwarrowdelf cycle didn't give us a single Dwarf hero and many of the cards weren't Dwarf specfic (though, of course, some were)...\n\n \n\nSimilarly, Mirkwood, if anything, should have been elves but it was more eagles than anything.\n\n \n\nBut, then there is this from The Steward's Fear announcement article...\n\n \n\n\"That leads us to one of the other design goals for the cycle: to give players the cards they need to build strong Gondor decks. In the same way that the Dwarrowdelf [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=2&esum=196] cycle focused around Dwarves, the player cards in the Against the Shadow cycle center around Gondor and her allies. Each of the other traits in the game receives some attention, but most of the player cards are meant to bolster the Gondor trait.\"\n\n \n\nSo, I am somewhat confused. I was beginning to believe cycles are simply representing regions and aren't meant to build up a particular trait from that region - but this blurb from Caleb seems to suggest otherwise.\n\n \n\nWith the 4th AP now spoiled, however, there is next to no Gondor synergy in the game and I doubt the final two APs can really deliver.\n\n \n\nI don't know if it's a bad thing, per se, but the previous quote really did set expectations that - at this point with 2 APs to go - hasn't really been met.\n\n \n\nThoughts?\n\nEdited August 1, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=828883","commentId":828883,"userName":"rekath16","timestamp":1375384251,"content":"It's exactly what I posted 5 minutes ago in other thread. I am very disappointed about this and hard to understand...\n\n \n\nIn addition: Why should we use Boromir Leadership when are not even 3 (!) Gondor allys with more than one (!) attack = Damrod + Ithilien-Archer? I use him in a deck nevertheless but he could become a lot more interesting if we had more Gondor allys with >1 attack. :-(\n\nEdited August 1, 2013 by rekath16"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=828899","commentId":828899,"userName":"lleimmoen","timestamp":1375385283,"content":"I'd never complain about not getting enough Dwarves though, we've gotten crazy enough of them (I'll upload the hero count in a minute). The lack of Gondor synergies is more and more striking. Exactly, Leadership Boromir seems like a laugh, whilst we're getting more and more ways to improve the Outlands. At least we got Morthond's Sword this time - to boost a single Gondorian ally into an Outlands status (not that it makes much sense).\n\n \n\nSo yeah, good thread, don't know what else to say. I hope we still see some before the cycle's over but one attachment giving Gondor characters +1 willpower is not going to be enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=828909","commentId":828909,"userName":"richsabre","timestamp":1375386158,"content":"i think this is something that is due to the games young age. from the core set and in the first cycle or two it appears as if we got a vast range of traits, characters and races.\n\nas we run out of those traits, characters and races i think cycles will focus ever more specifically upon the regions in which they are set....this makes sense to me as the designers will need to do this to squeeze every last drop out of the game..which i hope they do\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=828910","commentId":828910,"userName":"Dain Ironfoot","timestamp":1375386175,"content":"> I'd never complain about not getting enough Dwarves though, we've gotten crazy enough of them (I'll upload the hero count in a minute).\n\nwhat i am saying is that Dwarrowdelf cycle didn't give us many dwarves (the hobbit boxes really did that). it's not the the dwarrowdelf cycle didn't develop the dwarves - it did - but i think the hobbit boxes, khazad dum, and Dain really did that more than the cycle proper."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=828986","commentId":828986,"userName":"Gizlivadi","timestamp":1375391717,"content":"But this cycle's supposed to give us plenty of Gondor. I think Outlands have had enough; what I want is good, potent Leadership gondor allies to make Leadership a viable sphere for this trait (unlike Lore and the rangers, which I think have been developing really good, and now with faramir and anborn I can see ithilien rangers decks)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829016","commentId":829016,"userName":"Dain Ironfoot","timestamp":1375392631,"content":"> But this cycle's supposed to give us plenty of Gondor.\n\n \n\nsure, but what i'm pointing out is: were we all assuming this to be the case? it's clearly not been in the first four packs. are the final two APs really enough to develop the Gondor trait when we only get 4 more cards per sphere and we know Theoden is still one of the heroes to go?\n\n \n\nthat's why I'm posing the question as to whether we shouldn't expect cycles to focus on the traits most likely associated with them (i.e. we are simply visiting a place on a map - not getting characters from that region) - we certainly haven't this cycle.\n\nEdited August 1, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829022","commentId":829022,"userName":"Gizlivadi","timestamp":1375392939,"content":"It certainly would not surprise me if we didn't get enough Gondor this cycle, but it would surely dissapoint me. Well, at least you have to keep in mind that outlands became one of the best archetypes with only one pack, and they could be saving the best stuff for Gondor for the last packs (I hope so)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829049","commentId":829049,"userName":"Morithain","timestamp":1375394689,"content":"Don't forget, though, that anyone who gets the Steward of Gondor gains the Gondor trait--probably may help some of the synergy problems with Gondor cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829067","commentId":829067,"userName":"Samwise Gamgee","timestamp":1375396134,"content":"> But this cycle's supposed to give us plenty of Gondor. I think Outlands have had enough; what I want is good, potent Leadership gondor allies to make Leadership a viable sphere for this trait (unlike Lore and the rangers, which I think have been developing really good, and now with faramir and anborn I can see ithilien rangers decks)\n\n \n\nI agree. There is a great trait that everyone wants and expects to be developed in Gondor, but it seems they went off on a tangent with the Outlanders. That was all well and good, but it is now time to get down to business.  \n\n \n\nBut maybe they are saving stuff for the Saga expansions..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829077","commentId":829077,"userName":"rekath16","timestamp":1375396931,"content":"So far, the Gondor-cycle is a disappointment for me. Unfortunately. Not the quests, but the playercards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829145","commentId":829145,"userName":"Tyberius_Deangelo","timestamp":1375406761,"content":"I, too, have been disappointed in the progress of developing the Gondor-trait.  I mainly play solo now and, in my opinion,  Gondor is completely unplayable solo.  Their quest power is weak and I died by threat in my first attempt to play them in a solo game.  On the other hand, the deck did really well in attack and defense.  I wish the designers would do something about the willpower of the Gondor heroes.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829196","commentId":829196,"userName":"Ellareth","timestamp":1375414481,"content":"Agreed.\n\n \n\nThematically being Outlanders are same as being Gondorian, just like you may live outside of Ontario or Quebec but still be Canadian if you live in prairies or Rockies or East Coasts.\n\n \n\nBut at the same time, they have chosen to divide up Outlands trait from Gondor trait to a point there are more synergies between Rohan&Gondor or Dunedain&Gondor than Outlands&Gondor at this point. I was really hoping for cards that would make Gondor hero based decks to become powerhouse, but so far that wasn't the case; Denethor ally and spoiled Palantir cards are perhaps biggest let down for me.\n\n \n\nHaving said that, Outlands went from nobody to powerhouse in a single pack.\n\nGondor already have some synergies, so hopefully 2 packs are indeed enough to interact with existing card pools and make Gondor a powerful trait.\n\n \n\n...... although I'm starting to get a feel that Gondor decks are not meant for solo plays but for defending against enemies and siege questing during multiplayer games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829198","commentId":829198,"userName":"Pharmboys2013","timestamp":1375414612,"content":"Holding out a lot of hope in these last two APs. There's been decent enough cards for Gondor but nothing that really helps glue the trait together aside from Boromir's thus far mediocre ability and visionary leadership which isn't released yet. A few more cards that actually assist the Gondor trait rather than just having it will go a long way"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829201","commentId":829201,"userName":"Gizlivadi","timestamp":1375414734,"content":"Hoping the same here too- not just wimpy splashy gondor allies but some SYNERGY within the trait."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829211","commentId":829211,"userName":"Ithilien Ranger","timestamp":1375415927,"content":"I'm also hoping for more interesting synergy. Let's have a look at what we know from the last packs (bold = Gondor-related):\n\n \n\nHeroes: UNKNOWN, Theoden (Tactics booster)\n\n \n\nLore: Scroll of Isildur (same as the other 'former Kings of Gondor' attachments), Anborn (ally, Ranger), TWO UNKNOWN\n\n \n\nLeadership: Book of Atanatar (see above; sorry Glaurung ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ), Visionary Leadership (boost to Gondor allies), TWO UNKNOWN\n\n \n\nSpirit: unknown ally (cost 3, female, 1 WP), Steed of the Mark (Gondor synergy), TWO UNKNOWN\n\n \n\nTactics: The Hammer-stroke (event, not related to Gondor trait), THREE UNKNOWN\n\n \n\nNeutral: TWO UNKNOWN\n\n \n\nThat means two attachments will come into play that have a nice synergy. One is a flat stat booster, but the Steed of the Mark looks interesting - at least in multiplayer games. Solo players may find it difficult to find access to Spirit and sufficient resources with Gondor decks.\n\n \n\nThere are still plenty of unspoiled cards, and all it takes are two or three cards focussing on interaction between Gondor cards, so I haven't lost hope, yet.\n\n \n\nAs for speculation, I have no idea whom to expect for the final hero. I'm hoping for a Spirit Gondor Hero, so that I have an option to non- Tolkien Eleanor. Whatever it is, please no Outlands.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  \n\n \n\nI think that one card will be Mablung (wouldn't mind a Spirit Ranger Hero but expect an ally). Others? No idea. What I hope from Tactics is one Weapon and one Armour piece (a sword and a helmet, perhaps). \n\n \n\nNo matter what, I'm incredibly happy with this cycle so far since I wouldn't have dreamt of being able to assemble a Ranger deck under Faramir's lead when I first purchased Heirs of Numenor from my FLGS."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829219","commentId":829219,"userName":"Pharmboys2013","timestamp":1375417041,"content":"Good point on the last hero, prior to today's Faramir spoiler I would have bet money it would have been a spirit mono booster but now all bets are off the table, in regards to sphere or effect....which is exciting :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829229","commentId":829229,"userName":"klaymen_sk","timestamp":1375418696,"content":"Yup, I'm saying the whole time - we were supposed to get Gondor, we got Outlands instead. But at least we have a crapload of Dwarves, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829244","commentId":829244,"userName":"lleimmoen","timestamp":1375421932,"content":"I find the best development for a trait is by card draw. It was just when Ori and Legacy of Durin (and later with King Under the Mountain) were out that Dwarves got really strong. Gondor doesn't have card draw, it has resource acceleration, but the best can be attached to anyone. So it's not going to get almost any advantage over other factions in that. I'm afraid the strongest Gondor decks (at least when this cycle is over) will be those with Outlands. Now we have a card to make a Gondor ally strong, it is just one card. If we get a card that makes Outlands (all of them) Gondor, then at least Boromir can boost them all, which would be a help. But it's taking a long way round. And I'm sorry to bring the theme into it but Gondor (the high blood) should have the upper hand - at least in some areas - over her fiefs.\n\nEdited August 2, 2013 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829253","commentId":829253,"userName":"Gizlivadi","timestamp":1375423125,"content":"I agree that the differentiation between Gondor and Outlands is very weird. What is Gondor supposed to represent if it includes the Outlands? But the worst is that Outlands are so much better than the \"mainland\". "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829377","commentId":829377,"userName":"leptokurt","timestamp":1375440465,"content":"Pehaps the developers realized that they overpowered the dwarves and didn't want to make the same mistake again? I am ok with what they have done with the Gondor trait so far. We got more resource generating cards, Gondor has a wide variety of defense synergies and the new Boromir solves any problems that one player should have when attacking enemies. I hope we will get some more cards during the remaining adventure sets."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=829413","commentId":829413,"userName":"Nickpes","timestamp":1375445668,"content":">  If we get a card that makes Outlands (all of them) Gondor, then at least Boromir can boost them all, which would be a help. But it's taking a long way round. \n\nIn that case, the Outlanders (who are unexplainably strong anyway) would be unbeatable, that would be no fun, it would make no sense. I thought it too but that would make them stornger than the Vala themselves\n\n \n\n>  \n> \n> And I'm sorry to bring the theme into it but Gondor (the high blood) should have the upper hand - at least in some areas - over her fiefs.\n> \n>  \n\n \n\nI could not agree more "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=831894","commentId":831894,"userName":"Mr Coffee","timestamp":1375735116,"content":"While the current lack of a decent Gondor synergy is a bit of a letdown for this cycle, it will get better.  Really, a lot of the dwarven \"finishing touches\" really came in the Hobbit boxed sets (although the Dwarrodelf did have shome potent choice cards).\n\n \n\nI'm not so bothered by the current lack of synergy for Gondor (like I said, it will come) as I am that there was an EXPECTATION created by some of the published comments that led to us believing we would be getting more Gondorian love than what we have so far.\n\n \n\n\"Expectations are resentments waiting to happen.\"\n\n \n\n:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\nEdited August 5, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=831960","commentId":831960,"userName":"Thanatopsis","timestamp":1375741185,"content":"Here are some quick numbers:\n\na player card word search of \"gondor\" at lotrlcg.com yielded 32 results\n\nThe five gondor cards from the newest AP make it 37\n\n \n\na player card word search of \"dwarf\" yielded 50 results\n\n \n\nThat's a 13 card difference with gondor synergy being two APs and two saga expansions behind. If we can expect 8 or so cards helping gondor in the last two APs, that's only a five card difference.  Not too bad\n\n \n\nOf course there are a lot of good cards that don't have the word 'dwarf' or 'gondor' written on them that have good synergy:\n\nspear of the citadel, all traps, ranger bow, cram, a very good tale, etc. This makes the direct number comparison a little tricky.\n\n \n\nIt might also be a matter of timing. I didn't start playing until almost the end of dwarrowdelf, but I imagine that Dain was sort of the flagship dwarf that everyone used and then more dwarves just kept coming. For gondor, there is no such flagship hero, maybe leadership boromir, but he is not as obvious a choice as Dain is.  The synergy for gondor will most likely not be known until the end of the cycle while the synergy for dwarves was established early on by Dain"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832006","commentId":832006,"userName":"hildargo","timestamp":1375743823,"content":">  \n> \n> It might also be a matter of timing. I didn't start playing until almost the end of dwarrowdelf, but I imagine that Dain was sort of the flagship dwarf that everyone used and then more dwarves just kept coming. For gondor, there is no such flagship hero, maybe leadership boromir, but he is not as obvious a choice as Dain is.  The synergy for gondor will most likely not be known until the end of the cycle while the synergy for dwarves was established early on by Dain\n\nI think this is the issue. There isn't that \"glue\" card yet for Gondor. There are a couple of cards that play off the Gondor keyword, but nothing like the myriad ways that Dwarves or Outlands do. In my opinion, we are going to have to wait for the Return of the King Saga Expansion to finally see some sort of cohesion. I know this has been mentioned before, but I think it still warrants saying that this game is relatively young, and the card pool is still relatively small compared to other games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832012","commentId":832012,"userName":"Gizlivadi","timestamp":1375744846,"content":">  \n> \n> I'm not so bothered by the current lack of synergy for Gondor (like I said, it will come) as I am that there was an EXPECTATION created by some of the published comments that led to us believing we would be getting more Gondorian love than what we have so far.\n> \n>  \n\n \n\nWait, what? The expectation for more Gondor synergy was not created by user comments posted in the forum as you say. It was PROMISED in the preview articles published by FFG themselves in this page. It was not something invented here that \"led us to believe\" there would be more Gondor synergy. Don't blame the customers like you for the \"mistakes\" the company has made.\n\n \n\nThat said, I do believe (or rather hope) that we will actually see more Gondor synergy and I think we'll have more potent cards in the last two packs that will allow for some very good Gondor decks.\n\nEdited August 5, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832015","commentId":832015,"userName":"Gizlivadi","timestamp":1375745232,"content":"> Here are some quick numbers:\n> \n> a player card word search of \"gondor\" at lotrlcg.com yielded 32 results\n> \n> The five gondor cards from the newest AP make it 37\n> \n>  \n> \n> a player card word search of \"dwarf\" yielded 50 results\n> \n>  \n> \n> That's a 13 card difference with gondor synergy being two APs and two saga expansions behind. If we can expect 8 or so cards helping gondor in the last two APs, that's only a five card difference.  Not too bad\n> \n>  \n\n \n\nThe fact that there are many (and there will be more) cards with the Gondor keyword does not equal Gondor synergy. In fact if we look at the last player cards in the packs there are lots of new Gondor allies and cards that have the trait, but they do not work together in any way. How do they expect us to make Gondor decks when they print Leadership Boromir and then Knight of Minas Tirith that only works with 3 Tactics heroes? Or you could just compare Denethor, a unique Gondor ally, with, say, the ally version of Glóin. Denethor does nothing having to do with Gondor, while Glóin benefits the players for having many Dwarf cards. That's the difference between these two traits. Dwarves actually work together mechanically, Gondor does not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832038","commentId":832038,"userName":"Dain Ironfoot","timestamp":1375747410,"content":">  \n> \n> > Here are some quick numbers:\n> > \n> > a player card word search of \"gondor\" at lotrlcg.com yielded 32 results\n> > \n> > The five gondor cards from the newest AP make it 37\n> > \n> >  \n> > \n> > a player card word search of \"dwarf\" yielded 50 results\n> > \n> >  \n> > \n> > That's a 13 card difference with gondor synergy being two APs and two saga expansions behind. If we can expect 8 or so cards helping gondor in the last two APs, that's only a five card difference.  Not too bad\n> > \n> >  \n> \n>  \n> \n> The fact that there are many (and there will be more) cards with the Gondor keyword does not equal Gondor synergy. In fact if we look at the last player cards in the packs there are lots of new Gondor allies and cards that have the trait, but they do not work together in any way. How do they expect us to make Gondor decks when they print Leadership Boromir and then Knight of Minas Tirith that only works with 3 Tactics heroes? Or you could just compare Denethor, a unique Gondor ally, with, say, the ally version of Glóin. Denethor does nothing having to do with Gondor, while Glóin benefits the players for having many Dwarf cards. That's the difference between these two traits. Dwarves actually work together mechanically, Gondor does not.\n> \n>  \n\nthis!\n\n \n\njust b/c a card says a certain trait, doesn't mean it gels with cards of the same trait.\n\n \n\nand i really don't expect to see anything that really gels a gondor deck in the next two packs (only 4 more cards per sphere left to go). but, maybe i'll be wrong..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832041","commentId":832041,"userName":"Mr Coffee","timestamp":1375747585,"content":">  \n> \n> >  \n> > \n> > I'm not so bothered by the current lack of synergy for Gondor (like I said, it will come) as I am that there was an EXPECTATION created by some of the published comments that led to us believing we would be getting more Gondorian love than what we have so far.\n> > \n> >  \n> \n>  \n> \n> Wait, what? The expectation for more Gondor synergy was not created by user comments posted in the forum as you say. It was PROMISED in the preview articles published by FFG themselves in this page. It was not something invented here that \"led us to believe\" there would be more Gondor synergy. Don't blame the customers like you for the \"mistakes\" the company has made.\n> \n>  \n> \n> That said, I do believe (or rather hope) that we will actually see more Gondor synergy and I think we'll have more potent cards in the last two packs that will allow for some very good Gondor decks.\n> \n>  \n\n \n\nUmmm... I didn't say \"user\" comments.  I was referring to the comments PUBLISHED by FFG.  The ones that were already quoted in the thread.  We're saying the same thing.  You are just reading my previous post with the wrong interpretation.\n\n \n\nAs for the \"numbers\" of the vaious races/groups.  While Gondor may have plenty of cards, they just aren't as... unifying... as the Dwarven cards are.  We're all familiar with Dain (even if he is overpowered), of course, but there a plenty more cards that provide wide-ranging boosts for the dwarves that Gondorians just can't touch.  It seems like many of the Gondorian related cards are very specific or small in theme.  Adding a resource token here or there.  And the reality of it is that the vast majority of the cards with the Gondor trait are allies or heroes.  Only a small handful of attachments and events.  And as was mentioned above, not any real \"glue cards\" that really make it worth stocking your deck with a Gondorian horde.  Where's the Legacy of Durin, King Under the Mountain, Durin's Song, Hardy Leadership, etc for Gondor?  Blood of Numenor, Steward of Gondor, Gondorian Shield, and Behind Strong Walls are nice cards... but don't really require a Gondorian deck, and are all very specific to the character they are played on.  About the best universal \"glue card\" they have (other than Tactics Boromir) is For Gondor, an event that grants them all an extra point of defense.  And THAT card was from all the way back in the core set.\n\n \n\nIt's hard to look at the raw numbers as being an objective way to compare the two groups (dwarves and Gondorians)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832073","commentId":832073,"userName":"Gizlivadi","timestamp":1375751488,"content":">  \n> \n> Ummm... I didn't say \"user\" comments.  I was referring to the comments PUBLISHED by FFG.  The ones that were already quoted in the thread.  We're saying the same thing.  You are just reading my previous post with the wrong interpretation.\n> \n>  \n> \n>  \n> \n>  \n\n \n\nAh, ok then. You can't blame me though; if someone refers to \"published comments\" in a message board without any specification, anyone's common sense would make them think of user comments, as I hardly would think of published articles as \"comments\". But, ah, we're just discussing semantics.\n\nEdited August 6, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832174","commentId":832174,"userName":"Pharmboys2013","timestamp":1375762643,"content":"They probably spread themselves too thin in what they were trying to do in this cycle to really hone the Gondor trait to a satisfying degree.  Despite this being the \"gondor\" cycle FFG committed to enhancing the gondor trait along with outlands, mono-sphere, and ranger/trap deck types as well.  Thats a lot of things to try and improve with only 12 cards per sphere with the 6 adventure packs.  Not to mention Pippen and the hobbit cards from Amon Din; Pippen of which will already be ironically obsolete by the time he would have been effective at the release of the Black Riders.  It may have been helpful to have that hero slot open to try and assist one of the many themes they're pushing.\n\n \n\nAs a result of this all these goals they're trying to accomplish, the player cards themselves are this blend of traits/styles that would have been better if they stood alone. The most grievious examples of which are Lord of Morthond and Knight of Minas Tirith.  Lord of Morthond is obviously only useful for outlands but the leadership hero restriction seems either tacked on or just so it wouldnt be overpowered when combined with lore characters (which they dont evidently seem concerned with overpowering them).  The Knight of Minas Tirith has a great effect and was just what Gondor decks could have used....but his ability is only active in mono-tactics which is a bummer because aside from Beregond and his defensive toys, most of the good Gondor cards are leadership especially the character whom is supposed to tie them all together, Boromir.  If the Knight's ability was changed to be either all tactics OR all gondor heroes than it would be fantastic.  \n\n \n\nits no surprise that the AP with the best mix of player cards was the Stewards Fear.  Each card had a defined niche.  All the outland cards created really the outland archetype.  Gondorian Shield was a fantastic attachment to any Gondor Hero not just Beregond.  Mithrandir's advice is a really good card mono-lore.  Good Harvest and Gaining Strength are all useful cards in their own right and dont try to assimilate into an archetype for the sake of doing it.  Barahir's ring was soley ment for Aragorn enthusiasts.\n\n \n\nIf in these last two packs they can focus on having each individual card accomplish one individual goal than by the end of the cycle it will be a lot better \n\nEdited August 6, 2013 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832177","commentId":832177,"userName":"Gizlivadi","timestamp":1375763230,"content":"I agree completely Pharmboys, that was a great post. I also think that they're trying to do too much in this cycle, and yeah, hobbits were completely unnecesary here. And it's not like I don't trust FFG anymore, it's just that my faith in their design choices has decreased greatly since I started playing this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832197","commentId":832197,"userName":"danpoage","timestamp":1375767871,"content":"I absolutely agree. What is all the more frustrating to me, is that instead of getting Gondor cards with interesting synergies, that open up multiple deck archetypes (like Dwarves do), we get Outlands, which has essentially one way to build and play decks (allies, allies, and more allies). On the one hand, I think this is good because before Outlands, there was realistically no other way that a new player would be beating scenarios like Into Ithilien or Siege of Cair Andros without going back and buying a ton of cards. So having one AP to throw a bone to new players makes all kinds of sense.\n\n \n\nBut why does each AP have more and more help for Outlands? To make matter worse, cards like Lord of Morthond that ostensibly boost Gondor can't really be used effectively in any non-Outlands decks - it might was well have been Outlands only. Where are the interesting synergies with different Gondor cards? The more that I try to build a ranger deck with Faramir, the more that I realize how anemic this trait is. The abilities don't particularly work together, and playing the Gondor heroes together gives you such a high starting threat that you pretty much have to draw Sneak Attack + Gandalf in the first few rounds to stand a chance. Leadership Boromir is starting to look like a waste of a card; trying to build around him basically forces you to run mostly sub-optimal, or overly-expensive allies. Of all of the Gondor archetypes, the only one that I consider quality at this point is Beregond + Spear of the Citadel + Behind Strong Walls + Gondorian Shield, and we had 3/4 of that combo straight out of the HoN box!\n\n \n\nTo be fair, I am really liking some of the new cards: Gondorian Shield is amazing, Mirlonde is very underrated, and people will come to realize that cards like Silvan Refugee are game-changing. But it definitely seems odd to me that seemingly 80% of the quality cards in this cycle have only the most tenuous connection to Gondor. I wish they would have made a Thorongil (Tactics) version of Aragorn and really gone down that road, especially since they are not bound to the timelines of the War of the Ring so they get more design freedom going into back-story. Instead I could play Outlands where half the deck is built before I even pick my other two heroes. My sincere hope is that the next cycle provides the vindication for Gondor, because I really wanted HoN + Against the Shadow to do just that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832255","commentId":832255,"userName":"Ithilien Ranger","timestamp":1375779729,"content":"Pippin should have been Mablung. Same stats, same ability, just replace \"Hobbit\" with \"Ranger\", and you have a thematic Secrecy deck with Mablung and Faramir (or Aragorn). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=832683","commentId":832683,"userName":"Rapier1","timestamp":1375813052,"content":"> Pehaps the developers realized that they overpowered the dwarves and didn't want to make the same mistake again? I am ok with what they have done with the Gondor trait so far. We got more resource generating cards, Gondor has a wide variety of defense synergies and the new Boromir solves any problems that one player should have when attacking enemies. I hope we will get some more cards during the remaining adventure sets.\n\n \n\nI feel that the mistake of not splitting the dwarf trait up will haunt this game for it's entire life. (I would have preferred to see at least Erabor and Grey Mountain traits for the two major dwarven factions personally). \n\nIt wouldn't necessarily have been a mistake either if other races hadn't been split but;\n\n \n\nElves are split between Sylvan and Noldar (with a 3rd elf type not included; which I think will prove to be a mistake if the game goes on long enough).\n\nHumans are split between Rohan, Beorning, Dale, Gondor, (and now Outlands) - this is fine because these nations are very distinct. Although I personally think Outlands might have been better tied to Gondor (but it may be that the outlands \"slither\" theme works best if you create it from scratch - adding it into Gondor would have been ridiculously overpowered).\n\nDwarfs aren't split.\n\nHobbits aren't split (however they're a far smaller \"nation\" and have far fewer characters to draw on than the other three).\n\n \n\nThe dwarfs are always going to have an amazing card pool compared to the rest because of this decision and people will always compare to the dwarfs for power. \n\nAnother mistake in the design of the dwarfs was letting them get multiple facets to their trait (before most factions got any). Specifically I'm talking about the fact that dwarfs were developed in a certain direction (around Dain primarily) and then to make the saga expansions (that had to be all about dwarfs) varied they then had to develop the complimentary feature about having 5 dwarfs - if Dwarf have been split in two (or three) this could have been split the power for the saga between two or three traits, or the saga could even have focused on a new dwarf trait (Thorin's Company could have been it's own trait for example). \n\n \n\nThe fact that it's all locked into one trait is the real problem; dwarfs can basically do everything and it sets the benchmark incredibly high - higher I think than other traits are likely to reach.\n\n \n\n \n\nThe final mistake is just one from the game being new - Dain is amazing and too good. Leadership Boromir has a much better balanced take on the same concept (+1 attack instead of +1 attack and +1 spirit - needing a resource instead of being ready, but allies only instead of all) Leadership Boromir is good; but Dain shows him up massively.\n\n \n\nMeanwhile the best powerhouse gondor card, steward of gondor - instead allows anyone to become Gondor. (Which does have the potential to be amazing if they make the synergy too good, since it lets the Gondor theme be far more flexible) but also means that you don't really need to pick Gondor heroes at all, and the best parts of steward of Gondor are therefore available to anyone. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=833011","commentId":833011,"userName":"Pharmboys2013","timestamp":1375838953,"content":"rapier: good reasoning with the dwarfs\n\n \n\nI think this is why to the malign of some players that the outlands and gondor traits were seperated.  They had a concept they really wanted to do with the fiefs of gondor but would have made a single trait overly powerful creating another dwarf situation.  Then again the outlands are a top tier deck now so i'm not sure how well that panned out, but imagine if they were outlands and gondor!  Hopefully we will just get a few more cards to gel Gondor over a bit so its better than it is currently\n\n \n\nAs for their potential regret with dwarf design i think their remedy is just going to be ignoring dwarves for a while.  Long enough that the inevitable power creep and expansions of card pools will create other really strong factions and no one will really care about dwarves anymore.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=833033","commentId":833033,"userName":"Dain Ironfoot","timestamp":1375841143,"content":"it might be worth adding that the cards were already designed by the time the current designers came on board:\n\n \n\n\"When I [Caleb Grace] started working on the Against the Shadow cycle, most of the initial design had already been done by Lukas Litzsinger and Nate French, who were working with a story crafted by the company’s CEO, Christian Petersen. My role in this collaboration was to develop all of those designs and ideas into a finished product. It was a fun challenge, and I’m proud of the set that we’ve created together. I think fans of the game are going to love each installment in this cycle.\"\n\n \n\nthat's not to say Caleb didn't have some input, I'm sure he did, but these cards were all designed a long time ago (around the beginning of Dwarrowdelf, I believe) and the game has changed much since then.\n\n \n\nThe Saga Expansions - which were Caleb's - I think are much better. So, I look forward to the upcoming Sagas and a cycle that Caleb has been involved with from the beginning!\n\nEdited August 7, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=833042","commentId":833042,"userName":"Pharmboys2013","timestamp":1375841577,"content":"nice point, i think we're really going to see the pinnacle of his design process with these saga expansions.  Black Riders just looks so darn good"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=833067","commentId":833067,"userName":"danpoage","timestamp":1375844668,"content":"Absolutely. On the Doorstep in particular gives me great hope for where the Sage Expansions are heading. The Battle of Five Armies scenario is so epic and perfect, right down to having the Eagle objective ally save you at the last minute. Now that we are seeing what they can do with Saga expansions, and we know that 6 more are on the way for the Lord of the Rings, I have great optimism for the future. Who knows, maybe later sets (Siege of Osgiliath/Battle of the Pelennor Fields/Cormallen) will fill in the holes of Against the Shadow and many of these cards will be given a new life. That's certainly what I hope for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=833123","commentId":833123,"userName":"Glaurung","timestamp":1375850863,"content":"> nice point, i think we're really going to see the pinnacle of his design process with these saga expansions.  Black Riders just looks so darn good\n\nTo be honest im not sure about it. Yes art is amazing but the quests themselves.....? Will see will see i hope they ok.\n\nFrom both Hobbits box only 2 quests is interesting Riddle in the dark and Battle of the 5 armies. All others boring baby play.\n\nI hope BR will be more interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=833381","commentId":833381,"userName":"Pharmboys2013","timestamp":1375885179,"content":"Well from your perspective, I'd be surprised if they met your specific expectations. FFG can't market or design solely towards the hardcore because they don't make up a significant fraction of people buying the product. Especially with these saga expansions which seem ideal for newer players to easily climb aboard and play.\n\nI'd think maybe 1 of the 3 quests has a very high level of difficulty but to make all 3 the equivalent of a siege of cair andros would put off far more people than it would satisfy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=833776","commentId":833776,"userName":"Rapier1","timestamp":1375912853,"content":"It would be a complete mistake to market the saga expansions at that difficulty.\n\n \n\nThey've just established a tool for creating harder quests (Nightmare expansions). This tool is better than the easy mode version (take cards out) because it generates extra revenue. While I expect the saga to have standard + easy mode, I'm sure we'll see PoD nightmare saga expansions at some point in the future. (Probably in the order of the quests release - which is the current release schedule, so we might see the first half of the hobbit saga after the Darrowwelf cycle - or in 7 Nightmare expansions time :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])\n\nIts reasonable to ask the harder mode to cost more because it's more time involved (designing new content) and the hardcore players will be most willing to invest more into the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=834006","commentId":834006,"userName":"mr.thomasschmidt","timestamp":1375938418,"content":"> It would be a complete mistake to market the saga expansions at that difficulty.\n> \n>  \n> \n> They've just established a tool for creating harder quests (Nightmare expansions). This tool is better than the easy mode version (take cards out) because it generates extra revenue. While I expect the saga to have standard + easy mode, I'm sure we'll see PoD nightmare saga expansions at some point in the future. (Probably in the order of the quests release - which is the current release schedule, so we might see the first half of the hobbit saga after the Darrowwelf cycle - or in 7 Nightmare expansions time :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])\n> \n> Its reasonable to ask the harder mode to cost more because it's more time involved (designing new content) and the hardcore players will be most willing to invest more into the game.\n\nNicely put :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=835925","commentId":835925,"userName":"ana4","timestamp":1376129348,"content":">  \n> \n> > Here are some quick numbers:\n> > \n> > a player card word search of \"gondor\" at lotrlcg.com yielded 32 results\n> > \n> > The five gondor cards from the newest AP make it 37\n> > \n> >  \n> > \n> > a player card word search of \"dwarf\" yielded 50 results\n> > \n> >  \n> > \n> > That's a 13 card difference with gondor synergy being two APs and two saga expansions behind. If we can expect 8 or so cards helping gondor in the last two APs, that's only a five card difference.  Not too bad\n> > \n> >  \n> \n>  \n> \n> The fact that there are many (and there will be more) cards with the Gondor keyword does not equal Gondor synergy. In fact if we look at the last player cards in the packs there are lots of new Gondor allies and cards that have the trait, but they do not work together in any way. How do they expect us to make Gondor decks when they print Leadership Boromir and then Knight of Minas Tirith that only works with 3 Tactics heroes? Or you could just compare Denethor, a unique Gondor ally, with, say, the ally version of Glóin. Denethor does nothing having to do with Gondor, while Glóin benefits the players for having many Dwarf cards. That's the difference between these two traits. Dwarves actually work together mechanically, Gondor does not.\n> \n>  \n\nThis is obviously true. And rather sad. And I'm afraid it won't get much better when the cycle's over. Especially for Leadership Gondor decks. In the next pack we do get the Gondor willpower boost, and Tome of Atanatar (mono-Leadership booster). So then there will be one pack, two Leadership cards, left. I hope to see at least one more Gondor Leadership ally, to synergize with the beautiful Boromir hero card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=836125","commentId":836125,"userName":"Pharmboys2013","timestamp":1376151143,"content":"visionary leadership will help a lot, but like you say, at least 1 more gondor leadership ally is critical.  if they had made the knight of minas tirith leadership rather than tactics he would have been perfect.  I'm hoping we see someone who has 2-3 atk power and some kind of effect.  dont even care if he costs 4 resources, it would be a necessary addition"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=836218","commentId":836218,"userName":"Rapier1","timestamp":1376160096,"content":"> visionary leadership will help a lot, but like you say, at least 1 more gondor leadership ally is critical.  if they had made the knight of minas tirith leadership rather than tactics he would have been perfect.  I'm hoping we see someone who has 2-3 atk power and some kind of effect.  don't even care if he costs 4 resources, it would be a necessary addition\n\n \n\nI don't agree (with the knights of minas tirith part). I think that all traits should aim to be multi-sphere by default with exceptions being made for specific themed traits (Eagles only tactics makes sense to me - I'm expecting Ents not to get all 4 spheres).\n\nThe concept of the Knights of Minas Tirith is obviously tactics. I think it would be a mistake to make a card like that in any other sphere. (I'm happy to debate the logic of it requiring mono-tactics for it's response- on the other hand it's a rocking good card for 3 cost even without that). If it was leadership it would gain synergy with leadership Boromir (good for the Gondor Trait) in return for obviously buffing leadership and nerfing tactics (due to stealing a clear tactics ability associated with direct attack on the enemy) which I think would be bad for the game.\n\nWe shouldn't aspire to having better trait synergy at the expense of removing sphere distinctiveness. Having both spheres and traits to build around greatly expands choice in deck building and card design and is therefore much better for the game.\n\nIn any case Dain and Boromir both clearly gain power as number of players increase (which I happen to think is a flaw with both card designs from the point of view of balancing the game and future card design. All Gondor cards now need to be balanced assuming they get +1 attack, all dwarfs have to assume that you'll get +1 attack and +1 spirit). So you can have your cake and eat it providing you play two handed or with friends.\n\n \n\nAs for the general comment that we need more Gondor cards - honestly we always need more cards for every trait. That's the lifeblood of the game. So I would like more Gondor allies too, but not leadership cards that should have been tactics. (I would love more gondor allies to get the rule from Citadel Custodian, I really think that reflects the wealth of Gondor concept well - even though currently we lack the cards to run him well - also his lack of another rule suggests they think this is too strong to be a core theme). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=836259","commentId":836259,"userName":"Pharmboys2013","timestamp":1376163500,"content":"I should have clarified my statement a little. I do value sphere distinctiveness, I was just trying to say how a Gondor ally that requires 3 heroes of the same sphere for an effect (regardless of what that effect is) would be a much greater help to the Gondor trait if it was leadership rather than tactics. Say for example if KoMT had the same stats but the ability was \"if all heroes you control have the printed leadership icon, place 2 resources on a Gondor hero\" it would help out the trait much more while retaining the essence of leadership."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=836342","commentId":836342,"userName":"Rapier1","timestamp":1376172741,"content":"Such a card would be acceptable (well, maybe not giving 3 attack to the Leadership Gondor ally, it would probably be 1/1/1/3 for leadership). I do agree that a card like that might have been nicer, for Leadership Boromir. (Although Gondor is currently split on 2/2/2/1 for hero sphere distribution, with spirit at 1).\n\n \n\n \n\nI think a better question is whether tying the cards into mono-sphere this early is a good idea. I think I'll start a new post to discuss that point.\n\nTo move back to the main topic though:\n\n \n\nI actually think that the card distribution in Against the Shadow is very good. I can see how it's disappointing for people that were really keen to play Gondor (And how they would feel mislead by FFG's statements). However I think the excessive focus on Dwarfs (mainly caused by the hobbit saga) is bad for the game. I think if the designers had tried to do 'only' or 'mainly' Gondor we would have a game where some decks are forced to be used and most are not viable. \n\nA more even distribution of new cards for each trait to match the even sphere distribution is much better for power creep across different traits (and therefore makes it possible to design quests that can present difficulty while being doable by multiple different deck builds) is far better than what we got with Dwarfs everywhere. - Which was everyone has to play dwarfs. I hope we avoid getting dwarf cards until other traits have caught up with them for several cycles. (I think this problem was caused by saga's getting the greenlight + Khazad Dum being dwarf heavy. AoS was much more even in supporting multiple traits).\n\nI don't mind the excessive Outlands trait support because it's taking a trait from nothing and making it something (like the Eagles). I actually think that the distribution of the Outlands cards (front-loaded onto the first pack) was a huge improvement compared with distribution of the Eagles (which required collecting at least 4 but probably all 6 packs before you could really try the eagles out).\n\nOverall I would said that the distribution has improved, this cycle has shown us a glimpse of the intended Gondor play (lots of resource generation and I suspect expensive cards/allies), it's also opened up the theme of the Rangers (traps and staging area combat), and given us Outlands (allies of all different spheres coming together for the common good against the shadow).\n\nWe've also got the meta-theme of supporting mono-sphere which I'm not entirely sold on but has definitely been worked in better than secrecy was for cycle 2. (Even though I love the idea of secrecy and hope it gets revisited/improved)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87637-lack-of-gondor-synergy/?do=findComment&comment=836414","commentId":836414,"userName":"booored","timestamp":1376182996,"content":"> It would be a complete mistake to market the saga expansions at that difficulty.\n\n \n\nI agree here. I think the Saga expansions should and are markets to a more casual player. Focus is on theme and story. I expect the Saga packs to be fun thematic quests that provide a neat experience, and the AP cycles to be much more difficult and aimed at the more serious players and then for the few they have the nightmare packs.\n\n \n\nMy bet is that this will be the order of things."}]}