{"url":"https://community.fantasyflightgames.com/topic/87645-newbie-here/","title":"Newbie here","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=828981","commentId":828981,"userName":"wstalcup","timestamp":1375391457,"content":"Hi,\nSo I have read the instructions twice but apparently I am still lost...\n\n \n\n1) For the quest phase, you have to commit (and tap) each character that you want to go on this quest.  Do you have to commit them again every round?  I'm guessing not because then it seems impossible to ever play a character as a defender.  So you only commit once per game?  Also why wouldn't you want to commit a character?  (maybe save them for later quest card but i don't see any advantage to this..)\n\n \n\n2) During the Combat phase, it seems to be 1 turn of the enemy attacking you and then you get 1 turn to strike back.  If an enemy is still alive at this point, does that enemy follow you whereever you go? (even if you go to a new location or quest card) or do they go back to the staging area?\n\n  If they do stay with you, do you still add their threat points in the next round? \n\n \n\nThanks!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829002","commentId":829002,"userName":"richsabre","timestamp":1375392046,"content":"1. no you commit every round, and indeed the same for declaring an attacker and defender.there is no constant 'stance' in this game. the biggest part to success in this game (especially solo) is balancing your forces between quest, defend, attack, and other abilities\n\n2.enemies stay engaged until they either die or a card effect puts them back in the staging area.\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829004","commentId":829004,"userName":"mr.thomasschmidt","timestamp":1375392124,"content":"Hi.\n\nWelcome to the forum :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nFor your questions.\n\n1. You commit as many characters as you wish in order to quest. These characters are tapped/exhausted and stay tapped for the rest of the turn. They don't untap until refresh phase unless you use a special effect.\n\n2. Once an enemy is engaged with you it stays like that until it dies. Only time it returns to the staging area is if it happens due to some effect.\n\nI might suggest you to watch the toturial video. It helped me far more than the rule book when I started out :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] you can find it either at YouTube. Or here at FFG if you go to games-living card games-lotr-support. At the bottom you find the video.\n\nHappy gaming :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829007","commentId":829007,"userName":"mr.thomasschmidt","timestamp":1375392229,"content":"Here's a link to the page with the video\n\nhttp://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4 [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829018","commentId":829018,"userName":"wstalcup","timestamp":1375392725,"content":"Ohhh\n\nSo if i understand correctly...\n\n \n\n   So when you exhaust characters during the Quest phase and you only those willpower points for quest resolution..\n\n \n\n  Your remaining character are free to tap to either defend, attack or maybe use some special ability..\n\n \n\nthe engaged enemy stays with you whereever you go..but its Threat points don't count for quest resolution..\n\n \n\nAlso one more thing...\n\nfor location cards in the staging area, you can ignore them as much as you want (put progress on quest cards) but the drawback to that is that you will always have to deal with their threat.   You may want to travel to the location to get rid of the threat  (and that is typically the only reason you would want to do that?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829065","commentId":829065,"userName":"richsabre","timestamp":1375395946,"content":"that is correct. as for the locations, as the game progresses (expansion pack wise) locations become ever more complex...some you have to travel to in order to win (to get victory points for instance) or some give good effects when travelled to. but yes in general you are balancing their threat with the need to get rid of them from staging.\n\nthere are cards that allow you to get rid of them without travelling....there is only 1 in core set- northern tracker\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829688","commentId":829688,"userName":"wstalcup","timestamp":1375464164,"content":"Ok, thanks I believe I have it figured out now.  For the most part, the game seems pretty good! Is there a website or database that gives more details on specific cards they may need more clarification?\n\nfor example, there is an attachment that if given to Aragon grants him the Spirit resource.  Does this allow him to pull an additional resource token each turn?  I'm guessing not, but would be nice to know for sure.\n\nAlso there is another card that triggers on an \"unsuccessful quest\".  Is a Tie, considered \"unsuccessful\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829737","commentId":829737,"userName":"mr.thomasschmidt","timestamp":1375467597,"content":"Yes there is. I'd go to the boardgamegeek.com page. There's a lot of info there. But the unofficial FAQ and CARDLIST is a must. It has an explanation on many cards that might bring up questions. Here's the direct link:\n\nhttp://boardgamegeek.com/filepage/82879/comprehensive-card-list-and-unofficial-faq [http://boardgamegeek.com/filepage/82879/comprehensive-card-list-and-unofficial-faq]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829840","commentId":829840,"userName":"wstalcup","timestamp":1375473375,"content":"Thanks! that worked out perfectly!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87645-newbie-here/?do=findComment&comment=829847","commentId":829847,"userName":"mr.thomasschmidt","timestamp":1375473751,"content":"At your service :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}