{"url":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/","title":"Online rules sheets of AtS cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=829667","commentId":829667,"userName":"mr.thomasschmidt","timestamp":1375463220,"content":"Fist of all. THIS IS NOT A COMPLAINT! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nSecond, has anyone noticed that there is something missing in the online PDF versions of the rules sheets in the latest cycle? The best part that you are supposed to read only after the quest is completed.\n\nI like to have all the rules and documents on my iPad. This way I have every thing handy for so e quick references during a game. So this really annoys me.\n\nI wrote FFG and asked if it might be a mistake and got the following answer:\n\n\"\"\"Den 2. aug. 2013 kl. 17:12 skrev Fantasy Flight Games Customer Service <customerservice@fantasyflightgames.com>:\n\nDear Thomas,\n\nThanks for your question! We sometimes leave off parts of rulesheets on PDFs that don't affect playability of the game and/or are not about the rules proper. In this case, it's because the second page contains spoilers which ought not to be read until after the quests are finished. Hope that helps. Let me know if you need anything else!\n\nTony Mills\n\nFantasy Flight Games Customer Service Team\n\ncustomerservice@fantasyflightgames.com\"\"\"\n\nThis seems like a really strange point of view when you get the spoilers inside the packages anyway. And there even is a warning point like \"don't read further until you've completed the quest\".\n\nAnyway, all of this leads to the question that came to my mind.\n\nDoes anyone use the online rules sheets for any packages they don't have? Would the point FFG came with really be an issue to anyone?\n\nI'm really curious about this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=829710","commentId":829710,"userName":"Pharmboys2013","timestamp":1375465454,"content":"I too often use my phone or iPad to quickly look at the PDFs if I forget how to perform an escape test or whatever.\n\nThe storyline being absent doesn't really bother me tho, like FFG pointed out its not necessary for gameplay and while a cool inclusion I don't often look back at it after competing the scenario the 1st or 2nd time; maybe other people do though"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=829759","commentId":829759,"userName":"CJMatos","timestamp":1375468885,"content":"I have all the rules sheets in my laptop, in a pen and on my smartphone to have them always at hand...\n\n \n\nAbout the storyline on the AtS cycle being there or not, it is indifferent to me, because i use only to consult rules or erratas..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=831881","commentId":831881,"userName":"Mr Coffee","timestamp":1375734601,"content":"Interesting that I found this topic, as I was having similar questions myself today...  For myself, I have purchased the Druadan Forest AP but had somehow misplaced that rule sheet and can't seem to locate it.  So I went online to pull up the online doc and noticed it didn't have that second page.  While I was a bit bummed by that, I was at least happy to get the \"playable\" part of the rulebook printed off again, and just all the more disappointed in myself for losing my boxed version now.... <_< [//content.invisioncic.com/Mfantflight/emoticons/default_dry.png]\n\nEdited August 5, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=831902","commentId":831902,"userName":"mr.thomasschmidt","timestamp":1375735763,"content":"> Interesting that I found this topic, as I was having similar questions myself today...  For myself, I have purchased the Druadan Forest AP but had somehow misplaced that rule sheet and can't seem to locate it.  So I went online to pull up the online doc and noticed it didn't have that second page.  While I was a bit bummed by that, I was at least happy to get the \"playable\" part of the rulebook printed off again, and just all the more disappointed in myself for losing my boxed version now.... <_< [//content.invisioncic.com/Mfantflight/emoticons/default_dry.png]\n\nBummer! I could probably take a good picture of side two and mail it to you like PDF if you wanna have the lore experience. Just pm me you email :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThis is exactly why I think we should have both sites in the online PDFs. The only reason they exist it to be able to redone load them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=832281","commentId":832281,"userName":"mr.thomasschmidt","timestamp":1375785379,"content":"Funny. All respect for FFG but sometimes I just don't understand their decisions. In my continus dialog with them regarding this topic I asked what people should do if the ever where to loose the sheet for their newer packs inspired by benhanses. And that wasn't a problem. All you should do where to contact parts.fantasyflightgames.com and they will send you a new one in the mail. Now THAT is something that isn't cost effective. How better than to just be able to download it as PDF? I believe that the sole purpose for the rules sheets excising on an online support page is this. So I really don't see why they won't risk the spoilers when people that uses these online files already have the packs. If people look at the rules for packs they don't have they have to be prepared for spoilers. Thus I think FFG should prioritize those that really needs them instead of those few that just wanna have a look.\n\nOther than that, good work in general FFG :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=834846","commentId":834846,"userName":"faith_star83","timestamp":1376034384,"content":"To be honest, this doesn't make sense to me at all, too. I was going to argue about the cost that they save by just having an intern scan the first pages only :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] But if they offer to MAIL you the actual, printed-out document (which is think is awesomely good service by the way) that cannot be the reason, can it?\n\n \n\nAlso, I can imagine there are some people who play scenarios they don't own on OCTGN and they would reference the online sheets, so I could understand some worries on the part of FFG concerning putting up the rule sheets at all. But since they provide the more important part, i.e. they play-rules the decision to just leave out the lore part seems a bit arbitrary to me indeed. Well, I suppose we just have to scan the documents ourselves then...\n\n \n\nBesides topic, I lost once a token of my GoT Boardgame and contacted cusomter service: They sent me just that one token instantly via mail, so they offer really good service there, which I think really speaks for buying FFG products!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87691-online-rules-sheets-of-ats-cycle/?do=findComment&comment=834937","commentId":834937,"userName":"mr.thomasschmidt","timestamp":1376044432,"content":"> To be honest, this doesn't make sense to me at all, too. I was going to argue about the cost that they save by just having an intern scan the first pages only :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] But if they offer to MAIL you the actual, printed-out document (which is think is awesomely good service by the way) that cannot be the reason, can it?\n> \n>  \n> \n> Also, I can imagine there are some people who play scenarios they don't own on OCTGN and they would reference the online sheets, so I could understand some worries on the part of FFG concerning putting up the rule sheets at all. But since they provide the more important part, i.e. they play-rules the decision to just leave out the lore part seems a bit arbitrary to me indeed. Well, I suppose we just have to scan the documents ourselves then...\n> \n>  \n> \n> Besides topic, I lost once a token of my GoT Boardgame and contacted cusomter service: They sent me just that one token instantly via mail, so they offer really good service there, which I think really speaks for buying FFG products!\n\nI completely agree with you. FFG does offer excellent service no doubt there. I just couldn't follow the points they made about this specific topic :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] They are my favourite game company and I'm gonna support them for as long as they have the games I find interesting. Personally I prefer to play lotr lcg on my laptop/iPad but I buy all the products even though I don't need to, all the card images being available and all. We have to support the game so it can live for as long as possible :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nBack to the topic, it's nice to see that I'm not the only one finding this interesting :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}