{"url":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/","title":"I Want Cards that Discard My Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=830884","commentId":830884,"userName":"lleimmoen","timestamp":1375617498,"content":"Some of the newer cards have often brought this to my mind: \"I wish there be more ways to discard my own allies or attachments.\" There are quite a few ways to discard cards from hand, such as Erestor or Protector of Lórien. But recently there's a good need to discard cards in play, just to play them again and get the benefit of it: Lord of Morthond + Men of the West combo comes to mind, especially if the discarding also comes with a bonus (not only for the likes of Imrahil, Valiant Sacrifice, Horn of Gondor) but even more directly, just like Ride to Ruin works. I did like that card a lot when exploring locations was much more needed (or possible, as the locations were not only more numerous but also hardly ever immune).\n\n \n\nThen there are attachments like Steward of Gondor that often provides too many resources that are hard to share (more easily though with the newer cards like Errand-rider). Still, it would be nice to be able to, well return it to hand or directly switch target would be even more useful but probably too easy. Discarding it feels just about right, so that you can play the other unique copy on someone else. And there are of course many, many candidates. Spare Hood and Cloak, for instance, has beautiful mechanic that can be used repeatedly, but sometimes it would really help to get rid of, only to bring it back (via Will of the West, Erebor Hammersmith, etc.), only to use it again from the scratch (using the obvious targets, such as Tactics Boromir).\n\n \n\nThis is just another aspect of the game that allows for interesting combos I always like to find. The hidden combo may not always be super effective but the joy of finding it is certainly deserving, and worth the struggle for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=830887","commentId":830887,"userName":"mr.thomasschmidt","timestamp":1375618528,"content":"I like your thinking :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] but I'm pretty sure some will think this will break the game (make it even more broke) I like it though.\n\nI'm not entirely sure, but wouldn't it work just to play the second unique card and then cancel the \"old\" one? I can't remember if something is written either for or against this in the rules or FAQ but maybe someone could commend on that? Just like it doesn't say anywhere that you can use less than 3 heroes but that's a perfectly legal play. That makes me think that it wouldn't be wrong to just play another copy of a unique card as long as you are willing to discard the other one. Just a thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=830898","commentId":830898,"userName":"richsabre","timestamp":1375620753,"content":"mmmm....im not sure on that one. i know you can do that with restricted cards, i.e. switch one of the 2 off a hero and put on the new one. i cannot remember seeing something on the unique, other than there cannot be more than 1 in play at any time.\n\n \n\ni would say no as you could put 1 gandalf in (deal 4 damage) then another gandalf in, discard the other (which he would anyways) and deal another 4 damage, and so on\n\nrich\n\nEdited August 4, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=830930","commentId":830930,"userName":"mr.thomasschmidt","timestamp":1375623735,"content":"> mmmm....im not sure on that one. i know you can do that with restricted cards, i.e. switch one of the 2 off a hero and put on the new one. i cannot remember seeing something on the unique, other than there cannot be more than 1 in play at any time.\n> \n>  \n> \n> i would say no as you could put 1 gandalf in (deal 4 damage) then another gandalf in, discard the other (which he would anyways) and deal another 4 damage, and so on\n> \n> rich\n\nhm, good point. Sounds right about the unique cards when compared to Gandalf. Must be the restricted cards I was thinking about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=831010","commentId":831010,"userName":"lleimmoen","timestamp":1375635066,"content":"Yeah, once a unique card is in play, another of the same name cannot enter play.\n\n \n\nBut I think it would be a nice mechanic if there was a simple event that lets you discard attachment in order to..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=831302","commentId":831302,"userName":"Bullroarer Took","timestamp":1375666400,"content":"Play Watcher of Bruinen and Trollshaw Scout. Have fun with it too. (PS: Those cards suck FFG! If they were attacking or defending for four it would be justifiable but...)\n\nEdited August 5, 2013 by Bullroarer Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=831388","commentId":831388,"userName":"lleimmoen","timestamp":1375681370,"content":"I think there are weaker cards in the game (that do about the same) but certainly also stronger ones. One can always hope there will be synergies to the Elves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87797-i-want-cards-that-discard-my-cards/?do=findComment&comment=831530","commentId":831530,"userName":"richsabre","timestamp":1375709513,"content":"i love those two cards....they are always in my elf decks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}