{"url":"https://community.fantasyflightgames.com/topic/87802-what-set-of-quests-would-you-take-on-holiday/","title":"What set of quests would you take on holiday?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87802-what-set-of-quests-would-you-take-on-holiday/?do=findComment&comment=830922","commentId":830922,"userName":"CaffeineAddict","timestamp":1375623248,"content":"I'm off on holiday in a couple of weeks with some friends, who have played the game before (though not a lot), and I was planning to take a few quests and a couple of decks with me.\n\nHaven't decided which quests to take yet, so I was wondering - if you were going to take some quests on holiday, and build some decks to play against them, what would you choose?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87802-what-set-of-quests-would-you-take-on-holiday/?do=findComment&comment=830934","commentId":830934,"userName":"mr.thomasschmidt","timestamp":1375624171,"content":"I think I'd take the Passage and Anduin fr core. And the ones you find not too hard in the Mirkwood cycle. This because you friends hasn't played the game a lot. Of cause if you have the cards nice and effectively stored you should just go for all of them ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] hehe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87802-what-set-of-quests-would-you-take-on-holiday/?do=findComment&comment=830937","commentId":830937,"userName":"Pharmboys2013","timestamp":1375624727,"content":"I would take whatever decks I wanted to use, and then either the core set quests or the deluxe/saga expansions. Don't know how you organize your cards, but I always keep all the cards from the expansions and their respective encounter sets together. That way if I go somewhere only one stack of cards provides me 3 quests with little effort."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87802-what-set-of-quests-would-you-take-on-holiday/?do=findComment&comment=831133","commentId":831133,"userName":"richsabre","timestamp":1375647103,"content":"my personal choice would be all 3 of the core quests because those are the ones i have spares for from my 2nd set, ncase they get damaged...i would want to spill my holiday beer on them or anything :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87802-what-set-of-quests-would-you-take-on-holiday/?do=findComment&comment=831339","commentId":831339,"userName":"danpoage","timestamp":1375672727,"content":"I brought The Battle of Five Armies from The Hobbit: On the Doorstep on a recent vacation. My friends had played the game some (core set mostly) and we all had a blast. That scenario in particular is a good mix of challenging and fun, and it scales well based on the number of players - assuming that you use well-built decks."}]}