{"url":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/","title":"Escape fro Dol question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=832137","commentId":832137,"userName":"nicks","timestamp":1375757373,"content":"As part of the setup I put three objective cards in the stagin area and attach encounter card to each one. What do I do next\n\n \n\n1. Are the objective cards face down and then I turn over all of the encouinter cards? or are all cards face up and then I have to face encounters or locations as I would normally based on threat level or choose to go to a location?\n\n2. What if one of the cards is a treachery card that is a condition? Do I attach condition and objective to my character.\n\n \n\nIts a little confusing.\n\n \n\nAny help would be appreciated\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=832164","commentId":832164,"userName":"Pharmboys2013","timestamp":1375761160,"content":"both the objective card and its \"guard\" encounter card are played face up.  you would them face them as you normally would leaving the objectives in the staging area.\n\n \n\nexample, the 3 objectives have an enemy, location, and treachery as their respective \"guard\" cards.  The 1st objective would be free to obtain after you engaging the enemy.  The 2nd would be free after traveling to the location. The 3rd you wouldnt have to do anything, just simply resolve the treachery as you normally would than the objective would be yours for the taking in the staging area"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=832398","commentId":832398,"userName":"mr.thomasschmidt","timestamp":1375795807,"content":"> both the objective card and its \"guard\" encounter card are played face up.  you would them face them as you normally would leaving the objectives in the staging area.\n> \n>  \n> \n> example, the 3 objectives have an enemy, location, and treachery as their respective \"guard\" cards.  The 1st objective would be free to obtain after you engaging the enemy.  The 2nd would be free after traveling to the location. The 3rd you wouldnt have to do anything, just simply resolve the treachery as you normally would than the objective would be yours for the taking in the staging area\n\nJust a slightly correction. It isn't enough to travel or engage. You need to kill the enemy and explore the location before you can claim them. I thought it was enough to engage and travel too but recently I read another post about guarded/objective cards where it was explained that you really need to kill and explore.\n\nAnd regarding question number 2. You only attach the condition. The objective stays in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=832407","commentId":832407,"userName":"nicks","timestamp":1375796737,"content":"ok so if I understand it correctly I am going to start with objectives and attached encounter cards in staging area\n\n \n\n1. I will go through the planning phase\n\n2. Commit resources to quest\n\n3. Draw additional encounter card and place in staging.\n\n4. Do my threat level vs wilpower checks with all cards (non objective) in staging area.\n\n5. Increase threat level or place progress tokens on quest card.\n\n6. If there is a location card(even attached to objective), I can choose to travel to it.\n\n7. Do a threat level check for all cards in stagin area and bring any enemies into the engagement area (even ones that are attached to objectives)\n\n8. Go through combat phase and resolve\n\n \n\nIf I kill an enemy attached to objective or complete exploring a location I can claim objective but I do not have to claim them right away. I can leave the objectives in the staging area until I decide to claim them. The cost of claiming some of the objective is pretty high so I may not do so right away or I may choose to only claim one in the beginning\n\n \n\nThen start back at 1\n\n \n\n \n\nLet me know if I got this right\n\n \n\nAlso, thanks much for your help.\n\n \n\nI am really enjoying this game. I just ordered the shadows of  mirkwood adventure seried and looking forward to starting that adventure"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=832459","commentId":832459,"userName":"mr.thomasschmidt","timestamp":1375799844,"content":"All is correct :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] also, if any of the enemies in the staging area doesn't engage you die to their threats being higher than your threat level you can choose to engage one (1) enemy.\n\nRegarding when to claim the objectives. You can't claim them anytime but you don't have to do it right away. Um, I can't remember if it's only certain quests or all but something about only claiming objective cards after questing successfully. So example, you kill an enemy guarding an objective. Then in the next turn you quest successfully. This might make you place progress tokens on your active location and fully explore it. Now you have two unguarded objectives and you can choose to claim one or both. If you don't you have to wait to next turn after questing successfully. I'll look it up and confirm/correct the statement before long. But right now there's supper :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=832549","commentId":832549,"userName":"mr.thomasschmidt","timestamp":1375805377,"content":"Ok. The bit about the claiming objective cards wasn't entirely correct. You can claim it anytime you want after you have meat the conditions. I.e. defeated the enemies or explored the locations. IF nothing else is stated at the objective card. In Hunt for Gollum there's also objective cards and these can only be claimed after they are unguarded and you successfully quest. Oh, and anytime is anytime you have the possibility for making a player action. You can see in the rules on one of the last pages about when the player has an open window to make player actions in. Hope it makes sense :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] oh, and also, I can recommend the FFG video tutorial. It can be found either on this site under the games support site or on YouTube. And also, this is the last time I use this word I promise, go to this address http://boardgamegeek.com/filepage/66894/comprehensive-card-reference-unofficial-faq [http://boardgamegeek.com/filepage/66894/comprehensive-card-reference-unofficial-faq]\n\nand get the unofficial FAQ & card list. It's a gold mine for clairifying rules about cards that you might have questions for. I've used it A LOT in e beginning :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nHappy gaming\n\nThomas"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=833352","commentId":833352,"userName":"nicks","timestamp":1375883047,"content":"thanks for your help. I played last night and was able to make sense of it.\n\n \n\nI got crushed but what else is new...\n\n \n\nThanks again\n\n--Nick"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=835727","commentId":835727,"userName":"Orcstalker","timestamp":1376097081,"content":"As a help to remembering the guard cards on objectives, I move the objective with the location or enemy card. Then, once the card has been resolved, I move the objective back up to the staging area; in this manner, I know when the objective are clear to be claimed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=835944","commentId":835944,"userName":"richsabre","timestamp":1376132424,"content":"ok, just to go back to the objectives, is it really enough just to engage and travel, or do you have to kill/ explore. i played it the latter, rather than the former, but i know players who play it differently\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=836011","commentId":836011,"userName":"Angus Lee","timestamp":1376141571,"content":"> ok, just to go back to the objectives, is it really enough just to engage and travel, or do you have to kill/ explore. i played it the latter, rather than the former, but i know players who play it differently\n> \n> rich\n\nFrom the rulebook, p.24:\n\n\"Enemy and location cards attached to guarded\n\nobjectives do still count their threat while the enemy\n\nor location is in the staging area. An encounter card\n\nattached to a guarded objective is dealt with in the\n\nfollowing method, depending on its card type:\n\nEnemy: The enemy leaves play, either by being\n\ndefeated or as the result of a card effect.\n\nLocation: The location leaves play, either by being\n\nfully explored or as the result of a card effect.\n\nTreachery: The treachery’s effects resolve, or are\n\ncanceled. (Treachery cards are immediately triggered\n\nwhen they are revealed.)\n\nOnce all encounter cards attached to a guarded\n\nobjective are dealt with, the players can claim the\n\nobjective in the manner specified by its card text.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/87907-escape-fro-dol-question/?do=findComment&comment=836264","commentId":836264,"userName":"richsabre","timestamp":1376164157,"content":"thanks.....completely forgot to check the rule book haha"}]}