{"url":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/","title":"who playtested this? watcher in the wood","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835288","commentId":835288,"userName":"Rainelotr","timestamp":1376069976,"content":"I know there has been a lot made of how difficult Into Ithilian is but out of all the difficult cards in this encounter set... one stands out to me.\n\nWatcher In the wood\n\nHow did this card make it through playtesting? With four players this card is non functional. In a normal game with four players at full swing you are looking at everyone raising their threat by anywhere from twelve to thirty points easy. Compare that to a single player effect of raising from three to maybe seven.\n\nThe game is supposed to be relatively scaleable. What happened here? With an average threat loss of close to twenty points that's. Instant loss everytime the card is drawn\n\nEdited August 9, 2013 by Rainelotr"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835291","commentId":835291,"userName":"Glaurung","timestamp":1376070420,"content":"Keep test of will or Eleonora ready in this case..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835321","commentId":835321,"userName":"rekath16","timestamp":1376071793,"content":"> Keep test of will or Eleonora ready in this case...\n\nGlaurung, your \"advices\" are always so trivial... You cant allways include Test of Will or Eleanor and even if you do, 3/50 cards is not really a good chance to draw it.\n\n \n\nMy playergroup also had the worst experiences with Watcher in the woods and it is ridiculous. The quest punishs you by all sides, if you send all characters to the quest, you get destroyed by watcher in the woods and suffer by the blocking wargs and if you dont send them, you dont make progress and the morgul-spider gets incredible strong.\n\n \n\nNot long time ago we had a discussion, cause 4 players and you draw this card means you loose imediately. Even the most stupid idiot in the world who playtested Into Ithilien with 4 players must have realized that. As a result it might be that its only the amount of personal characters and not of all of the group. But anyway, I dont change my opinion about Into Ithilien, its the worst quest of all and I hate it.\n\nEdited August 9, 2013 by rekath16"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835332","commentId":835332,"userName":"Rainelotr","timestamp":1376072188,"content":"Exactly rekath. And Glaurung yes it can be canceled but that wasn't what my post was about"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835386","commentId":835386,"userName":"richsabre","timestamp":1376074125,"content":"its tough but not broken.\n\ninstead of using glaurungs advice, my own would be this- strategically quest, i.e. dont over quest.\n\n \n\nthis cards mere prescence forces you to think before commiting, so i think it isnt broken, its just a tough card to deal with. of course with 4 encounter cards per turn its tough not to quest a lot, but thats where the challenge is\n\n \n\ni know saying 'include this or that' is poor advice, but there are other cards than test of will. you could scout before questing, so thats riversong, risk some light, denethor , palantir. (though all pretty useless in 4 player)\n\nyou could take it out with out of the wild (or is it needful to know?)\n\n \n\nyou could use a mixture of scouting with risk some light (3 cards) then put a shadow of the past card to make you know all 4.....then power quest. this could work as ithiliien is one of those quick quests that works better with quick strategies- you cannot get bogged down\n\n \n\nall pretty much stretching for a good strategy there, but this is a tough quest. i dont think this is as bad as that card i wont mention but everyone knows which im talking about ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nrich\n\nEdited August 9, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835392","commentId":835392,"userName":"Raven1015","timestamp":1376074468,"content":"It perhaps would have scaled better if it was that each player raises their threat by the number of questing characters they control. However, as it's currently phrased, you have to raise your threat by all questing characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835402","commentId":835402,"userName":"Tracker1","timestamp":1376074850,"content":"In 4 player game this card will break your game. We've played with Eleanor, but she might cancel the card, but it usally does not matter, because with her you have to replace a card which is equally as bad. 4 or more cars of the encounter deck during this quest is crazy. Southron Support is pretty pad also, which dumps 4 Harad enimes in the staging area on top of the other cards you've draw.\n\nI'm not sure we have ever beat it with 4 players. We got a few wins in 3 player.\n\nWe did beat it with 4 player on easy mode, and it still was pretty brutal, but at least you have a chance. In easy mode the cards they take out are no surprise, morgul spider, watcher in the woods, southron support, mumak, and some Blocking wargs.\n\nAfter we play quests like this and Druadan Forest we highly doubt they playtested this with 4 players, unless they were using some cards that have yet to be released when they did."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835407","commentId":835407,"userName":"richsabre","timestamp":1376075072,"content":"perhaps we are forgetting how tough this game may be to test 4 player. not saying that it shouldnt be or anything etc etc. im just saying to play 4 player, you need to get 4 play testers in the same room! (unless you want to skype it or multi hand solo)\n\n \n\nso perhaps we can forgive the odd mistake? (yes i know its easy for me to say as i dont play 4 player games)\n\nEdited August 9, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835408","commentId":835408,"userName":"Tracker1","timestamp":1376075097,"content":"> It perhaps would have scaled better if it was that each player raises their threat by the number of questing characters they control. However, as it's currently phrased, you have to raise your threat by all questing characters.\n\nI agree with this, i think the designers could start making some of the card effects scaled by the number of players . There are some cards like this already, but more would be welcomed.\n\nEdited August 9, 2013 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835531","commentId":835531,"userName":"Dain Ironfoot","timestamp":1376081551,"content":"> After we play quests like this and Druadan Forest we highly doubt they playtested this with 4 players, unless they were using some cards that have yet to be released when they did.\n\n \n\nyes, it's already been stated in interviews that the quests get tested with all of the player cards in a cycle - but i believe caleb said he also tests with core set + deluxe only, as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835535","commentId":835535,"userName":"TheLightdarker","timestamp":1376081695,"content":"> Keep test of will or Eleonora ready in this case...\n\nWhoa, wait, what? There are cards that allow us to cancel When Revealed effects?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835610","commentId":835610,"userName":"Glaurung","timestamp":1376086983,"content":"Im ok when you win or lose 50/50.  so this card is good"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835671","commentId":835671,"userName":"leptokurt","timestamp":1376090896,"content":"I don't play with 4 players, but I think Rich is right - questing should be done efficiently. Slowly, but steady progress. Boost your heroes with attachments, use Faramir plus Sword hat was Broken to get even more WP. Use New Boromir when the quest card has the battle keyword. Play Risk some Light to reduce the chance of drawing that card. There's also the brand new Palantir. If you know which encounter cards are to come, you can send everyone to the quest.\n\n \n\nAn example: Eowyn + Glorfindel + Elrond can give you 18 WP already with Faramir, StwB and Eowyn's ability.\n\n \n\nRegarding Test of Will it is important to keep it as long as possible, because this card can be such a pain - even more so than Blocking Wargs. So, I said it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835678","commentId":835678,"userName":"rekath16","timestamp":1376091851,"content":"Its ridiculous. Noone of you played with 4 players this quest and still you try to give advices which are de facto useless. Everything what you say is highly situational. Into Ithilien is not a quest for \"slowly steady progress\".\n\n- How long does it take to get a Sowrd that was Broken?\n\n- Boromir Leadership: How many cheap Gondor allys with 2 attack do we have??? [Dain + dwarfs is still better here}\n\n- Risk some Light is ok, but u have to pay for it if you are not in secrecy (and who remains secrecy with so many high doomed cards?). Also it shows not even 4 cards, same about Palanthir.\n\nBefore you guys give advices, play it in a 4-player-environment and you will realize how impossible it is to avoid that card.\n\n \n\n@leptokurt: Du redest vielleicht einen Blödsinn. Was soll das?Die meisten Gondor-Verbündeten haben 1 HP, bei Blocking Wargs sofort tot..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835683","commentId":835683,"userName":"richsabre","timestamp":1376092380,"content":"i managed to play this with a secrecy deck and get to 0 threat at the end of the quest. even taking into account the extra 3 cards per turn, you can certainly keep a secrecy deck up and running to play risk some light.\n\n \n\nthis quest, no matter what some may think, is a situational quest, that requires some very specific plays. giving situational advice is therefore not ridiculous at all - it is strategies like this that win quests.\n\n \n\nbesides- if you wish for only advice off those who have played this 4 player, you will be scarce on advice indeed\n\nEdited August 9, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835731","commentId":835731,"userName":"Rainelotr","timestamp":1376097949,"content":"Rich you seem like a really laid back dude. That's cool.\n\nYour strategies to combat this card are superfluous to my problem with the card. This scenario is full of difficult treacheries you are required to deal with. The only valid point you made was that you need to commit characters to the quest strategically. The problem is that when the number of players increases. The bare minimum amount of characters required to quest goes up but so ddamoes the frequency with which this card shows up and its average threat damage. Once you hit Four players this is absolutely out of control. Keep in mind this quest also comes with a card that reads along the lines of\n\nEach player must remove one character from the quest. If any player has no characters committed to the quest remove all characters from the quest\n\nWith that in mind... you are looking at minimum two characters per hero lowballing it.\n\nSo here is a card that on one end does min 2 threat damage and 8 with four players and that's not a realistic representation of an actual game.\n\nPersonally I agree with raven yet there is no errata. Why"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835737","commentId":835737,"userName":"richsabre","timestamp":1376098561,"content":"thanks ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] . to comment directly on the need for errata, i think that perhaps, if you feel it really does need it, you should perhaps contact caleb and request some sort of scaling for 4 player. to refer back to my point about play testing, i cant say what ffg actually does, but im guessing 4 player gets tested least of all (may be wrong there but it sort of makes sense with the troubles it must raise)....therefore perhaps the designers just dont know about its problems.\n\n \n\ni may give this a go 4 handed (though its tough with all the cards) as i want to see first hand how this plays out\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835744","commentId":835744,"userName":"Rainelotr","timestamp":1376099597,"content":"Oh... and let's calculate the total damage there\n\nThe card deals minimum of 2 damage in one player and 8x4 people in 4 player. That is a twenty two damage difference at Minimum.\n\nI play 4 players often but usually work in a group of 3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835801","commentId":835801,"userName":"booored","timestamp":1376108246,"content":"what the **** is the problem, just always make sure you have a spare resource on spirit and a test of will.. end of story. Put some card draw in to make sure you pull it, between 4 players you can pack a lot of card draw. This card is a bad ass .. sure.. but it is SO TRIVIAL to play around that this thread is a joke.\n\n \n\nlearn your quests, learn your requirements, learn your threats build your decks and play accordingly.\n\n \n\nYou can not just play each quest like a ******* robot, you need to make strategic decisions... like... always having a test of will in hand and resource ready.\n\n \n\nStop bitching and learn to play.\n\n \n\n \n\n> Your strategies to combat this card are superfluous to my problem with the card. This scenario is full of difficult treacheries you are required to deal with.\n\n \n\nTrue, but you need to plan your strategy. The general rule is if it doesn't kill you and end the game, do not cancel it. There are other threats sure, but this one WILL end the game, so it has higher priority. So if another card is bad, this is worse.. so you hold the cancels for this one and this one alone.\n\n \n\n \n\n> there is no errata. Why\n\n \n\nBecause the game has to speak to the entire population of players not just *******. While no one is forcing collectors to buy 3 copies of core and the like , many do. i have played 4 player games were every player is running 3will+3Tomb for a total of 24 Test of will cards on the table. That was unusual but I hope you get the point. We need super hard quest with super hard threats as some of us play with large card pools and spend a lot of time making powerful decks. It is not out of line for FFG to design a card for 4 player games and expect each player to have there own copy of core. Just cause you have only 1 or 2 for a 4 player game doesn't reflect everyone, and FFG need to make allowances for ALL players. That doesn't mean each quest is for all players, it means that a quest has to come now and then out of the tons available that caters to these people.\n\n \n\nThis is why it will not get errata. \n\n \n\n1) It is piss easy to play around even with smaller card pools\n\n2) anyone playing with a decent card pool (as in more than one player collects) will have no trouble at all\n\n3) if it pisses you off, just take it out of the deck. end of story. This is a co-op game, just change the card text yourself.\n\nEdited August 10, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835808","commentId":835808,"userName":"Troymk1","timestamp":1376109279,"content":"> Its ridiculous. Noone of you played with 4 players this quest and still you try to give advices which are de facto useless. Everything what you say is highly situational. Into Ithilien is not a quest for \"slowly steady progress\".\n> \n> - How long does it take to get a Sowrd that was Broken?\n> \n> - Boromir Leadership: How many cheap Gondor allys with 2 attack do we have??? [Dain + dwarfs is still better here}\n> \n> - Risk some Light is ok, but u have to pay for it if you are not in secrecy (and who remains secrecy with so many high doomed cards?). Also it shows not even 4 cards, same about Palanthir.\n> \n> Before you guys give advices, play it in a 4-player-environment and you will realize how impossible it is to avoid that card.\n> \n>  \n> \n> @leptokurt: Du redest vielleicht einen Blödsinn. Was soll das?Die meisten Gondor-Verbündeten haben 1 HP, bei Blocking Wargs sofort tot...\n\nAgreed.  This is one of the quests I was referring to in my 4 player balance thread.  I set this up today and tried it 6 times.  Best show for the decks was lasting until turn 3 before Heroes started dying left and right.  It's a massacre. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835830","commentId":835830,"userName":"mr.thomasschmidt","timestamp":1376112110,"content":"> besides- if you wish for only advice off those who have played this 4 player, you will be scarce on advice indeed\n\nExactly! This is first and foremost a 1-2 player game. Just because I CAN be played with more doesn't mean it should be. If you think this quest is so horrible 3-4 player, rekath16 the, then play it with the recommended number of players instead of biting the head of those trying to give advise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835842","commentId":835842,"userName":"Troymk1","timestamp":1376113414,"content":"> what the **** is the problem, just always make sure you have a spare resource on spirit and a test of will.. end of story. Put some card draw in to make sure you pull it, between 4 players you can pack a lot of card draw. This card is a bad ass .. sure.. but it is SO TRIVIAL to play around that this thread is a joke.\n> \n>  \n> \n> learn your quests, learn your requirements, learn your threats build your decks and play accordingly.\n> \n>  \n> \n> You can not just play each quest like a ******* robot, you need to make strategic decisions... like... always having a test of will in hand and resource ready.\n> \n>  \n> \n> Stop bitching and learn to play.\n> \n>  \n> \n>  \n> \n> > Your strategies to combat this card are superfluous to my problem with the card. This scenario is full of difficult treacheries you are required to deal with.\n> \n>  \n> \n> True, but you need to plan your strategy. The general rule is if it doesn't kill you and end the game, do not cancel it. There are other threats sure, but this one WILL end the game, so it has higher priority. So if another card is bad, this is worse.. so you hold the cancels for this one and this one alone.\n> \n>  \n> \n>  \n> \n> > there is no errata. Why\n> \n>  \n> \n> Because the game has to speak to the entire population of players not just *******. While no one is forcing collectors to buy 3 copies of core and the like , many do. i have played 4 player games were every player is running 3will+3Tomb for a total of 24 Test of will cards on the table. That was unusual but I hope you get the point. We need super hard quest with super hard threats as some of us play with large card pools and spend a lot of time making powerful decks. It is not out of line for FFG to design a card for 4 player games and expect each player to have there own copy of core. Just cause you have only 1 or 2 for a 4 player game doesn't reflect everyone, and FFG need to make allowances for ALL players. That doesn't mean each quest is for all players, it means that a quest has to come now and then out of the tons available that caters to these people.\n> \n>  \n> \n> This is why it will not get errata. \n> \n>  \n> \n> 1) It is piss easy to play around even with smaller card pools\n> \n> 2) anyone playing with a decent card pool (as in more than one player collects) will have no trouble at all\n> \n> 3) if it pisses you off, just take it out of the deck. end of story. This is a co-op game, just change the card text yourself.\n\n \n\nNothing impresses me more than someone talking smack on the interwebz. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nLook,  Dood.  Not everyone is playing Spirit with three tests of wills in their deck. \n\n \n\nOBVIOUSLY if you have a test of will sitting there in your opening hand you're golden.  Oh except there's another 4 cards that will drag out 4 more Harad enemies each.  \n\n \n\nAND With the amount of surging going on , it's fairly common to draw 6 encounter cards rather than 4. \n\n \n\nThis quest chops you up in 4 player (oh did we mention Morgul Spiders? They are basically a hero insta-kill at the 4 player level)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835847","commentId":835847,"userName":"Rainelotr","timestamp":1376114506,"content":"Look if the card made each player raise their threat by the number of their own questing characters it would be perfectly balanced and work with any number of players. It would still be terrible and still need to be canceled as raising threat by any amount is bad.\n\nIn a four player game this card is broken because it easily reaches the potential to raise all players threat by more threat than Will Ever be present in the game. That's completely unneccesary. if you were hanging around playing you normal two player game with your bud and a card told you to raise your threat by 40.... wouldn't you feel ripped off? I generally play decks starting around thirty threat which means there is only 20 threat to play with.\n\n.\n\nNo card should be cancel or die guaranteed. It lacks subtlety.\n\nAlso... in this quest frankly this card is waaaaaaaaaaay down on my list of priorites. The point is the text doesn't make since. Why raise my threat by 20 or 25 when 8 will do just as well to make me hopeless? It is mega overkill and has an easy fix\n\nOn a side note, I do feel the game is most unbalanced when playing 1 and 4 players and most balanced at 2 but it is labeled as a 1-4 player game so I think my concern is reasonable\n\nEdited August 10, 2013 by Rainelotr"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835850","commentId":835850,"userName":"Dain Ironfoot","timestamp":1376114781,"content":"> Look,  Dood.  Not everyone is playing Spirit with three tests of wills in their deck. \n\n \n\nmy basic philosophy for multiplayer games is that at least 1 player should be playing spirit with 3 ATOW...and if it's a 4 player game, at least 2. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835911","commentId":835911,"userName":"leptokurt","timestamp":1376125890,"content":"@ rekath\n\n \n\nWait, most Gondor allies have only 1 HP. Ever heard of Faramir, Citadel Custodian, Citadel Guard, Errant Rider, White Tower Watchman, or Damrod? Knights of Minath Tirith are new but should be very helpful here. If they are in your starting hand you could play them and pick one SC from the staging area and giving them 3 points damage already. Anyway, if you play with Gondor and Boromir, of course you only use those allies to quest that have more than one HP. The others are kept ready to block or to kill enemies. Or to use Hail of Stones.\n\n \n\nI don't think you need to have played this with 4 players to give reasonable advice that is common knowledge. Pimping your heroes with attachments is not very situational. Relying on your heros strengtht is the most e reliable thing that this game offers. The OP said that he had to add 12-30 (!!!) threat points, so his play group clearly does something wrong, namel to commit too many characters to the quest. Any solutuon should start by solving that problem first, and the soultion is to pimp your heroes and to use high quality allies and stuff like For Gondor. Questing slow and steady before you finish the stage 1 in one single turn with everything you have (when you can be fairly sure it won't kill you) is a superior strategy for every number of players, as it minimizes the risk of being caught off guard by one of those nasty treacheries.. Like others said, wait until you have Test of Will in your hand and possibly Risk some Light and then - go! Ok, you should have these WP powering tools that I talked of earlier. If you don't know how to get them in your starting hand, loook for the keywords mulligan, card draw, Word of Command., Gildor and Master of the Forge. (I'd definitely run a leadership/lore deck).\n\n \n\nIf all of that (and all the dwarf synergies) doesn't help, then this scenario is simply unplayable with 4 players. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835923","commentId":835923,"userName":"rekath16","timestamp":1376129135,"content":"> what the **** is the problem, just always make sure you have a spare resource on spirit and a test of will.. end of story. Put some card draw in to make sure you pull it, between 4 players you can pack a lot of card draw. This card is a bad ass .. sure.. but it is SO TRIVIAL to play around that this thread is a joke.\n> \n>  \n> \n> learn your quests, learn your requirements, learn your threats build your decks and play accordingly.\n> \n>  \n> \n> You can not just play each quest like a ******* robot, you need to make strategic decisions... like... always having a test of will in hand and resource ready.\n> \n>  \n> \n> Stop bitching and learn to play.\n\n \n\nDid you have a hard childhood? I pet your red and steaming head, my friend. Cool down and speak friendly as the majority of us does.\n\n \n\nOne word to rich: I apreciate your future wish to playtest once 4-handed in Ithilien. It shows you really want to know how it is. But it has again a drawback. I think you know it: 4 players = 4 different heads and 4 different hidden hands. If you play 4-handed you can plan like a strategic master, absolutely I agree. But in a 4 player game with real people everything is different. Maybe one could play in combination with songs Faramir (what would be the best decision in that situation), but plays a Galadriems Greeting cause he is afraid of his actual threat. Maybe he tells about it, maybe not. Tabletalk is a topic per se. Maybe other player plays sth else cause he just dont see the possible strategic point.\n\nI know, you would admit. Also not every player must be a 100%-expert like us. People like booored expect that every player on earth knows every nice move in LOTR, thats sad. It should be possible to play Ithilien even with players that play only once in one or two weeks.\n\n \n\nTo leptokurt: I heard of them and you see it by yourself, 4/6 of your named allys are heavy cost which was actually my thought, it would take very long time to get them. I mean, Damrod...\n\n \n\n \n\nTo put everything in a nutshell... In my opinion, that card should mean \"Every player raises his threat by the amount of his own questing characters\" And as another user said before here, then it would still stay a horrible card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=835946","commentId":835946,"userName":"richsabre","timestamp":1376132805,"content":">  \n> \n> .One word to rich: I apreciate your future wish to playtest once 4-handed in Ithilien. It shows you really want to know how it is. But it has again a drawback. I think you know it: 4 players = 4 different heads and 4 different hidden hands.\n\njust a quick side point. i think that you can share what is in your hands in this game though? at least we have been playing it that way whenever i have played with actual people (rather than the people in my head)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836026","commentId":836026,"userName":"booored","timestamp":1376143162,"content":"> Look,  Dood.  Not everyone is playing Spirit with three tests of wills in their deck.\n\n \n\nexacty my point. People can not blame FFG because some players suck so badly at the game. You can not just make a deck and go \"this is my deck now I should be able to play it vs any quest\" While the need to make quest specific decks is less than before it is still a big part of what this game is. Also when you play multiplayer, you are not buliding say 4 deck, your building ONE get played by four people. if you are just taking your existing deck and palyign it with a mate.. then again you simply doing it wrong. You can not just stubonly say \"i wana play it my way\" you have to use strategy in your deck building choices.\n\n \n\nFFG can not be responsible for terrible players.\n\n \n\n \n\n> just a quick side point. i think that you can share what is in your hands in this game though? at least we have been playing it that way whenever i have played with actual people (rather than the people in my head)\n> \n> rich\n\n \n\nNo, your not allowed to share any information at all. All cards and all things like Denathor looking at the encounter deck or quest effects and stuff are 100% hidden choices. Your not even allowed to mention the card names that you are going to use in a play. What makes this co-op experience so great is that so much is based on trust with your partners and unlike many co-op you can not have one player \"controlling\" the game. Basically all infomation apart fomr what si revealed on the table to is hidden and illegal to talk about.\n\nEdited August 10, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836039","commentId":836039,"userName":"Glaurung","timestamp":1376144107,"content":"> > Keep test of will or Eleonora ready in this case...\n> \n> Glaurung, your \"advices\" are always so trivial... You cant allways include Test of Will or Eleanor and even if you do, 3/50 cards is not really a good chance to draw it.\n> \n>  \n> \n> My playergroup also had the worst experiences with Watcher in the woods and it is ridiculous. The quest punishs you by all sides, if you send all characters to the quest, you get destroyed by watcher in the woods and suffer by the blocking wargs and if you dont send them, you dont make progress and the morgul-spider gets incredible strong.\n> \n>  \n> \n> Not long time ago we had a discussion, cause 4 players and you draw this card means you loose imediately. Even the most stupid idiot in the world who playtested Into Ithilien with 4 players must have realized that. As a result it might be that its only the amount of personal characters and not of all of the group. But anyway, I dont change my opinion about Into Ithilien, its the worst quest of all and I hate it.\n\nVery good quest. On of the best. Yes you cal lose a game which is exiting.\n\nAnd thanks to this card you can lose it even when you think you win already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836062","commentId":836062,"userName":"Glaurung","timestamp":1376146438,"content":"> what the **** is the problem, just always make sure you have a spare resource on spirit and a test of will.. end of story. Put some card draw in to make sure you pull it, between 4 players you can pack a lot of card draw. This card is a bad ass .. sure.. but it is SO TRIVIAL to play around that this thread is a joke.\n> \n>  \n> \n> learn your quests, learn your requirements, learn your threats build your decks and play accordingly.\n> \n>  \n> \n> You can not just play each quest like a ******* robot, you need to make strategic decisions... like... always having a test of will in hand and resource ready.\n> \n>  \n> \n> Stop bitching and learn to play.\n> \n>  \n> \n>  \n> \n> > Your strategies to combat this card are superfluous to my problem with the card. This scenario is full of difficult treacheries you are required to deal with.\n> \n>  \n> \n> True, but you need to plan your strategy. The general rule is if it doesn't kill you and end the game, do not cancel it. There are other threats sure, but this one WILL end the game, so it has higher priority. So if another card is bad, this is worse.. so you hold the cancels for this one and this one alone.\n> \n>  \n> \n>  \n> \n> > there is no errata. Why\n> \n>  \n> \n> Because the game has to speak to the entire population of players not just *******. While no one is forcing collectors to buy 3 copies of core and the like , many do. i have played 4 player games were every player is running 3will+3Tomb for a total of 24 Test of will cards on the table. That was unusual but I hope you get the point. We need super hard quest with super hard threats as some of us play with large card pools and spend a lot of time making powerful decks. It is not out of line for FFG to design a card for 4 player games and expect each player to have there own copy of core. Just cause you have only 1 or 2 for a 4 player game doesn't reflect everyone, and FFG need to make allowances for ALL players. That doesn't mean each quest is for all players, it means that a quest has to come now and then out of the tons available that caters to these people.\n> \n>  \n> \n> This is why it will not get errata. \n> \n>  \n> \n> 1) It is piss easy to play around even with smaller card pools\n> \n> 2) anyone playing with a decent card pool (as in more than one player collects) will have no trouble at all\n> \n> 3) if it pisses you off, just take it out of the deck. end of story. This is a co-op game, just change the card text yourself.\n\n5+"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836078","commentId":836078,"userName":"Khamul The Easterling","timestamp":1376147843,"content":">  \n> \n> > Look,  Dood.  Not everyone is playing Spirit with three tests of wills in their deck. \n> \n>  \n> \n> my basic philosophy for multiplayer games is that at least 1 player should be playing spirit with 3 ATOW...and if it's a 4 player game, at least 2. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\nYeah agreed.  Yes its a bad card, yes you can lose a game from it.  But with 4 players you should always have a Test Of Will ready for this card and if you don't, you might lose the game, but guess what? You lose games in LOTR LCG.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836099","commentId":836099,"userName":"Troymk1","timestamp":1376149213,"content":">  \n> \n> > Look,  Dood.  Not everyone is playing Spirit with three tests of wills in their deck.\n> \n>  \n> \n> exacty my point. People can not blame FFG because some players suck so badly at the game. You can not just make a deck and go \"this is my deck now I should be able to play it vs any quest\" While the need to make quest specific decks is less than before it is still a big part of what this game is. Also when you play multiplayer, you are not buliding say 4 deck, your building ONE get played by four people. if you are just taking your existing deck and palyign it with a mate.. then again you simply doing it wrong. You can not just stubonly say \"i wana play it my way\" you have to use strategy in your deck building choices.\n> \n>  \n> \n> FFG can not be responsible for terrible players.\n> \n>  \n\n \n\nI like that you have a strong opinion and are so willing to display it.  I also quite enjoy that you're flat out wrong and are willing to display it also.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nYou're saying that EVERY deck in 4 players should be running spirit sphere because Test of will is the only way to play the game.\n\n \n\nWell. If that WERE the case, then that would be FFG's fault. To design a LCG with 4 spheres yet making just one of them paramount would be a design blunder of the highest order. (And at one stage I actually think this was somewhat true)\n\n \n\nThe decks I am playtesting have 2 with Spirit and test of wills obviously. And Dwarven Tombs to fish them out as I recognize they are the best situational cards there are. \n\n \n\nMost of the suggestions on how to handle this would have the players in a board situation where I would put it to you, you have already won.\n\n \n\nThis game is all about surviving the first 4 turns with limited allies and other help. Once you've achieved that often times the players will have enough assets available to solve the puzzles they are faced with\n\n \n\nThis quest doesn't allow that.  In Normal mode it has multiple ways to cut you down in an efficient and ruthless manner.  On your first turn once the 4 encounter cards have been added to the Southron Companies you'll be facing 20+ threat. \n\n \n\nYou can beat that, but over 2/3rds of your characters will be questing to get to the 20+ range\n\n \n\nIt's just mathematics, _NOT_ a strategic choice.  Nor does understanding the math make me \"terrible at the game\" or \"suck\"\n\n \n\nNow after you've dealt with the 20+ threat, Ithilien road is probably still the active location  (I have seen it cleared once by some lucky Rohan Shenanigans so far)  So the 5-7 enemies in the staging area are ALL coming out at you.  4 of those have an attack of 5.  If a Spider popped he has an attack of 8-9 this round so you better have a meat shield. \n\n \n\nGood decks (and Gondorian shield) can get you through this round But most of these enemies will still be there for the beginning of next round. You simply don't have the characters to spare yet to be able to attack them (Boromir helps here)\n\n \n\nSo it begins, You're already neck deep in dangerous foes and you still have to quest a significant portion of your forces as each card revealed has 3-4 threat. OR even better it's Southron support bringing 4 more Harad enemies (which will either be the archers bringing down a rain of unmitigated damage or the elites who will strip away your defences by making immediate attacks)  Or as the title of this thread notes at some stage watcher will pop and you'll cop say 8-15 threat, depending. (there's already a lovely sprinkling of Doom 3 cards in there already.  basically you're heroes will start falling Turn 2 or with luck turn 3 and then the power curve shifts and your forces are annihilated a turn or two later. \n\n \n\n \n\nSo, at the moment I am treating your posts somewhat with disdain, I am speaking from experience (and in this world that is the thing I have come to respect the most) and you good sir?  You're speaking out of your A** \n\n \n\nHave a lovely evening.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836107","commentId":836107,"userName":"Troymk1","timestamp":1376149734,"content":"Sidebar.  I would expect such difficulty from a level 9 quest. THIS my friends, is supposedly level 4. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836134","commentId":836134,"userName":"booored","timestamp":1376152466,"content":"> You're saying that EVERY deck in 4 players should be running spirit sphere because Test of will is the only way to play the game.\n\n \n\nno that is not what I am saying at all. I am saying that quests require strategic deck building and choices that are not constrained by personal preference, thematic ideals or limited by small card pools.  I am saying that if you have a quest with a treachery that will instantly loose you the game .. that si NOT game breaking or even a problem, as all you need to do is build your deck to be able to handle it.. in this case by adding a strong spirit splash. Saying, \"i do not play sprite and this quest is unbeatable\" is just ridiculous. It would be like saying I suck at baseball, but I refuse to use a baseball bat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836136","commentId":836136,"userName":"Troymk1","timestamp":1376152712,"content":"If it was a conundrum like Sleeping sentry I would agree. But unfortunately that's not the case.\n\n \n\nThere are other treacheries that are just as bad. (Southron Support) and that comes in multiple copies. \n\n \n\nIn one test game I got to use test of will 3-4 times but still lost.  It's just brutal  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836137","commentId":836137,"userName":"Glaurung","timestamp":1376152760,"content":">  \n> \n> > You're saying that EVERY deck in 4 players should be running spirit sphere because Test of will is the only way to play the game.\n> \n>  \n> \n> no that is not what I am saying at all. I am saying that quests require strategic deck building and choices that are not constrained by personal preference, thematic ideals or limited by small card pools.  I am saying that if you have a quest with a treachery that will instantly loose you the game .. that si NOT game breaking or even a problem, as all you need to do is build your deck to be able to handle it.. in this case by adding a strong spirit splash. Saying, \"i do not play sprite and this quest is unbeatable\" is just ridiculous. It would be like saying I suck at baseball, but I refuse to use a baseball bat.\n> \n>  \n\nThat what i love about HON and NM quests: you must ot use you brain. strategy and really build up synergy decks to be able to win. Yes yes use your brain and your partners."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836162","commentId":836162,"userName":"Dain Ironfoot","timestamp":1376154093,"content":">  \n> \n> No, your not allowed to share any information at all. All cards and all things like Denathor looking at the encounter deck or quest effects and stuff are 100% hidden choices. Your not even allowed to mention the card names that you are going to use in a play. What makes this co-op experience so great is that so much is based on trust with your partners and unlike many co-op you can not have one player \"controlling\" the game. Basically all infomation apart fomr what si revealed on the table to is hidden and illegal to talk about.\n> \n>  \n\nHere are the Table Talk rules from the Core Set:\n\n \n\nPlayers are permitted and encouraged to talk to one another during play, and to work as a team to plan and execute the best course of action. Players can discuss anything they would like, but they cannot name or read out loud directly from cards in their hand, or from cards that they have seen but the rest of the players have not.\n\n \n\n \n\nSo, you are allowed to share information - nothing prohibits that - you just can't read from a card nor can players name a card.\n\n \n\nNothing here says you can't hint at what you have, though (\"I have a wizard friend that can enter play,\" for example).\n\nEdited August 10, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836170","commentId":836170,"userName":"Rainelotr","timestamp":1376154898,"content":"Look guys the point Again, is not whether this is a beatable quest. It is brutal and fun but troy has hit what I am trying to say on the head.\n\nHe is right. Most of the advice showering in here is completely out of context. How are we supposed to strategically quest or play sneaky debuff secrecy decks when you start off with an average of 20+ threat against you and the engagement costs of all enemies is 0\n\nPlease go try this thing before you start telling us we just need to build better decks.\n\nAnd yeah let's bring back my original question. Who playtested this and thought it appropriate to rate it 4 out of ten difficulty.\n\nAnd I am not attacking FF. This wouldn't bother me if it weren't completely out of character with the card effects and rating system of the rest of the game\n\nPs thanks dain!\n\nEdited August 10, 2013 by Rainelotr"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836189","commentId":836189,"userName":"leptokurt","timestamp":1376156739,"content":"> Look guys the point Again, is not whether this is a beatable quest. It is brutal and fun but troy has hit what I am trying to say on the head.\n> \n> He is right. Most of the advice showering in here is completely out of context. How are we supposed to strategically quest or play sneaky debuff secrecy decks when you start off with an average of 20+ threat against you and the engagement costs of all enemies is 0\n> \n> Please go try this thing before you start telling us we just need to build better decks.\n> \n> And yeah let's bring back my original question. Who playtested this and thought it appropriate to rate it 4 out of ten difficulty.\n> \n> And I am not attacking FF. This wouldn't bother me if it weren't completely out of character with the card effects and rating system of the rest of the game\n> \n> Ps thanks dain!\n\nLike I said, it is not too difficult to get 20+ points during the first furn into the quest.\n\n \n\nSome other thoughts which might be helpful:\n\n \n\n- Thalin is very useful in this quest. He gets 3 ATT when you play with Dain and he kills the bats before the can do any damage.\n\n \n\n- obviously Erebor Battle Master can help you so much in this game\n\n \n\n-Light the Beacons can be played on turn 2 (even on turn 1, if you use the Hobbit synergies). Helps to reduce the mass of enemies. That's indeed a bit situational, but if it hapnes that you get Goof Meal and LtB in your starting hand, using a mono spirit deck, you could play this card on turn 1, send eough characters to the quest that it doesn't hurt to much, engage all enemies and kill most of them.\n\n \n\n \n\nI don't think that a difficulty of 4 was given for the 4 player modus. The game is designed for 1-2 players (where II is certainly beatable) after all and should be designed accordingly. I completely understand why you're frustrated, perhaps you should simply change some of the card effects. Like every player raises his threat by the amount of characters he sent to the quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836198","commentId":836198,"userName":"leptokurt","timestamp":1376158182,"content":"> If it was a conundrum like Sleeping sentry I would agree. But unfortunately that's not the case.\n> \n>  \n> \n> There are other treacheries that are just as bad. (Southron Support) and that comes in multiple copies. \n> \n>  \n> \n> In one test game I got to use test of will 3-4 times but still lost.  It's just brutal   :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThat is indeed a card that they should have worded differently. It's not working in a 4 player game. Out of the Wild might help, perhaps with a (Hobbit?) secrecy deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836208","commentId":836208,"userName":"Rainelotr","timestamp":1376159172,"content":"I appreciate the input lepto we actually were replaying this recently for the first time since we got it and beat it which is what prompted me to start this thread. Three player game and Our layout was actually gimli, thalin, battlemaster, etc and an entire deck dedicated to threat reduction and treachery cancelation with a side of healing.\n\nThe decks were great. Designed to battle quest if not to beat that specific scenario\n\nWho was playtesting this with any number of players and thought this was easy? Has anyone here beaten this quest the majority of the time they played it with any deck setup? If so please explain in detail\n\nEdited August 10, 2013 by Rainelotr"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836269","commentId":836269,"userName":"leptokurt","timestamp":1376164580,"content":"So I just won a 4 handed game. Thalin killed 3 of the bats, Palantir got used quite often, Eleaonor cancelled some Blocking Wargs. Fortunatly both Southron Supports were dealt as shadow cards early in the game. The rangers took out some of the 4 threat locations, a Sneak Gandalf destroyed one of the Mercs. Beregon (with UC) and Dain were my defense bulwark, and A Very Good Tale filled my ranks with dwarves. Erebor battle Master (who was in my tactics deck) quested with 5 ATT, Gimli with 7 (got the Haradrim Elite on turn 1 and let them attack undefended). Sword that was Broken pimped my WP during stage 3 (plus i had all three objective rangers and Gandalf). Stage 4 was quite easy with Light the Beacons in my hand. Didn't get a single copy of A Test of Will. I guess I was lucky that the treacheries didn't pile up so Eleanor could handle them (but Palantir helped me to make my quest decisions; also: Palantir + Baramirs Ring = 7 HP for Glorfindel!). Took me five turns to complete the quest.\n\n \n\n \n\n \n\nEdit:\n\n \n\nOh, and that Lampmaker cancelled one surged Blocking Wargs on turn 2!\n\n \n\n \n\nHeroes:\n\n \n\nThalin, Gimli, Beregond (tactics deck)\n\n \n\nOri, Thorin, Dain (dwarf deck)\n\n \n\nAragorn (lore), Boromir (leadership), Mirlonde (Gondor deck)\n\n \n\nGlorfindel, Eleanor, Frodo (spirit deck)\n\nEdited August 10, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836279","commentId":836279,"userName":"leptokurt","timestamp":1376165410,"content":"> I appreciate the input lepto we actually were replaying this recently for the first time since we got it and beat it which is what prompted me to start this thread. Three player game and Our layout was actually gimli, thalin, battlemaster, etc and an entire deck dedicated to threat reduction and treachery cancelation with a side of healing.\n> \n> The decks were great. Designed to battle quest if not to beat that specific scenario\n> \n> Who was playtesting this with any number of players and thought this was easy? Has anyone here beaten this quest the majority of the time they played it with any deck setup? If so please explain in detail\n\nThank you!\n\n \n\nWell, it certainly ain't easy. What helped me in my last game was the Palantir. It's really helpful, as it helps you planning your next steps (Southern Support!). Of course you still have to take some risks, but the dwarf synergies alone allow you to use a minimum of characters. Strong Leadership was also very helpful btw, had it in my starting hand.\n\n \n\nAnother trick I used was Bergond, Spear of the Citadel, Thalin and Fresh Tracks. That way you can kill a Haradrim Elite while it is still in the staging area.\n\n \n\nI was able to defeat Ithilien in solo mode at a rate of 60 percent. I used Beorn as a hero and new Boromir to boost Celador's WP. Beregond was left as my defender. Explored the Ithilien Road and tried to take out the enemies one by one afterwards.\n\n \n\nCompared to AoO I think Ithilien is harder in solo mode, while AoO is still a bit harder in two player mode. But AaO feels better scaled to multiplayer and it offers you some player cards with great synergie effects. If i had to rate ithilien I'd give it an 7-8. It becomes a lot harder with more players though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836281","commentId":836281,"userName":"mr.thomasschmidt","timestamp":1376165455,"content":"> The game is designed for 1-2 players (where II is certainly beatable) after all and should be designed accordingly.\n\nFinally someone else saying it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] IT'S A 1-2 PLAYER GAME. If you get it to work with more, super, if not, make adjustments so it works since it isn't a naturally 3+ player game.\n\n5+ point for your remark leptokurt :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836370","commentId":836370,"userName":"asfaloth","timestamp":1376178969,"content":"Best of Ithilien is that according to the story of the quest you are supposedly ambushing the southerners. What a wonderful ambush when you get your ass kicked by one of the treacheries or enemies of this \"witty\" quest. Brilliant commanders we have in the gondorian armies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836401","commentId":836401,"userName":"booored","timestamp":1376182399,"content":">  \n> \n> > The game is designed for 1-2 players (where II is certainly beatable) after all and should be designed accordingly.\n> \n> Finally someone else saying it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] IT'S A 1-2 PLAYER GAME.\n\nI've been saying this until I was blue in the face from the day the game came out. Still even so I think that the quest base is so large now that you can find something for all formats now. This is what I was saying before in my first post. The game is large enough now as in has a lrge enough pool of quests, that FFG can start to add quest that are designed for less used formats, Some you will find 4 players much harder, and some ust right and some easy as hell. I do not think it is unreasonable of FFG to build a quest now and then for any given formate of the game. Just because a scenario sucks in solo, doesn’t mean it sucks in 2 player, just cause one sucks in 2 player doesn’t mean it sucks in 4. Sure people want to play every quest in their group, but I would rather have the occasional targeted quest than generic ones. I mean we have what... 32 quests now and counting. Surely there are some that are good in that for your formate and play style. Every single one dosn't need to match someones personal tastes.\n\n \n\n>  \n> \n> >  \n> > \n> > No, your not allowed to share any information at all. All cards and all things like Denathor looking at the encounter deck or quest effects and stuff are 100% hidden choices. Your not even allowed to mention the card names that you are going to use in a play. What makes this co-op experience so great is that so much is based on trust with your partners and unlike many co-op you can not have one player \"controlling\" the game. Basically all infomation apart fomr what si revealed on the table to is hidden and illegal to talk about.\n> > \n> >  \n> \n> Here are the Table Talk rules from the Core Set:\n> \n>  \n> \n> Players are permitted and encouraged to talk to one another during play, and to work as a team to plan and execute the best course of action. Players can discuss anything they would like, but they cannot name or read out loud directly from cards in their hand, or from cards that they have seen but the rest of the players have not.\n> \n>  \n> \n>  \n> \n> So, you are allowed to share information - nothing prohibits that - you just can't read from a card nor can players name a card.\n> \n>  \n> \n> Nothing here says you can't hint at what you have, though (\"I have a wizard friend that can enter play,\" for example).\n> \n>  \n\n \n\nThis is probably its own thread, but I'll just be quick, if it takes off I'll move the posts it a new thread.\n\n \n\nStill this is not how I interpret  this ruling. For starters using code words or \"a wizard might show up and then leave to help us in this phase\" imo is a sneak way to dodge the rules. While it isn't technically cheating it is breaking the spirit of the rules. I mean you may as well just say the card name, this is obviously cheating. There are quest cards that say \"reveal to current player\" and others that say \"reveal\". Why is this distinction there is you can just tell everyone what card you are peeking at in the deck, it is there due to the 2nd part of the sentence you quoted that I underlined. So Denathor, for example is not a group decision. The Hunt for Golum 2a is NOT a group decision. Only the first player can look and choose the cards and is NOT allowed to discuss them.\n\n \n\nI interpret the \"discuss anything\" text as anything to do with PUBLIC cards.\n\n \n\nThis idea is what really elevates this game into something special. It returns the game to a more CCG like feeling where you can have your partner do some amazing combo to t=save the day, right out of nowhere. A real \"wow that was awesome\" moment. I also think this is hidden information severely reduces the \"analysis paralisis\" that can occur in the game, greatly speeding it up and completely removes \"leader syndrome\" that all co-op games can suffer.\n\n \n\nStill what it dose that is great beyond all this is form trust between players. Something I feel is so thematic and makes the game a billion times better. You need to trust your friend is playing well, not tell him how to play well. As a team you have to have each others back and both be good players. This is like falling backward and having your mate catch you, trust, honour and ability makes a fellowship and playing the table talk rules correctly fosters all of this.\n\n \n\nThe table talk rule and its restriction on communication is probably the best game design in the entire game, it amazes me people pay ignoring it.\n\n \n\n \n\n> So I just won a 4 handed game. Thalin killed 3 of the bats, Palantir got used quite often, Eleaonor cancelled some Blocking Wargs.\n\nAnd exactly how long did this take you to get a working deck and a good run? Not long I woudl think, maybe build it and then 1 or 2 games to tweak the deck.. if that.\n\n \n\nStill more importantly how GREAT did it feel when you won.. you achieved something right... that was fun yea? Do you come away from quest you crush with that same feeling ?\n\nEdited August 11, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836433","commentId":836433,"userName":"Dain Ironfoot","timestamp":1376186091,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > No, your not allowed to share any information at all. All cards and all things like Denathor looking at the encounter deck or quest effects and stuff are 100% hidden choices. Your not even allowed to mention the card names that you are going to use in a play. What makes this co-op experience so great is that so much is based on trust with your partners and unlike many co-op you can not have one player \"controlling\" the game. Basically all infomation apart fomr what si revealed on the table to is hidden and illegal to talk about.\n> > > \n> > >  \n> > \n> > Here are the Table Talk rules from the Core Set:\n> > \n> >  \n> > \n> > Players are permitted and encouraged to talk to one another during play, and to work as a team to plan and execute the best course of action. Players can discuss anything they would like, but they cannot name or read out loud directly from cards in their hand, or from cards that they have seen but the rest of the players have not.\n> > \n> >  \n> > \n> >  \n> > \n> > So, you are allowed to share information - nothing prohibits that - you just can't read from a card nor can players name a card.\n> > \n> >  \n> > \n> > Nothing here says you can't hint at what you have, though (\"I have a wizard friend that can enter play,\" for example).\n> > \n> >  \n> \n>  \n> \n> This is probably its own thread, but I'll just be quick, if it takes off I'll move the posts it a new thread.\n> \n>  \n> \n> Still this is not how I interpret  this ruling. For starters using code words or \"a wizard might show up and then leave to help us in this phase\" imo is a sneak way to dodge the rules. While it isn't technically cheating it is breaking the spirit of the rules. I mean you may as well just say the card name, this is obviously cheating. There are quest cards that say \"reveal to current player\" and others that say \"reveal\". Why is this distinction there is you can just tell everyone what card you are peeking at in the deck, it is there due to the 2nd part of the sentence you quoted that I underlined. So Denathor, for example is not a group decision. The Hunt for Golum 2a is NOT a group decision. Only the first player can look and choose the cards and is NOT allowed to discuss them.\n> \n>  \n> \n> I interpret the \"discuss anything\" text as anything to do with PUBLIC cards.\n> \n>  \n> \n> This idea is what really elevates this game into something special. It returns the game to a more CCG like feeling where you can have your partner do some amazing combo to t=save the day, right out of nowhere. A real \"wow that was awesome\" moment. I also think this is hidden information severely reduces the \"analysis paralisis\" that can occur in the game, greatly speeding it up and completely removes \"leader syndrome\" that all co-op games can suffer.\n> \n>  \n> \n> Still what it dose that is great beyond all this is form trust between players. Something I feel is so thematic and makes the game a billion times better. You need to trust your friend is playing well, not tell him how to play well. As a team you have to have each others back and both be good players. This is like falling backward and having your mate catch you, trust, honour and ability makes a fellowship and playing the table talk rules correctly fosters all of this.\n> \n>  \n> \n> The table talk rule and its restriction on communication is probably the best game design in the entire game, it amazes me people pay ignoring it.\n\n \n\nwhere as this is the most important part to me: \"Players are permitted and encouraged to talk to one another during play, and to work as a team to plan and execute the best course of action. Players can discuss anything they would like\"\n\n \n\nyou can't make the best plan if you can't discuss what you'd like to play, commit, etc. either way, no real tournament system for this game, so it really doesn't matter.\n\nEdited August 11, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836438","commentId":836438,"userName":"booored","timestamp":1376186568,"content":"> you can't make the best plan if you can't discuss what you'd like to play, commit, etc. either way, no real tournament system for this game, so it really doesn't matter.\n\n \n\nwell commuting to quests, tactics in handling engagements, blocking and attacking assignments, talkign about game threats, about who has card draw priority etc etc is all able to be done using public information.  There are plenty of tactics and discussion to be had with out violating these rules.\n\n \n\nBut for example, you are not allowed to discuss hidden information in your hand, this is directly in the rules, nor can you discuss hidden information form the encounter deck, this is also in the rules. A surprising upshot is this is that you can not say cast a unexpected courage and then go \"who wants this\" and discuss where it gets placed. This is hidden information, says right there in the rules you quoted. You have to trust your partner and accept his risk assessments, working as a true team not as extensions of each others will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836459","commentId":836459,"userName":"Dain Ironfoot","timestamp":1376188961,"content":">  \n> \n> > you can't make the best plan if you can't discuss what you'd like to play, commit, etc. either way, no real tournament system for this game, so it really doesn't matter.\n> \n>  \n> \n> well commuting to quests, tactics in handling engagements, blocking and attacking assignments, talkign about game threats, about who has card draw priority etc etc is all able to be done using public information.  There are plenty of tactics and discussion to be had with out violating these rules.\n> \n>  \n> \n> But for example, you are not allowed to discuss hidden information in your hand, this is directly in the rules, nor can you discuss hidden information form the encounter deck, this is also in the rules. A surprising upshot is this is that you can not say cast a unexpected courage and then go \"who wants this\" and discuss where it gets placed. This is hidden information, says right there in the rules you quoted. You have to trust your partner and accept his risk assessments, working as a true team not as extensions of each others will.\n> \n>  \n\n \n\nif we follow the letter of the law, you are incorrect. the rules simply say that one cannot read off of a card nor name any card in a player's hand.\n\n \n\nthere is nothing that (literally speaking) says you cannot ask: \"who would most benefit from a readying attachment?\" that neither names a card nor reads directly off of one. for all we know, someone is just asking a hypothetical question and doesn't even have UC or Cram or Fast Hitch in their hand!\n\n \n\nthis has been debated for ages and there has been no official ruling on it - probably b/c it doesn't really matter.\n\nEdited August 11, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=836563","commentId":836563,"userName":"leptokurt","timestamp":1376209290,"content":">  \n> \n> \n> \n> And exactly how long did this take you to get a working deck and a good run? Not long I woudl think, maybe build it and then 1 or 2 games to tweak the deck.. if that.\n> \n>  \n> \n> Still more importantly how GREAT did it feel when you won.. you achieved something right... that was fun yea? Do you come away from quest you crush with that same feeling ?\n> \n>  \n\nI got there quite quickly, to be honest, after seriously building four decks. The most fun is when some of your planned strategies come true during the game, like Palantir/Lampmaker or, my personal highlight, Light the Beacons during turn 2. Just want to add that of course a four handed single player game cannot be compared to a real four player game. Have to admit that I shared all informations with myself, so the game was much more plannable.\n\n \n\nAnyway, it still felt good! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=838272","commentId":838272,"userName":"TragicTheBlathering","timestamp":1376371916,"content":"I think this is a pretty interesting topic..\n\nThis card is indicative of a core design problem of the game itself, not this particular quest. Well, problem might be to strong, I think the LoTR guys do a good job with this, but it IS a problem that comes form the game system itself, something even deeper than the rules. The core concepts of LoTR LCG is at fault.\n\nThis game is, at its core, a Deck Construction game. Meaning that players build constructed decks from a large card pool. I do not think any of this in in doubt. The problem is that there is no way a dummy deck can possibly compete with a constructed deck let alone one that uses a hand, so spell can be held for strategic opportunities. Sentinels of the Multiverse (a coop card game that pre-dates LoTR) got around this problem by having per-constructed player decks. So the game could be balanced at the design level unlike LoTR witch is incapable of being balanced.\n\nTo put simply, the player's constructed deck will always be more powerful than the quests, and only get more and more powerful while the quests stay the same as the player card pool grows. Also of note is that as the pool grows the designers themselves do not foresee every single combination and synergy that dedicated players will find among the 100s and 1000s of games played. This can lead to out of control decks and combos that could even require bans, restrictions and errata.\n\nSo.. how do you make a dummy deck that is able to pose any kind of challenge to a human mind running a constructed deck? Well you can't really but this is the challenge the designers had. They took the approach of \"set back\" cards. Strong powerful cards that completely ruin the players turns. Cards that pop up and force a massive change in the game state. Wiping characters, raising threat, removing attachments etc etc. These set back cards force deck construction restrictions and strategies, they basically give the dummy deck a chance to win. They make it into a game.\n\nSo why are there a few super powerful ones? Well you can not put to many in or the quest will be impossible, but if you put in to few the quest has no chance of speaking to the future. As the player deck grows, these super power cards are designed to stay threatening, to add the chance for the players to loose even long after they are released. Still you need it playable now so as I said you can not have to many. So you end up with a variance of powerful cards usually with 1 or 2 extreme cards. This is a natural result of the design choice of this game.\n\nThe problem is that when these cards hit, often, there is nothing you can do. This makes the player feel that luck is more important than skill. In fact there are quests where if the player constructs his deck to completely ignore some threats in the hope he simply doesn't encounter it he can on average score better and win more often. You see if you build a deck to counter all situations your deck becomes \"weaker\" and so dose your score. If you ignore a threat, every time it shows up you loose but when it doesn't you win, and as they are few in a deck you are more often than not going to get though the quest with out the threat showing up. In fact it is possible to get a higher win rate ignoring large setback cards, and dieing when they do show up, than making a deck that can handle them or playing around them.\n\nIn a 4 player game this variance is much lower. These cards are nearly assured to show up as you are drawing 4 each quest phase. Cards which I believe are NOT designed to be encountered every time you play, they are in a way a surprise \"got ya\" card that is supposed to show up every 3 or 4 games. I very much think this game is a 2 player game that can be played by 1,3 or 4.\n\nStill what choice do they have? This quest might be difficult now, but after the full outland deck is out, will it be as troublesome, let alone after a host of other releases to come? No.. it will not. While the flip a card - end of game problem this game has is terrible and i can see how so many people hate it due to the fact that you feel you are not playing, that skill has no meaning, that the only thing between you and loosing is what cards you drew of the encounter. This makes the player feel impotent and that his time deck building in meaningless. This game can be hugely frustrating, I know everyone that has played this game has had games that took less time than it took to set up. having your mate over and raving about this game setting it up and teaching and then being dead on turn 1 is just terrible.\n\nTo put simply.. \"flip a card and loose\" is unequivocally atrocious game design.\n\nStill, I am not sure what choice the designers have. They do very well with this game and the core system of it requires these cards, so what is the choice? if you remove them and make them easier than this quest will never be played in a few weeks let alone years."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88149-who-playtested-this-watcher-in-the-wood/?do=findComment&comment=840176","commentId":840176,"userName":"Troymk1","timestamp":1376523301,"content":"Firstly, the next person to spell lose as loose will get a head butt  I mean it  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] !!!!! \n\n \n\nSecondly,\n\n \n\nWhile meta game wise I have very little problem with your points here. This card (The watcher in the woods) is simply badly written.\n\n \n\nIt could still be an absolutely vicious card without making it an auto-loss in 3-4 player.  (And yes Boored and Glaurung, I know you are sitting on 3 Tests of Will each, because you're magic like that, no need to speak up)\n\n \n\nAs has been pointed out it could have been Amount of questing characters for each player. If the true intention was for the total amount in 2 player then word it amount of questing characters per player doubled. This gives the same overall effect (-ish) without nobbling 4 player games. "}]}