{"url":"https://community.fantasyflightgames.com/topic/88172-two-questions/","title":"Two Questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=835603","commentId":835603,"userName":"Khamul The Easterling","timestamp":1376086337,"content":"Behind Strong Walls question:\n\n \n\nSo when it says \"ready defending Gondor Character\" Does that mean you ready a character the just exhausted to defend?  Or does that mean you can ready a character already exhausted to defend? \n\n \n\nGoblin Cleaver question:\n\n \n\nSo when you \"exhaust a weapon\" does that mean you cant use that weapon anymore for that turn and it ready with your characters during the refresh phase?  Or do you just exhaust the weapon but that weapon can still do anything?\n\n \n\nThanks,\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=835672","commentId":835672,"userName":"richsabre","timestamp":1376090954,"content":"as for the first, i think that it is the same in that a character is only 'defending' until it has finished that particular attack. so there can only be 1 character (or sometimes more with card effects) who it can target. so i would say you exhaust the character who is then defending, and you have until the end of that attack to use the card....or am i missing something?\n\n \n\nthe weapon still function as normal so a rivendell blade would give -2 defense ready or exhausted. however obviously yew bow cannot be used again if it is exhausted. the weapons ready with the characters at the refresh phase"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=835726","commentId":835726,"userName":"Khamul The Easterling","timestamp":1376096990,"content":"Thanks \n\n \n\nSo what I was confused with for the first question is, can I use the card on a character who, for example, exhausted to quest, to defend an attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=835738","commentId":835738,"userName":"richsabre","timestamp":1376098692,"content":"oh i see now. no, i just read it as 'ready a character who has just exhausted to defend etc..'\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=835768","commentId":835768,"userName":"GrandSpleen","timestamp":1376103189,"content":"Behind Strong Walls -- use it during enemy attack resolution.  I think the character is considered to be \"defending\" only if they are declared the defender for an attack (so no, you can't use it to ready a character that was committed to the quest and was not declared a defender).  And would no longer be considered to be \"defending\" after step 4 of combat resolution (determining and placing combat damage).  \n\n \n\n\"Most relevant part of the manual:\n\nCharacters that are declared as defenders are only\nconsidered to be defending through the resolution of\nthe attack. Once an attack has resolved, the characters\nare no longer considered “defenders,” but they do\nremain exhausted.\" (p 18)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=835788","commentId":835788,"userName":"Khamul The Easterling","timestamp":1376106421,"content":"OK yeah.  I thought defending character might mean a character that is just going to be declared as a defender.  For example I am going to ready Beregond who had committed to the quest is going to be my defender so he is a \"defending\" character.  \n\n \n\nThanks you both for answering :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=846493","commentId":846493,"userName":"joezim007","timestamp":1377110398,"content":"Not sure why you would commit Beregond to a quest since he has no willpower, but, yea, you ready someone who is finishing up defending so that they can defend again, or attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=846499","commentId":846499,"userName":"richsabre","timestamp":1377110753,"content":"in siege beregond is amazing questing...so probably there, and not anywhere else"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88172-two-questions/?do=findComment&comment=848335","commentId":848335,"userName":"Khamul The Easterling","timestamp":1377271533,"content":"Yeah he's great in Cair andros.  I made a deck that beat cair andros solo 7/8 times. in the time I lost I got a mumak first round then i got a siege ram second round and it just got worse from there.  But yeah the deck I used absolutely crushed cair andros. I even won 2 games with a mumak on turn 2-3 and killed it both times. "}]}