{"url":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/","title":"Table Talk... what dose this mean and diose it matter?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836471","commentId":836471,"userName":"booored","timestamp":1376190063,"content":"In another lame complaint thread a interesting topic surfaced that I didn't want to take over that thread so I am moving it here....\n\n \n\nBasically... what constitutes table talk? Dose it matter and dose anyone care? Is there thematic reasons for it, and most importantly.. how do we define it?\n\n \n\n \n\n> just a quick side point. i think that you can share what is in your hands in this game though? at least we have been playing it that way whenever i have played with actual people (rather than the people in my head)\n> \n> rich\n\n \n\n> No, your not allowed to share any information at all. All cards and all things like Denathor looking at the encounter deck or quest effects and stuff are 100% hidden choices. Your not even allowed to mention the card names that you are going to use in a play. What makes this co-op experience so great is that so much is based on trust with your partners and unlike many co-op you can not have one player \"controlling\" the game. Basically all infomation apart fomr what si revealed on the table to is hidden and illegal to talk about.\n\n \n\n \n\n> where as this is the most important part to me: \"Players are permitted and encouraged to talk to one another during play, and to work as a team to plan and execute the best course of action. Players can discuss anything they would like\"\n> \n>  \n> \n> you can't make the best plan if you can't discuss what you'd like to play, commit, etc. either way, no real tournament system for this game, so it really doesn't matter.\n\n \n\n \n\n> well commuting to quests, tactics in handling engagements, blocking and attacking assignments, talkign about game threats, about who has card draw priority etc etc is all able to be done using public information.  There are plenty of tactics and discussion to be had with out violating these rules.\n> \n>  \n> \n> But for example, you are not allowed to discuss hidden information in your hand, this is directly in the rules, nor can you discuss hidden information form the encounter deck, this is also in the rules. A surprising upshot is this is that you can not say cast a unexpected courage and then go \"who wants this\" and discuss where it gets placed. This is hidden information, says right there in the rules you quoted. You have to trust your partner and accept his risk assessments, working as a true team not as extensions of each others will.\n\n \n\n \n\n> if we follow the letter of the law, you are incorrect. the rules simply say that one cannot read off of a card nor name any card in a player's hand.\n> \n>  \n> \n> there is nothing that (literally speaking) says you cannot ask: \"who would most benefit from a readying attachment?\" that neither names a card nor reads directly off of one. for all we know, someone is just asking a hypothetical question and doesn't even have UC or Cram or Fast Hitch in their hand!\n> \n>  \n> \n> this has been debated for ages and there has been no official ruling on it - probably b/c it doesn't really matter.\n\n \n\nWell you can speak about something like \"who would most benefit from a readying attachment?\".. this is public information as the allies or heroes are on the table in public space. What I believe this rule to be saying is that you are forbidden to PLAY the card and then discuss where to put it. The discussion should be a natural part of your planning. Many people cast a attachment then after it is cast ask who it should go on, this violates the rules. You can not say you have a readying attachment in hand, or that you are going to cast it. The decision to cast it and where it is going to be attached is soly on the player casting the spell, you can discuss the reasoning at any time of IF you should cast it, but the actual casting is a private decision. Is it a fine line in this example.. yes.. but there are other much more blatant examples that come from the same rule.\n\n \n\nAnd I think it dose matter, I think this rule greatly affects the way the game plays, add massive theme removes some problems with co-op in general and also makes things harder. You need to play with your mate and get into it, learn the decks, understand how each person plays and start to really gel as to independent yet co-operative team mates. I think this is distinct and different from just playing with no table talk. I mean why even have separate hands? Why not just play open handed and just use different staging areas. With out table talk, there is no trust, there is no risk. I like the idea of team members as indipendant working for the common good, not a team as some kind of amalgamation of all peopel into a single mind. This isn\\t co-op to me, and it usally degenerates into one player running the show.\n\nEdited August 11, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836505","commentId":836505,"userName":"Pharmboys2013","timestamp":1376196171,"content":"In the grand scheme of things, i dont think it matters a great deal...that being said; i do agree that the stricter \"table talk\" is enforced generally the better the play experience is.  I also think the \"table talk\" rules are pretty subjective between the players playing the game as the rule itself is so strict and refined it easily allows loopholes which starts a whole different argument on which is more important following the intent of what the rule is trying to do or just the literal wording of the rule itself.\n\n \n\ni also think who you're playing with has a lot to do with it as well.  I only have 1 other friend that plays this game so if i'm playing with him, we both dont require constant discussion especially about whats in the others hand almost without even realizing it.  On the other hand (no pun intended) if i'm playing with someone other than that 1 friend, its usually someone who is using my cards and its their first time, or has played so sparingly it might as well be their first time.  When thats the case its usually necessary for me to help them analyze what they should do and what they should play on whom and when.\n\n \n\nno wrong answers here really"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836542","commentId":836542,"userName":"MyNeighbourTrololo","timestamp":1376202461,"content":"I ignore this rule, seems utterly stupid for me. When I play multuplayer we both think and listen to each other rather than one taking over and controlling both players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836548","commentId":836548,"userName":"CaffeineAddict","timestamp":1376204024,"content":"As I pretty much only play solo, I've never really given this much thought. This would mean that a solo player playing multiple decks would actually be at an advantage over a group of players. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836556","commentId":836556,"userName":"mr.thomasschmidt","timestamp":1376207115,"content":"We try to follow the rules and only uses hints. IF it is fun. If we feel more like talking and discussing strategies and the cards to use we do that. We don't really care as long as everyone is enjoying the game and it's fun. I don't think you get a lesser experience with a more \"silent\" game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836581","commentId":836581,"userName":"Rapier1","timestamp":1376214358,"content":"Without established tournament play of some kind this is mainly a personal preference issue. \n\n \n\nI suspect that more casual players will probably discuss everything. More experienced players probably won't mention anything (I don't tend to ask who wants Unexpected courage because I decide for myself whether I want it or the other player needs it more). Not out of trying to adhere strictly to the rules but because they don't feel the need to advise.\n\n \n\nI'd prefer to play with hands hidden - I'd struggle not to object if someone else played unexpected courage on the wrong hero though.\n\nEqually my wife and I often play together and whenever our baby is also present we essentially have to play with revealed hands (because someone will always have to stop the baby from eating the cards); if we refused to do this we would play half as often as we do (and we already can't play most weeks) or one game could take 2 or 3 hours with a lot of frustrating stop/starts. \n\nI don't think the game is spoiled either way. I could see how one player could make all the decisions with open hands, but I think that also would depend on the people involved more than the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836609","commentId":836609,"userName":"mr.thomasschmidt","timestamp":1376218889,"content":"> Without established tournament play of some kind this is mainly a personal preference issue. \n> \n>  \n> \n> I suspect that more casual players will probably discuss everything. More experienced players probably won't mention anything (I don't tend to ask who wants Unexpected courage because I decide for myself whether I want it or the other player needs it more). Not out of trying to adhere strictly to the rules but because they don't feel the need to advise.\n> \n>  \n> \n> I'd prefer to play with hands hidden - I'd struggle not to object if someone else played unexpected courage on the wrong hero though.\n> \n> Equally my wife and I often play together and whenever our baby is also present we essentially have to play with revealed hands (because someone will always have to stop the baby from eating the cards); if we refused to do this we would play half as often as we do (and we already can't play most weeks) or one game could take 2 or 3 hours with a lot of frustrating stop/starts. \n> \n> I don't think the game is spoiled either way. I could see how one player could make all the decisions with open hands, but I think that also would depend on the people involved more than the rules.\n\nThat was an excellent way to put it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836650","commentId":836650,"userName":"richsabre","timestamp":1376224920,"content":"i have also ignored it when i have played multiplayer. i didnt realise it existed, but now it does i dont think i will use it- it seems to me to ruin the fun of creating cross table strategies ahead of the game.\n\n \n\nwhether this is cheating or not doesnt really matter to me. the game will remain the same, so as others suggest, its a personal thing i guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836709","commentId":836709,"userName":"Rapier1","timestamp":1376231145,"content":"> i have also ignored it when i have played multiplayer. i didnt realise it existed, but now it does i dont think i will use it- it seems to me to ruin the fun of creating cross table strategies ahead of the game.\n> \n>  \n> \n> whether this is cheating or not doesnt really matter to me. the game will remain the same, so as others suggest, its a personal thing i guess.\n\n \n\n> i have also ignored it when i have played multiplayer. i didnt realise it existed, but now it does i dont think i will use it- it seems to me to ruin the fun of creating cross table strategies ahead of the game.\n> \n>  \n> \n> whether this is cheating or not doesnt really matter to me. the game will remain the same, so as others suggest, its a personal thing i guess.\n\n \n\n \n\nWell you can still create a cross table strategy (including designing decks to work together) - you're just relying on two minds instead of one during the implementation in game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836738","commentId":836738,"userName":"richsabre","timestamp":1376234299,"content":"but if you cannot see the cards in the other's hand you are losing out on certain plays which you would otherwise be able to use....im trying to think of an example....\n\n \n\nperhaps something like renewed friendship. if you do not know that the other player has it, then you may have an attatchment that is not a priority to use, whereas it would be if you knew the other play had the renewed friendship, therefore you are losing out on gaining the benefit of using the card, which could help in a key moment"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=836928","commentId":836928,"userName":"mr.thomasschmidt","timestamp":1376254218,"content":"> > i have also ignored it when i have played multiplayer. i didnt realise it existed, but now it does i dont think i will use it- it seems to me to ruin the fun of creating cross table strategies ahead of the game.\n> > \n> >  \n> > \n> > whether this is cheating or not doesnt really matter to me. the game will remain the same, so as others suggest, its a personal thing i guess.\n> \n>  \n> \n> > i have also ignored it when i have played multiplayer. i didnt realise it existed, but now it does i dont think i will use it- it seems to me to ruin the fun of creating cross table strategies ahead of the game.\n> > \n> >  \n> > \n> > whether this is cheating or not doesnt really matter to me. the game will remain the same, so as others suggest, its a personal thing i guess.\n> \n>  \n> \n>  \n> \n> Well you can still create a cross table strategy (including designing decks to work together) - you're just relying on two minds instead of one during the implementation in game.\n\nNope. Still two minds playing it out. No difference than with closed cards as you are still two players. You just get to play cooler moves than with closed cards that's all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=837118","commentId":837118,"userName":"booored","timestamp":1376275886,"content":"I think the game plays well either way, but imo strict adherence to the table talk rules make for much better games \"cooler\" moves so to speak and the trust angle is just such a huge part of it and matches the theme of LoTR so well. It is a bit harder, but not that much harder, like if someone casts UC on what you consider the incorrect hero, then there is no opportunity to change that choice. As it is the choice of the caster alone, and also things like in Hunt for Gollum I mentioned earlier, but having these decision secret (as it says in the rules) adds a level of independence to players. many players I have heard of feel like that are not playing the game but are little more than borg robots. Every decision is decided in the collective. Giving decisions soloy to individuals makes the game so much more personal and interesting, and as I and others have said can lead to amazing plays coming from nowhere where you mate saves the day. Plays you talk about for years. So I do not think it is needed, but I think it adds so much to the game. We almost always play this way unless we are teaching. There are tons adn tons of tactics to discuss with out breaking these rules. When I run the nights at the store I try ot get people to play this way and it is amazing how many peopel come back and say it was better, and how many players do not even realise how forcful their personalities are and how much they subjugate the other players. They only notice this when they are foced not to speakl and the other players suddenly have a much betetr experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=840750","commentId":840750,"userName":"Mr Coffee","timestamp":1376584512,"content":"A strict adherance to the rules of \"table talk\" for this game has never mattered much to me, but I usually try to follow the \"letter of the law\" and not talk specific cards/names.  The rules essentially create a \"work around\" in themselves by saying you are free to discuss everything- concepts, mechanics, etc- as long as you don't say \"I have Gandalf and Sneak Attack in my hand!\".  But just through normal dialogue, you can generally infer to your table-mates that you will be able to deal with a particular enemy, questing situation, etc.  Typically, if playing with friends that are familiar with the cards, they will probably be able to figure out what I've got or planning to do based on the heros I have down, my ally set up, the sphere(s) that I appear to be playing.  I DO like leaving a LITTLE room for the element of surprise, because it is a great feeling to think your collective backs are against the wall, then have one of your friends drop out a combo like that, or drop a trap or Feint out that negates a troubling enemy...  About the only time I/we totally violate the \"no naming\" rule is if we are introducing the game to a newer player, and we'll go open-handed for their learning experience for at least the first game or two.  That way it levels the field and he/she gets a lot more experience seeing what cards/combos are available in other people's hands, what the thought processes are behind our decisions on playing, what to discard, etc.  Can really speed up their learning process.  When playing truly open-handed, the key is NOT to just \"tell\" someon how to play.  It can actually play SLOWER sometimes, because I like to show them what all their options are in their hand and what the consequences might be, then let them choose what their play will be.  it also lets me learn a lot about them and what their style of play is going to be... are they aggressive, cautious, etc...\n\n \n\nIn the end, everyone seems to be saying the same thing:  The game is intended to be a FUN co-op experience.  Until there is a tournament format developed (I honestly don't know that we will ever see one... I'm okay with that!), play the game the way that provides you with the fun you want OR the challenges you want!\n\nEdited August 15, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88231-table-talk-what-dose-this-mean-and-diose-it-matter/?do=findComment&comment=841235","commentId":841235,"userName":"Ellareth","timestamp":1376604094,"content":"> ......like if someone casts UC on what you consider the incorrect hero, then there is no opportunity to change that choice......\n\n \n\nThis is one of the reasons why try and follow strick table talk rule whenever possible.\n\nIt's no big deal for me if someone wants to play with virtually open hand, but abiding by Table Talk rule forces me to not be a 'control freak'.\n\n \n\nIf I knew sneak attack and Gandalf is in your hand, I would probably 'tell you' exactly what to do to get rid of that Hill Troll,\n\nIf I knew you have Hasty Stroke in your hand, I would probably 'tell you' to take some undefended attacks and heal if off later inorder to save action for attacking.\n\nIf I knew you had Unexpected Courage in your hand, I would probably 'tell you' to put it on which hero.\n\n \n\nI'm just that type of person... it's not like I'm unreasonable or mean, I just can't help 'suggesting' what I think is 'most efficient' way of playing.\n\nIf the person holding the card wishes to hint what he has to let the group know it is probably safe to take undefended attacks, or ask if we would benefit from having consistent readying effect on X hero, I'm totally fine with that.\n\nI 'think' the table talk rule from the way it is written simply prevents players from just downright showing/reading their hands to prevent one person playing a multi-handed game while others just do what they are told to do."}]}