{"url":"https://community.fantasyflightgames.com/topic/88250-the-lotr-lcg-the-hobbit-lcg/","title":"The LOTR LCG The Hobbit LCG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88250-the-lotr-lcg-the-hobbit-lcg/?do=findComment&comment=836754","commentId":836754,"userName":"Jeorrkilnt","timestamp":1376236333,"content":"I was wondering if the Lord of the Rings lcg and the hobbit lcg cores were compatible with one another. For instance, if you have both and wanted to play four players, could you two players use decks from the original and the other two use from the hobbit expansion?\n\nThanks, Johnny\n\nEdited August 11, 2013 by Jeorrkilnt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88250-the-lotr-lcg-the-hobbit-lcg/?do=findComment&comment=836762","commentId":836762,"userName":"mr.thomasschmidt","timestamp":1376236756,"content":"Do you mean the Hobbit expansion pack for the Lord of the Rings LCG core set? Is so, it is possible to make 4 decks out of these two sets combined. Of cause, it won't be \"real\" decks unless you have 50 cards pr. deck and thus it's wise to get some more adventure packs or at least both the Hobbit expansion packs.\n\n \n\nIf this isn't what you mean please explain in more details :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] also there is no The Hobbit LCG game. Those two boxes are only expansions for the LOTR LCG game. You need at least the core set to play the Hobbit quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88250-the-lotr-lcg-the-hobbit-lcg/?do=findComment&comment=836781","commentId":836781,"userName":"richsabre","timestamp":1376238164,"content":"hi,\n\nthe hobbit isnt a 'core set' like the true core set. it needs the actual core set to work.\n\n \n\nso to put that clearer, to play the hobbit saga set you need the core set. now you can play 4 player with just the core set, provided you are happy playing with the 30 card starter decks.\n\n \n\nadd the saga set and you can again play 4 players, though as mr.thomasschmidt points out it again will likely need you to play the non-tounrmanet 30 card decks\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88250-the-lotr-lcg-the-hobbit-lcg/?do=findComment&comment=836926","commentId":836926,"userName":"Jeorrkilnt","timestamp":1376253939,"content":"Ok sweet. That was what I was wondering. I took a gander at it and thought it as another core set. But now I understand it is another expansion. Thank you.\n\nJohnny"}]}