{"url":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/","title":"Theoden and Tactics mono deck?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838232","commentId":838232,"userName":"Nickpes","timestamp":1376367192,"content":"Well, I know it is early but since we know that on Morgul Vale we will get a Theoden hero who boosts Tactics willpower, do you believe that it could make Tactics more playable as a solo deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838254","commentId":838254,"userName":"MyNeighbourTrololo","timestamp":1376369596,"content":"No. But I do believen it can make a difference in a multi-player game, where alot of tactics heroes present."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838323","commentId":838323,"userName":"Dain Ironfoot","timestamp":1376376759,"content":"> Well, I know it is early but since we know that on Morgul Vale we will get a Theoden hero who boosts Tactics willpower, do you believe that it could make Tactics more playable as a solo deck?\n\n \n\nnot in the slightest. it adds a grand total of 3 WP - this is puny. additionally, most tactics heroes starting base WP is 0 or 1 WP - so adding 3 really doesn't do much.  and let's not forget the allies aren't adding much WP either! pretty crummy. on top of that, most tactics heroes have abilities that revolve around attacking or defending - something they can't do in a solo mono-tactics deck if they are questing, so their abilities become worthless.\n\n \n\nall in all, theoden (at this point) seems very disappointing.\n\n \n\nbut, if you included the highest WP heroes, like Gimili (2), Brand (2) and Theoden (2) and regularly quest with them - that's at total 6 WP - 9 with Theoden's ability. Only a few Eagles, Beorn, the Beekeepr, or Bofur would be adding anymore WP (and they are all pricey). Leaving it to your allies to do all of the attacking and defending - which is a tall order, I think.\n\n \n\nas much as I love tactics, WP questing just isn't for them.\n\nEdited August 13, 2013 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838333","commentId":838333,"userName":"Nickpes","timestamp":1376377661,"content":"You seem to be right Dain. I also like tactics but do not use them a lot. Maybe we have to wait for the other cards, but reading your post you are correct for the time being"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838338","commentId":838338,"userName":"JsBingley","timestamp":1376377876,"content":"Trained for War [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/against-the-shadow/the-druadan-forest/trained-for-war-tdf] and Hama for more Trained for War [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/against-the-shadow/the-druadan-forest/trained-for-war-tdf]\n\nEdited August 13, 2013 by JsBingley"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838400","commentId":838400,"userName":"richsabre","timestamp":1376386253,"content":"i use tactics a lot since starting to play multihanded, however theoden's boost wont have much place in my decks as i use tactics as a support deck with a questing deck. i guess the boost may come in handy in the first round but usually my decks dont function that way\n\nwhat i am looking forward to is the horse\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838574","commentId":838574,"userName":"leptokurt","timestamp":1376401137,"content":"Of course it does. I already proxied him when they revelealed Theoden, and won against JdtA more often than I lost. And that was before Trained for War and that exellent Book of Eldacar. The WP bonus helps a ot during the early turns until you can play your allies.\n\nEdited August 13, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838608","commentId":838608,"userName":"Narsil0420","timestamp":1376403279,"content":"If you had a mono-tactics deck with Thalin/Theoden/someone else, you could use the new mount to have Thalin and Theoden quest and then ready Theoden, that would prove some solid willpower and direct damage. I think that mainly we have to just appreciate Theoden's boost for himself and see any other boost as a bonus."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838658","commentId":838658,"userName":"Pharmboys2013","timestamp":1376405434,"content":"Mono-Tactics can already function ok solo so long as you are recycling Trained for War everyturn with Hama as previously mentioned.  I have a deck right now thats working ok in that regard using Hama, Beregond, and Boromir (tactics)...but onto Theoden...\n\n \n\nI think Theoden would work quite well with the original Boromir.  Questing for 5 from the start is a respectable number.  The main problem with that however is that between the two heroes you already have a starting threat of 23 so whomever you select as your 3rd hero, you will still have a decently high starting threat...not ideal with Boromir's ability as you would likely hit 50 a lot of games\n\n \n\nNow that i say that tho, if you were to use Theoden, original Boromir, and Spirit Glorfindel, you would have an OK starting threat of 28, access to all the spirit threat lowering cards, able to quest out the gate with 8, and access to Theoden's mount to ready him after questing. \n\n \n\nAll your characters would have multiple action potentials per turn, you can even run the now subdued imaldris stargazer/zigil miner combo to ensure you have resources for the mount and even Gondorian Fire for Boromir....i like this the more i think about it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838711","commentId":838711,"userName":"HeavyKaragh","timestamp":1376408158,"content":"Theoden and two 2WP heroes (choose between Gimli, Elladan, Brand and Bard) is a total of 9 WP. I'd say that makes a very good starting WP and makes things easier for Tactics. Remember that Spirit has a maximum of 9WP too (Eowyn, Glorfindel and one 2WP hero). Both Leadership and Lore's maximum starting WP is 7.\n\nAnyway, the problem of Tactics with the WP is the lack of cheap allies with 1WP: the only Ally with Willpower for a cost less than 4 is Bofur, and is Unique. This makes Pelargir Envoy a must for Tactics monosphere decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838897","commentId":838897,"userName":"Pharmboys2013","timestamp":1376419546,"content":"> Theoden and two 2WP heroes (choose between Gimli, Elladan, Brand and Bard) is a total of 9 WP. I'd say that makes a very good starting WP and makes things easier for Tactics. Remember that Spirit has a maximum of 9WP too (Eowyn, Glorfindel and one 2WP hero). Both Leadership and Lore's maximum starting WP is 7.\n> \n> Anyway, the problem of Tactics with the WP is the lack of cheap allies with 1WP: the only Ally with Willpower for a cost less than 4 is Bofur, and is Unique. This makes Pelargir Envoy a must for Tactics monosphere decks.\n\nThe problem with that however is that you are just not taking advantage of the heroes your actually using. While contributing less willpower, it would likely be more worth while to put in Thalin instead of wasting Gimli, Elladan, and especially Brand or Bard just to get 1 extra WP. Plus you compare the max WP to other spheres which I think is an unfair comparison since the other spheres have the means to attain willpower outside of their heroes so they would rarely ever quest with all 3 of them.\n\nAlso as previously mentioned if you're questing with all your heroes, then your allies need to do all the attacking and defending. Which tactics is certainly able to, but considering the best options right now for both are the Knight of Minas Tirith and the Defender of Rammas, it can take time to set up. Being lucky enough to get them in your starting hand and you'll still have to wait till turn 2 to get them both out\n\nI think Theoden will see best use likely splashed with other spheres. Just contributing 3 WP or 3 ATK can be quite useful to either spirit or lore; the former of which already has some thematic Rohan synergies as well\n\nEdited August 13, 2013 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=838985","commentId":838985,"userName":"Teamjimby","timestamp":1376424424,"content":"I think you could make Theoden/Thalin/Beregond work.  Between Thalin and Beregond defending (with spear), you don't really need anyone to attack.  Or, if you are counting on allies and the occasional Theoden attack to do damage, you could swap out Thalin for Merry and get a 6 threat 3 willpower questor. \n\nEdited August 13, 2013 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=839072","commentId":839072,"userName":"Khamul The Easterling","timestamp":1376429198,"content":"> I think you could make Theoden/Thalin/Beregond work.  Between Thalin and Beregond defending (with spear), you don't really need anyone to attack.  Or, if you are counting on allies and the occasional Theoden attack to do damage, you could swap out Thalin for Merry and get a 6 threat 3 willpower questor. \n\nhmmm maybe so.....\n\n \n\nI think that there just might be a cool attachment for Theoden that could possibly help make a mono tactics deck work.  I think ffg is trying to make a solo mono tactics deck work since they gave us trained for war, theoden and possibly more in the upcoming packs.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=839117","commentId":839117,"userName":"Dain Ironfoot","timestamp":1376432148,"content":">  \n> \n> > I think you could make Theoden/Thalin/Beregond work.  Between Thalin and Beregond defending (with spear), you don't really need anyone to attack.  Or, if you are counting on allies and the occasional Theoden attack to do damage, you could swap out Thalin for Merry and get a 6 threat 3 willpower questor. \n> \n> hmmm maybe so.....\n> \n>  \n> \n> I think that there just might be a cool attachment for Theoden that could possibly help make a mono tactics deck work.  I think ffg is trying to make a solo mono tactics deck work since they gave us trained for war, theoden and possibly more in the upcoming packs.  \n> \n>  \n\nexcept, theoden and trained for war don't exactly mesh well together..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=839145","commentId":839145,"userName":"Khamul The Easterling","timestamp":1376434244,"content":"they dont have to.  As we all know, tactics already has lots of attack so you could do a little normal questing cuz of theoden and then do some of your plenty attack questing with trained for war"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=839339","commentId":839339,"userName":"Gizlivadi","timestamp":1376451528,"content":"I think Theoden was designed not to be used in all quests or in all mono tactics decks. He'll be great in some of the early quests and some Dwarrodelf quests I think especially in early game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=839422","commentId":839422,"userName":"Glaurung","timestamp":1376463681,"content":"Theodred is amazing for 3-4 player game where 2 player use tactic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893197","commentId":893197,"userName":"Nickpes","timestamp":1382351000,"content":"Bring this up since it is the next AP (for which we have no other clue except Theoden himself and the Rohan Horse) \n\n \n\nIn the past few weeks I try to play starting from the first core set, all the adventures solo with a mono-tactics deck. So far I have managed to win the two core set (lost Dol Guldur) and the first two of the mirkwood cycle. Also won the massing at Osgiliath which I tried just for fun. I have not tried any more since time is not enough but I plan to try each one a couple of games. (I have also won all the Heirs of Numenor deluxe quests with the same deck)\n\n \n\nMy Heroes are always the same, Hama, Beregond and Legolas, as is also my deck (4 pieces of Gandalf)\n\n \n\nWhat I noticed is that the ones I won where the ones that either I had Radagast and a couple of misty mountain eagles early in the game , or the ones I had the event card that made the quest battle and recycling it with Hama all the time. \n\n \n\nI tend to believe that most quests (certainly not all of them) could be playable with Theoden and a mono tactics deck after all. I also hope that apart from theoden, there will be in the Morgul Vale AP other tactic cards that might help this way"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893277","commentId":893277,"userName":"richsabre","timestamp":1382360789,"content":">  \n> \n> My Heroes are always the same, Hama, Beregond and Legolas, as is also my deck (4 pieces of Gandalf)\n> \n>  \n\nthats a good line up - but do you mean you have 4 gandalfs in your deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893301","commentId":893301,"userName":"Tracker1","timestamp":1382363121,"content":">  \n> \n> Now that i say that tho, if you were to use Theoden, original Boromir, and Spirit Glorfindel, you would have an OK starting threat of 28, access to all the spirit threat lowering cards, able to quest out the gate with 8, and access to Theoden's mount to ready him after questing. \n> \n>  \n> \n> All your characters would have multiple action potentials per turn, you can even run the now subdued imaldris stargazer/zigil miner combo to ensure you have resources for the mount and even Gondorian Fire for Boromir....i like this the more i think about it\n\nFor solo play this is what i have concluded as well. In a mono-tactics solo deck Theoden would only be able to quest. He will need the mount card to get any more use out of him. so a spirit hero will be necessary unfortunately. And of course there is always Sp Glorfindel to fill the void.\n\nWith these heroes you could quest with them for 8 wp. If LoV is on Glorfindel and Theoden has a mount they will be ready to attack. Boromir with Gondorian shield will probably be your main defender. If all 3 go in on the attack they will be swinging for 9.\n\nSeems pretty solid all the way around with out thinking about the other player cards. However, the theme of all this is not fitting.\n\nBut what other sprit option would work. With Eowyn starting threat is 32, Eleanor 30. These are a bit high for my taste.\n\nThe mount being spirit, really limits the solo players deck building options for Mono- tactics, which really needs access to a hero readying cards. Why could the mount not have been a tactics warhorse or something like that. Hopefully, there will be a tactics card that allows Theoden to search the players deck for a mount and attach it to a hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893339","commentId":893339,"userName":"Thanatopsis","timestamp":1382366060,"content":"> Theodred is amazing for 3-4 player game where 2 player use tactic.\n\nI'm excited to try four-player mono-tactic with Théoden.  That's 12 WP being added to the table!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893461","commentId":893461,"userName":"Nickpes","timestamp":1382373867,"content":">  \n> \n> >  \n> > \n> > My Heroes are always the same, Hama, Beregond and Legolas, as is also my deck (4 pieces of Gandalf)\n> > \n> >  \n> \n> thats a good line up - but do you mean you have 4 gandalfs in your deck?\n> \n>  \n\n \n\nyes, I include all copies of hm from the core set, but to be honest, I rarelly use more than two in game cause of the 5 cost"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893465","commentId":893465,"userName":"richsabre","timestamp":1382374129,"content":"im afraid you can only use 3 copies of any card (by title) in a deck ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png].\n\nrich\n\nEdited October 21, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893548","commentId":893548,"userName":"13thcaesar","timestamp":1382379592,"content":"> Theodred is amazing for 3-4 player game where 2 player use tactic.\n\nYes, for four players Theoden is a diamond. in my four decks I have five tactics characters (Gimli, Legolas, Thalina, Beregond and Brand Son of Bain). decks are based on synegry Dwarves and Gondor + Rohan  (Mutual Accord + Astonishing Speed / Eomund or For Gondor - great combo!)\nAnd Theoden is Rohan.\nWith him maybe I eventually beat Redhorn Gate!\n \n \nI know that many players are disappointed Gondor, the new cycle is expected that each will receive power as before the dwarves. The fact that pure Gondor did not show too much, but together with Rohan can also be powerful - an alliance of the two factions can really show the true strength.\n  And I think that that's the potential - an alliance of Rohan to Gondor - mainly due to just the one card - Mutual Accord. Thanks this card to both Gondor and Rohan can mutually benefit from their bonuses (Astonishing Speed, Eomund, For Gondor, We Do Not Sleep, Boromir Leadership + Visonary Leader ...). With a large number of cheap allies of Gondor and Rohan can put a large army and tuning these bonuses. In addition Mutual Accord has cost 0 and you can draw it back Tome Of Atanatar. In addition, Voice Of Isengard and the cycle Ring-maker probably tuning Rohan. This alliance is also evident in Guthlaf  from AP Blood Of Gondor.\n \n\nMaybe in the new series will be more cards to support the alliance. Rohan is gaining strength, and thus, Gondor has a powerful ally  - together they are an unstoppable.\n\n \n\nSo Theoden in multiplayer is a diamond - thanks Astonishing speed can have 5 willpower, thanks to him and Mutual Accord + Astonishing speed  Beregond can  gain 3 willpower.\n\n \n\nadditional cards such as: We Do Not Sleep, Eomund, Steed Of The Mark can easily prepare them for attack / defense.\n\nEdited October 21, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=893950","commentId":893950,"userName":"Nickpes","timestamp":1382412235,"content":"> im afraid you can only use 3 copies of any card (by title) in a deck ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png].\n> \n> rich\n\nReally? I will replace one then maybe it will be better this way"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=894106","commentId":894106,"userName":"DevastazioneH88","timestamp":1382436752,"content":"I think it's pretty obvious that if you want to succesfully use theoden in solo play you need Merry (with theoden he gives 3 wp for 6 threat)..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=894111","commentId":894111,"userName":"Nickpes","timestamp":1382437412,"content":"maybe , but apart from this he will not be able to contribute to anything else "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=895514","commentId":895514,"userName":"Zalrus9","timestamp":1382575615,"content":"I don't think Merry would be completely useless in a deck with Theoden. At first he can be your quester to help with the push, and then later, he can act as an extra heavy hitter (as you can use him to allow extra actions). I don't know. I would love to see how it would work. I would love to try mono tactics solo, and perhaps he could make it work. For Rohan!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=896094","commentId":896094,"userName":"Raven1015","timestamp":1382649639,"content":"Yeah, you could throw Dagger of Westernesse on Merry to at least get his attack up to a respectable 3 against some enemies, as long as you kept the overall threat of the deck at a reasonable starting point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=913384","commentId":913384,"userName":"Tracker1","timestamp":1384988869,"content":"I put together a deck with Theoden, Thalin and Hama. I was pretty impressed, and it was great to use a lot of the mono tactics cards. Knight of Minas Tirith is awesome.\n\nThe deck was able to take on seventh level 3 times, and it beat JDtA once out of 2 attampts, but i was a bit lucky with the encounter deck.\n\nOverall, i think Theoden does make a huge diference for mono tactics solo. I would not have beaten these quests without him, and i have tried.\n\nI am pretty pleased that mono tactics has become an option for solo play. Very cool.\n\nThe major issues mono tactics faces is threat control, hero readying, and healing. Willpower i dont think is much of an issue anymore\n\nGondorian disipline can hep with not taking damage for gondor defenders.\n\nMerry and Rohan Warhorse, will only ready a character during attack phase, but they really need to ready after questing, and the other mount that does that is Spirit. I guess i can use songs.\n\nGandalf is the only way they can lower threat, and i don't really play with him much anymore unless it is a leadership beck, but he might make sense for mono tactics.\n\nI think mono tactics for solo is only going to get better.\n\nEdited November 20, 2013 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=913473","commentId":913473,"userName":"chuckles","timestamp":1384997824,"content":"> Well, I know it is early but since we know that on Morgul Vale we will get a Theoden hero who boosts Tactics willpower, do you believe that it could make Tactics more playable as a solo deck?\n\n \n\nYes but with difficulties like tracker1 eludes too \n\n \n\n> The major issues mono tactics faces is threat control, hero readying, and healing. Willpower i dont think is much of an issue anymore\n> \n> Gondorian disipline can hep with not taking damage for gondor defenders.\n> \n> Merry and Rohan Warhorse, will only ready a character during attack phase, but they really need to ready after questing, and the other mount that does that is Spirit. I guess i can use songs.\n> \n> Gandalf is the only way they can lower threat, and i don't really play with him much anymore unless it is a leadership beck, but he might make sense for mono tactics.\n> \n> I think mono tactics for solo is only going to get better.\n\n \n\nI was playing around with Theoden, Merry & Thalin, last night (used Book of something instead of Hama)... not being able to ready questing hero's is quite challenging!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=913845","commentId":913845,"userName":"Glowwyrm","timestamp":1385050154,"content":"Hero readying is a big drawback, and I agree with everyone who wishes that mount would have been tactics.  That's one of the reasons I like Merry in this deck.  Early on with Theoden, he's a solid quester who will help you stay afloat while you build up your forces.  Once you get a couple of weapons on him, he provides a nice attack boost, and more importantly allows you to use your main attacker twice.\n\n \n\nI worked a great and easy to set up card draw combo with Merry and Hama.  Hama and Merry attack and destroy an enemy.  Then I use Hama's ability to retrieve my strategice event like Feint, and I exhaust Hama's weapon and use Foe Hammer to draw cards.  Then I attack with Hama again and retrieve Foe Hammer.  This strategy worked out really well for me in Blood of Gondor, when I had lots of enemies to attack.\n\nEdited November 21, 2013 by Glowwyrm"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=913952","commentId":913952,"userName":"lleimmoen","timestamp":1385059226,"content":"Théoden, Merry, Dúnhere is a possibility. The enemies that slip can be killed with Merry and Dúnhere (if the former is ready) and Dúnhere shall have another shot against the staging.\n\n \n\nBut if you substitute Merry with either Háma or Éomer (once he's out), you might do a better job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=914180","commentId":914180,"userName":"Karlson","timestamp":1385075399,"content":">  \n> \n> I worked a great and easy to set up card draw combo with Merry and Hama.  Hama and Merry attack and destroy an enemy.  Then I use Hama's ability to retrieve my strategice event like Feint, and I exhaust Hama's weapon and use Foe Hammer to draw cards.  Then I attack with Hama again and retrieve Foe Hammer.  This strategy worked out really well for me in Blood of Gondor, when I had lots of enemies to attack.\n\n \n\nThose are some great ideas.  I am going to devise a mono-sphere Rohan deck by using Theoden, Merry, and Hama.  I'll definitely try some of those strategies out.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88368-theoden-and-tactics-mono-deck/?do=findComment&comment=914236","commentId":914236,"userName":"Tracker1","timestamp":1385080654,"content":"> > I worked a great and easy to set up card draw combo with Merry and Hama.  Hama and Merry attack and destroy an enemy.  Then I use Hama's ability to retrieve my strategice event like Feint, and I exhaust Hama's weapon and use Foe Hammer to draw cards.  Then I attack with Hama again and retrieve Foe Hammer.  This strategy worked out really well for me in Blood of Gondor, when I had lots of enemies to attack.\n> \n>  \n> \n> Those are some great ideas.  I am going to devise a mono-sphere Rohan deck by using Theoden, Merry, and Hama.  I'll definitely try some of those strategies out.\n\nThis does sound pretty good."}]}