{"url":"https://community.fantasyflightgames.com/topic/88523-new-player-a-question/","title":"New Player - A Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88523-new-player-a-question/?do=findComment&comment=840381","commentId":840381,"userName":"Ramistrov","timestamp":1376556561,"content":"Hi all\n\n \n\nI have recently started playing the game and am very much enjoying it! However I am a bit of a perfectionist and in the base set it does not contain a complete playset of some cards, how can I go about getting the \"missing\" cards?\n\n \n\nI have purchased all of the chapter packs except the first two that were out of stock when I started playing, do these contain some of those \"missing\" cards?\n\n \n\nExample:\n\n \n\nA Light in the Dark - Event x2 (playset should be x3 copies)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88523-new-player-a-question/?do=findComment&comment=840386","commentId":840386,"userName":"mr.thomasschmidt","timestamp":1376558300,"content":"Hi and welcome :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nOnly way to go about it is buying 3 x core set. You don't need 3 x of the \"missing\" cards but if you insist it the only way. FFG made the decision to include fewer of some of the strong cards in favour of getting more different cards to start out with. And since most players have been willing to get a 2nd and 3rd core set there's no need for them to release any extra copies. Sorry. The debate has been going on ever since the game was released so pretty sure FFG won't change their minds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88523-new-player-a-question/?do=findComment&comment=840425","commentId":840425,"userName":"richsabre","timestamp":1376564365,"content":"yes, this is a sore point amongst players and has been debated much. as mr.thomasschmidt points out, the only way to do this is to buy 3 core sets.\n\ni have 2 core sets to get up to 3 copies of most of the cards, however will not get a third. to me its not worth it\n\nto others the 2nd set isnt worth it, and to others still the 2nd and 3rd are worth it\n\n \n\ninterestingly there was some store that was selling singles for about £3 a card or something crazy like that\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88523-new-player-a-question/?do=findComment&comment=840576","commentId":840576,"userName":"Ramistrov","timestamp":1376577764,"content":"Well thanks for the replies, I don't intend on buying another core set as that is not an option for me due to cost.\n\n \n\nI have to say it is a rather bizarre move from FFG to create a LCG that in its first move breaks from being a LCG in an attempt to make people purchase multiple sets of the game like a CCG...either its as I mentioned or just a poor design choice.\n\n \n\nOh well I will just have to live without them I guess!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88523-new-player-a-question/?do=findComment&comment=840613","commentId":840613,"userName":"Karlson","timestamp":1376579839,"content":"It is a bit frustrating that the core set only comes with 2x or in some cases only 1x of many cards, but you can rest easy that all of the additional expansion and adventure packs each come with 3x of every player card.\n\n \n\nI found a very affordable second core set so I decided to get it, and it has really rounded out my card pool, so I would recommend doing that, but only after you have several expansion and adventure packs and find that you really enjoy playing the game.  \n\nEdited August 15, 2013 by Karlson"}]}