{"url":"https://community.fantasyflightgames.com/topic/88593-planning-quest-staging-phase-and-travel-phases/","title":"Planning, Quest (Staging Phase) and Travel phases","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88593-planning-quest-staging-phase-and-travel-phases/?do=findComment&comment=841591","commentId":841591,"userName":"komakino","timestamp":1376640972,"content":"Hello all.\n\n \n\nI've read the rules quite a few times and watched some YT vids to attempt to understand these phases and the order in which they occur. I'm a little confused!\n\n \n\nPlanning - I choose which cards I put into play from my hand (resources allowing) by taking note of the cards in the staging area.\n\n \n\nQuest (Commit) -  I choose which heroes I commit to the quest by looking at and trying to exceed the threat in the staging area with the commited heroes' willpower total. Ideally I need to aquire progress tokens here yes?\n\n \n\nQuest (Staging phase) - The encounter deck deals another card into the staging area - potentially ruining both my choices I did in the planning phase previously and my quest commitment? Seriously?\n\n \n\nQuest (Resolution)\n\n \n\nTravel - I'm given the opportunity to move a location from the staging area to the quest area in order to reduce the staging phase threat total (the downside to this being that I have to sideline progress tokens to this location until it is removed) - once again - why now?\n\n \n\nWhy not this phase order:\n\n \n\nQuest (Staging phase) - i.e. all staging cards revealed so I can decide which\n\nQuest (Commit phase) - heroes to commit whilst also deciding whether or not to\n\nTravel - to an available location (whilst taking a knock short term by the progress token sidelining) in order to reduce the threat and then perform the\n\nQuest (Resolution) - to deduce the progress (if any) made and then onto the\n\nPlanning phase - to plan properly by looking at the REAL resulting total threat/enemies in the staging area\n\n \n\nOpinions everybody? I'm not trying to rewrite the game btw :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI'm sure someone can give me an explantion as to why the phases are in the order that they are in the rules...\n\nEdited August 16, 2013 by komakino"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88593-planning-quest-staging-phase-and-travel-phases/?do=findComment&comment=841654","commentId":841654,"userName":"richsabre","timestamp":1376651455,"content":"quite simply, because that would be too easy. this game is about planning ahead in a sort of way, in fact several cards let you look at what is coming, hence not knowing what is coming is the main challenge of the game.\n\nthematically this represents heroes going into the unknown\n\n \n\ndoing it the above way would be far too easy, and a little boring. the excitement is thinking....i have commited almost all my heroes...please let it not be an enemy...them bam! its an enemy, and you all of a sudden need to rethink what you do, so perhaps you set up a combo to ready a hero just in case, or perhaps you include a card that lets you commit a hero after the staging step.\n\n \n\nthen next round you need to think ahead in what cards you play...do you play allies to help defend and attack, or weapons, or save for events?\n\n \n\nhope that helps you see it from a different view\n\nrich\n\nEdited August 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88593-planning-quest-staging-phase-and-travel-phases/?do=findComment&comment=841660","commentId":841660,"userName":"komakino","timestamp":1376652091,"content":"It certainly does and unforunately it is as I expected. There's quite a lot of gambling disguised as 'planning'. I'll get used to it I suppose (I hope!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88593-planning-quest-staging-phase-and-travel-phases/?do=findComment&comment=841663","commentId":841663,"userName":"richsabre","timestamp":1376652319,"content":"> It certainly does and unforunately it is as I expected. There's quite a lot of gambling disguised as 'planning'. I'll get used to it I suppose (I hope!)\n\nwell at first it appears like this. but this is from a core set point of view. as the game expands it starts to appear that luck-playing is the result of poor deck building.\n\nthere are cards that can peek, cards that can rearrange, cards that can search the encounter deck, player deck, recycle cards from the discard pile to top of encounter deck, similar for your own player deck and so on\n\n \n\nwith the correct deck one can manipulate the entire game if one wishes...but that would be rather easy. for example one card allows you to put 2 progress on a location. mix that with northern tracker and that is 3 progress.\n\ni had banks of the anduin which needs 3 then goes to the top of the encounter deck. this was a solo game so i knew every turn what was coming\n\nrich\n\nEdited August 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88593-planning-quest-staging-phase-and-travel-phases/?do=findComment&comment=841667","commentId":841667,"userName":"komakino","timestamp":1376652589,"content":"I see...those sort of cards would definitely fix the game's flow for me. Good job it's an LCG as opposed to a CCG then! Any particular expansion recommendations please?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88593-planning-quest-staging-phase-and-travel-phases/?do=findComment&comment=841668","commentId":841668,"userName":"richsabre","timestamp":1376652862,"content":"well if you go to lotrlcg.com or cardgamedb.com and look for the following cards that will help you plan:\n\n \n\nasfaloth\n\nrisk some light\n\npalantir\n\nout of the wild\n\nravens of the mountains\n\nshadow of the past\n\nimladris stargazer\n\nvilya\n\nrumour from the earth\n\n \n\nthere are others that you already have such as riversong and denethor\n\n \n\nremember that you need deluxe packs before you can buy their corresponding cycle packs. the first is ok (mirkwood) as the core set works as the deluxe pack\n\nbut for the dwarrowdelf cycle you need khazad dum\n\nfor against the shadow you need hiers of numenor\n\nthe hobbit saga packs and black rider are fine with core set\n\n \n\nthe cards are really split between packs, so its best to look through them"}]}