{"url":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/","title":"Card NOR AM I A STRANGER WHO USED IT?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/?do=findComment&comment=842065","commentId":842065,"userName":"rekath16","timestamp":1376677626,"content":"Who, when, in which situation and why did you use ever the card Nor am I a stranger which gives a Rohan trait to another character??\n\n \n\ninspired by the new deluxe edition..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/?do=findComment&comment=842069","commentId":842069,"userName":"richsabre","timestamp":1376677769,"content":"EDIT- ignore the below- got the complete wrong card!! (i was thinking you meant the one that gives rohan to gondor and gondor to rohan\n\ni was talking about this today. use it with the new rohan tactics rider. he gets gondor and can benefit from beind strong walls and other gondor boosts making him a strong defender\n\nEdited August 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/?do=findComment&comment=842182","commentId":842182,"userName":"Karlson","timestamp":1376683634,"content":"I think this card will see much more use once Gondor is fleshed out more (not to mention the upcoming cycle that will feature Rohan.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/?do=findComment&comment=842221","commentId":842221,"userName":"Teamjimby","timestamp":1376685697,"content":"I've never used it, but yesterday I was brainstorming a Rohan (Eowyn and Dunhere?) / Prince Imrahil deck that revolves around making Prince Imrahil a monster and giving him tons of actions.  Lots of chump blockers (greatly improved by the revealed squire), dunedain buffs, celebrian stone, with unexpected courage and maybe common cause or spare cloak to give him plenty of actions.  Nor am I a Stranger would give him a free action when Eomund leaves (instead of using his once per round ability) and would open him up to astonishing speed.\n\n \n\nStill not great, but it was the first time I ever considered adding it to a deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/?do=findComment&comment=843590","commentId":843590,"userName":"Rainelotr","timestamp":1376844454,"content":"Eomundand one or two other cards that affect rohan. Still I find it very difficult to build a good Rohan deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/?do=findComment&comment=844198","commentId":844198,"userName":"ClydeCloggie","timestamp":1376920381,"content":"Used it in a Spirit/Leadership Rohan deck which had Leadership Aragorn as a Hero. Played it on him to make him benefit from some of the Rohan event cards. Worked nicely, but this was way back early in the Mirkwood cycle when NAIAS had just come out and there weren't too many other cards around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88626-card-nor-am-i-a-stranger-who-used-it/?do=findComment&comment=844293","commentId":844293,"userName":"camacazio","timestamp":1376927034,"content":"I like using 3 copies in multiplayer. It's a bit tough finding deck space, but when more and more people don't need to exhaust to quest or ready from a sneak attack'd Eomund, you can really break out of some of the nastier enemy overload situations. It's also fun for teaming up solo spirit Rohan with solo leadership Gondor, nor am I a stranger on one side and mutual accord on the other."}]}