{"url":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/","title":"Analysis of the Mono-Sphere theme","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/?do=findComment&comment=842844","commentId":842844,"userName":"Rapier1","timestamp":1376762127,"content":"I’ve been meaning to post this for a while (I alluded too it in a previous post). I wanted to discuss the different mechanisms in the game that exist to encourage mono-sphere play in light of the focus on it in the Against the Shadow Cycle. I intend to present them all and then discuss their merits, and hope that others will give input as well.\n\nFirstly though I want to make a brief case for why encouraging mono-sphere is good for the game, as I often see people complaining about having no interest in it and actively disliking cards that encourage it.\n\nA good deck building game requires a complex set of rules to encourage interaction and card selection optimisation.  The Lord of the rings card game has several layers to each card that build complexity and allow for interaction. Sphere, Cost and type are the three most basic, and often the basic level is overlooked. Sphere is an overarching theme for a set of cards (1 of 4; or neutral). Everyone recognises that different spheres have different trends and strengths but a lot of people seem to think that having cards that reward you for selecting a single sphere instead of mixing them is bad.\n\nIf it’s always the case that you should take at least two spheres (Which gets you more different trends and strengths) then it reduces the value of the sphere selection.  Hybrid decks are very flexible and usually compensate for specific sphere weaknesses. To make it so that non-hybrid decks are even viable given the obvious advantages to mixing spheres you need either build cards that are supremely powerful mono-sphere (cost 6+ tactics for example), or else build additional limitations.\n\nI hope that brief synopsis helps to demonstrate why mono-sphere focused cards are good for the game even if some of the limitations that FFG have chosen to use might be poor. (If there’s interest I might post an expanded post on the design elements as I see them later).\n\n \n\nIn the core box two methods existed to encourage mono-sphere play.\n\n \n\nHigh Cost: A cost of 5 or 6 on a card is the most obvious and basic way to encourage mono-sphere play. A 5 cost sphere card requires 3 turns to play if you only have 2 heroes in a sphere instead of 2 turns with 3 heroes.   I’m surprised we haven’t seen any 7 cost cards (which would definitely require mono-sphere). Although it may be just as well because the major problem with the high cost cards is that generally they’re considered to be not worth the investment.\n\n High cost allies generally don’t help as much as more low cost ones because of limited actions and the fact that cards that kill allies outright exist. High cost events, while powerful, generally require specific game states to be the case before you can benefit from them significantly.  As a result it’s very unlikely that the currently designed high cost cards will encourage mono-sphere play. I feel that more of them need to be like Gildor Inglorian (access to a powerful and unique ability). Both Gandalfs being under costed doesn’t help either, since as a neutral card they work far better for hybrid decks.\n\nSpend resources from 3 different heroes’ pools: This only exists on Thicket of spears. I actually really like this as a limitation. It allows you to use three tactics heroes or songs of battle though so the limitation isn’t that great just from a mono-point of view.  Having to keep resources in each pool makes it a little awkward against some shadow effects, but I like the feel of it taking 3 people working together. The card got a lot of negative press in the core because of mono-tactics being so awful. However I think this limitation should be considered more often in the new  mono-theme.\n\n \n\nIn against the shadow we received the following additional mono-concepts. Many of these are much more significant in terms of forcing a mono-sphere theme. In some ways that makes them superior from the point of view of mono-decks. Although at the cost of limiting construction options.\n\nPlay only if each hero you control has a printed sphere icon: This is a similar concept to the 3 resources one. It has the advantage of working with secrecy. It also has better wording for adjusting the cost away from 3 while still sticking to the mono-theme. This does however force a mono-theme and has no flexibility outside of that, the printed icon rule is obviously intended to prevent songs from trivialising differences in sphere (as they did). This lets them make very strong in-sphere effects without having to go for a high cost (at the loss of some deck building options) this should be the basic design of all mono-sphere cards. I expect to see some of these in every cycle from now on.\n\nPlay onto a sphere hero. Reduce the cost for each hero with the same sphere:  These are in my opinion the best cards for encouraging the mono-theme. They’re completely playable even with just a song, but they have a flexible boost dependant on how much you’re focused on a particular sphere. Reducing the cost down lets them make abilities that are decent rather than trivial (such as reusing another event), without having to worry about the effect being too strong (reusing an event in a mono-sphere deck is only playing to your strengths anyway).  The problem with having them too often is that they’re tricky to balance, re-use an event for cost 1 is probably going to be too good as mono-sphere gets better support. Spreading this design to other cards as well would make it so that you always run these as a no-brain choice.  Although I love the design of the record cards, I hope we don’t see it too often.\n\nIf each hero you control has the same printed sphere icon, this card gets X: Basically this lets them make cards that are decent, and then reward you for mono-sphere. The knights of Minas Tirith is a good ally for cost 3 however if you do play mono-tactics it becomes a good ally that also does an immediate attack on the staging area.  I really like this card, it has a place in a Gondor or Warrior deck because of traits, and in any mono-tactics deck. (The white tower watchman likewise, is okay even without getting the sphere benefit). I hope to see more of this design as well, cards that are okay and better under set circumstances.\n \n\nCitadel custodian was an example of a bad version of this, yes it gets cheaper with more Gondor cards but it’s basically unplayable without Gondor cards. The sphere versions have been done much better.\n\n \n\nThis card gets better for each printed sphere icon you control:  I think this is a good idea for flexibly rewarding but unlike the cost reduction I think the examples we have of this don’t really work. Pelargir shipwright  for example gets +1 spirit for each spirit hero. But really it’s just a bad card if you have only 1 spirit hero you’d never run it, you also wouldn’t really run it at 2 spirit heroes (getting 2 willpower for 3 cost isn’t anything great).  The problem with this design is that like the citadel custodian it’s balanced around when you have the optimal conditions.\n\nThat means that it’s a decent card if you run 3 spirit heroes, and otherwise it’s not. However unlike just flat out stating that you need all heroes to have the same the same sphere you also have the problem that the card gets penalised if you lose a hero (basically having lots of these cards mean losing heroes is even worse) It also means the card won’t work with secrecy very well. If it was keyed into something you could manipulate (number of spirit allies for example) it would be okay, but you can’t meaningfully increase hero count. I like the design but I think it needs to be for traits or something else you can manipulate not heroes (+1 spirit for each Gondor ally would be too good though).\n\n \n\nEmery:  I list her as special case, she gets to discard cards instead of paying resources but if you discard any non-spirit cards (or neutral) cards she gets discarded. This is a very interesting mechanic that obviously rewards mono-sphere play. The basic mechanic about card discarding though I hope is going to be developed as a general theme;  in terms of value to mono-sphere decks though I think she may be unplayable outside of mono-sphere despite appearing to be viable. You could gamble in a 2 spirit hero deck perhaps.\n\n \n\nFinally, Mono-sphere hero abilities: The basic concept here is that the hero works best in a mono-sphere deck. They come in different kinds (and of differing value); Mirlondre is probably the best because she reduces starting threat (effectively a flat +3 to stats). Theodeon can potentially give more (+1 stat per tactics hero besides himself), but he requires 3 other tactics heroes to be in the game to match Mirlondre. In a mono-tactics deck +2 willpower might be good, but if the other players are running tactics heroes as well it probably isn’t to go questing with. I think Theodeon should have been 1 less threat or else had +1 stat somewhere else (not willpower).\n\nCaldara doesn’t give a straight boost; she gets an ability that’s better when paired with other spirit heroes. Sadly she’s totally unplayable when not with at least one other spirit hero (unlike the other two mono-sphere cards, which are playable just at reduced effectiveness). So while this is a nice idea it’s much worse than the implementation of the other two.\n\nI think encouraging the mono-sphere play through hero selection may be the wrong way to go in general. The problem is that to encourage mono-sphere play they’ve essentially made three heroes that only have abilities if you use mono-sphere play. A much better way would have been to just make good mono-sphere cards (like they have) and then make interesting heroes with good abilities that complement each other.  Mirlondre is the best I feel, because if I really wanted to run mono-lore I would consider her as a third hero unless I wanted specific hero ability. She also has the potential to open up new deck building options by letting you run Elrond + her in a secrecy deck (12 + 7). Her ability also combos extremely well with Strider, and is generally all around good. She’s even worth considering paired with only 1 other lore hero for -2 threat if you design decks that don’t need three hero abilities.\n\nTheodeon meanwhile probably isn’t going to see much play in a solo deck.  +2 willpower just isn’t going to cover what you give up. Even worse, they put in a much better tactics questing engine into the same cycle. Hama or the book of Alucard can let you recycle the event that lets you quest with attack instead of willpower.  Even in a 4 player game (where you could potentially get much more than +2 wp), you’re still basically asking people to build decks around having bad questers questing. He does combo okay with Thalin – but that’s mainly because Thalins ability makes you want to quest with him despite the fact that he’s better at attacking and defending. Every other tactics hero is better used not questing, and that’s still the case even with +1 willpower.\n\n \n\n \n\nOverall:\n\nI like that they’ve experimented with a lot of different designs for mono-sphere deck building; multiple designs open up deck construction in different ways so it’s good that they’ve tried it. I think a lot of people are overly critical of some of the cards (Knights of Minis Tirith especially).\n\nI’m expecting all heroes have the same sphere icon to become  a staple to allow mono-sphere decks to excel in their area (or potentially to give them limited access to an out-of-sphere ability, but that would have to be used sparingly). I’m also hoping that an extra bonus on an otherwise good card for three sphere heroes sees more use in design.\n\nI think all the cards so far revealed to encourage mono-sphere seem to fall into three types. “This card is awful unless used in mono-sphere in which case its okay” or “This card is not quite okay, unless used in Mono-sphere situation  in which case it’s good” and “This card is okay, and if you use it in a mono-sphere it’s situationally better”\n\nThe last is clearly the best from a design point of view, (Knights of Minis Tirith, Mirlodnre, White Tower Defender).  The first is definitely to be avoided because it doesn’t really add much to the game, being only okay under optimum conditions is suitable for a deck themed around a trait (because filling out the trait might work in other ways for the deck). Doing it at the less complex level of the sphere though means better cards will almost always be available.\n\nI think as the card pool expands the middle one will become more common, not just for spheres but for all traits. Cards which work well within their niche but which aren’t as good as other cards generally will become more common because of card expansion.\n\n \n\nOne question I want to ask though; Do you think that mono-sphere cards need to be better than the counterpart?  In general I guess what I’m trying to ask is if you think that mono-sphere is inherently weaker than hybrid sphere decks.  It’s clear from the design of the cards we’ve seen this cycle that the designers feel that mono-sphere needs to have an  edge (in terms of power to cost ratio) to cover the inconvenience of using only one sphere.\n\nThis is in contrast to traits (which are clearly not costed). I personally think that while some cards can afford to be just better in a mono-sphere environment as I said before, if too many are you risk reducing rather than enhancing deck construction.\n\nI also think that the big flaw with the whole concept is that really the encounter deck should be being designed to encourage a mono-sphere playstyle. Since it’s meant to be the encounter decks that spur deck building. Rather than necessarily trying to make cards which appeal to different deck builds, I feel like FFG should be making encounter decks that are more easily defeated with different deck builds.\n\nWe’ve seen some examples of this. The often complained about riddle mechanic was much easier with a mono-sphere deck. Some other event cards specifically reference different spheres (X is equal to the number of different sphere icons on heroes the players control). I feel like as well as some cards that reward mono-sphere for general use we really needed more encounter cards that punished you for not doing it. Especially since the main value of hybrid decks is that you can better cope with the threats of the encounter deck. To make the cost of that flexibility a bit higher we need a few cards like the following:\n\nHow about a card like “Infighting: Trechery. For the rest of this round allies and heroes can only group up to attack enemies if they share the same sphere”. Or “Confusing cross-roads: location. While this is the active location the first player chooses a sphere, only characters of that sphere can quest this round”.\n\nObviously you don’t want to overdo this or you risk making it so only mono-sphere decks have a chance against a given quest. You especially don’t want them to be pitched at a difficulty where it’s trivial for mono-sphere and awful for dual-sphere decks. It needs to be finely tuned to make it easier in general without being too much easier.\n\nThanks for reading; I really hope someone is willing to read the whole thing and I welcome any comments. It has at least helped me to solidify some of my thoughts on the subject.\n\nEdited August 17, 2013 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/?do=findComment&comment=842925","commentId":842925,"userName":"Ellareth","timestamp":1376769227,"content":"In a rare chance that I do get to play 3 or 4 player games, I generally find it much better if each player runs mono-sphere decks.\n\nSure you can make everyone run 12 Test of Wills and 12 Dwarven Tombs, but I often found that this was not neccessary.\n\nThese mono-sphere boosting cards should be, and I assume already is, great in multiplayer condition.\n\n \n\nHowever, I am mostly solo player and from that perspective I don't see mono-sphere decks becoming viable general deck against multiple quests.\n\nYou could probably tailor a mono-sphere deck against some quests,\n\nyou could probably play a quest 5 times using mono-sphere deck and maybe win once,\n\nbut there is noway mono-sphere decks would be able to win against 7~8 out of 9 quests in a same Cycle with winning ratio of 70% or higher.\n\n \n\nIf mono-sphere decks reaches that kind of level in solo play, that means the spheres are no longer distinguishable; for deck to win against multiple quests with high percentage you need all of resource generation, action adventage, encounter deck control/manipulation, card draw advantage, and if single sphere can achieve all that what's the point of having sphere?\n\nThere are some exception of course, mono-leadership Dwarves and mono-spirit Rohan decks can 'rabbit' themselves to victory before anything too bad can come off encounter deck, but that is due to the 'traits' more so than 'mono-sphere'.\n\n \n\nAlso the ratio between Gondor trait cards and mono-sphere boosters in this Cycle was waaay off, not to mention one of 'major' characters got 'wasted' on supporting mono-sphere instead of his appropriate trait.\n\nI guess my 'biggest complaint' about mono-sphere boosters is that, given how Secrecy turned out, I've gotten bunch of cards that are good in multiplayers or good against only some of 'easier' quests instead of trait-related cards.\n\nLike you said, majority of these cards are down-right impossible to use outside of mono-sphere decks or are just very, very bad cards.\n\n \n\n \n\nIf we get even more mono-boosting cards that will allow mono-sphere decks to be on par with multi-sphere decks in their own unique way (boost advantages of each deck to extreme to cover what they lack, instead of trying to giving bit of everything to everysphere and blunts the unique distinguishments), my 'attitude' towards mono-sphere boosters will change for good.\n\nBut that's what I expected to happen to secrecy this Cycle... and that's clearly not the case, so I'm 'assuming' mono-spheres to end up being the same.\n\n \n\nP.S. I only complain here and there occasionally because I am very passionate about this otherwise near-perfect game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/?do=findComment&comment=842947","commentId":842947,"userName":"Alex6222","timestamp":1376771023,"content":"I think each sphere has it´s own monosphere theme:\n\n \n\nLeadership - Outlands. The recent outland cards come in purple and although there are allies in all 4 spheres i think is quite safe to say that the developers intended for leadership to have them.\n\n \n\nLore - Rangers. All traps have come for lore and 90% of rangers characters are in this sphere. Three ranger heros are found in lore and many of the ranger or trap support cards also belong here.\n\n \n\nSpirit - Rohan. Since the first cycle almost every rohan character belonged to spirit. With TVOI this seems it´s going to change. \n\n \n\nTactics - Eagles. Again since the first cycle all eagle characters belong here.\n\n \n\nOkay Lore and Leadership have more defined mono-deck themes. Tactics is difficult because it has a bit of everything but mostly eagles. Spirit shares many elven traits with Lore. So i think this is how mono-decks stand now but feel free to add any more ideas or corrections."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/?do=findComment&comment=843020","commentId":843020,"userName":"rekath16","timestamp":1376776833,"content":"I played mono-sphere even before all the new cards in this cycle... I never understood why people dont like it. You can pay for everything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/?do=findComment&comment=843047","commentId":843047,"userName":"DevastazioneH88","timestamp":1376781064,"content":"As soon as I get assault on osgiliath I'm gonna try a monoleadership outlands deck (thinkk it'll be good) and once theoden is out I'll try a monotactics (hopeing we'll get some kind of tactics treachery cancel). Up to now the only monosphere deck I've tried is lore and I can say I really like it. I got to beat scenarios from different expansions/cycles with only a few defeats. And the sphere doesn't lose its uniqueness because you need to find ways to avoid the sphere's weakness (for exemple keeping the encounter deck under constant watch to avoid bad treacheries or overly powerful enemies in the case of monolore). As for spirit I find Caldera really underwhelming both because I don't like losing my heroes (so much that when it happens I generally give up) and because she actually is bad. That said I think a monospirit deck may be good even without its \"booster-hero\" but you'll need something to boost your atk..because you need to kill things to win most of the times (and sometimes necessarily). So all in all I think they could have created better cards for monosphere decks (as much as i like the tomes there was realy no need for a tactics or a spirit one) but they still did a good job (trained for war, knight of minas tirith, strenght of arms, lord of morthond, mirlonde, mithrandir's advice etc...). Plus I have a good deal of fun trying to create decent monosphere decks and I'm really looking forward to get Theoden...(yes I like tactics)..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/?do=findComment&comment=843226","commentId":843226,"userName":"Rainelotr","timestamp":1376799158,"content":"Yes read it all. Thanks for your thoughts. Lots of good stuff here.\n\nPersonally I was never a fan of monosphere until recently. The turning point came when the number of cards in each sphere that I liked equalled at least 50 cards. That seems to have cooincided with the slow release of these new monosphere cards so I have been happy as a peach\n\nI like playing mono tactics and lore most though due to hero choice. Spirit heros suck. There are some neat strategic options but there are only three good spirit heros by my standards.\n\nLeadership has the opposite problem... all of em want to be boss. Still a good amount of flexibility in hero choice here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88668-analysis-of-the-mono-sphere-theme/?do=findComment&comment=843281","commentId":843281,"userName":"lleimmoen","timestamp":1376809914,"content":"Leadership. Strength of Arms and Tome of Atanatar are the strongest mono-support we got in the cycle, I feel. Especially the latter paired with the former, Sneak Attack and A Very Good Tale, super powerful. Not much else is new, unless you count Hirluin the Fair and the Outlands (and their Lord of Morthond). I'm quickly getting tired of that approach and moving to (a perhaps weaker, against all logic, but more fun) Gondor all-Leadership line-up (though it does include Théodred). I think it is the strongest of the four mono-spheres.\n\n \n\nTactics. Cannot really stand on their own, with some notable battle-and-siege exceptions (I don't think there's a better choice for Cair Andros, for example). Trained for War, Book of Eldacar, not bad but not as strong as the above. Knight of Minas Tirith is nice but not ground-breaking (or ground-making). Théoden is obviously best fit for 4-player or so. Yeah, I think mono-Tactics is surely weakest in solo, but potentially strongest with 3 or 4 players.\n\n \n\nSpirit. Against the Shadow, Map of Earnil, the Carpenter, Emery, Caldara, mono-Spirit is being reinforced, probably more than other spheres in number of cards, but some of these are questionable, especially the Map is likely the weakest of the four (of the kind) as A Test of Will cannot be recycled. Still, have Glorfindel, Eleanor, Caldara for secrecy, and I think you may be doing fine.\n\n \n\nLore. As I said before, I think this is still lacking. However, having seen Elf-stone in Black Riders, it should be a great help. The resource acceleration is the problem, and Lore cannot get into secrecy for Resourceful (it can, but it is too iffy). Advance Warning and the upcoming attachment, Mithrandir's Advice, and of course Mirlonde. I think Advice is wonderful, and perhaps the best Lore event to recycle in such a deck (one might not need other drawing cards after this). Mirlonde is basically threat cost 5 in mono-Lore, which isn't bad at all, but no Glorfindel either. The Ranger stuff is clearly meant for such decks though it would go nicely with a Tactics help.\n\nEdited August 18, 2013 by lleimmoen"}]}