{"url":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/","title":"Voice of Isengard -- What do you think the story will be?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=842889","commentId":842889,"userName":"Cunir","timestamp":1376766530,"content":"we already know from the back of the box that we are going to \"enter the service of Saruman the White\", so surely there has got to be a big twist at the end of the cycle, when we discover that Saruman is not all he seems.\n\n \n\nI play LOTR online, and they have a similar story on there (it's been a while since i did it), where you end up getting captured and imprisoned inside Isengard, and you have to fight your way out. I reckon it's going to be something like that... at first we will be fighting the enemies mentioned on the back of the box, but then we will somehow discover that they are the good guys and get imprisoned in Isengard. Then the big battle in the 6th pack will actually be inside the tower, fighting against Saruman to get our way out.\n\n \n\nMaybe they will have another go at an Escape from Dol Guldur type quest -- where one of our companions starts the quest in a cell. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=842897","commentId":842897,"userName":"Nickpes","timestamp":1376767326,"content":"So we are going to be allies with Saruman at the beggining ? \n\n \n\nMy prediction on the other thread was on spot then  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=842899","commentId":842899,"userName":"Ellareth","timestamp":1376767438,"content":"I've read somewhere that it is going to be 'Ring-maker' Cycle.\n\nIf so, I'd expect the Cycle to focus around Eregion and ruins of Ost-in-Edhil and North Eastern Rohan, to look for any left-behind lores of Ring-making and also to search for the One Ring.\n\n \n\nThe 'heroes' might even be responsible for the ring Saruman was wearing on his hand while kidnapping Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=842908","commentId":842908,"userName":"Gizlivadi","timestamp":1376767986,"content":"> I've read somewhere that it is going to be 'Ring-maker' Cycle.\n> \n> If so, I'd expect the Cycle to focus around Eregion and ruins of Ost-in-Edhil and North Eastern Rohan, to look for any left-behind lores of Ring-making and also to search for the One Ring.\n> \n>  \n> \n> The 'heroes' might even be responsible for the ring Saruman was wearing on his hand while kidnapping Gandalf.\n\n \n\nThis sounds like it would be the perfect cycle for me. However, I think that the focus will be more centered around Rohan, though I still believe we will delve into the lore of magic rings, maybe even going to Ost-in-Edhil, and I'm sure we will see Saruman's ring at some point. That's only what we can deduce from the expansion box and the \"ring-maker\" cycle name, but I still have great expectations for this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=842938","commentId":842938,"userName":"Alex6222","timestamp":1376770463,"content":"I think that at the beginning we will be allies of saruman. There is an attachment called Keys of Orthanc that can be seen at the back of the box. In the cycle i think we will accidentally help saruman build his ring and in the 6th pack we´ll discover the true nature of saruman. Anyway very excited with Eomer. I think that the rohan trait will be mostly on spirit and tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=843000","commentId":843000,"userName":"richsabre","timestamp":1376774193,"content":">  \n> \n> > I've read somewhere that it is going to be 'Ring-maker' Cycle.\n> > \n> > If so, I'd expect the Cycle to focus around Eregion and ruins of Ost-in-Edhil and North Eastern Rohan, to look for any left-behind lores of Ring-making and also to search for the One Ring.\n> > \n> >  \n> > \n> > The 'heroes' might even be responsible for the ring Saruman was wearing on his hand while kidnapping Gandalf.\n> \n>  \n> \n> This sounds like it would be the perfect cycle for me. However, I think that the focus will be more centered around Rohan, though I still believe we will delve into the lore of magic rings, maybe even going to Ost-in-Edhil, and I'm sure we will see Saruman's ring at some point. That's only what we can deduce from the expansion box and the \"ring-maker\" cycle name, but I still have great expectations for this cycle.\n> \n>  \n\nyes i also read that it would be saruman's ringmaking, not the rings of power"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=843019","commentId":843019,"userName":"Gizlivadi","timestamp":1376776803,"content":">  \n> \n> >  \n> > \n> > > I've read somewhere that it is going to be 'Ring-maker' Cycle.\n> > > \n> > > If so, I'd expect the Cycle to focus around Eregion and ruins of Ost-in-Edhil and North Eastern Rohan, to look for any left-behind lores of Ring-making and also to search for the One Ring.\n> > > \n> > >  \n> > > \n> > > The 'heroes' might even be responsible for the ring Saruman was wearing on his hand while kidnapping Gandalf.\n> > \n> >  \n> > \n> > This sounds like it would be the perfect cycle for me. However, I think that the focus will be more centered around Rohan, though I still believe we will delve into the lore of magic rings, maybe even going to Ost-in-Edhil, and I'm sure we will see Saruman's ring at some point. That's only what we can deduce from the expansion box and the \"ring-maker\" cycle name, but I still have great expectations for this cycle.\n> > \n> >  \n> \n> yes i also read that it would be saruman's ringmaking, not the rings of power\n> \n>  \n\n \n\nThis cycle might have both though, FFG do tend to comprise one element of the story as a whole in one pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=843294","commentId":843294,"userName":"player1761766","timestamp":1376812570,"content":"I've been thinking about this, and how people have been saying we'll learn the true nature of Saruman by the cycle's end, but I'm not so sure. While I think it would be really nice to see Saruman as, perhaps, one of these major enemies in the final AP, I suppose it depends when this cycle is deemed to take place. If we as heroes are working for him, then it must be before the Saga expansions and in line with the \"original\" timeline for the game. So, as Gandalf doesn't know Saruman has turned evil at the beginning of LotR, and goes to him for counsel as the wise head of his Order, I would assume we wouldn't know before that that Saruman is a bad man. Gandalf turns up to help us on quests, after all, so thematically it would make no sense. Whether the designers take this into account, who can say.\n\n \n\nI would much prefer to see Saruman as, perhaps, an Objective Ally (I really like these folks) who has no attack value, only willpower (and possibly defense), but has some sly mechanic like raising threat to return enemies to the encounter deck if their engagement cost is higher than your threat or somesuch. Basically, he would have a way to make progress in quests, but not to damage his own troops. Even though we as people know that Saruman turns out to be bad, in-game I'd like to see the heroes somewhat confused by his actions, but as they give a benefit to us we don't question them much further. \n\n \n\nOther than that, I think Saruman will be much like Elrond was to the Dwarrowdelf cycle, and not actually appearing as a physical card. \n\n \n\nDefinitely excited for this box, anyway - I think I already mentioned it between palpitations of ecstasy, but having been a long-time fan of Saruman, to finally play in his back yard is going to be lots of fun! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88674-voice-of-isengard-what-do-you-think-the-story-will-be/?do=findComment&comment=843391","commentId":843391,"userName":"lleimmoen","timestamp":1376829467,"content":"I think the twist will be there in the end. Frodo's journey begins at the end of September whilst Gandalf is imprisoned by early July. Thus it is not only okay but almost required to have Saruman as a bad guy at the end of the cycle, as that will likely come in Summer or even early Autumn of next year when we will already have had the second (and maybe even third) saga box. I would guess the twist might come in the fifth adventure pack of the cycle, with the sixth being the Battle of the Fords of Isen. This certainly should be over by the time we get into the third saga box.\n\n \n\nI also predict the first two or three packs of the cycle (after the deluxe) might indeed delve further North up into Eregion (it seems to be the style that the early packs get onto a detour, like they did with Road to Rivendell or Drúadan Forest), it would be a good excuse to find Saruman right colours (them being many) a little later. "}]}