{"url":"https://community.fantasyflightgames.com/topic/88688-new-faramir/","title":"New Faramir ???","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843053","commentId":843053,"userName":"prambridge","timestamp":1376781645,"content":"I was a bit disappointed with the new Faramir, I thought he should have been more about being used in tandem with Boromir and not worth the threat for his ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843229","commentId":843229,"userName":"Rainelotr","timestamp":1376799353,"content":"I love him. The five hp and range make the cost worth it to me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843274","commentId":843274,"userName":"GrandSpleen","timestamp":1376807542,"content":"First we got Hirluin, now Faramir.  I dub this cycle 'ranged' proliferation!  All we need now is a ranged spirit hero and we're good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843376","commentId":843376,"userName":"lleimmoen","timestamp":1376826934,"content":"Thanks for the chance to rant.\n\n \n\nI am not a big fan (for now, but I haven't tried him) of Faramir. Without experience, his card doesn't seem to support the mono-Lore Ranger decks he's been made for. At first, such decks are all about not engaging enemies, and killing them in the staging area: thus we've got Ranger Spikes, Ithilien Pit, Ranger Bow, or Advance Warning. These are probably the core of the deck. Then how does Faramir fall into place? He does combo well with Ranger Spikes, meaning an enemy lingering in the staging will increase Faramir's attack. But what is his attack good for then? Only to strike an enemy with Ithilien Pit, that is good. There is no other access to attacking the staging in the Lore sphere itself; one would have to employ Song of Battle (or A Good Harvest) to get Great Yew Bow or Hands Upon the Bow. Ranger Bow doesn't combo well with Faramir as there is no way to ready heroes (other than Dwarves or Hobbits) in Lore, and exhausting Faramir to deal one damage seems a waste. And finally, Faramir's threat goes completely against the Ranger strategy, the defence and hit points would have probably been better reduced to get a lower threat.\n\nEdited August 18, 2013 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843403","commentId":843403,"userName":"richsabre","timestamp":1376830693,"content":"i think perhaps that faramirs ability is one of those subtle abilities that will be good in certain situations. like the 7 hp high threat trolls that can have the poison trap and still boost his attack for minor enemies\n\ni am pretty excited about trying to get a good combo working, but i agree, its a little bit messy with him not being able to attatck the enemies he traps unless you have the pit\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843445","commentId":843445,"userName":"Pharmboys2013","timestamp":1376833599,"content":"Ileimmoen: I would encourage you to try him in practice first. I believe he's one of those heroes that's much better in play than on paper.\n\nSince Faramir is likely my favorite character I've tried usin him in a bunch of different decks. Solo I've used both mono-lore and lore/spirit. The former was too low on WP despite being able to pay for the cards faster. Lore/spirit solves the WP issue and introduces some threat lowering.\n\nI also think you just have to appreciate him for what he is; with stats of 2 across the board and 5 hp he can really fit any role if necessary serving as an emergency defender or quester if ur getting land locked. Can soak up archery damage too. Even with 1 ranger spikes out he has the 3 atk which puts him on par with lore Aragorn and while the latter has an amazing ability too; he's also probably one of the best heroes in the game so it's a slightly unfair comparison\n\nWhere Faramir really stands out is multiplayer. His ranged his obviously helpful, but then you can also build a deck that plays more towards his strengths. Right now I've had a lot of success playing two handed with a leadership/spirit Rohan deck that focuses almost only questing and a tactics/lore Gondor deck that I've tinkered to play to the strengths of Faramir and the rangers. The addition of tactics gives access to hands upon the bow (which will always give him a +2 atk no matter what), black arrow for the big baddies, and even horn of Gondor which can help produce more lore resources. Thalin might have been a better tactics hero choice, but given I was going for theme I chose Beregond instead who can also help chip away enemy hp (assuming spear of the citadel is attached) with the ranger bows and is a good sentinel defender who pairs well with Faramir as I can assist any other player in both parts of combat. I don't use the great yew bow because I have no emphasis on threat lowering and it would likely lose its usefulness not long after the start of the game. With two players tho there's normally enough enemies coming off the board that I usually have a plus 2 atk on Faramir. I feel like I'm kind of just rambling now so ill wrap it up by just saying try him, especially in multiplayer and he works quite well.\n\nP.S. while an obvious combo. Ithilien Pit and Forest Patrol is just a fantastic 2 cost combo to wipe away enemies most times before quest resolution\n\nEdited August 18, 2013 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843465","commentId":843465,"userName":"lleimmoen","timestamp":1376835079,"content":"You seem to support what I had said, though you say it differently, that Faramir doesn't seem to be a great mono-Lore hero, unless in coop. Maybe it wasn't the intention but it had been the impression of mine. But I too am excited to try out all the combos with him.\n\n \n\nBeside Spirit (an obvious choice for the otherwise lacking willpower and threat reduction), Tactics really goes well with Faramir, too. All the cards you mentioned. I would add one little combo from the upcoming Blood of Gondor, I am not a huge fan of Poisoned Stakes but it may go well with Infighting. If you achieve to attach it to an enemy that you will be able to leave in the staging area, you can then move the damage in the next round to a newly revealed enemy. I certainly love that Lore is getting direct damage, it actually gets as much of it as Tactics, it seems.\n\nEdited August 18, 2013 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843735","commentId":843735,"userName":"Ithilien Ranger","timestamp":1376857687,"content":"Don't forget Faramir in Battle quests! His attack value keeps increasing with every revealed enemy prior to quest resolution. In multiplayer games, he can easily be the best (Battle) quester in the game.\n\n \n\nI love Faramir in solo, too. I think he may suffer from the stiff competition by similarly priced heroes (Beravor, Aragorn) but he is certainly not outshone to a point at which Faramir would feel redundant. \n\n \n\nAside from what has been said, I like to pair him with Core Aragorn and Beregond. This covers resource acceleration (Steward of Gondor, Errand Rider), Willpower (Sword that was broken, Celebrian's Stone), grants access to threat reduction via Sneak Attack & Gandalf and access to Hands upon the Bow, Great Yew Bow and Gondorian Shield (cost 1, paired with Burning Brand on Faramir = winner). \n\nFinally, direct damage in this deck is fantastic! Fresh Tracks play great with Faramir, Forest Patrol, Ranger Bow and Hands upon the Bow can soften any revealed enemy for Beregond and Gondorian Spearman to dispatch with Spear of the Citadel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=843814","commentId":843814,"userName":"lleimmoen","timestamp":1376865224,"content":"Of course, all good points. But again, that is tri-sphere, not mono-sphere. Though I am trying to find ways to incorporate Tactics' cards like Hands Upon the Bow (and maybe Great Yew Bow and Goblin-Cleaver) or even Leadership's Fresh Tracks into the mono-Lore deck via Songs; Master of the Forge and Rivendell Minstrel should be of great help there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=846664","commentId":846664,"userName":"Rapier1","timestamp":1377118787,"content":"Why do you want him to be an excellent mono-lore character?\n\nHe clearly wasn't designed to fill that role, for that we got Merlande. (We got Hirlen, Merlande, Casbala or whatever her name is, and Theoden).\n\nFaramir is clearly meant to be this is a lynch pin to explain the ranger + trap theme. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=846701","commentId":846701,"userName":"Gizlivadi","timestamp":1377120187,"content":"> Hirlen, Merlande, Casbala or whatever her name is\n> \n>  \n\n \n\nWow, I was aware that most people on this forum tend to spell names wrong (I'm looking at you Glaurung) but this is borderline Gooby/Dolan territory.\n\n \n\nThank God we have at least some people here like Ellareth, Rich, Pharmboys, etc. who at least show respect for the source material by having interest in spelling the names correctly, because if we didn't I would have stopped visiting these forums long ago.\n\n \n\nAnyway, great post there, got a good chuckle out of it.\n\nEdited August 21, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=846739","commentId":846739,"userName":"Rainelotr","timestamp":1377122155,"content":"HAhahaha omg that was terrible Rapper. Raper. Whatever your name is ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nNot that I don't agree with you. I don't know why we have to lock him into a mono sphere deck. I think he works regardless of the situation. I don't think most of us usually play mono - sphere decks anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847055","commentId":847055,"userName":"lleimmoen","timestamp":1377154164,"content":"I have to say I even go for Théodred, Éowyn, Dúnhere, though it requires switching the keyboard.\n\n \n\nAs for mono-Lore Faramir, I thought it was a focus of this cycle to create such decks, so I naturally presumed the heroes would fall into place. And I think even Faramir does, in coop, and he is indeed emphasised as such (being ranged after all) fills those shoes quite well it seems. Now that I have tried him, once I get a good coop deck, mono-Lore with Denethor, Mirlonde and Faramir is very nice, and especially fun to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847063","commentId":847063,"userName":"Ithilien Ranger","timestamp":1377154537,"content":"All I'd want for a Faramir deck is a Gondorian Ranger buddy. Just imagine Spirit Pippin would be Spirit Mablung, Gondorian Ranger. Starting threat of 6 for a wonderful Ranger secrecy deck, and the same ability that Pippin has (raise threat by 3 to return enemy to staging area). It would be a wonderful synergy, it would be wonderfully thematic, and it would be so much fun to play! You'd have access to Resourceful, all the Ranger/ Trap cards (including Damrod) and access to threat reduction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847074","commentId":847074,"userName":"hildargo","timestamp":1377156937,"content":"A lot of excellent points made on this thread. I've had the chance to use Faramir in a mono-Lore deck, and I was very unimpressed by the results. Maybe it was the combination of heroes and where my deck fit into the quest we were playing (a 3 player game against Nightmare Hunt for Gollum, which had a Dain dwarf deck really keeping us afloat). If Faramir is in a deck that is primarily combat oriented with some resource generation, he will shine; however, I just don't think that he is meant for mono-Lore. Maybe we will see one or two more cards to support his ability in mono-Lore, but Lore cards in general are just so costly, and Advance Warning isn't incentive enough for me to build a mono-Lore deck around Faramir and the Rangers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847087","commentId":847087,"userName":"Ithilien Ranger","timestamp":1377160206,"content":"The cost-issue for Lore will be partly amended by a card in the Black Riders expansion (at least the cost for allies)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847155","commentId":847155,"userName":"lleimmoen","timestamp":1377171519,"content":"And you know what, as much as I hate Master of Lore being shafted, the last two games I had with him (and played him on round 1), resources seemed to be much less of an issue. The key is to have about half of the deck of cost 2 (and perhaps a few of cost 3), then the discount may be substantial. When you do the mathematics, you need to play at least 4 rounds to make it count (which you probably do), and the Master can at least quest on round 1 (and sometimes). But I probably wouldn't play him with the likes of Zealous Traitor about.\n\n \n\nThat said, the Elf-stone will surely be much more effective in general (though mind, it is the first player, so it may not always be easy to pull it right, in coop)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847338","commentId":847338,"userName":"danpoage","timestamp":1377183752,"content":"Faramir can definitely be good, in the right deck. At GenCon I used him with Denethor and Thalin in a deck with lots of Rangers, Great Yew Bow and Hands Upon the Bow/Hail of Stones. While this deck does not work well against scenarios with several low-threat threshold enemies, against Nazgul it was quite power. In a four player game, we were pulling enough Nazgul (and spies, since it was the second scenario at Bree) that I was able to kill a Nazgul using only Faramir and two ranger allies wielding Ranger Bows. Granted, once your threat gets too high, this strategy stops working, but being able to kill powerful enemies without actually engaging them is a very powerful ability. I don't see Faramir as a mono-Lore hero, but I certainly think that he can be very powerful, in the right deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847499","commentId":847499,"userName":"Pharmboys2013","timestamp":1377191701,"content":"> Faramir can definitely be good, in the right deck. At GenCon I used him with Denethor and Thalin in a deck with lots of Rangers, Great Yew Bow and Hands Upon the Bow/Hail of Stones. While this deck does not work well against scenarios with several low-threat threshold enemies, against Nazgul it was quite power. In a four player game, we were pulling enough Nazgul (and spies, since it was the second scenario at Bree) that I was able to kill a Nazgul using only Faramir and two ranger allies wielding Ranger Bows. Granted, once your threat gets too high, this strategy stops working, but being able to kill powerful enemies without actually engaging them is a very powerful ability. I don't see Faramir as a mono-Lore hero, but I certainly think that he can be very powerful, in the right deck.\n\n \n\nI love all the direct damage combinations the ranger trait has with some select tactics cards.  Might be a little overlooked at the moment with mono-sphere being a theme of this cycle and the necessity of playing multiplayer since a secondary deck for questing is also generally needed"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847667","commentId":847667,"userName":"danpoage","timestamp":1377202175,"content":">  \n> \n> > Faramir can definitely be good, in the right deck. At GenCon I used him with Denethor and Thalin in a deck with lots of Rangers, Great Yew Bow and Hands Upon the Bow/Hail of Stones. While this deck does not work well against scenarios with several low-threat threshold enemies, against Nazgul it was quite power. In a four player game, we were pulling enough Nazgul (and spies, since it was the second scenario at Bree) that I was able to kill a Nazgul using only Faramir and two ranger allies wielding Ranger Bows. Granted, once your threat gets too high, this strategy stops working, but being able to kill powerful enemies without actually engaging them is a very powerful ability. I don't see Faramir as a mono-Lore hero, but I certainly think that he can be very powerful, in the right deck.\n> \n>  \n> \n> I love all the direct damage combinations the ranger trait has with some select tactics cards.  Might be a little overlooked at the moment with mono-sphere being a theme of this cycle and the necessity of playing multiplayer since a secondary deck for questing is also generally needed\n> \n>  \n\nYes, you are absolutely right about this only working in a multi-player game. Aside from Thalin and using an Ithilien Tracker each round, I was never questing for much. Another Spirit/Leadership deck and a Hobbit deck were picking up the slack for questing. It was a pretty epic finish of the second quest, as we had to get all of the Nazgul out of play so another player hit one with multiple characters, including an Ithilien Archer, returning the Black Rider to the staging area. Faramir then attacked it, leaving it a 2 hit points. During the refresh phase, I exhausted my two rangers equipped with ranger bows, and we won the scenario. Thalin, Faramir, Denethor was by no means perfect, and the starting threat was higher than I would have liked, but direct damage in an undeniably powerful archetype. I would much rather be shooting arrows at Black Riders in the staging area, than going toe-to-toe in combat with a group of them. I really like that, as the encounter decks evolve and becomes more challenging, we have new archetypes to use that can help mitigate some of these difficulties."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88688-new-faramir/?do=findComment&comment=847925","commentId":847925,"userName":"Pharmboys2013","timestamp":1377224156,"content":">  \n> \n> >  \n> > \n> > > Faramir can definitely be good, in the right deck. At GenCon I used him with Denethor and Thalin in a deck with lots of Rangers, Great Yew Bow and Hands Upon the Bow/Hail of Stones. While this deck does not work well against scenarios with several low-threat threshold enemies, against Nazgul it was quite power. In a four player game, we were pulling enough Nazgul (and spies, since it was the second scenario at Bree) that I was able to kill a Nazgul using only Faramir and two ranger allies wielding Ranger Bows. Granted, once your threat gets too high, this strategy stops working, but being able to kill powerful enemies without actually engaging them is a very powerful ability. I don't see Faramir as a mono-Lore hero, but I certainly think that he can be very powerful, in the right deck.\n> > \n> >  \n> > \n> > I love all the direct damage combinations the ranger trait has with some select tactics cards.  Might be a little overlooked at the moment with mono-sphere being a theme of this cycle and the necessity of playing multiplayer since a secondary deck for questing is also generally needed\n> > \n> >  \n> \n> Yes, you are absolutely right about this only working in a multi-player game. Aside from Thalin and using an Ithilien Tracker each round, I was never questing for much. Another Spirit/Leadership deck and a Hobbit deck were picking up the slack for questing. It was a pretty epic finish of the second quest, as we had to get all of the Nazgul out of play so another player hit one with multiple characters, including an Ithilien Archer, returning the Black Rider to the staging area. Faramir then attacked it, leaving it a 2 hit points. During the refresh phase, I exhausted my two rangers equipped with ranger bows, and we won the scenario. Thalin, Faramir, Denethor was by no means perfect, and the starting threat was higher than I would have liked, but direct damage in an undeniably powerful archetype. I would much rather be shooting arrows at Black Riders in the staging area, than going toe-to-toe in combat with a group of them. I really like that, as the encounter decks evolve and becomes more challenging, we have new archetypes to use that can help mitigate some of these difficulties.\n> \n>  \n\n \n\nChanged my lineup from Faramir, Beregond, and Beravor to the aformentioned Faramir, Denethor, and Thalin.  Paired it with a solo spirit deck meant for questing (Glorfindel, Eowyn, Eleanor) and cleared a couple scenarios.  Hardest of which was Nightmare Journey Down the Anduin.  Loved being able to easily dispatch goblin snipers and even some tougher enemies like the Anduin Troll Spawn wasnt too tough to take out after they were softened up a bit with ranger bows"}]}