{"url":"https://community.fantasyflightgames.com/topic/88705-small-target-o-elbereth/","title":"Small Target + O Elbereth","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88705-small-target-o-elbereth/?do=findComment&comment=843304","commentId":843304,"userName":"GrandSpleen","timestamp":1376813909,"content":"Card text is quoted below for reference.\n\n \n\nMy question -- if you use Small Target and it succeeds, is the enemy still considered to be \"attacking you?\"  Would O Elbereth be a legal play after successfully using Small Target?\n\n \n\nSmall Target:\n\nResponse: After a Hobbit hero you control exhausts to defend an attack, choose another enemy engaged with you and reveal the attacking enemy's shadow card. If that shadow card has no shadow effect, resolve this enemy's attack against the chosen enemy. If that shadow card has a shadow effect, resolve this attack as normal.\n\n \n\nO Elbereth:\n\nResponse: After an enemy attacks you, put that enemy on the bottom of the encounter deck. If your threat is lower than that enemy's engagement cost, set your threat equal to the engagement cost of that enemy.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88705-small-target-o-elbereth/?do=findComment&comment=843408","commentId":843408,"userName":"richsabre","timestamp":1376831004,"content":"i would say no as it says 'resolve this enemy's attack against the chosen enemy.' and becuase gilthoniel only works after the attack, the attack has therefore changed\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88705-small-target-o-elbereth/?do=findComment&comment=846326","commentId":846326,"userName":"joezim007","timestamp":1377100752,"content":"Well... the attack is on you, the enemy just happens to be hit by it. You are just \"resolving\" the attack against the enemy, as in applying the attack strength to that character instead of one you control. I can see this go either way. Should make this official by asking FFG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88705-small-target-o-elbereth/?do=findComment&comment=846360","commentId":846360,"userName":"GrandSpleen","timestamp":1377102677,"content":"Maybe I'll shoot it over.  I think I agree with rich, since the card text uses the word \"resolve.\" I'll ask and see.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88705-small-target-o-elbereth/?do=findComment&comment=846560","commentId":846560,"userName":"GrandSpleen","timestamp":1377114182,"content":"Got a very quick reply! Answer: O Elbereth would not be legal following Small Target.\n\n \n\nHere's the verbatim reply:\n\n \n\nIf you play Small Target and the shadow card has no shadow effect, then the attacking enemy's attack is resolved against a different enemy engaged with you. In that case, you are no longer the target of the attack and the enemy would no longer be attacking you. Therefore, it would not be a legal target for O Elbereth! Gilthonial!\nCheers,\nCaleb"}]}