{"url":"https://community.fantasyflightgames.com/topic/88897-rhosgobel/","title":"Rhosgobel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88897-rhosgobel/?do=findComment&comment=846101","commentId":846101,"userName":"Olorin93","timestamp":1377085748,"content":"I played the Rhosgobel scenario with my girlfriend yesterday and I have 2 questions:\n\n \n\n1. Only Eagle or Ranged characters can attack or defend against certain cards, like Black Forest Bats. Does this mean allies can't even try to defend even if they take full damage, and I have to assign the full damage to a hero as if it were undefended?\n\n \n\n2. Do Objectives (in this case Athelas) count as Attachments? During stage 2 we flipped a Treachery card that said all characters without attachments should be dealt damage. We agreed at that stage to treat Objectives as Attachments (as it says \"attach to a hero\") as all of our heroes would've died otherwise.\n\n \n\nAlso curious in general as to how it's even possible to complete this scenario in solo play. We barely succeeded yesterday in a 2-player game, but I don't think we did everything correctly. I tried it again today solo and it seems almost impossible to keep Wilyador from dying and still find enough Athelas. Even with a healing deck, the healers must be discarded after use (and I guess Elrond as well, if you use him to amplify the effect?) The more you linger, the more Athelas you need - and in the end it just felt like you needed a large portion of luck with the card-drawing to succeed, which I'm not really a fan of. It's still a nice theme for a scenario. Maybe I missed something. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88897-rhosgobel/?do=findComment&comment=846112","commentId":846112,"userName":"koriakin97","timestamp":1377087181,"content":"1.Yes, these attacks count as undefended\n\n2.Yes, they count as attachments, it was said somewhere in FAQ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88897-rhosgobel/?do=findComment&comment=846364","commentId":846364,"userName":"joezim007","timestamp":1377102804,"content":"It should be possible to beat solo. You just need to quest VERY SLOWLY through the first quest phase and build up your healers. You can keep using Warden of Healing + Elrond to heal him every turn until you have a few Athelas cards. Then quest like mad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88897-rhosgobel/?do=findComment&comment=846382","commentId":846382,"userName":"GrandSpleen","timestamp":1377103641,"content":"Yeah, it's one of those quests that depends on luck with encounter deck draw.  You can make it easier on yourself out by doing as joezim007 suggests: focus on exploring Rhosgobel while it is still in the staging area during stage 1 of the quest.  Use cards like Asfaloth or Ride to Ruin.  You can also employ some encounter deck manipulation like Risk Some Light.  This is one of the only scenarios in the game where Shadow of the Past can really shine.  Sucks to see an Athelas card get discarded as a shadow effect.  \n\n \n\nBut yeah, harder solo than in multiplayer.  With more players, you get more damaging treacheries and things that like, but the Athelas sprout readily."}]}