{"url":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/","title":"How long do the shadow effects last?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=846041","commentId":846041,"userName":"koriakin97","timestamp":1377073113,"content":"Question as in the topic.Do they last for one attack, one phase or forever?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=846058","commentId":846058,"userName":"richsabre","timestamp":1377077307,"content":"i believe the last until they are discarded, at the end of the combat phase. this way they last throughout your attacks against enemies.\n\n \n\ni say this becuase there is a shadow card that says 'cancel damage to enemy' or something similar, meaning it basically cannot be damaged that round\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=846199","commentId":846199,"userName":"Angus Lee","timestamp":1377093862,"content":"A problem is, in the newest FAQ (v.1.5), (1.26) Enemy attacks outside of the combat phase\nIf an enemy attacks outside of the combat phase, it is\nstill dealt a shadow card at the beginning of the attack.\nThen follow the 4 steps under Phase 6 “Combat” in the\nrules. Any shadow cards dealt to the attacking enemy\nare discarded after the attack resolves.\n\nand\n\n(1.42) Additional attacks by an enemy\nWhen an enemy makes an additional attack, discard all\nof its previously dealt shadow cards before dealing it a\nnew shadow card.\n\nIf the shadow card is discarded before your character attacks, the 'cancel damage to enemy' effect ends or not?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=846305","commentId":846305,"userName":"richsabre","timestamp":1377099448,"content":"i would say it goes. arent the effects lasting as long as they are on the table?\n\nEdited August 21, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=846377","commentId":846377,"userName":"GrandSpleen","timestamp":1377103372,"content":"Good question.  Some cards specifically specify an effect window like, 'cancel all combat damage dealt to this enemy this round.'  I would say that the majority of shadow effects are active until the shadow effect is discarded.  Don't think it has been spelled out in an official capacity, but the FAQ ruling cited above suggests that discarding the shadow card itself is meaningful.  But there may be exceptions in the cards that explicitly state that the effect lasts until the end of the round.  \n\n \n\nIt's worth asking the designers.  It will have an impact on your ability to attack enemies outside of the combat phase, e.g., attacking a Haradrim Elite who is in the staging area during Questing -- and maybe he got a shadow card that cancels combat damage, but you discard it after his attack resolves (although I don't think there are any cards in quests with the Haradrim Elite that do that specific effect)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1925294","commentId":1925294,"userName":"JanB","timestamp":1449617161,"content":"Not sure, if my question fits into this topic ...\n\n \n\nplayed The Antlered Crown and an enemy got Raven Village as a shadowcard, which adds two more shadowcards from the ravendeck to the enemy. Both new shadowcards are dunland berserkers which reads: \n\nShadow: Attacking enemy makes an additional attack after this one.\n\n \n\nQuestion: How many attacks make the enemy after his first? We ruled one, because both cards say \"makes an additional attack after this one\" .. \"makes an additional attack.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1925494","commentId":1925494,"userName":"GrandSpleen","timestamp":1449629135,"content":"They would cue up two attacks and resolve one after the other.  We've had an official answer about that regarding the Black Riders box.  \n\n \n\nRuling:\n\n \n\n> Q: I played a Knife in the Dark yesterday where a Ringwraith had two shadow cards when it attacked.  Both of the shadow cards were both Pathless Country, which says \"After this attack, the attacking enemy engages the next player then makes an immediate attack.\"  How would this situation resolve?\n> \n> A: In the situation you just described, the enemy will engage the next player after resolving its attack against you. Then it will make 2 attacks in a row against that player.\n> \n>  \n\n \n\nFrom this [https://community.fantasyflightgames.com/topic/178369-double-engaged-next-player-attack-shadow-effect/?hl=additional#entry1638491] thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1925641","commentId":1925641,"userName":"JanB","timestamp":1449640379,"content":"Thanks.... then we played it wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926200","commentId":1926200,"userName":"cmabr002","timestamp":1449675790,"content":"> They would cue up two attacks and resolve one after the other.  We've had an official answer about that regarding the Black Riders box.  \n> \n>  \n> \n> Ruling:\n> \n>  \n> \n> > Q: I played a Knife in the Dark yesterday where a Ringwraith had two shadow cards when it attacked.  Both of the shadow cards were both Pathless Country, which says \"After this attack, the attacking enemy engages the next player then makes an immediate attack.\"  How would this situation resolve?\n> > \n> > A: In the situation you just described, the enemy will engage the next player after resolving its attack against you. Then it will make 2 attacks in a row against that player.\n> > \n> >  \n> \n>  \n> \n> From this [https://community.fantasyflightgames.com/topic/178369-double-engaged-next-player-attack-shadow-effect/?hl=additional#entry1638491] thread.\n\n \n\nWhile is helpful and answered JanB's question, isn't this somewhat of a problem with correctly resolving the situation in more complex examples?  I feel like the intent of section 1.42 is to remedy the confusion that may occur when there are multiple attacks by a single enemy (and thus multiple shadow effects to resolve).  Once it is discarded, there is no more reminder so now it is only our memory to help us remember.  I like to think I have a good memory, but think about how messy it would get if an enemy was to get two shadow cards that cause it to engage the next player and attack.  Then it gets a shadow card that says to deal it two additional shadow cards, and one says to engage the next player and attack while the other says it makes an attack against the last player.  Then, the second attack tells you to deal two additional shadow cards.  One says to attack the first player.  One says to engage next player and attack him. \n\n \n\nIt might get quite difficult to remember how many attacks you need to resolve and which ones you've already resolved.\n\nEdited December 9, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926222","commentId":1926222,"userName":"JanB","timestamp":1449676379,"content":">  \n> \n> It might get quite difficult to remember how many attacks you need to resolve and which ones you've already resolved.\n> \n>  \n\n \n\nThis was my intention by playing only one more attack. In worst case you have a stack of attacks to resolve but the game instructs you to discard all shadow cards before the next attack get resolved.. so how remember?\n\n \n\ni thought the game has no memory .. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926257","commentId":1926257,"userName":"cmabr002","timestamp":1449677180,"content":">  \n> \n> >  \n> > \n> > It might get quite difficult to remember how many attacks you need to resolve and which ones you've already resolved.\n> > \n> >  \n> \n>  \n> \n> This was my intention by playing only one more attack. In worst case you have a stack of attacks to resolve but the game instructs you to discard all shadow cards before the next attack get resolved.. so how remember?\n> \n>  \n> \n> i thought the game has no memory .. \n> \n>  \n\n \n\nI really do think the intent of section 1.42 is to avoid confusion.  For example, the intent behind 1.42 is so that if an enemy gets +1 Attack and make an additional attack, then the additional attack would happen, but the enemy would revert back to its base damage.  The reason they said to discard its previously dealt shadow cards was so that you would know it doesn't retain the +1 Attack.\n\n \n\nSo, to me, it follows that the intent of multiple shadow cards/multiple attacks should resolve in the least confusing manner.  Now, based on the rulings we've received, we know how we should resolve both situations, but it seems to me it could have been made more consistent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926308","commentId":1926308,"userName":"GrandSpleen","timestamp":1449678661,"content":"There are examples where the game has no \"memory,\" like a discarded enemy re-entering play is not \"remembered\" as the same enemy.  But certainly the game depends on our own memory quite a bit, like tracking which Silvans currently have Celeborn's bonus, which entered play for Galadriel's effect, and did I already use Grima's ability during my 10-minute Gandalf-hero planning phase?  Those shadow cards that trigger additional attacks need to get resolved.  In this case it seems that the resolution here creates a queue of attacks.  That could lead to a confusing situation when you have many attacks in a row, but whether or not something is confusing is extremely subjective and not a great guideline for rulings or card interpretation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926385","commentId":1926385,"userName":"cmabr002","timestamp":1449682854,"content":"> There are examples where the game has no \"memory,\" like a discarded enemy re-entering play is not \"remembered\" as the same enemy.  But certainly the game depends on our own memory quite a bit, like tracking which Silvans currently have Celeborn's bonus, which entered play for Galadriel's effect, and did I already use Grima's ability during my 10-minute Gandalf-hero planning phase?  Those shadow cards that trigger additional attacks need to get resolved.  In this case it seems that the resolution here creates a queue of attacks.  That could lead to a confusing situation when you have many attacks in a row, but whether or not something is confusing is extremely subjective and not a great guideline for rulings or card interpretation.\n\n \n\nBut what is objective is that some shadow card effects disappear when they are discarded (like +1 attack) and some persist like additional attacks.  Due to this, we can objectively never know whether or not a shadow card persists or does not because we have precedence for both.  This means, we need to ask the developers about every single shadow card.  How is this not a problem?\n\n \n\n1. Defending character does not count its defense. [Maybe this persists all game long]\n\n2. Attacking enemy makes an additional attack after this one. [We know this one persists due to prior ruling]\n\n3. Attacking enemy gets +1 attack (+3 attack instead if the defending character is an ally). [We know this does not persist due to prior ruling]\n\n4. Wolf Rider attacks the defending player. That player may declare 1 character as a defender. Deal Wolf Rider its own Shadow card. After combat, return Wolf Rider to the top of the encounter deck. [Does the bold part persist?]\n\n5. Cancel all damage dealt to this enemy. [Does this persist? Perhaps the intent is that you can never deal damage to the enemy all game long if it got this shadow card]\n\n6. Cancel all combat damage dealt to attacking enemy. [Does this persist? Perhaps the intent is that you can never deal combat damage to the enemy if it got this shadow card]\n\n7. attacking enemy attacks again after this attack. Deal it another shadow card for the next attack. (It doesn't specify which next attack so if its second attack was cancelled and then it attacked you the following round, you have to remember the previously dealt shadow card and make sure it gets two shadow cards for its next attack).  This is notably different than the shadow effect \" attacking enemy makes an additional attack immediately after this one. (Deal a new shadow card for that attack.)\"\n\n8. Return attacking enemy to the staging area after it attacks. (This doesn't specify that this effect is only a one time thing.  It might persist all game every time it attacks all game long).  This is notably different than the shadow effect \" Return attacking enemy to the staging area after this attack.\"\n\n9. Defending character gets -1 defense for each quest stage in play. This is notably different than the shadow effect \" Defending character gets -1 defense for the duration of this attack.\"\n\nEdited December 9, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926757","commentId":1926757,"userName":"GrandSpleen","timestamp":1449695076,"content":"Blech, this is messy.  \n\n \n\nSo the fundamental rule question is: do shadow effects last until the end of the current attack or until the card is discarded? \n\n \n\nWe do know from this thread [http://boardgamegeek.com/article/11116560#11116560] that Rider of the Mark can't be used to prevent a shadow card once it is flipped.\n\n \n\nThere seems to be a basic contradiction somewhere.  If you accept one answer as correct, you find examples where it doesn't work, and vice-versa.  If I try to divide shadow effects into \"persistent\" (+1 attack) and \"instant\" effects (deal 1 damage, queue up an extra attack), I still can't make it work.  \n\n \n\n-If shadow effects last until the end of the current attack, Patrol Leader's \"Cancel all damage dealt to this enemy\" has no effect.\n\n-If shadow effects last until the card is discarded, Rider of the Mark should be able to remove an effect like Patrol Leader's effect, but we have a ruling stating otherwise.\n\n \n\nMaybe the best way to deal with this is that \"Cancel all damage dealt to this enemy\" should say \"until the end of the round,\" and it's an error that it does not.  There are several cards like that, but chalk it up to early development.  More recent cards say things like \"Attacking enemy gains Toughness 2 until the end of the round.\"  Hope there are not more recent examples of cards without that kind of clarifying language.\n\n \n\nThat way we can just have all shadow effects last until the current attack is ended.  That does not mean you will remove the 1 point of damage that was dealt by \"deal 1 damage\" effects,  or un-queue an attack that was immediately queued up when you got \"makes an additional attack.\"  I see that it can be subjective to decide which effects are \"instant\" and which \"persist,\" but all we've really go to go on are prior rulings.  Based on those, I think we can almost always come up with a confident answer if we assume shadow effects last until the end of the current attack unless it gives a specific time frame.  Common sense may occasionally be necessary, but you just talk that over with your playgroup, make a decision and move on.\n\n \n\nI definitely see the effect of an \"additional attack\" shadow card as queuing up an attack, an instantaneous effect, and prior rulings seem to support that.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926787","commentId":1926787,"userName":"cmabr002","timestamp":1449695883,"content":"Yeah, it is messy :\\  I think it is messy because we have inconsistent text on shadow cards and inconsistent rulings on how they should be resolved (some being persistent and some being one time things).  I will say that I never questioned the interpretation of most of these cards, however, so the intuitive argument, perhaps makes sense.  The problem is that intuitive is subjective.\n\nEdited December 9, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926791","commentId":1926791,"userName":"Seastan","timestamp":1449695998,"content":"I'm not seeing the confusion. The shadow effect only lasts for the duration of the attack unless stated otherwise.\n\n \n\nHere are some examples:\n\n\"Attacking enemy makes an additional attack against you after this one\"\n\n\"Until the end of the round, attacking enemy cannot take damage.\"\n\n\"Each Undead enemy engaged with you gets +1 attack and +1 defense until the end of the round.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926798","commentId":1926798,"userName":"cmabr002","timestamp":1449696291,"content":"> I'm not seeing the confusion. The shadow effect only lasts for the duration of the attack unless stated otherwise.\n> \n>  \n> \n> Here are some examples:\n> \n> \"Attacking enemy makes an additional attack against you after this one\"\n> \n> \"Until the end of the round, attacking enemy cannot take damage.\"\n> \n> \"Each Undead enemy engaged with you gets +1 attack and +1 defense until the end of the round.\"\n\n \n\nSome cards like in my \"Number 9\" above say it lasts until the end of the attack which implies that not all shadow cards, by default, end at the end of the attack right?\n\n \n\nIt also doesn't solve the problem that some shadow cards say \"Cancel all damage dealt to this enemy\".  It does not give an \"end point\" and if it ended, by default, at the end of the attack, then what effect does it really have?\n\n \n\nEdit: I do agree with you, though.  How you interpret it SHOULD be how it works.  The problem is that some shadow cards are poorly worded and cause confusion.  I think the easiest thing to do here is to errata all the shadow cards so they fit precisely what you said. \"The shadow effect only lasts for the duration of the attack unless stated otherwise.\"\n\nEdited December 9, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1926805","commentId":1926805,"userName":"Seastan","timestamp":1449696493,"content":"Just saw GrandSpleen's post. I agree, just treat Patrol Leader and Muck Adder as errata due to the early design stage and everything becomes consistent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1927083","commentId":1927083,"userName":"PocketWraith","timestamp":1449711495,"content":"> > I'm not seeing the confusion. The shadow effect only lasts for the duration of the attack unless stated otherwise.\n> > \n> >  \n> > \n> > Here are some examples:\n> > \n> > \"Attacking enemy makes an additional attack against you after this one\"\n> > \n> > \"Until the end of the round, attacking enemy cannot take damage.\"\n> > \n> > \"Each Undead enemy engaged with you gets +1 attack and +1 defense until the end of the round.\"\n> \n>  \n> \n> Some cards like in my \"Number 9\" above say it lasts until the end of the attack which implies that not all shadow cards, by default, end at the end of the attack right?\n\nI wouldn't say it implies that. There are a fair number of cards with clarifying text that is technically redundant. It has been ruled that \"Reveal\" is shorthand for \"Reveal and add to the staging area\", but a lot of cards still say the full \"Reveal and add to the staging area.\" It has also been ruled that additional attacks always get dealt new shadow cards unless stated otherwise, but there are still a fair number of effects which say the enemy makes an additional attack, \"deal it a new shadow card for this attack.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1927750","commentId":1927750,"userName":"cmabr002","timestamp":1449758765,"content":">  \n> \n> > > I'm not seeing the confusion. The shadow effect only lasts for the duration of the attack unless stated otherwise.\n> > > \n> > >  \n> > > \n> > > Here are some examples:\n> > > \n> > > \"Attacking enemy makes an additional attack against you after this one\"\n> > > \n> > > \"Until the end of the round, attacking enemy cannot take damage.\"\n> > > \n> > > \"Each Undead enemy engaged with you gets +1 attack and +1 defense until the end of the round.\"\n> > \n> >  \n> > \n> > Some cards like in my \"Number 9\" above say it lasts until the end of the attack which implies that not all shadow cards, by default, end at the end of the attack right?\n> \n> I wouldn't say it implies that. There are a fair number of cards with clarifying text that is technically redundant. It has been ruled that \"Reveal\" is shorthand for \"Reveal and add to the staging area\", but a lot of cards still say the full \"Reveal and add to the staging area.\" It has also been ruled that additional attacks always get dealt new shadow cards unless stated otherwise, but there are still a fair number of effects which say the enemy makes an additional attack, \"deal it a new shadow card for this attack.\"\n> \n>  \n\n \n\nI guess my point was more along the lines that Seastan using bold text to highlight \"Until the end of the round\" could equally be redundant.  We don't know what the default duration of shadow cards is, so unfortunately as players we cannot know whether \"until the end of the round\" is redundant or whether \"for this attack\" is redundant (or potentially neither is redundant if there is no default duration).  Which one is the exception to the default? Which one is redundant?  We simply cannot know because the developers have ruled different ways for different shadow cards and because of this we have to ask them about each shadow card.\n\n \n\nHowever, in order to alleviate the burden on the players and the developers, the simplest (and hopefully correct) solution is to just assume the few cards that don't follow the unofficial rule that Seastan mentioned (\"The shadow effect only lasts for the duration of the attack unless stated otherwise) should receive an errata."},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=1929630","commentId":1929630,"userName":"Sin21","timestamp":1449841646,"content":">  \n> \n>  I like to think I have a good memory, but think about how messy it would get if an enemy was to get two shadow cards that cause it to engage the next player and attack.  Then it gets a shadow card that says to deal it two additional shadow cards, and one says to engage the next player and attack while the other says it makes an attack against the last player.  Then, the second attack tells you to deal two additional shadow cards.  One says to attack the first player.  One says to engage next player and attack him. \n> \n>  \n> \n>  \n> \n> It might get quite difficult to remember how many attacks you need to resolve and which ones you've already resolved.\n> \n>  \n\nIf it is a mumakil, i guess you are trashed by then anyway. Problem solved\n\n \n\n \n\nPs: This is a joke.=)\n\nEdited December 11, 2015 by Sin21"},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=3232547","commentId":3232547,"userName":"gpd924","timestamp":1519870875,"content":"> On 12/9/2015 at 9:40 AM, cmabr002 said:\n> \n>  \n> \n> But what is objective is that some shadow card effects disappear when they are discarded (like +1 attack) and some persist like additional attacks.  Due to this, we can objectively never know whether or not a shadow card persists or does not because we have precedence for both.  This means, we need to ask the developers about every single shadow card.  How is this not a problem?\n> \n>  \n> \n> 4. Wolf Rider attacks the defending player. That player may declare 1 character as a defender. Deal Wolf Rider its own Shadow card. After combat, return Wolf Rider to the top of the encounter deck. [Does the bold part persist?]\"\n> \n>  \n> \n> Wolf Rider has the most ambiguous shadow effect in the whole game, in my opinion.  Here's how I play it (and FFG has not put this in any FAQ for this particular card):\n> \n>  \n> \n> \"Wolf Rider attacks the defending player [You]. \n> \n> \"That player may declare 1 character as a defender. [you MAY...so if you don't want to, then the character takes the full undefended attack, I'm guessing.  Also, and this is the biggest ambiguity,  I exhausted an ally as the defender to the original enemy from which the shadow card was drawn.  I did NOT exhaust a separate character to defend against Wolf Rider, and I strongly believe you don't have to do that.  I used Beorn as my defender, so he defended against both enemies, Wolf Rider and the original enemy.  And I did their attacks separately, not combined.  Both of the enemies had 2 Attack each, Beorn had a Defense 3.  Therefore, none of those attacks went through.  That's how I played it, and that sounds perfectly valid to me.\n> \n> Rest of the shadow card has no problems.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/88894-how-long-do-the-shadow-effects-last/?do=findComment&comment=3233109","commentId":3233109,"userName":"Wandalf the Gizzard","timestamp":1519917948,"content":"Hang on, how did he have Beorn defend both attacks?\n\nEdit: Nevermind, just saw your post in the Wolf Rider/Erkenbrand thread.\n\nEdited March 1, 2018 by Wandalf the Gizzard\nnevermind"}]}