{"url":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/","title":"Palantír","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=848066","commentId":848066,"userName":"lleimmoen","timestamp":1377240663,"content":"I have always found Tolkien's use of Palantíri in the Lord of the Rings one of his most clever devices (among so many). It is one of those aspects of his work that can only gain with time. It is now easy to see a Palantír as modern media in which one can be served the truth but only wrapped up in many a lie or false perception. The fact that Denethor's or Saruman's gaze was strayed by Sauron for them to see what he wanted them to believe, is very frightening, when one applies the situation to himself, him being the one in want of knowledge and Sauron being the Evil Eye of whoever wants to gain from you believing his falsehood.\n\n \n\nThe above would of course make for a great discussion if anyone is willing. But since this is the boards for the game, I will draw into the new player card of that title. I believe the design of the Palantír which came with the Assault on Osgiliath is also the designers' finest hour. I wouldn't believe it when I first saw the card. It seemed underwhelming. But thematically, it is as strong as ever. In my games, I was aware that using it will potentially (and very likely) harm me, but the want for wisdom was too great to resist the temptation. And sometimes knowledge I gained by looking into the Palantír only resulted in despair.\n\n \n\nThat said, the card can also undoubtedly win you games. It is much stronger in solo if one is seeking card draw and safer scouting. But it may be ideal in 2-player game to find out 2 upcoming staging cards, plus another which may become a shadow. In solo, with proper threat management, you can use Palantír repeatedly and for the latter attempts you may be safe on one or two cards matching the named type. Scouting with Henamarth or Denethor (how thematic, again) will make this also a better option, with the likes of Shadows of the Past or Watchful Peace being an occasional combo. Overall I recommend trying this strategy to everyone, at the least to see how strong is his will against the tempting and dangerous knowledge.\n\nEdited August 23, 2013 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=848198","commentId":848198,"userName":"richsabre","timestamp":1377259771,"content":"excellent point, i would love to discuss it, and i would say anything related to this game has a place here.\n\n \n\nit is easy to see influences in tolkien's work....the horror of the trenches in the silmarillion, the advances in technology and destructiveness of new weapons of war. using advances to human gain is something i feel strongly about. for example many people are opposed to nuclear power but when one has studied such methods of science then one learns its value, in fact one sees that it is almost a linear fate of a civilization, or a even a race, to end up at such levels of technology, much the same way that a race must create (discover? that is another debate) mathematics to gain any level of sophistication.\n\n \n\ni see this the same way as denethor must have seen using such powers to his advantage - of course the same holds true for his eldest son. in a way they were the new powers of the earth....in fact the lord of the rings is of course known for being largely based on the age of men dawning- ie. technology, and the age of elves, ie magic dwindling\n\n \n\nthis can be seen in parallels to the new age of warfare dawning in the great war. there were no longer the 'romantic' (note the sarcasm) battles of the Napoleonic wars, or even earlier. it was blow the whistle and go over the top to be strafed with machine guns, mustard gas, airwarfare, tanks and so on (though i believe technically the Crimean war was the first 'modern' war)\n\n \n\nwhat is ironic though is the palantir was an ancient technology, a relic of a forgotton age, whereas its usage is heavily influenced by very modern creations\n\n \n\ni do not think denethor was wrong to use the palantir, nor do i think boromir was wrong to want to use the ring. strategically speaking, gondor was in a terrible position defensively. their defences were under manned, they were fighting a war on 3 fronts (mordor, harad, umbar...4 when saruman joined in!) and they had few allies.\n\n \n\nthey were to put it mildly, buggered. so what does one do in such times? well you use things to your advantage. now of course in hindsight it was a terrible idea. sauron swayed denethors vision, selectively showing him things to wear him down, but as i say, you can hardly blame him\n\n \n\nas for the game i haven't got the pack yet, though i cannot wait. the palantir is an awesome creation of tolkien, and the card looks great- in design and art\n\nrich\n\nEdited August 23, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=848266","commentId":848266,"userName":"Pharmboys2013","timestamp":1377265557,"content":"I will gladly sub in for Rich and discuss its merits in the card game itself.  I've played several games with it, usually attaching it to the ever so appropriate Denethor or Eleanor.  Its preferable to get an unexpected courage on any hero you chose to put Palantir on, but not 100% necessary.  Especially in the case of these two heroes in case you have spare defenders or a test of will in your hand.\n\n \n\nThe card has obvious risks, so running it in a deck with threat control will generally be recommended.  Once its in play though it can be quite powerful.  If playing solo (as i often do) you will be able to see what card will come out in staging, and then possibly 1 or 2 shadow cards.  If 1 or no enemies are in play then you automatically know at least 1 card that will come out in staging on the following turn which if you choose to activate the Palantir again, you will automatically know at least 1 or 2 of the cards to help mitigate the potential threat gain.  Assuming you have a readying effect, I think it is potentially the strongest scrying mechanic in the game (and I love risk some light) given it can be used every turn (not that I would ever recommend that...too risky IMO) and gives card draw.  That said, as I mentioned before it doesnt belong in every deck and you really do need a form of threat reduction for when you dont luck out on your guess.\n\n \n\nI think my favorite thing about the card is the conscious decision making it brings to the game.  Once its in play you really do find yourself thinking about the risk/reward of using the effect and then either absolute joy if you get 2 or 3 cards correct or devastation if you only get 0 or 1.  I can imagine Denethor might have had similar feelings using the tool and it really just creates a great not only thematic but i suppose dramatic sense to your actions as a player\n\nEdited August 23, 2013 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=848315","commentId":848315,"userName":"lleimmoen","timestamp":1377269697,"content":"Yeah, well said. Thanks to you both, guys.\n\n \n\nAs for the game, I've had success with it in a mono-Spirit of Eleanor, Glorfindel, Éowyn. It is not a secrecy deck, so staying at or below 20 is not as important as knowing what's coming, and especially the extra card-draw (as that can be a problem in mono-Spirit, I run no cards of other spheres in there). As claimed, solo is perhaps best for the safety and certainty of card draw, risking in coop (2-player) can still be hugely rewarding as this is perhaps the only \"permanent\" way of scouting all incoming cards. I am a great fan of Risk Some Light (and cannot wait to use it in my upcoming Hobbit deck) but as I now otherwise play mono-spheres only, it has no place there.\n\n \n\nBack to you, Rich, just one note about technology as you mention it with Palantír, it ironic (if that's the proper word here) that Saruman's downfall was partly due to this ancient \"technology\", Saruman was a great smith of Aule, yet he became trapped by one of these ancient tools. Though more iconic is of course the way his downfall was performed (by the forces of nature)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=848368","commentId":848368,"userName":"Troymk1","timestamp":1377273918,"content":"Great Thread.\n\n \n\nMy inner Tolkienista is beaming  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=848517","commentId":848517,"userName":"Ellareth","timestamp":1377283923,"content":"I agree Palantir is a thematic card, but I'm not sure about it's usefulness in the actual game.\n\n \n\nI did play Palantir in deck once, it was a fine-tuned Outlander deck with Beravor/Zigil Miner/Stargazer/Will of West that eats through the deck to provide me with however much resources I want and exact specific card that I want.\n\n \n\nOnce I've set myself and was able to spam threat reductions like crazy, I used Palantir and felt I was 'in control'.\n\nHowever, looking back, Palantir did nothing but to make me feel secure, as at that point nothing from encounter deck could've taken me by surprise.\n\n \n\nIn my opinion, scrying effects are most useful when you are trying to set yourself up or doesn't have much allies and need to allocate actions in more efficient way.\n\nHad Palantir been an Action, I could've utilized a hero that I didn't use yet at the end of combat phase, but it is Planning Action, forcing me to use up a hero action that I might potentially need later during that round.\n\nHad Palantir costed few more resources (cost 3 or 4) and had no guessing game (no draw card or threat gain), it could've helped me allocate my actions in early game, but that's not the case; threat gain in early game combined with hero action usage is too much of a cost to be able to 'foresee and do nothing'.\n\n \n\nBut I guess this makes sense as Palantir wasn't particularity powerful tool in the book; the Stewards just left them unused for centuries of warfare until Denethor II dared to look into it. Had Palantir been an obviously powerful artifact, surely one of the stewards would've used them during Kinstrife or attack of Wainraiders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=849085","commentId":849085,"userName":"Rainelotr","timestamp":1377355844,"content":"I loooove the palantir. Just got to play a deck with them for the first time last night. I dithered a short time between building a green blue deck for the fiddling that would come in to complement the knowledge and a mono spirit to focus on threat reduction. I still think green blue will work fantastic but theme got in my way when I realized I had the opportunity to play a \"women of gondor and rohan\" deck and also get some mileage out of calderas ability. It was beautiful! Used caldera twice. First use of palantir were all three card draws, and even later when I guessed wrong 100% it was ok. The knowledge was totally worth the threat raising. We were playing down the anduin and all my weak one hp allies in spirit would simply not quest when necromancers reach was waiting for us. Just have to view threat as another resource that is at your desposal to spend... just like actions and hp and literal resources :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=850599","commentId":850599,"userName":"Legolas of Darkwood","timestamp":1377537751,"content":"> I agree Palantir is a thematic card, but I'm not sure about it's usefulness in the actual game.\n\n \n\nWell, maybe I can change your mind: Frodo, Loragorn and Spiritfindel to use the Palantir. 24 starting threat, 3x Elrond's Council,... and an option to fully reset treat... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=850618","commentId":850618,"userName":"lleimmoen","timestamp":1377539451,"content":"Even mono-Spirit seems to handle this very well. Because once you know what is coming and how to prepare for it, the need for lower threat becomes less of a concern. I am currently only running a single copy but really thinking about adding more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=855109","commentId":855109,"userName":"GrandSpleen","timestamp":1378013638,"content":"Loragorn!  \n\n \n\nI built a deck with Beregond, Aragorn (Lore) and Bifur in it, expecting to play Palantir on Aragorn and use his threat reduction to control its effect. \n\n \n\nIt wasn't until I drew the card that I realized that Strider does not have the Noble trait.  I couldn't play the card!!  \n\n \n\nWell, live and learn.  I dig that Strider isn't Noble, though -- very thematic.  (The Leadership Aragorn is indeed Noble)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=855261","commentId":855261,"userName":"Karlson","timestamp":1378044183,"content":"Strider is just one of them rangers; danger folk they are, wandering the wilds.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=855968","commentId":855968,"userName":"impaulm","timestamp":1378133403,"content":"Two days ago I made a spirit Glorfindel, Lore Aragorn, tactics Boromir deck and included three copies of the palantir. I didn't believe it would be that good at first, but attached to Boromir, it is an awesome card. Using it gives knowledge of the encounter deck and huge card draw at its best. At its worst you still see the next three cards, allowing you to play the right allies or events to tackle what is about to come off the encounter deck. Obviously Aragorn can negate any gains in threat that might arise. The deck with palantir allowed me to beat Heirs quite easily the first time through with it.\n\nTalk about wonderfully thematic too. I really enjoy this type of card, with some creativity required to get the most out of it. I'm really looking forward to the new doomed player cards too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=1315006","commentId":1315006,"userName":"canaxis","timestamp":1414542197,"content":"> Two days ago I made a spirit Glorfindel, Lore Aragorn, tactics Boromir deck and included three copies of the palantir. ...\n\nThis is very interesting, I did a deck with same heros and palantìr. Could you post the list?\n\nI am a newbie of this forum, how could I post my deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=1315121","commentId":1315121,"userName":"Gizlivadi","timestamp":1414551583,"content":"First of all, I will say again that I love the Palantiri as a theme for the game, I'm all for that. But personally I think the card is pretty bad... I mean it's not awful but IMO it's just not worth it, the risk is too high, you'll threat out a lot quicker. It's just not a good enough card, I bet that if they had made it for this cycle instead it would be much better, not OP but actually useful.\n\n \n\nI also proposed more different renditions of each Palantir to Trololo, so we made them up in the custom card thread (I only made 1), they're pretty much how I would have seen the theme develop.\n\nEdited October 29, 2014 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89057-palant%C3%ADr/?do=findComment&comment=1315270","commentId":1315270,"userName":"MyNeighbourTrololo","timestamp":1414568408,"content":"http://community.fantasyflightgames.com/index.php?/topic/113888-ultimate-support-deck/ [https://community.fantasyflightgames.com/index.php?/topic/113888-ultimate-support-deck/]"}]}