{"url":"https://community.fantasyflightgames.com/topic/89103-double-nightmare-mode-insane/","title":"Double Nightmare Mode - Insane!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89103-double-nightmare-mode-insane/?do=findComment&comment=848570","commentId":848570,"userName":"kyrie","timestamp":1377287097,"content":"I just thought of something ridiculous to try when the second wave of nightmare packs are released.\n\n \n\nFor \"The Hunt for Gollum\" and \"Conflict at the Carrock\" nightmare decks you could include the \"Journey Along the Anduin\" nightmare cards as well, as those two quests use the Anduin cards as part of their encounter deck make-up. This would ramp up the difficulty to what I would call \"Double Nightmare\" mode. It would be fun (masochistic) to try, to say the least.\n\nUnfortunately (or fortunately?) the \"Passage Through Mirkwood\" and \"Escape from Dol Guldur\" cards are not used in any of the other adventure packs in the Mirkwood cycle, so you can not \"double nightmare\" any of the other quests (although you can alter the arrangement, of course).\n\n \n\nI would sure like to try this \"Double Nightmare\" mode when they come out and put my Dwarven Outlands deck to the test. Who's with me?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89103-double-nightmare-mode-insane/?do=findComment&comment=848592","commentId":848592,"userName":"Morithain","timestamp":1377289910,"content":"I like it.  Sauron gets a steroid boost!  In Mytherian gaming, this would be called \"Pray for Death\" mode, lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89103-double-nightmare-mode-insane/?do=findComment&comment=852959","commentId":852959,"userName":"Rainelotr","timestamp":1377748170,"content":"It sounds traumatic lol I still haven't played all the current quests. Going back to play nightmare will probably have to wait until my group is satisfied that we can beat every quest consistently on normal. I did try the first nightmare mode quest thoguh and I appreciate the addition to the quests"}]}