{"url":"https://community.fantasyflightgames.com/topic/89204-escorting-arwen/","title":"Escorting Arwen","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89204-escorting-arwen/?do=findComment&comment=849750","commentId":849750,"userName":"noctum_carpe","timestamp":1377439876,"content":"I like to play scenarios blind without looking at encouter card or so beforehand. Well i had a quick playthrough with a new quest today, road to rivendel it took fist round and the sleeping sentry as a shadowcard and all allies and 4 out of 6 heroes discarded. That shadowcard kinda was gameending. Mabye i shold try with Balin because in round one i dont always have a buring brand or a hasty stroke or the rescources to pay for them. So basically with bad luck this quest can end on first round, it cant be dl4??? Anyone else has the same experiences? Ways to solve the vunerability of the first rounds without usen Balin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89204-escorting-arwen/?do=findComment&comment=849838","commentId":849838,"userName":"richsabre","timestamp":1377449305,"content":"sleeping sentry has to be the most hated card in this game, many think broke. the main thing to do here is only use arwen when you are sure you can deal with that card\n\n\nrich\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89204-escorting-arwen/?do=findComment&comment=849886","commentId":849886,"userName":"noctum_carpe","timestamp":1377453008,"content":"Well Since it killed allmost all my heroes, arwen was kinda irralevant, no good to keep going with only one hero i each hand, she was actually not questing as i expected something like necromancers reach, but this was 10 times worse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89204-escorting-arwen/?do=findComment&comment=850141","commentId":850141,"userName":"conykchameleon","timestamp":1377480704,"content":"Semi on-topic: I'm assuming treachery cards that damage allies also affect Arwen, even though she's an Ally-Objective?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89204-escorting-arwen/?do=findComment&comment=850143","commentId":850143,"userName":"GrandSpleen","timestamp":1377481172,"content":"yup, she counts as an ally for the purpose of card effects."}]}