{"url":"https://community.fantasyflightgames.com/topic/89333-resolving-enemy-attack-keen-took-action-timing/","title":"Resolving Enemy Attack &amp; Keen-Took Action Timing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89333-resolving-enemy-attack-keen-took-action-timing/?do=findComment&comment=851526","commentId":851526,"userName":"ShuffleTheDeck","timestamp":1377626487,"content":"This may have already been answered, but I have no idea how to keyword search this forum for posted comments.\n\nIf you have exhausted the Keen-Eyed Took (ldr ally) as a defender of an attack against you is it legal to trigger his Action and bring him back to the player's hand during combat resolution? As such, avoiding being destroyed and averting undefended damage carry-over to your hero?\n\nThe rulebook clearly states undefended is treated differently than defended damage. And the dodgy Took is also forcing card overturning from all player decks which is disruptive. It would seem this is plausible or have they once again over ruled and made a decent feature worthless?\n\nThanks for your input."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89333-resolving-enemy-attack-keen-took-action-timing/?do=findComment&comment=852115","commentId":852115,"userName":"GrandSpleen","timestamp":1377661777,"content":"If a character who is defending an attack leaves play for any reason during that attack, the attack becomes undefended.  It is right in your rulebook on page 18.  This was not an after-release ruling.\n\n \n\n\"If a defending character leaves play or is removed from combat before damage is assigned, the attack is considered undefended.\"\n\n \n\n \n\n \n\nBased on the few posts you have made thus far, it seems you have already decided that the designers are making awful rulings and many cards are worthless.  It's a shame you're wasting your time and money on a hobby that you don't appear to enjoy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89333-resolving-enemy-attack-keen-took-action-timing/?do=findComment&comment=852132","commentId":852132,"userName":"GrandSpleen","timestamp":1377663766,"content":"I should add, though, that you're right: Keen-eyed Took is a card that sees little use.  It has limited value, but it has found a place in my decks that use Expert Treasure Hunter [http://www.lotrlcg.com/Card/Search?Terms=expert+treas&Type=&Sphere=&Expansion=&Encounter=&Sort=&SortBy=&searchRadio=All&DisplayList=false]and Prince Imrahil [http://www.lotrlcg.com/Card/Search?Terms=prince&Type=&Sphere=&Expansion=&Encounter=&Sort=&SortBy=&searchRadio=All&DisplayList=false]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89333-resolving-enemy-attack-keen-took-action-timing/?do=findComment&comment=852152","commentId":852152,"userName":"ShuffleTheDeck","timestamp":1377666843,"content":"Hey Grand Spleen of 545 posts... This game has so many changed cards in the FAQ over time that when I ask a simple question to determine how a card is ruled I merely want clarification. Basically for two reasons, the search engine in this forum is nonexistent and I apologized if this was posted previously and secondly cards get altered in combination over time. For example: Nori (Hero) is changed from its printed version to limit the threat reduction from hand only. And another... Ravens of the Mountain is printed with the word Reveal... Not look at... How many sets does it take the developers to proof read their cards before going to press??? (I created a CCG and ran one for 8 years I know how to limit the errors!)\n\nYour editorial comments on my enjoyment of the LCG hobby is not entirely of value for the community in this forum. Where do you get off posting that here??? And the fact I have made fewer comments is not to say I am not any better or worse than you in determining card value and use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89333-resolving-enemy-attack-keen-took-action-timing/?do=findComment&comment=852167","commentId":852167,"userName":"GrandSpleen","timestamp":1377669353,"content":"Sorry.  Wasn't comment on the number of your posts at all.  I was qualifying my remark. Was just saying that this...\n\n>  How many sets does it take the developers to proof read their cards before going to press??? \n>  \n\n \n\nand this..\n\n \n\n> Or with many cards in this game so poorly worded it is worthless?\n>  \n\n> have they once again over ruled and made a decent feature worthless?\n>  \n\n \n\nis not an excellent \"value for the community,\" as you put it.  So far whenever I open a thread with your name on it, I can expect to read \"geez, the developers are doing a **** job with this game.\"  You are of course entitled to your opinion.  \n\nEdited August 28, 2013 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89333-resolving-enemy-attack-keen-took-action-timing/?do=findComment&comment=852286","commentId":852286,"userName":"zeb","timestamp":1377684881,"content":"> ...the search engine in this forum is nonexistent...\n\nIt took me some time to find it: it is actually on the very top of the page."}]}