{"url":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/","title":"Deep Knowledge","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=851678","commentId":851678,"userName":"sapender","timestamp":1377634463,"content":"Deep Knowledge, from the upcoming deluxe card expansions... I can see this card replacing Daeron's Runes in decks that contain Aragorn (Lore)...\n\n \n\nI like it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=851688","commentId":851688,"userName":"richsabre","timestamp":1377635284,"content":"i like it also, i dont think it will replace runes altogether which is good...its good to see a card that adds to the pool and doesnt take place of any previous ones\n\n \n\nin a strider deck i agree these new cards are going to be great"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=851917","commentId":851917,"userName":"Dain Ironfoot","timestamp":1377646107,"content":"> Deep Knowledge, from the upcoming deluxe card expansions... I can see this card replacing Daeron's Runes in decks that contain Aragorn (Lore)...\n> \n>  \n> \n> I like it...\n\n \n\nthat is, if your buddies don't mind their threat being raised - i can see myself raising quite a stink over it... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=851969","commentId":851969,"userName":"kyrie","timestamp":1377649899,"content":"I just realized these doomed cards affect all players. The payment and benefit. These just got a whole lot more interesting than they already were...and they were already interesting enough. I thought at first only the player who plays the card increases his threat, but I guess I misread the article. I can see these being very funny to play with a group--I can see people threating each other out just for the fun of it. Lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=851987","commentId":851987,"userName":"Karlson","timestamp":1377651161,"content":"As an almost completely solo two-handed player, I for one really like these doomed cards because they offer some fresh mechanics to the game and I won't have to worry about making another player angry at me!   \n\n \n\nI think the best approach would be to have some heavy threat reduction capabilities mingled in with all the powerful new doomed cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852008","commentId":852008,"userName":"Rainelotr","timestamp":1377652002,"content":"I love it. Totally throws everything on its head with how I expect to have to pay for my cards. Already been viewing threat as a currency since beginning to read Tales From the Cards and this just drives that point home. The other one... that gives out basically an entire turn of resources in exchange for three turns of threat but no staging will be incredibly potent in all of the big start quests. Ie. Peril in pelagir and Massing in osgiliath"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852028","commentId":852028,"userName":"hildargo","timestamp":1377653129,"content":"I think that Legacy of Numenor is the stronger card, especially in the early game. There are quite a few options for cheap card draw that don't raise your threat. Legacy of Numenor, on the other hand, puts all players a full turn ahead in terms of resources. I really think this is a card worth a mulligan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852116","commentId":852116,"userName":"Pharmboys2013","timestamp":1377661864,"content":"I think the threat raises are a good way to curve power creep as well.  Sure we have this much stronger cards avaliable, but there are risks that need to be assessed when playing them.  Not many card games have that and I like the inclusion.  Barring some new way to lower threat although these cards are going to be risky in multiplayer.  If each player plays even2 cards that raise everones threat that can really add up quickly"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852252","commentId":852252,"userName":"dwarvenpony","timestamp":1377678607,"content":"I think Deep Knowledge and Legacy of Numenor are both incredibly overpowered and will supercharge and distort many games. With two Legacy of Numenors, each player will have 9 resources to use on turn 1. How many outlands will you be able to dump into play with that many resources? How much faster will a Dwarf deck be with that kind of a kickstart? Doomed isn't much of a drawback with so many threat reduction cards available and is almost meaningless if these cards allow for consistent turn 5 (or less) wins. The rest of this deluxe expansion looks fantastic but these two cards look like blatant power creep.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852260","commentId":852260,"userName":"Whitman","timestamp":1377681458,"content":"> I think Deep Knowledge and Legacy of Numenor are both incredibly overpowered and will supercharge and distort many games. With two Legacy of Numenors, each player will have 9 resources to use on turn 1. How many outlands will you be able to dump into play with that many resources? How much faster will a Dwarf deck be with that kind of a kickstart? Doomed isn't much of a drawback with so many threat reduction cards available and is almost meaningless if these cards allow for consistent turn 5 (or less) wins. The rest of this deluxe expansion looks fantastic but these two cards look like blatant power creep.\n\n \n\nThat's an improbable scenario. Assuming you have 3 copies of Legacy of Numenor in your deck, you have a 3% chance to draw 2 copies in your opening hand. If you add your first card draw, the probability of having 2 copies by your first planning phase raises to slightly less than 5%. To play them both, you'd have to take a 6 threat hit right at the start of the quest, which may well be enough to push you into the engagement zone of the scenario's big baddies. Plus, these are just events. \n\n \n\nThis kind of \"nut draw\" just counter-balances the \"kick-in-the-nuts draw\" you'll sometimes be dealt from the encounter deck. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852289","commentId":852289,"userName":"bollywongaloid","timestamp":1377685626,"content":"Loving the new cards... I typically start with heroes that total around the 23 mark for threat cost and my friend usually goes for high-threat cost powerful heroes around the 30 mark so it'll be interesting to see how things play out with regards to his temper lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852336","commentId":852336,"userName":"faith_star83","timestamp":1377692312,"content":"True, the doomed affects all the players, this makes these cards very intriguing. I like both of them and can see how they can be put to great use given the decks they are in. But they also have the potential of just sitting on your hand useless, sometimes even not at your fault, but because your co-op player(s) have too high threat value already. If they put in some interesting threat threshhold related treacheries and enemies in the secnarios, I can really see the bargain with the devil become an unnerving one :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852401","commentId":852401,"userName":"Glaurung","timestamp":1377698062,"content":"SO if the players card so poweful i would like to see encounter cards. They should to be very powerful then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852761","commentId":852761,"userName":"Karlson","timestamp":1377728069,"content":"I used to have trouble with threating out and losing quests in the early games; however, now I seldom exceed 43 or 44 threat in either of my decks (I play solo two-handed) so, it will be interesting to experiment with the risks and advantages of these new cards.  \n\n \n\nSomeone on these boards mentioned the idea that threat is a currency just like resource tokens, and I had never really thought of it that way, but now that I do it does make a lot of sense.  You're constantly raising and lowering your threat throughout any given quest, and I think these new doomed cards will make those mechanics even more fun and potent in the game.  \n\nEdited August 28, 2013 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=852957","commentId":852957,"userName":"Rainelotr","timestamp":1377747759,"content":"I play a lot with Boromir tactics. He allows you to do loads of stuff you normally couldn't do by essentially spending threat just like this. I always used to play weak heroes and keep my threat as small as possible but if you win with 47 or you win with 27 it is all really the same. Now adays unless I have a specific reason for low threat like hobits, secrecy, or traps I don't even begin worrying until I am past 43.\n\nRecently I had a game where I used the Hammerstroke to engage 8 enemies at once with nothing but Beorn and Boromir. Even killed 5 of em in that same turn. It was actually a really stupid idea... tactically speaking but you can be assured it was incredibly fun. We even won that quest half an hour later and none of my heroes had ever died. The ability to transmute threat from a passive measure of time into another way to control the battlefield may be dangerous but it will also be incredibly potent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=853137","commentId":853137,"userName":"Nerdmeister","timestamp":1377776267,"content":"Hmm I wonder if I will ever use a doomed-event to out a player from a game before the quest phase?\n\n \n\nIf it seems that player might go out anyway (say a threat of 48+) and we´re at the last stretch in a do-or-die effort, it might be worthwhile instead of having to draw the extra encounter card for keeping him in. Then we´d not have to risk him going out on an encounter card that raises threat anyway and contributing nothing at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=853144","commentId":853144,"userName":"faith_star83","timestamp":1377777141,"content":"Truly an interesting use of the doomed keyword!\n\n \n\nYou could even make a Player card for this:\n\n \n\n\n[0] For the Greater Good\n\n \n\nAction: Raise Target Player's Threat by 3.\n\n \n\n \n\n \n\n\n \n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=853182","commentId":853182,"userName":"Rainelotr","timestamp":1377782670,"content":"Utility would be far too limited."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=854790","commentId":854790,"userName":"Rapier1","timestamp":1377970647,"content":"> Truly an interesting use of the doomed keyword!\n> \n> You could even make a Player card for this:\n> \n> \n> \n> [0] For the Greater Good\n> \n> \n> \n> Action: Raise Target Player's Threat by 3.\n\nFor the absolutely devastating effect that the card has (this player loses). It should be this player gains 50 threat at least, making it at least always work regardless of game state.\n\nEdited August 31, 2013 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89346-deep-knowledge/?do=findComment&comment=855781","commentId":855781,"userName":"Nerdmeister","timestamp":1378106546,"content":">  \n> \n> > Truly an interesting use of the doomed keyword!\n> > \n> > You could even make a Player card for this:\n> > \n> >  \n> > \n> > \n> > \n> > [0] For the Greater Good\n> > \n> > Action: Raise Target Player's Threat by 3.\n> \n> For the absolutely devastating effect that the card has (this player loses). It should be this player gains 50 threat at least, making it at least always work regardless of game state.\n> \n>  \n\nI´m not sure I would agree with that approach. For people who don´t care about score this would just be a thing to do (regardless of threat) automatically once the game state has reached it´s final stage and only one more thing needs doing.\n\n \n\nPersonally I´d think it to be fine as an utility of the already existing cards.\n\nBut I do like the way you think and the thought behind such a card, faith"}]}