{"url":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/","title":"Readying effects realtive power","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/?do=findComment&comment=853072","commentId":853072,"userName":"noctum_carpe","timestamp":1377763738,"content":"Okay i have been think on readying effects  a little lately and i think that.\n\n \n\n1 They are always needed\n\n2 Their realtive power is shoot to pices\n\n3 Most of them are in the spirit sphere(excluding dwarves)\n\n \n\nFor instance the king of cards unexpected courage cost 2 and lets you reday when you want. Only one copy i core set thou.\n\nFast hitch the same but only with hobbits and cost 1\n\nLight of valinor only after questing but cost 1 and works only on elves(especially glorfindel).\n\nThe announced Steed of mark cost 1 + 1 each time used usable by rohan or gondor (steward and nor am i a stranger can alter that)\n\n \n\nSo the comparison would be Light of valinor versus Steed of mark and i think steed of mark sucks because most rohan and gondor characters have little to offer in the way of combining either willpower or Attacks/defense so that i normaly will only use them one time each round, further negating the value of this card(the exception i can see is battle or sige questing (battle being thematic sige not so thematic)). Also to use it you would need resouce acceleration of some kind, so i think that gondor and rohan got the short end of the stick again compared to hobbits and elves. If steed of mark only it costed 2 and had no additional cost or 0 and then costed 1/use it would be a lot better and more, balanced as for now i cant see my myself sticking i the mount in my decks in favor of uc.\n\n \n\nSo is my analysis correct or are there mitigating factors i havent thought of\n\nEdited August 29, 2013 by noctum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/?do=findComment&comment=853104","commentId":853104,"userName":"richsabre","timestamp":1377768537,"content":"something you missed in the analysis is that light of valinor doesnt need the hero to exhaust to quest therefore it isnt technically a readying ability. that is better though as there are cards that have bad effects when a hero exhausts, so not having to is all the better\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/?do=findComment&comment=853107","commentId":853107,"userName":"noctum_carpe","timestamp":1377769564,"content":"> something you missed in the analysis is that light of valinor doesnt need the hero to exhaust to quest therefore it isnt technically a readying ability. that is better though as there are cards that have bad effects when a hero exhausts, so not having to is all the better\n> \n> rich\n\nOh true dident think of that more points for light of valinor then. whoho the mount card sucks even more"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/?do=findComment&comment=858763","commentId":858763,"userName":"Thanatopsis","timestamp":1378414914,"content":"You really surprised me when you said that readying effects reside in spirit.  I normally think of leadership as having most of these effects:\n\n \n\nLure of Moria\n\nGrim Resolve\n\nStrength of Arms\n\nCram\n\nEver Vigilant\n\nElrohir, Aragron, Forlong, and Imrahil have it built into their card text"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/?do=findComment&comment=858952","commentId":858952,"userName":"Nerdmeister","timestamp":1378429900,"content":"In regards to being limited to Rohan and Gondor:\n\n- Theoden, Hama, Boromir, Faramir, Prince Imrahil are good at battle-quests but also needed for combat phase\n\n- Beregond and Denethor are likewise for siege-quests (with Denethor having an active ability as well)\n\n- Theodred always gets committed to quest. Now he can unexhaust afterwards or combo with any of the other mentioned heroes so the choice can be more diverse than Theodred/Aragorn\n\n- Comboed with Nor am I a Stranger and Steward of Gondor, as you rightly mention, makes it more diverse\n\n- Light of Valinor is quite good. It is also unique, so only one in play at a time.\n\n-Think you´re spending too much time finding your Unexpected Courages? Put in some Steed of the Mark [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/against-the-shadow/the-morgul-vale/steed-of-the-mark.png]\n\n \n\nSaying that Steed of the Mark sucks is only when you compare 1 light of valinor versus 1 steed of the mark and deciding which of them to put on your noldor/silvan hero.\n\nNot a particulary thought-through analysis on your part.\n\nEdited September 6, 2013 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/?do=findComment&comment=859133","commentId":859133,"userName":"noctum_carpe","timestamp":1378455305,"content":"Thanatopsis: [https://community.fantasyflightgames.com/index.php?/user/181816-thanatopsis/] Points there i havent played a lot of leadership more of a lore, spirit and tactics kinda guy and i disslike 3 sphere builds so leadership is mostly out. So im mainly dicussing spirit here.  steeed of mark is kinda hard to play in that sphere.\n\nYou where saying\n\nIn regards to being limited to Rohan and Gondor:\n\n- Theoden, Hama, Boromir, Faramir, Prince Imrahil are good at battle [https://community.fantasyflightgames.com/index.php?/topic/89444-readying-effects-realtive-power/#]-quests but also needed for combat phase\n\n- Beregond and Denethor are likewise for siege-quests (with Denethor having an active ability as well)\n\n- Theodred always gets committed to quest. Now he can unexhaust afterwards or combo with any of the other\n\n \n\nI dscussed battle/sieg questing (There the mount can help a lot) i was refering to normal willpower questing\n\n \n\nAlso Nerdmeister [https://community.fantasyflightgames.com/index.php?/user/110961-nerdmeister/] thx for pointing out that light of valior is unique i am so used that the unique symbol is in the middle of the card that i havent noticed it on the top of the card, makes a diffrence true, Been playing my elf deck all wrong oh well time to go back and replay a lot of quests without using light of valinor on elrond and glorfindel. It is always good to get feedback, thx for all answers.  I still think the mount is underpowerd compared to uc but all cards cant be equally good.\n\nEdited September 6, 2013 by noctum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89444-readying-effects-realtive-power/?do=findComment&comment=860533","commentId":860533,"userName":"Legolas of Darkwood","timestamp":1378629086,"content":"I think Steed of the Mark is a nice, thematic and useful card. Is it as strong and versatile as UC? Certainly not. However UC is one of THE power cards in the game and there is no other readying effect in the game that can compare with it in general. My main issue with UC is that - while being such a strong card - you need to get three core sets for your three copys (not nice ffg!).\n\nI also agree that Light of Valinor is stronger (despite being unique). However LoV is one of the elven power cards and can only be played on elves and therefore these cards don't compete for the same spot (unlike UC). Like you said not all cards can be equally good. And it's fitting that elves get some really strong cards too.\n\nNow I have to admit that I was a little underwhelmed myself. That's primarily because unlike other mediocre readying effect the Steed of the Mark is the same sphere as UC and therefore has no place to run from UC. They compare for the exact same spot and UC is just (always) so much better that I can see five reasons to include Steed of the Mark:\n\n1. Rohan-Gondor fluff reasons\n\n2. you have a LOT of resource generation and don't care for the readying cost\n\n3. you want UC AND Steed of the Mark\n\n4. you don't own three core sets, or\n\n5. you don't want to take apart the deck currently using your UC cards ;-))"}]}