{"url":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/","title":"do you think the saga cycle with deal with the scouring of the shire?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853641","commentId":853641,"userName":"richsabre","timestamp":1377808984,"content":"EDIT- i realise it says 'with' instead of 'will' but for some reason you cannot edit titles...\n\n \n\n \n\ni think in all perspectives apart from the actual narrative itself, the scouring of the shire has to be the most anticlimatic ending to a story ever\n\n \n\n....that doesnt mean i think it is in the book, because i see it as a key point in the narrative- the hobbits have a gone a complete journey- from pie eating, pipe smoking, beer drinking inquisitiveness to warrior heroes. the scouring allows that to come to its own climax in itself\n\n \n\nbut for all other medium, film, gaming etc....it is a bit of a nightmare, and one can understand the film cutting it out, as terrible an act as it was\n\n \n\nhowever, this game is different, it is very narrative driven, and i cannot imagine that it will be left out, but one never knows...the last saga quest we see may be the fight between gollum, frodo and sam to get to mt. doom.\n\n \n\nwhat do you think?\n\nEdited August 29, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853646","commentId":853646,"userName":"Morithain","timestamp":1377809487,"content":"considering they've already cut out the Barrow Downs, which I thought would have been a great adventure, I'm pretty sure they're not going to have it in the Saga.  But who knows?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853663","commentId":853663,"userName":"Pharmboys2013","timestamp":1377810681,"content":"I think during the in-flight presentation during gen-con the speaker very nonchalantly said the saga expansions would conclude at mt doom so I'm thinking no. If I remember from when I watched the video however that it was said so quickly and without thought that I would be surprised if it wasn't true (or more likely didn't truly know and was just assuming)\n\nOverall still thinking no"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853684","commentId":853684,"userName":"kyrie","timestamp":1377812612,"content":"My opinion and guess is no too, sadly. It would be a really fun quest, but I don't think the developers are going to do it for the same reason as Peter Jackson left it out.\n\n \n\nHowever, I just looked at the final book (book 6) of the Return of the King, and it seems like a plausible quest to have for the third one in the box. Sam's rescue from Cirith Ungol would be the first one, the journey through Mordor and the destruction of the ring at Mt. Doom the second, and the third would be the return to the shire and grey havens, which means you would see the scouring at that point. You can't just have a return home quest facing no enemies and just travel locations until the Grey Havens, that would be kind of lame and easy (at least I think so)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853692","commentId":853692,"userName":"Distractionbeast","timestamp":1377813788,"content":"As a designer, I'd probably shy away from it too, for the simple reason that it would only make sense in the context of having an all-hobbit cast - or at least all hobbit heroes.  Mechanically, it would need to be balanced enough for other setups, but it would be a hollow experience.  If it could be played with only hobbits, I think it could be very interesting. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853715","commentId":853715,"userName":"Rainelotr","timestamp":1377817266,"content":"> As a designer, I'd probably shy away from it too, for the simple reason that it would only make sense in the context of having an all-hobbit cast - or at least all hobbit heroes.  Mechanically, it would need to be balanced enough for other setups, but it would be a hollow experience.  If it could be played with only hobbits, I think it could be very interesting. \n\n \n\nGood point Beast. I hadn't thought of it that way. I would appreciate the quest either way, but going back to one of the earlier posts...\n\n \n\n> considering they've already cut out the Barrow Downs, which I thought would have been a great adventure, I'm pretty sure they're not going to have it in the Saga.  But who knows?\n\n \n\nThis was Heartbreaking!!! What is wrong with all the people in the LotR world of executive decision making??? I just don't understand why this is so universally ignored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853775","commentId":853775,"userName":"Raven1015","timestamp":1377824448,"content":"I actually really enjoy the Scouring of the Shire, so I would love for it to be included. However, I highly doubt that they will include it, for all the reasons people have mentioned. The proper end to our Saga adventures should be dropping the ring into the fire (or Gollum falling into it, I suppose), and I'm pretty sure that that is where it will end."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853786","commentId":853786,"userName":"richsabre","timestamp":1377825476,"content":"indeed i agree with things that have been said...however, it remains a flaw in the plan to drop the scouring...again in every medium, in that it leaves a hole in the narrative, one that needs addressing.\n\n \n\nfor instance, if there's no scouring, what happens to saruman? i assume we wont have a ridiculous impalement like the movie in the tower saga pack, so does he just get put to the side? seems a little anticlimatic in itself\n\n \n\nalso, as i originally said, the real ending to lotr isnt the ring being destroyed- its the hobbits coming home as changed people. this is really what the lotr is about...not the ring, but the hobbits.\n\n \n\nso, to leave or not to leave...that is the question....its a tough one, thankfully not for us to decide\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853916","commentId":853916,"userName":"Nickpes","timestamp":1377841475,"content":"I believe that they will have it ... Saruman is the main character here, and Saruman met hs body ending there (his soul lived in the abyss I think forever) ... thus not having it in would be a mistake"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853945","commentId":853945,"userName":"HeavyKaragh","timestamp":1377847585,"content":"I'think it will be included:\n\n \n\n> it seems like a plausible quest to have for the third one in the box. Sam's rescue from Cirith Ungol would be the first one, the journey through Mordor and the destruction of the ring at Mt. Doom the second, and the third would be the return to the shire and grey havens, which means you would see the scouring at that point.\n\nI can't see any other \"action\" parts (a probable fourth, Cormallen, is too short and has nothing special).\n\n \n\n \n\n> As a designer, I'd probably shy away from it too, for the simple reason that it would only make sense in the context of having an all-hobbit cast - or at least all hobbit heroes.  Mechanically, it would need to be balanced enough for other setups, but it would be a hollow experience.  If it could be played with only hobbits, I think it could be very interesting. \n\n \n\nI don't see that a problem. By the time the sixth box is released hobittses should be able to deal (better or worse) with any kind of Encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=853963","commentId":853963,"userName":"faith_star83","timestamp":1377851905,"content":"I am pretty sure that they will not include this in the Saga Adventures. From a gaming point of view it does not make much sense. The movies left it out and everybody loved them despite of this, same goes for the game. Casual Players want to feel like the heroes he threw the ring into the fires of Mt Doom and that's why they will play the Saga Expansions.\n\n \n\nFrom a Game Designer's point of view ending the quest with the destroying of the ring leaves the bigger part of the player's probably more satisfied than going on to the scouring of the shire....especially the ones that did not read the book..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=854081","commentId":854081,"userName":"Jekzer","timestamp":1377870161,"content":"I guess the same, the Scouring of the Shire is more like a \"branch\" on the epic quest to destroy the ring.\n\n \n\nI see, however, that as Rich said, this is the journey of hobbits, the change from humble beginnings to heroes. And they can close the Saga Expansions as they started: with the hobbits, this time, being them the ones that face the terror on the Shire.\n\n \n\nI'd love to see it, but as I said before, there's no more epic final than the destruction of the ring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=854429","commentId":854429,"userName":"player1761766","timestamp":1377914516,"content":"I, too, would love to see it included, but don't really see it happening for all the reasons stated above. \n\n \n\nWhat it has made me think of, however, is the possibility of a new type of expansion for the game that promotes theme decks over all else. Probably POD than a regular release, but rather than the \"special\" sort of GenCon decks we've seen so far, we could get a single quest in a 60-card pack that has specific instructions in the setup part of 1A, for example \"players must use all Hobbit heroes when playing this quest\" or whatever. Of course, that doesn't stop you from trying the quest with other decks, though perhaps there will be the odd treachery card that would target all non-theme cards currently in play. Maybe. (I'm here because I can't sleep, so am not really giving this much coherent thought...)\n\n \n\nIt could be a nice way of getting some of the more interesting parts of the books and lore released into the game without making Saga expansions too unwieldy or whatever. And would give us all the Barrow Downs when there is clearly a demand for that episode as a quest from a lot of users here! Thoughts on a postcard, please..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=854622","commentId":854622,"userName":"klaymen_sk","timestamp":1377953236,"content":"> From a Game Designer's point of view ending the quest with the destroying of the ring leaves the bigger part of the player's probably more satisfied than going on to the scouring of the shire....especially the ones that did not read the book...\n\n \n\nAlso it is quite an insignificant event when compared to defending Minas Tirith, or the final push to reach Mt. Doom. Yes, I too would like to see it, but I don't believe that we will get it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89476-do-you-think-the-saga-cycle-with-deal-with-the-scouring-of-the-shire/?do=findComment&comment=854858","commentId":854858,"userName":"Rapier1","timestamp":1377980235,"content":"I take a different point of view from everyone else.\n\n \n\nI think that all the side-bits of the lord of the rings will get made. We might not get it in the saga quest now (like we're not getting the barrow downs). But I think it will get made eventually; possibly as an additional saga pack when the main story is told.\n\n \n\nWhy would FFG not use good material like this? Only if the game stops selling or they lose the licence.\n\nI don't think we'll get it soon though (especially not the barrow downs and Tom Bombadill - which I guess we now won't see until after the main \"saga\" is over).\n\nThat is of course, assuming that the parts missed out are covered by the FFG licence. It's always possible they can't use (for instance) Tom Bombadill due to licence restrictions. "}]}