{"url":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/","title":"Your thoughts on the new expansion.....","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=853844","commentId":853844,"userName":"Ozil23","timestamp":1377831278,"content":"Well, what do you have to say about the new hero (eomer). I think that you could form a deck using him, theoden and maybe Eowyn to have access to all those older rohan cards. Also do you think this expansion or cycle will be as ATS where they created a new type of cards, (outlands) rather than creating more support towards the main faction (gondor in that case)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=853933","commentId":853933,"userName":"ana4","timestamp":1377843820,"content":"Whilst I really like the new cards, and the overall idea, I'm afraid the support for the existing traits will be limited. I especially worry that Gondor will get little on top of the little he got in her own cycle. They will certainly boost Rohan, but the presumption may be right that it will be similar to Gondor in Heirs of Númenor. On top of that, they will try and develop Isengard, but only as a minor faction, I think. Finally, my hopes are we shall see some Elf love, there are some super powerful Elf cards, like Glorfindel, Elrond's Counsel, Arwen Undómiel but I hope we should see more Elven synergies, and the two previewed characters might suggest that.\n\n \n\nBy the way, has everyone decided who is the second hero, the Elf-maiden or the very hot Elf mysteriously disappearing?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=853995","commentId":853995,"userName":"richsabre","timestamp":1377859479,"content":"i think the general idea is the female is arwen and the male is haldir. i am looking forward to having an isengard faction though i hope its more interesting that outlands....there is just something about outlands that i do not like. probably it is that you need to have an outlands deck to play them rather than just put 1 or 2 in an existing deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=853999","commentId":853999,"userName":"ana4","timestamp":1377859903,"content":"True, Richard, Outlands are just little fun to play. I do not think Isengard cards will be plentiful enough to create full decks. But they can be an interesting addition to different types, perhaps.\n\n \n\nI agree the female does look like the ally Arwen. And in that case, it would seem likely Arwen will be the second hero. I hope not, however, since the ally is very good, and I'd rather see new characters.\n\n \n\nI don't believe the Elf is Haldir. I see little resemblance between the spoiler and ally Haldir. Given they are both by the same artist, it should clearly be a different Elf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854078","commentId":854078,"userName":"Jekzer","timestamp":1377869621,"content":"Well there's a difference between Gondor and Rohan traits. When HoN and AtS cycle came out, Gondor wasn't developed, just some cards here and there.\n\n \n\nIf they do the same to Rohan, we have a already a fair amount of cards from the first cycle. So this way we can fully develop powerful Rohirrim decks just by adding few cards. We know the good explorers and questers they are. Now we'll meet their martial force.\n\n \n\nIt also depends if we are going to see things like resource acceleration or card advantage for them, wich they may lack at the moment.\n\n \n\nAnd I am also with both of you: elves could be one of the shinies of this cycle, along with a spark of Isengard trait!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854084","commentId":854084,"userName":"Karlson","timestamp":1377870474,"content":"> i think the general idea is the female is arwen and the male is haldir. i am looking forward to having an isengard faction though i hope its more interesting that outlands....there is just something about outlands that i do not like. probably it is that you need to have an outlands deck to play them rather than just put 1 or 2 in an existing deck\n\nI actually don't mind putting Outland allies into my other non-Outland themed Gondor decks.  For example, I usually throw in Knights of the Swan in my Tactics deck simply because the artwork is cool and they're a very cheap chump blocker, more or less.  I also usually throw in just one copy of several of the other Outland allies in my Leadership deck so they don't take up too much room but they do add variety.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854204","commentId":854204,"userName":"Rainelotr","timestamp":1377883087,"content":"> i think the general idea is the female is arwen and the male is haldir. i am looking forward to having an isengard faction though i hope its more interesting that outlands....there is just something about outlands that i do not like. probably it is that you need to have an outlands deck to play them rather than just put 1 or 2 in an existing deck\n\n?????????? I tend to agree with Karlson here. \n\n \n\nI have yet to play a deck containing the Outland's hero *(brain is forgetting his name now)* but I play outlands all the time. ALL of the basic Outland allies are solid in their spheres and there are generally multiple combinations between the diff colors that work well. \n\n \n\nHerdsmen + Ethir swordsmen especially work together with no other Outland support. They're great allies for great cost that only get better the more of them that show up. \n\n \n\nGoing back to the original post. Eomer is going to quickly take over as my tied-for-favorite Tactics hero, with Boromir. Replacing Beorn. Tactics continues to have the highest amount of cool hero choices."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854480","commentId":854480,"userName":"Ellareth","timestamp":1377924443,"content":"I was going to comment that ethir swordsman and knight of swans are very good even without other outlanders but I see people already beat me to it.\n\nAs for Rohan deck, I find them to be already potent.\n\nEowyn and army of blue Rohan allies (namely West Road Traveller) can quest extremely well\n\nHaving early feint turns Hama into mean war machine, and even without feints there are cards like foe hammer that are very good to be able to reuse.\n\nFinally Theodred smoothes out resource problem of trisphere deck and opens up cards like sneak attacks and very good tale.\n\nIm not saying Rohan decks are as good as dwarves or outlands, but Im thinking Eomer will get overshadowed.by Hama."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854493","commentId":854493,"userName":"ana4","timestamp":1377927782,"content":"Of course the Outlands are strong just like that. When they first announced the Swordsman, I was thinking it would be the only stat booster out there - which would be far, far better design. But that is not what Rich meant, I think. Of course you can just have one or two, and they play fine, but it is like playing Mirlonde with no other Lore hero, or Mirthrandir's Advice with just one or two Lore heroes, you just have to feel lame doing that, or I certainly would. In one hand, you want to get the best out of cards, their potential. On the other hand, with Outlands, when you do so, you only have very few choices left in the deck. You go all Leadership heroes, and the cards are basically given to you; that takes a lot of deck-building fun away, at least for some of us, apparently."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854641","commentId":854641,"userName":"Rainelotr","timestamp":1377955419,"content":"Ana, that's like saying \"urgh I can't use any rohan cards at all unless I take eomund And the other rohan stat boosting. And you know what I just can't live with myslef unless the entire deck is rohan since eomund is going to be in it.\n\nOr I can't take beravor at all unless all I do is use her card draw.\n\nThese cards are all multifaceted. And even if you are building a straight hirluin outlands deck you don't have to go all leadership. You are right in saying its the easiest build to see but that doesn't preclude e xperimentation.... or shouldn't generally if I have mirlonde in a deck with one other lore hero or no lore heroes it is because I'm sacrificing power for versatility. Whenever I give something up.... the power of the outlands in this case, I should be doing so to gain versatility in gameplay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854671","commentId":854671,"userName":"ana4","timestamp":1377958311,"content":"> Ana, that's like saying \"urgh I can't use any rohan cards at all unless I take eomund And the other rohan stat boosting. And you know what I just can't live with myslef unless the entire deck is rohan since eomund is going to be in it.\n\nNo, it is not, what are you talking about? I was talking about not reaching cards' potential, like Pelargir Shipwright, of course you can play him in deck with less than three Spirit heroes, but I wouldn't want that, because then he's not reaching his potential. And with Outlands, this is much more pronounced, once you're using only one or two of them, you are basically wasting card slots for something more interesting.\n\n \n\nYou can, despite what you say, use Rohan allies and reach their potential, because there are different synergies they do, like leaving play which combos well with Horn of Gondor, Valiant Sacrifice, Imrahil. Outlands, on the other hand, do not possess other tricks - or do you want to argue that they are actually better when they are fewer? Because certainly Éowyn, Dúnhere, Théodred, or even The Riddermark's Finest and Westfold Horse-breaker, they all can be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89483-your-thoughts-on-the-new-expansion/?do=findComment&comment=854750","commentId":854750,"userName":"Rainelotr","timestamp":1377966353,"content":"Maybe I was giving bad examples but I was trying to say sacrificing power of the outlands by only playing with a few is perfectly fine. I currently have a deck with the outlands in it that also can reset threat. Raise heroes . Do thezigil miner combo. The earendil took combo. The sword that was broken w aragorn combo etc etc. Its not a outlands power deck but it contains the lore and spirit outlands to great effect and they combo well with the sword that was broken while allowing a great deal of diversity\n\nAgain... sorry my examples were stupid"}]}