{"url":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/","title":"Tolkien in depth analysis thread #2- The Scouring of The Shire","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854657","commentId":854657,"userName":"richsabre","timestamp":1377957386,"content":"I was going to post this in my 'do you think we'll see the scouring thread, but i wanted to have a proper discussion on the scouring of the shire, not whether we shall see it, but an indepth analysis so i thought i would use it for the topic of my second analysis thread. the first is 'what you would have done in place of the fellowship and can found here [https://community.fantasyflightgames.com/index.php?showtopic=70700]\n\n \n\nSo firstly, i think my main point of this thread, is to try and convince those who havnt thought much about the scouring, or alternatively those who perhaps havnt read the book, how important to the lotr it really is. to those who already think along these lines, hopefully you can bring something to the discussion i havnt, or even if you disagree you can show an alternate hypothesis\n\n \n\nnow, in the war of the ring the scouring takes little part, but in the events of the ring, the scouring plays a very large part indeed.\n\n \n\nin my eyes there are two key elements tolkien is trying to show with the scouring.\n\n \n\n1.as i have said in my other thread it portrays the hobbit's transition from quiet lazy hobbits into warriors and leaders. they return to their homeland which they initially went out to save, only to see it ruined, turned into an industrialised landscape. is this a metaphor tolkien is using for the state of the world in which he wrote the book? probably. we know saruman was the most inquisitive of technology out of the istari, and he also was capable of using any means to find the answers to his questions. the hobbits themselves are shown to be able to use their skills aquired during the entire previous year, in order to rally the hobbits to defeat saruman and his followers.\n\n \n\nin fact gandalf even says, upon leaving the hobbits, that they are basically on their own....gandalf i am sure knew what was about to happen, and it is for this reason the scouring is a particularly important event in hobbit history\n\n \n\n2. secondly i see the scouring finishing off the book entirely - as someone answered a question on my lore challenge thread, saruman and grima were the last deaths in the events of the ring....the last casualities of war if you like....this is a key moment and one tolkien chose to portray this way for a reason\n\n \n\nthe key reasons behind this part is that saruman is stripped of all powers apart from his voice and thus he has to take dominion of the weakest race of all middle earth...but....the question i believe tolkien is asking, is whether the hobbits really are the weakest race?...the hobbits show this as two very different ends of the spectrum. at one side, leaderless, they are completely vulnerable to invasion of their peaceful little land, and i guess we see what would have happened if the quest for the ring failed. but it didnt, therefore we see the other end of the spectrum- hobbits under a true leadership. this way we see that hobbits aren't infact lazy quiet pie-eaters, but the hobbits gandalf saw in bilbo- the potential for fighting and heroism.\n\n \n\nlooking at both books, the lotr and the hobbit, we see this is really the key theme behind both- that people arent what they seem and that people have the ability to adapt. here are some part of this:\n\n \n\n-bilbo is transformed from chapter 1 of the hobbit to a burglar and hero by the end of the book\n\n-the 4 hobbits go through a similar transition...i think sam is particularly true of this\n\n-gandalf is shown as an old grey man to the hobbits in both books, but we see several times throughout his true power\n\n-aragorn goes from lonely wanderer, shunned by all, to a king of men\n\n-gimli and legolas for a friendship otherwise unheard of between elf and dwarf\n\n-the elves dwindle as the dominent race of middle earth (really this started long before the lotr events) and men adapt to thier new responsibilities\n\n \n\nso, in conclusion, i believe the scouring of the shire, is ultimately tolkiens key narrative works rolled into 1 chapter- change.\n\n \n\ni invite you to add your thoughts to this fascinating part of tolkien's work\n\n \n\nrich\n\nEdited August 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854668","commentId":854668,"userName":"Nickpes","timestamp":1377958163,"content":"reading the title I started to think what I was goinf to write ... well it is exactly what you wrote in point 1. \n\n \n\nI believe that the scouring is the proper end to the tale ... it is the lesson that people are tought from any good myth. And ths it is the most important part in the book. Without it it is unfinished. Yet most people seem to not find interest in it, maybe because it come after all those big fascinating battles ... but the small everyday battles of life are that win the war after all :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854691","commentId":854691,"userName":"ana4","timestamp":1377961150,"content":"The scouring is the appropriate finale to the book. Leave aside how hard it would be to transfer into a movie, or even a card game, the aftermath of war must have been especially important for someone who has fought in one (and had his friends died in it). The book really comes full circle in this chapter and show the great growth. My favourite part is when Saruman openly recognizes the personal growth of Frodo, and respects him and hates him for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854727","commentId":854727,"userName":"richsabre","timestamp":1377964204,"content":"thanks for contributing nickpes and ana\n\n \n\ni think you both make a good point about saruman's realisation, and in fact what makes that more special to the narrative is that saruman is more physical and human (only in form of course) than the other great enemy - sauron. we do not see sauron's demise, but we do see saruman's and it is not a particularly 'grand' death, however more of a human death, again relating back to the changes in this chapter. saruman goes from great wizard to a beggar wandering with his personal slave grima, only to be betrayed to his death\n\nEdited August 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854741","commentId":854741,"userName":"player1761766","timestamp":1377965602,"content":"I think your point about the industrial metaphor is right on the nail, rich. Even by calling the land \"the shire\" Tolkien immediately pulls to mind the countryside in a fairly unequivocal way - certainly for any Englishman reading the book. By spoiling his idyll at the end here, it is a clear slur on the over-industried society that many people were already decrying back when he was writing. Having Saruman be the agent of this spoiling is perhaps inviting parallels to be made for the industrialists as \"the baddies\". \n\n \n\nI do think, though, that without something at the end of the tale, the entire story falls a bit flat. The way the film runs, the four hobbits go through these amazing, emotional adventures, and through so much personal growth, and then they just...go home, back to their old lives, and it's as if nothing has changed (except they're all wearing just a little too much makeup now). Yeah, Frodo has some chest pains now, but otherwise, they're all just the same as they were, and those amazing events may as well never have happened. However, by putting the hobbits through this final ordeal in his book, Tolkien shows us that yes, they have fought for the future of Middle Earth and the rights of all the free peoples, but now they have to fight a much more personal battle, the right to continue with their own lives. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854760","commentId":854760,"userName":"Nickpes","timestamp":1377967610,"content":"Tolkien writes about the things he lived in his life. Small farmers, unknown people, went to a great war, they became heroes , some of them lost their lives or loved ones, and then they went back home only to find a different place which they had to fight again, a different war, not so important for the greater world around, in order to bring it back in the state it was ... weather this was industrialization or destruction by the war itself.\n\n \n\nRich your comment is like a nice pass in order for me to write what I believe about Sauron and Saruman. Sauron is the evil idea that enters the people minds and brings destruction, Saruman represents those people that are affected by that idea and act accordingly"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854778","commentId":854778,"userName":"richsabre","timestamp":1377969306,"content":"@ spalanzani - good point in that 2nd paragrapgh. the ending does offer a concluding conflict, and one closer to home that weapons of war (siege of course, not swords) will not help.\n\n \n\n@ nickpes - i really like that comparison between sauron and saruman. there is a certainly material loss in sauron that is shown throughout with saruman. i think there is perhaps some signifance in the hierarchy that sauron is the higher...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854795","commentId":854795,"userName":"Nickpes","timestamp":1377971358,"content":"thats why I believe that Sauron is the \"idea-philosophy\" and Saruman is the \"person-instrument\" that tries to apply that in the world. Reich was the idea and German leaders the instrument in Tolkiens time \n\n \n\nSaruman in the end became just a shadow (spirit without body, prisoned forever in other words) to remind of the free people what might happen if they where not acting for the common cause"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854801","commentId":854801,"userName":"Nickpes","timestamp":1377971847,"content":"excuse if I write some stuff not easy to understand, I'm used to read in English even science but I'm not used to make discussions, especially ones that are about philosophy and ideals in English :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854810","commentId":854810,"userName":"richsabre","timestamp":1377973041,"content":"no- your english is perfect, and thank you for contributing. i do wonder how much tolkien actually actively constructed metaphors in his work though?\n\nwhat you say makes perfect sense, and i agree with it. the great war was of course a huge influence on tolkien. but what i wonder is, did he do these things subconsciously?\n\n \n\ni think many authors cannot help but to create these parallels, and i believe it may have a been a mixture of active and passive in tolkien's case\n\n \n\nso...keeping the metaphor, if sauron was the thought, saruman the physical presence, then what was wormtongue?\n\n \n\nmy vote is going for propaganda..the voice, the poison that creeps into those who are easily swayed. indeed it is all in his name.\n\nhowever, just like leaders can make propaganda work for them, so it can come back and stab them in the back.....or in saruman's case, cut their throats\n\n \n\nwhat i find interesting is that another theme in lotr is the coming of the age of men. it is interestng how negatively tolkien portrays industrialisation when in reality, that is the very essence of humanity....to create, destroy, create anew. the elves were constant, as were the dwarves. they lived many ages of men. but men's lives were short, however more destructive.\n\n \n\nthe scouring can thus be seen almost as tolkien contradicting himself, he has a double vision of men.\n\none is the 'aragorn' vision, where men (and women) are good, heroic and just. the other is the 'saruman' vision (even though he wasnt a man i still think the comparision is there) where men are destructive, taking what was once beautiful (here the shire) and creating something horrible with it\n\nrich\n\nEdited August 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854820","commentId":854820,"userName":"Nickpes","timestamp":1377974761,"content":"> what you say makes perfect sense, and i agree with it. the great war was of course a huge influence on tolkien. but what i wonder is, did he do these things subconsciously?\n> \n>  \n> \n> i think many authors cannot help but to create these parallels, and i believe it may have a been a mixture of active and passive in tolkien's case\n\n \n\nI agree. There are some stuff that he created in full knowledge of what he was doing. i.e. I think Bag End was the name of a farm owned by his aunt in which he spend a lot of time, and he named the home of Bilbo, in the shire (and we all now what shire is for people in England), thus in the countryside he so much loved. But other stuff were subconsious , coming from his life experiences. I believe the later to be much more than the first.\n\n \n\n \n\nI agree about wormtongue\n\n \n\n>  \n> \n> the scouring can thus be seen almost as tolkien contradicting himself, he has a double vision of men.\n> \n> one is the 'aragorn' vision, where men (and women) are good, heroic and just. the other is the 'saruman' vision (even though he wasnt a man i still think the comparision is there) where men are destructive, taking what was once beautiful (here the shire) and creating something horrible with it\n> \n>  \n\n \n\nI do not believe it is contradicting. It is pure reality, especially in the eyes of a \"man of the shire\" if I may use that ... there are people that want to keep the shire pure and others that want to change it forever in their own benefit. This is the story of mankind, the story of the places that Tolkien lived, so I do not think there is a contradiction.\n\n \n\nAs for the elves ... maybe they are the fairies (I think a favourable subject in British isles) that try to protect nature, and dwarfs maybe the little men that always look for gold at the base of a rainbow, I do not remember their name right now. I think they are a bit more Irish "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854826","commentId":854826,"userName":"richsabre","timestamp":1377975821,"content":"as an englishman i can help you there :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nfirstly the little men are indeed an irish thing- leprechauns.\n\n \n\ntolkien did indeed draw on many english tales, and others besides. i do see what you mean about the shire being a tale of two sides, and perhaps i spoke too hastily on that note as i probably agree more with that representation that i do with my previous one\n\n \n\nas someon who lives in a 'shire' type area in england (indeed it is extremely shire like) i know only too well there are those who wish to keep the countryside as it is. infact it is a source of frustration. to give an example, a loved one i know lost one of thier family and we put flowers in an area that is popular with tourism. the area is protected by officals and the flowers and card is usually removed....it may be that it is taken by someone else, or blown away, but i do not believe that is always the case\n\n \n\nit is also the case as a local of this 'shire' area, you are often subjected to 2nd class treatment, as the tourism people are far more interested in the money tourists bring, than those who live there\n\n \n\nyou can probably tell from that, that i side more with saruman than the hobbits...which is strange becuase i do love the beauty of the area that i live in, in fact much of my artwork is depicting those places.\n\n \n\nhowever the scientist in my cries for progression....not to the point of saruman raising an army, but enough to get annoyed with traditional values, which i hate down to my very bones....there are other reasons i hate this traditional way of life, however i think they are not appropriate for a forum and would probably offend\n\n \n\nrich\n\nEdited August 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854843","commentId":854843,"userName":"Nickpes","timestamp":1377978056,"content":"Just for the record, I too am a British citizen (at least on papers), born in Shatton Coldfield, a suburb of Birmingham. But since my parents were Greek I lived there for two years only before moving in Greece. Thus I love UK as a homeland.\n\n \n\nYes leprechauns it is, ty\n\n \n\n> you can probably tell from that, that i side more with saruman than the hobbits...which is strange becuase i do love the beauty of the area that i live in, in fact much of my artwork is depicting those places.\n> \n>  \n> \n> however the scientist in my cries for progression....not to the point of saruman raising an army, but enough to get annoyed with traditional values, which i hate down to my very bones....there are other reasons i hate this traditional way of life, however i think they are not appropriate for a forum and would probably offend\n> \n>  \n> \n> rich\n\n \n\nNow there is a contradiction, you side with Saruman while you love Gandalf and the hobbits  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\n \n\nI can see your point, though I'm more on the \"shire\" kind of life. But I believe that everything can be usefull if used correctly and with limitations. If your place stops being a \"shire\" and becomes an \"industry\", then tourist will stop visiting and you will be left with a grey place to live  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] .  Offcourse this was not the case when Tolkien was around. It was an invasion of a different and seemingly ugly way of life instead of the green fields full of sheep ... There where no tourists, nothing like these sort of things. In the minds of the folks back then it would seem like slavery to start working in factories.\n\nPS : I would love to live in English countryside ... places like cotswalds look like a paradise for me "},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854846","commentId":854846,"userName":"richsabre","timestamp":1377978489,"content":"yes, it is indeed a mixture of both. too much of one thing destroys another. i am of course in a position to be extremely biased....though i do not particularly see the northern countryside where i am to be like the shire. tolkien of course based the shire on more southern areas of england, whereas the land is rather rougher and mountainous up in the northern areas (i read from one source that the northern shire farthing was meant to be where i live)\n\n \n\nanyways, it is a fascinating topic, and of course we are at the disadvantage of living in an era quite unlike when tolkien wrote lotr. i would love to know what he would have thought of the aspects of modernisation that we currently live in..\n\nrich\n\nps. yes, it is strange, i love both hobbits and gandalf, though if i were to form alliances, i would chose saruman everytime....go the white hand!\n\nEdited August 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854854","commentId":854854,"userName":"Nickpes","timestamp":1377979514,"content":"I was just talking to my wife of how i found a forum topic that made me write more than two lines on a post. Believe me or not, despite the fact that i participate in a number of communities, i rarelly write a lot. Indeed a fascinating topic, a mix of our lives with the books we love. Credit goes to you for creating it.\n\nAs for what tolkien would think ... It would seem like morgoth was in middle earth again hehehe.\n\nTrying to analyze silmarillion in such a way would be very interesting too, though much more difficult.\n\nWell, of to bed, hope that others will post so we have brand new ideas to discuss tomorrow!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854856","commentId":854856,"userName":"richsabre","timestamp":1377979914,"content":"thank you kindly. if the topic kicks off (the forum is very quiet today for some reason) then i may make a series out of it. i had a thread where i asked what topics people would want which i may ressurect if i can find it\n\n \n\nactually i called this topic number 2, however there have been two topic #1s for some reason. in addition to the one linked in my first post there is another here [https://community.fantasyflightgames.com/index.php?/topic/82849-tolkien-lore-topic-1-evil-in-middle-earth/]\n\n \n\nanyways, thanks for participating!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854857","commentId":854857,"userName":"Raven1015","timestamp":1377980015,"content":"I have always defended the Scouring of the Shire section of the book even though there are those who hate it. I can definitely understand their perspective, I just don't share it. Personally, it was always gratifying to see the Hobbits come back as confident, almost fearless characters, a far cry from their terrified flight from the Shire. I could laugh along with the Hobbits as some ruffians try to intimidate them after they have faced down the Nazgul!\n\n \n\nAs far as parallels or themes, I'm always hesistant to ascribe particular things or concepts to charcters, keeping in mind Tolkien's warnings about allegory vs. applicability. One thing I will say is I think the Scouring is absolutely integral to the story. One reason why is that it shows that even the most secluded, isolated spot in Middle-earth was touched by the war, and would have to undergo reconstruction. Without that aspect, then you simply have the Shire seemingly unscathed by the war, which I don't think is the message Tolkien wanted to send. In my opinion, he very clearly wanted to show that war touches everything.\n\n \n\nOne thing I will touch on is that I don't think it was the Hobbits' leaderless system that made them vulnerable to invasion or being taken over by Saruman and his thugs. What made them vulnerable was a marked lack of experience in dealing with such threats, along with a lack of any martial knowledge. The Hobbits clearly had the will to resist, and some characters who did resist, the issue was that no one in the Shire had ever had to deal with such a situation before and so had no idea how to mount a collective resistance. Merry and Pippin step up and provide tactical/strategic leadership, and bring an infectious confidence created by having to deal with similar threats during their journeys. However, I guess what I want to say is that we don't see the Shire's political system substantially change after the war. Merry, Pippin, and Sam certainly become respectable figures that are influential, but we do see the Shire largely go back to its old way of life, albeit with stronger connections to the outside world. Perhaps a small point, but an interesting one, at least to me.\n\n \n\nFinally, with the Scouring we see the culmination of a path that began with The Hobbit. One of the things I have been thinking about lately (very much influenced by the Tolkien Professor) is that Bilbo's journey was important for the fate of Middle-earth not just because it got rid of Smaug, who could've been used by Sauron, but because it transformed Bilbo. This Bilbo 2.0 exerted an influence on the next generation of Hobbits (Frodo, Sam, Merry, Pippin, etc.), who grew up listening to his stories and thus had a different outlook than other Hobbits, which made them great candidates to essentially save the world. If this never had happened, if Bilbo had never gone on his journey, then there may never have been a Frodo, Sam, Merry, and PIppin as we know them, and the whole fate of the world may have been different. Anyway, the Scouring of the Shire sees this new generation of Hobbits complete their journey by facing down the Shire's threats entirely on their own, without the aid of wizards or rangers. This is absolutely huge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854862","commentId":854862,"userName":"richsabre","timestamp":1377980871,"content":"thank you for contributing Raven\n\n \n\nfirstly, i think you make a good point about nothing being untouched by war. that the shire was affected by the war of the ring is very important....and i guess its key to keep in mind the scale of the war, from mordor to harad, from dale to lothlorien and to the shire...all were affected. in this way the war of the ring is certainly a 'world war' in keeping with the great war influences (though i guess it wasnt technically a world war...which would have to include the undying lands, and the far east which we never see, and of course forochel...but i think its enough to merit the likeness)\n\n \n\nonto the leadership aspect. i do see where you are coming from, and i see that as a valid point, the hobbits lacked war like abilities on the face of it, though i am hesitant to abandon my idea that they were capable warriors, even without any knowledge(for instance golfimbul as a point...they certainly knew how to defend themselves, at least in the past, and they sent archers to the north kingdom (at least they said so))...they had the ability and i still think all they lacked was a banner which was provided by the returning hobbits.\n\n \n\ni think tolkien was keen to portray hobbits as warriors in hobbit-cloths. several times we are shown that the skill for hobbit-fighting is intrinsic to the race, and can come out with a few little 'push' factors.\n\nEdited August 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854868","commentId":854868,"userName":"Raven1015","timestamp":1377982139,"content":"One thing I forgot to mention... in the nurturing of a new adventurous generation of Hobbits, I think we can see the true brilliance of Gandalf. Whether or not he always foresaw all ends, he had a knack for pushing people to be what they could be and needed to be, without coercing them. He could step back and have faith in even the smallest of folk, this was his greatness, and why he was the Istari that succeeded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=854871","commentId":854871,"userName":"richsabre","timestamp":1377982328,"content":"> One thing I forgot to mention... in the nurturing of a new adventurous generation of Hobbits, I think we can see the true brilliance of Gandalf. Whether or not he always foresaw all ends, he had a knack for pushing people to be what they could be and needed to be, without coercing them. He could step back and have faith in even the smallest of folk, this was his greatness, and why he was the Istari that succeeded.\n\non that note, it has reminded me that the radagast debate on whether or not he succeeded is an excellent topic, and one i will probably start on a later thread.\n\n \n\nas for gandalf, i am sure he did know all ends ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=855057","commentId":855057,"userName":"Ellareth","timestamp":1378006784,"content":"> One of the things I have been thinking about lately (very much influenced by the Tolkien Professor) is that Bilbo's journey was important for the fate of Middle-earth not just because it got rid of Smaug, who could've been used by Sauron, but because it transformed Bilbo. This Bilbo 2.0 exerted an influence on the next generation of Hobbits (Frodo, Sam, Merry, Pippin, etc.), who grew up listening to his stories and thus had a different outlook than other Hobbits, which made them great candidates to essentially save the world. If this never had happened, if Bilbo had never gone on his journey, then there may never have been a Frodo, Sam, Merry, and PIppin as we know them, and the whole fate of the world may have been different.\n\n \n\n \n\n> One thing I forgot to mention... in the nurturing of a new adventurous generation of Hobbits, I think we can see the true brilliance of Gandalf. Whether or not he always foresaw all ends, he had a knack for pushing people to be what they could be and needed to be, without coercing them. He could step back and have faith in even the smallest of folk, this was his greatness, and why he was the Istari that succeeded.\n\n \n\nAs much as I am against Gandalf and his (disputably) illogical strategies, I cannot deny his ability of forsight.\n\nNot sure if Gandalf have gotten his 'feeling that something needs to be done in certain way' from Iluvatar or from the part of his (very diminished) ability (he was one of the wisest ainur and spent many years in garden of Lorien, and hope and encouraging dream was his domain), but there is no denying he had some sort of divine forsight.\n\n \n\nI am very curious to what Old Took and Gandalf did together, as every important hobbits in this book were descendent of the Old Took one way or another, and we know Gandalf and Old Took was close enough to have magnificient fire works at his birthday parties. Afterall, Bilbo was only chosen because he was grandson of Old Took."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=860347","commentId":860347,"userName":"Mr Coffee","timestamp":1378587279,"content":"I haven't been on the boards as much as I would as of late, but always enjoy when Rich starts up one of these lore-based discussions!  There already has been said much of what I would echo, so I will simply build on an excellent point that scratched the surface of what I was thinking:\n\n \n\n>  \n> \n> I do think, though, that without something at the end of the tale, the entire story falls a bit flat. The way the film runs, the four hobbits go through these amazing, emotional adventures, and through so much personal growth, and then they just...go home, back to their old lives, and it's as if nothing has changed (except they're all wearing just a little too much makeup now)..... \n\n \n\n \n\nI whole-heartedly agree with this sentiment, and I would carry it even further.... but I'm going to step away from this point for a moment, to tie it to another concept mentioned here... Our four adventurous Hobbits (five, if you back up and include Bilbo).\n\n \n\nThe reality of the LOTR cycle is that, despite all of these epic heroes... Gandalf, Aragorn, Elrond, Theoden, Boromir... the focus of the entire story is four short, hairy people.  While all the other characters have very important roles to play, the very structure of how Tolkien writes indicates that the focus is to be squarely on Frodo, Sam, Merry, and Pippin.  Obviously, the story begins with them in the Shire.  But beyond that, once the fellowship breaks, each of the storylines (and all other characters) follow the literary paths of the various Hobbits.  Boromir is sacrificed for them.  The Three Hunters line is simply an arc about catching up with Merry and Pippin.  As exciting of a character as Gollum is, he is simply a \"tool\" to show the development of Sam and Frodo's relationship and bond (to some extent a foil of some of each of their traits, eg: his deceit compared to Sam's faithfulness).  And although Tolkien develops other characters very well, he spends way more time and effort showing the Big 4's (or should I say Little 4's) growth.  Both individually, and within each other.\n\n \n\nWith that said, jumping back to Spalanzi's excellent point.  Without the Scouring, the end of the story does just what he said it would... fall flat.  But NOT so much for our four returning heroes, but for all the OTHER hobbits (at least in my opinion).  Frodo, Sam, Merry, and Pippin KNOW what they have gone through.  They KNOW how they have grown... and how much greater their bond together is... and what they have accomplished individually and together.\n\n \n\nBut without the Scouring, there would be NO transition to them becoming the leaders amongst the Hobbits.  They would return home and the reaction would be.... \"meh\".  \"So what?  You're a little taller, stronger... whatever.  Why should we pay any attention to 4 Hobbits who took off on crazy so-called adventures... just like daft ol' Bilbo??  And why would we listen to them... let alone make any of you leaders?\"\n\n \n\nThe other Hobbits needed to SEE FOR THEMSELVES the change and growth in our four champions.  They needed to rally around them, claim them as their own, and recognize that they were ushering in a new era in the Shire.  Otherwise, at best, Frodo just gets old and still sails off.  Sam is lucky if Rosie Cotton's dad ever lets her near that \"crazy gardner\", and Merry and Pippin spend the rest of their lives visiting the Green Dragon Inn, regaling themselves with old war stories while getting sloshed.\n\n \n\nAnd to me, THAT's why the Scouring is such a vital closing to the ring cycle.  Without it, Aragorn is still the new King.  Marries Arwen.  Faramir still earns his rightful place at his right hand.  Gimli and Legolas still become esteemed amongst their people, etc.  But the WHOLE FOCUS of the story... just fizzles into quiet and pints at the pub.\n\nEdited September 7, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=860631","commentId":860631,"userName":"richsabre","timestamp":1378651218,"content":"> I haven't been on the boards as much as I would as of late, but always enjoy when Rich starts up one of these lore-based discussions!  There already has been said much of what I would echo, so I will simply build on an excellent point that scratched the surface of what I was thinking:\n> \n>  \n> \n> >  \n> > \n> > I do think, though, that without something at the end of the tale, the entire story falls a bit flat. The way the film runs, the four hobbits go through these amazing, emotional adventures, and through so much personal growth, and then they just...go home, back to their old lives, and it's as if nothing has changed (except they're all wearing just a little too much makeup now)..... \n> \n>  \n> \n>  \n> \n> I whole-heartedly agree with this sentiment, and I would carry it even further.... but I'm going to step away from this point for a moment, to tie it to another concept mentioned here... Our four adventurous Hobbits (five, if you back up and include Bilbo).\n> \n>  \n> \n> The reality of the LOTR cycle is that, despite all of these epic heroes... Gandalf, Aragorn, Elrond, Theoden, Boromir... the focus of the entire story is four short, hairy people.  While all the other characters have very important roles to play, the very structure of how Tolkien writes indicates that the focus is to be squarely on Frodo, Sam, Merry, and Pippin.  Obviously, the story begins with them in the Shire.  But beyond that, once the fellowship breaks, each of the storylines (and all other characters) follow the literary paths of the various Hobbits.  Boromir is sacrificed for them.  The Three Hunters line is simply an arc about catching up with Merry and Pippin.  As exciting of a character as Gollum is, he is simply a \"tool\" to show the development of Sam and Frodo's relationship and bond (to some extent a foil of some of each of their traits, eg: his deceit compared to Sam's faithfulness).  And although Tolkien develops other characters very well, he spends way more time and effort showing the Big 4's (or should I say Little 4's) growth.  Both individually, and within each other.\n> \n>  \n> \n> With that said, jumping back to Spalanzi's excellent point.  Without the Scouring, the end of the story does just what he said it would... fall flat.  But NOT so much for our four returning heroes, but for all the OTHER hobbits (at least in my opinion).  Frodo, Sam, Merry, and Pippin KNOW what they have gone through.  They KNOW how they have grown... and how much greater their bond together is... and what they have accomplished individually and together.\n> \n>  \n> \n> But without the Scouring, there would be NO transition to them becoming the leaders amongst the Hobbits.  They would return home and the reaction would be.... \"meh\".  \"So what?  You're a little taller, stronger... whatever.  Why should we pay any attention to 4 Hobbits who took off on crazy so-called adventures... just like daft ol' Bilbo??  And why would we listen to them... let alone make any of you leaders?\"\n> \n>  \n> \n> The other Hobbits needed to SEE FOR THEMSELVES the change and growth in our four champions.  They needed to rally around them, claim them as their own, and recognize that they were ushering in a new era in the Shire.  Otherwise, at best, Frodo just gets old and still sails off.  Sam is lucky if Rosie Cotton's dad ever lets her near that \"crazy gardner\", and Merry and Pippin spend the rest of their lives visiting the Green Dragon Inn, regaling themselves with old war stories while getting sloshed.\n> \n>  \n> \n> And to me, THAT's why the Scouring is such a vital closing to the ring cycle.  Without it, Aragorn is still the new King.  Marries Arwen.  Faramir still earns his rightful place at his right hand.  Gimli and Legolas still become esteemed amongst their people, etc.  But the WHOLE FOCUS of the story... just fizzles into quiet and pints at the pub.\n\npoint 1: thanks for posting your thoughts, you make some very good points there\n\npoint 2: your last few words has made me get a beer......**** you, i needed to concentrate here :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=861512","commentId":861512,"userName":"Rainelotr","timestamp":1378748818,"content":"On a far more frivolous note I read through this portion of the book for the first time during the strobe lighted intervals of my first concert when I was 14. I think that says a lot about how captivating this portion of the story is even if I personally don't want to delve into the deeper philosophical underpinings"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89550-tolkien-in-depth-analysis-thread-2-the-scouring-of-the-shire/?do=findComment&comment=862861","commentId":862861,"userName":"lleimmoen","timestamp":1378879312,"content":"It is certainly special. It is an example that sets Tolkien aside from a typical, professional writer. It is highly anticlimactic, as the larger part of the Book VI. And as many other things throughout the story, it wouldn't have worked in a vast majority of cases, it just does here. It shows that Tolkien was fearless in a way, he didn't mind the critics one bit, it seems. He didn't write with respect to the audience (or the large audience). Otherwise he wouldn't have written Tom Bombadil in, you wouldn't have many characters only appear once and shortly in the Council of Elrond, you wouldn't have the destruction of Isengard told by Merry and Pippin in retrospect, and you certainly wouldn't have six chapters after the fall of Sauron, the Lord of the Rings (who as a titular character has no direct line in the book, I believe). It is just all very special, and very lucky, very luck for us to have it.\n\nEdited September 11, 2013 by lleimmoen"}]}