{"url":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/","title":"game variability - intentional difficulty scaling?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=856575","commentId":856575,"userName":"richsabre","timestamp":1378212251,"content":"after reading another player's topic today on how easy assault on osgilliath can be by picking certain locations (which i agree with) it makes me think that in addition to nightmare and easy mode, ffg are perhaps putting these choices in to make a quest have an inbuilt difficulty scale, where one can choose how hard they want to make it for themselves\n\n \n\nthis probably seems obvious when you think about it, however whether this is intentional or not is perhaps harder to decide.\n\n \n\nfor instance if the osgilliath choices were just meant to offer replayability and customisation, why have such extremes in potential choice?\n\n \n\nat one end you have the choices such as hardarim phalanx and the locations which can be manipulated to be explored in 1 turn, and at the other end you have tougher enemies and immune locations\n\n \n\nthis makes me think that ffg are perhaps pushing for more choices within quests that allows players to scale their quests to thier liking....so when someone says a quest is too easy, then perhaps this is just one end of the scale, it can of course be made more difficult by choosing more difficult\n\n \n\n....so is this a good thing? well, partly i think its a great idea (if im correct of course) as it allows players to scale their quests\n\n \n\nhowever i also think it is 1. not needed due to easy mode coming and 2. it perhaps makes many players feel like they should pick the easiest option as that is the best way to win a quest, which is the play style for many players\n\n \n\nthoughts?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=856594","commentId":856594,"userName":"leptokurt","timestamp":1378213977,"content":"I agree that this might be an intention of the designers. However, we already know that they're doing a lot of stuff to support the different spheres, and I think the open setup of AoO is another step in that direction. The ibrary for example is a location that works fine with spirit while the Old Harbor can be explored even with a tactics deck. And Old Bridge cries for Leadership. BNo clue what West Gate is for, I think that one is simply poorly designed (at least I don't get the idea behind that card)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=856714","commentId":856714,"userName":"HeavyKaragh","timestamp":1378223938,"content":"Richsabre,\n\nYou may be looking this quest through a solo player point of view, where exploring the first Location quickly may put you a step ahead of the Encounter deck. But in multiplayer, selected Locations are less important, because more Locations will enter the Staging area before the selected ones are explored. To more players, easier is to get stuck (like in The Hills of Emyn Muil).\n\n \n\nAll this choices are better for solo players, to allow them more deckbuilding options.\n\n \n\n> No clue what West Gate is for, I think that one is simply poorly designed (at least I don't get the idea behind that card).\n\nYou can explore it on turn 1, and get one of the Locations you can't lose control of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=856753","commentId":856753,"userName":"richsabre","timestamp":1378226571,"content":"indeed that is true. i have played this both solo and 2 handed. both were enjoyable but i think the quest is more enjoyable 2 handed\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=856762","commentId":856762,"userName":"mr.thomasschmidt","timestamp":1378227107,"content":"I think it's is a great idea. First I couldn't understand why they would give a chance to make it that easy. But it make sense. This is how video games does it. \"thought it was too easy on normal mode? Then try out hard or expert!\" They can off cause make it even more difficoult or maybe easier (if that's possible) with the new modes. But in this way you can get both the easy mode and the difficult mode without paying extra for the PoD packs. I like this a lot :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nGreat thought Rich\n\nEdited September 3, 2013 by mr.thomasschmidt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=857309","commentId":857309,"userName":"GrandSpleen","timestamp":1378273972,"content":">  \n> \n> > No clue what West Gate is for, I think that one is simply poorly designed (at least I don't get the idea behind that card).\n> \n> You can explore it on turn 1, and get one of the Locations you can't lose control of.\n\n \n\nOr you could just view it as a card that is friendly to any card effect that places progress tokens on locations.  You can't put tokens on Osgiliath locations while they are in the staging area, but you can once they are the active location.  After questing, choose your active location, and explore it via Asfaloth, Legolas, or whatever, then you can make West Gate the new active location.  You probably end up with the same amount of threat in the staging area, but that's not the point of the card as I see it -- it just allows you to avoid \"wasting\" a valuable questing phase by ensuring that you still have an active location ready to receive progress tokens.\n\n \n\nedit: As for the topic at hand, I don't know if the difficulty scaling is intentional.  It is so strikingly apparent that it's hard to imagine that it is NOT intentional.  However, I don't think that kind of scaling will be received well by the community.  If you set up something official and call X \"Easy Mode\" and call Y \"Hard Mode,\" people will pay attention.  But if you give them an optional easier setup within the standard mode of play, people will just think that playing the difficult setup option is poor strategy.  It looks to me like how we sometimes hear people say \"Well, if you think a quest is too easy, just build a weaker player deck!\"  It's not a satisfying solution...\n\nEdited September 4, 2013 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=857333","commentId":857333,"userName":"Ellareth","timestamp":1378277576,"content":">  \n> \n> >  \n> > \n> > > No clue what West Gate is for, I think that one is simply poorly designed (at least I don't get the idea behind that card).\n> > \n> > You can explore it on turn 1, and get one of the Locations you can't lose control of.\n> \n>  \n> \n> Or you could just view it as a card that is friendly to any card effect that places progress tokens on locations.  You can't put tokens on Osgiliath locations while they are in the staging area, but you can once they are the active location.  After questing, choose your active location, and explore it via Asfaloth, Legolas, or whatever, then you can make West Gate the new active location.  You probably end up with the same amount of threat in the staging area, but that's not the point of the card as I see it -- it just allows you to avoid \"wasting\" a valuable questing phase by ensuring that you still have an active location ready to receive progress tokens.\n> \n>  \n> \n> edit: As for the topic at hand, I don't know if the difficulty scaling is intentional.  It is so strikingly apparent that it's hard to imagine that it is NOT intentional.  However, I don't think that kind of scaling will be received well by the community.  If you set up something official and call X \"Easy Mode\" and call Y \"Hard Mode,\" people will pay attention.  But if you give them an optional easier setup within the standard mode of play, people will just think that playing the difficult setup option is poor strategy.  It looks to me like how we sometimes hear people say \"Well, if you think a quest is too easy, just build a weaker player deck!\"  It's not a satisfying solution...\n> \n>  \n\n \n\n \n\nI don't get this at all.\n\nYou use West Gate's Action, you don't 'waste' progress tokens that would've been made, travel to the second location that was pulled into play because of West Gate's Action and explore that second location next turn...\n\nOR\n\nYou could've just not use the action, travel to West Gate normally then clear it next turn.\n\n \n\nOption #1 let's you explore two locations in 2 turns, but you would never had to explore that second location otherwise,\n\nOption #2 let's you explore one location in 2 turns, but does not give you an extra location.\n\n \n\nThey both seems pretty much same as both options clear West Gate (and consequence of West Gate's Action) in 2 turns, but first option now gives you additional Osgiliath Location to juggle if the game ends up dragging on for some reason.\n\n \n\nTell me how exploring one location a turn earlier just to get another location is more efficient than not exploring a location turn earlier and not having to deal with the replacement location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=857459","commentId":857459,"userName":"HeavyKaragh","timestamp":1378297825,"content":"> Tell me how exploring one location a turn earlier just to get another location is more efficient than not exploring a location turn earlier and not having to deal with the replacement location.\n\n \n\nI'm not saying is more efficient, but might be convenient (Ancient Mathom [http://www.lotrlcg.com/Card/Focus/1203]). Also it's Action can be usefull (Short Cut [http://www.lotrlcg.com/Card/Focus/1421],Thror's Map [http://www.lotrlcg.com/Card/Focus/1639]). Again, I'm talking of solo play.\n\nEdited September 4, 2013 by karagh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=857709","commentId":857709,"userName":"leptokurt","timestamp":1378318997,"content":"> Richsabre,\n> \n> You may be looking this quest through a solo player point of view, where exploring the first Location quickly may put you a step ahead of the Encounter deck. But in multiplayer, selected Locations are less important, because more Locations will enter the Staging area before the selected ones are explored. To more players, easier is to get stuck (like in The Hills of Emyn Muil).\n> \n>  \n> \n> All this choices are better for solo players, to allow them more deckbuilding options.\n> \n>  \n> \n> > No clue what West Gate is for, I think that one is simply poorly designed (at least I don't get the idea behind that card).\n> \n> You can explore it on turn 1, and get one of the Locations you can't lose control of.\n\nExactly: poor design!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89707-game-variability-intentional-difficulty-scaling/?do=findComment&comment=858088","commentId":858088,"userName":"GrandSpleen","timestamp":1378353921,"content":"I really haven't *used* West Gate in a game, I just see its (admittedly limited) potential.  But it's one of those things where the stars need to align before it'll be useful.  It is not a Quest Action, so you can use it anytime -- the way I imagined using it was after questing, before defeating enemies.  In games with more players, you can't really plan on just getting lucky and having no new locations come out during Staging, so one strategy could be to aggressively scour the deck and try to pull locations out yourself.  By the way, Out of the Wild is a card that doesn't see much play these days so far as I know, but has a nice little place in this scenario.\n\n \n\nFor West Gate to make any sense at all, you need: 1) builds that offer progress token abilities, like Asfaloth, Legolas, Gondolin Blade, etc, and 2) at least one other location in the staging area.  Without that other location, West Gate can't help you get \"ahead of the curve\" if you're trying to deplete the encounter deck of locations.\n\n \n\nscenario 1 - Finish questing phase.  Active location is cleared (1 location cleared).  Travel to location X (not West Gate).  Tap Asfaloth, use Legolas or Gondolin Blade, etc. to clear it (2 locations cleared).  Don't use West Gate's action.  Next turn, questing phase cannot net you a location.  Travel to West Gate normally afterward.  Clear with Asfaloth etc (3 locations cleared).  Net result there is 3 locations in 2 turns.\n\n \n\nscenario 2 - Finished questing.  Active location cleared (1).  Travel to location X (not West Gate).  Clear with Asfaloth etc (2).  Use West Gate's action.  Next turn, questing clears West Gate (3).  Travel to the location pulled out by West Gate.  Clear with Asfaloth etc (4).  Net result is 4 locations in 2 turns.\n\n \n\nscenario 3 - Finished questing.  Active location cleared (1).  Travel to West Gate normally.  Location X (not West Gate) stays in the staging area.  Clear West Gate with Asfaloth etc (2).  Next turn, questing progress tokens do nothing.  Travel to location X.  Clear with Asfaloth etc (3). Net result is 3 locations in 2 turns.\n\n \n\nIf there is NO other location in the staging area, West Gate doesn't offer a net gain for its ability and, as Ellareth pointed out, just replaces itself with another location with no apparent benefit.  And it totally won't work for you unless you can plunk down 2 to 5 progress tokens on the active location reliably outside of the questing phase."}]}