{"url":"https://community.fantasyflightgames.com/topic/89767-those-moments/","title":"Those moments...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/89767-those-moments/?do=findComment&comment=857272","commentId":857272,"userName":"GrandSpleen","timestamp":1378271169,"content":"Those moments...\n\n \n\nTonight, playing Return to Mirkwood 2-player with kind of a bad player deck on my end of the table.  Feeling the hurt, but we're on 4B with more than enough progress on the quest card to win.  All we need to do is clear the last 2 enemies.  Threat at 40 and 43.  \n\n \n\nBeregond defends against a wounded Attercop, Attercop and clears him off the table via Spear of the Citadel.  One left.  It's unwounded.  We'll need 10 attack power to take it down.\n\n \n\nReady characters on my end are Ithilien Tracker, Erebor Hammersmith, Aragorn, Denethor (hero).  Glorfindel with a Rivendell Bow on my partner's end.  Total of 9 attack power.  We think and think, but there is nothing to add that single attack power to make the difference between victory and possible defeat to a treachery effect on the following round.\n\n \n\n\"Did you have a ranged ally in your deck?\" I ask my partner.  Yeah, there are 2 copies of Silverlode Archer in there.  \n\n \n\nElrond is ready.  With Vilya.  He also is saddled with Caught in a Web, so using him means he won't be available next round.  We take the gamble.... and Silverlode Archer comes out.  Victory.\n\n \n\nWhat are your 'miracle play' moments?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89767-those-moments/?do=findComment&comment=857295","commentId":857295,"userName":"Gizlivadi","timestamp":1378272837,"content":"That's nice. I can't remember one of mine with so much detail, but much like in the books, they often involve Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/89767-those-moments/?do=findComment&comment=857311","commentId":857311,"userName":"Nerdmeister","timestamp":1378274236,"content":"Massing at Osgilliath:\n\nMy partner and I had tried this PoD scenario about 5-6 times with no success (first time was with 4 players; our mistake quickly became apparent).\n\nMy partner played spirit with Eówyn and generally alot of questing.\n\nI played leadership with a bit of tactics.\n\nAt the last phase of the game we hadn´t been able to get rid of th Witch-King and the threat was starting to climb high as well as locations in the staging area and enemies at our play areas. At this point it´s pretty apparent that if we do not make it in the quest-phase, we will loose the game on the finishing line. So we throw everything at the quest. Litterally all on both sides including those characters that usually don´t make sense sending on quest and the kitchen sink. We stage... we tally... 6 willpower short of complete success. Tears were involved at this point untill it dawned on us (we had been too busy tallying): We hadn´t used Eówyns discard for willpower yet or the, at the time un-errataed, Protector of Lorien. Quick tally of cards in hand: JUST enough to make it. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nCost to quest like hell: all characters\n\nCost for final boost: all remaining cards in hand\n\nGiving the Witch-King the finger while laughing in his face and riding into the white city: priceless\n\nEdited September 4, 2013 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89767-those-moments/?do=findComment&comment=858222","commentId":858222,"userName":"mr.thomasschmidt","timestamp":1378374950,"content":"Copy paste from my thread \"Most epic win\"\n\nI don't know if it's all that epic but it was sure nice when it happened. Just played Conflict at the Carrock. I was up against the last unique trolls and when I attacked him I turned out 1 attack point short of killing him and win the game. Oh well, turns over and I hope to draw an ally to block with. And not only do I draw an ally, but I draw Gondorian Spearman. All I had to do was play him, quest successfully and then declare him as a defender. BAM!!! One damage to Louis and I won the game not epic but sertanly one I'll remember :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89767-those-moments/?do=findComment&comment=859002","commentId":859002,"userName":"Rainelotr","timestamp":1378434173,"content":"So I hardly think this counts but still... we were playing Journey down the anduin and my friend had dain and gimli while I played a mono tactics deck. He played the errand rider, passed me a resource, I played citadel plate on Gimli, he took the Hill troll undefended, played khazad khazad and Gimli headbutted the hill troll into the dirt on the first turn. May not have been epic ending but still... one of those perfect moments"},{"commentUrl":"https://community.fantasyflightgames.com/topic/89767-those-moments/?do=findComment&comment=859005","commentId":859005,"userName":"GrandSpleen","timestamp":1378434314,"content":"> So I hardly think this counts but still... we were playing Journey down the anduin and my friend had dain and gimli while I played a mono tactics deck. He played the errand rider, passed me a resource, I played citadel plate on Gimli, he took the Hill troll undefended, played khazad khazad and Gimli headbutted the hill troll into the dirt on the first turn. May not have been epic ending but still... one of those perfect moments\n\n \n\nAnd that's why I love tactics."}]}