{"url":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/","title":"New To Card Games","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=860734","commentId":860734,"userName":"Trumpet","timestamp":1378659713,"content":"Right I've only played MTG on xbox etc but fancy getting a card game I can play solo,this seems to fit the bill.Can I just get the core set and away I go or do I need the expansions the only one that appeals to me is the black riders as its part of the saga,when this is released can that be played with just the core.How easy is it to learn and how much time do you have to put in to understand the game fully.I read that some quests in the core set are difficult without expansions.As I've never played a real card game I would like as much info as possible.I have read the many threads on here but I just need more before I jump in\n\nCheers in advance\n\nTrumpet"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=860743","commentId":860743,"userName":"GrandSpleen","timestamp":1378660553,"content":"Hiya and welcome!\n\n \n\nYou can just get the core set and have at it for starters, or if you are quite interested in the Black Riders expansions, you can get that too.  It can be played with only the core set.  However, as that expansion has not been released yet, I can't comment on its difficulty.  It is very true that some quests are hard unless you have built up your card pool with many expansions.  There are three quests in the core set, and even two of those are quite difficult with just the cards that come with the core set.\n\n \n\nIf you have never played card games before, you might expect a bit of a learning curve.  You've played MTG, but if you play it as a video game, a lot of the rules are automated.  Still, you'll be familiar with some of the concepts, like 'tapping' cards (turning them sideways to indicate that they have been used), which also exists in LotR LCG but is referred to as 'exhausting' a card.  This was my first card game also, and it took me a couple of weeks of playing 3-4 times per week until I was pretty comfortable with the rules.  \n\n \n\nI'd also recommend the two Hobbit saga expansions, as they have some of my favorite quests!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=860745","commentId":860745,"userName":"Trumpet","timestamp":1378660947,"content":"Thanks for a quick reply,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=860802","commentId":860802,"userName":"John85","timestamp":1378669566,"content":"> Thanks for a quick reply,\n\nIf you end up enjoying the core set and would like to get expansions (and don't want to get them all, in which case I'd recommend going in order), I'd recommend the guide at \"Tales from the Cards\" (here: http://talesfromthecards.wordpress.com/2012/12/17/new-player-buying-guide/ [http://talesfromthecards.wordpress.com/2012/12/17/new-player-buying-guide/] ) which gives a rather comprehensive evaluation of the contents and benefits of each pack (although you will of course receive some spoilers of old content, since it is being reviewed)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=860826","commentId":860826,"userName":"Rainelotr","timestamp":1378672198,"content":"Some of the most powerful cards in the game come in the core set so don't get discouraged."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=860878","commentId":860878,"userName":"Karlson","timestamp":1378679769,"content":"I was in your shoes just two months ago, and since that time, I've collected every quest and expansion pack created for this game to date (which roughly means I love this game!)  I know it can be very daunting to get into the game from scratch, but learning all the rules and powers/synergies of each card is really just another component that adds to the enjoyment of this game.  \n\nAs far as only grabbing the core set (and possibly the Black Riders expansion,) I'd say it's definitely possible to do so and still have a blast with the game.  I always thought (and still do) that some of the core set quests were on the more difficult side, though, so don't be discouraged when a hill troll smashes your face in!  \n\nConcerning the Black Riders expansion, here's a recent video of one of the game's main developers talking about how he specifically designed this new expansion to cater to both brand new gamers and veterans alike. <\n\n\n>\n\n \n\nGood luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=860883","commentId":860883,"userName":"Raven1015","timestamp":1378680746,"content":"One thing I will comment on from playing the Black Riders expansion is that it is pretty difficult, even for experienced players. HOWEVER, there is the benefit of Easy Mode now, which can give you a better experience, and you can work your way up to standard mode. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=861106","commentId":861106,"userName":"Trumpet","timestamp":1378712324,"content":"Thanks for all the great advice , one thing for sure there are some great helpfull people playing this game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=861222","commentId":861222,"userName":"iznax","timestamp":1378728290,"content":"You are very lucky that LOTR is your first card game mainly for 3 reasons. 1st this is a great game, a great Middle Earth game (maybe the best), a great co-op game and a great card game with much depth, 2nd since it is a co-op game the community is very friendly and helpful and 3rd it is a LCG and not a TCG/CCG and this means that you don't have to sell your liver to have a full collection :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] .\n\n \n\nIn order to find the cards (Heroes etc) you like to build your first deck you can visit this site,  http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler]\n\n \n\nWelcome and Have Fun !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=861850","commentId":861850,"userName":"Pharmboys2013","timestamp":1378779550,"content":"Welcome to the forums trumpet. Digging your avatar. I love me some gears"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=861852","commentId":861852,"userName":"GrandSpleen","timestamp":1378779610,"content":"> 2nd since it is a co-op game the community is very friendly and helpful and 3rd it is a LCG and not a TCG/CCG and this means that you don't have to sell your liver to have a full collection :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] .\n> \n>  \n\n \n\nI sold my spleen to complete my collection, and I still don't own any of the PoD stuff.\n\n \n\nAlso, I'm not very friendly.  Graaa!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=862024","commentId":862024,"userName":"Trumpet","timestamp":1378807433,"content":"> Welcome to the forums trumpet. Digging your avatar. I love me some gears\n\nI must say I do like a bit of Gears (Board Game and Video)but I settled for the locust because my original avatar Tie fighter(love Xwing) had vanished but I have got it back now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=862933","commentId":862933,"userName":"Trumpet","timestamp":1378887938,"content":"Should be turning up today so once I've read the rules 3 times and had a few playthroughs I will let you know how I got on unless I have difficulties and I post sooner\n\nEdited September 11, 2013 by Trumpet"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=863527","commentId":863527,"userName":"Migwald","timestamp":1378928682,"content":"Welcome Trumpet.\n\nLike you, this was my first card game and being a Tolkien addict I gave it go last year and once I got to grips with the rules I soon became a convert. But be prepared to lose plenty of games and check the forums for hints and tips on how to beat each scenario, they each have different approaches. I hope you love the game as much as I do and you'll soon be buying the Adventure packs to expand your card options :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEnjoy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=863564","commentId":863564,"userName":"Bullroarer Took","timestamp":1378930049,"content":"Trumpet, in case you haven't come across this advice before:  do NOT try the core set adventures with mono-tactics unless you like to lose.  Red Deck does not Win.\n\n \n\nI recommend starting with Spirit.  Welcome and good luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=865121","commentId":865121,"userName":"iznax","timestamp":1379066138,"content":">  \n> \n> I sold my spleen to complete my collection, and I still don't own any of the PoD stuff.\n> \n>  \n> \n> Also, I'm not very friendly.  Graaa!\n> \n>  \n\n \n\nYou sold you spleen for 300 bucks ? Dude you got ripped off :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=865357","commentId":865357,"userName":"GrandSpleen","timestamp":1379083692,"content":">  \n> \n> >  \n> > \n> > I sold my spleen to complete my collection, and I still don't own any of the PoD stuff.\n> > \n> >  \n> > \n> > Also, I'm not very friendly.  Graaa!\n> > \n> >  \n> \n>  \n> \n> You sold you spleen for 300 bucks ? Dude you got ripped off :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n>  \n\n \n\nMeh, you can live without one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=866183","commentId":866183,"userName":"Trumpet","timestamp":1379168837,"content":"Right I played my first game today and to no surprise got beaten, I dont know how long I played for but it probably was something getting near 2 hours.I thought I was doing well at first ihad 6 progress tokens on the first quest card passage through mirkwood but then a spider named Ungoliant got involved and messed things up a bit I thought I had the better of him when I got the big man Beorn but it still left one hit point and by then another pest had arrived called Hummerhorns well Thalin died and then I got the deal 5 damage which meant legolas went and poor Gimili had no chance with 2 forest spiders still I had fun and will now try again with a different tactic , I think I understand the rules but from my brief description if you sense I havent a clue please tell me.\n\nFor my first attempt at a real card game I enjoyed it even though I lost and was spending time refering back to the rules and forgetting little events etc .Just one question when the enemys are engaged after surviving when you engage them again in the next turn you still draw shadow cards I take it, in other words you dont only draw shadow cards when the enemy comes down from the staging area you draw them each turn they are still alive if that makes sense.\n\nMy threat at the end was 40 and the enemies in play were 2 forest spiders the massive spider Ungoliant and The insect thing Hummer horns I also had 3 locations in the staging area you might be able to tell what I was doing wrong.\n\nCheers and I will let you know of my next beating"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=866188","commentId":866188,"userName":"GrandSpleen","timestamp":1379169153,"content":"Sounds like you were playing the tactics sphere-- very hard to win solo with tactics alone.  Try spirit if you're sticking to one sphere only, or create a deck with two different spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=866211","commentId":866211,"userName":"Trumpet","timestamp":1379171274,"content":"> Sounds like you were playing the tactics sphere-- very hard to win solo with tactics alone.  Try spirit if you're sticking to one sphere only, or create a deck with two different spheres.\n\nYes I was ,\n\nIm going to try your advice and see what happens thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=866257","commentId":866257,"userName":"jormungandr","timestamp":1379176639,"content":"Hi trumpet,\n\n \n\nWelcome to LOTR and your first beating! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Sounds you played a good game with a difficult (if not impossible) matchup. I have been playing lotr since day one and I still get my head thumped more often than not. The community here is very friendly and FFG are keeping to find new ways to make the game fun for both old and new players. Good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=866618","commentId":866618,"userName":"Trumpet","timestamp":1379237602,"content":"> Sounds like you were playing the tactics sphere-- very hard to win solo with tactics alone.  Try spirit if you're sticking to one sphere only, or create a deck with two different spheres.\n\nTried spirit and won it was a smooth run through only a few damage points, I didnt relise there was 2 endings to this quest I mixed them and randomly picked one , I didnt have to face the massive spider this time either (did I play that right) also my threat level was much less I think still in the twenties.\n\nAlso the card wandering took if playing solo can you discard this card and get reduced threat as it says something like if you pass the card to player 2 reduce your threat and raise theres hoss it play solo.I did get gandalf this time aswell, all in all it just seemed easier, I will try some othe spheres and see how I get on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=866896","commentId":866896,"userName":"GrandSpleen","timestamp":1379269634,"content":"Wandering Took's ability can't be used in solo play.  And nice job on winning! You are correct in that you do not have to face Ungoliant's Spawn to win.  If the spider is in play, you do have to defeat it, but if it never enters play then you don't have to fight it (so long as you draw the right quest card on 3B).  \n\n \n\nJourney Down the Anduin is a whole different challenge.  Good luck with that one!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90013-new-to-card-games/?do=findComment&comment=867278","commentId":867278,"userName":"Trumpet","timestamp":1379328889,"content":"Yes I know tried it yesterday and the trolls are worse than that spider,I had the one to begin with and a few turns along another one came and I think the first one still had two hit points left nightmare,but enjoyed it."}]}