{"url":"https://community.fantasyflightgames.com/topic/90193-hobbits/","title":"Hobbits","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=863275","commentId":863275,"userName":"Khamul The Easterling","timestamp":1378915055,"content":"Do you think Amon Din is a must for Hobbit decks?  I'm going to get BR and am excited to make Hobbit decks, but was wondering if you think having ATS packs 3-6 (I have 1-2) are really necessary.  If they aren't I would be happy to skip the ATS cycle packs 3-6 until I find the money to buy them.  \n\n \n\nThanks "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=863293","commentId":863293,"userName":"Nickpes","timestamp":1378916127,"content":"Though never played a Hobbit deck yet ( I plan to) , I believe that yes. Small target can be a very strong card IMO if you have other events that let you see what is coming from the encounter deck, and also Hobbit sense can prove usefull.\n\n \n\nAnd there is Spirit Pippin\n\n \n\n \n\n \n\nYet again, there is no experience on Hobbit decks so ... \n\nEdited September 11, 2013 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=863366","commentId":863366,"userName":"koriakin97","timestamp":1378919773,"content":"In amon din there are pippin, small target and hobbit sense. Pippin is weak, his lore version is much stronger. Only merit is that he is spirit, what gives you many threat reducers, but so is fatty and frodo. I didn't manage to make good use of small target, as in one player game I was engaged with only one enemy, and he was easly killed with Gandalf or even Gildor. However, I wasn't playing hard-fight scenarios as battle of five armies. Hobbit sense is quite good, as it allows you to quest really heavly, or to cancel attack and then kill enemy with Gandalf.\n\nTo sum up, till BR it was must-have, but now it became good addition. With so many hobbits card you'll easly build many decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=863390","commentId":863390,"userName":"richsabre","timestamp":1378920641,"content":"i would say no- its not essential, black rider obviously is. useful yes, but essential no\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=863483","commentId":863483,"userName":"Rainelotr","timestamp":1378926183,"content":"Not essential at all. I can't remember which AP included fast hitch but go get it if you don't have it already"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=863853","commentId":863853,"userName":"Pharmboys2013","timestamp":1378945496,"content":"Not essential at all. Only good card is hobbit sense. Pippin is the worst and small target is generally too much of a gamble to be worth it. Plus the fact that you need to be engaged with two enemies for it somewhat goes against the hobbit theme"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864053","commentId":864053,"userName":"lleimmoen","timestamp":1378963693,"content":"Agree with the rest. You can clearly do without Small Target for Hobbit decks. Hobbit Sense seems very situational, for once you want to avoid many enemies, and when you actually get them, it is better to deal with them. And the Black Riders Hobbits seem to know how to do that quite well. Finally, Lore Pippin is the way to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864203","commentId":864203,"userName":"leptokurt","timestamp":1378988978,"content":"Small Target can be a great card, but it needs a lot of set up. Risk some Light has a beautiful synergy with that card. I usually played that combo when I faced one low threat enemy. I then engaged an additional high ATT enemy, played RsL to provide the hard hitter with the right shadow card. I let him kill the weak enemy and used Pippin's ability to send the remaiing enemy back to the staging area. Enemy dead, zero cost (secrecy!), 3 additional threat. To me that's a rather good deal.\n\n \n\nTo answer the question: Yes, I think if one wants to play Hobbit decks, he should have this adventure pack.\n\n \n\nEdit:\n\n \n\nAnd I just realized that Pippin's power is a response, so my plan doesn't work out quite as I planned. Grrrr...\n\nEdited September 12, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864236","commentId":864236,"userName":"Khamul The Easterling","timestamp":1378991363,"content":"hmm well many thanks people!  Helpful information.  \n\n \n\nI wonder what the player cards in the Saga LOTR #2 box will be focused on?  We shall see. \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864684","commentId":864684,"userName":"lleimmoen","timestamp":1379019729,"content":"> I wonder what the player cards in the Saga LOTR #2 box will be focused on?\n\nThis is a great question, worth of its own thread -- but I am sure that will come in due time. I really want it to bring more Elvish stuff, but I am also expecting the Fellowship to appear, quite simple really: Legolas, Gimli, Aragorn, Boromir - even if that means third versions for half of them and second for the rest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864724","commentId":864724,"userName":"Bullroarer Took","timestamp":1379021908,"content":"As a solo player I really want to see Ally versions of the Fellowship."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864728","commentId":864728,"userName":"richsabre","timestamp":1379022105,"content":"i want to see lots and lots and lots of dwarves hahaha\n\n \n\nno, i sort of do- my love for dwarves is ever lasting, though of course we already have dealt with balin's ill fated expedition\n\n \n\nso i think elves is probably the way to go. even though silvan seems probable, i would actually prefer noldor- lots of rivendell based player cards\n\n \n\nfinally i would also like to see ally version of the fellowship and think this again is likely"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864733","commentId":864733,"userName":"Samwise Gamgee","timestamp":1379022282,"content":"> As a solo player I really want to see Ally versions of the Fellowship.\n\n \n\nSecond!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864776","commentId":864776,"userName":"chuckles","timestamp":1379024963,"content":">  \n> \n> > I wonder what the player cards in the Saga LOTR #2 box will be focused on?\n> \n> This is a great question, worth of its own thread -- but I am sure that will come in due time. I really want it to bring more Elvish stuff, but I am also expecting the Fellowship to appear, quite simple really: Legolas, Gimli, Aragorn, Boromir - even if that means third versions for half of them and second for the rest.\n\n \nYes I agree its a good question.\n \nPersonally I'd be happy to see new versions of Legolas, Gimli, Aragorn, Boromir though considering the interview with Caleb Grace (http://community.fantasyflightgames.com/index.php?/topic/89496-br-unboxing-with-caleb-grace/ [https://community.fantasyflightgames.com/index.php?/topic/89496-br-unboxing-with-caleb-grace/]) where he explains why there wasn't a strider in the first box i'm not sure he would in the second...\n \nThey could release the Core hero's of the fellowship as Allies... like the Dwarfs and I guess that any of the following are potential saga hero's too; Glorfindel, Elrond, Arwen,  Erestor, Glóin, Bilbo & Gandalf... Gwaihir would awesome.\nEdited September 12, 2013 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864778","commentId":864778,"userName":"Karlson","timestamp":1379025006,"content":">  \n> \n> > As a solo player I really want to see Ally versions of the Fellowship.\n> \n>  \n> \n> Second!\n> \n>  \n\nAnd I third this!   Even though I play two-handed solo, fellowship ally members would be really nice.\n\n \n\nDenethor was one of our first heroes in the core set, and he just got his ally card debut, so this could mean other heroes will soon be representative as allies.  I'd really like to have the three hunters (Aragorn, Legolas, and Gimli) because they are pivotal LotR characters that simply never see hardly any playtime for me because I choose other heroes.\n\n \n\nEven though these hero-turned-ally cards wouldn't be as popular in 4-player quests (because they would limit the available hero pool to play as) I still really hope they are made for all the solo players.  And this is really bordering on an altogether different topic, but I actually believe I enjoy playing this game solo rather than with other people.  Now that may be because I've only ever played with other people that were pretty unfamiliar with the rules (so I had to manage a lot of what they did) but even so, I really just like playing on my own and not having to constantly be asking the other player(s) what responsibilities they'll handle for each round and stuff like that.\n\nOkay, that's the end of my digression!  \n\nEdited September 12, 2013 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864780","commentId":864780,"userName":"Karlson","timestamp":1379025206,"content":">  \n> \n> Back to Legolas, Gimli, Aragorn, Boromir what sphere's do you think they would they be? I'd like a Lore Legolas and a Spirit Aragorn..  but how would work for a third Boromir, and I don't really see Gimli as anything other than tactics, maybe leadership. \n> \n>  \n\n \n\nI think these allies would work great in the form of a neutral sphere like Gandalf and Radagast.  That way, any and all deck types could include them if they wished to.  I know a lot of people may be opposed to an increase in neutral allies (as they kind of take away from the distinctiveness of each sphere) but I think in the case of fellowship members, it might be a good approach.  \n\nEdited September 12, 2013 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90193-hobbits/?do=findComment&comment=864804","commentId":864804,"userName":"chuckles","timestamp":1379026451,"content":">  \n> \n> >  \n> > \n> > Back to Legolas, Gimli, Aragorn, Boromir what sphere's do you think they would they be? I'd like a Lore Legolas and a Spirit Aragorn..  but how would work for a third Boromir, and I don't really see Gimli as anything other than tactics, maybe leadership. \n> > \n> >  \n> \n>  \n> \n> I think these allies would work great in the form of a neutral sphere like Gandalf and Radagast.  That way, any and all deck types could include them if they wished to.  I know a lot of people may be opposed to an increase in neutral allies (as they kind of take away from the distinctiveness of each sphere) but I think in the case of fellowship members, it might be a good approach.  \n> \n>  \n\n \n\nHmmm... not sure... I like that this would make them easy to include them in numerous decks... (especially once I have the the black riders, as i'm planning to replay most of the quests as hobbits and being able to include my favorite characters as allies would be cool!)\n\n \n\nI'm not really too worried about the sphere distinctiveness - however I am concerned that neutral/nothing sphere gets treated differently and therefore could make them either more challenging or less appealing to use.\n\nEdited September 12, 2013 by chuckles"}]}