{"url":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/","title":"Impassable Bog","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865426","commentId":865426,"userName":"Khamul The Easterling","timestamp":1379088606,"content":"This is pretty much just a waste of a card IMO.  You reveal it and it might do something or not but then it just sits with 1 threat and 12 progress so you obviously don't want to travel there thus it sits in the staging area the whole game doing nothing.  I think it should read:\n\n \n\n \n\n \n\nWhen Revealed: Place 1 resource token on Gollum for each location in the staging area.\n\n \n\nWhile this location is in the staging area in gains:\n\nForced: Place 1 resource token on Gollum at the end of each round.\n\n \n\n \n\nThen it would make you want to travel to the 12 progress location thus making it a more interesting card rather than a location that just sits there the whole game.  \n\n \n\nWhat do you think?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865467","commentId":865467,"userName":"richsabre","timestamp":1379091140,"content":"remember cards have two functions here though- standard and escape. this card has escape 2 so does have value in the pack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865474","commentId":865474,"userName":"Khamul The Easterling","timestamp":1379091452,"content":"You saying my idea is stupid?  :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nYes but every single card in dead marshes has escape value.  When revealed its a cruddy card and i dont see why they make a big 12 progress when you obviously dont want to travel there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865498","commentId":865498,"userName":"richsabre","timestamp":1379092935,"content":"it is a weak card i agree...but it has to be remembered i think that this was a very early pack before most of the encounter manipulating cards, so test of will was the only way to deal with this.\n\n \n\nit was also before most of the progress placing cards - i remember that this was one of those quests you had to struggle with location overload when it came out. now it is of course much easier.\n\n \n\nso there is a risk that this will do some damage when it comes out and a risk you wont be able to cancel it, if you are playing with cards from that time.\n\n \n\nas for it sitting there, well it contributes to the locations which can means it will +1 resource token if another copy comes out.\n\n \n\nin short this is one of those cards designed to force you to deal with locations. personally i have never travelled to it, but i can see how it may cause damage\n\nEdited September 13, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865629","commentId":865629,"userName":"leptokurt","timestamp":1379100689,"content":"Yep, it's basically a +1 permanent threat card. And I am ok with that. Like Rich said, the encounter cards should balance with those player cards that have been published when the AP came out, and not  with those of later packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865819","commentId":865819,"userName":"Khamul The Easterling","timestamp":1379114034,"content":"Well even at the time it was released, it was nothing even close to bad.  but.....whatever. Never mind.\n\nEdited September 13, 2013 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865870","commentId":865870,"userName":"Rainelotr","timestamp":1379120260,"content":"Some locations are actually good to travel to. There are also encounter deck allies. It is ok if some of the encounter cards are just mildly bad or good instead of all being agonizing and difficult. Just the way the game is designed. Sure this card isn't terrible, but there is not really a reason it needs to be. The quests are rated at diff difficulties after all"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=865925","commentId":865925,"userName":"Bullroarer Took","timestamp":1379126351,"content":"I can't recall how many bogs there are in this encounter deck, but I remember running this quest and getting two in the staging area and getting really worried. (This was back when the quest came out and there was no Asfaloth to run rampant over annoying locations.). At the time it could choke the wrong deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=867729","commentId":867729,"userName":"Glaurung","timestamp":1379362456,"content":"to be honest locations idea in this game is still under develop. Travel phase should to be more interesting. There is no feel like you really travel somewhere (except couple of locations) and most of the times you dont need travel at all. I think there is lot of opportunity to make it better. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=867866","commentId":867866,"userName":"chuckles","timestamp":1379370263,"content":"> I can't recall how many bogs there are in this encounter deck, but I remember running this quest and getting two in the staging area and getting really worried. (This was back when the quest came out and there was no Asfaloth to run rampant over annoying locations.). At the time it could choke the wrong deck.\n\n \n\nThis is how I remember these locations too.\n\n \n\nThere are four of them and having two or three in the staging wasn't much fun. Especially as I used to think/play that you HAD to travel to locations if you could... so I would travel to them were the only location(s) in the staging area.\n\n \n\n(I haven't played this quest since the Dwarfs became a super power, Outlands horded and a couple of Elven Lords showed up with their toys).\n\n \n\nThese locations would be great target for a nightmare version"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=869193","commentId":869193,"userName":"sparrowpisuke","timestamp":1379507485,"content":"If I remember correctly, there are three copies of this card in the encounter deck...\n\nEvery location in the staging area will penalize with Gollum's tokens if another copy is revealed...\n\n \n\nBut, yes... it's not a hardcore card...\n\n \n\nAnd before the new scoring rules, 7 victory points should be a great incentive to travel...\n\nEdited September 18, 2013 by sparrowpisuke"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90327-impassable-bog/?do=findComment&comment=869861","commentId":869861,"userName":"Pharmboys2013","timestamp":1379558106,"content":"7 victory points is still a good bit.  worth traveling to if you're already questing for massive amounts of dwarves, outlands, etc.\n\n \n\n...but otherwise quite pointless\n\nEdited September 19, 2013 by Pharmboys2013"}]}