{"url":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/","title":"Expansions and Adventure packs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866639","commentId":866639,"userName":"Trumpet","timestamp":1379240205,"content":"Now as discussed in another thread im new to all this but from the start I have liked the look of The Black Riders, ive played a couple of core set quests and I like it and as always with a new game I start looking at expansions.\n\nIve read different discussions on what to get next etc and theres loads of different answers so I presume its a personal thing but I would like some advice please.\n\nI like the combat and travel elements in the core quests so more of the same would be good but obviously value for money aswell.Like I said the black riders appeals because of the saga but do I need more other than the core ie would I need the 2 hobbit sagas, khazad dum appeals again because the setting and I pressume combat would be fierce which I like but I dont want it to be impossible to win with just the core set.An then theres the Mirkwood adventure packs for some reason they dont have the same appeal but if i need them i would purchase though to buy all of them would be £60 which would give me 6 quests, though I could get the khazad and riders expansions for the same price.\n\nIm always the same when I like a game I always expand it just to get a little more variety.\n\nAny advice much appreciated and sorry for another new to the game sort of post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866662","commentId":866662,"userName":"iznax","timestamp":1379244623,"content":"When i started this game my first goal was to build my first ''real'' deck (since the 4 preconstructed decks in the core set are more like ''demo'' decks in a way) so i use cardgamedb a lot to find the heroes and cards that i will like to use to do that, however the typically correct way is to buy them per circle (core, mirkwood, khazad dum etc ) and during this process you can get the sagas and pods as a treat :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866672","commentId":866672,"userName":"joezim007","timestamp":1379246574,"content":"My opinion? Use a deck builder to build a deck that you really like, then try to cut the number of expansions required to build that deck to a minimum while still adhering to the spirit of that deck, then buy those expansions. A lot of the fun of this game is controlled more by the player cards than the quests I think, so let them be your guide."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866674","commentId":866674,"userName":"richsabre","timestamp":1379246815,"content":"this is a question often asked and as you say- its down to personal taste.\n\n \n\nhere are some key points though\n\n \n\n-for any cycle of 6 packs you need to buy the corresponding deluxe cycle to play them. e.g. dwarrowdelf needs khazad dum, against the shadow needs hiers of numenor. the exception to this is mirkwood cycle which needs only the core set to play and the saga packs which are stand alone (but need the core set)\n\n \n\n-i know you said mirkwood doesnt appeal, and you can of course skip it (you may have to if they're all sold out) but personally i would not- for 2 reasons\n\n \n\n1.you are missing out on some classic quests- you can really see the early game and how it 'grows' to its current state\n\n \n\nand\n\n \n\n2.you will be missing out on some key cards for deck build, specifically the song cards which are key to (but not needed) building multisphere decks.\n\n \n\n-i think that the highest (or newest if you think of it that way) packs you can go for from core set is khazad dum and the dwarrowdelf cycle. anything later than that will be just too hard. there is nothing stopping you from buying them- you could go and buy the hobbit or black rider saga straight from core, and you could buy hiers of numenor and the current cycle, but you just wont have the card pool to get the most out of it, and i can see you having a frustrating time\n\n \n\nfinally, on the combat/travel thing. i would stay away from the assumption that the theme of an area = certain type of quests. this is not (it appears) the case. that doesn't mean that the theme is off, becuase it isnt- khazad dum is crawling with goblins....hordes of them. but the designers have a balance that they seem to keep to.\n\n \n\nfor example you would think the gondor cycle would be about grand armies and sieges....and some of the packs are exactly this. but there are also conspiracy packs and seeking out the enemy packs.\n\n \n\nthe same applies with the dwarrowdelf cycle. it is not all about dwarves and moria....indeed it is mostly about noldor!!! (at least the player cards....which is another topic in itself on how to buy packs)\n\n \n\ni hope this helps. as others have said check out one of the deck building sites to see which cards you want\n\nrich\n\nEdited September 15, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866695","commentId":866695,"userName":"booored","timestamp":1379248970,"content":"Just stick with the saga expantions. These will build up in time to a neat collection, are cheaper, easyer to find and have more choherant and thematic quests to play anyway.\n\n \n\nIf you still want more after Black Riders + its sister pack and the two hbbot ones already out. I would sugest that you get the mirkwood cycle as it has some really neat cards imo.\n\n \n\nThis game introduces new mechanisums each pack just for a single quest, while there are good cards across the entore pool you simply do not need them to beat quests with ease. Also a large % of the card pool are only usful for those quests... so if you get the entire collection you end up with a lot fo coasters.\n\n \n\nIf you get teh saga packs you have noce themed decks to pkay vs them as well as adding to the pool. I sugest that every player just get the sagas as a starting point, and if you are into it then just grab mirkwood, then Khaz+darowdelf then HoN..\n\nEdited September 15, 2013 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866697","commentId":866697,"userName":"Trumpet","timestamp":1379249264,"content":"So really I should get Mirkwood if I can,I can get Kazhad Dum and I should be alright with just the core and The sagas are a no no because I wouldn't have the cards to make it enjoyable , if I've understood right are there any essential cards from Mirkwood that would help me with Kazhad as some of The Mirkwood cycle seem difficult to find.\n\nThanks for the advice once again"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866699","commentId":866699,"userName":"booored","timestamp":1379249518,"content":"Plently.\n\n \n\nMirkwod has the songs, song fetches and Dain IronFoot (integral to dwalf decks), egals ... tons of stuff. All cycles have good cards, but I would say mirkwood has the hiest consentration of vital cards for solo players as the songs are so good for mana fixing. Also Dain is a must have, and also it has an entire deck type (just as shadow has outlands) this has egals.\n\n \n\nOnly problem is the powercreep in this game is off the charts insane, so these cards in mirkwood are not the same scale, stil the support cards are very good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866700","commentId":866700,"userName":"Trumpet","timestamp":1379249751,"content":"> Just stick with the saga expantions. These will build up in time to a neat collection, are cheaper, easyer to find and have more choherant and thematic quests to play anyway.\n> \n>  \n> \n> If you still want more after Black Riders + its sister pack and the two hbbot ones already out. I would sugest that you get the mirkwood cycle as it has some really neat cards imo.\n> \n>  \n> \n> This game introduces new mechanisums each pack just for a single quest, while there are good cards across the entore pool you simply do not need them to beat quests with ease. Also a large % of the card pool are only usful for those quests... so if you get the entire collection you end up with a lot fo coasters.\n> \n>  \n> \n> If you get the saga packs you have noce themed decks to pkay vs them as well as adding to the pool. I sugest that every player just get the sagas as a starting point, and if you are into it then just grab mirkwood, then Khaz+darowdelf then HoN..\n\nSo your saying get the Saga's I can start with The black riders and get the rest later .\n\nI love the way each person has a different view on the game,like I said in my original post I suppose its a personal thing but I see from all the info that its best to start with Mirkwood then choose where to go from there be it expansions or saga so as Mirkwood is hard to find and costs £60 for the 6 I might go back to black riders or Kazhad what's your thoughts on that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866730","commentId":866730,"userName":"Khamul The Easterling","timestamp":1379252487,"content":"> A lot of the fun of this game is controlled more by the player cards than the quests I think, so let them be your guide.\n\nI personally don't agree with this.  I think that its maybe 50/50 but I like the quests more than the player cards.  That doesn't mean I don't like the player cards and deck building.  I really like it.  But I think most of the time that how much fun I have when playing this game is determined by how much I like the quest.  \n\n \n\nI would say buy the Mirkwood cycle.  It has a very wide variety of quests with none of them being even remotely similar.  Hard ones, easy ones, medium ones, fighting ones, questing ones, and super rush ones.  Plus very nice player cards.  With the cards from the Mirkwood cycle I'd say your pretty much set to move on to any of the quests/expansions that you don't have and you won't be in a world of pain.  After Mirkwood, I would buy one of these combinations:\n\n \n\n-Start buying all Saga expansions. (Great quests in Hobbit #2 and from what I hear also in Black Riders.  Very good player cards also but rather dwarf centered.)\n\n \n\n \n\n-Buy Khazad-Dum (KD), Watcher in the Water and Foundations of Stone. (Watcher in the Water and Foundations of Stone are the two packs with the strongest player cards of any expansion anywhere.  I don't think many will disagree about that. And as you may know, KD is required to buy any of the Dwarrowdelf packs.  So this buying option will not only give you two very fun quests (although I myself dont like Watcher in the water quest) but also amazing player cards and 2 of the best heroes in the game.  and yes KD does a have quest that is just made for fighting and nothing else :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Note - Watcher in the water and Foundations of stone are packs #3 and #5 in the Dwarrowdelf cycle so if you would like to get the packs in order because of the story you can, but in the dwarrowdelf there is very very little story that connects the packs so I dont think it would matter.  So I would get #3 and #5 in the dwarrowdelf and when you find the money, buy the rest. \n\n \n\n \n\nI would only go with those two buying options after you have gotten Mirkwood.  I just don't think that the other buying options would be the right way to go.  \n\n \n\n \n\nHope this helps, Feel free to ask any questions\n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866741","commentId":866741,"userName":"Trumpet","timestamp":1379253355,"content":"> > A lot of the fun of this game is controlled more by the player cards than the quests I think, so let them be your guide.\n> \n> I personally don't agree with this.  I think that its maybe 50/50 but I like the quests more than the player cards.  That doesn't mean I don't like the player cards and deck building.  I really like it.  But I think most of the time that how much fun I have when playing this game is determined by how much I like the quest.  \n> \n>  \n> \n> I would say buy the Mirkwood cycle.  It has a very wide variety of quests with none of them being even remotely similar.  Hard ones, easy ones, medium ones, fighting ones, questing ones, and super rush ones.  Plus very nice player cards.  With the cards from the Mirkwood cycle I'd say your pretty much set to move on to any of the quests/expansions that you don't have and you won't be in a world of pain.  After Mirkwood, I would buy one of these combinations:\n> \n>  \n> \n> -Start buying all Saga expansions. (Great quests in Hobbit #2 and from what I hear also in Black Riders.  Very good player cards also but rather dwarf centered.)\n> \n>  \n> \n>  \n> \n> -Buy Khazad-Dum (KD), Watcher in the Water and Foundations of Stone. (Watcher in the Water and Foundations of Stone are the two packs with the strongest player cards of any expansion anywhere.  I don't think many will disagree about that. And as you may know, KD is required to buy any of the Dwarrowdelf packs.  So this buying option will not only give you two very fun quests (although I myself dont like Watcher in the water quest) but also amazing player cards and 2 of the best heroes in the game.  and yes KD does a have quest that is just made for fighting and nothing else :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Note - Watcher in the water and Foundations of stone are packs #3 and #5 in the Dwarrowdelf cycle so if you would like to get the packs in order because of the story you can, but in the dwarrowdelf there is very very little story that connects the packs so I dont think it would matter.  So I would get #3 and #5 in the dwarrowdelf and when you find the money, buy the rest. \n> \n>  \n> \n>  \n> \n> I would only go with those two buying options after you have gotten Mirkwood.  I just don't think that the other buying options would be the right way to go.  \n> \n>  \n> \n>  \n> \n> Hope this helps, Feel free to ask any questions\n> \n>  \n> \n> Khamul\n\nCheers for that I think if I can find the Mirkwood cycle I get that failing that KD and 3 and 5 adventure packs"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866773","commentId":866773,"userName":"leptokurt","timestamp":1379256465,"content":"I don't know, but to me the most logical way to expand is to buy the sets in the order of when they were published. Most scenarios get way too easy if you buy them later, as your card pool is bigger than it is supposed to be. However, this could be avoided by not using \"future\" cards in these scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866794","commentId":866794,"userName":"richsabre","timestamp":1379258756,"content":"> I don't know, but to me the most logical way to expand is to buy the sets in the order of when they were published. Most scenarios get way too easy if you buy them later, as your card pool is bigger than it is supposed to be. However, this could be avoided by not using \"future\" cards in these scenarios.\n\ni agree- its the simplest and most enjoyable way. i also would urge you not to buy the saga expansions first, they are just too difficult. if you want a challenge then it should be fine, but your win ratio will be pretty bad, especially if you are new to card games\n\n \n\ni have seen several gamers appear here complaining about difficulty levels and how it has put them off the game, never to be seen again......this game, solo especially, has probably lost quite a few players over the 2 and half years\n\nEdited September 15, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866841","commentId":866841,"userName":"Djenni","timestamp":1379262904,"content":"Just get the Mirkwood cycle, it basically has everything you need. Plus the quests are just like what you described wanting more of. Just remember you can't use the adventure packs from the Against the Shadow or the Dwarrodelf cycle without first buying the HoN or Khazad Dum expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=866910","commentId":866910,"userName":"Karlson","timestamp":1379271742,"content":"I also agree that going in order is the most beneficial approach to your gaming experience.  I've searched around and I believe that Miniature Market has the best deals on the packs and expansions, so check them out if you haven't already.\n<http://www.miniaturemarket.com/catalogsearch/result/?q=lord+of+the+rings+lcg [http://www.miniaturemarket.com/catalogsearch/result/?q=lord+of+the+rings+lcg]>"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=867024","commentId":867024,"userName":"Rapier1","timestamp":1379281595,"content":"I went core > then KD (For a bigger player card pool) then I bought Mirkwood. I found KD to be doable but a huge challenge.\n\n \n\nI don't think you can go core > HoN and have any chance of beating the HoN quests.\n\nGenerally so far, the saga expansions are harder than other quests imo. So while they seem to be self-contained, I actually think they're a bad entry product."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90415-expansions-and-adventure-packs/?do=findComment&comment=868433","commentId":868433,"userName":"Trumpet","timestamp":1379434934,"content":"Right I've found a place in the uk that have the whole Mirkwood APs in stock so I'm thinking of just buying them in one go hopefully that should keep me busy for a while.thanks for all the advice hopefully I've avoided a costly mistake by not buying the sagas hobbits and black riders"}]}