{"url":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/","title":"What would you like to see in an elvish expansion?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868475","commentId":868475,"userName":"Olorin93","timestamp":1379437117,"content":"I can't be the only one hoping for an elf-themed expansion + cycle! If one is made, what do you think we'll see? What do you hope for? What scenarios, encounter cards, player cards...?\n\n \n\nI think another (and perhaps more battle-oriented) version of Elrond would be cool, maybe Leadership or Spirit. There has to be a reason Vilya is neutral! I would also like to see some Lothlorien cards like a Galadriel hero (and I think we could count on some serious Willpower there). \n\n \n\nWhat do you think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868487","commentId":868487,"userName":"Nickpes","timestamp":1379437701,"content":"Fingolfin !!!!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nThranduil, Galadriel offcourse and her husband\n\n \n\nOk, apart from this, I would like to see some allies , especially fighting ones, not unique. Elves where good warriors. \n\n \n\n \n\nI cannot think of any possible scenarios right now , during third age they where not so much energetic as in previous ages "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868494","commentId":868494,"userName":"richsabre","timestamp":1379438144,"content":"i am undecided if i would like any 1st age characters in an general 'elf' expansion, i think i would prefer them released in thier own saga expansion. this of course has been discussed before whether this is likely or not.\n\n \n\npersonally i would like more quests based around rivendell, the trollshaws and the lone lands, and also going into the misty mountains. i love those parts of the books.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868507","commentId":868507,"userName":"Nickpes","timestamp":1379438638,"content":"Rich I was kidding about Fingolfin - who is my favourite Tolkien hero - he is out of the game era  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868743","commentId":868743,"userName":"leptokurt","timestamp":1379450065,"content":"Bows.\n\n \n\nMore usefulness for ranged attacks in solo play.\n\n \n\nMore threat reduction.\n\n \n\nHerbs. Herbs that you can combine to get more powerful drugs, eh, medicine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868745","commentId":868745,"userName":"richsabre","timestamp":1379450110,"content":"> Rich I was kidding about Fingolfin - who is my favourite Tolkien hero - he is out of the game era  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\ni see- it is a good point to raise though. a vast well of elven lore and characters is in the first age.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868800","commentId":868800,"userName":"Djenni","timestamp":1379452954,"content":"Galadriel, she seriously is the one thing that i want most, more than any other card. I'd also like to see more Noldor/Silvan attachments like the Rivendell Blade and Rivendell Bow, maybe some elvish armor or cloaks? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868809","commentId":868809,"userName":"Gizlivadi","timestamp":1379453826,"content":"I'd like to see less \"fighting\" stuff like bows and swords (although I still like those) and more events and attachments that just feel elvish or that represent their mysterious and supernatural nature. Stuff like Light of Valinor, Children of the Sea, maybe a magic ring or some sort of artifact, an event related to the stars and the trees, a song or two... I really enjoy those kind of cards. I'm pretty sure we'll get a lot of that though.\n\nEdited September 17, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868814","commentId":868814,"userName":"legolas18","timestamp":1379454428,"content":"Yes, Galadriel, Celeborn, and Thranduil are all must-haves. And I would LOVE to see Rumil and Orophin make an appearance too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=868847","commentId":868847,"userName":"Karlson","timestamp":1379456893,"content":"I think one reason this game appeals to me is that there are so many different ways to play.  From scrying and threat control to all out brute force, you can really alter how you approach any given quest (though some quests require pretty specific deck building - I'm looking at you, Journey to Rhosgobel.)\n\n \n\nWith all that said, I personally would like to have Elves based more upon magical effects and enchantments.  Now, I know there's not a whole lot of outright magic in LotR, but when there is it usually involves the Istari or Elves.  There's already a handful of cards that are loosely based on magic such as Vilya and Light of Valinor, and I think these types of cards are great for making the Silvan and Noldor unique from other factions.  \n\n \n\nExpanding from that, some future Elvish player cards I would love to see would be magical event cards that do direct damage to enemies.  Something along those lines that immediately comes to mind is Elrond's enchantment of charging horses along the Fords of the Bruinen when the Nazgul pursuing Glorfindel and Frodo enjoy some ultimate white water rafting (rafts not included.)\n\n \n\nJust an idea.  Although, I'm also a sucker for weapon attachments and who doesn't like allies?  So those things could also be great components in an Elvish-based expansion.  But as far as something totally new, I'd like to see some Elvish battle enchantments.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=869013","commentId":869013,"userName":"Nickpes","timestamp":1379477168,"content":"Fords of bruinen yes .... Thats what i had in mind when I wrote about \"magic\" cards ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90541-what-would-you-like-to-see-in-an-elvish-expansion/?do=findComment&comment=869021","commentId":869021,"userName":"GrandSpleen","timestamp":1379478102,"content":"I'd like to see more Songs, and I don't mean cards that grant an additional resource icon.  I mean cards like Durin's Song -- boost stats, heal, or some other effect.  Build up the Song trait as a support trait.  Music is important to all the races of Middle-Earth, but the fantastic oral history traditions of the elves make them a perfect fit to develop this some more..."}]}