{"url":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/","title":"solo play: 1 vs 2 handed","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869035","commentId":869035,"userName":"sammann11","timestamp":1379480611,"content":"I know from many posts here that alot of you favor 2 handed solo play. I have always done this and for the first time tonight I tried just using \"1 player\"\n\n \n\nI only one once out of 3 times (Hunt for Gollum) but found it...well, refreshingly simple!\n\n \n\nAny thoughts on pros/cons to the differences in play style?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869069","commentId":869069,"userName":"richsabre","timestamp":1379485896,"content":"i have played solo 1-3 handed. i played this game pure 1 handed solo for the first 1.5 years.\n\n \n\ni didnt particularly want to go to 2 handed as i thought it would feel like 'playing the other person' which i had tried in other games and disliked\n\n \n\na friend persuaded me to try it and i loved it. it didnt feel like playing 2 people at all. it just felt like solo play with more cards and options. the ranged and sentinel sunddenly came to life and gave cards new meanings and whole new synergies were opened up\n\n \n\nis 2 handed better than 1? thats a tough question\n\n \n\n1 handed does feel purer and more natural though i think thats because i played the game that way from the start.\n\n \n\ni think neither is better than the other -they are just different\n\n \n\ni probably play 40/40/20 1,2 ands 3 handed.\n\n \n\n3 handed is fun but a little tiresome to set up so i play it less.\n\n \n\nas for difficulty level it depends where you are in the game. from core up to shadow and flame solo is harder than mulit. generally from hiers to present it is the other way round\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869091","commentId":869091,"userName":"MyNeighbourTrololo","timestamp":1379490284,"content":"I'll tell you what. One player games and multiplayer games are entirely different experiences."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869112","commentId":869112,"userName":"Nickpes","timestamp":1379493095,"content":"I play mostly one handed , I love it ... but two handed is also nice "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869120","commentId":869120,"userName":"richsabre","timestamp":1379495888,"content":"it also depends on the quest. some quests are completely lost on 1 handed (guldur, return to mirkwood, assault on osgilliath)\n\n \n\nthese quests have a lot more play factor multi handed\n\n \n\nothers of course are fine either way"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869313","commentId":869313,"userName":"joezim007","timestamp":1379516694,"content":"I love building two decks that work really well with one another, mostly because I never feel like I'm able to fit all the cards that i really want into a single deck. That's probably the biggest reason I've always played 2-handed. I've tried solo, and I just feel like there aren't enough characters to do everything that's needed, otherwise I'd like it more. If I can come up with some better solo decks, I might give it another shot though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869860","commentId":869860,"userName":"Pharmboys2013","timestamp":1379558050,"content":"I think playing 2 handed is more ideal and opens up a lot more possibilites in deck building, but a lot of the time i just cant bear the set up and just play 1 handed"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90575-solo-play-1-vs-2-handed/?do=findComment&comment=869939","commentId":869939,"userName":"Glowwyrm","timestamp":1379565802,"content":"Tales from the Cards has a good guide for anyone new to playing two-handed.\n\nhttp://talesfromthecards.wordpress.com/2013/02/06/a-guide-to-playing-two-handed/ [http://talesfromthecards.wordpress.com/2013/02/06/a-guide-to-playing-two-handed/]\n\nI started playing solo only, then I switched to two-handed.  Now it just depends on what kind of experience I want.  If I want to build decks that are specialized and good at their roles, I'll play two-handed.  If I want to build decks that can handle everything and are up for a challenge, I play solo.  Usually, I prefer two-handed, because it gives me an opportunity to try out a greater variety of cards and build unique decks."}]}