{"url":"https://community.fantasyflightgames.com/topic/90928-deck-staples/","title":"Deck Staples","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873660","commentId":873660,"userName":"Pharmboys2013","timestamp":1379974694,"content":"In other card games, (mostly competitve ones) there are always \"staples\" aka the cards that are going to be in every single deck you make no matter what.  These cards are usually auto-included for a variety of factors including cost, power, and application (aka theres never a game where they wont be useful).  \n\n \n\nI wanted to create a list by sphere of the staples for that sphere.  If a card is on the list, doesnt matter if i'm running 1 or 3 heroes matching that color, i'm still running that card in my deck.  \n\n \n\nPlease feel free to add or debate\n\n \n\nLeadership:\n\n \n\nSteward of Gondor - The most powerful resource generating card in the game.  Pays for itself the first turn you play it and has zero restrictions.  In fact aside from just the resources, adding the gondor trait can help influence other combos as well.  Probably the most obvious on this list.\n\n \n\nSneak Attack - On surface value its just ok, but with Gandalf its been the nicest combo since day 1.  At a cost of 1 its easily playable.  No reason not to run it plus Gandalf anytime leadership is being used.\n\n \n\nErrand Rider - Leadership has all the good chump blockers, Snowbourn Scout was the token redshirt for a long time but I think he'll be replaced by the new leadership ally in blood of gondor who I couldnt justify putting on this list since hes not out yet.  Errand Rider is just as cheap but can also help smooth out resources if using multiple spheres.  His 2 hp is a nice overlooked asset too.\n\n \n\nNotable Exceptions: Faramir (too costly if only 1 leadership hero), A Very Good Tale (unnecessary in decks that arent ally heavy)\n\n \n\n \n\nLore:\n\n \n\nWarden of Healing - with the start of archery damage on enemies, sometimes having a stud defender or chump blockers isnt the answer to all your issues.  He's cheap and can heal two targets.  Theres always a place for him in my decks.\n\n \n\nMaster of the Forge - I personally view attachments as the most powerful player cards in the game as there are very little encounter card effects that force you to get rid of them.  Being able to grab one potentially each turn is money.\n\n \n\nDaeron's Runes - Almost didn't include this because in mono-lore Mithrandir's Advice might be the card draw of choice, but it's zero cost  is still usually too good to ignore.\n\n \n\nRanger Spikes - For a cost of two, having an enemy ignore engagement checks and decreasing their threat value is ideal in almost every scenario.  Only times this isnt ideal is on enemies with archery or enemies that engage you on their own like Attercop Attercop.  Even then its not the end of the world cause they can be targeted with things like forest patrol\n\n \n\nNotable Exceptions- Ithilien Tracker and Secret Paths (both are great but not powerful enough to be in every lore deck), Asfaloth (Glorfindel only) and Burning Brand (super powerful but doesnt fit in every deck)\n\n \n\n \n\nSpirit:\n\n \n\nArwen - Two will power is good enough to justify play, but her ability just puts her over the top.  +1 Def and sentinel is just so great particularly in multiplayer\n\n \n\nImaldris Stargazer - Fixing draw order is great particularly for spirit which doesnt really have too many cards to help with card draw\n\n \n\nUnexpected Courage - Only costs two and permanently gives you an extra action each turn.  Can also be stacked.  One of the better attachments in the game.\n\n \n\nA Test of Will - the most reliable way of all important treachery cancellation.  Quite cheap as well.  Probably the most obvious card on this list along with steward of gondor.\n\n \n\nGaladrim's Greeting - kind of expensive but the payoff is worth it.  decreasing threat by 6 is the biggest decrease the game has outside of Strider's power.  Even in a deck with a single spirit hero its not a bad idea to save up for this card.\n\n \n\nDwarven Tomb - see the previous two items on this list...\n\n \n\nNotable exceptions: Bofur, Hasty Stroke, Elrond's Council (Noldor only)\n\n \n\n \n\nTactics:\n\n \n\nVassal of the Windlord - only costs 1 for a 3 attack which is on par with most heroes.  It is only for one turn but then the discard can be comboed with other things like horn of gondor, imrahil, and the soon to be released Eomer.  Always room for cheap 3 attack in my decks.\n\n \n\nDefender of Rammas - 4 defense is just too nice to pass up\n\n \n\nFeint - cheap and can be pivotal against big enemies.  always good to avoid having enemies attack if it can be helped.\n\n \n\nHorn of Gondor - this spheres only method of resource generation.  plus just gameplay wise there are usually a decent amount of characters leaving play.  only weakness is its a restricted attachment.\n\n \n\nNotable exceptions: Gondorian Spearman (really hard for me to leave out, but sometimes if i need to pick just one tactics defender ally i resort to the stability of the defender or rammas over the direct damage of the spearman), Foe-Hammer (useless if no weapons, but dagger of westernesse may change this as its a more universally usable weapon that what we currently have), Hands Upon the Bow (requires ranged).\n\n \n\n \n\nWhat do you guys think? any other cards you always include? Some from this list you dont?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873671","commentId":873671,"userName":"richsabre","timestamp":1379975456,"content":"i personally would take out foe hammer and have in goblin cleaver, though for me both are usually auto include in a tactics deck which for me = lots of weapons anyways.\n\n \n\nthere are just too many goblins in this game to ignore its 3 damage\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873809","commentId":873809,"userName":"joezim007","timestamp":1379990365,"content":"Gandalf. Either one. You pretty much NEED to have one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873825","commentId":873825,"userName":"Pharmboys2013","timestamp":1379993035,"content":"Oh man, how on earth did I forget Gandalf. Yes indeed the wizard has a place in every deck. In fact he's probably the most staple like card we have since he literally can be in every deck too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873830","commentId":873830,"userName":"GrandSpleen","timestamp":1379993927,"content":"I am pretty well stuck putting Ancient Mathom into any spirit deck that I make, for the reasons you mention-- not much other card draw to be had in that sphere.  It's more unwieldy and situational than other card draw options, but has a big share of the spirit market at present.\n\n \n\nHonorable mention to Miner of the Iron Hills for Condition discard, but more scenario-dependent and maybe not a staple in the way you are describing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873901","commentId":873901,"userName":"Glaurung","timestamp":1380008685,"content":"> Oh man, how on earth did I forget Gandalf. Yes indeed the wizard has a place in every deck. In fact he's probably the most staple like card we have since he literally can be in every deck too.\n\nFunny think i made a new deck with Faramir hero. Mostly to play solo. And guess what? This deck dont need a Gandalf at all!\n\nWas very surprise for me! First deck with out Gandalf in 2 years!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873926","commentId":873926,"userName":"richsabre","timestamp":1380014526,"content":"i agree with glaurung on this (wait....did i just step into an alternate reality?)......i really think the days on gandalf dominance ended long ago\n\n \n\nthis is of course card pool dependant but i rarely put him in my decks. thats not to say he doesnt have a huge part to play in this game- he does, and so he should.\n\n \n\nbut he does cost 5, and needs sneak attack to make it worth it ultimately taking up to 6 slots.\n\n \n\nin some decks this is fine. in others those 6 slots are just too good to waste, especially when his abilities can be had for cheaper. (though admitidly not all rolled into one card)\n\n \n\nit could probably be argued him having threat reduction, card draw and instant damage all into makes him worth all 6 slots, and i am tempted to take back me saying he isnt an instant include....but he really does need the sneak attacks to make him better than say galadrims greeting, or mithrandirs advice. this means getting either in your set up hand and waiting, waiting for both, or at the very best getting both in your set up hand\n\n \n\ni just find it smoother and simpler to have 3x mithrandirs advice, or other cheaper and longer usage card drawing mechanics, such as gleowine, runes or the leadership dwarven attatchment\n\nrich\n\nEdited September 24, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=873932","commentId":873932,"userName":"Glaurung","timestamp":1380015056,"content":"> i agree with glaurung on this (wait....did i just step into an alternate reality?)......i really think the days on gandalf dominance ended long ago\n> \n>  \n> \n> this is of course card pool dependant but i rarely put him in my decks. thats not to say he doesnt have a huge part to play in this game- he does, and so he should.\n> \n>  \n> \n> but he does cost 5, and needs sneak attack to make it worth it ultimately taking up to 6 slots.\n> \n>  \n> \n> in some decks this is fine. in others those 6 slots are just too good to waste, especially when his abilities can be had for cheaper. (though admitidly not all rolled into one card)\n> \n>  \n> \n> it could probably be argued him having threat reduction, card draw and instant damage all into makes him worth all 6 slots, and i am tempted to take back me saying he isnt an instant include....but he really does need the sneak attacks to make him better than say galadrims greeting, or mithrandirs advice. this means getting either in your set up hand and waiting, waiting for both, or at the very best getting both in your set up hand\n> \n>  \n> \n> i just find it smoother and simpler to have 3x mithrandirs advice, or other cheaper and longer usage card drawing mechanics, such as gleowine, runes or the leadership dwarven attatchment\n> \n> rich\n\nYes agree....but still if you play leadership Sneak Attack and Gandalf is must be in my opinion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874066","commentId":874066,"userName":"leptokurt","timestamp":1380029509,"content":"Hail of Stone for tactics - this cards gets stronger and stronger during the game and is able to eliminate nasty enemies while you're still in the questing phase.\n\n \n\nBofur for mono tactics - just because he is the cheapest 2 WP tactics ally\n\n \n\nRisk some Light for lore - useful in any deck, especially in crucial turns during late game\n\n \n\nErebor Hammersmith for lore - just because he gives you so much for little money\n\n \n\nI rarely have Master of the Forge and Imladris Stargazer in my decks. They're good to build certain synergies, but they're not a must have. Same goes for Vasall of the Windlord and Defender of Rammas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874116","commentId":874116,"userName":"Karlson","timestamp":1380033367,"content":"While playing the first quest of Black Riders last night, I found the OHaUH version of Gandalf to be vital in my low threat hobbit deck.  I could keep him around for at least 3 or 4 turns without going over 35 threat and alerting the Nazgul, and his added support really helped out with hide tests and questing.  \n\n \n\nSo, usually I always put the classic Gandalf in my decks, but the other version is absolutely amazing for a low threat deck.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874302","commentId":874302,"userName":"Migwald","timestamp":1380045865,"content":"Fili and Kili for their buy one get one free bonus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874366","commentId":874366,"userName":"Glowwyrm","timestamp":1380050985,"content":"A second vote for Gandalf the new.  I've found him to be indispensable in my decks against the Nightmare scenarios.  Drop him in late in the game and use him in the rush to the finish.  Being able to quest for 4 and attack/defend is great.  And, if I'm not running Leadership with sneak attack, I usually leave core Gandalf out of my decks.  Partly because I'm tired of relying on him, and partly because I can use those 5 resources for something that will last longer than a turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874579","commentId":874579,"userName":"hildargo","timestamp":1380067670,"content":"One card that hasn't been mentioned yet for Lore is Elf-Stone. I have yet to get my hands on The Black Riders, but this is a great card for Lore, putting any ally into play for 1 just for performing an action that you were going to do in the game anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874595","commentId":874595,"userName":"Karlson","timestamp":1380070089,"content":"> One card that hasn't been mentioned yet for Lore is Elf-Stone. I have yet to get my hands on The Black Riders, but this is a great card for Lore, putting any ally into play for 1 just for performing an action that you were going to do in the game anyway.\n\n \n\nAgreed.  I've only played the first Black Riders quest once so far and unfortunately Elf-Stone didn't turn up, but I'm super excited to use it when I do draw it.  Putting in the high cost allies like Gandalf, Haldir, and Gildor for just 1 resource will be really nice.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874609","commentId":874609,"userName":"Bullroarer Took","timestamp":1380072313,"content":"Shield of Gondor on the right hero can turn him into a wall. It might be the best card in the new cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874618","commentId":874618,"userName":"Tracker1","timestamp":1380073249,"content":"I think the dagger of Westernesse is going to make it on this list eventually, but i have not tried it out of a non hobbit deck yet. Too many restricted attachments to choose from. Tactics Boromir has to make some tough choices. The dagger and Shield might work pretty good for him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874652","commentId":874652,"userName":"Bullroarer Took","timestamp":1380077574,"content":"The shield works great on Boromir, but not sure about the dagger. His threat gets rather high..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=874808","commentId":874808,"userName":"Serazu","timestamp":1380097353,"content":">  \n> \n> > One card that hasn't been mentioned yet for Lore is Elf-Stone. I have yet to get my hands on The Black Riders, but this is a great card for Lore, putting any ally into play for 1 just for performing an action that you were going to do in the game anyway.\n> \n>  \n> \n> Agreed.  I've only played the first Black Riders quest once so far and unfortunately Elf-Stone didn't turn up, but I'm super excited to use it when I do draw it.  Putting in the high cost allies like Gandalf, Haldir, and Gildor for just 1 resource will be really nice.  \n> \n>  \n\n \n\nLooks promising to be sure. The question is though, how many copies in a deck? Not more than 2 I believe; 3 would be excessive. Only few allies in any given deck are expensive (Gandalf, Gildor and Northern Tracker in my Spirit/Lore deck cost 4+ plus Beorn and Faramir, when I use Elrond) and I wouldn't use the Stone to pay for 3-cost allies, unless I was absolutely desperate. For a cost less than 3, the Stone is out of the question, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=875097","commentId":875097,"userName":"Morithain","timestamp":1380131254,"content":"For secrecy decks:  Resourceful!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=885833","commentId":885833,"userName":"Mr Coffee","timestamp":1381420748,"content":"> i personally would take out foe hammer and have in goblin cleaver, though for me both are usually auto include in a tactics deck which for me = lots of weapons anyways.\n> \n>  \n> \n> there are just too many goblins in this game to ignore its 3 damage\n> \n> rich\n\nFunny, I have yet to use that card... lol.  NOT because it's not good, it is.  I guess I just haven't really played many of the goblin-centric encounters lately... \n\n \n\nI think that's what I do love about this game.  As much as we want to ***** and complain that not EVERY encounter AP has been the \"MOST AMAZING THING EVER\", they still have managed to provide enough variety in them (and throughout the game in general), even at this relatively early stage of the game (compared to say, GoT, which has a MUCH larger catalogue of cards and time under its belt), that there really is no \"right\" way to build a deck now.  Or from an encounter angle, the variety of challenges is just enough to make it so that you really do have to build or alter your decks to face certain encounters.\n\nI know, I know, there are gods playing this game **cough**glaurung**cough**  that can beat (and HAS) every encounter in the game.  On the first try.  With the exact same deck.  With only 20 player cards.  And 4 toothpicks.  While blindfolded.  Walking across a hot bed of coals.  Juggling chainsaws.....  (And that's just for the site 1 setup conditions!)\n\n \n\nBuuuuuuut..... for the rest of us, we are probably going to be finding ourselves swapping cards in and out of our decks to \"fit\" whatever encounter we are going up against.  Rich mentions that he loves Goblin-Cleaver as a top card.  I haven't even played it yet... lol.  Does that make it a good or bad card?  Neither (well, it IS a good card), it really just means that for all our whining as players, the design team is ACTUALLY doing a decent job of building this game with real OPTIONS."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90928-deck-staples/?do=findComment&comment=886408","commentId":886408,"userName":"Glaurung","timestamp":1381480232,"content":">  \n> \n> > i personally would take out foe hammer and have in goblin cleaver, though for me both are usually auto include in a tactics deck which for me = lots of weapons anyways.\n> > \n> >  \n> > \n> > there are just too many goblins in this game to ignore its 3 damage\n> > \n> > rich\n> \n> Funny, I have yet to use that card... lol.  NOT because it's not good, it is.  I guess I just haven't really played many of the goblin-centric encounters lately... \n> \n>  \n> \n> I think that's what I do love about this game.  As much as we want to ***** and complain that not EVERY encounter AP has been the \"MOST AMAZING THING EVER\", they still have managed to provide enough variety in them (and throughout the game in general), even at this relatively early stage of the game (compared to say, GoT, which has a MUCH larger catalogue of cards and time under its belt), that there really is no \"right\" way to build a deck now.  Or from an encounter angle, the variety of challenges is just enough to make it so that you really do have to build or alter your decks to face certain encounters.\n> \n> I know, I know, there are gods playing this game **cough**glaurung**cough**  that can beat (and HAS) every encounter in the game.  On the first try.  With the exact same deck.  With only 20 player cards.  And 4 toothpicks.  While blindfolded.  Walking across a hot bed of coals.  Juggling chainsaws.....  (And that's just for the site 1 setup conditions!)\n> \n>  \n> \n> Buuuuuuut..... for the rest of us, we are probably going to be finding ourselves swapping cards in and out of our decks to \"fit\" whatever encounter we are going up against.  Rich mentions that he loves Goblin-Cleaver as a top card.  I haven't even played it yet... lol.  Does that make it a good or bad card?  Neither (well, it IS a good card), it really just means that for all our whining as players, the design team is ACTUALLY doing a decent job of building this game with real OPTIONS.\n> \n>  \n\nGoblin cleaver is very good. Even 2 damage can be very important when you try to kill some big bad guy. I use it in mono tactic deck and it working perfect. "}]}