{"url":"https://community.fantasyflightgames.com/topic/90934-shadow-and-flame-vs-the-faq/","title":"Shadow and Flame vs. the FAQ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90934-shadow-and-flame-vs-the-faq/?do=findComment&comment=873756","commentId":873756,"userName":"bitva","timestamp":1379983949,"content":"I have two questions pertaining to this scenario or a card included in the Adventure Pack.\n\n \n\nFirst, Durin's Bane cannot leave the staging area as per the card's text, and is engaged with each player with threat 1 or higher. The Adventure Pack insert sheet states that this allows Durin's Bane \"to both add its threat to the staging area and attack.\"\n\n \n\nHowever, the FAQ states:\n\n \n\n(1.20) Engaged Enemies During the quest phase, engaged enemies do not count their threat for the staging area.\n\n \n\nSo which is correct? Does the FAQ assume that if an enemy is engaged, it is not in the staging area? If so, it should be updated.\n\n \n\nThe other question I have regards Elrond: his card text states his resources may be used to play allies from the spirit, tactics, and leadership spheres. Does this require a resource match as well, through Vilya or perhaps a SoM cycle song or Narvi's Belt? Would it matter if one of the other Heroes the player controlling Elrond uses has a different icon than Elrond? The FAQ does not address this directly.\n\n \n\nThanks!\n\nEdited September 24, 2013 by bitva"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90934-shadow-and-flame-vs-the-faq/?do=findComment&comment=873797","commentId":873797,"userName":"joezim007","timestamp":1379989199,"content":"Since Durin's Bane remains, his threat remains there during questing. The FAQ doesn't take into consideration an engaged enemy who is still in the staging area. As for Elrond, I believe his ability essentially gives him a resource match for any allies that cost at least 1 resource. It's very similar to the way A Good Harvest works."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90934-shadow-and-flame-vs-the-faq/?do=findComment&comment=873842","commentId":873842,"userName":"Nickpes","timestamp":1379995373,"content":"In FAQ there is the \"golden rule\" that states that if a cards text is brings a cindition different than the rules book, the card is what you follow instead of normal rules"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90934-shadow-and-flame-vs-the-faq/?do=findComment&comment=873918","commentId":873918,"userName":"Olorin93","timestamp":1380013357,"content":"I believe Durin's Bane is engaged with all players with a threat of 1 or greater, and yet remains in the staging area and contributes its threat.\n\n \n\nElrond can play allies from any sphere from start, no attachments needed. Vilya gives him a \"proper\" [spirit] resource icon, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90934-shadow-and-flame-vs-the-faq/?do=findComment&comment=874209","commentId":874209,"userName":"bitva","timestamp":1380039894,"content":"> In FAQ there is the \"golden rule\" that states that if a cards text is brings a cindition different than the rules book, the card is what you follow instead of normal rules\n\nYes, but the rules I mentioned are in the FAQ, not the rulebook. Otherwise, all card text would over-rule the errata for the cards."}]}