{"url":"https://community.fantasyflightgames.com/topic/90966-caladra-desperate-alliance-and-fortune-or-fate/","title":"Caladra, Desperate Alliance and Fortune or Fate","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90966-caladra-desperate-alliance-and-fortune-or-fate/?do=findComment&comment=874173","commentId":874173,"userName":"Kroepian","timestamp":1380037729,"content":"Hey people,\n\ni have a question concerning the use of the new hero Caladra from Blood of Gondor. Her text ability says \n\nAction: Discard Caldara to put 1 [spirit] ally from your discard pile into play for each other hero you control with a printed [spirit] resource icon. \n\n \n\nNow imagine the following scenario: Player A has caladra and another random hero. Player B uses 3 Spirit heroes.\n\nPlayer A decides to use Deperate Alliance Action: Choose a hero you control. Until the end of the phase, give control of that hero and all resources in that hero's resource pool to another player. (Limit 1 per phase.) \n\non Caladra and passes her over to player B.\n\n \n\nPlayer B decides to use Caladras ability, discards her and puts 3 Spirit allies in play (he has 3 spirit heroes left). \n\nCaladra is now in the discard pile of player B. Will she be returned to player A anyway and he puts her into his discard pile or does Player B keep her in his discard pile?\n\n \n\nIf Caladra stays in the discard pile of Player B and Player A plays Fortune or Fate Action: Choose a hero in any player's discard pile. Put that card into play, under its owner's control. \n\nwho is considered the owner of Caladra? Player B because she is in his discard pile or player A because she started the game under his control?\n\n \n\nthx in advance"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90966-caladra-desperate-alliance-and-fortune-or-fate/?do=findComment&comment=874695","commentId":874695,"userName":"GrandSpleen","timestamp":1380083991,"content":"When a card is discarded, it always goes to its \"owner's\" discard pile, which is different from its controller.  Once discarded, Caldara will always go to the discard pile of the player she originally belonged to.  \n\n \n\nOn pg 25 of the manual:\n\nA player “owns” his heroes and the cards that he has\nchosen for the player deck he is playing. A player\n“controls” all cards that he owns, unless another player\nor the encounter deck takes control of the card through\na game effect. Any time a card leaves play, it reverts to\nits owner’s hand, deck, or discard pile (as directed by\nthe effect forcing the card out of play).\n\n \n\n \n\nIncidentally, I like the idea of the encounter deck taking control of a player card.  We haven't seen that in the game yet, and hopefully will someday."}]}