{"url":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/","title":"Saga Heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874135","commentId":874135,"userName":"Morithain","timestamp":1380035033,"content":"Now that the Black Riders is out, it seems clear that doing the entire trilogy in this manner will mean 5 more Saga expansions.  If they follow the usual pattern, that means 4 heroes per Saga Expansion.  That's 20 more heroes!  At this point, I'm wondering who in the heck we are going to see?  I for one would like to see Erkenbrand--most likely a tactics hero.  And some more hobbits would be nice, even if it's just different sphere versions of the ones we have, though I generally am not a huge fan of the multiple-sphere-versions of heroes thing, mainly because it means multiplayer games are more limited in who can play who.  On the other hand, having 2 Aragorns means more flexibility in deck building around this great hero, which is pretty cool.  \n\n \n\nSo who will we see?  Tactics Aragorn?  Spirit Samwise?  Erkenbrand?  Another Faramir or Eowyn?  Maybe Leadership Éomer or Théoden!  Thoughts?\n\nEdited September 24, 2013 by Morithain"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874146","commentId":874146,"userName":"Karlson","timestamp":1380035645,"content":"I'm thinking the next saga expansion, titled The Road Darkens, will revolve heavily around the nine members of the Fellowship and their journey south after departing Rivendell.  I hope to see a new sphere version of Legolas and perhaps Gimli (even though I'm not sure what sphere Gimli fits into besides Tactics.)  A new Aragorn or Boromir might not be as feasible since there's already two of each existing in the card pool.  \n\n \n\nI have a feeling that this expansion might skip Kazad-Dum and the Balrog confrontation since we've already had that twice now.  WIth that said, it might have a fun quest in Lothlorien, which in turn, could lead to a possible hero incarnation of Galadriel.  \n\n \n\nAt any rate, I think the final quest of this 2nd saga expansion will be the battle at Amon Hen and the departure of Boromir, something I'm greatly looking forward to playing out.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874158","commentId":874158,"userName":"Morithain","timestamp":1380036177,"content":"I'm not sure how Galadriel would work as a hero.  But who knows.  In any case, an even greater question is--will we get another version of Gandalf in the Two Towers expansion:  Gandalf the White?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874264","commentId":874264,"userName":"Bullroarer Took","timestamp":1380043729,"content":"One of the things that I did not realize is that there is a sentence in the rule book that says you cannot change heroes in campaign mode unless one of them dies.  As a solo player I'm not sure how that will work.  Will Frodo and Sam end up in Helm's Deep?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874271","commentId":874271,"userName":"richsabre","timestamp":1380044180,"content":"this has been discussed at some length (cant find the thread) but my personal belief is 1saga pack per 'book' . ie. 6 books = 6 packs.\n\n \n\nin those i see two paths for the designers\n\n \n\n1. complicated splitting up for the fellowship with varying amounts given to each company per pack\n\n \n\n2. a more simple (and likely) format in which you have frodo / sam and everyone else. perhaps even 1 frodo/sam devoted pack and likewise for the others and so on. (this would follow the novel format)\n\n \n\nas for who ends up where- well, saga heroes must surely change. it wouldnt make much sense to have frodo sam in a saga expansion based on the 3 hunters going after merry and pippin\n\nrich\n\nEdited September 24, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874314","commentId":874314,"userName":"Morithain","timestamp":1380046673,"content":"I'm betting what they'll do is just have Frodo going to the Dead marshes (with or without Sam), then Mordor; meanwhile anybody and everybody will be going on the other adventures.  The path through Shelob's Lair is certain to be a challenge, as is the march across Gorgoroth."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874330","commentId":874330,"userName":"player427339","timestamp":1380047643,"content":"My favorites for next saga expansion: Spirit Aragorn, (probably) Lore Legolas, Gimli (maybe leadership?)... I am not sure about Fourth.\n\nEdited September 24, 2013 by Denethor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874495","commentId":874495,"userName":"Karlson","timestamp":1380060965,"content":"> 2. a more simple (and likely) format in which you have frodo / sam and everyone else. perhaps even 1 frodo/sam devoted pack and likewise for the others and so on. (this would follow the novel format)\n> \n>  \n\n \n\nI think this would be a great approach.  While the Fellowship of the Ring really tells one long story across books one and two, the Two Towers and the Return of the King tell two separate stories in each book, with books three and five being about Aragorn traveling through Rohan and eventually into Gondor to take his place as king; whereas, books four and six are about the hobbits (mostly Frodo and Sam, but once again all four hobbits as they return to retake the Shire in the final book.)\n\nSo, I think this same format would work wonderfully with each of the saga expansions after The Road Darkens.  It would also be a great way of splitting up the narrative in a gameplay sense in that each additional saga pack would feature all new locations.   The only hairy part I could see is deciding which new heroes to add to the Frodo/Sam specific expansions since those parts of the story really only involve them.  We may see Smeagol after all! \n\nEdited September 24, 2013 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=874533","commentId":874533,"userName":"Glowwyrm","timestamp":1380063966,"content":"I mostly play two handed, but I would love to see ally versions of the main characters so that you could potentially run the full fellowship in a solo deck (or even the full fellowship in a two player game, which is close but not quite possible at the moment).  I'd also like versions of the characters that work together when they are a part of the fellowship, or abilities that play off of each other.  Sort of Elladan and Elrohir, but on a much bigger scale.\n\nCaleb in his Team Covenant interview alluded that this could happen, but I don't think it is likely, but I want to see alternate ring-bearers.  The next saga expansion could potentially include Galadriel and or Boromir ring-bearer versions (Gandalf and Tom Bombadil could have been alternate ring-bearers in Black Riders).  I know that the saga-expansions are focused on telling the story of the books, but one of the reasons I like the game is that you are having your own adventures in Middle Earth.  Alternate ring-bearers would be a great way to explore what could have happened at these crucial moments in the Third Age."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=875135","commentId":875135,"userName":"Ellareth","timestamp":1380134422,"content":"As for existing fellowship memebers in different sphere, not sure why people are stuck with the idea 'Gimli only fits Tactics'.\n\n \n\nHe is excellent candidate for any sphere of influence.\n\nTactics obviously due to his battle prowness.\n\nLeadership for being important nobility of Durin's Clan and his later lordship of Glittering Cave.\n\nSpirit as Gimli was extremely trustworthy and is able to endure enemy's (ring's) temptation to a point where Aragorn saw it fit for him to be one of final members to accompany Frodo to Mount Doom.\n\nLore due to his knowledge of Dwarven history and (if relevent) scouting advantage due to better sight in darkness.\n\n \n\nHe is much more than a drunken-comic relief that has to burf and fall off a horse once a while.\n\nIn comparison to Gimli, son of Gloin and lord of Glittering Cave, Legolas was nothing but a prince of lesser Elven Kingdom clad in weird garment of green and brown ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited September 25, 2013 by Ellareth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=875234","commentId":875234,"userName":"Karlson","timestamp":1380141091,"content":"> As for existing fellowship memebers in different sphere, not sure why people are stuck with the idea 'Gimli only fits Tactics'.\n> \n>  \n> \n> He is excellent candidate for any sphere of influence.\n> \n> Tactics obviously due to his battle prowness.\n> \n> Leadership for being important nobility of Durin's Clan and his later lordship of Glittering Cave.\n> \n> Spirit as Gimli was extremely trustworthy and is able to endure enemy's (ring's) temptation to a point where Aragorn saw it fit for him to be one of final members to accompany Frodo to Mount Doom.\n> \n> Lore due to his knowledge of Dwarven history and (if relevent) scouting advantage due to better sight in darkness.\n> \n>  \n> \n> He is much more than a drunken-comic relief that has to burf and fall off a horse once a while.\n> \n> In comparison to Gimli, son of Gloin and lord of Glittering Cave, Legolas was nothing but a prince of lesser Elven Kingdom clad in weird garment of green and brown ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nNot going to lie, that is the most love I've ever seen anyone give Gimli!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=875338","commentId":875338,"userName":"Djenni","timestamp":1380149601,"content":"I'm thinking we might see more heroes from the fellowship sphere so we can choose from different ringbearers for our quest :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI'm also thinking we might only be following Frodo & Sam through their Journey and then later we could get the Saga Expansions for the three hunters/Gandalf..\n\nEdited September 25, 2013 by Djenni"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=875428","commentId":875428,"userName":"Pharmboys2013","timestamp":1380163835,"content":"Even though it feels like theres already been a number of topics already talking about this...I still really enjoy the conversation.  \n\nI originally speculated we would see new versions Aragorn, Gimli, and Legolas along with potentially a second Elrond, hero version of Arwen, Haldir, Celeborn, or Galadriel.  A lot of people have considered getting a new Boromir too, but I think its far more likely that if we see him it will be as an ally since I think if any hero is remade two times first it will be Aragorn and I truly dont see Boromir fitting into Lore or Spirit.\n\n \n\nI was pretty firm on this opinion until i watched team covenant's interview with Caleb and his explanations of design choices in black riders.  He mentioned Aragorn wasnt included in the set because the saga expansions are marketed towards newer/casual players who may only have the core set and might be discouraged at getting repeat characters whenever they already have so few heroes to begin with.\n\n \n\nThis design choice eliminates 3 of my original guesses.  Also keeping in mind that when the voice of isen site went live there was short lived artwork of what looked like Haldir but was replaced with Eomer.  There is also the elven female warrior on the site who may or may not be Arwen.  This kind of leaves Elrond, Celeborn, Galadriel, then either Haldir/Arwen (whomever is not used in VOI) as the only significant heroes left to make heroes of for the second box.\n\n \n\nAll of this could be BS by the time we figure out who they are, but using the logic of the facts we are currently presented with it seems to make sense\n\nEdited September 26, 2013 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=875433","commentId":875433,"userName":"Pharmboys2013","timestamp":1380164201,"content":"> As for existing fellowship memebers in different sphere, not sure why people are stuck with the idea 'Gimli only fits Tactics'.\n> \n>  \n> \n> He is excellent candidate for any sphere of influence.\n> \n> Tactics obviously due to his battle prowness.\n> \n> Leadership for being important nobility of Durin's Clan and his later lordship of Glittering Cave.\n> \n> Spirit as Gimli was extremely trustworthy and is able to endure enemy's (ring's) temptation to a point where Aragorn saw it fit for him to be one of final members to accompany Frodo to Mount Doom.\n> \n> Lore due to his knowledge of Dwarven history and (if relevent) scouting advantage due to better sight in darkness.\n> \n>  \n> \n> He is much more than a drunken-comic relief that has to burf and fall off a horse once a while.\n> \n> In comparison to Gimli, son of Gloin and lord of Glittering Cave, Legolas was nothing but a prince of lesser Elven Kingdom clad in weird garment of green and brown ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\ngood comment.  I am of the opinion that there is not a single hero who only fits into one sphere.  Most heroes could be two, some even more.  Even Beorn, who is probably most cemented in his sphere could make a strong case for leadership being a chieftan of the beornings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=875464","commentId":875464,"userName":"Legolas of Darkwood","timestamp":1380168522,"content":"I would like to rather see ally versions of the famous heroes instead of 3rd or even 4th sphere versions. While you may find some reason for a lore Gimli or a spirit Boromir I think recreating a character in spheres that don't fit them well would somewhat damage the story and the background story. I think it would undermine the general game mechanic thats bases on four different spheres as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=876566","commentId":876566,"userName":"Djenni","timestamp":1380307594,"content":"Yeah definitely, the entire Fellowship available as allies would be incredible for the Saga quest experience :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=876748","commentId":876748,"userName":"richsabre","timestamp":1380324881,"content":"i agree- there is certainly the ability to put any of the fellowship and indeed most characters into any sphere of the game- tolkien made his characters multi-layered\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/90963-saga-heroes/?do=findComment&comment=876922","commentId":876922,"userName":"Noldo2","timestamp":1380362166,"content":"It has been pointed out many times, since the saga is meant to be playable with only the core, we will have to see another version of Boromir, likely an ally this time. It is why we got the second Pippin within a month or so. There's no such need for the rest of the Fellowship but they do need to fill up the hero slots (especially considering there will be four again)."}]}