{"url":"https://community.fantasyflightgames.com/topic/91048-epic-thematic-confrontation-at-the-ford-of-bruinen/","title":"Epic Thematic Confrontation at the Ford of Bruinen!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91048-epic-thematic-confrontation-at-the-ford-of-bruinen/?do=findComment&comment=875451","commentId":875451,"userName":"Karlson","timestamp":1380166457,"content":"So I just had, quite possibly, the coolest unraveling of events yet in my entire Lord of the Rings LCG experience.  I finally managed to beat A Knife in the Dark after four tries (you gotta take Bill Ferny out in turn one or two!) and I started my first playthrough of Flight to the Ford...\n\n \n\nAfter a vicious sword fight with five Nazgul on the crown of Weathertop, my heroes escaped but not without great injury, for Frodo had been stabbed by a Morgal blade.  As a result, my heroes made haste through the Trollshaws and even encountered a camp filled with three stone trolls (which accounts for an altogether different adventure) but the clock was ticking and Frodo's health was rapidly depleting...\n\n \n\n...Finally, my heroes reached the final leg of the trip in their desperate gallop towards Rivendell.  The Ford of Bruinen came into play, but so too did the loathsome Witch-king!  My heroes quickly traveled to the Ford of Bruinen and prepared to make a last stand against two Fell Riders, two Ringwraiths, and the Witch-king himself...\n\n \n\n...The next round, my heroes unearthed the burden card Overcome By Terror, in which Frodo frantically gave in to the final moments of temptation and in his fear, placed the One Ring on his finger.  Likewise, this burden also game with a surge effect.  So, surging out of the vile encounter came yet another burden: The Ring Draws Them.  Since Frodo put the One Ring on, the Nazgul became frenzied and each one of them charged out of the staging area to engage my heroes.. The end seemed near...\n\n \n\n...Yet, in their folly, the two Fell Riders, two Ringwraiths, and Witch-king did not realize that my heroes had successfully quested out of the Ford of Bruinen, and each one of the Nazgul enemies were swept away by the raging waters of the enchanted river, leaving both the staging and engagement area completely void of threat.   My heroes proceeded to ride safely into Rivendell to bring Frodo to the Last Homely House where Elrond mended his evil wound to the best of his ability... \n\n \n\n...Now, the time draws near for a council of Middle-earth's greatest heroes to form in order to discuss the next course of action to take regarding the One Ring to rule them all.  \n\nEdited September 26, 2013 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91048-epic-thematic-confrontation-at-the-ford-of-bruinen/?do=findComment&comment=875785","commentId":875785,"userName":"Pharmboys2013","timestamp":1380214934,"content":"sounds awesome, cant wait to have my own adventures.  my box should be coming into the mail tomorrow which is not ideal since i'll be leaving on a business trip tonight thru sunday.  the shire will have to wait for me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91048-epic-thematic-confrontation-at-the-ford-of-bruinen/?do=findComment&comment=875915","commentId":875915,"userName":"Bullroarer Took","timestamp":1380226161,"content":"I've packed a couple of decks and some counters on a lot of business trips.  Just sayin'."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91048-epic-thematic-confrontation-at-the-ford-of-bruinen/?do=findComment&comment=875918","commentId":875918,"userName":"Pharmboys2013","timestamp":1380226396,"content":"> I've packed a couple of decks and some counters on a lot of business trips.  Just sayin'.\n\n \n\nid consider it but i dont even have anything put together.  separated and organized everything in anticipation of black riders"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91048-epic-thematic-confrontation-at-the-ford-of-bruinen/?do=findComment&comment=876416","commentId":876416,"userName":"Bullroarer Took","timestamp":1380297536,"content":"There are a couple of great theme decks over in Strategy that work well on these quests."}]}