{"url":"https://community.fantasyflightgames.com/topic/91153-just-a-couple-of-questions/","title":"Just a couple of questions.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91153-just-a-couple-of-questions/?do=findComment&comment=876735","commentId":876735,"userName":"CaliAlpha","timestamp":1380323551,"content":"Just got the game this week.\n\n \n\n1) Okay a question I was wondering in the encounter phase, the player can engage an enemy before the engagement check. To resolve the combat, does the creature/monster you are attacking gets dealt a shadow card?\n\n \n\n2) On shadow effects for example the \"Forest Spider\" Shadow: Defending player must choose and discard 1 attachment he controls\" Does this effect the cards in your hands that are attachments or only the attachments attached to your heroes?\n\n \n\nIf I have more questions I will post back in this topic. Thank you for the responses and have a wonderful day. May the force be with you! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91153-just-a-couple-of-questions/?do=findComment&comment=876744","commentId":876744,"userName":"richsabre","timestamp":1380324629,"content":"1. whether you engage an enemy or it engages you, they are always attacking first. so yes it would get a shadow card as normal\n\n2.only those in play (not in your hand)\n\n \n\nhope that helps and very unthematic greeting to you to :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] !\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91153-just-a-couple-of-questions/?do=findComment&comment=876886","commentId":876886,"userName":"mr.thomasschmidt","timestamp":1380350096,"content":"Hehe. It's so nice to see players from the SW universe join middle earth :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I myself has joined the light side in the X wing game recently. Welcome master hobbit. Hm, very interesting crossovers here. Be aware of Dart Wormtounge. And wonder if Dart Vader and the Mouth of Sauron are related? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] sorry for sidetracking your thread. Anyway, welcome if you look at the rules section of this forum page 1 there should be a thread I made for newcomers with two links for some must have documents for this game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}