{"url":"https://community.fantasyflightgames.com/topic/91195-expansions/","title":"expansions...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=877159","commentId":877159,"userName":"monk","timestamp":1380403274,"content":"Just bought this game and waiting for it to arrive. Can someone tell me about the expansions.\n\n1. Whats the difference between deluxe and standard?\n\n2. If i buy one expansion can i use its cards in my deck to play another expansion?\n\n3, what expansions should i avoid if most of my games will be solo play?\n\n4. Which are deemed the tricky/easier expansions\n\n5, do u have to purchase all expansion packs from a particular chapter?\n\n6. Do any expansions make other expansions better to play?\n\n7. Are there any i should avoid?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=877177","commentId":877177,"userName":"richsabre","timestamp":1380404778,"content":"1. deluxe are needed to play the corresponding cycles. they are also bigger and cost more. so you can play cycle 1 mirkwood cycle with just the core set...howevever to play cycle 2 dwarrowdelf you need the deluxe pack khazad dum. cycle 3 needs hiers of numenor. saga packs do not need anything but core set\n\n \n\n2.yes you can- player cards and heroes only though. the encounter cards are fixed to that pack (the deluxe enoucnter cards are used in different packs in the following cycle explaining why you NEED the deluxe pack to play the cycle)\n\n \n\n3. the only one to really avoid is return to mirkwood. its a great quest multihanded but looses alot of its aspects solo.\n\n \n\n4. your card pool changes the difficulty of quests a lot as do player amounts. as you have said you are a solo player i would say the following (i will just name from cycles 1 and 2)\n\n \n\neasy = hunt for gollum, emyn muil, dead marshes, the long dark, foundations of stone\n\nmedium = conflict at the carrock redhorn gate, road to rivendell, watcher in the water\n\nhard = journey to rhosgobel, return to mirkwood, shadow and flame\n\n \n\n5.not really. the story narrative progressives chronologically but theres nothing stopping you buying pack 6 then 3 or 4 then 1 for example\n\n \n\n6. in a way every previous cycle makes the next one much better. the packs are designed to focus upon cards released at the time .....so you will find later packs more difficult if you only have a few early packs. there are key packs with key cards. song cards are key and found in mirkwood packs. glorfindel is a revolutionary hero in a dwarrodelf pack. if you like rohan and eagles go for mirkwood, dwarves and elves go for dwarrodelf and hobbit saga packs. gondor is the current cycle\n\n \n\n7. no. i love all of them ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]. as above though i would avoid later packs until you have a decent card pool\n\n \n\nrich\n\nEdited September 28, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=877188","commentId":877188,"userName":"monk","timestamp":1380405430,"content":"Great. Thanks for your help. Just a few more questions based on your answers.\n\n1. How do u know which corresponding cycles require a specific deluxe pack to play\n\n2. How do find out the order the expansion cycles were released."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=877265","commentId":877265,"userName":"richsabre","timestamp":1380415186,"content":"no problem\n\n1. it should say on the ffg product description but here is the list anyways:\n\n \n\nmirkwood cycle needs = none...just core set\n\ndwarrowdelf cycle needs = khazad dum\n\nagainst the shadow cycle needs = hiers of numenor\n\n \n\nthat is all that is out at the moment\n\n \n\n2. here is the list in order of what i got them (i have played since core set release so these are correct)\n\n \n\ncore set\n\nMIRKWOOD CYCLE\n\nhunt for gollum\n\nconflcit at the carrock\n\njourney to rhosgobel\n\nemyn muil\n\ndead marshes\n\nreturn to mirkwood\n\n \n\nkhazad dum deluxe\n\nDWARROWDELF CYCLE\n\nredhorn gate\n\nroad to rivendell\n\nwatcher in the water\n\nthe long dark\n\nfoundations of stone\n\nshadow and flame\n\n \n\nhobbit saga pack 1 and 2 (these were released one before and one after the follow pack i list in the uk...it doesnt really matter here as saga packs dont follow any order compared to the expansions)\n\n \n\nHiers of numenor deluxe\n\nAGAINST THE SHADOW CYCLE\n\nthe stewards fear\n\nthe druadan forest\n\nencounter at amon din\n\nassault on osgilliath\n\nblood of gondor (not out yet)\n\nmorgul vale (not out yet)\n\n \n\nBlack riders (lord of the rings saga pack 1) is out....again in between a cycle but again it doesnt matter as it saga pack\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=877368","commentId":877368,"userName":"monk","timestamp":1380434167,"content":"Awesome! Cant wait to play it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=877489","commentId":877489,"userName":"Khamul The Easterling","timestamp":1380463410,"content":"Return to Mirkwood is an awesome quest.  Even when it's played solo.  It's fun to build a deck to try to beat it.  Don't hesitate to buy it!  I play solo a lot and its one of my favorite quests of all released so far.  \n\n \n\nI also agree that you should not any of the newer expansions.  Buy either the Mirkwood Adventure Packs or Khazad Dum and the Dwarrowdelf packs or both.  \n\n \n\nHave fun,\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=877898","commentId":877898,"userName":"Samwise Gamgee","timestamp":1380503813,"content":"I also think you should get Black Riders. It's great fun and comes with the hobbits. The expansion comes with a deck list from only the Core and BR which stands up pretty well to the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=878155","commentId":878155,"userName":"richsabre","timestamp":1380543376,"content":"it is great fun, but i personally wouldnt....i even find it difficult with the entire card pool and the entire's games worth of experience behind me.\n\nbut if you like a challenge,  black riders has to be the most themeatically rich and beautiful of all the expansions so i would say get it on that\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91195-expansions/?do=findComment&comment=879624","commentId":879624,"userName":"Nerdmeister","timestamp":1380707757,"content":"> 2. If i buy one expansion can i use its cards in my deck to play another expansion?\n> \n>  \n\n \n\nAn exception would be the treasure cards from The Hobbit saga expansion. Those can only be added to your deck by playing the corresponding quests and not outside The Hobbit"}]}