{"url":"https://community.fantasyflightgames.com/topic/91336-turn-sequence-and-uninterruptible-steps-your-opinion/","title":"Turn sequence and uninterruptible steps: your opinion","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91336-turn-sequence-and-uninterruptible-steps-your-opinion/?do=findComment&comment=878829","commentId":878829,"userName":"zeb","timestamp":1380619398,"content":"Hi,\n\nI was going to rewrite a turn sequence sheet, and had some thoughts about the current design of many of them. They usually reproduce what the rule book says: that you can play actions amid some steps, or between steps, or at the end of each step (e.g. combat phase), and usually use 3 colours to delimitate these steps.\n\nIs there any reason for this complication? Another way to see things, which would make the turn sequence easier, is to revert the way of thinking: you can play actions at any time, except during some uninterruptible steps (uninterruptible by actions, not response of course). Thus, there would be no distinction between amid, between and after, which are source of confusion. You simply know there are some steps you cannot interrupt, and the rest is free-to-play (or \"amid\", as used in the rulebook). In term of turn sequence design, there would be only one colour: a background red delimiting these uninterruptible steps. So no monkey business with the amid, between and after.\n\nIs it the way you play it? Is there any danger of doing mistakes by doing so?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91336-turn-sequence-and-uninterruptible-steps-your-opinion/?do=findComment&comment=878997","commentId":878997,"userName":"richsabre","timestamp":1380639999,"content":"the way you put it would be a lot easier for newcomers to the game. i know i played turn sequences wrong for a long time, and so do a lot of others. i cannot think of any real reason not to say 'here is simply where you cannot play actions'....though perhaps those who are better at rules analysis than me will come up with something\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91336-turn-sequence-and-uninterruptible-steps-your-opinion/?do=findComment&comment=880472","commentId":880472,"userName":"leptokurt","timestamp":1380786257,"content":"Yes, these rules are overcomplicated. But let's not forget that these games are played by nerds mostly, so using common sense and some basic rules isn't enough - every little detail has to be fixed in the rules to make sure that there is no loop. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91336-turn-sequence-and-uninterruptible-steps-your-opinion/?do=findComment&comment=880749","commentId":880749,"userName":"zeb","timestamp":1380817385,"content":"> these games are played by nerds mostly\n\n \n\n:D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] That's right. On the other hand, timing is everything in such kind of games, so I do not feel guilty :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}