{"url":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/","title":"Smaug and Rider of the Mark","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=881639","commentId":881639,"userName":"Mndela","timestamp":1380913134,"content":"You can avoid the forced of Smaug the Magnificent by Rider of the Mark hability?\n\n \n\nThe text of the ally is: Response: After Rider of the Mark changes control, discard a shadow card dealt to an enemy you are engaged with.\n\n \n\nAnd the text of Smaug: If Smaug the Magnificent is dealt a shadow card with a burgle effect, he makes an additional attack immediately after this one.\n\n \n\nSmaug is immune to player cards effects. Is immune also to the text of Rider of the Mark?\n\n \n\nPD: one question: which enemy is his shadow card discarded, the enemy of new controler or the old controler?\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=881880","commentId":881880,"userName":"ricedwlit","timestamp":1380935855,"content":"Rider of the Mark is player card, hence the effect is a player card effect.  So Smaug is immune to the effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=881968","commentId":881968,"userName":"GrandSpleen","timestamp":1380949811,"content":"The shadow card is a separate entity from Smaug.  We've seen rulings in the past that state Burning Brand or Hasty Stroke can cancel shadow effects that were dealt to immune enemies.  Rider of the Mark should be able to discard the card, then.  I suppose as long as you do this before the shadow card is flipped over, Smaug's effect will not trigger."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882215","commentId":882215,"userName":"Angus Lee","timestamp":1380988437,"content":"> The text of the ally is: Response: After Rider of the Mark changes control, discard a shadow card dealt to an enemy you are engaged with.\n> \n>  \n> \n> PD: one question: which enemy is his shadow card discarded, the enemy of new controler or the old controler?\n\nSince it is a Response on Rider of the Mark, and the Response happens after the trigger condition completes, it discards a shadow after the control changes. So the \"you\" in \"an enemy you are engaged with\" would mean the new controller."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882248","commentId":882248,"userName":"Mndela","timestamp":1380991614,"content":"Ok. Thank you very much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882449","commentId":882449,"userName":"ricedwlit","timestamp":1381023845,"content":"> The shadow card is a separate entity from Smaug.  We've seen rulings in the past that state Burning Brand or Hasty Stroke can cancel shadow effects that were dealt to immune enemies.  Rider of the Mark should be able to discard the card, then.  I suppose as long as you do this before the shadow card is flipped over, Smaug's effect will not trigger.\n\nCanceling an effect does not require Smaug be targeted, so yes, you could use Burning Brand or Hasty Stroke. But removing the card requires that Smaug be targeted (in order to select the card to remove).  The targeting is what Smaug is immune to, so Rider of the Mark cannot use his effect.\n\n \n\nLook at it like this: a card like Hasty Stroke grants the player immunity to the shadow effect, which is something that Smaug does not effect.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882473","commentId":882473,"userName":"GrandSpleen","timestamp":1381029629,"content":"I'm gonna have to stick by my original answer.  The shadow card is not Smaug, it's got to be a separate entity with its own distinct presence on the table.  You can target any shadow card on the table without simultaneously targeting the enemy to which it was dealt.  \n\n \n\nAs an aside, what constitutes \"targeting\" is kind of fuzzy at this point thanks to some earlier rulings and ruling reversals.  Playing one card on another card is a form of targeting, since we know from the FAQ that playing an attachment on an enemy is considered targeting.  Some cards also explicitly use the word target or choose, which I presume are interchangeable.  But Quick Strike and Hands Upon the Bow CAN be used against enemies with immunity (see ruling here [https://community.fantasyflightgames.com/index.php?/topic/83509-immune-to-player-card-effects/?hl=bolg#entry793162]).  The previous ruling was that these cards don't target the enemy -- they target the player, even though that player has to pick the enemy to attack.  The card doesn't use the text \"target\" or \"choose\" in reference to an enemy, so they are fair game.  Great Yew Bow, on the other hand, wouldn't work.  Or Dunhere.\n\n \n\nRider of the Mark doesn't ask you to \"target\" or \"choose\" an enemy -- or even their shadow card, for that matter.  Of course you have to do so in reality, but it seems that \"target\" and \"choose\" are language that are used in specific ways, much like \"reveal.\"  And all of that aside, I still think that the shadow card is totally separate from the immune player card and doesn't gain any part of that enemy's immunity!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882561","commentId":882561,"userName":"Mndela","timestamp":1381058941,"content":"I think also as GrandSplee. But..., anyway, you discard the shadow card, it's ok, but..., must you \"see\" the card if it has burgle effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882727","commentId":882727,"userName":"GrandSpleen","timestamp":1381078951,"content":"> I think also as GrandSplee. But..., anyway, you discard the shadow card, it's ok, but..., must you \"see\" the card if it has burgle effect?\n\n \n\nThis is the part I'm not sure about.  You could discard the card before it is flipped over, but technically Smaug was still dealt the card.  If there was a Burgle effect on it, it might still trigger his effect.  Same thing would happen for enemies that \"run away\" back to the staging area after an attack if they get a shadow card with no effect... anyone know how that would play out if you discard the shadow card before ever flipped it over?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882755","commentId":882755,"userName":"ricedwlit","timestamp":1381082148,"content":"Okay, just dug up an old question answer I sent regarding Smaug which may have some bearing. \n\n \n\nMy question(s):\n\n> These questions concern the forced effect on Smaug the Magnificent in \"The Lonely Mountain\" Quest (\"If Smaug the Magnificent is dealt a shadow card with a burgle effect, he makes an additional attack immediately after this one\") and ways in which the players might deal with it. \n> \n> 1) Can a player play \"Dawn take you all\" before the shadow card is revealed in order to remove it? [it's not clear to me whether or not Smaug's being immune to player card effect extends to the shadow cards that are dealt to him.]\n> \n> 2) Is the forced effect a \"shadow effect\" that is triggered when the shadow card has a burgle effect? To be more specific:\n> a) Can Balin pay a resource to replace the shadow card with another card?\n> b) Can \"Hasty Stroke\" be played to counteract the forced effect?\n> c) Could Dunedain Watcher be discarded in order to counteract the forced effect?\n\n \n\nCaleb's answer:\n\n>  \n> \n> Thanks for writing. Really glad to hear you're enjoying the game!\n> To answer your questions:\n> 1. Yes. If you discard the shadow card dealt to Smaug before it is revealed, then it cannot trigger his Forced effect.\n> 2. No. \"Shadow effects\" are always denoted by the text: \"Shadow: ...\" \n> a, b, c - All no, because they cancel shadow effects and not Forced effects. \n> Cheers,\n> Caleb\n\n \n\nWorth noting:\n\n * You cannot play Hasty Stroke to stop the second attack as it targets a shadow effect and not a forced effect.\n * Since you can play use \"Dawn Take you All\" I'll reverse my opinion here and say you can also use Rider of the Mark, provided you do so before the card is revealed.  Once you reveal the card, then it's too late to stop the forced effect (e.g. same situation as what I asked concerning discarding Dunedain Watcher)\n\n(Edited for formatting).\n\nEdited October 6, 2013 by ricedwlit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=882874","commentId":882874,"userName":"GrandSpleen","timestamp":1381097890,"content":"Thanks for digging that up! Was exactly what I was wondering about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=884260","commentId":884260,"userName":"alogos","timestamp":1381243484,"content":"> Okay, just dug up an old question answer I sent regarding Smaug which may have some bearing. \n\n \n\nMay I ask how old was the question ? FAQ 1.5 changed the ruling of immunity as Caleb said we could attach cards on immuned locations before but 1.5 prevent it.\n\n \n\n \n\n> I'm gonna have to stick by my original answer.  The shadow card is not Smaug, it's got to be a separate entity with its own distinct presence on the table.  You can target any shadow card on the table without simultaneously targeting the enemy to which it was dealt.  \n\n \n\nThe same was said for attachement. And everything changed, when the FAQ 1.5 attacked came out.\n\nIf the question was pre-faq 1.5, it could be worth to ask again.\n\n \n\nEdit : relevant FAQ entries :\n\n \n\n>  \n> \n> Q: Can I play an attachment on an enemy or location\n> \n> that is immune to player card effects.\n> \n> A: No. Playing an attachment on a card is a form\n> \n> of targeting, and cards with \"immune to player card\n> \n> effects\" cannot be targeted by player cards.\n> \n>  \n> \n> Q: Can I use Quick Strike (Core 35) to declare an\n> \n> attack against an enemy that is immune to player card\n> \n> effects?\n> \n> A: Yes. The effect of Quick Strike targets a character\n> \n> and allows that character to make an attack, therefore\n> \n> the chosen enemy's immunity does not factor.\n\n \n\nAnd the part of the card of Dawn Take you All I suspect is a \"form of targeting\" :\n\n \n\n> Combat Action: Each player may choose and discard 1 facedown shadow card from an enemy with which he is engaged.\n\n \n\nEdited October 8, 2013 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=884771","commentId":884771,"userName":"ricedwlit","timestamp":1381277725,"content":">  \n> \n> May I ask how old was the question ? FAQ 1.5 changed the ruling of immunity as Caleb said we could attach cards on immuned locations before but 1.5 prevent it.\n> \n>  \n> \n>  \n\nThe question was asked on May 6 of this year.  If you suspect that FAQ 1.5 changes things I'd suggest re-submitting a question.   I still think things are valid though, as I don't believe Smaug's immunity extends to the encounter deck cards attached to him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=1814837","commentId":1814837,"userName":"cmabr002","timestamp":1443026943,"content":"Is this still the current ruling on whether or not you can discard shadow cards from Smaug the Magnificent?\n\n \n\nIt would certainly make it easier to win more consistently if you can, but my friend and I did not include any such cards in our decks because we thought they were a form of targeting and thus would not be useable against Smaug the Magnificent.  Currently, all the cards that discard shadow cards mention the enemy in some way.  If a card simply said \"discard a shadow card from play\" then it clearly would not be targeting.\n\n \n\nLosing your entire army to chained burgle effects currently has no answer unless you are allowed to discard the shadow card, though.  So hopefully Caleb's original ruling is still current.\n\nEdited September 23, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=1814895","commentId":1814895,"userName":"Teamjimby","timestamp":1443028626,"content":"I don't see any reason why it would have changed.  The Rider of the Mark targets the shadow card (even though it references an enemy engaged with you).  The Balrog in Road Darkens specifically says shadow cards dealt to him are immune to player card effects.  Smaug does not have that, so his shadow cards are fair game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=1814957","commentId":1814957,"userName":"cmabr002","timestamp":1443030067,"content":"Does that mean you can use Infighting to target the damage on an enemy that is Immune to Player card effects and move it to an enemy that is not?\n \n\n> Action: Move any number of damage from one enemy to another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91531-smaug-and-rider-of-the-mark/?do=findComment&comment=1814970","commentId":1814970,"userName":"Teamjimby","timestamp":1443030260,"content":"That's an interesting question.  I've definitely never thought of doing that, but it might be legal.  It's kind of like Dori ally with Beorn."}]}