{"url":"https://community.fantasyflightgames.com/topic/91592-dark-pit/","title":"Dark Pit","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91592-dark-pit/?do=findComment&comment=882365","commentId":882365,"userName":"bitva","timestamp":1381010327,"content":"Once you hit Quest card 3 in the Shadow and Flame quest, Dark Pit enters the Staging Area. You have to defeat Durin's Bane while Dark Pit is the Active Location. I realize you can leave Dark Pit in the Staging Area until you feel confident or ready to attempt defeating Durin's Bane, but let's say through extreme bad luck, you aren't successful and Dark Pit ends up with 11 progress tokens on it. What happens?\n\n \n\nA) Dark Pit enters discard and you have to wait until the Encounter deck reshuffles and Dark Pit is revealed as a non-shodow card again to win\n\n \n\nB) You lose, game ends immediately\n\n \n\nC) Progress tokens equal to quest points rule is ignored\n\n \n\nD) Melkor returns from the void\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91592-dark-pit/?do=findComment&comment=882505","commentId":882505,"userName":"GrandSpleen","timestamp":1381037423,"content":"You know, I've never had this come up.  I'm just looking at the cards on the LotR LCG Databse site and it looks like you're just s-o-l... have you wait until it cycles back through the encounter deck.  In other words, do not explore!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91592-dark-pit/?do=findComment&comment=882570","commentId":882570,"userName":"iznax","timestamp":1381060227,"content":"D and E) you are doing something really wrong to get your self in a situation like this (it is not bad luck) ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI'm not the ''i'm pro player'' kind of guy, but lets be honest if you manage to do something like this you are doing it on purpose or you are the worst player on the universe :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91592-dark-pit/?do=findComment&comment=882593","commentId":882593,"userName":"Djenni","timestamp":1381064539,"content":"(A) happens.\n\n \n\nBasically after quest card 1 you barely have to quest any more, the only thing you have to think about is piling damage on DB. So just stack wound tokens on DB until you're confident you'll kill him and then travel to Dark Pit, it's zero threat so don't ever travel to Dark Pit unless you're ready to kill DB via it's effect."}]}