{"url":"https://community.fantasyflightgames.com/topic/91675-how-many-black-riders-should-be-set-up/","title":"How many Black Riders should be set up?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91675-how-many-black-riders-should-be-set-up/?do=findComment&comment=883372","commentId":883372,"userName":"Pacificus","timestamp":1381163278,"content":"Quest stages 2 and 3 from A Shadow of the Past include the language:\n\n \n\nThe first player searches the encounter deck and discard pile for a Black Rider, reveals it (cannot be canceled), and adds it to the staging area. \n\n \n\nCould two Riders be added if there was at least one in the encounter deck and at least one in the discard pile?  Or is the intent to put one and only one in to the staging area?\n\n \n\nI know there are other cards that stipulate searching through the encounter deck and discard pile for bad guys..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91675-how-many-black-riders-should-be-set-up/?do=findComment&comment=883927","commentId":883927,"userName":"ricedwlit","timestamp":1381204479,"content":"Linguistically, the intent is to find \"A black rider\", so I think the goal is to add just one to the staging area.  It's just letting you choose where to find the card.  It's giving you the choice of where to find it to maximize the chance of being able to find one (in a really bad situation, they would already all be in play).\n\n \n\nWhere to get the card is your choice - for my part I'd use the encounter deck if possible rather then recycle a rider that was discarded for whatever reason."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91675-how-many-black-riders-should-be-set-up/?do=findComment&comment=884125","commentId":884125,"userName":"Pacificus","timestamp":1381232677,"content":"That's the conclusion I came to as well after re-reading.  \"It\" being singular seems to answer the question.  And I agree with taking out of the deck, which also slightly improves odds of seeing Gildor.  Thanks!"}]}