{"url":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/","title":"A great come back ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884122","commentId":884122,"userName":"iznax","timestamp":1381232628,"content":"After the worst, or less good, ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  cycle so far and the most booooooring deck of all (Outlands, a monkey can build and play an Outlands deck) here comes a very interesting and fun deck (Hobbit, good for starters to) and the beginning of what seems a great saga cycle, what are your thoughts on this guys ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884142","commentId":884142,"userName":"ClydeCloggie","timestamp":1381234030,"content":"I wouldn't call it a come back as I think the Numenor / Agaisnt the shadow cycle is great.\n\n \n\nMaybe that's because I beat Peril in Pelargir and Into Ithilien early, and have not yet managed to make an Outlands deck work. That's probably the two main criticisms of the cycle taken care of :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\n \n\nBut Black Riders is looking like a very strong set; it will be interesting to see if the Isengard expansion can keep the game at that level. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884148","commentId":884148,"userName":"Nickpes","timestamp":1381234401,"content":"I agree the Black Riders seem great ... but I'm a bit embarrased of being called a monkey :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]   ... I have beaten easily all of Heirs of Numenor and a bit of the Against the Shadow cycle but yet again never managed to put in play an OUtland deck, I cannot make it work ... I can win even with a pure tactics deck, but not an outland one  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884178","commentId":884178,"userName":"Morithain","timestamp":1381236460,"content":"In my gaming group we  have one player who does Outlands and we lose about as often as you'd expect.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884197","commentId":884197,"userName":"richsabre","timestamp":1381238818,"content":"never left :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884293","commentId":884293,"userName":"emusand","timestamp":1381245187,"content":"I have to agree with the other posters. I think that Against the Shadow is the best cycle so far.\n\n \n\nI can understand the common criticism that the Heirs of Numenor's scenarios are too hard, and that it requires no deck-building skills to build an Outlands deck. But Siege of Cair Andros is my favorite quest. Perhaps I just like to being stomped by mumaks and orcs. My wins are few and far between, but they give a sense of accomplishment once I do.\n\n \n\nMy attempts with an Outlands deck have all been failures. I understand that they insanely powerful once all allies are in play, but I find it too slow. Perhaps I just play it wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884307","commentId":884307,"userName":"Glaurung","timestamp":1381246079,"content":"HON is amazing. Outlands sucks....... Third cycle is ok but after HON a bit disappointed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884456","commentId":884456,"userName":"Djenni","timestamp":1381255692,"content":"Honestly, why do some people let the Outlands trait bother them so much? If you don't like them, don't use them. It's as simple as that. \n \n\nIf you ask me; they're a brilliant creation. Great for introducing new players into the game and also great for some novice/casual gamers who don't wan't to be crushed everytime they try to play through a tough quest.\n\nEdited October 8, 2013 by Djenni"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884480","commentId":884480,"userName":"HeavyKaragh","timestamp":1381257631,"content":"Against the Shadow cycle is great because of it's variety. I'm not bothered for Outlands' prebuilt deck, the base is 18 Ally cards + 1 Hero (+9 Leadership cards for every Outlands card in the game), that gives plenty of room for deck variants.\n\n \n\nI like the new hobbits, they are fun and demanding because they may crumb quickly if player loses 1 Hero (Merry and Pippin gets weaker) and if Threat rises quickly... I'm playing them, but haven't played the Black Rider's quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884515","commentId":884515,"userName":"emusand","timestamp":1381260364,"content":"The problem with Outlands decks is that the allies become ridiculously powerful once they all are in play. I suppose this has been suggested several times before, but a variant might make the outlanders interesting again: Do not allow the Outlands bonuses to stack. Regardless of how many Anfalas Herdsman you have in play, Outlands characters only get +1 hit point.\n\n \n\nThis might make the outlanders too week instead, but an Anfalas Herdman with 1 will power, 1 attack, 1 defense and 2 hit points for a petty 1 resource is still a bargain in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884649","commentId":884649,"userName":"Pharmboys2013","timestamp":1381268543,"content":"In so far as cycles I have really enjoyed against the shadow and heirs of númenor. I won't argue that the player cards seem to be a mixed bag, but the quests have been fun, creative, and pretty cohesive as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884714","commentId":884714,"userName":"Ellareth","timestamp":1381272947,"content":"I agree and disagree with some of the things that's been said, and I think that is because I am almost exclusively playing solo and the play style I've developed.\n\n \n\nI think Against the Shadow Cycle so far (I have up to Assault on Osgiliath) has been a disappointment in terms of quests.\n\nDon't get me wrong, it is still ton of fun to play and some of the mechanics are brilliant, but there are atleast one things in each quests that bothers me that makes me think this Cycle is not as good as the other two.\n\nSteward's Fear has some great and interesting mechanics, but at the same time those mechanics makes it too fiddly.\n\nDruadan's Forest has encounter cards that are absolutely terrifying when comboed together (or so I hear), but that means nothing interesting ever happens for solo players.\n\nEncounter at Amon Din has great theme, but difficulty wasn't satisfying for me.\n\nAssault on Osgiliath has great potential to be fun and challenging scenario, but also has great probability of achieving 1 hero victory on first turn, and the fact this quest 'can' be a joke turns me off.\n\n \n\nAlso I think the criticisms around Outlander Decks are also from multiplayer's perspectives.\n\nIt's not true when people say Outlands is handed to them on a silver platter; I use to think that way too, until I explored Outlands bit more.\n\nOutlands deck can be very different depending on the heroes you choose.\n\nAbsense and presence of heroes like Beravor and Eleanor can change the whole tactics when playing Outlands,\n\nhaving Hirluin or Elrond or both also dictates overall strategy of Outlands deck and its composition,\n\nYou can choose to have Dwarves and Narvi's Belt on top to combine two of strongest traits, or explore mono-leadership options with heavy dose of Gondor.\n\nSome of them are also great outside of Outlands deck. Ethir Swordsman are definitely worth thinking about including in every deck with Spirit Sphere.\n\n \n\nI think Outlands are being picked on because\n\na) they are not what we wanted/expected (I very much wanted Gondor trait... although technically Outlanders are Gondorians)\n\nb) people who play multiplayers realized that as long as one player does whatever is neccessary to keep the game going for first few turns, outlands deck will become ridiculously powerful.\n\n \n\nBut from solo player's (my) perspective, any proper deck should be ridiculously powerful if it had chance to build up, and it actually takes carefully planned strategy and adaptable tactics to get Outlanders to become powerful.\n\nAnd on top of that they are thematically very well done; if enough people unites under common cause there is no stopping men of Gondor.\n\n \n\nI have yet to pick up my copy of Black Riders, but I am actually worried about how I would like the Hobbit cards; if they are too 'whimpy' I wouldn't play them at all because it will be very difficult to win tougher scenarios, but if Hobbits just massacres the encounter deck it wouldn't be very thematic at all.\n\n \n\n \n\n... and to those who keeps saying 'Don't use it if it bothers you', 'Use variant if you don't like that', 'Play anyway you want and be creative it's your game after all', I want to say that those are all valid opinions and valid ways of playing game,\n\nbut some of us wants to do everything we can within the confines of the rules and gets annoyed when things you can do within the confines of the rule makes the game 'too easy' (I know I could get into trouble for using the word easy, but I hope whomever is reading this knows what I mean).\n\nJust as ignoring certain cards or rules to enhance your play experience is a valid way of playing (such as playing two handed, enabling broader table talk, choosing to take out Blocking Wargs or Sudden Pitfall, choosing not to play with Spirifindel, Dain, etc), using everythign at dispossal and following rule to the letter is also valid way of playing (never playing double handed, following tabletalk rules and phase mechanics and turn order to teeth in multiplayer, choosing to play and explore/exploit so called 'broken' cards). Both types of players are doing it right and both types of players should express/report they experiences and opinions without someone saying 'your opinion is invalid because there are other ways of playing'.\n\n \n\n \n\nShort Summary:\n\nI liked player cards in AtS Cycle, I did not like quests as much.\n\nI don't have Hobbits yet but I'm excited and worried about them at the same time.\n\nStop saying 'use variants' or 'don't play with X card', you guys sound like broken record.\n\nEdited October 8, 2013 by Ellareth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884718","commentId":884718,"userName":"iznax","timestamp":1381273485,"content":"To avoid any or many :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  misunderstandings, 1st i didn't say that the 3rd cycle is bad, i just thing that the other 2 and the sagas are better and 2nd i never said that Outlands are OP,broken or something like this, i just said that is one of  the most boring decks i have played in any card game (and i have played many)\n\n \n\nThanks for sharing your thoughts and sorry for my bad English ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=884723","commentId":884723,"userName":"Ellareth","timestamp":1381273833,"content":"> To avoid any or many :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  misunderstandings, 1st i didn't say that the 3rd cycle is bad, i just thing that the other 2 and the sagas are better and 2nd i never said that Outlands are OP,broken or something like this, i just said that is one of  the most boring decks i have played in any card game (and i have played many)\n> \n>  \n> \n> Thanks for sharing your thoughts and sorry for my bad English ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\n \n\nYour english is fine, didn't have any problems at all when I was reading them XD.\n\nI actually agree 3rd Cycle is weaker than other two (although for different reasons) and I wasn't trying to be offensive/defensive or anything like that (sorry if it sounded like that even in a slightest way in any possible way), just generally replying to this topic after reading the posts and (what I think is generally consensus is on) couple of threads I've read in the past."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=885018","commentId":885018,"userName":"emusand","timestamp":1381309818,"content":"> Short Summary:\n> \n> I liked player cards in AtS Cycle, I did not like quests as much.\n> \n> I don't have Hobbits yet but I'm excited and worried about them at the same time.\n> \n> Stop saying 'use variants' or 'don't play with X card', you guys sound like broken record.\n\n \n\nThere have been several complaints about that we should stop saying 'use variants', and it feels a little repetitive. To spice things up, try to use any of the following variants next time:\n\n \n\n'I don't like using house rules. Please stop telling me to do so.'\n\n'I want to play by the rules and experience the game as the developers intended, not as how you intended.'\n\nEdited October 9, 2013 by emusand"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=885170","commentId":885170,"userName":"HeavyKaragh","timestamp":1381333150,"content":"I agree that Outlanders aren't too powerfull in solo games. They are much better in multiplayer games, when other players can do most of the work at the begining.\n\n \n\nWith all those Bilbo avatars, this is like the famous Gollum vs Smeagol scene of the films.\n\n- House rule we say!\n\n- We won't! Go away!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=885320","commentId":885320,"userName":"GrandSpleen","timestamp":1381345385,"content":">  \n> \n> With all those Bilbo avatars, this is like the famous Gollum vs Smeagol scene of the films.\n> \n> - House rule we say!\n> \n> - We won't! Go away!\n\n \n\nHAH!  Love this. I was having trouble keeping up with who was saying what, also.  We need more cool LotR avatars!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=885586","commentId":885586,"userName":"JsBingley","timestamp":1381392510,"content":"I don't agree that the outlands deck is over powerful and easy building.\n\n \n\nIn solo games, the dwarves are more powerful than the outlands, because the dwarves are faster and have more hitpoint to survive in the early game. In muti-player game, outlands deck is of lack coop with the other players.\n\n \n\nWhen building decks, outlands deck will be easy to build up with all outlands ally, attachment and event when the third cycle is over, but the outlands allies in SF still work separately in some mono deck, not only in outlands deck together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=885957","commentId":885957,"userName":"Mr Coffee","timestamp":1381431564,"content":"> Honestly, why do some people let the Outlands trait bother them so much? If you don't like them, don't use them. It's as simple as that. \n> \n>  \n> \n> If you ask me; they're a brilliant creation. Great for introducing new players into the game and also great for some novice/casual gamers who don't wan't to be crushed everytime they try to play through a tough quest.\n\n \n\nAgreed, for the most part.  Good way to make a playable \"jumping in\" point for new players.  Gives an alternative to having to go back and buy a ton of stuff to create a dwarven horde (the only other \"race\" that has that many synergies).\n\n \n\n> ... I'm not bothered for Outlands' prebuilt deck, the base is 18 Ally cards + 1 Hero (+9 Leadership cards for every Outlands card in the game), that gives plenty of room for deck variants.\n\n \n\n \n\n> ... I won't argue that the player cards seem to be a mixed bag...\n\n \n\n \n\nWhile I'm not bothered by the Outlands, per se, either (they are a quick and easy deck to throw together, and still be able to add a different \"flavor\" to)... I DO think most of our \"disappointment\" in having so many of them in the cycle is that it (I guess I shouldn't speak for others... but I have a feeling that there are others that feel the same way as I do) feels like they came in at the expense of getting what we were hoping for (dare I say \"promised\"?)... and that is GONDOR.\n\n \n\nWe were anticipating getting some decent Gondorian glue to give us a good rival to the dwarves (although not in the same quantity, since the dwarves have been featured in three deluxe/saga expansions).  And quite honestly, I think if we're honest, not only didn't we NOT get the numbers of Gondorian cards we were hoping for... they haven't really been all that... interesting (if that's the right word to use)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=885983","commentId":885983,"userName":"Mr Coffee","timestamp":1381433047,"content":"Doing a quick search for Gondor cards in HoN and AtS, nets me the following:\n\n \n\nCitadel Gaurdian, Blood of Numenor, Boromir (leadership), Envoy of Pelargir, Gondorian Discipline, Gondorian Fire, Mutual Accord (as much a Rohan card as a Gondorian one), Guthlaf, Behind Strong Walls, Squire of the Citadel, Lord of Morthond (really an Outlands card), Wealth of Gondor, Gondorian Shield, Sword of Morthond (another Outlands card), Anborn, Beregond, Ithilien Archer, Caldara, Damrod, Denethor (ally), Emery, Faramir (hero), Master of Lore, Hunter of Lamedon (Outlands dude), Minas Tirith Lampwright, Errand-Rider, Knight of Minas Tirith, Pelardir Shipwright, Ithilien Tracker, Defender of Rammas, Gaurd of the Citadel, White Tower Watchmen,\n\n \n\nOther Gondorian cards from earlier sets; Steward of Gondor, Gondorian Spearman, For Gondor, Boromir (tactics), Denethor (hero), Eleanor, Faramir (ally), Prince Imrahil, Warden of Healing\n\n \n\n \n\nI may be missing a few.\n\n \n\nOf all those, only a handful even have an actual Gondorian synergy (I'm not counting just having the keyword as synergy):\n\n \n\nCitadel Custodian - cheaper for other gondorian allies in play\n\nBoromir (leadership) - Gondorian allies get +1 attack\n\nEnvoy of Pelargir - adds one resource to a Gondorian/Noble hero\n\nGondorian Discipline - cancels damage to Gondorian character\n\nGondorian Fire - attack boost for Gondorian hero\n\nGondorian Squire - adds resource to Gondorian hero\n\nSteward of Gondor - gives Gondorian trait and resources\n\nBlood of Numenor - gives Gondor/Dunedain hero defense boost\n\nFor Gondor - gives all character +1 attack, Gondorian characters and additional +1 defense\n\nMutual Accord - turns Rohan into Gondor and vice versa\n\nGuthlaf - gains sentinel if other Gondorian ally in play\n\nBehind Strong Walls - ready Gondorian defender, give +1 defense\n\nSquire of the Citadel - one resource to Gondor hero\n\nWealth of Gondor - add one resource to Gondorian hero\n\nGondorian Shield - extra defense\n\nSword of Morthond - makes Outland\n\n \n\nI may be missiong some in there... but I think that's most of them.  So basically, even though there are some really good cards that have the Gondor trait attached to them (SoG, etc), the only real \"Gondor synergies\" add one resource, give a defense/attack boost (and most of those are individual characters that work regardless of whether you are building around Gondorians or not), or makes them into another race (Rohan, Outland).\n\n \n\nReally, the only cards with \"widespread\" Gondorian benefits are leadership Boromir and... well, that may be it.  For Gondor has a decent widespread defense boost, but it is really a card for nearly any character, AND it comes from the core set!!\n\n \n\nSo we basically have gotten one universal Gondor \"synergy\" card from an entire cycle of cards that was supposed to be focused on them.\n\n \n\nAnd THAT is why I think everyone hates Outlands... lol\n\nEdited October 10, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=886019","commentId":886019,"userName":"Gizlivadi","timestamp":1381435287,"content":"That sums it up pretty well for me. I like AtS for its quests but its player cards are dissapointing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=886700","commentId":886700,"userName":"leptokurt","timestamp":1381512566,"content":"When I read the thread title I thought it was about the encounter deck's come backs t\n\n \n\n> Doing a quick search for Gondor cards in HoN and AtS, nets me the following:\n> \n>  \n> \n> Citadel Gaurdian, Blood of Numenor, Boromir (leadership), Envoy of Pelargir, Gondorian Discipline, Gondorian Fire, Mutual Accord (as much a Rohan card as a Gondorian one), Guthlaf, Behind Strong Walls, Squire of the Citadel, Lord of Morthond (really an Outlands card), Wealth of Gondor, Gondorian Shield, Sword of Morthond (another Outlands card), Anborn, Beregond, Ithilien Archer, Caldara, Damrod, Denethor (ally), Emery, Faramir (hero), Master of Lore, Hunter of Lamedon (Outlands dude), Minas Tirith Lampwright, Errand-Rider, Knight of Minas Tirith, Pelardir Shipwright, Ithilien Tracker, Defender of Rammas, Gaurd of the Citadel, White Tower Watchmen,\n> \n>  \n> \n> Other Gondorian cards from earlier sets; Steward of Gondor, Gondorian Spearman, For Gondor, Boromir (tactics), Denethor (hero), Eleanor, Faramir (ally), Prince Imrahil, Warden of Healing\n> \n>  \n> \n>  \n> \n> I may be missing a few.\n> \n>  \n> \n> Of all those, only a handful even have an actual Gondorian synergy (I'm not counting just having the keyword as synergy):\n> \n>  \n> \n> Citadel Custodian - cheaper for other gondorian allies in play\n> \n> Boromir (leadership) - Gondorian allies get +1 attack\n> \n> Envoy of Pelargir - adds one resource to a Gondorian/Noble hero\n> \n> Gondorian Discipline - cancels damage to Gondorian character\n> \n> Gondorian Fire - attack boost for Gondorian hero\n> \n> Gondorian Squire - adds resource to Gondorian hero\n> \n> Steward of Gondor - gives Gondorian trait and resources\n> \n> Blood of Numenor - gives Gondor/Dunedain hero defense boost\n> \n> For Gondor - gives all character +1 attack, Gondorian characters and additional +1 defense\n> \n> Mutual Accord - turns Rohan into Gondor and vice versa\n> \n> Guthlaf - gains sentinel if other Gondorian ally in play\n> \n> Behind Strong Walls - ready Gondorian defender, give +1 defense\n> \n> Squire of the Citadel - one resource to Gondor hero\n> \n> Wealth of Gondor - add one resource to Gondorian hero\n> \n> Gondorian Shield - extra defense\n> \n> Sword of Morthond - makes Outland\n> \n>  \n> \n> I may be missiong some in there... but I think that's most of them.  So basically, even though there are some really good cards that have the Gondor trait attached to them (SoG, etc), the only real \"Gondor synergies\" add one resource, give a defense/attack boost (and most of those are individual characters that work regardless of whether you are building around Gondorians or not), or makes them into another race (Rohan, Outland).\n> \n>  \n> \n> Really, the only cards with \"widespread\" Gondorian benefits are leadership Boromir and... well, that may be it.  For Gondor has a decent widespread defense boost, but it is really a card for nearly any character, AND it comes from the core set!!\n> \n>  \n> \n> So we basically have gotten one universal Gondor \"synergy\" card from an entire cycle of cards that was supposed to be focused on them.\n> \n>  \n> \n> And THAT is why I think everyone hates Outlands... lol\n\nDid you just post a long list of cool Gondor cards and then say that Gondor sucks? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nThere's one word that a lot of folks associate with Rohan and Dwarf decks:\n\n \n\noverpowered\n\n \n\nGood thing about Gondor is that playing such a deck requires setting priorities and thus a higher level of strategy.  Also, Gondor has some of the best synergies around. Beregond + Citadel Spear + Gondorian Shield + Behind Strong Walls gives you a double 7 DEF defender who is even able to damage his attackers. Cost: 1 resource!\n\nEdited October 11, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=886731","commentId":886731,"userName":"Mr Coffee","timestamp":1381514861,"content":"Don't get me wrong, there are good Gondorian cards (I think I mentioned that somewhere... lol).  But like I said, they are VERY individualistic in nature.  Your example above is a perfect one.  That IS a great setup/combo....  that you can play in pretty much any tactics setup if you want.  No other Gondorian cards are really needed.  I ran that with Legolas and Bard in a double-deck game yesterday without any other real Gondorian bonuses (For Gondor was in the other deck to give a board +1 attack bonus), and I ran it against the first BR encounter.  Pretty much blocked and killed Nazgul at will with those three.\n\n \n\nBut that's really my point.  It's not REALLY a Gondorian deck or synergy.  I'm in total agreement, I really don't WANT to see crazy overpowered (dwarf, etc) Dain-like bonuses.  But right now, there's very little advantage to creating a Gondor-focused deck.  Anything most of those cards do don't really REQUIRE a Gondor theme, or can be played on non-Gondorian characters (SoG), or replaced by other cards that do similar effects that don't require Gondor at all...\n\nAgain, I definitely don't want to see Gondor become just the next Dwarf horde... but if they want to create a theme for a particular group, it would be nice to see at least a few cards that truly key off of having more of those keywords (Gondor) in play... other than Boromir (and the secondary action of For Gondor), there really isn't.  It seems like a lot of what they are wanting to do with Gondor revolves around saving or gaining resources.  Okay, I can get with that.  But instead of just giving me a 1-resource rebate on allies (Envoy, the Squires, Custodian, etc) that really don't do much else for me beyond dying to big creatures, how about a REAL synergy card that keys off having those Gondor allies in play??  You want me to play a bunch of chump allies to save a penny and make that a race-synergy?  Fine, then give me a card that really drives that home and makes it worth it....\n\n \n\nExample:\n\n \n\nTaxation of Man (event- probably leadership)\n\nCost: 0  (or 1 perhaps)\n\n \n\nAction: Exhaust X Gondor allies to put X resources on a Gondor hero.\n\n \n\n \n\nThere.  Make it worth my while to play with all those Gondor allies!  Cuz right now, there's no reason to run any of them in an all-Gondor (or Gondor-heavy lineup)... outside of Boromir.\n\nEdited October 11, 2013 by benhanses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=886828","commentId":886828,"userName":"Djenni","timestamp":1381520581,"content":"> When I read the thread title I thought it was about the encounter deck's come backs t\n> \n>  \n> \n> > Doing a quick search for Gondor cards in HoN and AtS, nets me the following:\n> > \n> >  \n> > \n> > Citadel Gaurdian, Blood of Numenor, Boromir (leadership), Envoy of Pelargir, Gondorian Discipline, Gondorian Fire, Mutual Accord (as much a Rohan card as a Gondorian one), Guthlaf, Behind Strong Walls, Squire of the Citadel, Lord of Morthond (really an Outlands card), Wealth of Gondor, Gondorian Shield, Sword of Morthond (another Outlands card), Anborn, Beregond, Ithilien Archer, Caldara, Damrod, Denethor (ally), Emery, Faramir (hero), Master of Lore, Hunter of Lamedon (Outlands dude), Minas Tirith Lampwright, Errand-Rider, Knight of Minas Tirith, Pelardir Shipwright, Ithilien Tracker, Defender of Rammas, Gaurd of the Citadel, White Tower Watchmen,\n> > \n> >  \n> > \n> > Other Gondorian cards from earlier sets; Steward of Gondor, Gondorian Spearman, For Gondor, Boromir (tactics), Denethor (hero), Eleanor, Faramir (ally), Prince Imrahil, Warden of Healing\n> > \n> >  \n> > \n> >  \n> > \n> > I may be missing a few.\n> > \n> >  \n> > \n> > Of all those, only a handful even have an actual Gondorian synergy (I'm not counting just having the keyword as synergy):\n> > \n> >  \n> > \n> > Citadel Custodian - cheaper for other gondorian allies in play\n> > \n> > Boromir (leadership) - Gondorian allies get +1 attack\n> > \n> > Envoy of Pelargir - adds one resource to a Gondorian/Noble hero\n> > \n> > Gondorian Discipline - cancels damage to Gondorian character\n> > \n> > Gondorian Fire - attack boost for Gondorian hero\n> > \n> > Gondorian Squire - adds resource to Gondorian hero\n> > \n> > Steward of Gondor - gives Gondorian trait and resources\n> > \n> > Blood of Numenor - gives Gondor/Dunedain hero defense boost\n> > \n> > For Gondor - gives all character +1 attack, Gondorian characters and additional +1 defense\n> > \n> > Mutual Accord - turns Rohan into Gondor and vice versa\n> > \n> > Guthlaf - gains sentinel if other Gondorian ally in play\n> > \n> > Behind Strong Walls - ready Gondorian defender, give +1 defense\n> > \n> > Squire of the Citadel - one resource to Gondor hero\n> > \n> > Wealth of Gondor - add one resource to Gondorian hero\n> > \n> > Gondorian Shield - extra defense\n> > \n> > Sword of Morthond - makes Outland\n> > \n> >  \n> > \n> > I may be missiong some in there... but I think that's most of them.  So basically, even though there are some really good cards that have the Gondor trait attached to them (SoG, etc), the only real \"Gondor synergies\" add one resource, give a defense/attack boost (and most of those are individual characters that work regardless of whether you are building around Gondorians or not), or makes them into another race (Rohan, Outland).\n> > \n> >  \n> > \n> > Really, the only cards with \"widespread\" Gondorian benefits are leadership Boromir and... well, that may be it.  For Gondor has a decent widespread defense boost, but it is really a card for nearly any character, AND it comes from the core set!!\n> > \n> >  \n> > \n> > So we basically have gotten one universal Gondor \"synergy\" card from an entire cycle of cards that was supposed to be focused on them.\n> > \n> >  \n> > \n> > And THAT is why I think everyone hates Outlands... lol\n> \n> Did you just post a long list of cool Gondor cards and then say that Gondor sucks? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n>  \n> \n> There's one word that a lot of folks associate with Rohan and Dwarf decks:\n> \n>  \n> \n> overpowered\n> \n>  \n> \n> Good thing about Gondor is that playing such a deck requires setting priorities and thus a higher level of strategy.  Also, Gondor has some of the best synergies around. Beregond + Citadel Spear + Gondorian Shield + Behind Strong Walls gives you a double 7 DEF defender who is even able to damage his attackers. Cost: 1 resource!\n\nI don't think i've ever heard anyone say Rohan was overpowered..\n\nPerhaps after VOI but not right now, with only four \"okay\" heroes available and pretty much nothing but Rohan spirit cards it's still a long way to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=886967","commentId":886967,"userName":"iznax","timestamp":1381533171,"content":"New topic name, Outland VS Gondor :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] and yes i never heard the OP Rohan thing to :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png] the new Guthlaf Ally will be a good reason to try and build a Gondor/Rohan deck tho :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=887069","commentId":887069,"userName":"Nickpes","timestamp":1381554356,"content":">  \n> \n>  \n> \n> So we basically have gotten one universal Gondor \"synergy\" card from an entire cycle of cards that was supposed to be focused on them.\n> \n>  \n> \n> And THAT is why I think everyone hates Outlands... lol\n\n \n\nI agree with your post and especially with the above part !!! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=887070","commentId":887070,"userName":"Nickpes","timestamp":1381554455,"content":">  \n> \n> There's one word that a lot of folks associate with Rohan and Dwarf decks:\n> \n>  \n> \n> overpowered\n> \n>  \n\n \n\nThe Rohan thing must be a joke right ?  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/91736-a-great-come-back/?do=findComment&comment=887300","commentId":887300,"userName":"leptokurt","timestamp":1381598942,"content":"Rohan decks were overpowered when they came out during the Mirkwood cycle. Everyone and their mum was playing them to get easy victories. And that was my point. They're still strong, I guess, but it's hard to tell since I never played them myself.\n\n \n\nGondo, however, is well done. Hope they continue to create themes like that. Rohan and Outlands were boring, Dwarfs were cool but became quickly too strong. Elves are another good example of how to build a thematic deck. Hobbits also look good so far. Eagles were cool but suffered from belonging to thet tactics sphere (man I would like to see an eagle from time to time that is not tactics)."}]}