{"url":"https://community.fantasyflightgames.com/topic/91844-concerning-fast-hitch/","title":"Concerning &quot;Fast Hitch&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/91844-concerning-fast-hitch/?do=findComment&comment=885681","commentId":885681,"userName":"American Dragon","timestamp":1381410181,"content":"I feel kind of stupid for asking this, but I just wanted make sure I was doing the right thing.\n\n \n\nI was playing the first scenario of the Black Riders with my Hobbit deck. All 4 of my heroes (BR Frodo, Sam, BR Pippin, and Merry) were exhausted for questing. A location came off of the encounter deck. I had \"Short Cut\" in my hand, and I had two \"Fast Hitches\" on the board. Could I then exhaust one of them to ready my hobbit hero so I could activate \"Short Cut?\" "},{"commentUrl":"https://community.fantasyflightgames.com/topic/91844-concerning-fast-hitch/?do=findComment&comment=885698","commentId":885698,"userName":"alogos","timestamp":1381411552,"content":"You can only play response during the staging phase.\n\n \n\nYou can play action before and after revealing all the cards, but if you want to play a response that occures during the staging phase, you cannot combine it with an action (fast hitch).\n\nSo you should use fast hitch action after commiting to quest and before revealing cards if you want to play shortcut.\n\n \n\nThe exception that exists is when an enemy revealed attacks as is \"when revealed\" effect, because it create a combat phase where you can play action. (And Bilbo's Magic Ring that say \"Action : When answering a riddle\"... but hey ! it's a Magic Ring after all)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/91844-concerning-fast-hitch/?do=findComment&comment=888468","commentId":888468,"userName":"richsabre","timestamp":1381768369,"content":"to the above...you can also play responses at any time, as long as the card is fulfilled- ie ...'response: after an enemy attacks' would not be in the staging area\n\nrich"}]}