{"url":"https://community.fantasyflightgames.com/topic/92017-questions-about-the-elf-twins-and-some-attachments/","title":"Questions about the elf twins and some attachments","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92017-questions-about-the-elf-twins-and-some-attachments/?do=findComment&comment=887964","commentId":887964,"userName":"Olorin93","timestamp":1381699019,"content":"Elladan and Elrohir have similar abilities - both can pay 1 resource to ready after being declared an attacker or defender respectively. However - does this mean you can only ready Elrohir to attack with him, or can you actually ready him and defend twice, and also attack twice with Elladan? I suppose the latter must be the case, as I otherwise don't really see the point of having him readied after attacking.\n\n \n\nAnd as for the Rivendell Blade attachment - it is Restricted, which I think means I can only have 2 on the same character. Do they stack (i.e. give the defending enemy -4 DEF)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92017-questions-about-the-elf-twins-and-some-attachments/?do=findComment&comment=887976","commentId":887976,"userName":"Tracker1","timestamp":1381700963,"content":"Elrohir can defend twice, or as many times as you have resources to use. It is really nice to be able to have him attack too. Steward of Gondor is a must for him to get the full use of his ability. Recently i have been setting up the Brothers with Ranger Bows so they can defend/attack/ ready, and then deal two damage to an enemy in the staging area.\n\nRivendell Blades do stack, so if you get 2 on the tactics brother then it's -4 def to the enemy.\n\nAlso, if you run a deck with SoG on Elrohir, through in a Gondorian Shield, which will get him to 5 def."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92017-questions-about-the-elf-twins-and-some-attachments/?do=findComment&comment=888216","commentId":888216,"userName":"Olorin93","timestamp":1381738293,"content":"Thank you! That's what I figured, but I wasn't sure. As for Steward of Gondor and Gondorian Shield - I do see the point, and I will probably yield sooner or later, but the theme is very important when I build decks and I often sacrifice badass combos for credibility. Like, Elrond wouldn't bring along a Defender of Rammas, or Merry wouldn't know how to call on Landroval. I often combine elves with Arnor rangers. As for Gondor cards... I don't know. I'm sure you could make killer decks, though."}]}