{"url":"https://community.fantasyflightgames.com/topic/92060-gandalf-vs-the-nine-are-abroad-question-has-a-spoiler-concerning-a-card-in-the-black-riders/","title":"Gandalf vs. The Nine (are abroad)... **question has a SPOILER concerning a card in the Black Riders**","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92060-gandalf-vs-the-nine-are-abroad-question-has-a-spoiler-concerning-a-card-in-the-black-riders/?do=findComment&comment=888563","commentId":888563,"userName":"Mr Coffee","timestamp":1381774828,"content":"Apologies if this is posted elsewhere and if I'm just not seeing it...My compy is down, and I tried to scroll through on my phone and see if this was anywhere else... oh well.\n\nSo the encounter card, \"The Nine Are Abroad\", has the following text:\n\n\"When Revealed: Treat the text box of each character in play as blank (except for Traits) until the end of the round. If there is a Nazgul enemy in the staging area, The Nine are Abroad gains surge.\"\n\nThe core Gandalf has this in his text box:\n\n\"At the end of the round, discard Gandalf from play.\"\n\nSo as I was playing last night, I had Gandalf in play when TNAA got flipped from the encounter deck. So the question that hit me was, if Gandalf's text box is \"blank until the end of the round\", does this mean that I don't have to discard him? Both effects trigger based on the \"end of the round\". Which triggers first?? Gandalf gaining his text back? Or him being discarded? Is this one of those \"simultaneous\" events that the first player chooses which happens first? DO I GET TO KEEP GANDALF FOR A BONUS TURN FOR FREE??? My thought is this. The \"end of the round\" happens, affecting both cards at the exact same time. Gandalf's text is invalid as long as the round is still happening. He doesn't regain the \"discard\" text until after the end of the round and TNAA's effect has resolved. At that point, the \"end of the round\" has already occurred, so when he regains his effect, he shouldn't have to discard now until the next time there is an \"end of the round\". Does my line of thinking make sense to anyone else? Or am I just suffering from to much wizard-love??\n\nJust to be safe, I took the harder route and still discarded him. But I knew I was going to.post this question first thing today.... did I play it right or wrong? Should I have been able to keep Gandalf for the next round?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92060-gandalf-vs-the-nine-are-abroad-question-has-a-spoiler-concerning-a-card-in-the-black-riders/?do=findComment&comment=888564","commentId":888564,"userName":"Mr Coffee","timestamp":1381774924,"content":"Sigh.... and of course, I managed a double-post. Apologies for that, too....\n\n... stupid compy."}]}