{"url":"https://community.fantasyflightgames.com/topic/92086-what-to-purchase-first/","title":"What to purchase first?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92086-what-to-purchase-first/?do=findComment&comment=888938","commentId":888938,"userName":"Xandaroth","timestamp":1381812787,"content":"So far my understanding of the game's distribution is this:\n\n \n\nAdventure Packs: Quest content with small bits of exclusive content for heroes and encounters\n\n \n\nDeluxe Expansions: Premium sets containing interchangeable content that can be used with any Adventure Pack\n\n \n\nSaga Expansions: Premium sets containing quest, hero and encounter content that directly associates with the LOTR story and its protagonists\n\n \n\nSo if I have this down correctly... assuming I do want to purchase all of the game's content over time and try to maintain a \"complete experience\" feel to things, should I begin with a Core Set and the three Deluxe Expansions, then purchase the Adventure Packs chronologically over time to keep the experience feeling \"episodic\"? The Saga eExpansions intrigue me but since those follow the LOTR story more directly, I'm anticipating a slightly more linear narrative and I'd want that experience saved for the very end.\n\n \n\nCan anyone who's played the game's expanded content do me a huge favor and let me know if I have the right understanding of this? I'd really appreciate it. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAlso, what are players doing for a more \"hardcore survival\" replayability mode? I saw something about Nightmare Decks but is that simply a type of retail deck or is that a game mode that can be used with any of the game's quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92086-what-to-purchase-first/?do=findComment&comment=888962","commentId":888962,"userName":"timbolton","timestamp":1381816289,"content":"Just a quick reply (have to go out to work)...\n\n \n\nThe APs work with their associated Deluxe expansion, so I believe you need the Deluxe expansion FIRST and then the associated AP sets.\n\nThere are three Saga expansions - two are associated with the Hobbit book, not LOTR, just the recent Black Riders set does that.\n\n \n\nYou also have two other sets - the Gen Con standalone packs (need main box) and the Nightmare sets - which I think you need the main set and the original AP the nightmare set is based on. Both of these types (Gen Con and Nightmare) are Print on Demand sets - you order a set to be printed for yourself, though some shops have ordered copies in for themselves to sell."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92086-what-to-purchase-first/?do=findComment&comment=888969","commentId":888969,"userName":"Nerdmeister","timestamp":1381816971,"content":"Credit for the following goes to richsabre, who comprised it in another thread:\n\n \n\n----------------------------------------------------------------------------------------------------------------------------------------------------\n\nmirkwood cycle needs = none...just core set\n\ndwarrowdelf cycle needs = khazad dum\n\nagainst the shadow cycle needs = hiers of numenor\n\n \n\nthat is all that is out at the moment\n\n \n\nhere is the list in order of what i got them (i have played since core set release so these are correct)\n\n \n\ncore set\n\nMIRKWOOD CYCLE\n\nhunt for gollum\n\nconflcit at the carrock\n\njourney to rhosgobel\n\nemyn muil\n\ndead marshes\n\nreturn to mirkwood\n\n \n\nkhazad dum deluxe\n\nDWARROWDELF CYCLE\n\nredhorn gate\n\nroad to rivendell\n\nwatcher in the water\n\nthe long dark\n\nfoundations of stone\n\nshadow and flame\n\n \n\nhobbit saga pack 1 and 2 (these were released one before and one after the follow pack i list in the uk...it doesnt really matter here as saga packs dont follow any order compared to the expansions)\n\n \n\nHiers of numenor deluxe\n\nAGAINST THE SHADOW CYCLE\n\nthe stewards fear\n\nthe druadan forest\n\nencounter at amon din\n\nassault on osgilliath\n\nblood of gondor (not out yet)\n\nmorgul vale (not out yet)\n\n \n\nBlack riders (lord of the rings saga pack 1) is out....again in between a cycle but again it doesnt matter as it saga pack\n\n------------------------------------------------------------------------------------------------------------------------------------------------------\n\n \n\nFor replayability try the hardcore mode as described at the end of the rulebook.\n\nIf you don´t mind spending a bit more cash you could also get the hardcore PoD releases with tougher cards to replace some of the cards from the original quests. Though be aware that they make the quests ALOT harder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92086-what-to-purchase-first/?do=findComment&comment=888974","commentId":888974,"userName":"Xandaroth","timestamp":1381818756,"content":"Oh wow, it's a good thing I asked! Thanks, guys. I can budget my LOTR acquisition now! Lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92086-what-to-purchase-first/?do=findComment&comment=896947","commentId":896947,"userName":"pobolycwm","timestamp":1382791164,"content":"many thanks as it saves me asking. play starwars lcg myself, this is for my daughters who are lotr mad my only input in this one is trading pocket money for credit card usage to buy an add on or 2 each month :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]   mind you i may get sucked into a game or 5"}]}