{"url":"https://community.fantasyflightgames.com/topic/92093-one-more-question/","title":"One more question!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889059","commentId":889059,"userName":"Xandaroth","timestamp":1381831015,"content":"I noticed some of the game's expansions are scheduled for reprint and there's an \"Updated!\" banner in blue wrapped around the picture. I just read through the errata PDF in the support section, so you probably know what I'm about to ask.\n\n \n\nDoes that \"Updated!\" banner mean the item is being reprinted with changes? If so, is there a way to tell which sets or packs FFG intends to reprint with errata changes?\n\n \n\nAnd finally, the biggest question of them all: Are any of the expansions or packs suffering game-breaking errata issues that would force me to need the website's errata FAQ document or is it all nothing a little bit of thinking doesn't fix?\n\n \n\nI'm normally pretty good with errata and applying the right meanings to jargon in games, but consulting a PDF file every 5 minutes is a mood killer! If there's no reason for me to wait for reprints then I might be ready to dive in :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited October 15, 2013 by Xandaroth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889074","commentId":889074,"userName":"richsabre","timestamp":1381834076,"content":"the updates are errata - there really isnt much that has been changed. several were rather annoyingly changed due to only a few gamers purposely seeking out new ways to break the game (others will not see it this way) however errata in this game can be split into\n\n-those that you should take note of, due to their effects automatically, or at leat mostly unbalancing the game (such as rules changes of encounter cards, game set up)\n\n-those you should only take note of if you really cannot help but build the 'game breaking' decks out there....i.e. if you put the errated card in a normal deck its fine but if you look up zigil miner game breaker deck, then you will need to errata him\n\n \n\nof course all errata is official. i personally go by all the errata in the game as i am like that, but some you will not even notice.\n\n \n\nas for if the quests need constant referring to, this is not much of a problem. the FAQ is not that long and most of it is just that -the FAQ.\n\nwhen a quest has been errated it is becuase it is to fix a bug coming up in a certain instance, such as block wargs in ithillien.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889088","commentId":889088,"userName":"Xandaroth","timestamp":1381836296,"content":"Hmmm. Would you say it's relatively safe to just buy as the budget allows and not worry about it? For the most part it sounds like the errata issues in the game can just be ignored and the game holds up just fine. It's true, I don't number crunch or try to find exploits, so as long as it's not like what you said about setup or encounter card text... I can probably just play it out of the box and have fun just fine. Is that the case?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889161","commentId":889161,"userName":"richsabre","timestamp":1381845999,"content":"yes its fine- most of the time you will not notice it. for instance the block wargs got errated because of a continous loop that occured when they were the only 2 cards left in the encounter deck. with the card saying shuffle back in and surge then it was broken.\n\n \n\nhowever this is a rare occurance for this quest. i have played thousands of games of lotr lcg and have never had what i call a truely game breaking experience that i felt i need to refer to the errata for.\n\n \n\nyou may even want to ignore some errata. zigil miner is pretty rubbish with it, and thrors key is also useless. others like protector of lorien were limited to a certain number of uses per turn because it was considered too powerful. however if you are struggling you may want to keep the old ruling until you get more cards ,this way you have another power card to draw on\n\n \n\nin short if you never look at the errata you will be fine.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889537","commentId":889537,"userName":"Xandaroth","timestamp":1381877663,"content":"Well that solves it! Gloves are coming off and it's time to save Middle Earth.\n\n \n\nThanks for answering my questions. See you guys in Mordor!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889568","commentId":889568,"userName":"ricedwlit","timestamp":1381880744,"content":">  and thrors key is also useless. \n\nI'm unaware of any errata for Thror's Key.  Perhaps you meant Thror's Map? If so, I agree, is not as useful post errata."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889723","commentId":889723,"userName":"Nerdmeister","timestamp":1381907737,"content":"Thror´s Map can still be useful if you´re at a bad location. I´d agree that it has lost it´s intended purpose with the errata even if it was too powerful.\n\nCould still have retained some of it´s purpose if you were allowed to use it in any phase except quest phase or something along those lines."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=889777","commentId":889777,"userName":"richsabre","timestamp":1381919537,"content":"ah yes- the map is what i meant. the key i love.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=890518","commentId":890518,"userName":"ricedwlit","timestamp":1381983399,"content":"> ah yes- the map is what i meant. the key i love.\n> \n> rich\n\nThe key is fast becoming a must include for me for quests with particularly nasty locations. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92093-one-more-question/?do=findComment&comment=895280","commentId":895280,"userName":"koriakin97","timestamp":1382555016,"content":"Map might be useful when you play thematic dvarven deck (without Asfaloth and northern tracker) and scenario has some nasty travel effects (like necromancer's pass)"}]}