{"url":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/","title":"10 things before the game dies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889782","commentId":889782,"userName":"richsabre","timestamp":1381920933,"content":"the forum seems a little quiet at the moment so i thought we could all have a speculate..\n\n \n\ni know there has been similar threads to these, but in this one i would really like to know your 10 things that you want to see in this game before it dies (may the day never come.... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\n \n\nby this i mean anything that were it not developed by the time the game ends, you would feel very dissapointed\n\n \n\nhere are my 10. they can be in order or not. these are random\n\n \n\n1. shire/bree cycle. i have wanted this from the start. i am part way there with black riders but i need more to feed my shire fix\n\n \n\n2.old forest/barrow downs quest. probably will be in number 1. i would much rather they not be POD quests but those beautiful shiny cards....yummy\n\n \n\n3.durthang (castle in mordor for those not well versed on the book) quest. that place has always fascinated me as there is barely any text on it. it would be nice to have a look round it\n\n \n\n4.another dwarven cycle. ...i know....i admit it, i am a dwarven addict. i cannot help but love them haha. i know many wish to never see their beards again, but i feel there is room for a ered luin cycle, or an erebor cycle. heroes perhaps would be scarce but its going to happen at some point\n\n \n\n5.not so quest-y quests. quests that are more light hearted in that they involve no peril. for LOTRO players im thinking of the festival quests. for those who havnt played lotro they are sort of quests where you look for things, rescue hobbits from hilarious situations, throw pies at people....ok..that last one would make a stupid quest, but i think some sort of light quest based around an errand in the shire would be good\n\n \n\n6. cavalry charge mechanics. if it will be anywhere it will be the next cycle. i want some sort of charge mechanic that can kill multiple enemies engaged with you but comes at great cost.\n\n \n\n7. 'building' sub cards. we have allies, attatchments and events but id also llike to see 'architecture' cards or something similar. they could function similar to enemy buildings in siege mode, by having hit points and lowering the threat in the staging area or something\n\n \n\n8. art book. there was a thread recently but it has been asked for since only a few months after the game's release. the art is amazing- lets celebrate it.\n\n \n\n9. other merchendice - who wouldnt want their morning cofffee out of a lotr lcg mug on a lotr lcg mug mat?\n\n \n\n10. promise of more.....a rather strange one to end with, however before the designers end this game for good, i really want at least some sort of teaser of a 'spin off' game or something. i mean lets hope it doesnt end for a long time, but when it does id like to see a similar game with solo aspects that we can all get our lotr fix out of\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889833","commentId":889833,"userName":"13thcaesar","timestamp":1381929147,"content":"1. Battle of Lorien \n\n2. Batlle of Dale\n\n3. Batlle of Dol Guldur\n\n4. Battle of Mirkwood\n\n \n\npreferably in a one cycle ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\n \n\n5. Galadriela hero\n\n \n\n6. Old Forest/Barrows Down quest. \n\n \n\n7. lotr mat, and big map with mark all release quests - can be mat-map ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] \n\n \n\nfor now I have only 7 ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889846","commentId":889846,"userName":"Djenni","timestamp":1381930270,"content":"there's just so much i'd like to see in this game, this is tough. But i guess my list would go something like this in no particular order:\n\n \n\n1. Galadriel Hero.\n\n \n\n2. Barrow Downs/Old forest quests.\n\n \n\n3. Iron Hills dwarf Deluxe expansion would be really cool.\n\n \n\n4. Siege of Minas Tirith and Helm's Deep in a LOTR saga expansion.\n\n \n\n5. Some Harad quests that take place south of Gondor in the desert.\n\n \n\n6. White Council - Dol Guldur quests\n\n \n\n7. More Noldor/Silvan cards\n\n \n\n8. More quests and expansions/cycles that take place outside of the main focus points of the lotr books, you know so we can get to explore more locations and stuff that we didn't get to see in the movies or the books like Angmar or Gundabad for example.\n\n \n\n9. Members of the fellowship as allies, so that in future saga expansions you can have the entire fellowship in play at the same time with only one or two players.\n\n \n\n10. Uruk Hai enemies, i just can't wait to start slicing up some Uruk Hai at Amon Hen.\n\nEdited October 16, 2013 by Djenni"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889856","commentId":889856,"userName":"13thcaesar","timestamp":1381931127,"content":"\n\n \n\n\n8. consequences flowing from the AP to the next AP in  the cycle. for example, if on one AP will not kill the boss and he will flee (Time keyword from Voice On Isengard),  will return stronger in the next AP (if you do not kill him in the previous AP in the new you must shuffles  stronger card this boss  to ED).\n\nOr in one AP you have to choose a Quest card (as in Passage Through Mirkwood quest card 3 ).  and  you must  start from  one quest card with two  in the following AP depending on what path you followed in the previous AP.\n\nor if you not save someone (die some Ally-objective in one AP in the next AP removing his card from the ED.) something like that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889857","commentId":889857,"userName":"Noccus","timestamp":1381931135,"content":">  \n> \n>  \n> \n> 7. 'building' sub cards. we have allies, attatchments and events but id also llike to see 'architecture' cards or something similar. they could function similar to enemy buildings in siege mode, by having hit points and lowering the threat in the staging area or something\n> \n>  \n> \n>  \n> \n>  \n> \n>  \n> \n> I like this. Creative thought!\n> \n>  \n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889867","commentId":889867,"userName":"13thcaesar","timestamp":1381932074,"content":"cavalry charge mechanics. if it will be anywhere it will be the next cycle. i want some sort of charge mechanic that can kill multiple enemies engaged with you but comes at great cost.\n\n \n\n I like this idea. this card does not have to have a high cost, just restriction -  for example - exhaust  X characters with attached  mount card - you can attack X enemies engaged with you. Attack adding these characters against each of these enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889879","commentId":889879,"userName":"richsabre","timestamp":1381933448,"content":"thanks for all the ideas....nice to see so many fresh thoughts on the game.\n\ni particularly like hightened consequences. i see the designers going for a more narrative feel in the current cycle with the story inserts and of course campaign mode...and this i believe has been well recieved, not just from the 'theme-ys' like myself. this was something asked for early in the game anyways\n\n \n\ni think going even further would be nice...but the trouble is more complex role play style mechanics means just that- it turns more into a role play. i love rp games but they arent for everyone i guess. perhaps this could be the idea for a sub game in ffg's future?\n\n \n\n@Djenni - i love uruk hai......and oh yes, i see you're from iceland- i am particularly jealous you have Sigur Ros on your doorstep ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nrich\n\nEdited October 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889916","commentId":889916,"userName":"13thcaesar","timestamp":1381936741,"content":"Note spoiler! I admit that after the previews for  Against Shadow cycle in which Caleb Grace wrote that: \"Taken together, the Adventure Packs tell a grand story full of intrigue ...\" - When in  the AP Stewart's Fear turned out that the mastermind of the nameless cabal managed to escape the city before his true identity was revealed, I start  speculated that  the mastermind of cabal is the Lord Alcaron who succumbed to the temptation to the enemy. when we meet him in AP Encounter at Amon Din I believed that he commanded from hide enemy's attacks, and when  arrived the Heroes would not be discovered\" helped \"in defense of the villages. I believed that Lord Alcaron  special lead army of Gondor to the Morgul Vale in last AP right into the trap, and then, when he  have on his side  the Nazgul reveals his face, and comes against the heroes.\n\n \n\nstory turned out differently :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]   but would be good if introduced by phrases such action - that  actions in the style RPG would be cool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889928","commentId":889928,"userName":"richsabre","timestamp":1381937881,"content":"noted- though i have to say that if i were to spoiler alert everything i say in a thread like this, either i couldnt say much at all, or every other word would be SPOILER ALERT!!\n\n \n\nif i have spoiled anything i apologise\n\nrich\n\nEdited October 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889933","commentId":889933,"userName":"Nickpes","timestamp":1381938136,"content":"A first age saga ... Ok maybe i am the only one on this but i would love it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889935","commentId":889935,"userName":"13thcaesar","timestamp":1381938475,"content":"> noted- though i have to say that if i were to spoiler alert everything i say in a thread like this, either i couldnt say much at all, or every other word would be SPOILER ALERT!!\n> \n>  \n> \n> if i have spoiled anything i apologise\n> \n> rich\n\n \n\nYou know better be careful ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  - someone later write, \"why did not you warn that this post contains a spoiler, I have not played yet in  this cycle and you've ruined everything. well as, I write two words and I have a clear conscience hehe  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889945","commentId":889945,"userName":"richsabre","timestamp":1381938908,"content":"@13th caesar\n\nwait a minute- i just want to check. was your 'note spoiler' in regards to my post or yours? im confused haha. i thought it was in regards to something i wrote so took it out\n\n \n\n@nickpes- youre probably not the only one!\n\nEdited October 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889954","commentId":889954,"userName":"13thcaesar","timestamp":1381939876,"content":"> @13th caesar\n> \n> wait a minute- i just want to check. was your 'note spoiler' in regards to my post or yours? im confused haha. i thought it was in regards to something i wrote so took it out\n> \n>  \n> \n> @nickpes- youre probably not the only one!\n\nto mine. You know can not all have yet Against the Shadow cycle - and I betrayed the mastermind of cabal escape, and the Lord Alcaron  will return in Encounter at Amon Din  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] aha this is SPOILER too  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] but its too late - so I apologise  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited October 16, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889959","commentId":889959,"userName":"leptokurt","timestamp":1381940139,"content":"> i know there has been similar threads to these, but in this one i would really like to know your 10 things that you want to see in this game before it dies (may the day never come.... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n> \n>  \n> \n> by this i mean anything that were it not developed by the time the game ends, you would feel very dissapointed\n> \n>  \n> \n>  \n\n \n\nproper translation\n\nEdited October 16, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889963","commentId":889963,"userName":"13thcaesar","timestamp":1381940351,"content":"> proper translation\n\nyes i know my english is terrible"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889964","commentId":889964,"userName":"Gizlivadi","timestamp":1381940423,"content":"1 - Barrow-downs/Old Forest.  I think I'm not the only one who wants this. People were dissapointed not to see it in BR, but a couple AP's about this in a future cycle should do.\n\n \n\n2 - The East (Harad, Rhun, etc). A full cycle set in this area would be awesome.\n\n \n\n3 - Blue Wizards. I do believe we'll eventually see them.\n\n \n\n4 - \"Choose your own adventure\" type quests. Similar to those books, there's a first stage that you must complete, and then you can choose the next one according to the strengths of your own deck \"Do you want to follow X's advide and hide from the enemy (go to stage 2a), or will you take the enemy head-on (go to stage 3a)?\" or something like that. One could be a battle quest while the other can be a sneaky quest, and story-wise you can take completely different routes but still reach the final quest stage. Much like FoS, but not randomized.\n\n \n\n5 - More dwarven stuff, like new locations such as the Blue Mountains or the Iron Hills, dwarven rings of power, etc\n\n \n\nI'll add more as they come to mind."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889967","commentId":889967,"userName":"Distractionbeast","timestamp":1381940589,"content":" 1. Full Silmarillion content (What would a hero Turin be like?)\n\n\n\nMore Noldor / Silvan\n\n\n\nMore Dunedain\n\n\n\nEnts and Huorns\n\n\n\nSimple quests that feature deep gameplay (fewer complicated rules like multiple encounter decks and comparing first letters of card names)\n\n\n\nQuests in lesser-known parts of Middle-Earth:  Umbar, Fornost, the far east, etc.\n\n\n\nMore lesser-known heroes from the books or brand new.  I like the idea of \"ordinary folk\" standing with the big names from the ring era.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889972","commentId":889972,"userName":"Nickpes","timestamp":1381940701,"content":">  \n> \n> @nickpes- youre probably not the only one!\n> \n>  \n\n \n\nIMO the problem is that none of the characters already in game (ok, let apart Elrond,Glorfindel, Gandalf and maybe Gildor since the birth date of him is supposed in first age but uknown) were not there in first age, thus for a proper game there should be too many heroes introduced.\n\n \n\nBut there are so many to choose ... and most of them with history filled with drama, pain and dispair  ... and offcourse Fingolfin the true hero of middle earth  :wub: [//content.invisioncic.com/Mfantflight/emoticons/default_wub.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889973","commentId":889973,"userName":"Gizlivadi","timestamp":1381940763,"content":">  \n> \n>  1. Simple quests that feature deep gameplay (fewer complicated rules like multiple encounter decks and comparing first letters of card names)\n> \n>  \n\n \n\nExcellent point!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889983","commentId":889983,"userName":"13thcaesar","timestamp":1381941421,"content":"> 1 - Barrow-downs/Old Forest.  I think I'm not the only one who wants this. People were dissapointed not to see it in BR, but a couple AP's about this in a future cycle should do.\n> \n>  \n\nYes, I think that everyone was disappointed to skip this topic in the Black Riders expansion. Skip it in the movie, but our favorite game is based on the book so I expected that we will have a quest associated with the thread.\n\n \n\nI hope that we will be able to visit these sites in the future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=889985","commentId":889985,"userName":"Nickpes","timestamp":1381941490,"content":">  \n> \n>  1. Full Silmarillion content (What would a hero Turin be like?)\n\nEach round he should raise his threat by one on his own to beggin with  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890161","commentId":890161,"userName":"player1761766","timestamp":1381953346,"content":"Initially I thought this would be an easy topic because there is so much stuff that I enjoy in Middle Earth, but then I realised the game now includes (or will include, barring any major catastrophe) a huge chunk of what I want, so I don't know if I'll be able to get a full 10, but let's see:\n\n \n\n1) Quest-y quests are a great idea. While fighting has its place, it isn't the main focus for the books (unless you think in grand terms of the fight of good versus evil), people aren't shooting arrows and slitting throats on every single page. We need more expansive quests of discovery, intrigue, and general rambling. This isn't Warhammer! \n\n \n\n2) Rhun. The East. Well, anything foreign in that respect! Just what is in that Sea of Rhun? Who lives in the forest that skirts its shores? And in those mountains that shield it from the west? What's going on there that we need to know about? What are those two other Istari getting up to over there?! \n\n \n\n3) While I'm dealing with the extremes of the map, what about Ered Luin? And what's to be discovered at the Icebay of Forochel? \n\n \n\n4) While 2, and certainly 3, are mere pipe-dreams, I think Angmar would make a fine addition to the game, and would be very disappointed if we didn't see some sort of expansion take in this area. When (if?) the game moves to the Cthulhu-distribution of one deluxe per quarter, I would like to see an Angmar box. Not sure if I could cope with a sustained cycle of nine quests up here, unless of course it took in a much wider area. \n\n \n\n5) I would like to see Lothlorien cards. I'm not precisely sure how this could be implemented - I don't know if it'd be viable to feature in the next saga expansion given as how nothing adventure-y actually takes place here, but I would be highly aggrieved if we got five years or more into the game without anything more to show for it than a mere handful of cards.\n\n \n\n6) Rich, I feel like I might be copying you a bit too much here, but I've been hoping for location cards for us heroes as well for a long while now. Something that grants a boon while it is in play but can take damage from undefended attacks or something. \n\n \n\nThis appears to be it for now. Weathertop, Saruman, Isengard, 'record' cards, more Osgiliath, and the Mouth of Sauron are all things that I've been desperate to see, and it seems that by the end of the year I'll have everything I've ever wanted for the game! Well, aside from the above six, but I can kinda wait for those to show up..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890174","commentId":890174,"userName":"richsabre","timestamp":1381954519,"content":"i would love to see those locations spalanzani. i keep referring to LOTRO whenever i talk about 'fellowship un-visited' locations, but i think its a good example of just how much there is to play with out there....remnants of evil spirits in angmar, goblins on the march in ered luin, bandits on the greenway.\n\n \n\nwhat i personally think is a good idea is a 'hunt for the lost palantiri' ...perhaps the one lost in forochel could have fell into the hands of the native population and its a race to recover it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890194","commentId":890194,"userName":"player1761766","timestamp":1381956021,"content":"> what i personally think is a good idea is a 'hunt for the lost palantiri' ...perhaps the one lost in forochel could have fell into the hands of the native population and its a race to recover it?\n\n \n\nI'd like to see a sort of battle of wills going on, almost, as you try to persuade the natives to hand it over. Using willpower instead of attack strength when resolving combat, much like 3B of Druadan Forest. When you 'defeat' an enemy like this, they go into the victory display, and when you have a prescribed amount in there, you win. However, undefended attacks, or maybe even for every point of 'damage' enemies do to you, cards leave the victory display. Maybe.\n\n \n\n*palpitations*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890233","commentId":890233,"userName":"Mr Coffee","timestamp":1381958666,"content":">  \n> \n> yes i know my english is terrible\n> \n> proper translation\n> \n>  \n\nCaeser, I think he was meaning that he wanted to see \"proper translation\" on the game cards.  There has been much discussion about how some of the terms, keywords, etc get translated into some of the non-English languages and how it can possibly affect gameplay.\n\nI doubt anyone is seriously going to criticize each others language abilities on here... this is a pretty encompassing community that is well represented by non-native-English speakers.  I would say that 99% of us have little or no problem figuring out what everyone is trying to say!\n\n \n\n>  \n> \n>  1. Full Silmarillion content (What would a hero Turin be like?)\n> \n>  \n\nYes!  I know there's a licensing issue, but holy heck!  Please make this happen.  Turin is my all-time favorite Tolkien character... I would never build a fellowship without him if I had him available... lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890242","commentId":890242,"userName":"Mr Coffee","timestamp":1381959113,"content":"Not sure I can come up with 10 off the top of my head, but some of mine have already been mentioned:\n\n \n\n1) Silmarillion/first-age/second-age stuff.  If I got this, I wouldn't include a single other item on my list.  PLEASE SANTA!!!\n\n \n\n2)  Angmar/Arnor/ area... specifically, a cycle depicting the fall of the Northern Kingdom and the later defeat of the Witch King (Even IF it meant a third Glorfindel hero... lol).\n\n \n\n3)  Treasure items (or \"named\" weapons/artifacts) outside the sagas.  Yeah, we have STWB and Asfaloth.... but where's Sting, Glamdring, Andruil, Phial of Galadriel, etc...?  Even some unnamed (but familiar) items like a mithril shirt, etc would be nice!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890275","commentId":890275,"userName":"leptokurt","timestamp":1381961570,"content":">  \n> \n> Caeser, I think he was meaning that he wanted to see \"proper translation\" on the game cards.  There has been much discussion about how some of the terms, keywords, etc get translated into some of the non-English languages and how it can possibly affect gameplay.\n> \n> I doubt anyone is seriously going to criticize each others language abilities on here... this is a pretty encompassing community that is well represented by non-native-English speakers.  I would say that 99% of us have little or no problem figuring out what everyone is trying to say!\n> \n>  \n\nYep, I was refering to bad translations by lazy translators. I don't have any problems to read posts in this forum. I can even see the little cute hearts that Glaurung is painting over each \"i\". ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890297","commentId":890297,"userName":"richsabre","timestamp":1381962727,"content":"haahahahaaha i love this forum- the only place that things can be said without ending up into all out war\n\nand for those who struggle with english posting- its still probably better than mine, and i am english ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890302","commentId":890302,"userName":"Cunir","timestamp":1381963066,"content":"Only two things I would like...\n\n1) as long as we get all the way to mordor and finish The Lord of the rings story, I will be happy.\n\n2) I hope they come out with some revised rules for solo play at some point. They have already come up with new rules for easy play, so it's not all wishful thinking. If they can come up with a way for solo players to use more heroes, so we don't have to play two-handed, and can think of a way for us to use sentinel and ranged (other than with a few event cards) would be great"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890303","commentId":890303,"userName":"richsabre","timestamp":1381963401,"content":"> Only two things I would like...\n> \n> 1) as long as we get all the way to mordor and finish The Lord of the rings story, I will be happy.\n> \n> 2) I hope they come out with some revised rules for solo play at some point. They have already come up with new rules for easy play, so it's not all wishful thinking. If they can come up with a way for solo players to use more heroes, so we don't have to play two-handed, and can think of a way for us to use sentinel and ranged (other than with a few event cards) would be great\n\n1. i am sure they will get us to morder, if not further...though the debate about anti climatic endings is of course another topic. personally im happy to have saga end then explore further areas ignoring that sauron has fallen (though we could go back in time). in any case the game only has to last at most another 3 years for that to happen, and i see some of ffg's lcg are around that age anyways.\n\n2.this is interesting. personally i have come to love 2 handed play and dont see it in the 'playing two people' way i expected. however i am a solo player at heart and i would love to see ways to use ranged and sentinel for that- opening up options in the game is only a good thing.not sure how it would be done....i wouldnt want a major revision of the solo rules as i think the simplicity is key here\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890310","commentId":890310,"userName":"Cunir","timestamp":1381964333,"content":"And I suppose it would be nice if they could revise the \"nightmare mode\" rules as well, and make them a bit more like the campaign mode in black riders,\n\nHow great would it be if we could play through all the quests from all the cycles in order, in one huge massive campaign. You can't really do that with the official nightmare mode rules because they are too hard\n\nAnd I have just thought of one more thing I would like...\n\nWeather cards. But I have already talked about those ones to death.\n\nI haven't played the quest yet, but I also loved the mechanic in that new gencon POD quest, where they introduced a time element to it, advancing the hours as you went through the rounds, I love stuff like that. I would like more of that kind of thing. It makes the quest seem more like a real life story"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890592","commentId":890592,"userName":"alogos","timestamp":1382000829,"content":"I'm more a mechanic of the game fan than a LotR fan, so I will skip all comments on background content.\n\n \n\n> 5.not so quest-y quests. quests that are more light hearted in that they involve no peril. for LOTRO players im thinking of the festival quests. for those who havnt played lotro they are sort of quests where you look for things, rescue hobbits from hilarious situations, throw pies at people....ok..that last one would make a stupid quest, but i think some sort of light quest based around an errand in the shire would be good\n> \n>  \n> \n> 6. cavalry charge mechanics. if it will be anywhere it will be the next cycle. i want some sort of charge mechanic that can kill multiple enemies engaged with you but comes at great cost.\n> \n>  \n> \n> 7. 'building' sub cards. we have allies, attatchments and events but id also llike to see 'architecture' cards or something similar. they could function similar to enemy buildings in siege mode, by having hit points and lowering the threat in the staging area or something\n\n \n\nI love the idea of 5-6-7.\n\n \n\nFor 6, there is Dunhere and Knight of Minas Tirith. I think that cavalrymen could engage ennemy before engaging them in close combat.\n\nSomething like engaging ennemy while dealing damage is for heavy cavalry and dealing damage in the staging area light cavalry. To balance the attack in the staging area, I see something like \"the ennemy resolves an attack with his threat instead of his strength\".\n\n \n\nFor 7, there was a lot of idea, and other mechanism, that are not very playable but nice : a player cards event that shuffle itself in the encounter deck when played with a positive \"when revealed\" effect, or a player location card. We already have trap that are played in the staging area, so why not ?\n\n \n\nMy list of mechanism (because I have no lore) I want to see :\n\n1. not so quest-y quests\n\n2. cavalry charge mechanics\n3. more attachment that doesn't go on characters\n\n4. cards that promote 2 hero or less play (with some more secrecy cards)\n\n5. less obvious combo (LoV+Glorfindel) (cards that give bonus to someone specific is ok) or imbalanced cards (Voice of Isengard cards, outlands, Glorfindel)\n\n6. more double edge effect (Hammer Stroke, Elf Stone, Advance Warning)\n\n7. already said but allies version of hero allow to play them in solo\n\n8. less unique cards per extension (seriously, apart from event, half the cards are unique)\n\n9. competitive gameplay (race against the shadow was not very well received, I often see local made competitive rules)\n\n10. open licence for fanmade scenario (maybe after the games dies...)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890674","commentId":890674,"userName":"richsabre","timestamp":1382013371,"content":"excellent ideas alogos!\n\nEdited October 17, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890707","commentId":890707,"userName":"Djenni","timestamp":1382016511,"content":"> @Djenni - i love uruk hai......and oh yes, i see you're from iceland- i am particularly jealous you have Sigur Ros on your doorstep ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n>  \n> \n> rich\n\nYeah that's right we have the Bluruks and those Mordor Uruks (Muruks) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\nhaha yeah they really are an incredible band, i'm actually kind of embarrassed to admit i've never actually been to one of their concerts, but oh well there's still time for that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890760","commentId":890760,"userName":"richsabre","timestamp":1382020326,"content":">  \n> \n> > @Djenni - i love uruk hai......and oh yes, i see you're from iceland- i am particularly jealous you have Sigur Ros on your doorstep ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> > \n> >  \n> > \n> > rich\n> \n> Yeah that's right we have the Bluruks and those Mordor Uruks (Muruks) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> haha yeah they really are an incredible band, i'm actually kind of embarrassed to admit i've never actually been to one of their concerts, but oh well there's still time for that.\n> \n>  \n\nseeing them in a couple of months...cannot wait ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890940","commentId":890940,"userName":"Raven1015","timestamp":1382038817,"content":"There are some fantastic ideas here!\n\n \n\nHere's my own take on a \"bucket list\" for the game:\n\n \n\n1. Some version of a Campaign Mode for the regular, non-Saga game. I will also take anything that adds more RPG elements to the game, and provides opportunities for characters to grow and for decisions to have a lasting impact.\n\n \n\n2. Corruption mechanic - I would like to see something that really reflects the theme of players and characters being vulnerable to corruption. Something that grants power but also could lead to the corruption of characters would be perfect. I want something other than threat and doomed to represent this central theme of The Lord of the Rings.\n\n \n\n3. A new sphere - I'm not talking about one of the Saga-specific spheres, I want a brand new one. This would be difficult to do, with player cards being released so slowly, and any new sphere having to start out so far behind the existing ones. Still, we're speculating here, and I'd love to see what the designers would come up with.\n\n \n\n4. Silmarillion expansion - This would be the most epic thing ever, rights be damned!\n\n \n\n5. The Blue Wizards - They need to show up at some point and in some form.\n\n \n\n6. A trip to the deep East/South - There wouldn't be much material to go on, but that would make such a speculative cycle really intriguing.\n\n \n\n7. Choose your own adventure - Someone mentioned this idea, and I absolutely love the idea. I'd love to see different paths through a scenario.\n\n \n\n8. Official playmats - Take my money!\n\n \n\n9. Sauron mode - This falls under the category of \"spin-off\", but how much fun would it be to control a marauding band of orcs and Nazgul? Give us the Witch-king as a \"hero\". Give us a quest where we're attacking Minas Tirith. Threat counter? How about a willpower counter and we use our threat to quest!\n\n \n\n10. Ents, ents, and more ents \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=890952","commentId":890952,"userName":"richsabre","timestamp":1382039513,"content":"great ideas Raven. who wouldnt want to play the side of evil....crushing all the weakling resisitance before sauron's might foot?\n\n:angry: [//content.invisioncic.com/Mfantflight/emoticons/default_angry.png] (there was no evil emoticon....that will have to do)\n\nEdited October 17, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891054","commentId":891054,"userName":"13thcaesar","timestamp":1382047207,"content":"More quests like Watcher In The Waters - I mean more opportunities, ways to win, as in this scenario (you can win by killing the Watcher or guess the password to the door of Durin)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891130","commentId":891130,"userName":"Djenni","timestamp":1382058198,"content":"I would absolutely love more quests like Foundations of Stone, that quest is so much fun and plays out differently every time i quest through it. I also love the idea of the players getting separated and having to fight/quest their way back together. It's just so different from the other quests.\n\n \n\nAlso getting a new fifth sphere later on could be really interesting and fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891421","commentId":891421,"userName":"alogos","timestamp":1382098764,"content":"I thing adding a new sphere is counter productive, with cards like \"same printed ressource icon\". Having only 3 hero make the choice difficult enough, and 4-players game having the opportunity to represent each sphere is good as it is. Morevore, sphere have distinct mechanism within themself, making \"subsphere\" like Lore encounter manipulation, Lore trap, Lore heal etc...\n\n \n\nHowever, I would combine point 2 and 3 of Raven : having a fifth sphere, that is corrupt, (but neutrals cards might be a better idea...) where each card is powerful but with a downside, like spoiled cards in Voice of Isengard. Exemple : a neutral sphere hero that gives +1 threat to the staging area each time you use his ressources...\n\nEdited October 18, 2013 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891444","commentId":891444,"userName":"Djenni","timestamp":1382100634,"content":"> I thing adding a new sphere is counter productive, with cards like \"same printed ressource icon\". Having only 3 hero make the choice difficult enough, and 4-players game having the opportunity to represent each sphere is good as it is. Morevore, sphere have distinct mechanism within themself, making \"subsphere\" like Lore encounter manipulation, Lore trap, Lore heal etc...\n> \n>  \n> \n> However, I would combine point 2 and 3 of Raven : having a fifth sphere, that is corrupt, (but neutrals cards might be a better idea...) where each card is powerful but with a downside, like spoiled cards in Voice of Isengard. Exemple : a neutral sphere hero that gives +1 threat to the staging area each time you use his ressources...\n\nInteresting points but i disagree. I think monosphere cards have nothing to do with adding a new sphere into the game. I myself don't play this game with four players but i can't imagine having some variety in choosing spheres (if everyone plays monosphere decks that is) being a bad thing. And it's not like it's impossible to create a new mechanism for this fifth sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891500","commentId":891500,"userName":"richsabre","timestamp":1382106699,"content":"i think it poses some challenges....especially those quests that base X effects upon the spheres we have...those that have spirit,lore,tactics and leadership icons will be affected by the addition of an extra sphere that is not named on these cards\n\n \n\nstill i think if they make it a 'non sphere' sphere (if that makes sense) it would be better. something that is not just another sphere but another mechanic\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891569","commentId":891569,"userName":"Raven1015","timestamp":1382112654,"content":"To me, I think the biggest challenge of introducing a new sphere would be putting out enough cards to make it feasible quickly. They would have to do a deluxe expansion that was nothing but player cards for that sphere just to get it to a decent point. There are a few effects, mainly in the most recent deluxe and cycle that refer specifically to the four spheres, and those could probably be easily addressed with errata. I personally don't think a new sphere will ever happen, but I would want to see it mainly because I'm curious how the designers would handle the challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891583","commentId":891583,"userName":"player1761766","timestamp":1382114027,"content":"It might just because I'm easily confused, but I'm not sure about the idea of a player card being shuffled into the encounter deck that gives a positive effect when revealed. Why not cut out the middle man, though, and have a neutral event card in the player deck that has a reveal immediately effect? In my games, the odds of getting through the encounter deck are usually higher than getting through the player deck, but that's just me. \n\n \n\nAlthough I suppose the precedent has been set for this kinda thing with Ithilien Archers in Massing at Osgiliath, to say nothing of the stuff in the Black Riders box. But in terms of more regular, generic play, it would probably confuse someone like me...!\n\n \n\nI quite like the idea of cards that must be paid for using a single hero's resource pool, rather than from more than one if the spheres match. There are already some tactics cards that spring to mind from the core set, I think, that have limits on where the resources can come from to pay for them, so why not further this kind of mechanic? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891634","commentId":891634,"userName":"richsabre","timestamp":1382117485,"content":"> I quite like the idea of cards that must be paid for using a single hero's resource pool, rather than from more than one if the spheres match. There are already some tactics cards that spring to mind from the core set, I think, that have limits on where the resources can come from to pay for them, so why not further this kind of mechanic? \n\ni like that idea- sort of the opposite of thicket of spear then?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=891872","commentId":891872,"userName":"Djenni","timestamp":1382140163,"content":"> I quite like the idea of cards that must be paid for using a single hero's resource pool, rather than from more than one if the spheres match. There are already some tactics cards that spring to mind from the core set, I think, that have limits on where the resources can come from to pay for them, so why not further this kind of mechanic? \n\nYes that's a pretty clever idea.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=892070","commentId":892070,"userName":"alogos","timestamp":1382187790,"content":"Yeah, going back on all rules to add a fifth sphere make it technically improbable. What about neutral cards that need traits ? I made some fancards to illustrate my idea because... bored...\n\nCharge-Face-de-la-Carte.png [https://lh6.googleusercontent.com/-ItNdhdxqUa8/UmJ_8neiByI/AAAAAAAAEfo/gedDL1T7HPE/w654-h920-no/Charge-Face-de-la-Carte.png]Dying-Breath-Face-de-la-Carte.png [https://lh5.googleusercontent.com/-wtQxgRH0UXk/UmJ_8PvtisI/AAAAAAAAEfk/u-NkpgOXAf4/w654-h920-no/Dying-Breath-Face-de-la-Carte.png]-Saruman-Face-de-la-Carte+%25283%2529.pn [https://lh3.googleusercontent.com/-3jFyZgOJVNQ/UmJ_67leEuI/AAAAAAAAEfc/f5qYFXVwikQ/w654-h920-no/-Saruman-Face-de-la-Carte+%25283%2529.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=892082","commentId":892082,"userName":"jc1138","timestamp":1382189119,"content":"Some things I'd like to see:\n\n \n\n1: Gandalf the White\n\n \n\n2: Hero version(s) of Gandalf\n\n \n\n3: Unique weapons, such as Glamdring, Sting in versions that are not limited to specific  quests.\n\n \n\n4: Treebeard and the Ents\n\n \n\n5: Saruman as an enemy\n\n \n\n6: A great Pelennor Fields quest showdown with the Witch-king\n\n \n\n7: Galadriel as a hero (and ally), along with husband Celeborn and Nenya\n\n \n\n8: Cirdan the shipwright\n\n \n\n9: For Rohan, Gondor, Sylvan, and other deck types to get their day.\n\n \n\n10: Agree to some degree about the questy quests, but it could be said that's what they were trying with Journey to Rhosgobel and Hills of Emyn Muil and we all know how those were received..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=892122","commentId":892122,"userName":"richsabre","timestamp":1382193466,"content":"@alogos- i like that image- it comes up on the lotro load page ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] i really like the idea of trait buying of cards...nice and thematic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=892126","commentId":892126,"userName":"Gizlivadi","timestamp":1382193832,"content":"@alogos, I think this may very well happen, for example in a cycle that focuses on \"classes\" traits (warrior, ranger, scout, etc), as well as the \"must be payed using resources from only one hero's resource pool\" in a cycle focused on duo or tri-sphere decks. Maybe the cost 1 ones and maybe the 2 ones would be \"token\" for kind of effects, such as \"cancel one treachery\" (which is already the case) or chump blockers, while the cost 3+ cards would be heavier, more powerful effects.\n\nEdited October 19, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=892875","commentId":892875,"userName":"Gizlivadi","timestamp":1382305123,"content":"I would also like more \"enviroment\" cards such as Dusk, Eventide and Midnight and some of them that help you (Spirit characters get +1 attack or that make some things cheaper for example), some benevolent type enviroment that players could play, for example an event called \"Evenstar in the sky\" or something that did something good or gave some bonus, that'd be cool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=892877","commentId":892877,"userName":"richsabre","timestamp":1382305309,"content":"> I would also like more \"enviroment\" cards such as Dusk, Eventide and Midnight and some of them that help you (Spirit characters get +1 attack or that make some things cheaper for example), some benevolent type enviroment that players could play, for example an event called \"Evenstar in the sky\" or something that did something good or gave some bonus, that'd be cool.\n\nthats a great idea. that way there isnt even need for new type of cards as these fit right into the event type.\n\na 'mist' even would be good to hide the hobbits or give secrecy for 1 turn\n\nrich\n\nEdited October 20, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=892884","commentId":892884,"userName":"Gizlivadi","timestamp":1382305763,"content":">  \n> \n> > I would also like more \"enviroment\" cards such as Dusk, Eventide and Midnight and some of them that help you (Spirit characters get +1 attack or that make some things cheaper for example), some benevolent type enviroment that players could play, for example an event called \"Evenstar in the sky\" or something that did something good or gave some bonus, that'd be cool.\n> \n> thats a great idea. that way there isnt even need for new type of cards as these fit right into the event type.\n> \n> a 'mist' even would be good to hide the hobbits or give secrecy for 1 turn\n> \n> rich\n> \n>  \n\n \n\nExactly, they're literally events, and yeah events like \"Mists\" is a great idea as well as \"Cover of Night\" or something like that. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=893250","commentId":893250,"userName":"alogos","timestamp":1382358568,"content":"Way ahead of you guys : \n\nhttps://plus.google.com/photos/110808376718166257564/albums/5848277179710910689?authkey=CKaknKWEobzUNg [https://plus.google.com/photos/110808376718166257564/albums/5848277179710910689?authkey=CKaknKWEobzUNg]\n\n(coincidence, has I work on a crossover of http://en.touhouwiki.net/wiki/Scarlet_Weather_Rhapsody/Gameplay/Weather [http://en.touhouwiki.net/wiki/Scarlet_Weather_Rhapsody/Gameplay/Weather])\n\n \n\nI'm currently working on simpler effect and removing the part where you can win or lose and adding some contextual bonus for player. The first idea was to make the game harder and competitive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=893456","commentId":893456,"userName":"Gizlivadi","timestamp":1382373507,"content":"That's pretty amazing alogos, great art as well. But I think I prefer these more as player cards for the good ones and as treacheries as the negative weather ones (unless it's a specific mechanic of the scenario such as in SoE), so we can use these in more than just one quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=894305","commentId":894305,"userName":"ClydeCloggie","timestamp":1382456485,"content":"Assuming that Voice of Isengard / Ringmaker will take care of three of the main things missing at the moment (Ents, Rings, and corruption), my wish list would be:\n\n \n\n- The Blue Wizards\n\n- Freedom to Roam quests where there is only one quest card, a stack of locations to choose from and just you and your strategy to decide how to go about visiting those locations to beat the scenario. Essentially: make the LCG even more similar to MECCG  :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n\n- The big baddies: The Mouth, Shelob, Gothmog, Sauron of course. Shelob is a given for later in the Saga cycle, I guess.\n\n- Shadowfax. He must be better than Asfaloth, and Asfaloth is one of the game's best cards...very curious to see what Shadowfax will look like.\n\n- Returning to the corruption theme: a real downside to walking around with shiny attachments, the more you have the stronger you may be but also the less likely you are to remain pure at heart, which is the main theme of the books. I would like this to be a common theme in encounter decks. Essentially: make the LCG even more similar to MECCG  :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n\n \n\nOverall, essentially: make the LCG even more similar to MECCG  :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=896619","commentId":896619,"userName":"Khamul The Easterling","timestamp":1382731112,"content":"1. Harad Forest quest with Wild Mumaks\n\n \n\n2. A cycle that goes back in time and is not all about the middle part of middle earth.  I want Beleriand and all that stuff up north.  \n\n3. Haldir and Thuranduil Heroes\n\n \n\n4. More Dol-Guldur  \n\n \n\n5. Searching for the lost Blue Wizards\n\n \n\n6. More new player card mechanics such as the ones they introduced in VOI with the threat raising thing. \n\n \n\n7. Another \"New Sphere\" deck like outlands.  \n\n \n\n8. Lower costs for the Nightmare decks (you can tell I'm running out of ideas ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\n \n\n9. Nightmare decks to be really good.  \n\n \n\n \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=896721","commentId":896721,"userName":"Gizlivadi","timestamp":1382741626,"content":"I don't think I would like to have to search for the blue wizards like I would if we had to BE the blue wizards in a quest.\n\n \n\n> - The Blue Wizards\n> \n> - Freedom to Roam quests where there is only one quest card, a stack of locations to choose from and just you and your strategy to decide how to go about visiting those locations to beat the scenario. Essentially: make the LCG even more similar to MECCG   :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n> \n>  \n\n \n\n \n\nThis this this! Though I still think it's pretty much because of nostalgia by now, but I would really like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=896846","commentId":896846,"userName":"Glaurung","timestamp":1382761983,"content":"> 1. Harad Forest quest with Wild Mumaks\n> \n>  \n> \n> 2. A cycle that goes back in time and is not all about the middle part of middle earth.  I want Beleriand and all that stuff up north.  \n> \n> 3. Haldir and Thuranduil Heroes\n> \n>  \n> \n> 4. More Dol-Guldur  \n> \n>  \n> \n> 5. Searching for the lost Blue Wizards\n> \n>  \n> \n> 6. More new player card mechanics such as the ones they introduced in VOI with the threat raising thing. \n> \n>  \n> \n> 7. Another \"New Sphere\" deck like outlands.  \n> \n>  \n> \n> 8. Lower costs for the Nightmare decks (you can tell I'm running out of ideas ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n> \n>  \n> \n> 9. Nightmare decks to be really good.  \n> \n>  \n> \n>  \n> \n> Khamul\n\n100% agree"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=896921","commentId":896921,"userName":"jormungandr","timestamp":1382784347,"content":"1.) A saga about the drowning of numenor/ Ar-Pharazôn saga (2nd. age)\n2.) A Narn i Hirn Hurin saga. A Mîm the Dwarf hero.\n3.) A way to \"level up\" heroes (like VTES advanced vampires)\n4.) More encounter deck hate, I'd love 'combo' or 'control' decks\n5.) 'Lure of the West', a special way to lose elf characters (Lure x: upon xth counter elf character leaves   middle earth)\n6.) A way to make mono tactics decks more playable.\n7.) Mini/Solo quests: especially for secrecy decks. When threat hits, say, 30 you lose. I'd love to go out hunting in Rhûn with only Aragorn.\n\n8.) More tutors (cards that let you search your deck, like word of command)\n\n9.) Expansionsets with nothing but questcards for players that own the whole game.\n\n10.) Last best: Playing with the Sauron side. Nazgûl as heroes, all nine of them. Armageddon. Rawr.\n\n \n\nLol, I kind of like everything with a ^ above a vowel, it seems.\n\nEdited October 26, 2013 by jormungandr"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=897140","commentId":897140,"userName":"player1761766","timestamp":1382820071,"content":"> Weathertop, Saruman, Isengard, 'record' cards, more Osgiliath, and the Mouth of Sauron are all things that I've been desperate to see, and it seems that by the end of the year I'll have everything I've ever wanted for the game! Well, aside from the above six, but I can kinda wait for those to show up...\n\nTook delivery of Blood of Gondor the other day, and I was a bit disappointed by the Black Numenorean, so I suppose I can add The Mouth of Sauron onto my original list as #7.\n\nUnless he isn't supposed to be *that* Black Numenorean..?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=897233","commentId":897233,"userName":"richsabre","timestamp":1382832992,"content":">  \n> \n> > Weathertop, Saruman, Isengard, 'record' cards, more Osgiliath, and the Mouth of Sauron are all things that I've been desperate to see, and it seems that by the end of the year I'll have everything I've ever wanted for the game! Well, aside from the above six, but I can kinda wait for those to show up...\n> \n> Took delivery of Blood of Gondor the other day, and I was a bit disappointed by the Black Numenorean, so I suppose I can add The Mouth of Sauron onto my original list as #7.\n> \n> Unless he isn't supposed to be *that* Black Numenorean..?\n> \n>  \n\ni dont think he is. i think he shall go under his better known name\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=897345","commentId":897345,"userName":"player1761766","timestamp":1382864472,"content":"I hope so! Despite only having, what, a page and a half of appearance time, I still think of him as iconic!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=897392","commentId":897392,"userName":"richsabre","timestamp":1382876597,"content":"yeah he is one of the best of tolkiens creations, after the witch king of course ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=897575","commentId":897575,"userName":"Nyck","timestamp":1382906290,"content":"I love the idea of deeper quests, stacking enemies under locations and stuff!\n\nThat sounds great. And i would like to have some adventures that mix those cards i already own to a new story. There are so many good cards in the already existing expansions and sets that i want to see them mixed together. Orc-Hordes, Goblins, Wargs, whatever...\n\nI really like it when the adventures take on sudden and unexpected changes, f.e. The different caves the playersw were dropped in moria, and every player suddenly gets a storyline of his own.\n\nOr the different possible storylines in the steward of gondor circle was great, more of that!\n\nI also like it when cards begon to wander around the table, enemies switching back and forth to players, do unexpected stuff.\n\nMore attachments for enemies! Boost 'em up, give them other weapons or items which will get them stronger, nastier\n\nTom Bombadil! Barrowdowns!\n\nHobbits! Battle in the Shire.\n\nMore quests where you have to take decisions as a group of players how you want to get on\n\nBattle of five Armies, why not have the players suddenly fight over the gold, every one representing one side. So that you end coop play and battle each other, in the end you have to come together again\n\nMore cards that reward you for playing it for another player, supporting another player/hero or sth\n\nSpells for the wizards\n\nWhat about radagast as a hero?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=897590","commentId":897590,"userName":"Cunir","timestamp":1382907833,"content":"has anyone read the post on Tales from the cards — http://talesfromthecards.wordpress.com/2013/10/24/beyond-combat/ [http://talesfromthecards.wordpress.com/2013/10/24/beyond-combat/]\n\none of the comments by heavykaragh says something interesting\n\n>  \n> \n> Why not scenarios that change phase order? Moving the phase order to combat>quest>travel changes the game flow\n\ni don't see why you can't choose the order yourself. the planning phase and quest phases should always come first, i think, but why should the travel phase always come before the encounter/combat phase? why can't we choose the order? as long as we complete all of the phases in each round, would it really mess up the game play that much if we could choose? and it would make much more sense, theme-wise. it would introduce a bit more strategy and tactics to the game as well — give us some more options"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=897695","commentId":897695,"userName":"GrandSpleen","timestamp":1382917750,"content":"Occasionally it would screw with the quest design (Midgewater Marsh in A Knife in the Dark, for example).  And most Travel effects seem to be designed with the expectation that you will do combat next.  \"Reveal the next card to travel here\" loses a lot of its menance if there is no threat of an additional enemy for combat.  But that would definitely be a cool effect for a quest specifically designed for it: at the beginning of the round, the players decide the order of phase progression.  Add a rule stating that one phase could only occur once per round, then throw in some cards that say something like \"When Revealed: End the current phase and go directly to the Combat Phase, bypassing other phases, if able.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=898043","commentId":898043,"userName":"kendless","timestamp":1382970292,"content":"There is a fan made Barrow Downs quest, pretty good too. http://boardgamegeek.com/thread/710317/feonixs-custom-scenario-3-the-culling-at-the-bar [http://boardgamegeek.com/thread/710317/feonixs-custom-scenario-3-the-culling-at-the-bar]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=913647","commentId":913647,"userName":"Kerstoid","timestamp":1385027104,"content":"> Note spoiler! I admit that after the previews for  Against Shadow cycle in which Caleb Grace wrote that: \"Taken together, the Adventure Packs tell a grand story full of intrigue ...\" - When in  the AP Stewart's Fear turned out that the mastermind of the nameless cabal managed to escape the city before his true identity was revealed, I start  speculated that  the mastermind of cabal is the Lord Alcaron who succumbed to the temptation to the enemy. when we meet him in AP Encounter at Amon Din I believed that he commanded from hide enemy's attacks, and when  arrived the Heroes would not be discovered\" helped \"in defense of the villages. I believed that Lord Alcaron  special lead army of Gondor to the Morgul Vale in last AP right into the trap, and then, when he  have on his side  the Nazgul reveals his face, and comes against the heroes.\n> \n>  \n> \n> story turned out differently :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]   but would be good if introduced by phrases such action - that  actions in the style RPG would be cool.\n\n \n\nSPOILER SPACE\n\n \n\nI just got Morgul Vale in the mail today and... you were right!  I love it!  And now you can knock one item off the LOTR LCG bucket list!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=913670","commentId":913670,"userName":"13thcaesar","timestamp":1385029813,"content":">  \n> \n> > Note spoiler! I admit that after the previews for  Against Shadow cycle in which Caleb Grace wrote that: \"Taken together, the Adventure Packs tell a grand story full of intrigue ...\" - When in  the AP Stewart's Fear turned out that the mastermind of the nameless cabal managed to escape the city before his true identity was revealed, I start  speculated that  the mastermind of cabal is the Lord Alcaron who succumbed to the temptation to the enemy. when we meet him in AP Encounter at Amon Din I believed that he commanded from hide enemy's attacks, and when  arrived the Heroes would not be discovered\" helped \"in defense of the villages. I believed that Lord Alcaron  special lead army of Gondor to the Morgul Vale in last AP right into the trap, and then, when he  have on his side  the Nazgul reveals his face, and comes against the heroes.\n> > \n> >  \n> > \n> > story turned out differently :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]   but would be good if introduced by phrases such action - that  actions in the style RPG would be cool.\n> \n>  \n> \n> SPOILER SPACE\n> \n>  \n> \n> I just got Morgul Vale in the mail today and... you were right!  I love it!  And now you can knock one item off the LOTR LCG bucket list!\n> \n>  \n\n \n\nSPOILER!\n\n \n\nI do not have yet this AP (I bought it but is waiting for me in Poland together with the Blood of Gondor and the Black Riders) but I guessed that my words came true when I saw the setup on the card  The Rearguard in the preview of \"The Dark Lord Will Have His Prize\" that he is the second captain.\nNice the developers have created such an interesting story with a surprising finale. I hope that in the new cycle also show us to an equally interesting story in the background.\nThey maybe show as Saruman gradually going to the side of Sauron - but I doubt that he will become a main antagonist.\nEdited November 21, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=913736","commentId":913736,"userName":"Butterbur","timestamp":1385042877,"content":"I think maybe the next deluxe expansion talk about Eriador..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=913759","commentId":913759,"userName":"13thcaesar","timestamp":1385044867,"content":"I think that more will be played off in Rohan (The Ford of Isen, Fangorn). I think in scenario The Ford Of Isen the heroes saves the Grimme . Maybe then, we take him to Isengard and this is his  first meeting with Saruman (which will be the beginning of a cooperation).\n\n \n\nAnd why Saruman want capture the Orc leader? I think that also will be on another ally of Saruman, providing him access to armies of orcs.\n\n \n\nI think that the heroes unwittingly manipulated by Saruman contributes to an increase in his power to discover at the end, that they really  work against the free peoples.\n\nEdited November 21, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=916492","commentId":916492,"userName":"chuckles","timestamp":1385416934,"content":"\n\n \n\n1) More Elves:\n\nGaladriel,(13thcaesar), Haldir and Thuranduil,(Khamul The Easterling), Celeborn, Círdan & Gildor Heroes\n\nmore Noldor/Silvan in general (Djenni), enough for Silvan or Nordor separately too please!\n\n \n\n2) More player cards for the lesser factions such as Dale & Dunedain etc - the designers may like spheres... I enjoy focusing more on factions than sphere's.\n\n \n\n3) Members of the fellowship as allies (Djenni) & Gandalf the White (jc1138)... like the dwarves or Hobits it fun having lots of well known unique characters.\n\n \n\n4) Hobbits... more please! Would like a shire/bree cycle (RichSabre) & Battle in the Shire (Nyck)... a return to the Shire saga would be mint!\n\n \n\n5) More attachments for enemies (Nyck)... you could use it as another way to encourage players not to turle or to be quite strategic about it (not that I mind turtling)... could be fun or perhaps brutal if an Enemy boss, gets more and more buffed the longer you take :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ...or has text that reads something like \"when boss x enters play add one enemy (to the staging area) for every two allies in play and attach 1 attachment for every 2 attachments in play\" - I like the idea of an epic final fight.  \n\n \n\n6) Cavalry charge mechanics (RichSabre) - suspect that the Voice of I. will build this with on mounts (I really like both Stead of the mark and Rohan War horse)\n\n \n\n7) More secrecy cards (RichSabre) secrecy just doesn't seem complete to me... I would also like more low threat Hero's.  \n\n \n\n8) More quests with multiple ways to win like Watcher scenario - (13thcaesar). This would be really cool!!\n\n \n\n9) Something that makes use of the Warrior class (and any other traits that don't have any synergies)\n\n \n\n10) Replacements: - a new Radagast, new Faramir Hero... (would be happier with the objective ally Faramir in in a Lore wrapper with the current hero text)\n\n \n\nIn general... I just more! New mechanics and support existing ones... \n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=916738","commentId":916738,"userName":"joezim007","timestamp":1385447201,"content":"I haven't read the books, so most lore is lost on me, therefore I don't care so much about what areas/races/etc. we dive into, with some slight exceptions. I'm more of a mechanics guy. I'm always fascinated by the evolution of card games. They tend to start out rather simple, then grow more intricate and split things into numerous specialties, which I love. If it were possible, I'd prefer that they started out with these levels of speciality, but of course, the card pool tends to be too small to do so.\n\n \n\nAnyway, here are a few things I'd like to see, some are duplicates of what others have said:\n\n \n\n1) Ents. They're cool and they have the potential for some very interesting mechanics\n\n \n\n2) Flesh out the Dunedain and other less-represented traits. I think I want the Dunedain the most, but building up smaller traits to have interesting mixes of strengths and weaknesses.\n\n \n\n3) Additional ways of dealing with locations. There are so many ways to deal with enemies right now, but other than willpower boosting and effects that place progress tokens, we don't really have much in the way of dealing with locations. Maybe we could use the locations against enemies. Something like:\n\n \n\n------\n\nHead Start\n\nEvent - Cost 3\n\nAction: Place progress tokens on the active location until the location only needs one more progress in order to be explored. Then, choose an enemy. Reduce that enemy's threat by the number of progress tokens that were just placed on the active location.\n\n------\n\n \n\nI don't know. Something like that and/or some completely different things.\n\n \n\n4) Powerful cards with very noticeable drawbacks. I love the idea of adding the Doomed keyword to player cards like in the VoI expansion, but I hope to see some more innovation in this area.\n\n \n\n5) A \"Party Card\". This is something that should have been implemented from the start if they were going to use it, but each deck should have a single card that the player chooses that gives them their limitations and deck-building rules. The card could also provide certain abilities that a player can activate for free. For example:\n\n \n\n------\n\nStealthy Raiding Party\n\nParty Card\n\n \n\nAll of your heroes must have the Ranger or Dunedain trait. You may have no more than 2 heroes in your deck.\n\n \n\nDo not raise your threat during the Refresh Phase.\n\n \n\nForced: After an ally enters play, raise your threat by 2 (Raise by 1 instead if the ally has the Ranger or Dunedain trait).\n\n \n\nSecrecy discounts are always active, regardless of your threat.\n\n------\n\n \n\nThis may or may not be an extreme example, but if you're going to build a thematic deck, why not use a card like this to tie the theme/synergy together more. As you can see, they can also be used to give new/more life to mechanics that have flopped (like secrecy in this example). Also, looking at that second example, it would open you up more to being able to use the Faramir hero in a Ranger deck without his high threat being as counter-productive.\n\n \n\nYou could also configure other limits, such as only having 2 of any card in the deck, instead of 3... or having different min/max number of cards in the deck... or raising/lowering the threat threshold for secrecy/losing.\n\n \n\nI think things like this can really add more options to deck-building and give each deck a more distinct flavor. You could potentially use the same exact deck with two different Party Cards and have it make enough of a difference to the gameplay that it feels like you're playing an entirely different deck.\n\nEdited November 26, 2013 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92152-10-things-before-the-game-dies/?do=findComment&comment=919480","commentId":919480,"userName":"Style75","timestamp":1385756004,"content":"I hope you all get your wish!\n\n \n\nFFG announced that Warhammer: Invasion is ending and the just released expansion will be the last. This caught pretty much everyone by surprise and the community of players is shocked.\n\n \n\nI don't think this is going to happen to LotR:LCG any time soon (at the last Gen Con, the CEO said the game was the company's unsung hero) but it will happen eventually and it's good for the designers to read what everyone would like to see before the game is wrapped up.\n\n \n\nI predict at least 3 more years so we three more deluxe sets, three more AP cycles, plus the rest of the saga expansions. After that I think the game is done.\n\nEdited November 29, 2013 by Style75"}]}