{"url":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/","title":"would you like an &#039;introduce yourself section?&#039;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=889896","commentId":889896,"userName":"richsabre","timestamp":1381934745,"content":"i have noticed that, even given the subsections that we did the petition for, and the new forum, we still do not have an introduce yourself section....\n\n \n\nafter being around since the game's start i have made some excellent friends on this forum, so im all for knowing those on here....however as khamul reminded me- this is not for everyone, so i realise many will not be interested\n\n \n\ndespite this, what would you say to an newcomers/ introduce yourself subsection? do we even get enough new comers to make it worth it?\n\n \n\nin celebration of my 1000th post (a while back now ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] i did an 'introduce yourself' thread (actually i went along bilbo's i don't know half of you as well as i should like....) that had a little interest, but as for the permanent section i see several benefits to it:\n\n \n\n- it gives newcomers to the game a first port of call for joining the forum, allowing both ffg and ourselves to get an idea of how many newcomers to the forum we actually get\n\n- it allows for a good place for newcomers to post questions that to us may be obvious (not that theres anything wrong with those questions, its just sometimes they may get more attention if it is realised they are coming from beginners)\n\n- often it even encourages those who view the forums but do not join, to actually go ahead and join. more posters = more players\n\n- new posters may have issues or confusions about the forum itself. for instance i have recently seen several players post rules questions in the strategy section, and general questions in the rules area. obviously it doesnt matter, but these players would get more replies if they were in the right area.\n\n \n\nlastly i think it would be a good place for the 'sticky' threads that we do not currently have. im thinking of the following would make good sticky threads for the introduction section:\n\n \n\n-important links such as official FAQ area of site, rules section, product link\n\n-unofficial faq\n\n-chronological playing order\n\n-blogs/video links etc.\n\n \n\nthoughts?\n\nrich\n\n \n\n \n\nEdited October 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=889932","commentId":889932,"userName":"Nickpes","timestamp":1381938027,"content":"I find that these kind of threads are always usefull, since they might help users make some \"bond\" together, even through net. To be honest when first registered I looked for one but ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=898614","commentId":898614,"userName":"Olorin93","timestamp":1383042312,"content":"Rich, I only saw this thread after reading your recent comment about it in another! I think an \"introduce yourself\" section is a great idea. Gives players more of an opportunity to get to know each other. I know very few people IRL who play this game, so it would be great to find out more about those who do.\n\nEdited October 29, 2013 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=898628","commentId":898628,"userName":"Mndela","timestamp":1383046014,"content":"Very good idea.\n\nI have taught some new players to play, but my english is poor. This idea could be better.\n \nThe game is excellent (the better for my opinion) but to like really people must know all the game (rules, expansions, webs, etc.), and few people can access to them. First, the rules are a lot (beginners must be lot of patience, and no all people are ready to it), and second, lot of money to buy all the cards is needed (people not pay if it is unkown, of course).\n \nSo a web that make all it easier is a good idea.\n \nI help people by octgn, when people know game and cards, maybe they buy the phisical cards after. But first they have to know the game and the cards to like it, and after buy. So octgn could be displayed in this new threat as an option.\nEdited October 29, 2013 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=898659","commentId":898659,"userName":"richsabre","timestamp":1383050498,"content":"thanks for the thoughts both :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\ndoes anyone know if other lcg's have introductory section or stickied (sticky-d???) threads for newcomers?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=898726","commentId":898726,"userName":"Khamul The Easterling","timestamp":1383057526,"content":"> ....however as khamul reminded me- this is not for everyone, so i realise many will not be interested\n\nI did? \n\n \n\nI just am not for the \"make new friends on the internet and let me tell you some about my life\"   I think that's a little goofy and occasionally dangerous but all respect to whatever you guys want to do.\n\n \n\nI just use this for asking some questions about Lord of the Rings the card game and participating in some polls.  \n\n \n\nSorry if this sounds rude I don't mean for it to be :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=898746","commentId":898746,"userName":"richsabre","timestamp":1383059258,"content":">  \n> \n> > ....however as khamul reminded me- this is not for everyone, so i realise many will not be interested\n> \n> I did? \n> \n>  \n> \n> I just am not for the \"make new friends on the internet and let me tell you some about my life\"   I think that's a little goofy and occasionally dangerous but all respect to whatever you guys want to do.\n> \n>  \n> \n> I just use this for asking some questions about Lord of the Rings the card game and participating in some polls.  \n> \n>  \n> \n> Sorry if this sounds rude I don't mean for it to be :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> Khamul\n> \n>  \n\nno problem at all. that was my point, everyone uses this forum for something different and that is fine :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=898900","commentId":898900,"userName":"Noccus","timestamp":1383071385,"content":"I was actually toying with the same idea yesterday as I found out that Gizlivadi hails from Chile quite by accident.\n\nI happened to mis-click, being distracted and clicking his portrait. I would never have found out by myself.\n\nSo what? You might ask. Good question.\n\nWell, I got a special connection with that country. (With many actually as I've traveled for 3 years around the globe)\n\nAs such it was nice to find out and chat about.\n\nSo is it a good idea? I'd say hell yes.\n\nPeople can post as much about themselves as they choose.\n\nWhy not make a thread for it and bumb it when it gets to the 2nd page so they new ppl can find it easily?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92162-would-you-like-an-introduce-yourself-section/?do=findComment&comment=898904","commentId":898904,"userName":"richsabre","timestamp":1383071661,"content":"i may do that. i i did post a thread perhaps 1.5 years back, so not much point in reviving it as people change (i certainly have haha)\n\n \n\nrich"}]}