{"url":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/","title":"dungeons deep &amp; caverns dim","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=890630","commentId":890630,"userName":"Noccus","timestamp":1382007267,"content":"Hi,\n\n \n\nMe and my group are in need of some advice.\n\nIt’s about the dungeons deep & caverns dim quest.\n\nFistly, we are on our first playthrough through all the quests still, and attempt every quest blindy without any knowledge whatsoever about it’s mechanics on our first go.\n\nWe’ve played through Core, Mirkwood, Khazad, Dwarrowdelf, Heirs, and now Hobbit box 1.\n\nWe’ve been able to beat some quests on the first try, with many on the second try, and just 1 on the third try. (flight from moria if you want to know)\n\n \n\nWe play once a week and do 1 quest, though last week we weren’t able to beat the dungeons deep & caverns dim quest after 5 tries with modified decks every single time.\n\nThen we noticed we did something wrong all the time with the riddle mechanic.\n\nSo ok, we gave up, it being late and all and we told ourselves we would beat it next (this) week doing it  rightyly by the rules. I won’t explain it all, long and boring.\n\nAnyway, now this week, we tried again with whole new decks, hopes were up…and we got absolutey crushed 3 times in a row. One time we even lost on round 2. (bilbo died)\n\n \n\nThe set-up for this quest is amazingly hard:\n\nThere’s a location, the cave, which adds 6 threat with 3 players from turn 1 which you can’t do anything about as the card is immune to everything.\n\nOn top of that 1B tells you to flip a 2nd encounter card per player on the staging step.\n\nThat’s 6 cards on 3 players. THEN you still need to quest the 1st turn and reveal 3 more cards.\n\nSo we are on round 1 looking at 9 encounter cards, a 6 threat immune location and a riddle mechanic gimping your deck & quest.\n\nAs we have tried quite a few times by now, we’ve seen this gives between 22-30 threat right of the bat in the staging area. Meaning we each get to swallow some 12-18 threat.\n\nThen everything attacks of course, and we haven’t build up anything on turn 1, so needless to say, things go wrong.\n\n \n\nNow we like a difficult quest. And we beat them normally.\n\nWe beat Shadow & Flame, Lake town, Massing, Heirs etc.\n\nBut this seems impossible to do.\n\n \n\nI’m not complaining here. We just need some advice.\n\nAre there any players out there that beat this quest 3-4 players?\n\nIf so, we’de really like to know how and with what decks.\n\nAny other advice on this quest is welcome too of course!\n\n \n\n Thanks in advance!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=890678","commentId":890678,"userName":"richsabre","timestamp":1382013804,"content":"myself and two friends won this...it wasnt easy but all i remember is that we had beorn. beorn is the master of any quest with lots of potential enemies coming at once, even if it means sacrificing him and brining him back with fortune or fate.\n\n \n\nwe found it very difficult, so sorry i cannot be of more help\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=890973","commentId":890973,"userName":"koriakin97","timestamp":1382040625,"content":"Shouldn't you reveal additional card per player every turn?\n\nYou have to have luck and get many easy riddles and then answer them, leaving staging area half clear. But I hardly beat it solo and often just skip this quest when playing hobbit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=891662","commentId":891662,"userName":"Nickpes","timestamp":1382119232,"content":"Havenot played it three players, but to make you feel better, me and my wife normally beat each new quest after 1-2 attempts maximum (dol guldur on fourth) but for the dungeons deep we lost nearly ten times before winning ... Our problem too was the so many cards on staging area ... So with three players it should be a nightmare . Good luck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=893141","commentId":893141,"userName":"Nerdmeister","timestamp":1382336040,"content":"Do you remember to discard those encounter cards you use for riddles?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=893532","commentId":893532,"userName":"Noccus","timestamp":1382378795,"content":"> Do you remember to discard those encounter cards you use for riddles?\n\n \n\nDoh!\n\n \n\nDo I ever feel dumb to admit we added every card to the staging area and did the riddle too...\n\nTho I'm not the read-up-on-the-rules guy of our group, it's no excuse.\n\nJust checked the rule book and you are correct. Man how could we have missed that part?\n\nI'm the (most) vocal one of our group here, and the others lurk about; so they may read this before tomorrow.\n\nI'm going to smack my  read-up-on-the-rules-mate on the head for this tomorrow on play day anyway.\n\nThanks for bringing this up buddy; it must have been so obvious that everyone else who read this assumed we did this correctly me thinks. And we got swarmed....no....SWARMED!!! two weeks in a row...\n\nOh well, I feel better now knowing it was not our unability to play this, nor the quest mechanics.\n\nSeems not so strange now 3 players would have trouble with this quest as we played it, does it?\n\n \n\nThanks again for pointing this out!\n\nWe're going to have another go at it tomorrow with renewed hope!\n\nEdited October 21, 2013 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=893730","commentId":893730,"userName":"GongShowHost","timestamp":1382390437,"content":"I've been having trouble with this too. It says Bilbo is immune to player card effects while in the Riddle Area, so doed that mean you can't play Sting on him? If I can play Sting on him this quest is much easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92217-dungeons-deep-caverns-dim/?do=findComment&comment=894029","commentId":894029,"userName":"Nerdmeister","timestamp":1382423012,"content":"> I've been having trouble with this too. It says Bilbo is immune to player card effects while in the Riddle Area, so doed that mean you can't play Sting on him? If I can play Sting on him this quest is much easier.\n\nSting is a player card. Even if it is also a treasure.\n\nAn easy way to tell if a card is a player card is to just look at the card back: if it matches the back on the heroes then it is a player card"}]}