{"url":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/","title":"weathertop ambush","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/?do=findComment&comment=891675","commentId":891675,"userName":"richsabre","timestamp":1382119977,"content":"how do you go about winning this (the 3b part of knife in the dark)\n\n \n\nafter turning the card you have at least the witch king, weathertop location and i think there is 2 black riders? in the encounter deck not counting any you shuffled in.\n\n \n\nthat's a lot of threat to add at once for solo play, perhaps this one's easier multihanded?\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/?do=findComment&comment=891679","commentId":891679,"userName":"Spurries","timestamp":1382120257,"content":"Its not too terrible using the 4 Hobbits(Sam Merry Pippin Frodo).  Just take 1 at a time and try to be strong enough at that point to kill a Black Rider in one turn.  So at most youll have 2 turns of a lot of threat.  Tracker1's attachment heavy deck can handle it pretty well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/?do=findComment&comment=891720","commentId":891720,"userName":"Tracker1","timestamp":1382122784,"content":"This is such an epic moment during this quest. The first time i encountered this stage my jaw hit the ground when i had to put 5 Nazgul in the stagging area. I think the designers really captured the feel of that epic encounter. Unfortunately each game after you know what is coming, but that first playthrough is just awsome.\n\nAs Spurries said, the deck I put together can handle it fine, since by this point in the game my hobbits are all loaded up with attachments, and i will engage one Nazgul at a time. Usually starting with the Witch King. I will also be saving a few Feints and Mr. underhill just in case things get out of hand. What ever you don't travel to Weather Top, at least right away, since it would probably spell doom for the party.\n\nThis is a really complex quest strategy wise since your chocies early on will influence how many nazgul you may encounter at the end. I think the most I had was 6 and the least was just 3.\n\nSome other decks i tried failed this quest at this point. Those decks consisted of Aragorn lore and Glorfindel and another hobbit, questing and generating enough attack power was difficult to manage. The 4 hobbits are the way to go IMO. Merry with 2 daggers and in my deck with 3 Dunedain Marks, can pretty much one shot all the Nazgul except the Witch king.\n\nI have not tried ally heavy decks for this, so I am not sure how they do. But thematically the small party seems to fit the quests, although Merry is just a bit more powerful then I pictured him in the books.\n\nEdited October 18, 2013 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/?do=findComment&comment=891870","commentId":891870,"userName":"Djenni","timestamp":1382139824,"content":"Basically you have to get rid of Bill Ferny (with Hail of stones) before he makes you shuffle more Ringwraiths into the encounter deck. Then you can use the hobbits with their low threat and Daggers attached to Merry (you can also use Unseen strike) to take out the wraiths one at a time. Feint and Mr.Underhill can help you with that, also try utilizing the awesome effect on the Weather hills location to remove at least one wraith from the game while you fight off the rest, that's at least one less wraith to deal with.\n\nhttp://www.lotrlcg.com/Card/Focus/1987 [http://www.lotrlcg.com/Card/Focus/1987]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/?do=findComment&comment=891875","commentId":891875,"userName":"richsabre","timestamp":1382141018,"content":"thanks for the ideas- i shall try a few out next time i try the quest.\n\nwhat i also think i shall try is the hama/legolas/beorn deck with thicket of spears recycling. this strategy has never failed me when paired with a good questing deck for dealing with many high powered enemies.\n\nkeep the other deck low threat, or use hammer stroke to engage them all at once, thicket of spears, then you can easily take them out\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/?do=findComment&comment=891877","commentId":891877,"userName":"iznax","timestamp":1382141334,"content":"perhaps this one's easier multihanded?\n\nrich\n\n \n\nAfter many runs i concluded that the BR quest are old school (first cycle) , low threat, hi will power decks dominates them and they get easier the more players you add"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92290-weathertop-ambush/?do=findComment&comment=893052","commentId":893052,"userName":"GrandSpleen","timestamp":1382322053,"content":"This is the most thematic moment possible to use O Elbereth!, but it didn't make it into my deck for this quest... maybe some other time!"}]}