{"url":"https://community.fantasyflightgames.com/topic/92557-treasures/","title":"Treasures","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92557-treasures/?do=findComment&comment=895325","commentId":895325,"userName":"Mndela","timestamp":1382558952,"content":"I until don't know how to play correctly the treasures of the two Saga Expansións The Hobbit. I think about some ways, but i don't know which is the better and which is valid or not, there are the next:\n\n \n\n1. If you win treasures, you can play them the next adventures with the same heroes you played it, but you can change friends and decks.\n\n \n\n2. You can play treasures only if you and your friends keep the same heroes, but you can change your decks.\n\n \n\n3. Keep same heroes all players, and also keep same decks.\n\n \n\n4. Allbody can play the treasures he wants in the adventure he wants :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n5. When a player wins a treasure, only this treasure can be played by him. For example, in Lonely Mountain, when you win a struggle check, the treasure you win is the treasure you could play in War of 5 armies, only you and no others friends.\n\n \n\n6. When the players win a treasure, each players can get one copy of this treasure in his deck for future quests. For example, 4 stings (won in the 1st of Hobbit) in a game of 4 players: 1 per player.\n\n \n\nWhat do you think about all this?\n\nEdited October 23, 2013 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92557-treasures/?do=findComment&comment=895360","commentId":895360,"userName":"Thanatopsis","timestamp":1382560975,"content":"The first treasures you discover trigger from the following text:\n\n\"If Troll Cave is in the victory display, the players have discovered the treasure cards Sting, Glamdring, and Orcrist.\"\n\nThis means that ALL players have discovered these treasures.  The use of the plural \"players\" is common for all instances that treasures are discovered across both boxes.\n\n \n\nThe OHaUH rule book states\n\n\"No more than 1 copy of any treasure card, by title, can be added to a player’s deck.\"\n\n \n\nSo, if you happen to have four copies of the OHaUH and OtD expansions, in a 4-player game each player can add one copy of each treasure to their deck.  Now, many might say this is a waste since all the treasures are unique (and the ring can also be used to pull them out of your decks). But, maybe you really want to increase your odds for a specific treasure.  If you only have one copy of each card, one player could take all of them or you could distribute them. Your choice.\n\n \n\nIn the strictest interpretation of the rules, the same four individuals must use the same 12 heroes in order to use treasures from previous quests.  The rules say nothing about the content of player decks.  Change them all you want, but the heroes must remain.\n\n \n\nIf you have to sub-out players, that's probably okay.  The spirit of the rule is not broken.  I would feel bad for the person that can't make it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92557-treasures/?do=findComment&comment=898631","commentId":898631,"userName":"Mndela","timestamp":1383046358,"content":"So, if each player can get one copy of each treasure...., ok, are unique and can't be played twice at the same moment. But, Trhor Golden Cup..., can be more than one copy in the victory discard pile? Or maybe the question is: discard pile is considered in play?\n\n \n\nM1647.png [http://www.lotrlcg.com/Images/Cards/Medium/M1647.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92557-treasures/?do=findComment&comment=898898","commentId":898898,"userName":"Thanatopsis","timestamp":1383071223,"content":"This is a really cool question.  I had not thought of that.\n\n \n\nI've included the elements of the FaQ and Core Rules that are relevant.  To summarize:  \n\n- Cards in the Victory Display are considered to be out of play. \n\n- The uniqueness of a card only applies if a copy is in play.\n\n \n\nThe letter of the law says that each player can use the Golden Cup (but since it's an attachment, each player must do it on a subsequent turn).  However, I question if this was the intent of the card when it was designed.\n\n \n\n \n\n(1.29) Victory Display The victory display is a game area where victory points are tracked. Cards in the victory display are considered to be out of play, but are not considered to be a part of the encounter discard pile. Cards in the victory display are not considered \"removed from game,\" and some card effects may still interact with them.\n\n \n\nIf any player has a unique card in play, no player can\n\nplay or put into play another card with the same title.\n\nAny attempt to do so will fail to the extent that the card\n\nattempting to enter play remains in its current location\n\n(hand, deck, discard pile) and does not enter play. This\n\nrule applies to all unique hero, ally, attachment, and\n\nevent cards that might enter play. Note that a unique\n\ncard is eligible to enter play if another card with the\n\nsame title is in a player’s discard pile but not currently\n\nin play."}]}