{"url":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/","title":"Attachments etc. of dead heroes, Fortune or Fate","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=895890","commentId":895890,"userName":"krokodiler","timestamp":1382629521,"content":"Hello,\n\n \n\nI cannot find it written anywhere in the rules, but I assume, when one of my heroes is dead, all of his attachments, allies etc. go to discard? And these \"bad\" attachments: Caught in the Web, Spider's Web (from Nightmare Passage) go to Encounter discard?\n\nWhen I have a card which lets me shuffle back my discard to my deck or bring something back from discard to hand or play I'd have a chance to use this attachment/ally again?\n\n \n\nAnd another question: if I use Fortune or Fate to bring back my dead hero to play, his threat level is not taken into account when calculating score at the end of successful game?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=895910","commentId":895910,"userName":"richsabre","timestamp":1382630473,"content":"for the first question-  yes they go to their respective discard piles in the player deck and encounter deck. both can come back as normal if the decks are shuffled.\n\n \n\nas for the second, if a hero is brought back from the discard pile then their threat is not taken into account as 'dead hero threat'\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=895914","commentId":895914,"userName":"krokodiler","timestamp":1382630711,"content":"Thanks for quick reply :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nOf course, when I revive my dead hero with FoF, he doesn't have anything attached that he had before and his resources are reset to zero?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=895918","commentId":895918,"userName":"richsabre","timestamp":1382630976,"content":"yes, i believe that as everything is discarded, then they do not come back once the hero does\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=895937","commentId":895937,"userName":"krokodiler","timestamp":1382632307,"content":"OK, thanx again.\n\nAm I right that this is not written directly in the rules? Or I just can't find it...\n\nOf course it is logical, but it should be nevertheless written.\n\n \n\nedit: argh, p. 9 of the rules, in \"Attachment Cards\": \"If the card to which an attachment is attached leaves play, the attachment card is discarded.\"\n\nThis is also mentioned on p. 22, but in a case when player is eliminated, not hero killed.\n\nEdited October 24, 2013 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=896061","commentId":896061,"userName":"CJMatos","timestamp":1382646793,"content":"To add to your FoF question, if you bring him back (\"revive\" him), the hero stops of being dead, of course.\n\n \n\nThe \"dead heroes threat\" consist of only the heroes that are in your discard pile at the end of the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=896077","commentId":896077,"userName":"krokodiler","timestamp":1382648184,"content":"So, these two questions are clear to me now. But I have two more questions:\n\n \n\nStand and Fight - can I use it to put into play, under my control, an ally from eliminated player's discard pile?\n\nThicket of Spears - I assume this card can be played when I have mono-sphere Tactics deck, with 3 heroes from that sphere?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=896082","commentId":896082,"userName":"richsabre","timestamp":1382648793,"content":"not sure on the first - i shall have to check the rule book\n\nas for the second, yes it can either have a mono sphere tactics deck or it could also be used when you have song cards which are in the mirkwood cycle which gives hero a tactics sphere icon\n\nthis card is incredibly powerful with the right deck\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=896100","commentId":896100,"userName":"Mndela","timestamp":1382650174,"content":"The first question is a good answer: yes, you can \"return\" any ally from the discard pile of any player you want, to your control. But, take care about neutral allies. Neutral is not a sphere, then you can't return to play Gandalf or Envoy, etc.\n\nEdited October 24, 2013 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=896256","commentId":896256,"userName":"GrandSpleen","timestamp":1382670380,"content":"> The first question is a good answer: yes, you can \"return\" any ally from the discard pile of any player you want, to your control. But, take care about neutral allies. Neutral is not a sphere, then you can't return to play Gandalf or Envoy, etc.\n\n \n\nBut he's asking about an eliminated player -- If a player is eliminated, all their cards cease interacting with the game.  Here's a quote from an official response about Fortune and Fate, which is relevant for Stand and Fight also:\n\n \n\n\"Once a player is eliminated, his discard pile can no longer interact with the game.\" (Nate French)\n\n \n\nGot that from an old thread on BGG here [http://boardgamegeek.com/thread/735929/question-about-card-fortune-of-fate-received-an]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92586-attachments-etc-of-dead-heroes-fortune-or-fate/?do=findComment&comment=896965","commentId":896965,"userName":"krokodiler","timestamp":1382794346,"content":"Rich - as I am still only a beginner in playing LotR and play only with the Core Set, I didn't even know that these song cards exist... For me this card seems powerful, too, but I'd have to play only with Tactics heroes from Core to use it.\n\nMndela, yes, now I remember about neutral allies, because in one of my first games (all of my games are, actually, first, as I don't play too much and I've started playing recently) I used this card to play Gandalf and after that I read that clarification.\n\nGrandSpleen - thank you for the link, that was something I needed. Nate wrote that he should add it to the next FAQ update, but still it isn't added.\n\nThanks again guys!"}]}