{"url":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/","title":"Introductory thread/ new player thread","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=898912","commentId":898912,"userName":"richsabre","timestamp":1383072289,"content":"greetings fellow gamers\n\n \n\nafter getting some postive feedback from the forum on this idea i thought i would go ahead with it\n\n \n\nso here is the introductory / new player thread. hopefully if (!) it gets plenty of posts it may be stickied, if that is possible on this software, or perhaps even a subforum for newcomers, though that may be thinning out the forum rather too much in my opinion. hopefully it shall give newcomers a place to come first to introduce themselves, ask any questions and so on, but also give vetern gamers a chane to know each other if they so wish, and compliment the 'mega meetup thread'\n\n \n\nso here is myself:\n\n \n\ni am Richard, i am from Cumbria, N.England. i study an astrophysics degree with the open university....there is a wide range of opinions of distance study, however my choice was due to health reasons. despite this i find it an extremely tough learning process, at least as valuable as face to face learning (which it consists of anyway, and which i have also experienced so can compare the two)\n\n \n\naside from this my main interests lie in Tolkien (who would have guessed), history, specifically ww2 and third reich history (not a political statement etc etc.), and collecting various things\n\n \n\ni am also an infrared photographer which is probably best described by clicking on my llnk in my signature (not an advert....ok well, a little haha). i was recently featured in a local magazine which was quite good (though i had one of my images cropped on the page- NEVER crop an artist's image...its meant to look that way!)\n\n \n\ni have also just started to learn german (just started, so if you ask me anything in german the chances are i wont understand it ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\n \n\ni picked up this game as soon as it came out, and have obsessively been playing it since.\n\n \n\noh yes, and when i say 'obsessive'...i mean obsessive- i have OCD...about the only good things that come from that is an extremely strong passion for my personal interests, and being good at mathematics and science\n\n \n\ni like music that most will not have heard of- my two favourite artists being Sigur Ros, who a fellow gamer and good friend introduced me to, and Ludovico Einaudi.\n\n \n\ni play guitar and piano..i say piano but its a keyboard (no need to tune the **** thing)....\n\n \n\noh yes....and i do this... '......' a lot....helps me form my thoughts :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nso...that is me....who are you?\n\nPS- hopefully at least one other person will post on here to save my embarrasment...... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nPPS- believe it or not, i actually look nothing like my avatar.....\n\nEdited October 29, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=898974","commentId":898974,"userName":"Khamul The Easterling","timestamp":1383078884,"content":"> PPS- believe it or not, i actually look nothing like my avatar.....\n\nEveryone will always think thats what you look like anyways though :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  I never use Glamdring cause it feels like I have the \"Rich\" attachment and thats really weird so........ :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nEdit - Ooops really sorry I just realized that I sort of screwed up your topic by posting a comment that doesn't relate to what the topic is on.  Sorry!\n\nEdited October 29, 2013 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=898984","commentId":898984,"userName":"richsabre","timestamp":1383079608,"content":"haha no problem. i have the same every time i draw the adder.....look! its glaurung!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899000","commentId":899000,"userName":"Kepagt","timestamp":1383081734,"content":"Hi. My name is Keijo and Im from Finland. I have started to play Lotro lcg last spring. I play also war of the ring bord game, Star wars x-wing miniature game, arkham horror and star wars lcg :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] in Lotro lcg Im just learning but I lovit! IT,s so great game. Thats little about me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899027","commentId":899027,"userName":"richsabre","timestamp":1383084280,"content":"thanks for the introduction Keijo. you must buy a lot of cards every month ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899063","commentId":899063,"userName":"13thcaesar","timestamp":1383088787,"content":"Hi my name is Damian and I come from Szczecin in Poland (but works in Oslo, Norway). I play from the beginning as soon as this amazing game appeared in my home country. At first I was playing solo, however, when I discovered what's possible multiplayer game, I convinced her two other players, and since then I play the three players. However, in December, will join our group of four players, and from now on I'm going to play for four players.\nEvery two months I go back to Poland and then play with my group - these two months usually tested decks (I made decks for other players from my group) and new scenarios .\nso I'm set for a multiplayer game and , try  create decks mainly only for 4 players.\n\n \n\n \nI listen to metal (Cradle Of Filth and Marilyn Manson, etc.).\n \nOf course, I'm also a fan of creativity of Tolkien's.\nI play well in LOTR Online.\n\n \n\nEdited October 30, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899065","commentId":899065,"userName":"richsabre","timestamp":1383088900,"content":"thanks for posting ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nwhat server do you play on lotro? i am on Dwarrowdelf\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899068","commentId":899068,"userName":"13thcaesar","timestamp":1383089252,"content":"> thanks for posting ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> what server do you play on lotro? i am on Dwarrowdelf\n> \n> rich\n\nDwarrowdelf (nick Hirluinthefair ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]) I started play (so only 28 level)\n\nEdited October 29, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899074","commentId":899074,"userName":"richsabre","timestamp":1383089532,"content":"cool - i shall keep my eyes open. i am 'richardsabre' on the game....level 42. i only use the free to play system and use any turbine points to get packs, though i have only managed to buy evendim so far when they were on sale. for me it was either computers or cards....my thinking is that unlike my computer, cards dont break ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899090","commentId":899090,"userName":"Tsurara","timestamp":1383090682,"content":"Hey Guys and Gals, I am brand new to LoTR LCG and I hope to get really into it, i find the concept amazingly enjoyable and I can not wait for my core set to come this friday. I hope to really get my gaming group into it and see what happens. I live in SoCal and have only one group of gamers and that is only comprised of 4 people... so my group is small hence why this game intrigued me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899115","commentId":899115,"userName":"Glaurung","timestamp":1383096181,"content":"Hmmmmm we already done in once right? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899121","commentId":899121,"userName":"richsabre","timestamp":1383097061,"content":"> Hmmmmm we already done in once right? \n\nindeed- though to show how long ago that was...it was my 1000th post. i now have 4500. a lot of people have come and gone since then.\n\n \n\nanyways, i wanted to try and get this into a new player thread as well\n\nEdited October 30, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899137","commentId":899137,"userName":"GrandSpleen","timestamp":1383101430,"content":"Hey all.  I'm Danny, I've been playing since just after Khazad-dum was released, and lurking around here just as long.  This was my first LCG and really my introduction into the world of card and board games beyond Monopoly Mouse Trap type of things.  I play LotR LCG with my wife pretty exclusively.  We used to play 3-4 times in a week, but we both have new jobs now and due to our schedule we usually get only 1 or 2 games in during a week.  \n\n \n\nAnd Small world -- I used to play LotRO, and on Dwarrowdelf no less.  Did free to play only, and earned quite a few of the quest packs.  I stopped around level 40, and it's been probably a year since I played.  I'd like to pick it up again sometime, to tell the truth.\n\n \n\nI live in the Seattle, WA area, USA.  I am a speech-language pathologist and spend my days doing speech therapy with kids.  Other than this game, I do some PC gaming, and I already mentioned the LotR MMORPG.  I also love camping, hiking, backpacking, and ska/reggae music.  And I lived in Japan for a few years, and speak Japanese pretty fluently if we're on familiar topics! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Can't read kanji so well though, and can't write a lick..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899173","commentId":899173,"userName":"Nickpes","timestamp":1383108575,"content":"Hello\n\n \n\nI'm Nikos and I live in Greece, in a seaside place about 50km south of Athens (near Cape Sounio, it is a place a bit known about its ancient temple). In the community I live there are not more than 100 people in winter while in summer near 2000 , so you can guess that in winter time we are practically alone\n\n \n\nI have two small kids (a boy 2years old  and a girl 9moths old) that take most of my time when home and a wife offcourse who is my fellowplayer in lotrcg. She likes the game though she doesn't like at all the Tolkien stories\n\n \n\nI first came upon LoTRCG when my daughter was born, near the hospital was a shop that had it among other boardgames. I had a walk, shaw it and since I am a Tolkien fan (a lot before the movies came) I asked about it. I was attracted by the cooperrative thing and bought it. I think it took more than two months for the first game since with the new baby at home there was no time for it. I loved it, introdyced my wife who likes board games, she liked it too and soon enough we had all the available saga and ap packs. \n\n \n\nMy hobbies are photograph, history, books, watching my favourite soccer team and board games mostly. I listen a lot of music. I prefer metal - all kinds of it but mostly Blind Guardian (my sig come from a song of them about Fingolfin) and Saxon - but could listen to anything apart from hip hop. I like Greek traditional music a lot too\n\n \n\nthats to get a general idea about me. If you ever come in Greece pm me so we can play together hehehehe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899210","commentId":899210,"userName":"faith_star83","timestamp":1383117120,"content":"Hey Guys\n\n \n\nI think its nice to know a bit more about each other.\n\n \n\nMy name is Alain and I live in Switzerland. I read the book for the first time 18 years ago and have been a huge fan of Lord of the Rings and the Hobbit since then. I never got around to read other Tolkien stuff, though.\n\nMy bother gave me Arkahm Horror as a Christmas present and I still love the game, but when I checked out the FFG website I saw the anouncement of an upcoming lotr lcg. So I kept following the game's development, closely anticipating its realease and being active on this forum even before the game was release. I picked up the Core Set day one :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] At the time I was living in Tokyo and had a friend to play together although he soon became bored with the game and I was on a forced hiatus for a while. After moving back to Switzerland I picked up the game again and am really into it again (this time mostly solo though). Although I still miss the entire Khazad-Dum cycle (it's really hard to get English cards here and I don't want to mix-up my English collection with German cards!).\n\n \n\nIt's funny though, me too, I am fluent in Japanese. Even read and write it almost perfectly since I was a student at University of Tokyo for three years and was heavily exposed to Japanese there :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899295","commentId":899295,"userName":"richsabre","timestamp":1383134246,"content":"thanks for posting everyone- its great to know more about familiar faces. us gamers are a varied lot ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899467","commentId":899467,"userName":"Pharmboys2013","timestamp":1383151957,"content":"My name is Mike and I am from Pittsburgh, Pennsylvania.  I graduated from Duquesne University this past May with a doctor of pharmacy degree and currently work for Rite Aid pharmacy.  I'm also a big movie buff and xbox fanboy.  I am usually able to play a few games each week.  I especially enjoy the creative deck building aspect of the game and will often build a deck, play one game with it, then take it apart and make a new one.\n\n \n\nI got into the game last summer when a friend had purchased the core set and the conflict at the carrock AP and brought it over to play.  I was a LOTR fan at the time, but nothing quite as intense as rich or some of the other fans on here.  After playing a few matches i was obsessed.  Loved the cooperative aspect and how releases came out almost every month.  When I was younger I played the popular competitive based card games like magic and yu-gi-oh, but getting older it becomes harder and harder to find other people to play with so i loved (and still love) that this game was completely viable to play by yourself.\n\n \n\nI purchased the core set and all the mirkwood APs in one purchase on amazon not long after playing with my friend.  According to my order history, ten days later i ordered kazad-dum and all the darrowdelf APs released up until that point (which i believe was up to foundations of stone).\n\n \n\nI've been eagerly awaiting each new release ever since"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899499","commentId":899499,"userName":"Olorin93","timestamp":1383155708,"content":"Good initiative getting this thread started! Great to hear from everyone.\n\n \n\nMy name is Kristoffer. I live in southern Sweden. I study English at the university, and will move on to German this spring (my main focus is English, the German is mostly for fun and because it helps me understand the history of English and other northern languages. I like philology). I studied German for 6 years at school and English for 10, but my native tongue is Swedish.\n\n \n\nI like most things Tolkien (of course) both in book, film and game format, history, languages and travelling. My favourite city on Earth so far has to be Oxford (only been there twice but still). When I'm not playing LotR:TCG or studying, I'm probably watching English detective series or trying to write my own stories. Also been trying to learn a little Old English - and the Swedish and German definitely helps there. \n\n \n\nI got into TCG relatively recently - I think HoN may already have been out. I've been spending way too much money in too short a time on this, but it's so darn fun. I mainly play Lore/Spirit, but beginning to open up a bit to the other spheres. I play TCG with two friends as often as I can. We favour Elves/Rangers, Gondor and Rohan/Random cool cards, respectively.\n\n \n\nI like all kinds of music, really - Mozart to Iron Maiden. I often listen to instrumental music; my favourite composers are Hans Zimmer, Howard Shore and Adrian von Ziegler. The latter is mostly on Youtube and iTunes. Check him out, guys, he's amazing. I like chinese food. My favourite colour is green, but blue for clothing, and my toothbrush is currently pink - because that was the only one left in the pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899573","commentId":899573,"userName":"13thcaesar","timestamp":1383163356,"content":"> Hey Guys and Gals, I am brand new to LoTR LCG and I hope to get really into it, i find the concept amazingly enjoyable and I can not wait for my core set to come this friday. I hope to really get my gaming group into it and see what happens. I live in SoCal and have only one group of gamers and that is only comprised of 4 people... so my group is small hence why this game intrigued me.\n\nwelcome to the game  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI'm glad that there is another player who played for four players - as is clear from the probe richsabre, only two players have declared themselves to play with 4 players (my voice would be three ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ). The vast number of players playing solo.\nso is good that show up  another players playing multiplayers - I hope that more and more players will play for four players.\nThere is a big difference in the game solo and with 4 players - in the construction of decks, in the game, difficulty scenarios - so it would be nice to know the impressions, strategies, decks and progress in the various scenarios of other players playing with 4 players.\nI see that you bought only Core Set - if you start right away to play with 4 players, I'll tell you from without any problems, go three scenarios of Core Setu - base decks - what if you play solo it's hard for beginner players - \nespecially Escape from Dol Guldur.\nThis is great Cooperative game - I play before in Battlestar Galactica, Pandemic, Death Angel, Zombicide - and for my group LOTR LCG still be number 1  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\nEdited October 30, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899592","commentId":899592,"userName":"13thcaesar","timestamp":1383165559,"content":"> cool - i shall keep my eyes open. i am 'richardsabre' on the game....level 42. i only use the free to play system and use any turbine points to get packs, though i have only managed to buy evendim so far when they were on sale. for me it was either computers or cards....my thinking is that unlike my computer, cards dont break ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> rich\n\ngreat - level 42 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I can not wait to see Moria (i hear is amazing looking), but for this a long, long road ahead of me :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] . LOTR Online is a great game, well presented Middle-Earth and this  freedom to travel - it's just had a major impact on my idea of this campaign LOTR with a map - just want the players to feel the least freedom to travel though the Middle-earth, choose quests , paths, and explore this amazing world - that like in LOTR Online."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899604","commentId":899604,"userName":"Olorin93","timestamp":1383166564,"content":"I have a level 63 character on Lotro, but I'm on Eldar - and, alas, have very little time to play these days. Great game. Moria is indeed vast and fun to explore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899630","commentId":899630,"userName":"13thcaesar","timestamp":1383168203,"content":"> I have a level 63 character on Lotro, but I'm on Eldar - and, alas, have very little time to play these days. Great game. Moria is indeed vast and fun to explore.\n\ncongratulates :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] . I think that most players on this forum, playing LOTR Online. Both creators LOTR Online and LOTR LCG did a great job - do not waste license and used it to create great games, and did not release another crease as is unfortunately often the case with the licenses. I think that the movie Lord Of The Rings and The Hobbit also are great - I know that many people complain about the inaccuracy or adding new scenes, characters - but let's face it - there are no other films embedded in Middle-earth and we should be happy with Peter Jackson did these films - which are for me  really great, could have been worse as some movies under license.\n\n \n\nI think with us - Tolkien fans - we're really lucky - we have LOTR Online, LOTR LCG, great movies - all great set in our favorite world  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited October 30, 2013 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=899783","commentId":899783,"userName":"richsabre","timestamp":1383184823,"content":"thanks for all the posts.\n\n \n\n@13th caeser: i havnt been to moria....mainly because you have to buy it, and my computer is currently held together by tape.....i am currently stuck in annuminas trying to level up enough and collect enough points to get north downs or trollshaws.\n\ni am known on here for my disike of the films, which is partly true and partly myth. i wont go into the negatives as they can be guessed or are already known, however i do like the films very much, and i agree, they have brought a lot of great things to the world of tolkien that may not have been possible without them...i haven't seen the hobbit, mainy becuae i just havnt got any interest in it....the hobbit to me is fond childhood memory and i am satisfied with that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n@olorin93...funny enough, even though i am english, i have yet to visit oxford (its the opposite end of the country to me). have you been to northern england before?\n\nEdited October 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900072","commentId":900072,"userName":"Noccus","timestamp":1383233354,"content":"> @olorin93...funny enough, even though i am english, i have yet to visit oxford (its the opposite end of the country to me). have you been to northern england before?\n\nI walked from Newcastle to Carlisle once upon a time, following Hadrian's wall.\n\nLovely countryside, very tolkien-ish! Had a great time. Tho it was some 15 years ago...man time flies...\n\nEdited October 31, 2013 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900081","commentId":900081,"userName":"klaymen_sk","timestamp":1383234147,"content":"I'll introduce myself as well.\n\nMy name is Vladimir (but call me Vlad, I got used to it on BGG) and I live in Piešťany, a spa town in Slovakia. I work as a QA in one German company.\n\n \n\nI came to the game sometimes before Heirs of Númenor came out, but I've played it before with a friend. I didn't get hooked immediately because he did a piss poor job of explaining the rules (and played the game wrong anyways). Later someone on a local boardgaming site was selling a core set with two first APs for a good price, so I took it and since then I have purchased almost everything and I don't regret it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900085","commentId":900085,"userName":"richsabre","timestamp":1383234307,"content":"@noccus- i live near Carlisle, the country you are talking about is beautiful (though carlisle certainly is not)....i feel sorry for the roman soliders garrisoned there during the winter ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\n@klaymen_sk - thanks for posting :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich\n\nEdited October 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900141","commentId":900141,"userName":"Thanatopsis","timestamp":1383240523,"content":"I throw myself into the fury:\n\n \n\nMy name is Matt.  I live in Iowa, USA, which is mostly known for its corn and soybean, but trust me there is a bit more than that going on here.  I work as an Electrical Engineer and spend my days playing with antennas.\n\n \n\nI discovered Tolkien in 1997.  I was walking through the SciFi/Fantasy section of my local bookstore and I saw this huge, thick book (the whole trilogy in one). On the cover was this glorious city (Minas Tirith). I read the back of the book and knew I had to have it.  But, alas, I was an 8th grader with no money.  I saved up (rather, I probably begged my mom for the money) and bought the book. I am so happy I read it before the movies.  I hold my original imaginative visions of the book dear to my heart: The Flight to the Ford especially.  My mind did that scene so much better than Peter Jackson :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900165","commentId":900165,"userName":"richsabre","timestamp":1383242549,"content":"thanks for posting - i know exactly what you mean about holding imaginative memories close to your heart - the beauty of literature compared to film\n\nrich\n\nEdited October 31, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900212","commentId":900212,"userName":"Noccus","timestamp":1383246006,"content":"> @noccus- i live near Carlisle, the country you are talking about is beautiful (though carlisle certainly is not)....i feel sorry for the roman soliders garrisoned there during the winter ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n>  \n> \n> rich\n\nI came over the North Sea at the time by ferry from Rotterdam, and landed in Hull.\n\nAs I said, it was 15 something years ago, but I must say I was quite shocked by the amount of abandoned buildings.\n\nIt really felt like a ghost-town. Then we took the train north to Newcastle and loved it. Great nightlife!\n\nThen along the way some quiet little villages (I only remember Haltwhistle by name now) which where nice when hiking east.\n\nHang on....Greenwhich? Greenwood-something? Other town. Met a lot of friendly & helpful people!\n\nAnyway, when we got to Carlisle, I must confess, I was amazed by the....eh....low social class, to say it nicely.\n\nI hope I don't offend you Rich, but it felt quite poor, ugly (as you say it still is) & industrial.\n\nWe were ill at ease at the pubs at night, as not just one time locals tried to pick a fight...\n\nTho this was in the late 90's and things may certainly have changed since then.\n\nAnyhow, this was just 1 minor thing on a great trip!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900300","commentId":900300,"userName":"richsabre","timestamp":1383257053,"content":"haha - not offended at all. i dont particularly fit in where i live....in an area which is 'traditional' (again to put it nicely) and i am ....er...not so traditional in my beliefs or ethics (again to put it nicely.)  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nnot that everyone up north is like that of course, but carlisle is a spectacular example of a place where you dont want to be drinking after dark.....if you had only gone another 30 miles west you would have reached the beautiful lake district, which would have made up for carlisle\n\n \n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900387","commentId":900387,"userName":"sapender","timestamp":1383268840,"content":"Hey there everyone,\n\n \n\nMy name is Pat... I live in Canada... Ottawa to be exact... I love Tolkien and his wonderful world... I started gaming when I was 8, playing D&D and any board game I could get my hands on... I play games with a bunch of friends every week... we play Descent, Smallworld, Blood Bowl Team Manger and many more... when we all (5 of us) can't get together we usually play LotR which none of us really mind of course... LotR LCG is my favorite game by far... I love the theme and cooperative nature to the game... I scour this forum probably every day for Ideas... Thanks to everyone posting there decks/ ideas..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900392","commentId":900392,"userName":"richsabre","timestamp":1383269467,"content":"thanks for posting sapender :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900887","commentId":900887,"userName":"Zalrus9","timestamp":1383343430,"content":"Hello! My name is Charles, and I currently live in Washington, D.C. My first foray into Tolkien was the Rankin/Bass versions of The Hobbit and The Return of the King. I had not (and apart from The Hobbit still have not) read any of the books, although I did see The Lord of the Rings movies and thought them to be alright. To be honest, I kind of didn't have too much of an interest in Tolkien, perhaps because the setting for the most part has been emulated so much up to this point in other mediums. However, I have, and still love the giant eagles. Can't go wrong with those!\n\n \n\nHowever, I did pick this game up because I love cooperative or solo-play games, and I learned that yes, you could play as the eagles. So I started into it! Oddly enough, through this game, I now have a new-found appreciation with Tolkien and his work, from talking and reading and listening to people talk about this game in relation to his work. And to top it off, I just love the variety of deck ideas and combinations that have arisen over these past few cycles, which is really nice. I have to say, this is a really nice community, and I hope it says as supportive as I have seen it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=900892","commentId":900892,"userName":"richsabre","timestamp":1383344109,"content":"hello Zalrus9- thanks for posting!\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=901147","commentId":901147,"userName":"Migwald","timestamp":1383399119,"content":"Thought I'd post as no one else seems to be from England. I live in Gloucester in SW England and have been playing the game for just over a year. I am a fan of all things Middle Earth and play Lotro (Eldar server), collect Games Workshop models and enjoy the books and films. This is the only card game I play simply because of the Tolkien theme and really enjoy it even though its flippin hard!!!\n\nIn real life I work for a health products company as a Qualified Person and my other interests are fishing, rugby and music - most types of music, mainly indie and definitely not rap.\n\nIn the game I have yet to get Heirs of Numenor but recently got Black Riders and enjoy the thematic feel of the first quest (not tried the others). I generally play solo now my son has gone to University as I can't persuade the wife to have a go, but will play two player when he's back during the loooong holidays these students get! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nPlayer such as Richsabre really make the game more enjoyable and I regularly peruse the forums to check whats occurring and clarify some grey areas in the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=901171","commentId":901171,"userName":"richsabre","timestamp":1383402963,"content":"thanks Migwald :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ...there are a few more UK players here, though i dont think they have posted for a while.\n\nrich\n\nEdited November 2, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=901412","commentId":901412,"userName":"player1761766","timestamp":1383437784,"content":"I think I might have posted in that thread glaurung mentioned, but to keep up the British side I'll go again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI'm Mark, from Wrexham in N Wales (quite a bit of Tolkienesque country we've got here, too!) This was kinda my first LCG, I bought it after enjoying Rune Age so much so wanted to see what else FFG had in the way of card games. This and Warhammer launched the obsession, anyway. I can't quite remember now, it was either HfG or JtR that was the current pack when I jumped aboard. I've been enjoying the ride ever since, despite a small rift in my LotR romance around the time of the Dwarrowdelf, when it seemed to be impossible to enjoy this game in a casual way.\n\nI have a massive collection of games, but when I'm not rolling dice and such I'm usually at work on my own open university degree (or, y'know, at work). I've recently embarked on 'year two', which has suddenly become a lot more gruelling than the first year stuff, and has left distressingly little time for gaming. I mean, I've had Blood of Gondor for over a week now but have yet to break it out! The course, in case you're all wondering, is History with Classical Studies :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI'm somewhat obsessed with history, and like to go off around the country as often as possible visiting ruins and the like - I actually did Hadrian's Wall myself two years back! I am a big fan of opera, too - my nickname spalanzani is a character from Offenbach's Tales of Hoffmann, which I know you're deeply fascinated to know! As should be evident by now, I like to ramble inanely, too..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=901422","commentId":901422,"userName":"richsabre","timestamp":1383438800,"content":"thanks for posting spalanzni- didnt know i had a fellow OU student here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] . i am about half way through yr 2 also, its certainly a different pace from yr 1 though its not too bad. i am currently awaiting my astronomy exam results..... :wacko: [//content.invisioncic.com/Mfantflight/emoticons/default_wacko.png]\n\nrich\n\nEdited November 3, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=901578","commentId":901578,"userName":"Dedalus","timestamp":1383477160,"content":"Back in the 90's friend introduced me to Tolkien's work on a very strange way. He was reading a parts from the books to me, and at the same time he drew sketches on a piece of paper. I don't have to explain how awesome that was... In years to come, he moved to Italy because he was accepted to some Art academy there and I've heard he did some design and artwork for Blizzard...\n\nIn 2007-2008 I've played MetW in local gaming club and at the same time I was collecting some Space Marines and Confrontation miniatures during my studies in Belgrade. Warhammer Invasion kept my atention for about 2 years. Now, I am playing LotR LCG mostly alone and when I have some free time. Still stucked on the Core Set though.\n\nFinaly, I am from Serbia. I work as a high school teacher in my town on the north of the country.\n\nEdited November 3, 2013 by Dedalus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=901585","commentId":901585,"userName":"richsabre","timestamp":1383481099,"content":"thanks for posting Dedalus\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=902683","commentId":902683,"userName":"Olorin93","timestamp":1383642877,"content":"@richsabre - No, I have yet to venture north of Oxford! Other than that, I've only been to London, Stratford-upon-Avon and Bath. I would love to visit the north some time. The rivers and hilly landscape looks absoutely beautiful!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=902781","commentId":902781,"userName":"ClydeCloggie","timestamp":1383659313,"content":"Martyn here.\n\n \n\nDutch, but living in Scotland with wife and three kids. I'm a medical scientist by profession, a mountain biker, metal head and failed musician by hobby. \n\n \n\nI have a long history of Tolkien cardgaming starting with Middle Earth CCG, the most fantastic game ever, in the early 1990s. For a while I edited the Middle Earth Card of the Day for that game under the nick Fram Frumgarson. I also played the Decipher movie game but did not really like it - mainly because MECCG was such a hard act to follow.\n\n \n\nI have played the LCG from the start, always solo as I know of no other players and I wouldn't be able to commit to regular meet-ups anyway what with life getting in the way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=902818","commentId":902818,"userName":"richsabre","timestamp":1383664671,"content":"thanks for posting clydecloggie- i guessed scotland had something to do with you :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=906611","commentId":906611,"userName":"chuckles","timestamp":1384214225,"content":"Craig here,\n\n \n\nI'm from Auckland, New Zealand, married and have two daughters. Job wise i'm an sales analyst and I'm quite new to this type of card game.\n\n \n\nStarted playing when I released I needed a break from excessive amounts of screen time (work & PC gaming). \n\n \n\nLoving that this game is Lord of Rings based, solo & Co-Op, has amazing art work and that I've generally found this game quite challenging (though much less of late... especially looking at you Amon Din!). \n\n \n\nI almost stopped playing before getting Heirs of Numenor as the initial reports, I read, seemed to make the game sound so ridiculously hard that it wasn't worth it... in practice I think they are some of my favorite quests... and I finally had a reason to field lots of tactics Hero's."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=906636","commentId":906636,"userName":"richsabre","timestamp":1384216854,"content":"thanks for posting chuckles\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=907802","commentId":907802,"userName":"scottindeed","timestamp":1384340242,"content":"Hi everyone,\n\n \n\nI am Scott, 34, I live in South London, UK and have been married for 5 1/2 years.\n\n \n\nI work as an IT Systems Manager for charitable/religious organization.  I have a Master's Degree in Astrophysics (great that you are studying it too Richard!)\n\n \n\nIn my spare time I run, gym, movies, video games, read...  I'm a huge fan and collector of David Bowie's music.  I even fronted a David Bowie tribute band for 4 years.  I also song-write and play guitar, and occasionally play my own stuff live.\n\n \n\nI got heavily into this game when it first came out and was on these boards a lot.  I sort of burned out with it though and stopped playing for nearly a year.  The last pack I bought was 'Shadow and Flame'.  I've now got interested again, and am rediscovering and enjoying the game again.  \n\n \n\nI'm a thematic player and always build themed decks.  I'm making sure this time to take my games slowly and think about the story as I go along - and I'm no longer keeping score!\n\n \n\nI've got some catching up to do with expansions.  I hope to get the Heirs of Numenor set soon and I've stuck the Hobbit expansions on my Christmas list!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=907811","commentId":907811,"userName":"richsabre","timestamp":1384341012,"content":"thanks for posting scottindeed- great to see a fellow astronomer here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=908772","commentId":908772,"userName":"CJMatos","timestamp":1384440992,"content":"Hi,\n\n \n\nI'm Carlos Matos, i live in Portugal and i'm single.\n\n \n\nI am a Solicitor and work on my own. Sometimes i teach in my area.\n\n \n\n \n\nWhen i knew the game i entered heavily on it and i have all the packs and Massing. I would like to have the others PoD but they never got on sale.\n\n \n\n \n\nI am a newbie at deckbuilding not being very thematic, although i like some thematic decks that are around but am a very regular player, with at least a game per day."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=908809","commentId":908809,"userName":"richsabre","timestamp":1384442908,"content":"thanks cjmatos for posting\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=909215","commentId":909215,"userName":"Karlson","timestamp":1384476040,"content":"I'm just now getting around to posting on this because I can definitely be considered a new player since I first got into the Lord of the Rings LCG in July.\n\n \n\nMy name is Casey and I currently live in Southwest Missouri but will be moving to Bloomington, Indiana next Fall to begin my education as an optometrist at the Indiana University School of Optometry.  (I'm also hoping to go to Gen Con for the first time now since I'll be less than an hour away from Indianapolis!)  \n\nI have been a huge fan of all things Tolkien since middle school when I first watched the Fellowship of the Ring on VHS at a friend's house.  Since then, I have acquired a considerable collection of action figures as well as all the LEGO sets that have come out, but I hadn't gotten into the LCG... yet.  However, on July 7th of this year (my birthday) the same friend who I watched the Fellowship of the Ring with over 10 years ago bought me the core set.  \n\n \n\nI had never played an LCG before and heck, my experience with board and card games in general was pretty minimal (I mostly played LotR Risk and Ticket to Ride with friends - and that's about it.)  So, picking up the gameplay and structure of the game took a decent learning curve, but I was absolutely hooked before too long.  I dove right in and starting ordering expansions and adventure packs right off the bat and before long I had the whole collection (I'm still apologizing to my bank account!)\n\n \n\nNow, even though I'm still a busy student finishing up my Bachelors of Science in Biology, I love playing when I get a chance.  Perhaps the best thing about this game is the fact that it is single player, which allows me to play whenever I want and not just when I'm with people who are willing to play (I'm still trying to convince my fiancée to give it a go though - I lost her when I brought up hit points and attack damage!)   At any rate, I anxiously look forward to the future of the game and can't wait to get my hands on the Voice of Isengard expansion!\n\n \n\nP.S.  This online community of fellow players has been extremely helpful and fun to interact with over the past few months, an attribute that is rare among most online internet forums.\n\nEdited November 15, 2013 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=909225","commentId":909225,"userName":"richsabre","timestamp":1384477953,"content":"thanks for posting karlson- this was also my first real card game, and in fact remains the only one. i must have spent months prior to the game's release looking for a decent solo ccg and the very month this was released i stumbled upon it....great luck :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=910271","commentId":910271,"userName":"monkeyrama","timestamp":1384614998,"content":"Hey everyone,\n\n \n\nI'm Peter, and I live and work in Edinburgh in Scotland. I think I've been on this forum more or less since the beginning of the LOTR LCG but have trouble finding enough time to engage properly with it, so this is both an introduction and an apology for not getting more involved in the excellent community on here!\n\n \n\nAlways been a huge Tolkien fan, used to read LOTR every Christmas - and actually I should start doing that again - and also like to find solo games, so this one was a perfect match! I also play a lot of other boardgames, and am very fond of the Eurogamer style games (although Arkham and BSG have a place in my heart) but LOTR is the only LCG I have the time or money for at the moment. I don't play as much as I would like, but having recently completed a PhD in Classics (Ancient History) and now starting a job lecturing in Edinburgh has rather cut down on the time I would invest. I tend to try to find interesting (to me) rather than powerful decks, and I have to say I've really enjoyed the new directions that this game has taken recently. Now I just need to find the time to play the new quests more than the once over they get right now!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=910295","commentId":910295,"userName":"richsabre","timestamp":1384619064,"content":"thanks for posting monkeyrama - classicial history is a fascinating subject ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=910580","commentId":910580,"userName":"Hastur360","timestamp":1384665621,"content":"Hello to everyone,\n\nMy name is Dennis, I am from Florida, USA. I have been playing LOTR LCG since the beginning and have been enjoying every minute of it. I am a manager for my local friendly game store so I play the game and many other games quite a bit. I generally play every week with three other players (I am a 4 player!). I play solo quite a bit as well. I started a blog site for a while called Entmoot, though I know I have been lax in updating that page. I too have played LOTROnline. I started playing that game since Beta and I own two life time subscriptions to it. My main server is Landroval but I have not played in some time. My main character there is a 65 Human Burglar. I have also played both MeTW and the Decipher LOTR ccgs. I have read several of the books Hobbit, The Lord of the Rings, the Silmarillion, Children of Hurin, Unfinished Tales and working my way into the History of Middle Earth books. You could say I am a fan of Tolkien.\n\nI am very happy to be part of this awesome community of players we have.\n\nEdited November 17, 2013 by Hastur360"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=910646","commentId":910646,"userName":"leptokurt","timestamp":1384679143,"content":"About time to introdcue myself, isn't it?\n\n \n\nMy name is Jörg, I'm 38 years od and I'm from Hesse, Germany. I'm a teacher for maths and history. Before that I got a degree in Eastern european history and did some economics, too.\n\n \n\nLoTR is my first LCG and the only one so far, as my spare time is limited and my friends don't share my interest in fantasy and games (loosers!), which is why I'm playing mostly solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=910708","commentId":910708,"userName":"richsabre","timestamp":1384697519,"content":"@hastur360 - thanks for posting. you must have a profession many people here are jealous of :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n@leptokurt -thanks for the introduction- nice to put a name to a name (if that makes sense)\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=912002","commentId":912002,"userName":"monkeyrama","timestamp":1384867549,"content":"> thanks for posting monkeyrama - classicial history is a fascinating subject ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> rich\n\n \n\nIt is! Just about the only downside to doing a thesis was having to concentrate so much on such a small area of the whole history (I study about 30 years of Sicilian history, when there are almost no sources, and those that exist are not so reliable...). Rather looking forward to teaching entry level ancient history again if I can weasel my way into the career! Republican Rome is my personal favourite."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=912127","commentId":912127,"userName":"ClydeCloggie","timestamp":1384877144,"content":"Edinburgh eh? Right country, wrong town.  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=933904","commentId":933904,"userName":"Noccus","timestamp":1387409078,"content":"> Craig here,\n> \n>  \n> \n> I'm from Auckland, New Zealand, married and have two daughters. Job wise i'm an sales analyst and I'm quite new to this type of card game.\n> \n>  \n\nAuckland! Man that's a mighty fine city!\n\nI actually considered moving to New Zealand after my visit many years ago.\n\nThe kiwi's I met were so open and friendly.\n\nAnd the raw nature is just....breathtaking!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=933964","commentId":933964,"userName":"chuckles","timestamp":1387414637,"content":">  \n> \n> > Craig here,\n> > \n> >  \n> > \n> > I'm from Auckland, New Zealand, married and have two daughters. Job wise i'm an sales analyst and I'm quite new to this type of card game.\n> > \n> >  \n> \n> Auckland! Man that's a mighty fine city!\n> \n> I actually considered moving to New Zealand after my visit many years ago.\n> \n> The kiwi's I met were so open and friendly.\n> \n> And the raw nature is just....breathtaking!\n> \n>  \n\nThanks, really glad coming here was a really positive experience for you. I agree that we have some absolutely stunning scenery.\n\n \n\nDid you travel though much of New Zealand?\n\nEdited December 19, 2013 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=934194","commentId":934194,"userName":"Noccus","timestamp":1387451088,"content":">  \n> \n> >  \n> > \n> > > Craig here,\n> > > \n> > >  \n> > > \n> > > I'm from Auckland, New Zealand, married and have two daughters. Job wise i'm an sales analyst and I'm quite new to this type of card game.\n> > > \n> > >  \n> > \n> > Auckland! Man that's a mighty fine city!\n> > \n> > I actually considered moving to New Zealand after my visit many years ago.\n> > \n> > The kiwi's I met were so open and friendly.\n> > \n> > And the raw nature is just....breathtaking!\n> > \n> >  \n> \n> Thanks, really glad coming here was a really positive experience for you. I agree that we have some absolutely stunning scenery.\n> \n>  \n> \n> Did you travel though much of New Zealand?\n> \n>  \n\n \n\nYes, I've traveled extensively through New Zealand; as it is not next door for me.\n\nIt's been 11 years, and I can't remember all the places I've stopped, but the route was roughly:\n\n \n\nAuckland - Hamilton - Rotorua - Taupo - Napier - Waipawa - Upper/Lowe hutt - Wellington -Ferry to Picton - Kaikoura - Christchurch - Dunedin - Cromwell/Queenstown - Through the national parks up to Nelson - back to Picton/Ferry - other route by Whanganui & Te Kuiti back to Auckland.\n\n \n\nDid alot of awsome outdoor stuff! Parachute, Bungy jumping, Scuba diving, Spelunking & lots of trekking.\n\nIt'll be alot to tell all about it here tho. Just wanted to let you know that I love NZ ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=934195","commentId":934195,"userName":"Noccus","timestamp":1387451259,"content":"Oh I forgot Jet boat racing on a river's rapids & whale spotting!\n\n \n\nGreat memories..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=939030","commentId":939030,"userName":"Legoland","timestamp":1388125835,"content":"Hey,\n\n \n\nI´m Robert from Germany. 29 years old married LOR fan with one little Hobbit that made my day ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] (and takes now allmost all time of the day...)\n\nI already plaied LOR LCG a few years befor. But I was more interested in MMORP that time. No that me time is becoming realy rare I looked for games which do not take the whole weekend ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] So I get back to that fantastic (maybe not perfect balanced but challanging) game.\nSometimes I think about to try LOR Online (free Modus) but still not knowing if it´s worth the time?\n\n \n\nSo I wish you all a \"Guten Rutsch!\" as we say in Germany ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] Or in english: Happy new year and a allways perfekt start up hand ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited December 27, 2013 by Legoland"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=943959","commentId":943959,"userName":"chuckles","timestamp":1388737512,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > Craig here,\n> > > > \n> > > >  \n> > > > \n> > > > I'm from Auckland, New Zealand, married and have two daughters. Job wise i'm an sales analyst and I'm quite new to this type of card game.\n> > > > \n> > > >  \n> > > \n> > > Auckland! Man that's a mighty fine city!\n> > > \n> > > I actually considered moving to New Zealand after my visit many years ago.\n> > > \n> > > The kiwi's I met were so open and friendly.\n> > > \n> > > And the raw nature is just....breathtaking!\n> > > \n> > >  \n> > \n> > Thanks, really glad coming here was a really positive experience for you. I agree that we have some absolutely stunning scenery.\n> > \n> >  \n> > \n> > Did you travel though much of New Zealand?\n> > \n> >  \n> \n>  \n> \n> Yes, I've traveled extensively through New Zealand; as it is not next door for me.\n> \n> It's been 11 years, and I can't remember all the places I've stopped, but the route was roughly:\n> \n>  \n> \n> Auckland - Hamilton - Rotorua - Taupo - Napier - Waipawa - Upper/Lowe hutt - Wellington -Ferry to Picton - Kaikoura - Christchurch - Dunedin - Cromwell/Queenstown - Through the national parks up to Nelson - back to Picton/Ferry - other route by Whanganui & Te Kuiti back to Auckland.\n> \n>  \n> \n> Did alot of awsome outdoor stuff! Parachute, Bungy jumping, Scuba diving, Spelunking & lots of trekking.\n> \n> It'll be alot to tell all about it here tho. Just wanted to let you know that I love NZ ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n>  \n\nWow you have probably seen more of NZ that many of the locals... would have replied sooner but I was off enjoying some of the scenery over the Christmas break :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=953149","commentId":953149,"userName":"Noccus","timestamp":1389623394,"content":"Yea I get that alot. I’ve been around in my glory days.\n\n \n\nI’ve been hesitant to post about it here in the introduction threat though, as it feels quite like bragging to me.\n\nBut I just can’t resist to tell people I’ve been to their country when I read where they’re from.\n\nWell, now I’m writing this I might as well introduce myself too. Better late then never.\n\n \n\nI’m a Dutchman, meaning I hail from the Netherlands.\n\nMy name is Menno, which is a very Dutch name, and I usually introduce myself as Mike in english and Miguel in Spanish to couter the “what?” and “que?” questions.\n\nAs some might have guessed from some of my posts, I’ve traveled extencively around the world. For almost 3 years on end, and have been on all continents, and in many countries.\n\nSo I’m hereby the self-proclaimed Strider of this community ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nI’m a bit odd this way though, as on the one hand I love all outdoor stuff, like hiking, biking, rock-climbing, diving, hunting and so on.\n\nAnd on the other hand, I’m this huge nerd who likes books & video games & rpg’s.\n\nWhich explains why I am here. J\n\n \n\nNow my traveling days are over and I’m married with children.\n\nI work in the R&D on medicine and spend my days fiddling in a lab.\n\nThese two things suck up most of my time now really.\n\n \n\nSo, nice to meet you all, as I did read all your introductions, and sorry for not introducing myself sooner.\n\nI’ll add that this is a great community with friendly and helpfull people.\n\nAnd that's is rare on the internet these days.\n\nKeep it up guys, as I like it here; even though I lurk here more then I post.\n\nBut me thinks quite a few of you share this trait ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92801-introductory-thread-new-player-thread/?do=findComment&comment=998573","commentId":998573,"userName":"Noccus","timestamp":1393582442,"content":"You know what? I'm bumping this thread for the newer guys in the community :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}