{"url":"https://community.fantasyflightgames.com/topic/92808-general-question/","title":"General question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899012","commentId":899012,"userName":"Tsurara","timestamp":1383083283,"content":"Hey guys I am sure this has been asked hundreds of times but I dont have the time here at work to peruse every page.\n\n \n\nMy main question is I am brand new, i just bought my core set last night and am waiting in the mail.\n\n \n\nIs it really necessary to purchase two coresets for 4 players? or does it just boil down to not having two threat counters? i saw some people on ebay selling just the threat counters and extra dmg/resource etc tokens saying thats all that was needed to make it eligible for four players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899026","commentId":899026,"userName":"richsabre","timestamp":1383084182,"content":"well, my personal opinion is that it is not neccessary to begin with but you probably will want to later on\n\n \n\nyou can make 4 beginner decks with 1 core set, and have 2 players write threat down on paper and use something else for tokens\n\n \n\nas you advance you will want to start building 50 card multipshere decks and you will probably want to buy another\n\nalternatively you could concentrate on building your collection for expansion packs which will give more options\n\nrich\n\nEdited October 29, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899031","commentId":899031,"userName":"Tsurara","timestamp":1383084497,"content":"My initial plan is to buy one core set, figure into which sphere each of the four people prefer (i personally like lore, but in the future ill dual lore and tactics cause i <3 battle dwarves) then just buy adventure packs/expansions and let each person pick frmo then what they want per their sphere, then as i buy more and more i would assume the sphere to player count would grow allowing everyone to multisphere as we would have building options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899036","commentId":899036,"userName":"richsabre","timestamp":1383084932,"content":"yes, you will be fine if you play this way and if you are ok with the threat and counter things. also i think you will find you will want to start mixing spheres quicker than you expect- there's so many great options and combos, however they usually do require some cross sphere mixing\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899039","commentId":899039,"userName":"Tsurara","timestamp":1383085106,"content":"Sounds good to me. I was lucky enough to find your adventure pack/deluxe order list so I will follow that in purchasing and hopefully we will find a series of characters we all like to use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899050","commentId":899050,"userName":"richsabre","timestamp":1383086762,"content":"> Sounds good to me. I was lucky enough to find your adventure pack/deluxe order list so I will follow that in purchasing and hopefully we will find a series of characters we all like to use.\n\ngreat :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] - welcome to the game\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899092","commentId":899092,"userName":"Style75","timestamp":1383090785,"content":"Hi, don't worry about buying a second core set just to get the threat trackers. You can just use a pencil and some scrap paper or if you have any RPG dice, you can use two d10's.\n\n \n\nThe real reason to get a second set would be to pick up a second copy of the best cards like \"Unexpected Courage\" which were only included as singles in the core set. BUT.....  lots of people have fun playing the game with only one core set.\n\n \n\nMake sure you check out the following link:\n\nhttp://talesfromthecards.wordpress.com/new-player-guides/ [http://talesfromthecards.wordpress.com/new-player-guides/]\n\n \n\nI particular check out the new player buying guide which gives you everything you need to know about which AP's are the best for the style of game you want to play.\n\n \n\nHave fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92808-general-question/?do=findComment&comment=899705","commentId":899705,"userName":"camacazio","timestamp":1383175502,"content":"If you really like the idea of having everybody pick their own favorite single sphere, the latest cycle starting with the Heirs of Numenor box definitely supports that angle."}]}