{"url":"https://community.fantasyflightgames.com/topic/92900-wild-bear-feint-and-combat-action/","title":"Wild Bear, Feint, and Combat Action","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/92900-wild-bear-feint-and-combat-action/?do=findComment&comment=900202","commentId":900202,"userName":"JYoder","timestamp":1383245202,"content":" \n\nDuring staging, if Wild Bear is drawn and Ambush has him engage a player, can you play Feint to avoid it? (I assume you can't because the bear is already attacking, but not sure.)\n\n \n\nThough in general, when an enemy attacks you outside of the Combat Phase, can you ever play Feint? It's labeled as \"Combat Action\", yet the FAQ says you are to follow the 4 steps in the combat phase, so I don't know if that means \"Combat Actions\" are legal to play or not.\n\n \n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/92900-wild-bear-feint-and-combat-action/?do=findComment&comment=900218","commentId":900218,"userName":"Mndela","timestamp":1383246609,"content":"I'd say yes, you can. As normally, in the first step of 4 steps of combat phase, is when you play feint. So immediate attacks also is so.\n\n \n\nAnyway, i want to hear other players what they say. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] . Let's see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/92900-wild-bear-feint-and-combat-action/?do=findComment&comment=900338","commentId":900338,"userName":"GrandSpleen","timestamp":1383261980,"content":"If it's a combat action, or quest action, or travel action, you must play it within that designated phase.  An attack made outside of the combat phase follows some steps that at written within the combat phase portion of the rulebook, but it is still by definition an attack \"outside\" of the combat phase.  Couldn't use Feint.\n\n \n\nAlso, you're right about the bear: Feint can't prevent an attack that has already begun.  There is a bit in the FAQ about the timing of Feint.  It has to be played before step 1 of attack resolution.  Step 1 is \"choose an attacker.\"  The bear's Forced text does that bit for you, so once the bear engages you it's too late to play Feint.\n\nEdited October 31, 2013 by GrandSpleen"}]}