{"url":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/","title":"Voice of Saruman expectations","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=901965","commentId":901965,"userName":"legolas18","timestamp":1383539342,"content":"The forums seem a bit dead without some sort of spoilers, so I was just wondering.. What are you guys looking forward to in the Voice of Saruman? What do you think should be included? Personally, I'd really like it if they emphasized Tactics (I know, Heirs of Numenor already did that) and Spirit, since they are the Rohan spheres. I'd really like it if they somehow made Tactics a plausible option in solo play. Maybe they could build on the Legolas trend with cards putting progress directly on the quest. That way, Tactics could still maintain their fighting abilities, but also able to play mono-sphere. What do you guys think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902068","commentId":902068,"userName":"Nickpes","timestamp":1383562436,"content":"I expect some cards that boost up Rohan and offcourse Elves ... but since we have at least one Isenguard card (The guard) , it will be interesting to wait and see if this could develop in a new trait"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902071","commentId":902071,"userName":"Jekzer","timestamp":1383563022,"content":"Not Voice of Saruman, but Voice of Isengard (as it's the name of the deluxe expansion  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ), but I am with Nickpes, they can exploit now the Isengard trait, along with some elven love. We've seen some images of elves (new Gildor? new Arwen?) so if the cycle explores several zones of Rohan and whereabouts (like Fangorn forest, Lothlórien), we can see them.\n\n \n\nAnd of course, the martial force of the Rohirrim!\n\n \n\nI am more curious if we're going to see new player card mechanics aside from Doomed X. Every cycle since Dwarrowdelf has developed one (secrecy, mono-sphere decks), we'll see if there's a new one of if it's the new Doomed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902080","commentId":902080,"userName":"ana4","timestamp":1383564440,"content":"I believe the doomed cards will be the new mechanics. It will likely make Lore Aragorn and Spirit Glorfindel even better.\n\n \n\nI would like to see more Elves, something to give them a combining feel. Not like Dwarves or Outlands, they were rather unfortunate, I think, but more reasons for having more Elves in one deck.\n\n \n\nOf course Rohirrim, they have got a lot of cards already so all they need is a trick or two to bring some of the older cards back to spotlight.\n\n \n\nI am not very fond of seeing an Isengard trait. Whilst it is intriguing in a way, I do not think it is worth investing (card slots) into a faction like that. I would much rather see more Bardings or Beornings (though not particularly in this expansion)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902089","commentId":902089,"userName":"richsabre","timestamp":1383566150,"content":"i would like to see the return of secrecy to combo with the doomed trait. and as in my other threads a cavalry charge mechanic that can destroy infantry pretty easily\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902094","commentId":902094,"userName":"Nickpes","timestamp":1383566616,"content":"I believe that if we do not have a cavarly charge mechanic now, there wont be (ok, maybe on the LORT Saga that has the Pelennor Fields in) . Rohan means cavalry, so it should be their moment "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902281","commentId":902281,"userName":"ana4","timestamp":1383589259,"content":"Good points about the cavalry Rich and Nick. I also hope there will be cards supporting Mounts, because the Horse coming in Morgul Vale is just a terrible, terrible card without synergies. I have always hated wasted card slots."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902337","commentId":902337,"userName":"Nickpes","timestamp":1383594543,"content":"I just cannot imagine there wont be an attachment to allow theoden to play any rohan card regardless of sphaire ... It would be stupid"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902351","commentId":902351,"userName":"Nickpes","timestamp":1383595674,"content":"It could be an event card named \"forth eorlingas\" that could be played when Theoden is in game and would give +2 attack to all rohan characters till the end of the round"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902489","commentId":902489,"userName":"legolas18","timestamp":1383606924,"content":"Thanks for all the replies!\n\n@Jekzer: Haha, totally forgot that. I knew Voice of Saruman sounded wrong... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI agree with everything, I really hope there are mount cards. Some sort of general mount would be cool, that could attach to anybody to give them an attack boost or something. Also, that Forth Eorlingas idea is cool... They already have a bunch of other events that relate to progress and willpower, why not attack?\n\nI like the new doomed mechanic, but it's not my favorite. They'll probably make that the main thing, which is fine, but it would be cool if they would include all these other great ideas.\n\n@richsabre: What would the cavalry mechanic entail? Would everyone need some sort of mount to do it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=902494","commentId":902494,"userName":"richsabre","timestamp":1383607401,"content":"> @richsabre: What would the cavalry mechanic entail? Would everyone need some sort of mount to do it?\n\nyes- i was thinking specific ally cards, with the potential to have a mount that gives the trait.\n\nthe trait could do something like Cavalry X\n\n \n\n'when character attactks spend x resources to lower the defense of defending enemy by X\n\n \n\ntherefore better cards would have a higher base stat of X letting standard horsemen have perhaps 1 and elite 3 or 4. this way it means you havea good mechanic but its not overpowered because you not only need the card in play, you also need to pay the resources for it\n\n \n\nhopefully it would show the devastating effects of a cavalry charge. i mean there's a big difference between infantry and mounted combat, and this game so far makes little distinction- i think its a good time for the designers to play around with the idea (also it would be cool if the mechanic did not work against pikemen.....as anyone unfortunate enough to charge into a phalanx on a horse will know its not the best idea :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )\n\nrich\n\nEdited November 4, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=903152","commentId":903152,"userName":"camacazio","timestamp":1383702121,"content":"I always thought Dunhere was a wonderful representation of the advantages of mounted combat. We've seen too much stuff with archery that can replace him to make that distinct, though. I also still like that Riddermark's Finest is a creature rather than attachment, I would like to see more thinking along those lines.\n\nEdited November 6, 2013 by camacazio"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=903155","commentId":903155,"userName":"Gizlivadi","timestamp":1383702954,"content":"I don't think we will see any sort of cavarly type mechanic in this expansion. Save that for a Rohan focused expansion, or maybe a future saga. This one seems to be focused on knowledge and the influence of evil and corruption as represented by the Doomed keyword, with a few Rohan and Elves splashes here and there. I could be wrong though, who would've guessed when HoN came out that the next cycle would be all about Outlands?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=903270","commentId":903270,"userName":"timbolton","timestamp":1383720555,"content":"Voice of Saruman - as long as we don't get\n\n \n\nhttp://www.youtube.com/watch?v=zUcsRjyIKMI [http://www.youtube.com/watch?v=zUcsRjyIKMI]\n\n \n\nI'll be ok ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=903939","commentId":903939,"userName":"legolas18","timestamp":1383799131,"content":"Haha. I saw that recently! So funny! And I also really like that idea of the cavalry mechanic, but I have to agree with Gizlivadi. I'm not sure we'll see much Rohirrim/horse related things in this expansion, as it deals mainly with Saruman."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=906278","commentId":906278,"userName":"Scroll Lock","timestamp":1384190932,"content":"You all talking about cavalry must be very happy now, when Rohan Warhorse is known.\n\nHmm, my idea for Cavalry:\n\nCavalry character gains +1 ATK for each other cavalry character commited to attack while attacking a non-cavalry enemy.\n\nThis mechanic shows the massive power of group cavalry attacks.\n\n[sorry for my bad english, I am from Slovakia]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=906464","commentId":906464,"userName":"klaymen_sk","timestamp":1384203373,"content":"Damned, Scroll Lock, you are from Slovakia as well? That's quite unexpected.\n\n/offtopic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=906937","commentId":906937,"userName":"Scroll Lock","timestamp":1384262446,"content":"Why is it unexpected? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=907102","commentId":907102,"userName":"klaymen_sk","timestamp":1384272888,"content":"How many Slovaks have you met here? Or on other international sites, for that matter?\n\nI haven't met any, therefore I don't expect it. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited November 12, 2013 by klaymen_sk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=907733","commentId":907733,"userName":"legolas18","timestamp":1384325629,"content":"Yes! I for one am very happy. I hope we see more mounts. Maybe one for each sphere... That would be interesting. We have a Spirit and a Tactics, I wonder what the other spheres' mounts would do.. The Leadership mount could do something along the lines of \"Exhaust mount and attached hero to give every ally you control +1 Attack. Play only if all heroes you control are Leadership.\"\n\nThat could symbolize some sort of cavalry/charge mechanic, in the sense that the hero rides out and leads the allies to battle. And it would encourage mono-sphere. The Lore mount could do something with Rangers or Dunedain. It could do almost the reverse, and instead give the ranger characters more defense, to symbolize that they can get away and flee from their enemies faster. So many possibilities!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=907739","commentId":907739,"userName":"ana4","timestamp":1384326707,"content":"We already have Asfaloth in Lore, he is a mount too. It would be great to have a synergy for them, especially the Spirit one needs it badly, the other two are, of course, very good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=908011","commentId":908011,"userName":"Scroll Lock","timestamp":1384361047,"content":"Maybe some horse with text \"attached hero may attack to the staging area\".\n\nI think this is possible since there is \"Spear of the mark\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93032-voice-of-saruman-expectations/?do=findComment&comment=908111","commentId":908111,"userName":"Glaurung","timestamp":1384365398,"content":"> Maybe some horse with text \"attached hero may attack to the staging area\".\n> \n> I think this is possible since there is \"Spear of the mark\".\n\nYes looks like idea of Rohan deck will be Destroy all enemies where they are  and quickly questing.  Very thematic actually for Rohan"}]}