{"url":"https://community.fantasyflightgames.com/topic/93101-ungoliants-brood-from-nightmare-passage/","title":"Ungoliant&#039;s Brood from Nightmare Passage","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/93101-ungoliants-brood-from-nightmare-passage/?do=findComment&comment=902808","commentId":902808,"userName":"krokodiler","timestamp":1383663581,"content":"Its Forced effect is After you engage UB your cards cannot ready for the remainder of the round. Do you think that no matter what states are these cards in:\n\n- not exhausted when I engage and exhausted after engaging (e.g. for defending or attacking that UB),\n\n- already exhausted when I engage\n\nI just cannot ready them, even in Refresh phase?\n\nWhat about Unexpected Courage then? Can I ready hero thanks to UC?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93101-ungoliants-brood-from-nightmare-passage/?do=findComment&comment=902817","commentId":902817,"userName":"alogos","timestamp":1383664644,"content":"Well, it's written like this, so : not readying whatever the case (cannot take precedense) and refresh phase if before your next turn so, sure.\n\n \n\nIf unexpected courage is already exhausted, it will not ready either. We had a case were Dain had a ready unexpected courage and we keep it that way so we can ready Dain after the begining of the next turn.\n\n \n\nWellcome to nightmare !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93101-ungoliants-brood-from-nightmare-passage/?do=findComment&comment=902851","commentId":902851,"userName":"krokodiler","timestamp":1383668967,"content":"Yes, Nightmare mode can be devastating...\n\nI started playing today and the first two extra cards revealed during Setup were two Spider's Web...\n\nAnd later Forest Flies came... 4 pts of Threat is one thing, 1 pt of damage after engaging is another, and when I was engaged I read \"only 1 attack point\", ok, so it can be undefended - and of course Abandoned Camp was revealed and I had to discard all attachments of all players (I played solo two-handed): Citadel Plate and Steward of Gondor among others...\n\nAnd imagine a couple of Ungoliant's Brood in a row... You can't refresh your heroes, cannot quest, defend, attack during a couple of rounds. It is really difficult mode.\n\nEdited November 5, 2013 by krokodiler"}]}