{"url":"https://community.fantasyflightgames.com/topic/93149-question/","title":"Question??","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/93149-question/?do=findComment&comment=903432","commentId":903432,"userName":"Ozil23","timestamp":1383751528,"content":"Ok so I already have the core set, and I want to know: I want to get the FOS pack to get Glorfindel since he is my favorite character after Aragorn and Boromir. So my question is do I need to get first the Dwarroldelf (sorry if I wrote it wrong) expansion in order to play the pack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93149-question/?do=findComment&comment=903437","commentId":903437,"userName":"richsabre","timestamp":1383751635,"content":"you need to get the deluxe pack corresponding to the cycle- in this case khazad dum. then you can play any from that cycle\n\nthis is because the cycle packs use encounter sets from the corresponding deluxe pack.\n\nrich\n\nEdited November 6, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93149-question/?do=findComment&comment=903439","commentId":903439,"userName":"Ozil23","timestamp":1383751794,"content":"Ok, thank you Rich, so what other pack would you recommend from the Dwarrowldelf, in order to get a good deck using Glorfindel SP, maybe lorargorn?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93149-question/?do=findComment&comment=903446","commentId":903446,"userName":"richsabre","timestamp":1383752087,"content":"yes- certainy him. they are an excellet combo as glorfindel's low threat and a aragorn's threat reset allows for a deck that can take serious threat raises- i pair them with frodo but he is in the first cycle (conflict at the carrock)\n\na third good combo hero is elrond in shadow and flame. expensive but powerful, and of course with the low threat his high cost doesnt matter so much. elrond will let you play allies of any sphere giving even more scope in deckbuilding\n\nrich\n\nEdited November 6, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93149-question/?do=findComment&comment=903459","commentId":903459,"userName":"Distractionbeast","timestamp":1383752736,"content":"If you're cash-strapped, you can buy just the FoS AP without Khazad-Dum, but you won't be able to play the scenario (it requires encounter cards from the Khazad-Dum set).  The player cards are generally universal. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93149-question/?do=findComment&comment=904313","commentId":904313,"userName":"Olorin93","timestamp":1383848592,"content":"Lore Aragorn and the Arwen ally are great cards! They're in The Watcher in the Water, the third pack in Dwarrowdelf. I use Spirit Glorfindel all the time - great hero."}]}