{"url":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/","title":"Over powered decks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903538","commentId":903538,"userName":"wyrm187","timestamp":1383758683,"content":"I've played warhammer invasion and lotr lcg since they've come out. There isn t too much of a competitive scene in the US for WI but there is a competitive scene. So with that being said FFG has made a banned card list and restricted list to break up OP card combos. For those that don't know, Banned cards are obviously excluded from decks in tournament play and restricted cards can not be played with other cards on the restricted list, in the same deck. This has been a fairly good solution to break up card combinations that break the game and it has worked pretty well so far.\n\nAs far as I know there really isn't a competitive scene at all for lotr but I know there are several decks (outlands) that are OP and for me and some others it makes the game no challenge and not very enjoyable. I have enough self control not to play an Outlands deck and I don't because it isn't fun for me.\n\nMy question is , would you like FFG to release a restricted list or banned list in the future as a guideline to keeping the game more challenging? I for one don't think it's a necessity because I have self control and like making unorthodox decks and thematic ones. I would like it though to increase difficulty and give me tougher guidelines on deckbuilding. Even though I don't play competitively in WI my friends and I still follow the restricted list when deck building to keep one deck from dominating.\n\nIf you would like to see a restricted list , what cards could you see being on it? Thanks\n\nEdited November 6, 2013 by wyrm187"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903569","commentId":903569,"userName":"richsabre","timestamp":1383760821,"content":"i also would not want to see this.\n\n \n\nfirstly it would be hard to say which to ban....i mean take outlands- you would have to ban the whole race meaning that ffg would have made an entire race errated (in essence that is). ...and outlands is one of those races that depends on pretty much all of the cards, so banning one or two would almost have the same effect as banning all of them....to put that another way, outlands isnt powerful because of one or two cards (glorfindel etc.) but because of their very race mechanic....ie the stat boosts\n\n \n\nsecondly from my experience with the main amount of players, at least on this forum, most find it very difficult already...i know that said players wouldnt even need to look at a banned list, but some perhaps would feel obliged to carry them out to feel like they had achieved a true victory\n\n \n\ni wouldnt particulary mind if ffg did do a list as i never compete, even in player tournaments, and i know some would want this, but i feel nightmare/easy mode is ffg's way of dealing with the difficulty problems and i think its much better\n\nrich\n\nEdited November 6, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903573","commentId":903573,"userName":"Distractionbeast","timestamp":1383761099,"content":"I don't play competitively, so I can't comment about that, but I don't see any reason to restrict cards for cooperative play.  That's the beauty of co-op (or solo) play - you play the way you want to create the experience you want.  You're not screwing anyone else over by playing OP decks.  That's the main reason to restrict in other card games. \n\n \n\nEncounter decks have no ego to bruise. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903577","commentId":903577,"userName":"CaffeineAddict","timestamp":1383761390,"content":"I don't think we need a banned/restricted list, this isn't a competitive game.\n\n \n\nIf it was, I could understand having a banned/restricted list so that every player didn't need to play one of a few power decks to have a chance (MTG comes to mind), but with a game like this it's up the individual players.\n\n \n\nI've been disappointed with the challenge of recent quests, but that's largely because I can pick up a deck built to play a different cycle and win without needing to consider different deck building strategies.\n\n \n\nI think this requires two fixes:\n\n1. Create quest mechanics that scale better with the number of players.\n\n2. Create quest mechanics that cause some unique challenges for each quests - it doesn't necessarily have to be a really hard quest (though they are my favourites), just different enough that it requires some thought to the deck going in.\n\n \n\nI liked the Black Riders, not because they were super-hard, but because they were different, and required a bit more thought to play.\n\nEdited November 6, 2013 by CaffeineAddict"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903580","commentId":903580,"userName":"wyrm187","timestamp":1383761684,"content":"I think rich is right about nightmare decks adding to the overall challenge. I hope they make nightmare decks for every scenario. I thought it might just be good to have a guideline for broken combos but again I have enough control not to ruin my own experience lol. I am mostly a solo player btw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903581","commentId":903581,"userName":"richsabre","timestamp":1383761836,"content":"> I think rich is right about nightmare decks adding to the overall challenge. I hope they make nightmare decks for every scenario. I thought it might just be good to have a guideline for broken combos but again I have enough control not to ruin my own experience lol. I am mostly a solo player btw\n\nyes, control over one's own experience makes this game so much better. the nightmare decks are good as i said, though it would of course be even better to get a quest that is completely balanced as it is.....is this even possible? probably not. i think ffg do a great job, but i am not a very 'skillful' player despite my experience. thankfully i get much more than the wins out of the game (a good job it is too!)\n\n \n\nperhaps the nightmare packs are also a good thing to keep the game even more alive with more sales for ffg.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903582","commentId":903582,"userName":"Ellareth","timestamp":1383761837,"content":"I agree that over powered deck types need to be addressed as it makes the game unchallenging for 'Boromir' type players, but I disagree that solution is banned/restricted lists.\n\n \n\nInstead I want to see every trait get as powerful as Dwarf traits and jack up the difficulty level on new scenarios and via nightmare mode for old scenarios.\n\n \n\nI know this kind of power creep could put new players at disadvantage, but if the absolute cap of power is around the Dwarf deck (which is currently too powerful compared to other traits), and if we get one powerful trait in either delux or first adventure pack of a Cycle, and a second powerful trait that slowly emerges over the span of 6 adventure packs of Cycle it should work out; those that want to get into expansion can grab delux + first AP to get a very competetive deck (like what they did with Outlanders), and those who buys all the expansions would still have something to look forward to in player cards if a second trait is developed over time.\n\n \n\nFor example, following this model I think Against the Shadow Cycle could have kept Heirs of Numenor difficulty throughout the packs but give tons of focused Outlands trait in Steward's Fear and have atleast half of next 5 expansion cards focus on Gondor trait.\n\n \n\nDwarf decks probably shouldn't be out there when you look at their insane ability to cover most aspects of the game, but they are out there so rather than inching away from making another Dain Ironfoot or restricting We are not Idle / Lure of Moria, let's just crank up every trait to be as powerful as Dwarves as soon as possible and keep the power creep level there, rather than keeping the power creep level well below the Dwarf decks that already exist."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903584","commentId":903584,"userName":"richsabre","timestamp":1383761953,"content":"> Dwarf decks probably shouldn't be out there when you look at their insane ability to cover most aspects of the game, but they are out there so rather than inching away from making another Dain Ironfoot or restricting We are not Idle / Lure of Moria, let's just crank up every trait to be as powerful as Dwarves as soon as possible and keep the power creep level there, rather than keeping the power creep level well below the Dwarf decks that already exist.\n\nthis may work but my fear is that we will get far too many power cards and not enough weaker cards from now until the game ends\n\ni actually enjoy the weaker cards more than the more powerful ones.....they give more scope for clever play and theme playing\n\nrich\n\nEdited November 6, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903589","commentId":903589,"userName":"Tracker1","timestamp":1383762279,"content":"I don't really care if there is a restricted list or not, but I find these are the most powerful cards.\n\nI don't think they need to be restricted, because the future of competitive play for this game seems pretty dismal.\n\n \n\n1. Steward of Gondor\n\n2. Vilya/Elrond\n\n3. Outlands Trait\n\n4. Dain Ironfoot\n\n5. Glorfindel /Light of Valinor/Asfaloth\n\n6. Frodo spirit Hero and Aragorn Lore combination,\n\n7. Aragorn lore with tactics Boromir.\n\n8. Aragorn Lore  and Gandalf (OHaUH)\n\n9. Unexpected courage (maybe, there are no other cards that provide such consistent action advantage)\n\n10. Sneak attack/Gandalf\n\n11. A Burning Brand this is one of the most ridiculous cards in the game it shuts down all shadow card effect! Almost forgot it.\n\n \n\nBook of Atanator or whatever it's called, the leadership book one. The recycling of sneak attack can be problematic too but have not tried it.\n\n \n\nIf it did come down to competitive play:\n\nI would say no Outlands, Dwarves, Vilya, Light of Valinor, Aragorn Lore \n\n \n\nInterestingly, I am not sure power creep is really happening too much anymore.  Most of the really powerful cards came prior to HoN. Well besides Outlands that is.  But all the other player cards from this cycle are not game breaking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903591","commentId":903591,"userName":"richsabre","timestamp":1383762438,"content":"> If it did come down to competitive play:\n> \n> I would say no Outlands, Dwarves, Vilya, Light of Valinor, Aragorn Lore \n> \n>  \n> \n>  \n\ni could never go without my dwarves :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] .............the best creation of this game so far. but i do agree that they are incredibly powerful (with dain ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ). but i actually prefer making dwarf decks without him....though that may be because i played the entire dwarrowdelf cycle with him"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903603","commentId":903603,"userName":"wyrm187","timestamp":1383763928,"content":"> I don't really care if there is a restricted list or not, but I find these are the most powerful cards.\n> \n> I don't think they need to be restricted, because the future of competitive play for this game seems pretty dismal.\n> \n>  \n> \n> 1. Steward of Gondor\n> \n> 2. Vilya/Elrond\n> \n> 3. Outlands Trait\n> \n> 4. Dain Ironfoot\n> \n> 5. Glorfindel /Light of Valinor/Asfaloth\n> \n> 6. Frodo spirit Hero and Aragorn Lore combination,\n> \n> 7. Aragorn lore with tactics Boromir.\n> \n> 8. Aragorn Lore  and Gandalf (OHaUH)\n> \n> 9. Unexpected courage (maybe, there are no other cards that provide such consistent action advantage)\n> \n> 10. Sneak attack/Gandalf\n> \n> 11. A Burning Brand this is one of the most ridiculous cards in the game it shuts down all shadow card effect! Almost forgot it.\n> \n>  \n> \n> Book of Atanator or whatever it's called, the leadership book one. The recycling of sneak attack can be problematic too but have not tried it.\n> \n>  \n> \n> If it did come down to competitive play:\n> \n> I would say no Outlands, Dwarves, Vilya, Light of Valinor, Aragorn Lore \n> \n>  \n> \n> Interestingly, I am not sure power creep is really happening too much anymore.  Most of the really powerful cards came prior to HoN. Well besides Outlands that is.  But all the other player cards from this cycle are not game breaking.\n\nThis was more along the lines I was thinking , put a couple of those cards from outlands deck and dwarf deck on the restricted list so you can't use them together. It doesn't have to be all the cards , but again until the competitive scene evolves , which I don't see happening, there will prob be no list"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903678","commentId":903678,"userName":"Tracker1","timestamp":1383770752,"content":"> > If it did come down to competitive play:\n> > \n> > I would say no Outlands, Dwarves, Vilya, Light of Valinor, Aragorn Lore\n> \n> i could never go without my dwarves :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] .............the best creation of this game so far. but i do agree that they are incredibly powerful (with dain ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ). but i actually prefer making dwarf decks without him....though that may be because i played the entire dwarrowdelf cycle with him\n\nI don't think all dwarf decks are overpowered, it only seems to be the case when Dain is in the picture.\n\nAll this being said there are still some very challenging scenarios even when a deck is stocked with power cards and combos.\n\nSo, in the end it all starts to balance out, and with nightmare packs we will continue to see this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=903983","commentId":903983,"userName":"Lilian","timestamp":1383812093,"content":"a french player post a two-players decks that win almost every quest at the first turn.\n\nThe deck use future cards (Voice of Isengard).\n\n \n\nWe organised many competition in France and we didn't use the FFG rules because the players didn't like it.\n\nWe have fund alternative but I'll be glad to see Restricted cards for the competive play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904007","commentId":904007,"userName":"ana4","timestamp":1383817800,"content":"I think the Dwarf correction is quite simple. Shaft Dain. They can still do fine without him - or with him not being so powerful. And the main reason I am saying this is because of the deck-building which must be one of the most interesting aspects of the game. And when you are building a Dwarf deck, you would be silly not to include Dain (if you want to win that is). Such cards are wrong, I feel.\n\n \n\nThe bigger problem is the Outlands because, as said above, there is no such one errata solution. Though, actually, if you shaft the Herdsman, you still have a Lore Outlands ally (the Hunter) that is very good, and they all remain fragile at 1 hit point, and will be crushed by certain encounter cards. I think that would be the easiest solution. Though then again, for some crazy reason, we got Men of the West working for Outlands only. It is actually quite disturbing, why is a card named Men of the West working only with the Outlands trait, they were supposed to be inferior, not superior to the Gondorians who are indeed Men of the West, and the heirs of Númenor.\n\n \n\nAs it is, I am refusing to use either Dwarves (as a synergy, not individuals) or Outlands because they just feel absurd.\n\nEdited November 7, 2013 by Ana"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904023","commentId":904023,"userName":"Glaurung","timestamp":1383820634,"content":"> a french player post a two-players decks that win almost every quest at the first turn.\n> \n> The deck use future cards (Voice of Isengard).\n> \n>  \n> \n> We organised many competition in France and we didn't use the FFG rules because the players didn't like it.\n> \n> We have fund alternative but I'll be glad to see Restricted cards for the competive play.\n\nreally cool to know what kind of competition you done there in France for lotr?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904031","commentId":904031,"userName":"Tracker1","timestamp":1383822748,"content":"> a french player post a two-players decks that win almost every quest at the first turn.\n> \n> The deck use future cards (Voice of Isengard) .\n\nFirst turn! What kind of broken combo did they use. Can you post a link to the decks, since i have not come across them.\n\nEdited November 7, 2013 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904049","commentId":904049,"userName":"Lilian","timestamp":1383826508,"content":"I'm not an english speaker so I google translate its post on the french forum :\n\nI come to completely present a subject to you on a deck gives. A deck unbeatable, able to gain 90% of the parts to turn 1. It is a deck which is as a result not very interesting to play but which is instructive when it is studied. It is also a deck which endangers diversity at the time of the tournaments lord of the rings.\nThis deck of which I speak to you imply to play two cards which did not leave yet and which are in the middle as of current versions. It is about Deep Knowledge and Legacy of Numenor:[img] http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-voice-of-isengard/deep-knowledge.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-voice-of-isengard/deep-knowledge.png] [/img] [img] http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-voice-of-isengard/legacy-of-numenor.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-voice-of-isengard/legacy-of-numenor.png] [/img]\n\nNevertheless the principle and the effectiveness of the deck are not directly dependent there. The version with the cards left to date are with my best direction the decks current. And without you to make expect the lists currently played more here:\nDeck Support\n\nHero 1: NoriHero 2: BalinHero 3: Beravor_\nEvent\n3 Rune de Daeron\n3 We are not lazy\n3 History of the corner of fire\n3 Legacy of Numenor\n3 Deep Knowledge\n3 chemin de great step\n2 force of the will\n2 Gifts of good-bye\n2 will of the west\n1 Opulence of Lorien\n1 Attraction of Moria\n1 Out of Nature\n1 To risk light\n1 To hold and fight\n1 to know of imralis\n1 Greeting of Galadhrim\n1 Corbels of the mountain\n\nCombined\n1 Mounting of the riddermark\n1 adventurous drum\n\nAttachment\n3 love of the history\n3 Heritage of Durin\n3 Song of Eärendil\n3 song of wisdom\n3 Song of the Kings\n1 Song of the Travel\n\nDeck Combo\n\nHero 1: OinHero 2: BifurHero 3: Dáin Foot of Steel\nEvent\n3 Rune de Daeron\n3 We are not lazy\n3 Renewal of force\n3 Legacy of Numenor\n3 Deep Knowledge\n3 furtive attack\n3 word of command\n2 will of the west\n2 Attraction of Moria\n\nAttachment\n3 born in altitude\n2 song of aerendil\n1 horn of the gondor\n1 Heritage of Durin\n\nCombined\n3 Archivist of Erebor\n3 Blacksmith of Erebor\n3 minor of the iron mounts\n3 minor of zigil\n3 Gandalf\n1 veteran with the axe\n1 Gloin\n1 Dwalin\n\nThe lists are designed around three axes:\n1- To guarantee the most possible starting percentage in combo with turn 1\n2- To be able to finish the maximum of normal scenarios (extensions deluxe and cycles) with turn 1.\n3- For the only problematic scenario (escape from Fraud Guldur) simply to succeed in gaining it.\n4- To try to mark more a large number of points of victories.\n\nThese lists are made for the duet. Indeed it is the format of game which I experienced more. These lists are all made exportable to be played 3 or 4 players. With considered decks to optimize to it (or both possibly) games combo that will be only stronger. I on the other hand did not succeed in satisfactorily exporting the model in solo for the moment.\nThe principle of the deck is to manage to pick all the deck of the player combo. Then one sets up loops. Who allow us to dig again all the deck of the player combo, then of the player support. Who bring back the threat of each player to 0. Who kill all the enemies present concerned. Who explore all the places. Who put as much marker of progression than one wants on the active search. Who purify and sort the deck of meeting. Who look after. In short all is done.\nFor that it is necessary to give a maximum of resources and to make pick to the maximum the player combo. This one will play all its dwarves, and each time will pick a map thanks to heritage of durin. Once court of resource it has plays we are not lazy and releases all the dwarves thanks to attraction of the moria. Thus he plays all the dwarves of sound deck. That arrives about at the moment or the deck is empty.For more detail on operation of the combo here a small guide:\n[spoiler=ordre of priority to follow to optimize its outputs] a) One starts by playing the cards cursed which one picks. Generally as long as that does not make pass a player above 46 threatens one plays the cursed cards as soon as they are picked.b) One continues by playing the other diggers action: history with the corner of fire and Beravor on the player “combo”, attacks furtive on Gandalf to pick 3. Then rune of daeron while truing what is not essential for the first iteration of the loop (1 will of the west on both, the additional specimens of Gandalf, all cards in a specimen of the deck support). One waits on the other hand to play us sums not lazy and the song of aerendil.c) If the player support has a heritage of durin he plays it on a hero of the game combo.\nd) It is necessary to play the loves of the stories. If there is not that one it goes on Bifur. If there is more it is necessary to play of the song of wisdom to attach them on the heroes of the dwarf game before him to give a love of the stories. There is only if it is impossible to play them on the player combo that one attaches one of them on Beravor.e) One plays the song of aerendil of the player combo on the player combo, history which it picks.\nf) One passes to the other songs. One tries to give to a hero all the spheres. It is often Oin which takes a song of wisdom and a song of the kings.g) Then it is the turn of the player combo. If it does not have yet a heritage of durin it must play one of them, since it is necessary to going to seek it via word of command.h) One seeks to play the most possible allies dwarf. One picks with each time one picks one of them. Before playing a blacksmith of erebor one returns in our hand gandalf with born in altitude and recovers it born in altitude. Then one plays again Gandalf with furtive attack.i) When the player combo falls has cost of resource his teammate the assistance using we are not lazy and gifts of good-byes.\nj) At the time or even those resources are spent he is necessary to have we are not lazy. Before spending the last resource: knowledge: it is necessary thus to use word of command to go to seek it if we did not pick yet about it. One uses this we are not lazy by engaging all the dwarves to add many resources on the dwarf with the most sphere to provision.k) One continues has to play of the allies, has to go up the gandalf and has to go increasingly deep in the deck. One uses attracted moria to take again resources with we are not lazy with the need. [/spoiler]\nArrived at this stage it is necessary to play a will of the west and to begin the loops:\n[spoiler=Détail of the loops] a) Horn of Gondor + blacksmith of Erebor + born in altitude + will of the west + we are not lazy + attracted moria. One engages all the dwarves to produce about twenty resources approximately. Then one releases them via attraction of the moria. A will of the west is played. One spends 3 resources to play three times the blacksmith of erebor and to pick 3 cards. One is in an initial state with a profit of 17 resources. One can thus produce resource as much than one wants on all the heroesb) + Gandalf + 2nd born in altitude. One reduces to zero his threat and one kills as much enemy than one wants.c) + two song of aerendil + deep knowledge. One makes pick any sound deck with our ally by taking all the threat, and by repeating the loop b) as soon as necessary to total zero of threat.d) + rune of daeron + adventurous drum + to hold and fight. The deck support plays rune of daeron, trues adventurous drum and brings back it via holding and fighting. Then one passes the drum, recovering each time threat on the player combo. Once the player support is to 0 of threat the player combo makes the loop B again to be it again.e) + will of the west + horse-breaker of the ouestfole. The deck support mixes its trues with its deck, vacuum. Then he plays rune of daeron and trues the horse-breaker. He brings back it with holding and fighting. He can sacrifice it to put 2 markers of progression on a place. And to repeat the operation until eliminating all the places. f) + out of nature + to risk light. Are played they to purify the deck of all the cards without point of victory and which are not objectives. Then one sorts the remaining cards to leave what it interests us more.g) + corbels under the mountain. One puts as many markers of progression one wants on the search in progress. One can thus pass the stages of the search in cascade and gain.h) + to know of imralis. One can all look after, including wilyador to be able to gain travel to rhosgobel.i) + way of great step + force of the will. Necessary only for the scenario feared of the intendant but necessary to finish it with turn 1.j) + opulence of the lorien + greeting of the gahladrim. Necessary to repeat these loops apart from the phase of organization, apart from which one cannot play Gandalf or blacksmith of erebor any more at will. [/spoiler]\nAmong the 24 classical scenarios available all are succeeded almost at 100% with turn 1, the only possibility of missing being not to leave in combo to turn 1. Only the scenario problems are feared of the intendant or one gains to 80% with turn 1, To flee the moria that one finishes with turn 1 only in 30% of the cases to the first turn and that one finishes on average with turn 3 and escape from Fraud Guldur which one cannot finish turn 1 and or one endeavours to use to the maximum the gandalf to hold and to pass in stage 3 or the restriction of an ally by turn does not hold any more and or one can thus gain easily.The scenarios Print one Demand and Extension of Saga pose more problem. Not to gain but simply to do it with turn 1.\nThis deck uses many mechanics and cards. Even if the impressive part of the deck is its capacity with systematically gaining turn 1 by not dealing less world with the specificity of the scenario it is not that which makes its effectiveness. To put that it places from there is initially necessary to have brought a large number of ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904071","commentId":904071,"userName":"Tracker1","timestamp":1383829023,"content":"Thanks for posting, but i really don't understand how the combos work, mostly because some cards and abilities are translated differently.\n\nI guess i'm not sure how the two unreleased cards from the Isengard make the deck able win in the first turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904093","commentId":904093,"userName":"richsabre","timestamp":1383830539,"content":"i know i hate myself for saying this, but i cannot believe any deck can win on 1 turn with such consistency.....but as with tracker i have difficutly understanding the translations so cannot really comment\n\n \n\ni think the best way to prove these things are a video link to either an octgn game or a real life game....is there one?\n\nrich\n\nEdited November 7, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904094","commentId":904094,"userName":"ana4","timestamp":1383830750,"content":"Whilst I cannot understand some of the cards (I am only unsure of a very few), I see what they are doing. The two new cards from the VoI are of course essential, gaining resources and cards at the same time is just crazy powerful. And they probably use Ravens of the Mountain to advance through multiple quest stages in a single round. The recycling is the key, of course. And they will have to errata Will of the West very soon. It is almost laughable that they actually shafted the poor Master of Lore which was like the weakest of the cards instead of others that would stop the loops. So yeah, the two new previewed cards can definitely make a huge difference.\n\n \n\nAs for the consistency, I am ever skeptical, but I think these blokes, for a change, know what they are doing...\n\n \n\nAnd I am not sure whether the players realise that Peace, and Thought can only be played in the refresh phase. But maybe they mean a different card... and maybe it doesn't matter, as you can still put progress in the last stage of the round...\n\nEdited November 7, 2013 by Ana"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904095","commentId":904095,"userName":"Glaurung","timestamp":1383830951,"content":"New cycle will change many things.... and cards like Loragorn will be crazy broken. Even now there some unbalanced cards ( list by tracker1 above is really solid and target the true).\n\nActually I talk about it already years ago....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904098","commentId":904098,"userName":"ana4","timestamp":1383831177,"content":"Just some funny translations to follow... (my guesses)\n\n \n\nHistory of the Corner of Fire = Peace, and Thought\n\nCorbel of the Mountain = Ravens of the Mountain\n\nWe are not Lazy = We are not Idle\n\nOpulence of Lórien = Lórien's Wealth\n\nAdventurous Drum = Wandering Took\n\nBorn in Altitude = Borne Aloft\n\nFurtive Attack = Sneak Attack\n\nGifts of Goodbye = Parting Gifts\n\n \n\nOn the other hand, I have no idea what chemin de great step might mean..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904101","commentId":904101,"userName":"ana4","timestamp":1383831283,"content":"> New cycle will change many things.... and cards like Loragorn will be crazy broken. Even now there some unbalanced cards ( list by tracker1 above is really solid and target the true).\n> \n> Actually I talk about it already years ago.....\n\nNever worry, we all know you were winning the quests even before they had existed... (just teasing, of course)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904127","commentId":904127,"userName":"Tracker1","timestamp":1383833165,"content":"> The bigger problem is the Outlands because, as said above, there is no such one errata solution. Though, actually, if you shaft the Herdsman, you still have a Lore Outlands ally (the Hunter) that is very good, and they all remain fragile at 1 hit point, and will be crushed by certain encounter cards. I think that would be the easiest solution..\n\nTaking the herdsmen out of an Outlands deck would be a game changer, and probably the best solution, at least for quests that have treachery and shadow cards that could deal damage to allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904146","commentId":904146,"userName":"Lilian","timestamp":1383834911,"content":"Here the decks with the correct name :\n\nHero 1: Nori\nHero 2: Balin\nHero 3: Beravor\nEvent\n3 Daeron's Runes\n3 We Are Not Idle\n3 Campfire Tales\n3 Legacy of Numenor\n3 Deep Knowledge\n3 Strider's path\n2 force of will\n2 Party Gifts\n2 Will of the West\n1 Lorien's Wealth\n1 Lure of Moria\n1 Out of Nature\n1 Risk Some Light\n1 Stand and fight\n1 Lore of imladris\n1 The Galadhrim's Greeting\n1 Ravens of the mountain\n\nCombined\n1 The Riddermarl's Finest\n1 Keen-eyed took\n\nAttachment\n3 love of Tales\n3 Durin's legacy\n3 Song of Eärendil\n3 song of wisdom\n3 Song of the Kings\n1 Song of the Travel\n\nDeck Combo\n\nHero 1: Oin\nHero 2: Bifur\nHero 3: Dáin Ironfoot\n\nEvent\n3 Daeron's Runes\n3 We Are Not Idle\n3 Gaining strength\n3 Legacy of Numenor\n3 Deep Knowledge\n3 Sneak Attack\n3 word of command\n2 will of the west\n2 Lure of Moria\n\nAttachment\n3 born aloft\n2 Song of Eärendil\n1 horn of Gondor\n1 Legacy of Durin\n\nCombined\n3 Erebor Record Keeper\n3 Erebor Hammersmith\n3 Miner of the Iron Hills\n3 Zigil Miner\n3 Gandalf\n1 veteran Axehand\n1 Gloin\n1 Dwalin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904147","commentId":904147,"userName":"Lilian","timestamp":1383835079,"content":"> i know i hate myself for saying this, but i cannot believe any deck can win on 1 turn with such consistency.....but as with tracker i have difficutly understanding the translations so cannot really comment\n> \n>  \n> \n> i think the best way to prove these things are a video link to either an octgn game or a real life game....is there one?\n> \n> rich\n\nThere's no video sorry and the player who build this deck is a great player of Magic the gathering"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904189","commentId":904189,"userName":"ana4","timestamp":1383840077,"content":">  \n> \n> > The bigger problem is the Outlands because, as said above, there is no such one errata solution. Though, actually, if you shaft the Herdsman, you still have a Lore Outlands ally (the Hunter) that is very good, and they all remain fragile at 1 hit point, and will be crushed by certain encounter cards. I think that would be the easiest solution..\n> \n> Taking the herdsmen out of an Outlands deck would be a game changer, and probably the best solution, at least for quests that have treachery and shadow cards that could deal damage to allies.\n> \n>  \n\nYes, it would not be a silver bullet solution but at least a try - without destroying too many cards.\n\nI know this has been addressed so many times but do the designers actually play-test much? I know they say so but then they surely must see that playing Outlands is much easier than usual decks. It beats Lake-town regularly (not saying always) whilst other decks get smashed more often than not, and great decks too.\n\nWhat is worst about it, for me, though is that you do not really build decks with Outlands. You just insert the cards given to you. There is little to no option, especially after the Lord of Morthond came out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904190","commentId":904190,"userName":"ana4","timestamp":1383840184,"content":"Oh, thanks Lilian, so I was totally wrong about Peace, and Thought, it is of course Campfire Tales, I completely forgot about that card, it being rather poor in general."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904273","commentId":904273,"userName":"richsabre","timestamp":1383846503,"content":"> What is worst about it, for me, though is that you do not really build decks with Outlands. You just insert the cards given to you. There is little to no option, especially after the Lord of Morthond came out.\n> \n>  \n\nyes- this. there really is no deck building in outlands, which is different from dwarves which is why i like them so much (if you can stay away from dain that is)\n\nall outlands decks are\n\nhirluin + 2 other heroes (it barely matters who) + every single outlands ally + steward of gondor + outlands attatchents+ beorns tale (cant remember name now)\n\n \n\non the note of general game breaking decks- that is an issue that concerns me. ....what new errata will  we get to counter act it? ....i still cannot believe zigil miner....i mean there was 1 deck that broke the game, but it was an awful deck and not even worth playing, but all the same we lost a card from it\n\n \n\ni think this is the issue in general- can you resist breaking the game if the cards are given to you? i never think a card should get shafted if it requires 1 specific deck to break the game, or even make it overpowered. it should only be if the card stands powerful on its own, or with many combos\n\nEdited November 7, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904299","commentId":904299,"userName":"Emrad","timestamp":1383847719,"content":"Well, breaking a co-op game seems totally counter-productive to me. How enjoyable is winning on turn 1 every encounter without even giving it a though or a chance? Where's the fun, the enjoyment of the lore, and simply the game?\n\nWith this game, it all comes down to being fair with what you do. Yes, Outlands are OP and have an obvious mono-color solid build that destroys pretty much any adventure, but it's only worth knowing that it's out there and that some crazy actions can happen with it.\n\n \n\nIn the upcoming month, Voice of Isengard will crush everything with more free cards, and I find this somehow sad, because the mstake has been made in the past with many games, and it doesn't seem to affect the design decision of R&D team here.\n\n \n\nBut in the end, enjoy the game as much as you can, the way you want to see it played, and don't bother playing competitively, it hasn't been designed for this at all. My take on this is: Enjoy the game with friends, with fair decks and a fine beer, crush Orcs or be crushed but keep it fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904301","commentId":904301,"userName":"richsabre","timestamp":1383847818,"content":"> But in the end, enjoy the game as much as you can, the way you want to see it played, and don't bother playing competitively, it hasn't been designed for this at all. My take on this is: Enjoy the game with friends, with fair decks and a fine beer, crush Orcs or be crushed but keep it fun.\n\nindeed....beer+friends+crushed orcs = good times :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904385","commentId":904385,"userName":"richsabre","timestamp":1383854288,"content":"take a look at this 'draft pack' new format that ffg has come up with for its other lcgs. i know this one isnt competative but perhaps this could be adapated in some form for this game\n\nhttp://www.fantasyflightgames.com/edge_news.asp?eidn=4486 [http://www.fantasyflightgames.com/edge_news.asp?eidn=4486]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904489","commentId":904489,"userName":"Rouxxxor","timestamp":1383863138,"content":"Hello,\n\n \n\nI'm the creator of the two deck presented by Lilian. I work on Dwarf combo for 2 players since a while. So I have an actual version (without doomed cards) and it is already crazy. Able to win quest in a few turn. To bring 20 allies in the first three turns. And able to ready them each turn by lure of Moria.\n\n \n\nBut with new cards this combo become totally insane. I try to build optimal versions and I think that the most recent is able to make the combo at 95% on the turn one. So we have 20 allies in play at the turn one and we are able to ready them 3 times. So for fun I try to even complete quests on the turn one. And, as Lilian say I see that is possible for every quests except Escape from Dol Guldur. And for 2 others quests I need to be lucky. For the 21 others you can do it every time. So you win at 90% on the turn one.\n\n \n\nSo of course this deck is not safe for competitive play. But it is not about playing will of the west. It is absolutely unnecessary for winning. I already think about what can be cut off of this deck. And the conclusion is: no matter what you take off the deck will still be too powerful. Sure it will not be able to crush everything instantly. But it will be best deck for 2 players.\n\n \n\nThe two majors cards are:\n\n- We are not idle : This card is a staple in Lotr in general (draw a card for 0 is always cool). In this deck it become indecent. You also win too much resources. A good idea is to restrict number of dward that you can exhaust. For example:\n\n\"Action: Exhaust up to 1 Dwarf character to add that number of resources to a hero's resource pool and draw 1 card.\"\n\nSome rather want an edit for avoid to set this card in 3X in all decks with the leadership sphere. Something like:\n\n\"Action: Exhaust 1 Dwarf character for adding 1 resources to a hero's resource pool and draw 1 card.\"\n\n- Legacy of Durin : you can draw too many cards. Could be write:\n\n\"Response: After you play a Dwarf character from your hand, exhaust Legacy of Durin for drawing 1 card.\"\n\n \n\nWith this two changes you will kill dwarf combo. And it will be cool for the game.\n\n \n\n> There's no video sorry and the player who build this deck is a great player of Magic the gathering\n\nNo I'm not. I was an average competitive player. I may be in the first % of magic players but it still far away of being a \"great player\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904498","commentId":904498,"userName":"Tracker1","timestamp":1383864920,"content":"Wow, thanks for the lesson. Not sure i'll try it but i'm real curious to see how these decks work.\n\nOne thing I am not sure of is, if a scenario has 3 or more quest cards, how can you complete all of them in one turn, since progress from one quest card in not carried over to the next card after quest resolution? Would it not be at least one round per quest card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904547","commentId":904547,"userName":"Alex6222","timestamp":1383872181,"content":"Okay can someone please tell me how do they make to work the new outland cards into the outland deck. I once tried doing a mono-leadership with lord of morthond and it failed terribly. I agree that outlands are overpowered but i think they depend too much on card draw (beravor) and there arent many cards to make a fully thematic outland deck like dwarves or noldor/silvan. I know another outland hero would be more power-breaking but i just dont like the feeling of mixing different factions.\n\nEdited November 8, 2013 by Alex6222"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904636","commentId":904636,"userName":"ana4","timestamp":1383894578,"content":"> Wow, thanks for the lesson. Not sure i'll try it but i'm real curious to see how these decks work.\n> \n> One thing I am not sure of is, if a scenario has 3 or more quest cards, how can you complete all of them in one turn, since progress from one quest card in not carried over to the next card after quest resolution? Would it not be at least one round per quest card?\n\nThey use Ravens of the Mountain, as I said above.\n\n \n\nNow, yes, the loops are the definition of boredom. I would never pursue that path. Still, I want to see some of the cards shafted because they are bad design. And it is here that ffg is just shocking, for some reason they shaft Master of Lore who had never been very powerful and now is just terrible. And cards like Will of the West, which I could certainly do without, as it is a boring card too, but the one allowing for most of the loops, somehow still works just as it has since the beginning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904637","commentId":904637,"userName":"Glaurung","timestamp":1383894764,"content":"> Wow, thanks for the lesson. Not sure i'll try it but i'm real curious to see how these decks work.\n> \n> One thing I am not sure of is, if a scenario has 3 or more quest cards, how can you complete all of them in one turn, since progress from one quest card in not carried over to the next card after quest resolution? Would it not be at least one round per quest card?\n\nmaybe he mean there is no point to play since he is already too strong after the first roind"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904639","commentId":904639,"userName":"Lilian","timestamp":1383894867,"content":">  \n> \n> Now, yes, the loops are the definition of boredom. I would never pursue that path. Still, I want to see some of the cards shafted because they are bad design. And it is here that ffg is just shocking, for some reason they shaft Master of Lore who had never been very powerful and now is just terrible. And cards like Will of the West, which I could certainly do without, as it is a boring card too, but the one allowing for most of the loops, somehow still works just as it has since the beginning.\n> \n>  \n\n \n\nA player propose to add \"victory 1\" to will of the west and i thought that's a good idea\n\n \n\nI agree that \"loops are the definition of boredom\" and I think they must be eradicated from Lotr"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904640","commentId":904640,"userName":"ana4","timestamp":1383894919,"content":"> Okay can someone please tell me how do they make to work the new outland cards into the outland deck. I once tried doing a mono-leadership with lord of morthond and it failed terribly. I agree that outlands are overpowered but i think they depend too much on card draw (beravor) and there arent many cards to make a fully thematic outland deck like dwarves or noldor/silvan. I know another outland hero would be more power-breaking but i just dont like the feeling of mixing different factions.\n\nMono-Leadership is probably strongest. Take Hirluin with Théodred and Balin, all the Outlands, perhaps safe Forlong, the Lord of Morthond, A Very Good Tale, Steward of Gondor, Men of the West, Valiant Sacrifice (maybe), King Under the Mountain, Sneak Attack, Gandalf (Core), and fill the rest with cheap Gondor Allies, for instance, like Errand-rider or Envoy of Pelargir. Really not that many choices. If you want to go For Gondor, use Imrahil and Boromir instead, and try getting more Gondorians like the new Squire, Watchman or Custodian. Either way (been there done that), it is one of the most boring experience I have had with the game, but it wins you games no doubt about that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904642","commentId":904642,"userName":"ana4","timestamp":1383895090,"content":">  \n> \n> >  \n> > \n> > Now, yes, the loops are the definition of boredom. I would never pursue that path. Still, I want to see some of the cards shafted because they are bad design. And it is here that ffg is just shocking, for some reason they shaft Master of Lore who had never been very powerful and now is just terrible. And cards like Will of the West, which I could certainly do without, as it is a boring card too, but the one allowing for most of the loops, somehow still works just as it has since the beginning.\n> > \n> >  \n> \n>  \n> \n> A player propose to add \"victory 1\" to will of the west and i thought that's a good idea\n> \n>  \n> \n> I agree that \"loops are the definition of boredom\" and I think they must be eradicated from Lotr\n> \n>  \n\nYeah, the victory could help, for sure, excellent idea. I would still not play the card much, I think, but it would certainly make sense. The limit one per deck could also help - it would then be just as restricted as Black Arrow (and when you think about it, the Arrow surely cannot make more of a difference on a usual game)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904650","commentId":904650,"userName":"Lilian","timestamp":1383896604,"content":">  \n> \n> Yeah, the victory could help, for sure, excellent idea. I would still not play the card much, I think, but it would certainly make sense. The limit one per deck could also help - it would then be just as restricted as Black Arrow (and when you think about it, the Arrow surely cannot make more of a difference on a usual game).\n\nI don't think that limit one per deck help because for the deck I see, the loop deck use one Will of the West\n\n \n\nI don't like loop deck and I don't use them so I'm not an expert of them. But, they are a problem for the meetings and the tournaments."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904675","commentId":904675,"userName":"ana4","timestamp":1383902738,"content":"Hmm, the deck you list does use 2 copies of Will of the West. And in any loops it is easier to have two, instead of one and a Dwarven Tomb or Map of Eärnil. Otherwise, I totally agree, we need get rid of such, somehow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904684","commentId":904684,"userName":"Tracker1","timestamp":1383904397,"content":"> > Wow, thanks for the lesson. Not sure i'll try it but i'm real curious to see how these decks work.\n> > \n> > One thing I am not sure of is, if a scenario has 3 or more quest cards, how can you complete all of them in one turn, since progress from one quest card in not carried over to the next card after quest resolution? Would it not be at least one round per quest card?\n> \n> They use Ravens of the Mountain, as I said above.\n\nThere is only 1 copy between both decks. I don't see how it can be played enough times before the first quest phase to complete 3 scenario cards for something like 30+ progress tokens, and when it is played the top card of the encounter deck might not have any threat.\n\nStill baffled, but sounds boring, and i thought Outlands was broken!\n\nJust out of curiosity, and back to overpowered decks.\n\nHas anyone beat Battle of Laketown without having one of the following in one of your decks. I'm talking solo one hand play here.\n\n1. Dain\n\n2. Frodo\n\n3. Outlands\n\nIf so what type of deck did you use? Would you consider it overpowered?\n\nI beat it with one other deck once, but never with the consistency that the 3 mentioned above have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904710","commentId":904710,"userName":"alogos","timestamp":1383908428,"content":"> I agree that \"loops are the definition of boredom\" and I think they must be eradicated from Lotr\n\n\n\nNeo voice : Whoa. Déjà vu...\n\nGollum voice : What did you say?\n\n \n\n> There is only 1 copy between both decks. I don't see how it can be played enough times before the first quest phase to complete 3 scenario cards for something like 30+ progress tokens, and when it is played the top card of the encounter deck might not have any threat.\n> \n> Still baffled, but sounds boring, and i thought Outlands was broken!\n\n\n\nThe aim is to draw all your cards, then you can play the raven hill/will of the west loop. If the first card of the encounter deck is bad, you can play The End Comes to shuffle the encounter deck.\n\nTo Lillian & Rouxxxor : told you to come to me for translation... (yeah, don't have the same acount name here and there) (why am I writting this in english ?) Bon, tu nous fais une vidéo pour quand rouxxxor ? je pense que \"tour un\" est pas utiliser tel quel en anglais.\n\n \n\nI think \"first turn\" is more used than \"turn one\".\n\nAbout \"Chemin de great step\" : \"chemin de grand pas\" in french, \"grand pas\" is the name of Strider in french version, the card is Strider's path.\n\nGoogle traduction is fun.\n\nEdited November 8, 2013 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904898","commentId":904898,"userName":"Emrad","timestamp":1383936749,"content":"> Okay can someone please tell me how do they make to work the new outland cards into the outland deck. I once tried doing a mono-leadership with lord of morthond and it failed terribly. I agree that outlands are overpowered but i think they depend too much on card draw (beravor) and there arent many cards to make a fully thematic outland deck like dwarves or noldor/silvan. I know another outland hero would be more power-breaking but i just dont like the feeling of mixing different factions.\n\n \n\nHere's what I play with a friend :\n\n \n\nLS Elven Outlands Control\n\nHero (3)\n\nElrond (SaF) x1\n\nEleanor (Core) x1\n\nGlorfindel (FoS) x1\n\nAlly (26)\n\nAnfalas Herdsman (TSF) x3\n\nEthir Swordsman (TSF) x3\n\nHunter of Lamedon (HON) x3\n\nKnights of the Swan (TSF) x3\n\nArwen Undomiel (TWitW) x3\n\nGandalf (Core) x3\n\nZigil Miner (KD) x3\n\nImladris Stargazer (FoS) x3\n\nWest Road Traveller (RtM) x2\n\nAttachment (12)\n\nUnexpected Courage (Core) x3\n\nLight of Valinor (FoS) x2\n\nExpert Treasure-hunter (OtD) x2\n\nAncient Mathom (AJtR) x2\n\nVilya (SaF) x2\n\nSpare Hood and Cloak (OHaUH) x1\n\nEvent (12)\n\nA Test of Will (Core) x3\n\nDwarven Tomb (Core) x3\n\nThe Galadhrim's Greeting (Core) x3\n\nHasty Stroke (Core) x3\n\n \n\n-------------------------------------------------------------\n\n \n\nI don't play Asfaloth because my friend does.\n\nThis is a really good questing and support deck, it does a crazy amount of quest, and even attack towards the end game. The curve progression is really good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=904996","commentId":904996,"userName":"Rouxxxor","timestamp":1383947978,"content":"> Has anyone beat Battle of Laketown without having one of the following in one of your decks. I'm talking solo one hand play here.\n> \n> 1. Dain\n> 2. Frodo\n> 3. Outlands\n> \n> If so what type of deck did you use? Would you consider it overpowered?\n> I beat it with one other deck once, but never with the consistency that the 3 mentioned above have..\n\nYou forget in your listing best Hero ever: Glorfindel (the spirit one). I have something like 50% of winnning the two following decks:\n\n> [solo] GEB - Glorfindel / Elrond / Boromir\n> \n> Hero (3)\n> Glorfindel (FoS) x1\n> Boromir (TDM) x1\n> Elrond (SaF) x1\n> \n> \n> Ally (24)\n> Ethir Swordsman (TSF) x3\n> Knights of the Swan (TSF) x3\n> Arwen Undomiel (TWitW) x1\n> Envoy of Pelargir (HON) x3\n> Landroval (AJtR) x1\n> Beorn (Core) x1\n> Gandalf (Core) x3\n> Imladris Stargazer (FoS) x3\n> Henamarth Riversong (Core) x1\n> Gildor Inglorion (THoEM) x1\n> Elfhelm (TDM) x1\n> Warden of Healing (TLD) x2\n> Anfalas Herdsman (TSF) x1\n> \n> \n> Attachment (14)\n> Gondorian Shield (TSF) x3\n> Light of Valinor (FoS) x3\n> Vilya (SaF) x3\n> Expert Treasure-hunter (OtD) x3\n> Asfaloth (FoS) x1\n> Unexpected Courage (Core) x1\n> \n> \n> Event (12)\n> Elrond's Counsel (TWitW) x3\n> A Test of Will (Core) x3\n> Daeron's Runes (FoS) x3\n> The Galadhrim's Greeting (Core) x1\n> Hasty Stroke (Core) x2\n\nAnd\n\n> [solo] GBT / Secrecy - Glorfindel / Bifur / Theodred\n> \n> Hero (3)\n> Glorfindel (FoS) x1\n> Theodred (Core) x1\n> Bifur (KD) x1\n> \n> \n> Ally (18)\n> Gandalf (Core) x3\n> Henamarth Riversong (Core) x2\n> Arwen Undomiel (TWitW) x2\n> Beorn (Core) x1\n> Faramir (Core) x2\n> Gleowine (Core) x1\n> Dori (OHaUH) x1\n> Elfhelm (TDM) x1\n> Erestor (TLD) x1\n> Haldir of Lorien (AJtR) x1\n> Gildor Inglorion (THoEM) x1\n> Warden of Healing (TLD) x2\n> \n> \n> Attachment (10)\n> Steward of Gondor (Core) x3\n> Light of Valinor (FoS) x3\n> King Under the Mountain (OtD) x2\n> Asfaloth (FoS) x2\n> \n> \n> Event (22)\n> Elrond's Counsel (TWitW) x3\n> Sneak Attack (Core) x3\n> A Test of Will (Core) x3\n> Daeron's Runes (FoS) x3\n> We Are Not Idle (SaF) x3\n> Hasty Stroke (Core) x2\n> Timely Aid (TRG) x3\n> Shadow of the Past (RtM) x2\n\nThese was my two favorite decks before testing outlands.\n\n \n\n> Mono-Leadership is probably strongest. Take Hirluin with Théodred and Balin, all the Outlands, perhaps safe Forlong, the Lord of Morthond, A Very Good Tale, Steward of Gondor, Men of the West, Valiant Sacrifice (maybe), King Under the Mountain, Sneak Attack, Gandalf (Core), and fill the rest with cheap Gondor Allies, for instance, like Errand-rider or Envoy of Pelargir. Really not that many choices. If you want to go For Gondor, use Imrahil and Boromir instead, and try getting more Gondorians like the new Squire, Watchman or Custodian. Either way (been there done that), it is one of the most boring experience I have had with the game, but it wins you games no doubt about that.\n\nThis is a non-sense to speak about the \"best version\". Playing in solo, duo, trio or quatuor is completely different. It is quite difficult to discuss about best version in multi players because it is dependant about what you play in the others decks. So we have to discuss to \"what is the best way to play two(then three, the four) decks with at least one with outlands\".\n\nBut about solo decks it is more easy. And after some tests about differents outlands version I'm sure that mono-leardership is not at all the best version. I prefer this version:\n\n> [solo] Outlands + Secrecy - Glorfindel / Bifur / Hirluin the Fair\n> \n> Hero (3)\n> Bifur (KD) x1\n> Glorfindel (FoS) x1\n> Hirluin the Fair (TSF) x1\n> \n> \n> Ally (21)\n> Anfalas Herdsman (TSF) x3\n> Ethir Swordsman (TSF) x3\n> Forlong (TDF) x1\n> Hunter of Lamedon (HON) x3\n> Knights of the Swan (TSF) x3\n> Warrior of Lossarnach (TSF) x3\n> Gandalf (Core) x3\n> Henamarth Riversong (Core) x1\n> Warden of Healing (TLD) x1\n> \n> \n> Attachment (8)\n> Resourceful (TWitW) x3\n> Steward of Gondor (Core) x3\n> Light of Valinor (FoS) x2\n> \n> \n> Event (21)\n> Timely Aid (TRG) x3\n> We Are Not Idle (SaF) x3\n> Daeron's Runes (FoS) x3\n> A Test of Will (Core) x3\n> Elrond's Counsel (TWitW) x3\n> A Very Good Tale (OHaUH) x3\n> Peace, and Thought (SaF) x3\n\nThis is my thought of a deck originally built by Lilian.\n\n \n\nAs you can see I have tried a lot of way to play the game. So when I say that dwarf combo is not the same that any decks that you can see even without doomed that's not because it is my favorite decks or cause by a lack of knowledge of what we can do in LoTR LCG.\n\n \n\nSo yes:\n\n1- 90% of winning in turn one. I do a total of -100 points after playing all the main quests (all that 24 available in french).\n\n2- The best version, that who have the best rate of winning was not the funny one that I show you. It was probably one who don't care of winning in turn one because you have to play too many cards for doing it. It is probably more efficient to win in a few turn (one per quest step).\n\n3- That mean that will of the west is a funny cards, absolutely not a powerful cards that need to be fixed. Not at all.\n\n4- I planned to give you more explanations about dwarf combos decks. You can find a version without doomed cards here: http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/duo-dwarf-combo-dain-ironfoot-gloin-beravor-thorin-oakenshield-ori-nori-r768 [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/duo-dwarf-combo-dain-ironfoot-gloin-beravor-thorin-oakenshield-ori-nori-r768] + http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/duo-dwarf-combo-thorin-oakenshield-ori-nori-dain-ironfoot-gloin-beravor-r766 [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-decks/_/lord-of-the-rings-decks/duo-dwarf-combo-thorin-oakenshield-ori-nori-dain-ironfoot-gloin-beravor-r766]\n\n5- I haven't opportunity to do any video of the decks. If someone help to do I can do it, but with french cards that are mine.\n\n \n\nPS: Sorry if I assassinate your language every time I post. Someone will correct my deck presentations so it will be more easy to read ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=905120","commentId":905120,"userName":"Glaurung","timestamp":1383965772,"content":"We need errata even quickly as i though…….Voice is still not coming but we have already crazy broken things….. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906437","commentId":906437,"userName":"leptokurt","timestamp":1384201160,"content":"I don't think that cards should get an errata just because they allow loopholes in certain decks. As mentioned, Zigil Miner and Master of Lore are bad examples of using errata. Best thing is to ignore these cards or certain combos, if you think they're overpowered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906561","commentId":906561,"userName":"CaffeineAddict","timestamp":1384209599,"content":"> But with new cards this combo become totally insane. I try to build optimal versions and I think that the most recent is able to make the combo at 95% on the turn one. So we have 20 allies in play at the turn one and we are able to ready them 3 times. So for fun I try to even complete quests on the turn one. And, as Lilian say I see that is possible for every quests except Escape from Dol Guldur. And for 2 others quests I need to be lucky. For the 21 others you can do it every time. So you win at 90% on the turn one.\n\n \n\nPerhaps i'm just being a bit dense, but I don't see how this deck gets 20 allies in play on turn one, or wins a multi-stage quest on turn one. Can someone explain clearly how this works? From reading the thread it seems like other people have twigged what's going on, so maybe i'm just missing something obvious."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906698","commentId":906698,"userName":"Glaurung","timestamp":1384223046,"content":"Actually all this problems come from unlimited draw and unlimited size of players hand. Quite difficult to keep some balance if players can draw like crazy and keep every thing in they hand. So this kind of combo will always appear until they fix the rules about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906785","commentId":906785,"userName":"chuckles","timestamp":1384235855,"content":"> I don't think that cards should get an errata just because they allow loopholes in certain decks. As mentioned, Zigil Miner and Master of Lore are bad examples of using errata. Best thing is to ignore these cards or certain combos, if you think they're overpowered.\n\n \n\nI agree... do not like the idea of making more coasters just because there are crazy combo's out there that a few people play (or create to merely see if they can)... its a solo or Co-Op game, play it your way... if you like 1 round games... great... I think I'd find that a bit boring... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906814","commentId":906814,"userName":"ana4","timestamp":1384241943,"content":"Of course, I agree with the above. But they do errata anyway, and if they do, they should shaft the cards responsible for the mad loops, not the likes of Master of Lore. As I said before, I would never want to play any of these decks, I don't even play the Outlands because I find them super boring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906870","commentId":906870,"userName":"Glaurung","timestamp":1384253690,"content":"> Of course, I agree with the above. But they do errata anyway, and if they do, they should shaft the cards responsible for the mad loops, not the likes of Master of Lore. As I said before, I would never want to play any of these decks, I don't even play the Outlands because I find them super boring.\n\n \n\n> Of course, I agree with the above. But they do errata anyway, and if they do, they should shaft the cards responsible for the mad loops, not the likes of Master of Lore. As I said before, I would never want to play any of these decks, I don't even play the Outlands because I find them super boring.\n\nHmmm errata or kind of things i always  needed. In the card game when the card pool grow is always eventually  come out something what can be to crazy powerful and break the balance of the game. Don't forget maybe i wrong but i think is only one serious card game which one still have (surprise for me) Unbalanced draw and unlimited hand size. In my opinion this is a root of all problems. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906878","commentId":906878,"userName":"Lilian","timestamp":1384254777,"content":">  \n> \n> > I don't think that cards should get an errata just because they allow loopholes in certain decks. As mentioned, Zigil Miner and Master of Lore are bad examples of using errata. Best thing is to ignore these cards or certain combos, if you think they're overpowered.\n> \n>  \n> \n> I agree... do not like the idea of making more coasters just because there are crazy combo's out there that a few people play (or create to merely see if they can)... its a solo or Co-Op game, play it your way... if you like 1 round games... great... I think I'd find that a bit boring... \n> \n>  \n\n \n\nIt's true if you play alone. But we organised tournament play around the game and we de don't want to see these type of decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906880","commentId":906880,"userName":"Glaurung","timestamp":1384255295,"content":">  \n> \n> >  \n> > \n> > > I don't think that cards should get an errata just because they allow loopholes in certain decks. As mentioned, Zigil Miner and Master of Lore are bad examples of using errata. Best thing is to ignore these cards or certain combos, if you think they're overpowered.\n> > \n> >  \n> > \n> > I agree... do not like the idea of making more coasters just because there are crazy combo's out there that a few people play (or create to merely see if they can)... its a solo or Co-Op game, play it your way... if you like 1 round games... great... I think I'd find that a bit boring... \n> > \n> >  \n> \n>  \n> \n> It's true if you play alone. But we organised tournament play around the game and we de don't want to see these type of decks.\n> \n>  \n\nYes sure this kind of things should be fix. But please tell me what kind of tournaments you do??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906884","commentId":906884,"userName":"ana4","timestamp":1384256414,"content":"I agree, for the organized play, this needs be fixed. I mean I might be a bit crazy but even for me alone, I wouldn't want such loops exist. For some reason I always stick to the rules of the game, never changing them on my own, and I have a hard time just ignore certain things. Also, when I introduce the cards to new players, it feels stupid to tell them, \"well, don't bother with this card, it is too good for the game.\" These issues need be fixed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=906945","commentId":906945,"userName":"alogos","timestamp":1384262839,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > I don't think that cards should get an errata just because they allow loopholes in certain decks. As mentioned, Zigil Miner and Master of Lore are bad examples of using errata. Best thing is to ignore these cards or certain combos, if you think they're overpowered.\n> > > \n> > >  \n> > > \n> > > I agree... do not like the idea of making more coasters just because there are crazy combo's out there that a few people play (or create to merely see if they can)... its a solo or Co-Op game, play it your way... if you like 1 round games... great... I think I'd find that a bit boring... \n> > > \n> > >  \n> > \n> >  \n> > \n> > It's true if you play alone. But we organised tournament play around the game and we de don't want to see these type of decks.\n> > \n> >  \n> \n> Yes sure this kind of things should be fix. But please tell me what kind of tournaments you do??\n> \n>  \n\n \n\nThis should be discussed in a new thread to keep things clear here. Maybe in player community ?\n\nTo be short, we were not convinced by the Race against the shadow format and so every tournaments I know were made with custom rules, some even used fan cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=907108","commentId":907108,"userName":"leptokurt","timestamp":1384273188,"content":"> Actually all this problems come from unlimited draw and unlimited size of players hand. Quite difficult to keep some balance if players can draw like crazy and keep every thing in they hand. So this kind of combo will always appear until they fix the rules about it.\n\nA hand limit would be neat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=907250","commentId":907250,"userName":"richsabre","timestamp":1384281753,"content":"Occam's Razor- this simplest solution is usually the correct one.\n\n \n\nso yes- it would be far better to introduce a hand limit or similar as suggested instead of changing every card in the future that breaks the game\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=907251","commentId":907251,"userName":"Glaurung","timestamp":1384281804,"content":">  \n> \n> > Actually all this problems come from unlimited draw and unlimited size of players hand. Quite difficult to keep some balance if players can draw like crazy and keep every thing in they hand. So this kind of combo will always appear until they fix the rules about it.\n> \n> A hand limit would be neat.\n> \n>  \n\nYes probably hand limit will be enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=907267","commentId":907267,"userName":"chuckles","timestamp":1384282716,"content":"> > > I don't think that cards should get an errata just because they allow loopholes in certain decks. As mentioned, Zigil Miner and Master of Lore are bad examples of using errata. Best thing is to ignore these cards or certain combos, if you think they're overpowered.\n> > \n> > I agree... do not like the idea of making more coasters just because there are crazy combo's out there that a few people play (or create to merely see if they can)... its a solo or Co-Op game, play it your way... if you like 1 round games... great... I think I'd find that a bit boring...\n> \n> It's true if you play alone. But we organised tournament play around the game and we de don't want to see these type of decks.\n\nThat is really cool that you run tournaments... first thought was Glaurung's idea about limiting draw and deck size would make good sense to me for a tournament... second thought was were how to do make a tournament fair with this game? Like I really love playing this game and aren't worried (too much) about how loop sided the races are or how much more 'powerful' some decks are, (hopefully they'll balance over time) because its a solo/Co-Op game and I don't play competitively... however a tournament would an entirely different matter... how do you balance things in a tournament? Does everyone play some variant of Outlands, Dain & Co, Glorfindel & Friends?\n\nEdited November 12, 2013 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=907321","commentId":907321,"userName":"Lilian","timestamp":1384285666,"content":"> That is really cool that you run tournaments... first thought was Glaurung's idea about limiting draw and deck size would make good sense to me for a tournament... second thought was were how to do make a tournament fair with this game? Like I really love playing this game and aren't worried (too much) about how loop sided the races are or how much more 'powerful' some decks are, (hopefully they'll balance over time) because its a solo/Co-Op game and I don't play competitively... however a tournament would an entirely different matter... how do you balance things in a tournament? Does everyone play some variant of Outlands, Dain & Co, Glorfindel & Friends?\n\nI open a thread for our tournaments..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=907467","commentId":907467,"userName":"Mika Mika","timestamp":1384294614,"content":"Glaurung wrote : \n\n> But please tell me what kind of tournaments you do??\n> \n>  \n> \n>  \n> \n>  \n> \n>  \n\nHere is your answer : \n\n\nLotR Organized Play : The French Way [https://community.fantasyflightgames.com/index.php?/topic/93425-lord-of-the-rings-organized-play-the-french-way/]\n\n \n\nEDIT : OOPS, sorry Lilian, I was answering Glaurung when you offered to answer this question. \n\nEdited November 12, 2013 by Mika Mika"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=907729","commentId":907729,"userName":"Lilian","timestamp":1384325380,"content":"> EDIT : OOPS, sorry Lilian, I was answering Glaurung when you offered to answer this question. \n\nNo problem, it's seem you're better in english..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93154-over-powered-decks/?do=findComment&comment=908155","commentId":908155,"userName":"wyrm187","timestamp":1384368530,"content":"For tournament play wouldn't FFG have to address the never ending looping decks? A hand limit may help but I am starting to think that making a restricted list wouldn't be so bad to break up some of the ridiculous combos. I don't think bans are necessary, just the inability to play multiple OP cards in the same deck"}]}