{"url":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/","title":"Participating in attack / ranged attack (oh no, not again... ;) )","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904698","commentId":904698,"userName":"krokodiler","timestamp":1383905811,"content":"OK, have another question regarding participating in (ranged) attack.\n\n \n\nHere's a situation:\n\nPlayer A has Legolas with Unexpected Courage. He uses him in his combat phase to declare an attack against an enemy engaged with player B. Then he uses UC and ready him.\n\nNow it's player's B time for combat, but all of his characters are already exhausted. Can he DECLARE an attack against an enemy engaged with him (it can be, but it is not essential, an enemy which has just been attacked by Player's A Legolas) and use Player's A Legolas as THE ONLY attacking character in this attack? What exactly means \"participate in attack\" from Ranged definition from rules? Is it:\n\n- a case 1 when there is one (or more) character of active player attacking an enemy and ranged character of another player actually \"joins\" this attack or\n\n- a case 2 when this ranged, participating character is actually the only attacking character?\n\n \n\nAnd one more question regarding joining an attack. Here's quote from FAQ:\n\n \n\n(1.11) Limitations on Attacks\n\n(...) Characters are not limited as to how many times they\ncan participate in attacks against the same enemy,\nprovided each attack can be legally declared, and the\ncharacter is ready and eligible to be declared as an\nattacker.\n\n \n\nDoes this mean that when player A DECLARES an attack against an enemy engaged with him, then he attacks, but not destroy it with his Gimli, then he readies Gimli with UC and then, the same Combat phase, player B DECLARES an attack with his Ranged Legolas against the same enemy (engaged with player A) CAN Gimli JOIN these attack? This second attack is legally declared by player B, characters are ready - so I think he can?\n\n \n\n(side note: Gimli is excellent example IMHO, because he is always eager to fight as we know from the book (or film), so this is very thematic... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904703","commentId":904703,"userName":"alogos","timestamp":1383907438,"content":"Yes, you got that right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904715","commentId":904715,"userName":"CJMatos","timestamp":1383909043,"content":"Situation 1:\n\n \n\nIt is case 1 because if player B has all his characters exhausted, i do not believe he can declare an attack.\n\n \n\nThat because he must, first, choose a character able to attack (which he doesn't have).\n\n \n\nSecondly, choose the enemy, and then the player B chooses Legolas (or any other ranged character) to join the attack...\n\n \n\n \n\nPlayer B does not control Legolas to be able to choose him as the unique attacking character....\n\n \n\n \n\nSituation 2:\n\nIf the situation was the other way, Legolas with the UC, i had no doubt, duw to the ranged keyword on Legolas.\n\n \n\nAs you put it, i have my doubt if Gimli can join.\n\n \n\nAlthough i am inclined to say you are right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904717","commentId":904717,"userName":"krokodiler","timestamp":1383909248,"content":"alogos, on 08 Nov 2013 - 11:43 AM, said:\n\nYes, you got that right.\n\nThanks for your answer. I take it as I'm right on all points then.\n\n(BTW, short answer to loooong question, ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\nIt makes combat much easier - provided you have UC and Ranged characters.\n\nEdited November 8, 2013 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904720","commentId":904720,"userName":"krokodiler","timestamp":1383909677,"content":"Ahhh, not so fast... Another post come up when I was typing answer for alogos.\n\nThanks CJMatos, too. I think you are right - as it is written in rules:\n\n\"In order to declare an attack, a player must exhaust at\n\nleast 1 ready character.\"\n\nAs Player A controlls Legolas, he cannnot be exhausted by Player B, I'm afraid.\n\nI wish cases like these were exactly and simply explained in FAQ...\n\nEdited November 8, 2013 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904786","commentId":904786,"userName":"alogos","timestamp":1383920232,"content":"> alogos, on 08 Nov 2013 - 11:43 AM, said:\n> \n> Yes, you got that right.\n> \n> Thanks for your answer. I take it as I'm right on all points then.\n> \n> (BTW, short answer to loooong question, ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n> \n> It makes combat much easier - provided you have UC and Ranged characters.\n\n \n\nWait, I didn't see there was another question in the middle....\n\nSo, CJMatos is right in the first situation, the player B cannot declares an attack, so it's case 1.\n\n \n\nSituation 2 is still right. Gimli can participate in more than one attack against the same ennemy, it's the player that can't declare the attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904795","commentId":904795,"userName":"krokodiler","timestamp":1383921615,"content":"I've searched BGG forums a bit and I've found this thread: http://boardgamegeek.com/thread/711353/uses-of-ranged [http://boardgamegeek.com/thread/711353/uses-of-ranged]\n\n\" (...) So say Player A has two Ranged characters, and Player B is Engaged with an Enemy.Can Player A, in his turn to declare attacks, declare both Ranged characters as attackers to the Enemy engaged with Player B?\n\nYes, player A is active to declare attacks, and both ranged characters can participate via ranged.\n\nIf Player A declares one (or more, depending on above answer) Ranged character/s as an attacker against that Enemy engaged with Player B, Can Player B's normal characters participate in that attack? What if those characters (Player B's) have Ranged themselves?.\n\nNormal characters cannot participate, as it is not player B's turn to attack. (emphasis mine)\n\nRanged characters cannot participate, as the enemies are not engaged with another player.\n\n(...)\" Full posts: http://boardgamegeek.com/thread/711353/uses-of-ranged, [http://boardgamegeek.com/thread/711353/uses-of-ranged,] post #8 is also very good.\n\nSo, in case I wrote in second part of my post here, it seems Player's A Gimli cannot join a ranged attack declared by Player's B Legolas as it is not his (i.e. player's) turn to attack. I assume he cannot join this attack even if it would be his first attack on this enemy that Combat phase. But Legolas of course can join attack declared by Player A and also Player B can declare a ranged attack with his Legolas on the same enemy later (thanks to Ranged keyword).\n\nEdited November 8, 2013 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=904799","commentId":904799,"userName":"Kassad","timestamp":1383921894,"content":"I had my own answer here but I believe Krokodiler's answer is accurate so I have removed mine since it is now redundant.  Evidently he types faster.\n\nEdited November 8, 2013 by Kassad"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=905202","commentId":905202,"userName":"alogos","timestamp":1383990801,"content":"That post...\n\n \n\nseems right...\n\n \n\nI've been playing wrong the whole time ?\n\n \n\nThanks for bringing that post from the old times up. I would include it in my homemade faq and spreads the words... I suspect all my community is playing it wrong too..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/?do=findComment&comment=905264","commentId":905264,"userName":"krokodiler","timestamp":1384007915,"content":"> I had my own answer here but I believe Krokodiler's answer is accurate so I have removed mine since it is now redundant. Evidently he types faster.\n\nAnd he searches and he does CTRL+C & CTRL+V, too ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] !\n\nBut, alas, everything has its price - my eyes and wrists are not the same as they were years ago... :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nEdited November 9, 2013 by krokodiler"}]}