{"url":"https://community.fantasyflightgames.com/topic/93362-my-favourite-combo-and-its-gondor/","title":"My favourite combo - and it&#039;s Gondor!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/93362-my-favourite-combo-and-its-gondor/?do=findComment&comment=906529","commentId":906529,"userName":"leptokurt","timestamp":1384207803,"content":"While scrolling through some threads I found this little gem here:\n\n \n\n \n\n> so stand together(core) and light the beacons(HoN) is an amazing combo especially with gondorian spearmen(core) and spear of the citadel(HoN)\n\n \n\nWow, I didn't realize (as i never played it) that Stand Together allows you to team up your fellowship for every single attack during combat phase.\n\n \n\n \n\nEvery.\n\n \n\nSingle.\n\n \n\nAttack.\n\n \n\n \n\nTogether with Light the Beacons I had a jolly good time when reaching the Weathertop while playing A Knife in the Dark. What a joy, seeing these Nazguls eliminating themselves after attacking multiple times gainst my wall of Gondorian Spearman and 2x Spear of the Citadel! First time I welcomed this nasty shadow effect. I banished all three Nazgul plus two more enemies in one turn with only six allies standing. Only the Witch King remained to be taken out one turn later.\n\n \n\nI love this combo, although I have only one copy of Stand and Fight. If you add Blood of Numenor and Gondorian Shield to the mix, you're able to set up a strong defense. Only thing you have to do is to spare some resources for the defending hero.\n\n \n\nMy suggestion for a hero combo: Caldera, Eowyn, Beregond (27 threat)\n\n \n\n6 WP, 4 DEF, only ATT lacks a bit, but both tactics and spirit offer a lot of Gondor allies to fill that gap.\n\n \n\nPerhaps all that lamenting about Gondor not being that strong is because most folks seem to think that Gondor's sphere is leadership.\n\n \n\nIt is not.\n\n \n\nIt's spirit!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93362-my-favourite-combo-and-its-gondor/?do=findComment&comment=906555","commentId":906555,"userName":"richsabre","timestamp":1384209046,"content":"nice combo....didnt think about this one at all\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93362-my-favourite-combo-and-its-gondor/?do=findComment&comment=906694","commentId":906694,"userName":"Demoncow","timestamp":1384221974,"content":"It works even better with sentinal and on siege quests"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93362-my-favourite-combo-and-its-gondor/?do=findComment&comment=906800","commentId":906800,"userName":"ana4","timestamp":1384238488,"content":"Yeah, I like Stand Together. I actually also use it to team up Spearman with Beorn. I am still not 100% sure it is legal but strictly reading the card, it 100% should, as the card doesn't interact with Beorn, just with the rules for defending. Bottom line, Stand Together is cool, Light the Beacons is great if you can afford it, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93362-my-favourite-combo-and-its-gondor/?do=findComment&comment=906802","commentId":906802,"userName":"ana4","timestamp":1384238600,"content":"By the way, I play Gondor in every sphere, four mono-sphere decks. And she is strong. The heroes throughout are 50% Gondor, the theme is very much Gondor with some friends all over the place."}]}