{"url":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/","title":"Heirs to Numenor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911240","commentId":911240,"userName":"Boris_the_Dwarf","timestamp":1384783729,"content":"After months of telling myself it's me, I must be doing something wrong, and I just need to be more open-minded as I rethink my strategy, I finally had to admit to myself: I loathe the Heir to Numenor box set. (Sorry Caleb.)\n\n \n\nSpecifically, I can't beat the darn thing no matter what I try. Battle and Siege go completely against the spirit of the game and pigeonhole players into a specific deck concept. There's no room for free thinking with this. I've run Peril into Pelagrir about 10 times with 8-10 different approaches and frankly, nothing has worked. The only other quest that has frustrated me this much is Battle of Laketown.\n\n \n\nI'm fine with difficult - I prefer a challenge - but these quests just feel wrong. The whole idea is willpower quests, attack is for hitting and defense is for blocking. When you force players to disregard one stat and divide the focus of another, that is just bad design in my opinion.\n\n \n\nThe reason for posting this is to get feedback about how other players are dealing with this box set. I'm definitely open to suggestions. I don't care as much about deck lists as I do about hearing strategies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911255","commentId":911255,"userName":"alogos","timestamp":1384785957,"content":"When they released Master of Lore, I laughted. When I revealed Blocking Wargs, I laughted... I play this game because of the global mechanism of the game, the artwork and the theme.\n\nI know they come up with broken cards, and this is the only bad point that make this game still awesome.\n\nI deal with it.\n\n \n\nHoN will never be my favourite extension, but if I want to play tactics, I know wich scenario to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911274","commentId":911274,"userName":"lleimmoen","timestamp":1384788809,"content":"There are many examples of decks that do well against these quests, and actually do quite well elsewhere as well. You might look up the strategy section.\n\n \n\nI think what they tried was to actually make decks more flexible. Of course one way is to disregard willpower in your decks - but you may still run into trouble, especially against Pelargir (not to mention most of the AtS quests). The other way is to prevent the Spirit quick runners from succeeding against every quest, which had pretty much been the case before Heirs of Númenor arrived."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911295","commentId":911295,"userName":"Style75","timestamp":1384790717,"content":"FYI blocking wargs was errataed to make it a lot easier. That being said, the quests are still brutally hard. I always play the HoN quests on Easy Mode [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/easy-mode/LOTR_Easy_Mode.pdf] now. It's much more fun that way and I highly recommend it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911386","commentId":911386,"userName":"Alex6222","timestamp":1384797720,"content":"Heirs of Numenor can be brutal. I really liked the concept of battle and siege for questing but i think it was not handled very good. What i mean with this is that these 3 new quests introduced the new keywords in almost every stage so \"regular\" deck had trouble with them. If you look at the AtS quests it is handled better. Siege and battle only appear in one stage of the quest or some locations changed the keywords, i think this is how it should have been handled in HoN. But having said that i still like these quests a lot, perhaps if you use Outlands for them you could have more fun and beat them more regurarly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911387","commentId":911387,"userName":"Scroll Lock","timestamp":1384798024,"content":"I agree that battle/siege keyword is stupid. It makes willpower useless and questing unthematic for me. If you have many locations and not a single enemy you can still lose fight. It would be better with normal questing, \"0 quest points quest cards\" and many many enemies IMO.\n\nBattle keyword also made some cards designed before HON overpowered, e.g. vassal of the windlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911409","commentId":911409,"userName":"Glaurung","timestamp":1384799931,"content":"I suggest you look my channel on youtube where you can see how i play solo most of the quests in the game. \n\n \n\nhttp://www.youtube.com/results?search_query=olegyd&sm=3 [http://www.youtube.com/results?search_query=olegyd&sm=3]\n\n \n\n \n\nI really love idea of Battle Siege mechanic. Really good improve of the game.\n\n \n\nJust look my videos and you will see now how  you can do it and make a deck and cruch the orcks….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911432","commentId":911432,"userName":"Ellareth","timestamp":1384802134,"content":"I rather like Battle and Siege because they are innovative and thematic,\n\nbut I do agree it is probably bad in a way it makes willpower kind of useless.\n\n \n\nI have managed to conquer HoN scenarios at the time of their release (using one Core Set, without Against the Shadow/Black Rider player cards and Blocking Wargs errata), and I do agree that tactical decisions matter as much as deck building for these scenarios.\n\n \n\n1. Pelargir\n\nHero choices :\n\nBeorn, Eleanor, Elrond.\n\n \n\nDeck overview :\n\ncheap and effective tactics allies (1~2 cost Eagles + Defender of Rammas), Vilya and half a dozen 4~5 cost allies, Stargazer & Zigil Miner, Spirit Events (Cancels, threat reducers, Will of West).\n\n \n\nStrategy : \n\n- You must ditch the scroll at turn 1, I usually give it to Eleanor and block a 3 attack enemy with her.\n\n- Do not be concerned with quest in the begining, always hold back enough characters to kill off engaged enemies and an extra blocker then send rest to quest.\n\n- Even if you have think you have the best hand evere, mulligan if you do not see 1~2 cost tactics allies. Elrond is there for his flexible resource more so than Vilya combo.\n\n- Stall until you can muster about 20 willpowers a turn before moving on to last stage of quest.\n\n- Hasty Strokes are reserved only when a hero is about to be killed or entire hand is about to be discarded.\n\n- Eleanor is reserved for Colleteral Damage, Test of Wills are reserved only for back to back Colleteral Damage.\n\n- Always have atleast 1 resource on Spirit hero.\n\n- Don't be afraid to take undefended hits if it can be done without a death of hero and an extra enemy could be killed as result.\n\n- Rather than drawing Gandalf, try and have Elrond and Vilya ready and Gandalf at top of the deck if situation allows; playing - -- Gandalf before engaging Zealous Traitor can be life savor.\n\n \n\n2. Ithilien\n\nHero choices :\n\nBeorn, Eleanor, Elrond.\n\n \n\nDeck overview :\n\ncheap and effective tactics allies (1~2 cost Eagles + Defender of Rammas), Vilya and half a dozen 4~5 cost allies, Stargazer & Zigil Miner, Spirit Events (Cancels, threat reducers, Will of West).\n\n \n\nStrategy :\n\n- Do not quest first turn, focus on killing the enemies first.\n\n- Do not quest unless you can quest for more than a dozen points.\n\n- Getting tactics ally out on turn 1 is essential.\n\n- Chump block with 1 hp allies only when Beorn has enough hp to take absorb the damage if this attack would become undefended, otherwise use Elrond or Beorn for blocking.\n\n- Try and avoid blocking against Harad enemies using heroes if possible.\n\n- Kill that Ranger-in-staging-area before moving on.\n\n- This is big one, always, I mean always-every-single-time expect the shadow card to be either Blocking Wargs or Attack Booster and make a move in a way hero wouldn't die, even if it is suboptimal one.\n\n- Eleanor is reserved for Blocking Wargs only when 2 or more questing tactics allies are about to be killed.\n\n- Wait until last quest card would become Siege quest before moving on, with atleast 12 defences (3 Winged Guardian or Defender of Rammas).\n\n \n\n \n\n3. Cair Andros\n\nHero choices :\n\nLegolas, Hama, Beorn\n\n \n\nDeck overview :\n\nLot of 1~2 cost tactics allies, Thicket of Spears + Feint, Hands Upon Bow, few weapons (Rivendel Blade, Blade of Gondolin) and Foe hammer.\n\n \n\nStrategy :\n\nMulligan for Thicket of Spears or Defender of Rammas or Winged Guardian.\n\nRecycle Feint and Thicket of Spears with Hama if possible.\n\nHands Upon Bow is only used when doing so would clear a location.\n\nTry and clear first 2 Battleground locations, but let the Citadel fall.\n\n \n\n \n\nWith today's card pool I expect decks could be tuned up a bit.\n\nI can see Outlands allies in Elrond deck instead of Vilya/expensive allies and Hammerstroke (to be used if it means clearing a battleground location) in mono-tactics deck as possible improvements.\n\nWith Blocking Wargs errata, you can probably replace Eleanor with Spirit Glorfindel or Frodo as well.\n\n \n\nDefinitely not an easy set of quests, and I found counting some of brutal cards (Colleteral Damage, Blocking Wargs) to be useful but definitely not neccessity.\n\n \n\nGood luck and hope you can defeat HoN in near future with satisfying experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911446","commentId":911446,"userName":"Nickpes","timestamp":1384802905,"content":"Ι won all of the quests with a solo mono tactics deck with peril in pelargir giving some trouble, the others where not that hard. You just have to find a reply to battle and siege"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911530","commentId":911530,"userName":"Boris_the_Dwarf","timestamp":1384808484,"content":"Thanks for all the responses.\n\n \n\nWe've talked about house-ruling the terms:\n\n \n\nBattle (When questing you may use all of your characters' attack value instead of their wlllpower value)\n\nSiege (When questing, you may use all of your characters' defense value instead of their willpower value)\n\n \n\nThis would allow tactics characters to get in on the questing but not leave the willpower folk sitting their waiting to die."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=911574","commentId":911574,"userName":"chuckles","timestamp":1384811093,"content":"> I suggest you look my channel on youtube where you can see how i play solo most of the quests in the game. \n> \n>  \n> \n> http://www.youtube.com/results?search_query=olegyd&sm=3 [http://www.youtube.com/results?search_query=olegyd&sm=3]\n> \n>  \n> \n>  \n> \n> I really love idea of Battle Siege mechanic. Really good improve of the game.\n> \n>  \n> \n> Just look my videos and you will see now how  you can do it and make a deck and cruch the orcks…..\n\n \n\nI really like these quests & like the Battle & Siege mechanics (hope they continue to pop up from time to time). Personally i liked being encouraged to change my play style (and got to play many cards I'd previous ignored)\n\n \n\nLike lleimmoen mentioned there are lots of really helpful previous posts that relate and Glaurung video's are worth watching.\n\n \n\nMy strategy is simply to get a whole of out Axe & Shield in to play (and have some alternative means of attacking and avoiding the need to defend)... in short a huge increase in tactics hero's & allies & events & attachments. There are lots of relatively cheap tactics allies for battles or Sieges.\n\n \n\nBeorn (the hero) went from being ignored to great battle quester, especially in early rounds. In the siege quests, when often my defenders were all used up questing...Beorn would defend soaking up multiple few attacks. (I think that I got the Beorn idea from one of the blogs http://hallofbeorn.wordpress.com/ [http://hallofbeorn.wordpress.com/] or  http://talesfromthecards.wordpress.com/ [http://talesfromthecards.wordpress.com/] ... both blogs are great and have lots of very helpful information."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=914142","commentId":914142,"userName":"Serazu","timestamp":1385072654,"content":"> Battle and Siege go completely against the spirit of the game\n\n \n\nAgainst the... spirit in deed!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=914215","commentId":914215,"userName":"chuckles","timestamp":1385078743,"content":">  \n> \n> > Battle and Siege go completely against the spirit of the game\n> \n>  \n> \n> Against the... spirit in deed!\n> \n>  \n\n \n\nhahaha... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=915586","commentId":915586,"userName":"Boris_the_Dwarf","timestamp":1385303376,"content":"Always fun when someone catches my puns. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=915633","commentId":915633,"userName":"Bullroarer Took","timestamp":1385309399,"content":"I think Battle and Siege were major steps forward."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=915649","commentId":915649,"userName":"leptokurt","timestamp":1385312487,"content":"I agree with Bullroarer that battle and siege are a (huge) step forward. They create new possibilities to create decks by maing tactics a viable option. I also love the flavour that they add to certain quests (for which Peril in Pelargir is a fine example). And it is not that you don't need WP anymore. Stage 3 of PiP can be a ***** if you don't have access to enough WP."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=915757","commentId":915757,"userName":"klaymen_sk","timestamp":1385327341,"content":"> I think Battle and Siege were major steps forward.\n\nIndeed. Now the game is not mainly about willpower cheesing. Especially my beloved tactics sphere became more viable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=916448","commentId":916448,"userName":"Boris_the_Dwarf","timestamp":1385413406,"content":"Willpower cheesing? I really don't know what that is supposed to mean. The game has a rigid structure to it. HoN takes away one of the three basic elements with the same effect playing without pawns might have in a game of chess. Now there won't be any \"queen cheesing\" since there are no pawns to cross the board to the opponent's back row.\n\n \n\nI think the sentiment of your statement can be understood with the phrase \"my beloved tactics sphere.\" It's disappointing that being a part of the tactics sphere generally means the character can't quest. But that doesn't make smashing one of the central pillars on which the game is built any less bad design.\n\nEdited November 25, 2013 by Boris_the_Dwarf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=916457","commentId":916457,"userName":"Kassad","timestamp":1385414129,"content":"I would have enjoyed seeing Willpower converted to another purpose since the Battle/Siege mechanics are in play.  Make Treachery cards that perform Willpower checks.  Make cards that allow Willpower to have some sway over attacking and defending.  Something to balance the expansion.\n\n \n\nIt feels to me that decks built to beat most quests struggle in HoN, and decks built to be HoN struggle against the other expansions.  This may have been the intent, but it definitely feels a bit odd.  It means FFG is purposefully making sets within the game that play by a completely different set of rules and ignores an important stat. There aren't really quests, especially a series of quests, that completely ignore Attack and Defense values.  I definitely wouldn't call HoN a positive playing experience.  Especially Into Ithilien with more than 2 players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=916462","commentId":916462,"userName":"CaffeineAddict","timestamp":1385414543,"content":"I'm surprised to read negative reactions to battle and siege, to be honest, I thought the addition of those keywords added some good depth and variation to questing. I found the way it mixed up the status quo of how quests worked was very good design, not bad design, as suggested in this thread. Similarly, I thought making you need willpower to fight spectral enemies in Stone of Erech was a good twist."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=916467","commentId":916467,"userName":"Scroll Lock","timestamp":1385414971,"content":"stone of erech ignores ATK, doesn't it?\n\nI agree that ignoring an aspect of game is strange, but thematic. In battle you mostly need battle skills, so battle/siege is thematic, but I understand what you dislike about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=916488","commentId":916488,"userName":"Kassad","timestamp":1385416680,"content":"> stone of erech ignores ATK, doesn't it?\n> \n> I agree that ignoring an aspect of game is strange, but thematic. In battle you mostly need battle skills, so battle/siege is thematic, but I understand what you dislike about it.\n\nMy frustration isn't with just Battle/Siege with HoN. My frustration is with the combination of much harder creeps, mechanics that make fighting in general more difficult in Battle/Siege, and Treachery cards that don't scale well to 3 and 4 player games. In a vacuum ( just the 3 HoN quests) it is extremely fun. If you are trying to play an entire \"campaign\" HoN doesn't play well with other expansions. Balanced decks can beat Stone of Erech pretty consistently even with Spectral. I can't say the same for HoN. Edited November 25, 2013 by Kassad"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=938745","commentId":938745,"userName":"Scroll Lock","timestamp":1388083512,"content":"I didnt want HoN because of battle/siege, but now I have it(because of that Ithilien quest and rangers) and I changed my opinion. While I only have core, AJtR, TDM, H:OHaUH, AoO and HoN I have beaten Pelargir and I had fun. But maybe I made a mistake- do I ignore text of the location The Leaping Fish if it is in my victory display? I think NO but I want to be sure.\n\nSorry for my poor English."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=938783","commentId":938783,"userName":"klaymen_sk","timestamp":1388089915,"content":"Yes, you ignore it. In victory display means \"out of play\", therefore its text has no effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=938807","commentId":938807,"userName":"Scroll Lock","timestamp":1388093186,"content":"PiP wasnt that hard then, 1st deck I constructed for it did it, even without checking 2nd and 3rd stage before (except for keyword). Now it is time to play it with thematic deck :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nBut INTO ITHILIEN looks terribly hard... And awesome :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=938996","commentId":938996,"userName":"Nickpes","timestamp":1388118058,"content":"I had a very hard time and near five attempts to beat PiP but won Into Ithilien easily on the other hand  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=939180","commentId":939180,"userName":"Scroll Lock","timestamp":1388155724,"content":"I won Into Ithilien on my very first try with my very first deck constructed for it :/\n\nAre these quests harder with more players? I play solo and I find them enjoyable but too easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=939478","commentId":939478,"userName":"EclatK","timestamp":1388179260,"content":"Yes, Into Ithilien (and the majority of the other quest) is harder in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=939509","commentId":939509,"userName":"klaymen_sk","timestamp":1388182722,"content":"Yup, the more players, the harder the quests usually are. Last time we tried Into Ithilien with a friend, we got our asses kicked by unfortunate combination of encounter cards in the first few rounds. 5 times in a row."},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=940107","commentId":940107,"userName":"EclatK","timestamp":1388269287,"content":"When there is more player, the deck can deal a lot more than one card per player (multiple surge effect), increasing the difficulty!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/93683-heirs-to-numenor/?do=findComment&comment=941627","commentId":941627,"userName":"Cabello","timestamp":1388450525,"content":"I really like what siege and battle brought to the game. I find them a very thematic way of dealing with those subjects and I like the change. For reference I play 4 player pretty much exclusively and lose quite a lot, especially to those blocking wargs, but we all think the change was just a great idea"}]}