{"url":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/","title":"Poll at BGG (life of LotR:LCG)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=917460","commentId":917460,"userName":"John85","timestamp":1385524063,"content":"FFG released the last new content for one of it's LCGs today (Warhammer: Invasion). In other words one of the LCGs has died. W:I ran 2009-13 and released 5 big box expansions and 36 \"Battle\" packs. It is the first of the LCGs to \"die.\"\n\n \n\nThis news got me thinking about the life of LotR: LCG so I made a poll at BGG for everyone to hypothesize about the life left in this game, here:\n\nhttp://www.boardgamegeek.com/thread/1077710/one-of-ffgs-lcgs-ends [http://www.boardgamegeek.com/thread/1077710/one-of-ffgs-lcgs-ends]\n\n \n\nAnswer and post comments as you wish."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=917649","commentId":917649,"userName":"richsabre","timestamp":1385553540,"content":"interesting poll. i shall comment here instead of bgg. it is sad to see any living card game die\n\nas for this game, my thoughts are as follows:\n\n \n\never since the release of the book saga line, i have believed that the game will have at least another 3 years. i think that ffg will release 2 saga packs per 'book' making that 6 with 2 per year. therefore that gives the 3 years.\n\n \n\nin this i see 1 deluxe and cycle as usual making that another 3 cycles including the isengard one\n\n \n\nafter this i hope that the game continues as usual. i am not one who will be bothered if ffg go back in time as i dont think it matters. but i guess it depends on how popular the game is by then\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=917756","commentId":917756,"userName":"jc1138","timestamp":1385563611,"content":"I'm hoping they don't follow the pattern they set with The Hobbit, and only give 2 saga boxes per volume.  Why race to the end?  They can certainly get more than 6 quests out of books 3 and 4 (the material in The Two Towers) and still have plenty for VoI and other expansions.  The same can be said of other parts of LotR's.  The way I see it:\n\nFor book 2: 1 more saga box (the announced The Road Darkens)\n\nBook 3: 2 saga boxes \n\nBook 4: 1 saga box\n\nBook 5: 2 saga boxes \n\nBook 6: 1 saga box\n\nThis is 7 more saga boxes, and, if 2 are released per year, 3 and a half years.  This would ride The Hobbit films momentum (including expanded edition releases).  I'm a big fan of all of the content for this game, but the saga boxes are what I was looking for when I first got into the game (at around the release of Shadow and Flame), and remain my favorite product.\n\n \n\nThe tricky part is what happens after they release that final RotK box.  Decipher's LotR's TCG (based on the films) got a restructuring when they released their Mount Doom expansion, but many in the player base did not go along with it because they felt the new direction was merely a repackaging of old material, and they were in many ways right.  \n\n \n\nGoing back even further, Middle Earth: The Wizards, while it had it's good points (and has it's champions to this day), was in some ways doomed from the beginning in that it released the scope of Tolkien's TH/LotR's Legendarium in the first set.  They held nothing back. and later expansions were ways to repurpose elements of it (different versions of dragons, play as corrupted Wizards or Nazgul).  \n\n \n\nFFG has obviously done it's homework, because it will still has it's own quest's and deluxe expansion's to fall back on after they wrap up the last RotK saga box, but, unless they could somehow gain access to The Silmarillion (hasten the day, O Lord) then it may put them in a tough spot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=917794","commentId":917794,"userName":"John85","timestamp":1385566060,"content":"> FFG has obviously done it's homework, because it will still has it's own quest's and deluxe expansion's to fall back on after they wrap up the last RotK saga box, but, unless they could somehow gain access to The Silmarillion (hasten the day, O Lord) then it may put them in a tough spot.\n\nNot to be contrarian (or anger anyone), but I'd kind of like to see the Silmarillion remain unadapted (by movies, games, etc.), let that part of middle-earth stay in our imaginations. Of course I don't mind the artistic depictions, so I guess that makes me a little hypocritical. Maybe it's a romantic notion, just how I feel though. I'm interested in what rich thinks about that (leaving Silmarillion alone just to leave it alone)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=917840","commentId":917840,"userName":"Raven1015","timestamp":1385569107,"content":"Personally, I've always seen the Saga Expansions as a whole different beast than the cycle. Based on what FFG has said, the \"real\" timeline of the game seems to be that which takes place during the cycles, meaning before the War of the Ring, and FFG has jumped around in that time space. The Saga Expansions are like an \"extra\", so I've never quite understood why we should believe that the Saga Expansions wrapping up will have any impact whatsoever on the life cycle of the game. Once the Ring is tossed into the fire, we won't be going back in time, because we never really went forward in time. It's like playing Voice of Isengard after getting Frodo to Rivendell or playing The Battle of Lake-town after Shadow and Flame. So, to answer the question, I think the game will continue long after the last Saga Expansion, and this won't pose any problem at all, they'll just continue creating cycles. From what FFG has said, this game sells well, and unless its popularity drops off tremendously, I would say at least another 5 years.\n\nEdited November 27, 2013 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=917936","commentId":917936,"userName":"camacazio","timestamp":1385574275,"content":"4 years is a pretty good run for most 90s CCGs. The LCG format has a much better built-in longevity for a number of reasons. I think all the speculation of LOTR ending is fairly pointless right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=918206","commentId":918206,"userName":"Gizlivadi","timestamp":1385593216,"content":"> Personally, I've always seen the Saga Expansions as a whole different beast than the cycle. Based on what FFG has said, the \"real\" timeline of the game seems to be that which takes place during the cycles, meaning before the War of the Ring, and FFG has jumped around in that time space. The Saga Expansions are like an \"extra\", so I've never quite understood why we should believe that the Saga Expansions wrapping up will have any impact whatsoever on the life cycle of the game. Once the Ring is tossed into the fire, we won't be going back in time, because we never really went forward in time. It's like playing Voice of Isengard after getting Frodo to Rivendell or playing The Battle of Lake-town after Shadow and Flame. So, to answer the question, I think the game will continue long after the last Saga Expansion, and this won't pose any problem at all, they'll just continue creating cycles. From what FFG has said, this game sells well, and unless its popularity drops off tremendously, I would say at least another 5 years.\n\n \n\nI agree complete about people saying the game will supposedly \"end\" when we get to the final Saga expansion. Those assumptions never made much sense to me. However, I would take it even further. I think the developer team will (if they have not done so already) drop the \"pre-LOTR\" timeline for the cycles and that we will start seeing cycles and expansions happening DURING the time of the trilogy, such as the Battle of Dale for example, and many other War of the Ring scenarios (either invented by FFG or taken from the appendices and such), even after we get the last Saga expansion. If you consider the fact that the Saga expansions are an \"extra\", then you don't even need to have the cycles all happen before the War of the Ring. They could happen either during or maybe even after the WotR (take as an example what Tolkien wrote about the Blue Wizards, that they founded cults and arcane schools in the East that outlived the fall of Sauron. Imagine a cycle based on that!).\n\nEdited November 27, 2013 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94160-poll-at-bgg-life-of-lotrlcg/?do=findComment&comment=918594","commentId":918594,"userName":"richsabre","timestamp":1385640997,"content":"just to clarify my above post at least- i also think the game will go on longer than this current saga pack. i was stating that we must have at least another 3 years or so to end it.\n\nrich"}]}