{"url":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/","title":"The Road Darkens","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=917810","commentId":917810,"userName":"Bullroarer Took","timestamp":1385567145,"content":"Presuming that this is the title for the second LOTR saga box…  What quests are we going to find inside?  As with a few of The Hobbit quests, FFG took their own thunder with the Khazad-Dum and Dwarrowdelf quests.  (I know they didn't know they were going to get the license then and they almost certainly would have done things differently had they known, but it is what it is.)\n\n \n\nSo what quests will we get?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=917850","commentId":917850,"userName":"Narsil0420","timestamp":1385569700,"content":"This is a real puzzler...\n\nThere's so much that happens, so much territory covered in the second half of Fellowship that it makes it hard to predict what they'll do. Plus the territory's been pretty well covered by previous expansions, of course. \n\nAction-y Events we haven't seen:\n\n \n\nFighting Wargs in a ring of trees\n\n \n\nFighting Uruks at Amon Hen\n\n \n\nThe battle at Amon Hen is the only thing I really want to see in the pack but that warg fight would be pretty cool too!\n\n \n\nI'm ok going to Caradhras or fighting in Balin's Tomb again but I wont' be disapointed if we don't see another Balrog battle.\n\nI think the battle in Balin's Tomb is much more interesting and the Fellowship don't \"fight\" the Balrog anyway.\n\n \n\nI think my ideal would be \n\n \n\n- Journey South through Eregion climaxing in warg fight.\n\n \n\n-Balin's Tomb fight\n\n \n\n-Amon Hen battle"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=917907","commentId":917907,"userName":"lleimmoen","timestamp":1385572589,"content":"Having gone twice through Moria already makes the planning now quite difficult. I personally cannot see the reason for choosing such a path in the past, other than total lack of foresight. Had ffg really thought there would be no saga in the future? On one hand, I do not want to go through Moria again but on the other it is one of the most iconic chapters of the book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=917937","commentId":917937,"userName":"Scroll Lock","timestamp":1385574376,"content":"I hope we will see fight with wargs and Moria Crossing. The one with Moria should be 6 stage IMO.\n\n1st- Caradhras-terribly hard stage you may skip and go to 2A, but if you success, you win.\n\n2nd- fight with watcher.\n\n3rd- walking :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n4th- fight with Orcs\n\n5th- running :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n6th- getting outside\n\nThese are the quests I want to see, I do not care so much about the 3rd, but Amon Hen would be nice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=917943","commentId":917943,"userName":"camacazio","timestamp":1385574914,"content":"The saga boxes are typically very isolated from the main LCG plotline, since the cycles are before LOTR. I think going through Moria again would be redundant, but possible. We had Conflict at the Carrock, which at the time felt like the LOTR interpretation of the Hobbit encounter, and I enjoyed the retooling to have such a troll stand-off a second time. I do really like the Caradhras idea above, that's genius."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=917965","commentId":917965,"userName":"Narsil0420","timestamp":1385576278,"content":"Yeah, I like that idea of having a branching quest that you have to choose which way you'll go. Try to mimic the difficult decisions the Fellowship had to make between Caradhras/Moria/Gap of Isen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918016","commentId":918016,"userName":"Karlson","timestamp":1385580117,"content":"I am hoping for quests that deviate completely from the Pass of Caradhras, the Misty Mountains, and Moria.  We have seen these several times already, and even though they do make up a significant portion of the second part of Fellowship, there are definitely other options for quests.  \n\nPerhaps begin with an introductory \"The Ring goes South\" quest in which the Fellowship departs Imladris and heads out into the wilderness.  This one could be the easier one of the three quests with less enemies and more iconic locations. \n\n \n\nI would like to see a quest of some sort in Lothlorien.  Though not a lot of action takes place here, it would be interesting to see what they could do with it, and it is an altogether new location in Middle-earth for them to explore.\n\n \n\nA \"Great River\" quest could be a possibility even though \"Journey Along the Anduin\" captured the feel of that chapter rather well already in my opinion.  \n\n \n\nHowever, I'm most excited for how they handle the departure of Boromir at Amon Hen, as that is one of my favorite parts from all three books.  This should be the final quest of this second LotR saga expansion and involve an epic battle with Uruks.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918041","commentId":918041,"userName":"richsabre","timestamp":1385581601,"content":"i really want to go through moria again, even if we have been through twice. it is one of my favourite areas of middle earth.....and i mean..we get to fight the balrog!!! again!!! this time though gandalf could be an objective ally (so no gandalf in decks!)\n\n \n\nother than that we could help haldir with the pursuing goblins, then amon hen.\n\n \n\nreally looking forward to this pack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918051","commentId":918051,"userName":"Bullroarer Took","timestamp":1385582684,"content":"Some great ideas in here. First, I think that we will see Along the River culminating with a Battle card at Amon Hen.\n\nSecond, I had kind of dismissed Lothlorien as a quest, but now I think it could work. Another quest where the ring bearer is split from the Fellowship who must help defend Lorien from the \"Yrch\" while the ring bearer must face the test of Galadriel's Mirror. I expect Boons here too. Phial, bow... hair?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918088","commentId":918088,"userName":"camacazio","timestamp":1385585360,"content":"A Gandalf objective ally is an awesome idea! But it would necessitate every sphere having at least one card to lower threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918123","commentId":918123,"userName":"Karlson","timestamp":1385587633,"content":"> A Gandalf objective ally is an awesome idea! But it would necessitate every sphere having at least one card to lower threat.\n\nAnd I would be lost without my auto-included Gandalf allies for each deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918140","commentId":918140,"userName":"Gizlivadi","timestamp":1385589068,"content":"My only hope is that we do not see a Gandalf objective and that they come up with something else to destroy the Balrog."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918341","commentId":918341,"userName":"Ellareth","timestamp":1385603394,"content":"I know we've seen Moria twice already, but Saga expansions seems to be designed with people with no other expansions in mind.\n\n \n\nIf you are someone who picked up Core Set, Black Rider, and Road Darkens, it would be pretty weird and disappointing to have no Moria (Watcher/Balrog) in the quest.\n\n \n\nMy best guess is that the would clump Caradhras, Wargs, Watcher into one,\n\nBalin's Tomb and Balrog to the second quest,\n\nand Lothlorien, down the Anduin, Uruk ambush into third quest.\n\n \n\nThis probably is out of topic, but for the same reason I believe we won't be seeing another hero version of Legolas and Gimli, but probably will see third variation of Boromir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918556","commentId":918556,"userName":"Kcall07","timestamp":1385635741,"content":"Unlike the film, the departure of Boromir actually happens at the start of The Two Towers. Not only that, but there isn't actually much of a battle at all (that we see). So it's possible they might not include this.\n\nFor myself, I hope for a quest of the fellowship leaving Imladris (we need a spirit Aragorn for this, we some kind of location management ability). I wouldn't mind seeing Moria again. I'd imagine they'd do it in a very different way, like Trolls/Mirkwood in the Hobbit Saga Quests. I'd also love to see Lothlorien in some way. It would be a shame to miss it entirely.\n\nAs for heroes, I'd love to see Aragorn, Legolas, Gimli and Boromir to complete the fellowship. Like the Hobbits in the Black Riders, I hope they have abilities that work perfectly together and with the quest. I know we have old versions but it's not the same. I really want to be able to make a tri sphere three hunters deck. And besides, if they don't do Boromir in the Saga now, they'll never get another chance. I personally also want specific attachments for all the fellowship. Anduril, legolas' bow etc. This is the set I'm looking forward to the most and I can't wait to see what they do with it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918599","commentId":918599,"userName":"richsabre","timestamp":1385641378,"content":"that is true, it does happen in TT, but if you take away the ambush, then you also have to take away any other parts of the story not seen by the eyes of the fellowship....so no battle on the outskirts of lorien. i think it is very likely we shall see amon hen, and probably boromir's departure because otherwise the designers will have to rely heavily on location play...which to mean sounds great (lots of great art) but to most others i think would not be so great.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918678","commentId":918678,"userName":"jc1138","timestamp":1385650769,"content":"> Unlike the film, the departure of Boromir actually happens at the start of The Two Towers. Not only that, but there isn't actually much of a battle at all (that we see). So it's possible they might not include this.\n> \n>  \n\nThis is a good point you raise.  However, this game really pushes the action aspects of LotR's/TH more than the material presented in the books.  The LCG is similar to the films in this (and other) respects, but of course takes the books as it's central focus.\n\n \n\nAnd while you're right about the Amon Hen battle being largely off-screen, and told after the fact, the same can be said for the Ent's attack on Isengard, and it would be a shame to miss out on that in the LCG.  And the Amon Hen attack is also a pretty pivotal event in the plot, that would be a real surprise if it weren't represented in the LCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918692","commentId":918692,"userName":"Narsil0420","timestamp":1385652188,"content":"What about seeing a different Ring-Bearer?\n\n \n\nMy guess is for an Aragorn or Boromir Ring-Bearer, perhaps in this next expansion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918697","commentId":918697,"userName":"Rain King","timestamp":1385652583,"content":"I know all the saga expansions have included just 3 quests up to now, but why couldn't they make it 4? There is a lot of ground to cover and if they cram too many different scenes into each quest it may be too hard to fully capture the feel of each part of the journey.\n\nI can't imagine another ring bearer character other than Sam. Even if it was brief, he's the only other one who actually had the Ring in his possession. Am I imagining it or did the appendices say that he was allowed to cross the sea many years after Frodo and Bilbo because of his status as a former ring bearer?\n\nEdited November 28, 2013 by Rain King"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918700","commentId":918700,"userName":"richsabre","timestamp":1385652644,"content":"> What about seeing a different Ring-Bearer?\n> \n>  \n> \n> My guess is for an Aragorn or Boromir Ring-Bearer, perhaps in this next expansion\n\n \n\nthis would be completely against the book though...who bears the ring and when is an important aspect and one ffg should stay true to. only bilbo, frodo, sam and gollum should be able to bear the ring.\n\nEdited November 28, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918712","commentId":918712,"userName":"Narsil0420","timestamp":1385654791,"content":"Well, they obviously left space for there to be non-cannonical ring bearers since the Ring card and the encounter cards interact with the \"Ring Bearer\" and not Frodo. To me that implies that we will have the ability to create an alternate universe type of experience and see what it would have been like if someone else carried the ring. I think this would be fun and interesting!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918720","commentId":918720,"userName":"richsabre","timestamp":1385655681,"content":"this i think would be fine in the normal packs- but i have always seen saga as the real true to story packs...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918748","commentId":918748,"userName":"GrandSpleen","timestamp":1385658484,"content":">  \n> \n>  \n> \n> this would be completely against the book though...who bears the ring and when is an important aspect and one ffg should stay true to. only bilbo, frodo, sam and gollum should be able to bear the ring.\n> \n>  \n\n \n\nIt's completely against the book for Fatty to leave the Shire with Frodo and company... and to get his head lopped off by Ringwraiths at Weathertop.  But darn it if that doesn't happen to me every time..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918783","commentId":918783,"userName":"Karlson","timestamp":1385662452,"content":"I highly doubt that FFG will change up the ringbearer from Frodo to Aragorn at any time; that would go against the very backbone of the story.  When the last saga expansion comes out, though, Sam will definitely be the ringbearer for a quest or two.\n\n \n\nAs for the game following the movies a bit more closely than the book, I agree and disagree.  The fact that they cut out the Old Forest and Tom Bombadill completely from the Black Riders expansion came as a pretty big disappointment to me because that is a large part of Book 1 of the Fellowship.  \n\n \n\nTherefore, I do believe that this next saga pack will end with the ambush at Amon Hen.  And personally, I would love to have a final version of Boromir as a hero (since he is my favorite LotR character) but I am worried it won't happen since there's already two versions of him out (and only one of Legolas and Gimli to date.)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918818","commentId":918818,"userName":"richsabre","timestamp":1385665963,"content":">  \n> \n> >  \n> > \n> >  \n> > \n> > this would be completely against the book though...who bears the ring and when is an important aspect and one ffg should stay true to. only bilbo, frodo, sam and gollum should be able to bear the ring.\n> > \n> >  \n> \n>  \n> \n> It's completely against the book for Fatty to leave the Shire with Frodo and company... and to get his head lopped off by Ringwraiths at Weathertop.  But darn it if that doesn't happen to me every time...\n> \n>  \n\ni know the whole thing of breaking the lore has been discussed since the game came out, but this is much different. we are talking of 1. a saga system that actually is designed to follow the story (otherwise why have them?) and 2. one of the most major aspects of the storyline....the thing that actually holds lotr together is that the little people are the only ones who have the power to resist the ring. if we have the boromir take the ring, then that has gone against who boromir is, and was. if aragorn takes the ring, that likewise goes agaisnt who he is, only in the opposite way. one didnt have the willpower to resist and failed, the other overcame it.\n\n \n\ni am happy to take eagles into moria, have fatty kill the witch king, but i would be dissapointed if anyone but a ringbearer could bear the ring\n\nrich\n\nEdited November 28, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918899","commentId":918899,"userName":"leptokurt","timestamp":1385677287,"content":"So Sauron doesn't count as potential ring bearer?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918917","commentId":918917,"userName":"richsabre","timestamp":1385678696,"content":"yes, but i doubt we would ever see a sauron ring bearer....wouldnt that be game over? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=918980","commentId":918980,"userName":"Cunir","timestamp":1385684166,"content":"> Well, they obviously left space for there to be non-cannonical ring bearers since the Ring card and the encounter cards interact with the \"Ring Bearer\" and not Frodo. To me that implies that we will have the ability to create an alternate universe type of experience and see what it would have been like if someone else carried the ring. I think this would be fun and interesting!\n\nHow great would it have been if they thought ahead, and did the hobbit saga boxes with bilbo in the ringbearer sphere. We would now have a couple of bilbos to take on the lord of the rings quests (a nice little alternative history) and we would also have a few more ringbearer player cards to use. And we might even have been allowed to take the treasures along which we won (frodo took sting along with him... So it would have been perfect — we could have won it in the hobbit box with bilbo, and passed it on to frodo to use in the lord of the rings boxes)\n\n------—\n\nI dont mind if we go back to moria. Its such a big part of the book i dont see how they can leave it out. It should be pretty good because theyve already had a \"dry run\" at it. They might use that new \"time\" element again. maybe we will be running through the mines with goblins building up and up, fighting our way through them, and all the time the balrog is chasing us, with the time ticking down, and we have to make it across the bridge — the final location card — before the time ticks down to nothing\n\nGandalf will be an objective card, and if we lose him along the way, we lose the quest.\n\nI dont think they will make us fight the balrog. All we will need to do is keep the gandalf objective card alive until we make it across the bridge\n\nIf we manage to explore balins tomb along the way, maybe that will give us a boon\n\nEdited November 29, 2013 by Cunir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94184-the-road-darkens/?do=findComment&comment=919099","commentId":919099,"userName":"Bullroarer Took","timestamp":1385706136,"content":"Let's not get distracted by the \"If they had only thought ahead\" stuff. They didn't have the licenses at the time and were trying to capitalize as much as possible. Sure, it would have been great if they had known and could have planned it all out from the beginning, but that window is closed."}]}