{"url":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/","title":"escape from dol guldur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/?do=findComment&comment=917918","commentId":917918,"userName":"Cuendillar2","timestamp":1385573075,"content":"I have a question regarding this quest. The First quest card tells is to: search the encounter deck for 3 objective cards. Place them in the staging area and attach 1 encounter card to each of them.\n\nQuestion are:\n\na) do you resolve the when revealed text?\n\nb) do the encounter cards threat add up to the threat in the staging area?\n\nc) how do you claim an objective card? What happens with the attached encounter card?\n\nNext 1 hero is taken prisoner.\n\nDo you still count its threat?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/?do=findComment&comment=918039","commentId":918039,"userName":"alogos","timestamp":1385581499,"content":"a) yes, it's written on the rulebook under the guarded keywords\n\nb) yes, they work like any other cards\n\nc) it's written on the card, you can't claim the cards if it is still attached\n\nd) yes\n\n \n\nThis is one of the hardest quest solo.\n\n \n\nPrecision for c) the objective becomes free when you explore the location attached (or leave play) / kill the enemy  (or leave play) / or just resolve the treachery."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/?do=findComment&comment=918064","commentId":918064,"userName":"Cuendillar2","timestamp":1385583365,"content":"Thank you for your awnser.\n\nWe played it right then. Thank you for confirming.\n\nAnother question came up when paying the scenario.\n\nA) what happens with the objective card when the hero which claimed the objective dies?\n\nB) in case a player lost all his hero's (when there are still allies I supose the player isnt finished yet? Sorry I gues this is written in the rulebook but doesnt have it right now), he is finished and not in play any more. Does this mean he is totally out of play, his cards? Or can his friend still bring him back or use cards from his discardpile, deck with e.g. stand and fight and fortune or fate? Even some rounds further?\n\nC) What happens, with the creatures engaged with a player when that player is finished? Do they return to the staging area?\n\nD) After ngaging enemies from the staging area and before defending we use Rain of Arrows ( 1 damage to each enemy engaged with player, tab range character). We used Legolas as ranged character for this. 2 enemies died because of the Rain of Arrows, does Legolas character text count ( after participates in an attack that destroys an enemy place 2 progress tokenson current quest)? And if so 2 or 4 tokens since 2 enemies died?\n\nEdited November 27, 2013 by Cuendillar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/?do=findComment&comment=918553","commentId":918553,"userName":"scottindeed","timestamp":1385634989,"content":"A)  Return the objective card to the staging area\n\nB)  The player is out of the game and can no longer be interacted with.\n\nC)  Yes the enemies return to the staging area.\n\nD)  No, you do not trigger Legolas' response, which specifies when he participates in an Attack.  This is not an Attack, you are just exhausting Legolas to trigger the effect of an event card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/?do=findComment&comment=918574","commentId":918574,"userName":"Cuendillar2","timestamp":1385638021,"content":"Thank You for tour awnsers. This helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/?do=findComment&comment=918610","commentId":918610,"userName":"alogos","timestamp":1385643504,"content":"For A) I don't see why you should put the objectives in the staging area. It is attached and so is considered an attachment. If the characters it is attached to is discarded, then so is the attached cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94195-escape-from-dol-guldur/?do=findComment&comment=918743","commentId":918743,"userName":"scottindeed","timestamp":1385658106,"content":"You might be right there, now I think about it its a little unclear what happens."}]}