{"url":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/","title":"Miruvor discarded to?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=918565","commentId":918565,"userName":"Mndela","timestamp":1385636890,"content":"It reads:\n\nAttach to a hero.\nAction: Discard Miruvor to (choose two): ready attached hero, add 1 resource to attached hero's resource pool, attached hero gets +1 [Willpower] until the end of the round, or put Miruvor on the top of your deck.\n \n\nffg_miruvor-saf.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_miruvor-saf.jpg]\n\n \n\nIf you attach to a hero of another player, and the other player chose \"put Miruvor on the top of your deck\". Where is it going to? To my deck or to the deck of the player that controls attached hero?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=918569","commentId":918569,"userName":"scottindeed","timestamp":1385637271,"content":"When you play an attachment on another player's hero, that player then controls that attachment, so when it says \"your deck\" it should be the deck of the player that controls the hero.  I can imagine that's not always beneficial as they won't necessarily have Spirit resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1462662","commentId":1462662,"userName":"krokodiler","timestamp":1424786355,"content":"I've just asked myself the same question...\n\n \n\nIn the rules, under \"Control & Ownership\" (p. 25) there is written:\n\nA player “owns” his heroes and the cards that he has\nchosen for the player deck he is playing. A player\n“controls” all cards that he owns, unless another player\nor the encounter deck takes control of the card through\na game effect. Any time a card leaves play, it reverts to\nits owner’s hand, deck, or discard pile (as directed by\nthe effect forcing the card out of play). (emphasis mine)\n\n \n\nWhen you play Miruvor on another player's hero, that player takes control of it, but you are still the owner of it. So, when it is discarded, it should go to your (=the owner's) discard pile, shouldn't it? What do you think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1462675","commentId":1462675,"userName":"jormungandr","timestamp":1424787457,"content":"that is correct. When miruvor is discarded, it leaves play. ownership of the card doesn't change"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1467636","commentId":1467636,"userName":"JanB","timestamp":1425043978,"content":"and when it is not discarded .. instead placed on top of your deck .. whose deck is meant? The owners deck or the controllers deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1467780","commentId":1467780,"userName":"alogos","timestamp":1425050606,"content":"Controller's deck, as \"your\" refere to the controller, and it is golden rulling the ownership rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1469103","commentId":1469103,"userName":"krokodiler","timestamp":1425120356,"content":"I'm still not convinced with this Miruvor when it is attached to another player's hero. I think it goes as intended and smooth when you play Miruvor on your own hero. You can then pick two of four given options. But when you play it on another player's hero, maybe that player has only three options after discarding Miruvor, from which he picks two? Or, he can still pick that fourth option when it would be useful in play (with permission from owner of Miruvor) and then that owner puts it on top of his deck?\n\n \n\nWhen Miruvor is discarded, it is put on its owner's discard pile. If I am not the owner, I think it would not be possible to take it from another player's discard and put it on top of my deck. Moreover, the player who played it had resources to do it and I don't have to have Spirit hero to play it from my hand after drawing. If Miruvor is intended to circulate among players, maybe it should be simply neutral?\n\nEdited February 28, 2015 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1469152","commentId":1469152,"userName":"alogos","timestamp":1425127638,"content":"Well, it gives you the option, but if you don't have anyway to play it back, putting it on top of your deck is kind of dumb. But that's a problem with you, not with the card... Joking, I agree it's strange, but we were curious and we had an answer from Caleb, I think it is a \"we didn't plan it but it's cool\" design."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1469371","commentId":1469371,"userName":"-Istaril","timestamp":1425146070,"content":"> Controller's deck, as \"your\" refere to the controller, and it is golden rulling the ownership rules.\n\n \n\n \n\nIn the case of all of FFG's other LCG games, cards leaving play, as in the quote offered up by n Krokodiler,  go to their owner's out of play area. You're correct, 'your' refers to the controller, but this destination change overwrites that. Wording in later LCGs has made that clearer (that it's not an exception to the golden rule), but it's been consistently ruled as such in every other LCG I've played. In the case of Miruvor, the controller would be able to choose any 2 of the 4 options, and if he chooses the 'top of your deck' it'll go to the top of the owner's deck, not the controller's.\n\n \n\nI would be quite surprised if Caleb or Matt ruled otherwise. If they did, I'd love to see the specific wording.\n\nEdited February 28, 2015 by -Istaril"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1469551","commentId":1469551,"userName":"ricedwlit","timestamp":1425156964,"content":"Alogos is correct, and if fact this question was already asked of Caleb (full thread [http://boardgamegeek.com/thread/841502/miruvor-top-which-deck-now-official-reply]: link to reply [http://boardgamegeek.com/article/9823517#9823517] shown below)\n\n \n\nOFFICIAL REPLY:\n \n\nI wrote:\nThe card Miruvor is an attachment that is played on a hero. I can play it on another player's hero and that player then controls (but doesn't own) the card.\n\nWhen that player triggers the \"Action:\" on the card he may select 2 of the listed effects. One of the effects that can be selected reads:\n\"put Miruvor on the top of your deck\"\n\nMy question is, does that player then:\na) indeed put it on the top of his deck (the controller)\nb) put it on the top of my deck (the owner)\n\n\nA support for option b) is that the rules (p.25) talk about control and ownership and says that \"when a card leaves play, it reverts to its owner's hand, deck or discard pile\".\n\nA support for option a) is that this is covered by the golden rule and the card clearly tells the person activating the card to put it on the top of his deck which contradicts the rulebook.\n\n \n\nCaleb wrote:\nHi Daniel,\nWhen resolving Miruvor's ability, the Golden Rule will supersede the Ownership rule. For example, if Player A attaches Miruvor to Player B's hero and Player B chooses the option \"put Miruvor on the top of your deck\" then Player B player will put Miruvor on top of his deck.\nRegards,\nCaleb\n\n\nThanks Caleb!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1469613","commentId":1469613,"userName":"-Istaril","timestamp":1425160420,"content":"Thanks, ricedwlit!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1470242","commentId":1470242,"userName":"alogos","timestamp":1425214732,"content":"> I would be quite surprised if Caleb or Matt ruled otherwise. If they did, I'd love to see the specific wording.\n> \n>  \n\n \n\n> [...]\n> \n> I would be quite surprised if Caleb or Matt ruled otherwise. If they did, I'd love to see the specific wording.\n> \n>  \n\n \n\n \n\n> [...] and we had an answer from Caleb[...]\n\n \n\nYeah... let's just ask Caleb for the hundredth time.\n\n \n\nI should make this [https://docs.google.com/document/d/18_pYjnXi27r1P886cMHGmb7ZX-tuWeTLe7bGIVP-vs4/edit?usp=sharing]my signature."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1470534","commentId":1470534,"userName":"-Istaril","timestamp":1425230843,"content":"I hadn't yet seen that link, alogos. I appreciate it, and will look through it and get up to speed. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1470631","commentId":1470631,"userName":"GrandSpleen","timestamp":1425235277,"content":"Incidentally, a search for \"Miruvor\" in that document yields no results."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94247-miruvor-discarded-to/?do=findComment&comment=1470996","commentId":1470996,"userName":"alogos","timestamp":1425253156,"content":"That's stange, might be hiding in related question... ****, didn't made an update this week either... (the pdf version, and the French version I mean) ><.\n\n \n\nEDIT: found and added.\n\nEdited March 1, 2015 by alogos"}]}