{"url":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/","title":"Your opinion on leadership allies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919453","commentId":919453,"userName":"EclatK","timestamp":1385752865,"content":"Hello everyone,\n\n \n\nI've seen in many post a kind of hatred against leadership allies. I totaly agree with that!! They generaly are costly and with bad or counterproducive capacity. They are usualy not good in any stat, making them average and not very usefull.\n\nI'd like to knwo what it the best and the worst leadership ally for you and why?\n\n \n\nPersonnaly, I realy like the errand rider which really help stabilize multiple spheres deck.\n\nIt's cost is low and he gets 2Hp.\n\n \n\nThe worst one for me is Longbeard Elder. His ability is realy crap (I play only in multiplayer)\n\nand he is costly. I know it is not the worst one, but I was really disappointed when it cames out.\n\n \n\nEclatk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919487","commentId":919487,"userName":"Karlson","timestamp":1385756839,"content":"I would have to disagree.  I think the Leadership sphere has some really amazing allies, in particular for Dwarves and Gondor.  Longbeard Elder is also one of my favorite Leadership Dwarven allies; his scrying ability is extremely useful.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919502","commentId":919502,"userName":"danpoage","timestamp":1385758004,"content":"Faramir is one of the best allies in the game. With his 2 defense and 3 hit points, he even helps as a defender if you aren't using his incredibly powerful ability. I definitely feel that some Leadership allies are disappointing - Denethor in particular comes to mind, but overall it has some great allies. Errand-Rider and now Squire of the Citadel are two cheap and useful allies. The Errand-Rider is a must in multi-sphere decks and helps facilitate all of the Gondor-related effects that depend on resources being in a particular hero's resource pool. The Squire is a great combo with Prince Imrahil, and serves as a good chump blocker in the early game while you are getting your allies setup. For dwarves, both Gloin and Fili are both great for their cost, particularly with Dain or Thorin in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919522","commentId":919522,"userName":"richsabre","timestamp":1385760221,"content":"i think leadership has a lot of good allies....not better than any other sphere, as i dont think any particularly stands out in allies. as for best and worst i would say the best would have to be faramir, though there are some great synergies lined up in recent packs...i also think that bill the pony is a great ally in a hobbit deck, and is worth putting in for that amazing depiction.\n\n \n\nalso, the might cannon fodder of snowbourn scout has to be one of my most used allies in the game\n\n \n\nas for worst, i would have to say that guard of the citadel has to be the weakest. dunedain wanderer is also to costly if you dont have secrecy\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919575","commentId":919575,"userName":"Raven1015","timestamp":1385765345,"content":"Longbeard Elder is one of my favorites. Leaving aside his ability, which has its uses, he has good stats, and with Dain in play, his 3 willpower is killer.\n\nHere's some food for the discussion: http://talesfromthecards.wordpress.com/2013/07/30/sphere-analysis-of-lotr-lcg/. [http://talesfromthecards.wordpress.com/2013/07/30/sphere-analysis-of-lotr-lcg/.] I need to update it for newest packs, but... Leadership allies are definitely the costliest, but this is the resource generation sphere anyway, and the allies are pretty well-balanced overall."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919590","commentId":919590,"userName":"leptokurt","timestamp":1385766802,"content":">  \n> \n> also, the might cannon fodder of snowbourn scout has to be one of my most used allies in the game\n> \n>  \n\n \n\nThis. They're not as shiny as they once were, but they're still welcome to most of my decks.\n\n \n\nWorst ally: Keen-eyed Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919616","commentId":919616,"userName":"Ellareth","timestamp":1385769286,"content":"I think the negatively around Leadership allies were targeted at some of the allies introduced in the Against the Shadow Cycle.\n\nIt's not that they are terribly useless, but we just expected something flashier and better.\n\n \n\nDenethor, while being a capable card on its own, certainly disappointed fans of Denethor as we were expecting Denethor to be a deck changer in Gondor Cycle (or atleast I did).\n\nOther 1 cost allies that were introduced were keep being compared to Errand Rider that came out during Delux Expansion.\n\n \n\nAlso, Leadership has some allies that are only normal to good in specific situation and down right crappy in others.\n\nThe 5 costs Dunedain ally and Gondor ally can be good in certain situation (secrecy, having lot of Gondor allies), and can be comboed with A Very Good Tale for some excellent result. But if you have to pay the full cost it certainly is not worth playing.\n\n \n\nBut there are lot of good leadership allies as well; Faramir has always been solid choice and still is, Errand Rider is great for smoothing out trisphere decks, Gloin and Kili are excellent for Dwarf decks, Snowbourn Scout our favourite cannon fodder, etc.\n\n \n\n \n\nFor me, the best leadership ally would be Dunedain Watcher. I know she certainly is not the best interms of power level, and her artwork was controvertial when it came out, but 3 cost for ally that can quest for 1 and cancel shadow if need be was very awsome during Mirkwood Cycle.\n\n \n\nThe worst leadership ally would be Denethor for me. He isn't worst in terms of power level and certainly can be great in some decks, but I just expected more from a name like Denetehor then your average joe without fancy ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919635","commentId":919635,"userName":"camacazio","timestamp":1385771584,"content":"I gotta ask, what was Denethor doing in the books that makes everybody wish he did more? All I remember is that he sent his sons to their deaths, and he became crazier and crazier until he committed suicide. PERFECT ally card for Denethor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919640","commentId":919640,"userName":"Karlson","timestamp":1385772096,"content":"Agreed. I thought they hit the nail on the head with the Denethor ally card. He loses more and more hope (willpower) as heroes around him are damaged, and in the end it ultimately results in his own self destruction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919731","commentId":919731,"userName":"danpoage","timestamp":1385791885,"content":"> I gotta ask, what was Denethor doing in the books that makes everybody wish he did more? All I remember is that he sent his sons to their deaths, and he became crazier and crazier until he committed suicide. PERFECT ally card for Denethor.\n\n\n\nI agree, Denethor is perfect, thematically speaking. I was just hoping for a pre-crazy version of Denethor. You know, back when he was actually a leader to be reckoned with. The fact that he had a sword still strapped to his side, right before he burned himself (and almost his youngest son) alive, shows a glimmer of the pride of a once great man. I would love to see an ally based on that Denethor, before Boromir's death and the corrupting influence of Sauron pushed him over the edge.\n\nEdited November 30, 2013 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919738","commentId":919738,"userName":"Ellareth","timestamp":1385794174,"content":"> I gotta ask, what was Denethor doing in the books that makes everybody wish he did more? All I remember is that he sent his sons to their deaths, and he became crazier and crazier until he committed suicide. PERFECT ally card for Denethor.\n\n \n\n \n\nThis is totally out of topic of this thread, but I cannot help myself but answer this.\n\n \n\nFirstly, he took back Osgiliath during his youth and established it as the main defence.\n\n \n\nHe fortified the defence against Mordor and when Sauron attacked Osgiliath to slip in Nazguls, he found Gondor's readiness mroe than he had hoped for.\n\n \n\nDenethor has mental strength greater than anyone in Sauron's service. His will power is greater than that of any Black Numenoreans, Nazguls, or other foul beings. In fact Denethor has used Palantir much better to his advantage than Saruman.\n\n \n\nHe still wears armour to prevent his body from becoming old and useless.\n\n \n\nDuring siege of Minas Tirith, Gandalf suggests that one thing enemy lacked was calvary and urged Denethor to prepare calvary charge, which Denethor had already done so, so his military strategy was atleast as good as or better than Gandalf. He most certainly did not ask everyone to abandon their posts and die.\n\n \n\nWhen Aragorn lied about his true self and worked under Lord Ecthelion under false name of Throngil, Denethor very much guessed correctly of Aragorn's origin and his intent.\n\n \n\nDenethor thought of himself as a divine leader sent by the Gods during Gondor's time of trial, and Tolkien mentions that Denethor was one of the greatest ruling steward that Gondor has seen.\n\n \n\n \n\nIt is true that Denethor had his flaws (pretty big ones) and he did let the madness overtake him by the end, but even Gandalf admits that blood of Numenor ran unusually strong with him. \n\nHe only gave up hope after decades of mental battles against Sauron, death of his beloved wife, death of his eldest son (let me emphasize that Denethor did not sent Boromir to take the Ring, Boromir went only because of prophetic dreams he and Faramir had), his city currently being under siege and confirmation of enemy reinforcements (although I do admit this was false vision by Sauron and ally reinforcements were actually in those ships), and what seemed like inevitable death of his youngest son.\n\n \n\nDenethor did ultimately fail in the end, but he is not some tomato-stuffing, suicide-ordering, Ring-seeking, strategically-impotent fool clinging to what little power he had left. Did I mention dispite him suspecting Aragorn riding with Rohirrims he lighted the beacons and sent out half a dozen riders to ensure Theoden's reinforcement?\n\n \n\nHe was the greatest ruling steward of Gondor who kept Sauron's forces at bay with his briliant strategies, posessor of mental strength greater than any of dark force save Sauron himself, and one who only wanted what is rightfully his (not what he think should be his, but what is lawfully his).\n\n \n\n4 Cost Leadership ally with 3 willpower and a Gondor trait is definitely fair,\n\nbut is that really fitting card for the character that is Denethor, one of the last pure-blooded Numenorean of Southern Kingdom?\n\n \n\nEdit: deleted remarks about Aragorn as it is highly controvertial matter (I'm pretty sure my opinion is minority regarding this) and had little to do with Denethor.\n\nEdited November 30, 2013 by Ellareth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919747","commentId":919747,"userName":"Nickpes","timestamp":1385796609,"content":"Happy Ellareth answered and thus saved me from writing the same stuff. \n\n \n\nDenethor was a great leader and started to fade gradually after his wife died. Still he was much better it the books than he is depicted in the movies"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919757","commentId":919757,"userName":"lleimmoen","timestamp":1385798378,"content":"The Gondor Leadership ally deck is among my favourite. It can sprout wings very quickly. And all the weak guys can suddenly become strong enough with Boromir's Visionary Leadership. Faramir and For Gondor can further strengthen the party. The only problem usually lies in direct damage coming from the encounter deck, archery might be a problem but the heroes can usually take it - as they won't do much defending, but effects like Blocking Wargs (or indeed the one from the Troll scenario in Over Hill and Under Hill - can't remember the name) can be deadly.\n\n \n\nOn the other hand, allies like Brok or Silverlode Archer from the core set aren't very strong, and might fall into the category of cards that will hardly ever see much play in the future. I was also glad to finally replace Guard of the Citadel in my Gondor deck (with the new Pelargir Ship Captain). And finally, I will probably always prefer the hero Denethor to the ally version."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919760","commentId":919760,"userName":"lleimmoen","timestamp":1385798600,"content":"Ellareth, I totally agree with you about Denethor. He is my favourite from the books also, and I too wish we will get at least one more version of him. I find the hero one very thematic, and strong, but the art is a bit \"so-so\".\n\n \n\nI often see that the characters that do not appear on too many pages in the books get little credit. This is really not how Tolkien wrote, often the most important characters (not for the story but for the universe) got fewer lines in the text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919765","commentId":919765,"userName":"Nickpes","timestamp":1385799528,"content":"lleimmoen is write ... a very important character IMO is Gildor, he only got a couple of pages but his conversation with Frodo has a deep meaning (offtopic I know)\n\nEdited November 30, 2013 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919830","commentId":919830,"userName":"lleimmoen","timestamp":1385814052,"content":"> lleimmoen is write ... a very important character IMO is Gildor, he only got a couple of pages but his conversation with Frodo has a deep meaning (offtopic I know)\n\nGildor Inglorion is an excellent example, the meeting is a wonderful reading. But it follows, Bombadil, Glorfindel, even Elrond - he's got a chapter but not much more than that, and perhaps the best example is the Lord of the Rings himself, Sauron."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=919837","commentId":919837,"userName":"Mndela","timestamp":1385815668,"content":"My history in this game:\n\n1. First months i played spirit deck. The idea was: when you quest the quest card fastier, you dont have to explore so much locations or kill so much enemies. If you quest points earlier, then no so much cards revealed from encounter deck, of course. But i need good tactics players, and not always it was.\n\n2. After, i began to play my favourite sphere: lore. Good way to manipulate locations, and other things. But the same problem, you need good fighter friends, and not always it was.\n\n3. And last: i decided to get myselve the weapons. And i began to use tactic heroes.\n\n4. I think the next step is use leadership decks. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nSo at them moment i dont know how usefull are leadership allies.\n\n \n\nPD: i used leadership heroes, of course, and cards as Stewards, Sneak Attack, Errand Riders...., but i haven't play seriously leadership. I want to do it, but when i could play with 2 or 3 friends more. Leadership is the most interactive sphere. Sure it will be usefull with 3 or 4 players, but not alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94321-your-opinion-on-leadership-allies/?do=findComment&comment=920362","commentId":920362,"userName":"Sprenger","timestamp":1385906097,"content":"Out of the 21 allies in the Leadership sphere I think they have 8 really good allies in my opinion. \n\nSquire of the Citadel - Great meat bag that gives you back the resource\nLongbeard Elder - Questing \nFaramir - Will Power Buff\nErrand-rider - Resource manipulation\nErestor - Card Cycle\nDenethor - Quest Power\nCitadel Custodian - Can be free\nBill the Pony - Should be free and +1 hp to Hobbits"}]}