{"url":"https://community.fantasyflightgames.com/topic/94394-black-riders-permanent-keyword/","title":"Black Riders - permanent keyword","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94394-black-riders-permanent-keyword/?do=findComment&comment=920280","commentId":920280,"userName":"Nerdmeister","timestamp":1385894477,"content":"Rules Insert p. 4:\n\n\"If a hero is in a player´s discard pile at the end of the game, that hero´s name is added to the list of Fallen Heroes in the Campaign Log.\"\n\n \n\nRules Insert p. 5:\n\n\"If a hero is added to the list of fallen heroes, then all boons and burdens with the permanent keyword attached to that hero are removed from the campaign pool.\"\n\n \n\nRules Insert p. 6:\n\n\"If a hero leaves play, attachments with the permanent keyword attached to that hero are removed from the game.\"\n\n \n\nI have only just recently aquired Black Riders and I don´t know if this has already been discussed or if there is a consensus on the matter but the rules insert contradicts itself in this instance.\n\nSince heroes can be brought back by a few different card effect after having left play it seems quite an important matter, which of the two definitions to use.\n\nIf using the definition \"a hero leaves play\" then you could remove a burden from the campaign pool by using a different hero in the next scenario (granted you still take the +1 threat penalty every time you do it) or just outright letting him die then bring him back.\n\nIn terms of theme and design-intent, I´m leaning more towards the \"if a hero is added to the list of fallen heroes\"-definition and I think I shall be playing it like that unless I get a satisfactory explanation why I shouldn´t (or it´s officially ruled otherwise).\n\nBut I must admit it rubs me the wrong way when I see these two contradictory definitions lined up next to each other.\n\n \n\nTo sum up the rant: has this already been debated and if so, what was the outcome?\n\nEdited December 1, 2013 by Nerdmeister"}]}