{"url":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/","title":"Choose Your Own Adventure","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/?do=findComment&comment=920663","commentId":920663,"userName":"Boris_the_Dwarf","timestamp":1385942524,"content":"Tired of the encounter packs having a single use and then being irrelevant after completion of a cycle, I've started tinkering with custom quests that mix and match encounter packs in original ways. My first quest I have put together has the players hunting through Mirkwood for a band of hill trolls that are harassing a nearby town. It uses two copies of the Journey Down the Anduin pack (the paw symbol) and 1 each of the tree symbol and the spider symbol pack from the core set. More details to come."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/?do=findComment&comment=920671","commentId":920671,"userName":"Gizlivadi","timestamp":1385944083,"content":"I've thought and posted about the possibility of having quests with alternate endings/stages, but not randomized as in FoS, but more like Choose your own adventure books in which you can choose which path you wish to go, with different stages and results each, one, for example, being a battle stage, or a questy stage, or a siege, etc. I think this would greatly help solve the accessibility of new quests in that different types of decks (for example, a mono Spirit or a mono Tactics) can have a fair chance against it. Mixing encounter sets in original ways is an interesting idea, but the format you propose with two encounter sets of the same symbol would require having two of the product in which it comes, so I don't really see it as more than a homebrew solution, which is fair in it's own right.\n\n \n\nJourney Down the Anduin is not the paw symbol btw, it's the river symbol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/?do=findComment&comment=920723","commentId":920723,"userName":"shoreless","timestamp":1385950932,"content":"This is a very interesting idea! I'll keep on this for future updates."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/?do=findComment&comment=932323","commentId":932323,"userName":"xbluejayx","timestamp":1387236339,"content":"I like this idea too. Keep me posted as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/?do=findComment&comment=932395","commentId":932395,"userName":"Boris_the_Dwarf","timestamp":1387244820,"content":"This is what I have come up with. Using the paw symbol set, the spider set, and the tree set.\n\nStage 1. Setup: Remove the 2 forest gates from the encounter deck. Put 1 in the staging area and set the other aside out of play. Reveal 1 encounter card per player and add them to the staging area, then immediately travel to 1 eligible location. Locations are immune to player card effects. 17 progress is needed to complete.\n\n------------------------\n\nStage 2. Forced: Reveal cards from the encounter deck until you reveal a spider and one other enemy card. Put those cards in the staging area and discard the rest. Return all enemies in play to the staging area.\n\nAction: At the end of the quest phase, a player may discard two cards to engage an enemy in the staging area.\n\nSkip the encounter step, then deal 1 damage to each enemy in the staging area. When there are no enemies in play, advance to stage 3. Locations are immune to player card effects. 22 progress is needed to complete.\n\n-------------------------------------\n\nStage 3: Add the removed Forest Gate to the staging area and shuffle all locations from the discard pile into the encounter deck.. Locations are immune to card effects. Players cannot travel to Forest Gate locations while another location is in play, and cannot defeat this stage while a Forest Gate location remains in play. 8 progress is needed to complete.\n\nWhen this stage is completed, the players win the game.\n\nEdited December 17, 2013 by Boris_the_Dwarf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/?do=findComment&comment=932418","commentId":932418,"userName":"Boris_the_Dwarf","timestamp":1387248655,"content":"Here's the next one I'm working on. The storyline idea behind these quests are linked. The heroes are hunting Orcs with information about the White Wizard's plans. The second quest has them on the scent of a Goblin Chieftain near Dol Guldur. It uses the Orc symbol set from the core set, the set with First Hall and the Bridge from Khazad Dum, and the goblin set from over hill and under hill (it has goblin caves and goblin runners in it).\n\nStage 1a setup: Remove Chieftain Uthak, First Hall, bridge of Khazad Dum, and East Gate from the encounter deck. Set them aside out of play.\n\nStage 1b Forced: When a cave location is revealed from the encounter deck, put it on the bottom of the encounter deck and replace it with the next card from the top of the encounter deck. 10 progress is needed to complete.\n\nStage 2a When Revealed: Search the encounter deck and discard pile for a patrol leader if one isn't in play and add it to the staging area. Then search the encounter deck and discard pile and staging area for a Cave location and make it the active location, discarding any other active locations from play. Shuffle all other Goblins in the discard pile back into the encounter deck and then reveal 2 encounter cards per player.\n\nStage 2b Forced: Add a progress token to the quest when a goblin enemy is defeated. 14 progress is needed to complete.\n\nStage 3a When Revealed: Add Chieftain Uthtak to the staging area.\n\nStage 3b When Revealed: Put 1 resource token on Chieftain Uthtak for each goblin card in the encounter discard pile. When Uthtak is assigned damage, if a Goblin is in play, cancel the damage and discard the Goblin with the lowest threat in play. When Uthtak is defeated, the players win the game. No progress is placed on this stage.\n\nEdited December 18, 2013 by Boris_the_Dwarf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94428-choose-your-own-adventure/?do=findComment&comment=933116","commentId":933116,"userName":"Teamjimby","timestamp":1387320332,"content":"If you're looking for user created quests, there are a whole bunch on BGG.  This link alone has 6 of them:\n\nhttp://www.boardgamegeek.com/filepage/66659/ninjadorgs-lotr-lcg-scenarios [http://www.boardgamegeek.com/filepage/66659/ninjadorgs-lotr-lcg-scenarios]"}]}