{"url":"https://community.fantasyflightgames.com/topic/94448-a-nice-pickle-we-must-away/","title":"A Nice Pickle (We Must Away)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94448-a-nice-pickle-we-must-away/?do=findComment&comment=920829","commentId":920829,"userName":"GrandSpleen","timestamp":1385964096,"content":"Hey all,\n\n \n\nWhenever I play this quest, we always defeat the trolls before the encounter deck runs out.  Today we won via the other method -- depleting the encounter deck.  But I hit a question.\n\n \n\n1) If the encounter deck runs out in the middle of staging, before you have revealed all cards, do you reshuffle it, or immediately end the game?  My thought is you have to reshuffle because:\n\n \n\nForced: If there are no Troll enemies left in play, or if there are no cards left in the encounter deck, advance it to the next stage. Any time players would place progress tokens on this quest, discard an equal number of cards from the encounter deck instead. (Progress is placed on the active location before triggering this effect.)\n\n \n\nThe text in the parenthetical suggests that you won't trigger any part of the Forced effect (including advancement) until you have finished putting progress tokens on the active location.\n\n \n\nAlso, another question:\n\n \n\n2) A Nice Pickle was the last card in the deck for us.  A Nice Pickle reads:\n\n \n\nDoomed 1.     \nWhen Revealed: Place the top X cards of the encounter discard pile on the bottom of the encounter deck. X is equal to twice the number of players in the game. \n\n \n\nDo you resolve the card before you would reshuffle the encounter deck? (if you would even reshuffle the deck in this circumstance)  Or if not reshuffling-- do you resolve the card before you would advance to the next stage of the quest and end the game?  I guess that you would based on my thoughts above on #1... and anyway, you have to resolve the treachery card before doing any else right?  Otherwise, no treachery card will have an effect if it is the last card in the deck for this quest.\n\n \n\nThanks for any thoughts.\n\nEdited December 2, 2013 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94448-a-nice-pickle-we-must-away/?do=findComment&comment=920933","commentId":920933,"userName":"alogos","timestamp":1385983500,"content":"The answer is that you should all triggered effect when a situation occures.\n\n \n\nIf you draw A Nice Pickle as the last card, then you have to shuffle the encounter deck and resolved the forced effect of the card.\n\nRules take priority of resolution over triggered effect. But that does not un-trigger the forced effect. So when you are done shuffling, you proceed to the next stage.\n\nAnd then you can resolve A Nice Pickle, proceeding with doom 1 first and then it would have no effect since there is no more cards in the discard pile.\n\nThen you can reveal the new quest 3B. This is how I would play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94448-a-nice-pickle-we-must-away/?do=findComment&comment=921133","commentId":921133,"userName":"GrandSpleen","timestamp":1386004226,"content":"That makes a lot of sense.  Everything needs to get resolved, just in the proper order.  Thanks for the answer!"}]}