{"url":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/","title":"Troll Purse and Troll Key drawn as Shadow Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=922603","commentId":922603,"userName":"scottindeed","timestamp":1386149880,"content":"Apologies if this has come up before, but I could not find an answer in my searching.\n\n \n\nIf Troll Key and Troll Purse are drawn as Shadow effects and discarded, does their discard effect trigger? (i.e. add to the staging area from the FAQ)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=922606","commentId":922606,"userName":"alogos","timestamp":1386150606,"content":"When they are discarded, they lost their status of shadow card and are treated just like any other discarded encounter card.\n\nTheir text is then triggered, as it is explicitly stated by the wording that the effect should trigger from out of play ie: being discarded.\n\n \n\nThere seems to be an official confirmation by Caleb somewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=922609","commentId":922609,"userName":"scottindeed","timestamp":1386151111,"content":"Thanks for the clarification!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=922718","commentId":922718,"userName":"zeb","timestamp":1386166396,"content":"> There seems to be an official confirmation by Caleb somewhere.\n\n \n\nhttp://boardgamegeek.com/thread/843685/troll-key-and-troll-purse [http://boardgamegeek.com/thread/843685/troll-key-and-troll-purse]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=922729","commentId":922729,"userName":"zeb","timestamp":1386167241,"content":"Notice this is in complete contradiction with this FAQ entry:\n\n> Q: What happens to Banks of the Anduin (CORE 113)\n> if it is drawn as a Shadow card?\n> A: It will be discarded from play at the end of the\n> combat phase, like other Shadow cards. When a card\n> is drawn as a Shadow card, only its Shadow text is\n> considered to be active.\n\nSo when discarded as shadow cards, they do not lose their status (otherwise Banks would be returned on top of the Encounter deck), it is just that Troll Key and Troll Purse ought to be errata'ed (except if the text, which is a passive ability, applies for Shadow cards anyway, in this case the rules should be updated for this fact)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=922831","commentId":922831,"userName":"alogos","timestamp":1386175205,"content":"It is not.\n\n \n\nBank reads \"If Banks of the Anduin leaves play\" not \"If it is discarded\".\n\n \n\nSeems the same, but for leaving play, you need to be in play first. Being discarded does not check from where.\n\nEdited December 4, 2013 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=922869","commentId":922869,"userName":"zeb","timestamp":1386177202,"content":"> It is not.\n> \n>  \n> \n> Bank reads \"If Banks of the Anduin leaves play\" not \"If it is discarded\".\n> \n>  \n> \n> Seems the same, but for leaving play, you need to be in play first. Being discarded does not check from where.\n\n \n\nI could hear that, except the FAQ entry I copied says about Banks:\n\n> A: It will be discarded from play at the end of the\n> \n> combat phase\n\n \n\nAgain, in the same FAQ, you can read page 11:\n\n \n\n> Q: If an enemy does not attack or its attack is canceled,\n> \n> what happens to its shadow card(s)?\n> \n> A: At the end of the combat phase, discard each\n> \n> unresolved shadow card in play. (Do not resolve the\n> \n> effects on these shadow cards)\n\n \n\nSounds like shadow cards are not only in play but get discarded from play. Besides is there something in the rules or the FAQ that says that shadow cards are not considered as being in play?\n\n \n\nI think an elegant solution would be to say that passive effects/abilities (those without a keyword) apply even if a card is a shadow card. But they would have to take care to see if this is compatible with the pool of cards we already have. Alternatively, these cards should have shadow effects that say they return to the staging area.\n\nEdited December 4, 2013 by zeb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=923115","commentId":923115,"userName":"alogos","timestamp":1386185752,"content":">  \n> \n>  \n> \n> I could hear that, except the FAQ entry I copied says about Banks:\n> \n>  \n> \n> \n> \n> A: It will be discarded from play at the end of the\n> \n> combat phase\n\n \n\nChanged the highlighted words.\n\n \n\nAlso, let me rephrase more specificaly my last sentence :\n\nSeems the same, but for leaving play, you need to be in play first. Being discarded does not check from where.\n\nTo :\n\nSeems the same, but for leaving play, you need to be in play first, so the text of Bank will only apply while in play. Being discarded does not check from where, so Troll's objective are golden ruling the fact that their text should be in play to trigger.\n\n \n\nI don't care if shadow cards are in play or not for this demonstration."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=923223","commentId":923223,"userName":"zeb","timestamp":1386192246,"content":"Sorry but this is a very convoluted explanation. There is nothing on the Troll card that \"golden rules\" the fact that the non-shadow text applies. Text in shadow card is ignored if not in the shadow part, and there is nothing on the Troll card that bypasses this rule.\n\n \n\nGolden rule only applies when the text contradicts the rule book, explicitely. That is why text like \"add progress tokens to current quest\" is not enough to golden rule, and tokens are placed on an active location if there is any. You need to have the text \"bypassing any active location\" to be a golden rule, as clarified in the FAQ.\n\n \n\nFor the Troll card, this would be a golden rule if the card said \"even if discarded as shadow card\".\n\nEdited December 4, 2013 by zeb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=923237","commentId":923237,"userName":"GrandSpleen","timestamp":1386192883,"content":"It looks like it's just an underdefined space in the game.  The status of discarded cards, I mean.\n\n \n\nAll card text is inactive once the card is in the discard pile-- or is it?  Immunity is inactive, we know that since Beorn can be brought back from the discard pile from Landroval and Fortune or Fate.  But  now we have an effect that can only be triggered when the card itself is in the discard pile (Hidden Cache).  \n\n \n\nAll that is for player cards, though.  Maybe it is enough to say that all cards in the discard pile are equal, i.e. they lose their \"shadow\" or \"encounter\" status once they hit the discard pile.  Don't know that these really solves the Troll Key/Purse question, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=923239","commentId":923239,"userName":"zeb","timestamp":1386193093,"content":"> Seems the same, but for leaving play, you need to be in play first, so the text of Bank will only apply while in play. Being discarded does not check from where, so Troll's objective are golden ruling the fact that their text should be in play to trigger.\n\n \n\nI may see where you are coming from. But in that case, any card in the discard pile has to be in play to have its text active. I thought that cards in the discard pile were not considered as \"in play\" and therefore did not have any active effect. Am I wrong?\n\nEdited December 4, 2013 by zeb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=923261","commentId":923261,"userName":"zeb","timestamp":1386194437,"content":"I just sent the query to Caleb, will return with his answer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=1308405","commentId":1308405,"userName":"zeb","timestamp":1414010103,"content":"I know this is an old topic, but just realised I never copied the answer Caleb sent me. For your information, this is what he wrote:\n\n \n\nMy question:\n\nThere is a bit of debate regarding the \"When X is discarded/leaves play\" effect for Encounter cards such as Banks of Anduin and Troll Key/Purse objectives. All these cards have an effect that says \"If X is discarded/leaves play, return it to...\", but no shadow effect. So if they are used as shadow cards, what happens when they are discarded at the end of combat? There seems to be a contradictory ruling, because the FAQ says that Banks are not returned to the Encounter deck, since the \"non-shadow\" text is ignored. On the other hand, it was previously ruled that the Troll Key/Purse cards were returned in play when discarded as shadow cards. So there the non-shadow text applies. Isn't that contradictory? Or am I misinterpreting something?\n\n \n\nCaleb's answer:\n\nBanks of the Anduin and Troll Key have similar but different effects:\nBanks of Anduin says to return it to the top of the encounter deck instead of discarding it \"if Banks of the Anduin leaves play\" - which means it had to be in play first. If it was dealt as a shadow card, then it was not in play and it's effect was not active.\nThe Troll Key (and Purse) only triggers after being discarded - it does not need to have been in play first. It is the act of discarding the Key & Purse that triggers their ability. It does not matter where they were discarded from.\nCheers,\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=1313431","commentId":1313431,"userName":"TimPelican","timestamp":1414440855,"content":"> Caleb's answer:\n> \n> Banks of the Anduin and Troll Key have similar but different effects:\n> \n> Banks of Anduin says to return it to the top of the encounter deck instead of discarding it \"if Banks of the Anduin leaves play\" - which means it had to be in play first. If it was dealt as a shadow card, then it was not in play and it's effect was not active.\n> \n> The Troll Key (and Purse) only triggers after being discarded - it does not need to have been in play first. It is the act of discarding the Key & Purse that triggers their ability. It does not matter where they were discarded from.\n> \n> Cheers,\n> \n> Caleb\n\n \n\nThanks for the update, zeb.  If this really is what's intended, it feels to me like a FAQ update is sorely needed to explain *exactly* when Shadow cards stop ignoring their non-Shadow text and start using all of their triggers again.  Can anyone with a more encyclopedic card knowledge think of any other situations where a card regaining its regular abilities somewhere on the way from being a Shadow card to the discard pile (as opposed to a simple \"discard abilities on discarded Shadow cards trigger\") would make a difference?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=1313484","commentId":1313484,"userName":"GrandSpleen","timestamp":1414442961,"content":"There are only a very few cards that trigger their abilities after actually being discarded (Hidden Cache, Troll Key/Purse), and the rules are a little murky here.  It conflicts with another rule that states all card text is inactive while in the discard pile (hence Immune cards such as Beorn can be targeted by cards like Landroval or Fortune and Fate if they are in the discard pile).  I suppose the rule is: discard the card, check for any \"when discarded\" effects and resolve, and afterward all card text is inactive If it's still in the discard pile).\n\n \n\nWith regard to shadow effects, Frodo's Choice in the new Breaking of the Fellowship quest in an obvious comparison.  It states \"If Frodo's Choice is discarded, reveal it instead.\"  The original ruling about shadow cards says \"When a card is drawn as a Shadow card, only its Shadow text is considered to be active.\" (from the FAQ).  Reading that, you would think you'd have to ignore the text on Frodo's Choice and just discard it (and then do nothing with it, since card text is inactive once in the discard pile).  However, the ruling from Troll Purse/Key is pretty clear, and in fact you should reveal Frodo's Choice after discarding it, even if it was dealt as a shadow effect.\n\n \n\nI have to get creative to see a basis for the distinction between resolving Banks of the Anduin and Troll Key/Purse or Frodo's Choice as shadow cards.  The core set manual specifically says that shadow cards \"leave play,\" so we have to consider them \"in play.\"  The ruling from Caleb hinges upon Banks of the Anduin NOT being \"in play\" when dealt as a shadow card.  We are meant to ignore the rest of the card, and maybe we should ignore the card's title as well.  That way, when Banks of the Anduin is discarded, we can safely say that Banks of the Anduin was not in play, and its effect will not trigger.  But Frodo's Choice/Troll Key/Troll Purse don't have to be \"in play,\" so their effects will trigger once these are discarded, whether as a shadow card or some other way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=1313524","commentId":1313524,"userName":"TimPelican","timestamp":1414445131,"content":"You also have to distinguish between \"discarded\" and \"placed in the discard pile\", as the ruling from Caleb in the BGG thread referenced earlier otherwise seems nonsense (\"if no troll present when revealed, place in the discard pile\", would trigger the discard action to bounce it straight back to staging).  So:\n\n \n\n\"leaves play\"\n\n\"is discarded\"\n\n\"is placed is the discard pile\"\n\n \n\nall mean different things?\n\n \n\nIf the \"play\" / \"put into play\" and \"reveal\" / \"put into the staging area\" distinctions need a proper FAQ explanation, I think these do too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=1315413","commentId":1315413,"userName":"zeb","timestamp":1414585215,"content":"I am glad I am not the only one being puzzled with this. I thought there was an inconsitency with the shadow card rule.\n\nWhat is certain and clarified by Caleb, if that Shadow cards are not played and are not in play. Now this is satisfactory for Banks of Anduin. I think GrandSpleen is right: the text becomes active during the discard procedure, but this is not specified in the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=1315556","commentId":1315556,"userName":"zeb","timestamp":1414592368,"content":"> You also have to distinguish between \"discarded\" and \"placed in the discard pile\", as the ruling from Caleb in the BGG thread referenced earlier otherwise seems nonsense (\"if no troll present when revealed, place in the discard pile\", would trigger the discard action to bounce it straight back to staging).  So:\n> \n>  \n> \n> \"leaves play\"\n> \n> \"is discarded\"\n> \n> \"is placed is the discard pile\"\n> \n>  \n> \n> all mean different things?\n> \n>  \n> \n> If the \"play\" / \"put into play\" and \"reveal\" / \"put into the staging area\" distinctions need a proper FAQ explanation, I think these do too.\n\n \n\nLeaves play means that the card had to have been played, or put in play at some point. Caleb's ruling is that shadow cards are not played or in play (contrary to the impression we had from some FAQ entries), and thus Banks of the Anduin are discarded after they have been resolved as a shadow card. I think the rules and FAQ need a rewriting for addressing this, such as that shadow cards are discarded from play, or that shadow card text are wholefully inactive/ignored, etc.\n\n \n\nNote also that the FAQ uses \"is discarded\" for both Troll Purse and Key, there is no mention of \"put in the discard pile\".\n\nEdited October 29, 2014 by zeb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94570-troll-purse-and-troll-key-drawn-as-shadow-cards/?do=findComment&comment=1316065","commentId":1316065,"userName":"TimPelican","timestamp":1414614736,"content":">  \n> \n> Note also that the FAQ uses \"is discarded\" for both Troll Purse and Key, there is no mention of \"put in the discard pile\".\n> \n>  \n\n \n\nSorry for the confusion, that's from Caleb's answer quoted in the BGG thread:\n\n \n\n\"If there are no Troll enemies in play when Troll Purse or Troll Key are revealed, then they are placed in the discard pile.\"\n\n \n\nNow, if that was the same thing as \"being discarded\", their \"when discarded\" trigger would fire, and they'd bounce straight back into the staging area, which I don't think is the ruling intended.\n\n \n\nThis is my issue, we seem to be multiplying complexity and creating a lot of different states and edge cases just to make it so the Key and the Purse behave like the designers wanted.  \"Shadow: Resolve the 'when discarded' effect\" gets you to the same place by the power of the Golden Rule while retaining a simple understanding of shadow cards (no non-shadow text, are in play, leave play by being discarded).\n\n \n\nEdit: Might still need something else to cover the case where they're dealt as a shadow card that's discarded without being revealed (Feint, Forest Snare, etc), but that still feels a better fix to me.\n\nEdited October 29, 2014 by TimPelican"}]}