{"url":"https://community.fantasyflightgames.com/topic/94813-black-riders-attack/","title":"Black Riders attack!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/94813-black-riders-attack/?do=findComment&comment=925602","commentId":925602,"userName":"ruchlas","timestamp":1386499152,"content":"Hi there!\n\n \n\nI have a probably silly question but i cannot decide which one is right.\n\nThe Quest Cards in A Shadow of the Past in the Black Riders expansion say\n\n \n\n\"When a player fails a Hide test each Nazgul enemy in the staging area engages that player (Trigger Forced effects after resolving this effect)\"\n\n \n\nand the Black Rider says\n\n \n\n\"Forced: After engaged player fails a Hide test, Black Rider makes an immediate attack.\"\n\n \n\nMost of you i am sure know what i want to ask!\n\n \n\nThe Black Rider that engages me after having failed a Hide test attacks me at once?\n\nHe was not engaged with me when i failed the test.\n\n \n\nThe logical choise is that he attacks me because i failed to hide and he saw me, but he has to be engaged with me when i do so, doesn't he? He engages me after i fail!\n\n \n\nOf course the deeper reason for making that question is that i don't want him to attack me!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94813-black-riders-attack/?do=findComment&comment=925937","commentId":925937,"userName":"alogos","timestamp":1386533011,"content":"They use \"when a players fails\" on the quest cards and \"after player fails\" on the Black Riders.\n\n \n\n\"when\" effects happen before their \"after\" effects.\n\n \n\nBecause it engages you \"when\" you fails, it is engaged \"after\" you failed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/94813-black-riders-attack/?do=findComment&comment=926296","commentId":926296,"userName":"mr.thomasschmidt","timestamp":1386565464,"content":"So the right answer was?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/94813-black-riders-attack/?do=findComment&comment=926424","commentId":926424,"userName":"alogos","timestamp":1386584472,"content":"The Black Rider that engages you after when having failed a Hide test attacks you at once just after. (just changed the correct use of words)"}]}