{"url":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/","title":"I need some purchasing advice","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930685","commentId":930685,"userName":"Ranger of the Force","timestamp":1387033928,"content":"1.  What is the consensus on the Black Rider's Big Box Expansion?  \n\n \n\n \n\n2.  If I wanted a deck centered around Rangers, and could only get two APs from the ATS cycle, which two should I get?\n\n \n\nI can decide which route to take.\n\n \n\nThanks in advance for your advice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930702","commentId":930702,"userName":"Bullroarer Took","timestamp":1387035399,"content":"I can only answer #1 since I think that ranger/traps isn't really a viable archetype yet. (I tried it and felt it was woefully underpowered.). But the good news is that I feel The Black Riders is the best box to date. It is so much fun when running Hobbit theme decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930715","commentId":930715,"userName":"richsabre","timestamp":1387036086,"content":"it really depends on what you have now....black riders is tough, and even though it is one of the best to date, it is very difficult\n\n \n\nas for rangers it would again depends on how well your lore card pool is....rangers is lore so it will be better to have some key lore cards.\n\n \n\ni cannot remember the packs, but i would say get the one with faramir and also mirlonde. both of these are in the ATS cycle...i think they are amon din and assault on osgillaith but i may be wrong\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930720","commentId":930720,"userName":"Ranger of the Force","timestamp":1387036505,"content":"I have Core, all of the Mirkwood Cycle, Foundations of Stone, Watcher in the Water, The Long Dark, Heirs of Numenor, and Stewards Fear. If this helps.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930731","commentId":930731,"userName":"Gizlivadi","timestamp":1387038267,"content":"Am I the only one who thinks Rangers is only viable (to some extent) as a Tactics-Lore deck and not mono Lore? Maybe even Leadership-Lore with Boromir and Visionary leadership, but as a solo deck mono Lore is not good at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930783","commentId":930783,"userName":"Bullroarer Took","timestamp":1387042669,"content":"> Am I the only one who thinks Rangers is only viable (to some extent) as a Tactics-Lore deck and not mono Lore? Maybe even Leadership-Lore with Boromir and Visionary leadership, but as a solo deck mono Lore is not good at all.\n\nSince I said above that it was woefully underpowered you aren't the only one. I haven't tried it in combination, but are you talking single handed solo? Maybe with Spirit... By itself it has trouble beating Passage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930796","commentId":930796,"userName":"Gizlivadi","timestamp":1387043982,"content":"I'm talking about single handed solo, yes. And I'm asking because I really want to build a ranger deck but I just don't know how to make it good. Spirit sounds interesting, but what spirit cards would you add? I guess Glorfindel and Asfaloth, but that's kinda boring..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930826","commentId":930826,"userName":"danpoage","timestamp":1387047757,"content":"While it certainly is not as powerful as some decks (Dwarves, or Outlands), Rangers is absolutely a viable archetype. Here is an example of a deck that can handle many scenarios:\n\n \n\nhttp://hallofbeorn.wordpress.com/2013/09/18/deck-rangers-and-traps/ [http://hallofbeorn.wordpress.com/2013/09/18/deck-rangers-and-traps/]\n\n \n\nAs you can see, it includes Sam Gamgee to provide access to Leadership. This is a must, because Lore has little in the way of resource acceleration to pair with all of that card draw. Sam also brings some much-needed willpower for the critical early game. Once you get Faramir in play, this deck should have little problems questing. With a relatively low starting threat, you won't have to engage many enemies, and can trap them or shoot them with Ranger Bows. Again, some scenarios (Battle and Siege for example) are not a good fit for this deck, but it can handle many traditional quests.\n\n \n\nAs far as what to buy: Black Riders is not only a great expansion, but provides so excellent cards for this archetype: Elf-Stone is great in Lore decks, and Sam Gamgee (if you'll forgive the thematic departure) is a perfect fit as well. Anborn and Ranger Bow are two of the most important cards to the archetype (assuming you already have Heirs of Numenor). So Assault on Osgiliath and Blood of Gondor would be my choice for your two APs to buy. As a bonus, Assault on Osgiliath also gives you Faramir and Forest Patrol.\n\n \n\nRangers is one of my favorite new archetypes and I even find myself sneaking some of these cards (particularly Ranger Bow) into decks that are not strictly \"Ranger\" themed. Good luck on your quest to build a strong Ranger deck!\n\nEdited December 16, 2013 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930858","commentId":930858,"userName":"Gizlivadi","timestamp":1387051066,"content":"Hmm, interesting deck, looks pretty solid. What I would have thought at first is to go with Boromir and Visionary leadership, but I guess Faramir takes care of willpower, though at the cost of not having him as a hero, which is kinda dissapointing from a theme perspective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=930865","commentId":930865,"userName":"joezim007","timestamp":1387051754,"content":"Yea, it is kinda sad that it is so difficult to build a strong ranger deck without the Faramir hero, since his purpose was to be in ranger decks, but since they made his threat so high, it's too difficult to get him to fit. Mono-lore is also difficult (with or without Faramir), which is also sad since they seemed to try to stress mono-sphere decks and Advanced Warning is such a great mono-lore ranger card.\n\nWe'll see what the future holds though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=931016","commentId":931016,"userName":"Bullroarer Took","timestamp":1387070613,"content":"While Beorn's deck may be the best of the archetype, it still isn't a pure mono-lore ranger trap deck. So for now I think the jury has come down on the side of not-viable. And while we can hold out hope that Isengard/Rohan etc. will make it possible, we can still hear the echoes of Secrecy whispering from the Dwarrow-delf cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=931379","commentId":931379,"userName":"Ranger of the Force","timestamp":1387131656,"content":"After reading this discussion on Rangers ( I like a challenge), and knowing that Hobbits are not quite my thing, I have decided to purchase Assault on Osgilliath and Blood of Gondor.   I think I am going to try Spirit/Lore in my attempt to build a Ranger/Traps deck.  My initial thinking is Glorfindel (Sp)/Faramir/Denathor.    I will have threat reduction and questing power (Arwen, Ethir Swordsman, etc) and location removal in Asfaloth.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=931394","commentId":931394,"userName":"camacazio","timestamp":1387133741,"content":"I've enjoyed rangers too. I've had a lot of success with Aragorn (leadership), Theodred, and Bifur. The blood of gondor has the very crucial Anborn and Assault on Osgiliath has the very fun Ranger bow. I think shadow and flame has the master of the forge, which really helped rapidly obtaining and using traps, and henemarth riversong or longbeard elder help you know the best trap to drop."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=931647","commentId":931647,"userName":"hildargo","timestamp":1387172059,"content":"This is an interesting thread, as I think that mono-Lore is the only viable solo mono sphere archetype in the meta right now. With the addition of Elf-Stone, the resource issues that these decks face is almost non-existent if you use scrying from Denethor or Henamarth to plan your turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=933137","commentId":933137,"userName":"chuckles","timestamp":1387321788,"content":"I really like the look of Beorn's deck (and plan to try out) and like the idea of ranger decks in general... As the thread started off talking about buying BR vs a couple of shadow cycle packs for making a ranger themed deck I started wondering how easy it would for a new player to recreate Beorn's deck. (I know that cards could be swapped in and out etc).\n\n \n\nBreak down of cards by cycle:\nCycle/Saga               Individual Cards/Cycle   No of Diff packs used   No Cards/Cycle \nAgainst the Shadow                 8                                   4                                20 \nDwarrowdelf                             4                                   3                                11 \nHobbit Saga                             1                                   1                                 2 \nShadows of Mirkwood              6/2*                               2                                15/2* \nBlack Riders                            1/1*                               1                                 2/1* \nTotals                                      23                                 11                               50/3* \n*Hero cards \n\n \n\n11 different packs and saga's are needed, by my calculations, (12 if you want 2 cores sets for the third SoG), to recreate Beorn's rather cool looking ranger deck. (I can see why the developers could/would be exploring options for deck building that require fewer packs to get going).\n\n \n\nNice to see that nearly a third of cards are from the Core & Mirkwood cycle as I don't like lots of coasters and hopefully encouraging to players who don't have all the packs.\n\n \n\nSpecific to against the Shadow:\n\nPack     No of Individual Cards  Card Names                                                Total no of Cards\n\nHoN                    4                      Envoy of Pelargir, Ithilien Tracker,                        11\n\n                                                  Ranger Spikes & Citadel Custodian                    \n\nEaAD                  1                     Ithilien Archer                                                          2\n\nAoO                    1                     Ranger Bow                                                            3\n\nTBoG                  2                    Anborn, Poisoned Stakes                                        4\n\nTotals                 8                                                                                                    20\n\n \n\nWould agree with getting getting AoO & TBoG with along with Heirs (not that my agreement is needed). Anborn, Ranger Spikes & Ranger Bow are great ranger cards where as Ithilien Archer's ability is bettered by an event and there are other rangers for the Bows. (though still useful to include if you had them).\n\nEdited December 17, 2013 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=933158","commentId":933158,"userName":"Raven1015","timestamp":1387323804,"content":"> This is an interesting thread, as I think that mono-Lore is the only viable solo mono sphere archetype in the meta right now. With the addition of Elf-Stone, the resource issues that these decks face is almost non-existent if you use scrying from Denethor or Henamarth to plan your turns.\n\n \n\nMono-Leadership is definitely viable because it is so balanced compared to the other spheres.\n\nEdited December 17, 2013 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95156-i-need-some-purchasing-advice/?do=findComment&comment=933184","commentId":933184,"userName":"chuckles","timestamp":1387327303,"content":">  \n> \n> > This is an interesting thread, as I think that mono-Lore is the only viable solo mono sphere archetype in the meta right now. With the addition of Elf-Stone, the resource issues that these decks face is almost non-existent if you use scrying from Denethor or Henamarth to plan your turns.\n> \n>  \n> \n> Mono-Leadership is definitely viable because it is so balanced compared to the other spheres.\n> \n>  \n\n \n\nYes... and even if Leadership wasn't balanced... there is always an Outlands Mono Leadership deck.... may not be as much fun or hipster but it's effective.\n\n \n\nI think that Mono Spirit is also quite possible (not from personal experience).... but see Fanfan's deck in the link below \n\nhttp://community.fantasyflightgames.com/index.php?/topic/90360-challenge-defeat-all-quests-in-a-row-with-the-same-solo-deck/ [https://community.fantasyflightgames.com/index.php?/topic/90360-challenge-defeat-all-quests-in-a-row-with-the-same-solo-deck/]\n\n \n\nI think that Lore is the most fun Mono archetype.\n\nEdited December 18, 2013 by chuckles"}]}