{"url":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/","title":"5 cards that should never have been made","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932086","commentId":932086,"userName":"Boris_the_Dwarf","timestamp":1387221752,"content":"I followed with some interest the various threads on bad card design, and having been giving the topic some thought of my own this month. Looking through my collection, I came to the conclusion that several cards are such staples in the game that it's almost impossible to play without them. Here are the 5 biggest offenders, from least to worst:\n\n \n\n5. Unexpected Courage - While not all that bad in of itself given that there's only one copy per core set, the ability to fairly easily procure 2 more copies (there are a lot of great reasons for having at least 2 core sets beyond this one card) has created a few powerful combos, to the point that characters like Beravor had to be issued errata. Before the errata, I was drawing 4-6 cards and still either questing, attacking, and/or blocking attacks, in some combination. Beravor aside, you still get the opportunity to abuse other characters like Denethor, who can look at the top card of the encounter deck, move it to the bottom, and look again. And even when you aren't using a character that has an action ability, performing two basic functions at virtually no cost over the course of the game is incredibly powerful. When compared to other things like Steed of the Rohan, Cram, or Spare Hood and Cloak, it's just too good. Just about every other method of readying a character has a continual price attached, or is a cheap cost event.\n\n \n\n4. Arwen Undomiel - A 2 cost ally with 2 WP who can tame difficult attackers by either beefing up a low defense into something manageable or by setting up the best defender with a high defense and the ability to block all over the board, this is the only ally on the list. Granted she is unique, but the card really narrows design space in deckbuilding because it's just too important to include. Anytime a deck falls apart in one game without a certain card and then sails through without a single hiccup in the next game because of that card, well that's when you know it's a problem.\n\n \n\n3. A Burning Brand - The last line of the discussion on Arwen sums it up fairly well. Anytime a deck falls apart in one game without a certain card and then sails through without a single hiccup in the next game because of that card, well that's when you know it's a problem.\n\n \n\n2. Protector of Lorien - I like the design aspect to it, as it is simple and useful, but at the same time it's just an auto-win card. In a recent article, Caleb said he hoped the new Isengard set would challenge the popular \"turtling\" approach to the game, where players sit back and collect a ton of cards as they build up to the final stage of the encounter before gliding past with ease. (I'm paraphrasing.) Protector of Lorien is the gravy of the turtling game. Even incorporating the errata to limit the discard to 3 cards per phase, how many cards do you really intend to hold onto when discarding round after round gets you through the game that much faster? The other thing to realize is that in a last-ditch effort situation, you can just play 2 Protectors and then toss six cards to wrap up in 1 turn what might have taken 3-5 or even been a losing situation.\n\n \n\nAnd the number 1 card is...\n\n \n\n1. Light of Valinor - I'm sorry, but when I think about poor card design this is the card that comes to mind. It takes the worst hero in the game and makes him the best, so much so that it's considered poor deckbuilding not to use him in a spirit-centered design. I'm going to be honest. When I started using Glorfindel, I did not put Light of Valinor in my deck. It was an intentional choice. I wanted to challenge myself to overcome the drawback of my threat continually increasing. It limited how often I committed him to quest - even when he had Unexpected Courage on him - and his role was mainly to attack enemies that I engaged over the course of the game, until I needed his 3 willpower to get me over the hump of a particular stage. These days, I do use Light, but I don't really rely on it. I'm not afraid to quest with him without that on him, either. But I've seen other people sit back and keep him vertical until they draw the attachment. To me that's the equivalent of playing Gandalf to lower your threat by 5 and then discarding him without questing or fighting an enemy. Would you play an event card that costs 5 where the text read: Action - Reduce your threat by 5. ?? Because that's essentially what you are doing. The same is true for Glorfindel. Every round he doesn't do anything is a round where you could have started with a higher threat and accomplished more. If it takes 4-6 turns longer to get to the same result, then you should have used a 9-11 cost hero.\n\n \n\nHonorable mentions\n\nAsfaloth (It's forced the designers to increase the quest points on locations and made the game more difficult for other spheres/decks that don't have access to Asfaloth);\n\n \n\nGondorian Shield (Denethor with a 6 defense and the ability to cancel shadow cards each of the 3 times he blocks thanks to Arwen, A Burning Brand, Unexpected Courage and Behind Strong Walls is just golden);\n\n \n\nGandalf, the new one (More people should use him, but don't. It costs threat to keep him in play, but he can quest and attack, and the core one is really little more than a crutch these days)\n\n \n\nSo that's my opinion on the subject. I am certainly not advocating the errata or banning of cards, but I think it's important to understand what these handful of cards have done to overall design, both of new player cards as well as encounter deck concepts. We got Battle and Siege because of these cards, but we didn't get anything to help Lore and Spirit spheres play in the Battle/Siege realm (unless you go mono sphere, which is just a bad idea if you are a solo player like me).\n\nEdited December 16, 2013 by Boris_the_Dwarf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932099","commentId":932099,"userName":"richsabre","timestamp":1387222701,"content":"it is interesting having played this game from release to see the progression of the game.\n\n \n\nyou state the point of the above cards influencing the game's new rules and so on, however it is also the other way round, us players (or at least those of us from the early-ish time) probably caused a lot of these cards that werent in the core set to be released through feedback on playing.\n\n \n\nnow i am not speaking for ffg, so may be wrong, however if this is true then it is a good thing of course, as ffg are listening, ....however it also means we have sort of shot ourselves in the foot. i hold myself included in this group. until dwarrowdelf (and more specifically glorfindel) i was annoyed solo play wasnt getting enough attention, and stated it many times in the forum. then we get glorfindel, asfaloth and light....all of these are power cards in any number of players, however a low threat quester who can be ready to attack and handle locations with lore (whom we got the excellent strider to pair with) was a solo player's dream. also pair this with stargazer, who takes away the fact you have to wait for light of valinor (we had other ways to do this, however she is one of the best) then the whole game changed in just a couple of packs.\n\n \n\nthe new gandalf is also another one of these which i believe are player influenced cards....a card that candle handle it all.\n\n \n\nso, as i say, it is both- we influence the game, the new cards influence our style of play, and the cycle continues. sometimes this is good for a game, sometimes, as you point out, it is not. some new rules/game effects can be poorly translated to other spheres, play styles and player amounts.\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932135","commentId":932135,"userName":"Karlson","timestamp":1387224693,"content":"The beauty of this game is if you feel that some cards are overpowered or out of place, you have the simple option of choosing not to use them.  I'm the type of player who has never considered this game to be a competitive one (as far as with other real-life people, not orcs and wargs) so if you feel like you have discovered cheap alternative cards or play styles to cheat the game, then you can easily omit them without having fears that another player will exploit them to conquer you.\n\n \n\nOf course there are many different kinds of players out there.  Some only wish to build the end-all, be-all power decks that may, in fact, rely on powerful cards.  Others play this game to enjoy the thematic experiences it offers (such as taking the roles of Hobbits desperately questing through the Shire under the watch of Ringwraiths.)  Personally, if I find a card to be cheap or out of place, I don't use it.  To this day, I have never used the Imladris Stargazer because I feel like her power takes away a lot of the surprise fun factor of the game.  However, if I'm playing with Spirit Glorfindel, then Light of Valinor is usually thrown in there because it is a natural addition to his abilities.  If I'm not using him, then I do not include that card.  I really don't feel like there are any cards that I absolutely have to run in my decks, though.  The ones that show up the most are probably A Test of Will and Feint.  \n\n \n\nOverall, I think it comes down to preference, and if you don't like a card, just don't use it in your decks.  I don't feel like the quests have changed in an effort to cater to individual player cards; they have just naturally become more challenging due to the increased abundance of player cards as a whole and play options.\n\nEdited December 16, 2013 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932160","commentId":932160,"userName":"Tracker1","timestamp":1387227076,"content":"Well Boris the dwarf it is interesting that you did not mention any Dwarf cards, coincidence? And, then you go and pick on the elves, interesting. There always was tension between these two races.\n\nOut of all the cards you mention I think A Burning Brand is really the only one that should not have been made, because it shuts down the whole shadow card compnent of the game. With it you don't need to worry much about shadow cards unless you need to defend multiple enemies\n\nUC and PoL could be changed to unique or in the case on UC limit one per hero, that would be a fix without eliminating the cards all together.\n\nI disagree on Arwen, she is a very useful ally. I don't think she breaks the game.\n\nLoV is really tough call. i have become so accustomed to playing with it that it would be very sad to see it go. Maybe the card could impose a restriction to the attached hero when attached. It grants something super powerful, so maybe it should also take something away, like after it is attached no more attachments can be played on the hero. It would kind of flip flop the importance of the card early on, since now it would actually be a disidvantage to see the card in your openng hand if you're intending to load your hero up with attachments. This may go a long way in balancing the card.\n\nMy vote for a card that should have never been made is Steward of Gondor, compare this to Resourceful in non secrecy, which will cost 4 for an extra resource per round. Of course, resourceful is not unique and it is a neutral card, but if we do the math a player should have to pay 8 resources to get SoG. Would it be worth it then? Also it destroys all sorts of theme since any hero can become the Steward, enough said on why this card should not have been made the list can go on. But, heck i'm still going to use it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932173","commentId":932173,"userName":"scottindeed","timestamp":1387227842,"content":"I'm with Karlson, I'm not sure I quite get the whole \"overpowered\" card debate in a solo/co-operative game, where you can simply decide to tailor your experience however you see fit.\n\nI'm strictly a theme player these days which means that popular cards like Galadrim's Greeting, Protector of Lorien, Steward of Gondor, Stargazer, etc just don't get included a lot of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932200","commentId":932200,"userName":"richsabre","timestamp":1387229138,"content":"this debate also needs to be taken into context with the whole player base. there is a large amount of the player base who still find this game very difficult- and thats with all the above cards, often with more than 1 core set...so this is ability based. what one person can do with UC and Steward is very different to what another can do\n\n \n\ni also think that this is much different to what was experienced when core set came out. it was impossibly difficult for solo play during that era, again, even with all these cards. it is always difficult to see how a game's early development will go, and the way i see it, the designers had to give us something in the core set days to make winning possible for solo\n\n \n\nwith hindsight, i think a better thing would have been making core set quests easier, thus making there no need for these core power cards\n\nrich\n\nEdited December 16, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932203","commentId":932203,"userName":"Distractionbeast","timestamp":1387229263,"content":"As for Steward of Gondor, I kind of see that as a Leadership identity card.  Leadership is at least partially about resource gain.  SoG embodies that and makes Leadership decks perform their intended function.  \n\n \n\nCould it be modified?  Sure.  But it's unique.  \n\n \n\nUnexpected Courage is another one that I look at in a similar way.  In many ways it defines Spirit and becomes a reason to play that sphere.  \n\n \n\nI love Light of Valinor though.  As a major fan of the Silmarillion, I love how it adds to the Elves' collective power.  Heck, the Dwarves have had some mighty boosts over the cycles.  I personally think Glorfindel is a bit too powerful as is, though.  I think I would have just made him cost 1 threat anytime he quests, exhausted or not.  He'd still be an awesome hero in this game, and LoV would still be a great addition.\n\n \n\nThe main balancing factor I see for Glorfindel is that he dictates other cards in your deck to get his full effect.  If you're building that kind of deck, it's easy and extremely powerful, but I've decided to pick other Spirit heroes instead depending on what the quest requires.\n\nEdited December 16, 2013 by Distractionbeast"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932260","commentId":932260,"userName":"Boris_the_Dwarf","timestamp":1387232352,"content":"> this debate also needs to be taken into context with the whole player base. there is a large amount of the player base who still find this game very difficult- and thats with all the above cards, often with more than 1 core set...so this is ability based. what one person can do with UC and Steward is very different to what another can do\n> \n>  \n> \n> i also think that this is much different to what was experienced when core set came out. it was impossibly difficult for solo play during that era, again, even with all these cards. it is always difficult to see how a game's early development will go, and the way i see it, the designers had to give us something in the core set days to make winning possible for solo\n> \n>  \n> \n> with hindsight, i think a better thing would have been making core set quests easier, thus making there no need for these core power cards\n> \n> rich\n\nI agree, a lot of people still struggle. But most of those IMO are \"theme\" players who prefer to have a losing deck that mimics the storyline rather than a strategically designed build that earns victory consistently. I am not knocking people who prefer that method, just stating the perception. It's difficult to take a complaint about the challenge level seriously from someone who insists on not usi g the staple cards that are required to win.\n\nSpeaking more generally, I disagree with the sentiment that a player can just ignore the powerful player cards. The designers don't ignore them when making new encounters. Look at Caleb's comment about Isengard for proof of that.\n\nLastly, I didn't ignore dwarves. I don't view them as gatekeeper cards tho. I have a dwarf deck, a pretty good one according to the Internet but the deck I built on my own plays faster and stronger with a greater percentage of wins."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932267","commentId":932267,"userName":"Ellareth","timestamp":1387232727,"content":"It's interesting to see how none of your top 5 cards and honourable mentions would even make to my top 5 list and vice versa.\n\nLegacy of Durin is at the heart of every game breaking decks,\n\nDaeron's Runes while not being overly powerful has no drawback of including it in any deck with Lore sphere,\n\nImladris Stargazer, Stewards of Gondor, Spirit Glorfindel, Dain Ironfoot... there are list of cards I would name before something like Arwen or Protector of Lorien.\n\n \n\nIt is kind of funny that even amongst the players who feel like certain cards are overly powerful,\n\nwe can't quite agree on which cards are too powerful that should have never been made in interest of preventing power creep."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932269","commentId":932269,"userName":"GrandSpleen","timestamp":1387232768,"content":"Glorfindel should force you to raise your threat by 1 any time he exhausts, regardless of what action he is performing.  The presence of a 5-threat hero with high attack power in a sphere partially defined by its low attack values is just a head-scratcher.  Light of Valinor could be limit 1 per deck.  We might see more use of Word of Command that way...\n\n \n\nI'm very much in the same camp as Karlson though-- I don't like Glorfindel, so he rarely ever hits the table.  Collecting dust at the moment.  I do enjoy some power cards, like Burning Brand and Steward of Gondor (SoG gets my vote for the #1 most overpowered card), just not all of them.  I don't mind their presence either, so I'm happy to have them around for those days when I feel like I need a sledgehammer to solve all my problems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932271","commentId":932271,"userName":"richsabre","timestamp":1387232882,"content":"all this talk makes me pleased i am a theme player...;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932294","commentId":932294,"userName":"Boris_the_Dwarf","timestamp":1387234522,"content":"> It's interesting to see how none of your top 5 cards and honourable mentions would even make to my top 5 list and vice versa.\n> \n> Legacy of Durin is at the heart of every game breaking decks,\n\n \n\n...if you're playing Dwarves. Even then, Dwarf decks are pretty good without it. A little slower perhaps, but still powerful - Tho not so powerful that future encounter deck design has to go anti-dwarf to be challenging.\n\nEdited December 16, 2013 by Boris_the_Dwarf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932296","commentId":932296,"userName":"Ellareth","timestamp":1387234806,"content":">  \n> \n> > It's interesting to see how none of your top 5 cards and honourable mentions would even make to my top 5 list and vice versa.\n> > \n> > Legacy of Durin is at the heart of every game breaking decks,\n> \n>  \n> \n> ...if you're playing Dwarves. Even then, Dwarf decks are pretty good without it. A little slower perhaps, but still powerful - Tho not so powerful that future encounter deck design has to go anti-dwarf to be challenging.\n> \n>  \n\n \n\nI don't know... whenever I see a deck that truly destroys a game by drawing all the cards in a single phase and looping certain events over and over again, it seems to rely on getting cards that let's you abuse Legacy of Durin's draw power.\n\n \n\nI do agree that Dwarf decks can be good enough without the cards I've mentioned, but my idea of cards that should've never been made are cards that boost a powerful deck even futher, not the ones that can turn decent decks into power decks.\n\nMaybe that's why your list is so different from mine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932302","commentId":932302,"userName":"hildargo","timestamp":1387235008,"content":"The reason I don't think A Burning Brand is overpowered is that there are shadow effects that can quite literally end the game or be very close to ending the game in favor of the encounter deck. Defending a very benign enemy with a hero can turn into a slaughter fest if you get a 10-15 card shadow chain. Or how about discarding your entire hand? Or how about discarding all exhausted characters? Or discarding all of your resources? If the encounter deck has these powerful cards at it's disposal, then I think that the player should have a powerful countermeasure against those cards. Aside from A Burning Brand, I agree with a lot of the ideas in this thread. One card not mentioned in this thread is Hama. If you start recycling Thicket of Spears or Feint, you can lockdown enemies quite effectively, getting rid of the combat component of the game entirely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932307","commentId":932307,"userName":"CaffeineAddict","timestamp":1387235291,"content":"There are many kinds of players, with varying taste in what they want from the game. For everyone who dislikes a card, youll find someone else who loves it. If you hate a card, you probably werent the target audience for that one.\n\nThe game is deep enough to give cards to all the different kinds of players. At the end of the day, this is not a competitive game. Play with the cards you like, and dont play with the cards you hate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932308","commentId":932308,"userName":"chuckles","timestamp":1387235313,"content":"Dwarves are the most complete faction in the game... who don't need many if any of the cards that you have mentioned as they have thematic replacements or faction boosts that cover them...\n\n \n\nUnexpected Courage...   Erebor Record keeper, My heart Ever rises, Lure of Moria\n\nArwen Undomiel... not like for like but Hardy leadership sure helps and Dain + all dwarves = massive will power (not just 1 unique 2 cost 2 willpower ally)\n\nA Burning Brand... Balin cancel shadows effects and doesn't need to exhaust to do so\n\nProtector of Lorien... Dain on a global scale... without the defense bonus. \nLight of Valinor... Hero's are far less required for questing and then to be made ready to attack if you have a horde of dwarves questing under Dain's influence.\n \n(and lets not mention the other hero's with built in, just add horde, boosts to resource, card draw, threat reduction... )\n \nI look forward to seeing more thematic options for the various factions until then... I will happily continue using most of the above... Especially as I prefer ELVES!\nEdited December 16, 2013 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932340","commentId":932340,"userName":"Yivrael","timestamp":1387237635,"content":"I'd personally like to see a much more powerful version of Glorfindel.  I think in context he is much too weak.  Merry standing next to Pippin and Sam is as powerful as Glorfindel and Merry has a positive response to boot.  That is my mind a little bit of stretch, I mean I get it...balance and all, but why not just a print a comparative \"accurate\" version...Glorfindel in my mind should be the single most over powered Hero in the game.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932344","commentId":932344,"userName":"chuckles","timestamp":1387237787,"content":"> I'd personally like to see a much more powerful version of Glorfindel.  I think in context he is much too weak.  Merry standing next to Pippin and Sam is as powerful as Glorfindel and Merry has a positive response to boot.  That is my mind a little bit of stretch, I mean I get it...balance and all, but why not just a print a comparative \"accurate\" version...Glorfindel in my mind should be the single most over powered Hero in the game.  \n\n \n\nLOL ...what would his threat be?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932346","commentId":932346,"userName":"richsabre","timestamp":1387238089,"content":">  \n> \n> > I'd personally like to see a much more powerful version of Glorfindel.  I think in context he is much too weak.  Merry standing next to Pippin and Sam is as powerful as Glorfindel and Merry has a positive response to boot.  That is my mind a little bit of stretch, I mean I get it...balance and all, but why not just a print a comparative \"accurate\" version...Glorfindel in my mind should be the single most over powered Hero in the game.  \n> \n>  \n> \n> LOL ...what would his threat be?\n> \n>  \n\n49 ....then you really would need one of these 1-turn-win decks haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932347","commentId":932347,"userName":"chuckles","timestamp":1387238194,"content":">  \n> \n> >  \n> > \n> > > I'd personally like to see a much more powerful version of Glorfindel.  I think in context he is much too weak.  Merry standing next to Pippin and Sam is as powerful as Glorfindel and Merry has a positive response to boot.  That is my mind a little bit of stretch, I mean I get it...balance and all, but why not just a print a comparative \"accurate\" version...Glorfindel in my mind should be the single most over powered Hero in the game.  \n> > \n> >  \n> > \n> > LOL ...what would his threat be?\n> > \n> >  \n> \n> 49 ....then you really would need one of these 1-turn-win decks haha\n> \n>  \n\nhahahahahaahahaa ...actually laughing out loud!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932356","commentId":932356,"userName":"Yivrael","timestamp":1387239653,"content":" I'd probably start with the 12 threat Glorfindel and build up his abilities from there.  Or just turn him into an ally which is what he should probably be.  I think the witch king fled from his presence and he defeated a balrog."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932387","commentId":932387,"userName":"Boris_the_Dwarf","timestamp":1387243428,"content":"> > > It's interesting to see how none of your top 5 cards and honourable mentions would even make to my top 5 list and vice versa.\n> > > \n> > > Legacy of Durin is at the heart of every game breaking decks,\n> > \n> >  \n> > \n> > ...if you're playing Dwarves. Even then, Dwarf decks are pretty good without it. A little slower perhaps, but still powerful - Tho not so powerful that future encounter deck design has to go anti-dwarf to be challenging.\n> \n>  \n> \n> I don't know... whenever I see a deck that truly destroys a game by drawing all the cards in a single phase and looping certain events over and over again, it seems to rely on getting cards that let's you abuse Legacy of Durin's draw power.\n> \n>  \n> \n> I do agree that Dwarf decks can be good enough without the cards I've mentioned, but my idea of cards that should've never been made are cards that boost a powerful deck even futher, not the ones that can turn decent decks into power decks.\n> \n> Maybe that's why your list is so different from mine.\n\nBut you can't rely on Legacy if you're not playing Dwarves. That said, I think my criteria for what constitutes bad design is different. Not better, not worse, just different. Legacy of Durin won't lead to negative anti-dwarf elements the way asfaloth will lead to more difficult locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932389","commentId":932389,"userName":"Boris_the_Dwarf","timestamp":1387243800,"content":"> Dwarves are the most complete faction in the game... who don't need many if any of the cards that you have mentioned as they have thematic replacements or faction boosts that cover them...\n> \n>  \n> \n> Unexpected Courage...   Erebor Record keeper, My heart Ever rises, Lure of Moria\n> \n> Arwen Undomiel... not like for like but Hardy leadership sure helps and Dain + all dwarves = massive will power (not just 1 unique 2 cost 2 willpower ally)\n> \n> A Burning Brand... Balin cancel shadows effects and doesn't need to exhaust to do so\n> \n> Protector of Lorien... Dain on a global scale... without the defense bonus. \n> \n> Light of Valinor... Hero's are far less required for questing and then to be made ready to attack if you have a horde of dwarves questing under Dain's influence.\n> \n>  \n> \n> (and lets not mention the other hero's with built in, just add horde, boosts to resource, card draw, threat reduction... )\n> \n>  \n> \n> I look forward to seeing more thematic options for the various factions until then... I will happily continue using most of the above... Especially as I prefer ELVES!\n\nAlmost everything you list as counterparts are comditional or resource heavy components. I will admit that I use all 5 of the cards on my list in my solo deck (which doubles as the deck for my two-player deck with minor tweaks)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932401","commentId":932401,"userName":"chuckles","timestamp":1387245973,"content":"> Almost everything you list as counterparts are comditional or resource heavy components. I will admit that I use all 5 of the cards on my list in my solo deck (which doubles as the deck for my two-player deck with minor tweaks).\n> \n>  \n\n \n\nYes and leadership Dwarves don't generally have resource issues.... especially if a certain, better than average, Title is in play.\n\n \n\nWhy do you use them, if you believe they should not have been made?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932402","commentId":932402,"userName":"Bullroarer Took","timestamp":1387246183,"content":"The more I think about this game the more I realize how ridiculously ambitious it is. And yet it succeeds admirably. Yes, the cards you list are powerful (though I think Dain is THE most overpowered card in the game), but without some of them the solo player wouldn't stand a chance against the harder quests. And I would not have stayed with this game if the balance was still like what we had in the core set.\n\nThat's a long way of saying that I'm okay with the cards. I think if FFG got a mulligan they would tweak some of these cards, but not ban them outright."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932429","commentId":932429,"userName":"Boris_the_Dwarf","timestamp":1387250536,"content":"> > Almost everything you list as counterparts are comditional or resource heavy components. I will admit that I use all 5 of the cards on my list in my solo deck (which doubles as the deck for my two-player deck with minor tweaks).\n> \n>  \n> \n> Yes and leadership Dwarves don't generally have resource issues.... especially if a certain, better than average, Title is in play.\n> \n>  \n> \n> Why do you use them, if you believe they should not have been made?\n\nIt's part of the point I was making. The rest of the game has evolved around these cards, and the odds of winning without them are so much smaller."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932508","commentId":932508,"userName":"soldat7","timestamp":1387263357,"content":"I love using each and every card you mentioned. This game is hard enough as it is; taking the power back (some) by playing great cards and combos is invigorating. There is simply no evidence that the game has detrimentally evolved around these few cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932985","commentId":932985,"userName":"Pharmboys2013","timestamp":1387310575,"content":"In regards to cards that should not have been made I would rather not see cards that are useless and serve as nothing but display in my binder.  The most recent thread discussing power in the earth is a good example of this.  I'd rather have a majority of strong cards to select from than an abundance of terrible ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932997","commentId":932997,"userName":"leptokurt","timestamp":1387311456,"content":"No one mentioning Sneak Attack? The godfather of cheap victories?\n\n \n\nBurning Brand is ok, I find myself not using it because Bergond is just not lore.\n\n \n\nLight of Valinor is also ok, but Glorfindel is just toop powerful.\n\n \n\nSteward of Gondor is one of those cards that lost some of its power during the cycles. There are other resource generating cards by now and also lots of useful 1 cost cards.\n\n \n\nI do understand the point against Arwen. I don't think she is overpowered, but she's such an auto-include..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=932999","commentId":932999,"userName":"EclatK","timestamp":1387311581,"content":"> In regards to cards that should not have been made I would rather not see cards that are useless and serve as nothing but display in my binder.  The most recent thread discussing power in the earth is a good example of this.  I'd rather have a majority of strong cards to select from than an abundance of terrible ones.\n\nTotaly agree!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=933210","commentId":933210,"userName":"soldat7","timestamp":1387330718,"content":"> In regards to cards that should not have been made I would rather not see cards that are useless and serve as nothing but display in my binder. The most recent thread discussing power in the earth is a good example of this. I'd rather have a majority of strong cards to select from than an abundance of terrible ones.\n\nLike Palantir. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nWhile I disagree with the OP on these particular cards, I do believe that one of his arguments is that the presence of super cards renders less powerful, yet similar cards, sorta pointless. Unfortunately, every card game I've ever played suffers from this side effect. In this card game though, give me the power against that nasty encounter deck please!\n\nEdited December 18, 2013 by soldat7"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=933329","commentId":933329,"userName":"leptokurt","timestamp":1387355313,"content":"Hey, Palantir is crazy useful when you're playing mulitplayer and you have a readying effect for the hero using that thing. You know what's coming, and you may even draw a card or two.\n\n \n\nAlso, in combination with Ring of Barahir your hero gets +2 HP.\n\nEdited December 18, 2013 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=933342","commentId":933342,"userName":"Glaurung","timestamp":1387358398,"content":"here is one vert important think..some powerful cards you need to play solo. without them like a arwen Spirit Glorifindel and special sneak attack is dufficult to make successful solo deck. But in 2 or more players game those cards can be overpowered. different deck building for different scale of the players.\n\nand NM? you need really strong decks to play againts NM."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=933344","commentId":933344,"userName":"Glaurung","timestamp":1387358485,"content":"Morgul Vale really ambush for me.... even Thorin company sucks here...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=933495","commentId":933495,"userName":"Bullroarer Took","timestamp":1387380137,"content":"> Morgul Vale really ambush for me.... even Thorin company sucks here....\n\nOh you finally got Morgul Vale! Please make a video. That's a really difficult quest, at least for the solo player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=933635","commentId":933635,"userName":"Glaurung","timestamp":1387390469,"content":">  \n> \n> > Morgul Vale really ambush for me.... even Thorin company sucks here....\n> \n> Oh you finally got Morgul Vale! Please make a video. That's a really difficult quest, at least for the solo player.\n> \n>  \n\nIt difficult for any number of players….we won 2 players game from fourth attempt i suppose…….I play Elrond/Glorifindel Spirit/Theoden and my friend play Beregond/Legoas/Brand pure tactic deck. It was very difficult but we made it…..\n\nSolo still not even close for me…..but i will try more. Now play a lot Eldritch Horror new incarnation of Arkham horror but will make video soon anyway….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=933657","commentId":933657,"userName":"Tracker1","timestamp":1387393023,"content":"> > > Morgul Vale really ambush for me.... even Thorin company sucks here....\n> > \n> > Oh you finally got Morgul Vale! Please make a video. That's a really difficult quest, at least for the solo player.\n> \n> It difficult for any number of players….we won 2 players game from fourth attempt i suppose…….I play Elrond/Glorifindel Spirit/Theoden and my friend play Beregond/Legoas/Brand pure tactic deck. It was very difficult but we made it…..\n> \n> Solo still not even close for me…..but i will try more. Now play a lot Eldritch Horror new incarnation of Arkham horror but will make video soon anyway…..\n\nDid you try a low threat Dunhere deck yet? It's the only deck that works for me on MV."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=934042","commentId":934042,"userName":"Glaurung","timestamp":1387426252,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > Morgul Vale really ambush for me.... even Thorin company sucks here....\n> > > \n> > > Oh you finally got Morgul Vale! Please make a video. That's a really difficult quest, at least for the solo player.\n> > \n> > It difficult for any number of players….we won 2 players game from fourth attempt i suppose…….I play Elrond/Glorifindel Spirit/Theoden and my friend play Beregond/Legoas/Brand pure tactic deck. It was very difficult but we made it…..\n> > \n> > Solo still not even close for me…..but i will try more. Now play a lot Eldritch Horror new incarnation of Arkham horror but will make video soon anyway…..\n> \n> Did you try a low threat Dunhere deck yet? It's the only deck that works for me on MV.\n> \n>  \n\nYes i see this your new deck…. and i like it! should to try but later if i cannot build up my deck to win this quest solo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=942309","commentId":942309,"userName":"Bullroarer Took","timestamp":1388541603,"content":"I will not say this card should not have been made, but it irks me that the card we like to call Strider is Lore. Threat reduction is generally a Spirit trait and yet Loragorn has made the most powerful threat reduction card Lore.\n\nHow will they make a Spirit Aragorn? In other words, Strider should have been Spirit.\n\nUnexpected Courage and Burning Brand both should have been restricted, and Burning Brand possibly should have been \"Exhaust Burning Brand to cancel a shadow effect...\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=942368","commentId":942368,"userName":"Glaurung","timestamp":1388556437,"content":"> I will not say this card should not have been made, but it irks me that the card we like to call Strider is Lore. Threat reduction is generally a Spirit trait and yet Loragorn has made the most powerful threat reduction card Lore.\n> \n> How will they make a Spirit Aragorn? In other words, Strider should have been Spirit.\n> \n> Unexpected Courage and Burning Brand both should have been restricted, and Burning Brand possibly should have been \"Exhaust Burning Brand to cancel a shadow effect...\"\n\nI agree with you about BB and UC.\n\nLoragorn always was broken but with new cycle with all those doom players card he can be ultimate broken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=942607","commentId":942607,"userName":"klaymen_sk","timestamp":1388597623,"content":"> How will they make a Spirit Aragorn?\n\n \n\nI hope they won't make him at all. There is too much of Aragorn and his toys in the game already.\n\n/unpopular opinion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=942710","commentId":942710,"userName":"Mndela","timestamp":1388608822,"content":"I think lotr will release spirit Aragorn. I dont know why, maybe to close the cycle similar of the attachments cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95265-5-cards-that-should-never-have-been-made/?do=findComment&comment=942828","commentId":942828,"userName":"klaymen_sk","timestamp":1388621170,"content":"There is a few cards I won't miss, but I absolutely loathe Steward of Gondor. It turned my friend into an addict. When he can't find it in his opening or mulliganed hand, he uses all his card draw to get it ASAP even if someone of us is in need of more cards. Then he uses it to churn out dwarves on the table. The icing on the cake is that he doesn't want to include cards like Errand-rider to help us out.\n\nYes, I know that this is more of a bad player instead of a bad card, but I wouldn't mind if it suddenly disappeared."}]}