{"url":"https://community.fantasyflightgames.com/topic/95525-table-talk/","title":"Table Talk","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/95525-table-talk/?do=findComment&comment=935713","commentId":935713,"userName":"Nerdmeister","timestamp":1387623619,"content":"Seeing as there seemed to be some confusion about the table talk rules but no-one in a particular hurry to get it clarified, I sent a rules querry to FFG:\n\n \n\nThe question\n\n---------------------------------------------------------------------------------\n\nThis is a few questions pertaining the table talk rules from p. 25 in the Core Rulebook:\nWhile the rules state that \"Players can discuss anything they would like, but they cannot name or read out loud directly from cards in their hand, or from cards that they have seen but the rest of the players have not\" does that also entail that players are not allowed to simply show their entire hand to their co-players?\nGoing further along those lines, is two-handed play (a game where one player controls two different decks and plays the game as though it is two-player) allowed as a play style or is it in violation of the table talk rules (or another rule)?\n---------------------------------------------------------------------------------\n\n \n\nThe answer\n\n---------------------------------------------------------------------------------\n\nYou cannot just show other players the cards that are in your hand.\nWhile playing two-handed can be a fun variant for solo players, it is not a format that is officially supported by FFG and therefore there are no official rules for it.\nCheers,\nCaleb\n\n-------------------------------------------------------------------------------"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95525-table-talk/?do=findComment&comment=935754","commentId":935754,"userName":"Mndela","timestamp":1387630291,"content":"I usually play with friends without saying nothing about the hand. But there are some times that one player says one card from his hand. For example, if you have a feint to use with an enemy engaged with a friend:\n\n \n\nPlayer1: engage this enemy\n\nPlayer2: no, he kills me\n\nPlayer1: engage him!\n\nPlayer2: no, i dont want\n\nPlayer1: dont worry, engage him\n\n \n\nIt is ok? Yes. But to avoid it, i prefer to say directly:\n\n \n\nPlayer1: engage this enemy i will use feint on him\n\nPlayer2: ok.\n\n \n\n \n\nAlmost all players play so. Strickly you cant, but to make the game funnier, you can speak about some cards (few, not too many). And these games are considered goods and officials. However, in tournament, players must play with the first option ('don't worry, engage him').\n\n \n\nHow about? What does people in the forum think?\n\nEdited December 21, 2013 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95525-table-talk/?do=findComment&comment=936112","commentId":936112,"userName":"Nerdmeister","timestamp":1387663167,"content":"We usually go with the first option.\n\nTo us it´s part of the game to beat around the bush.\n\nAlso, just sometimes, misunderstandings still happen, which we must then be ready to deal with."}]}