{"url":"https://community.fantasyflightgames.com/topic/95748-just-one-question-to-early-quest%C2%B4s-and-later-expansions/","title":"Just one question to early Quest´s and later expansions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/95748-just-one-question-to-early-quest%C2%B4s-and-later-expansions/?do=findComment&comment=938511","commentId":938511,"userName":"Legoland","timestamp":1388022773,"content":"Hello,\n\n \n\nI just started LOR LCG (solo) and I´m realy excited about it.\n\nI bought the Core that up to the Khazad - Box. I have a huge excel with statistic (nerd sry^^) and also note every success with highscore.\n\n \n\nNow that I handled some quests/szenarios(and some not) I asked myself, if it is acceptable to use cards in my deck for quest which were not allready released at the moment of that quest!?!?\n\nExample: I use eagles cards of tactic to win Escape of Dol Guldor. Escape of Dol Guldor is from the Core Set and all following eagles card did not exist at that time.\n\nSo am I cheating? Or is this ok? Because every quest has a difficult level. And I can imagin that this would not be right if I use more powerfull cards from later expansion (otherwise did I read about campains with more scenarios where many player uses newer cards for old quests).\n\nMaybe I need two Highscore - one with decks which won with cards availble at the release and one with no limit.\n\n \n\nSorry for my poor english. And thanks for you´re answers!\n\n \n\nPS: What about later expensions like Hobbit and Ring SAGA - can I mix them with the normal Cycles cards? Or are they just for the SAGA´s?\n\nEdited December 26, 2013 by Legoland"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95748-just-one-question-to-early-quest%C2%B4s-and-later-expansions/?do=findComment&comment=938520","commentId":938520,"userName":"richsabre","timestamp":1388025155,"content":"hello\n\nyes you can use any cards in any quest and this is completely normal, in fact it would be less common to find players who stick to the 'only play with what was relased at the time' .....a lot of players, including myself, NEED later cards just to win!!\n\nalso the hobbit (or any saga) player cards can be used with any quests BUT treasure cards cannot be\n\n \n\nRegards!\n\nrich\n\nps. any spelling mistakes down to large amounts of 25th. dec. alcohol!\n\nEdited December 26, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95748-just-one-question-to-early-quest%C2%B4s-and-later-expansions/?do=findComment&comment=938551","commentId":938551,"userName":"divinityofnumber","timestamp":1388032429,"content":"I have always tried to beat scenarios with only the cards that were released at that time. But, once I beat them, then I play them with decks made from any cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/95748-just-one-question-to-early-quest%C2%B4s-and-later-expansions/?do=findComment&comment=938732","commentId":938732,"userName":"klaymen_sk","timestamp":1388081939,"content":"> also the hobbit (or any saga) player cards can be used with any quests BUT treasure cards cannot be\n\n \n\nJust a minor correction: Hobbit version of Bilbo and Black Riders version of Frodo and their corresponding sphere cards (Baggins and Ring-Bearer) aren't allowed to be used outside of their respective quests either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95748-just-one-question-to-early-quest%C2%B4s-and-later-expansions/?do=findComment&comment=939575","commentId":939575,"userName":"Legoland","timestamp":1388190276,"content":"Thank you so much for you´re replay! I allready was a little afraid that the deckbuidling would be limited just for the next new quests^^ Now I´m excited to kick asses in Dol Guldor (and also Trolls) after the next expansion packs. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited December 28, 2013 by Legoland"}]}