{"url":"https://community.fantasyflightgames.com/topic/95838-newbie-question/","title":"Newbie question...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/95838-newbie-question/?do=findComment&comment=939597","commentId":939597,"userName":"UrbanMonk","timestamp":1388192918,"content":"Having never played LOTR LCG before, I recieved the following for Christmas :\n\n \n\nCore boxed set\n\n \n\nKhazad-Dum expansion\n\nRoad to Rivendell adventure pack\n\nThe Watcher in the Water adventure pack\n\nThe Long Dark adventure pack\n\n \n\nHeirs of Numenor expansion\n\nThe Druadan Forest adventure pack\n\nEncounter at Amon Din adventure pack\n\n \n\nThe Black Riders saga expansion\n\n \n\nJourney Along the Anduin Nightmare deck\n\nEscape from Dol Guldur Nightmare deck\n\n \n\nI was totally stoked to get this pile of awesomeness, but upon doing a little googling it seems much of this is not \"in order\".  Is this all playable as is, or should I be doing things in order ? ( ie The Black Riders is the last of the Saga expansions, but the only Saga expansion I have... )\n\n \n\nI have no clue what Im doing here !  :wacko: [//content.invisioncic.com/Mfantflight/emoticons/default_wacko.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/95838-newbie-question/?do=findComment&comment=939612","commentId":939612,"userName":"richsabre","timestamp":1388194478,"content":"that is one hell of a present ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nno, you are all fine. the only time you CANNOT play a pack is when you\n\na) do not have core set\n\nb) do not have the cycle's deluxe pack\n\n \n\nas you have core set and the 2 deluxe packs you can play any of the packs...order doesnt really matter, though you will be missing out on the storyline. this is more important in the gondor cycle, but it still doesnt really matter\n\n \n\nthe saga packs can be played as they are, they are stand alone\n\nrich\n\nEdited December 28, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95838-newbie-question/?do=findComment&comment=939738","commentId":939738,"userName":"Olorin93","timestamp":1388226592,"content":"That's a pretty nice Christmas present. Welcome to the game!\n\n \n\nYou need the Core set to play anything else. With just the Core set, you can play any of the adventure packs in the Shadows of Mirkwood cycle (6 packs). Since you have the Khazad-Dûm expansion, you can also play the Dwarrowdelf cycle (6 packs). Same thing with the Heirs of Númenor expansion and Against the Shadow cycle (another 6 packs). The Saga expansions. like the two Hobbit expansions and the Black Riders, are separate.\n\n \n\nEDIT: I suppose they are meant to be played roughly in this order: Core Set -> Shadows of Mirkwood cycle -> Khazad-Dûm -> The Dwarrowdelf -> Heirs of Númenor -> Against the Shadow. It doesn't really matter, though. I played Dwarrowdelf before Shadows of Mirkwood.\n\n \n\nIf you have any questions, do not hesitate to ask. This is a great community. Good luck in Middle-Earth!\n\nEdited December 28, 2013 by Olorin93"}]}