{"url":"https://community.fantasyflightgames.com/topic/95844-symbol-discrepancies-on-khazad-dum-and-dwarrowdelf-scenarios/","title":"Symbol discrepancies on Khazad-dum and Dwarrowdelf scenarios","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/95844-symbol-discrepancies-on-khazad-dum-and-dwarrowdelf-scenarios/?do=findComment&comment=939640","commentId":939640,"userName":"mtschellenberg","timestamp":1388198062,"content":"Hello,\n\n \n\nFor the Into the Pit scenario, it says to use the Twists and Turns and Hazards of the Pit encounter cards (among others) and shows the torch and the cracked stone symbols.\n\n \n\nFor Flight from Moria it says to use the Hazards of the Pit and the Deeps of Moria and shows the chain and the cracked stone.\n\n \n\nFor The Long Dark it says to use Twists and Turns and Hazards of the Pit and shows the torch and the chain.\n\n \n\nFor Foundations of Stone it says to use Twists and Turns and Deeps of Moria and shows the torch and the cracked stone.\n\n \n\nFor Shadow and Flame it says to use Deeps of Moria and shows the chain.\n\n \n\nObviously there are some typos but I do not know which ones are incorrect.  I checked the online versions on FFG's support page and they have not been changed.\n\n \n\nWhich encounter card symbols match up to which names?\n\n \n\nWhich ones encounter cards should I use for the scenarios -- the ones named or the ones symbolized?\n\n \n\nThanks for the help,\n\n \n\nThomas\n\n \n\nEdit:  Spelling.\n\nEdited December 28, 2013 by mtschellenberg"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95844-symbol-discrepancies-on-khazad-dum-and-dwarrowdelf-scenarios/?do=findComment&comment=939661","commentId":939661,"userName":"GrandSpleen","timestamp":1388202813,"content":"Deeps of Moria is the chain.\n\nTwists and Turns is the torch.\n\nHazards of the Pit is the cracked stone.\n\n \n\nI remember reading a correction somewhere, but can't remember where it was... the quest cards are all printed correctly, with correct encounter set icons, so follow those.  The rule inserts give the wrong set names, so just ignore the text and follow the icons."}]}