{"url":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/","title":"Best way to play solo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941560","commentId":941560,"userName":"gertat","timestamp":1388445678,"content":"Just bought the game and after 4 games with 2 loses and 2 wins I want to ask wich way is the best way to play the game solo?\n\nPlaying as 1 player or playing 2 players but I play both players (2 handed)\n\nLove the game so far\n\nEdited December 30, 2013 by gertat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941567","commentId":941567,"userName":"Bullroarer Took","timestamp":1388446197,"content":"Pros and cons to both. I play solo one handed exclusively now, but have tried playing double fisted. It does open up the game allowing for a lot more interactions that the game was designed for. But then you are essentially playing three decks and there is a lot more to keep track of. I suggest trying it both ways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941578","commentId":941578,"userName":"richsabre","timestamp":1388446645,"content":"i used to only play 1 handed solo (solo is the only way i play anyways), but around a year or so ago i switched to 2, 3 or even 4 handed.\n\n \n\npersonally i use a mixture but i will say that from core set up to around hiers of numenor it is easier playing 2 handed, and from then on it is generally easier solo\n\n \n\nalso with 2 handed ranged and sentinel actually has a use.\n\nRich\n\nEdited December 30, 2013 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941625","commentId":941625,"userName":"soldat7","timestamp":1388450227,"content":"I like one-handed solo, personally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941631","commentId":941631,"userName":"legolas18","timestamp":1388450674,"content":"I like 2-handed better than solo, mainly because I feel like the quests were intended for more than one player.  Sometimes when I play one-handed, the scenario feels easier, almost flawed, just because of the ways the cards work, and because you only have to reveal one card every round, significantly reducing the difficulty on most scenarios. Playing 2-handed allows the cards to interact with each other, which I enjoy more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941725","commentId":941725,"userName":"ricedwlit","timestamp":1388465423,"content":"I've played both one and two handed solo and greatly prefer the two handed.  As others have noted you get to enjoy keywords such as Sentinel and Ranged. One handed solo became an exercise in optimizing the deck to do everything. With two hands you can afford to specialize each a bit (say just questing or fighting)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941771","commentId":941771,"userName":"Pharmboys2013","timestamp":1388474477,"content":"It almost depends on your personality.  The game flows most naturally with 2 players and it is easier to make deck combos and complement weakness but.....it can get a bit convoluted.  Playing purely solo is a nice very controlled situation, but your deck literally needs to be a jack of all trades to have success.\n\n \n\nI prefer pure solo almost entirely because I just am too bothered by the set up and hassle of 2 handing.  Others dont mind and get a better experience out of it.  Just give it a try and see what you enjoy doing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941863","commentId":941863,"userName":"scottindeed","timestamp":1388491856,"content":"I exclusively play 2-handed. I like to build themed decks and 2-handed allows me to do this and still be in with a chance of winning. 1-player often demands that you power-play your decks.\n\nI quite enjoy how convoluted it can get in a perverse sort of way, it feels challenging and rewarding."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=941969","commentId":941969,"userName":"Gizlivadi","timestamp":1388506139,"content":"As Pharmboys said, 2 handed can get too fiddly and confusing, but at the same time you don't have to make your decks so powerful since they will combine which each other. I definately prefer one handed. I dabbled with 2 handed for a while and it was just way too confusing (try playing Flies and Spiders 2 handed!). The problem with 1 handed is that your deck has to be built in order to deal with pretty much everything, but I like the challenge of deckbuilding, and now with the focus in mono sphere  somewhat grounded I feel like I can use cards that otherwise I would never use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=942205","commentId":942205,"userName":"soldat7","timestamp":1388528757,"content":"> I like 2-handed better than solo, mainly because I feel like the quests were intended for more than one player.  Sometimes when I play one-handed, the scenario feels easier, almost flawed, just because of the ways the cards work, and because you only have to reveal one card every round, significantly reducing the difficulty on most scenarios. Playing 2-handed allows the cards to interact with each other, which I enjoy more.\n\nThe game is certainly not \"flawed\" when playing solo with one deck. It was designed for both solitaire play and multiplayer alike. Most of the scenarios are more difficult solo and require more advanced deck building (perfect for me, not great for everyone.) The two-player game (alone) can be fun, but I find it too cumbersome, especially when I just want to test a deck or squeeze in a quick gaming session. It's a fun variant but I wouldn't recommend it for beginners."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=942342","commentId":942342,"userName":"gertat","timestamp":1388549415,"content":"Now that I got some of the forum users attention to the second part of my question.\n\nI'm a Warhammer Invasion LCG player and in that game I try to mack my deck so that can face of against any popens deck.\n\nOptimice it so that it can handle as many situations as possible.\n\nHow do you do in this game?\n\nDo you let the deck or decks you play be decided by the quest you play or.\n\nDo you try to optimice your deck to go up against any quest?\n\nLove to hear your input on this as well.\n\nThanks beforehand"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=942350","commentId":942350,"userName":"Bullroarer Took","timestamp":1388550971,"content":"If you read the above posts your question was answered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=942364","commentId":942364,"userName":"Pharmboys2013","timestamp":1388555065,"content":"> Now that I got some of the forum users attention to the second part of my question.\n> \n> I'm a Warhammer Invasion LCG player and in that game I try to mack my deck so that can face of against any popens deck.\n> \n> Optimice it so that it can handle as many situations as possible.\n> \n> How do you do in this game?\n> \n> Do you let the deck or decks you play be decided by the quest you play or.\n> \n> Do you try to optimice your deck to go up against any quest?\n> \n> Love to hear your input on this as well.\n> \n> Thanks beforehand\n\nOnly a handful of quests really require specific decks to be made around them (although you obviously can increase your odds of success by tinkering decks for each quest)\n\nThe quest I'd consider off hand that need specific builds are:\n\njourney to rhosgobel (without healing, no chance)\n\nHills of emin muil (all questing)\n\nShadow and Flame (extreme combat prowess)\n\nBattle for Lake town (same as above)\n\nDruadan Forest (healing, but not as pivotal as JtR IMO)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=946433","commentId":946433,"userName":"Legoland","timestamp":1388961341,"content":"I think optimized decks and allround deck variants are big part of the game and I enjoy both way´s any time.\n\nFirst I try to beat the deck without knowing the encounter deck. Just try to build it as I imagin what could happend (derived of the Quest explanation). After that I optimized the deck until I can beat it somehow. Lastly I play a allround deck and try to beat the whole cycle in a row.\n\n \n\nTo figure out how to defeat a encounter deck is the most exciting for me (little like solving a puzzle :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/95998-best-way-to-play-solo/?do=findComment&comment=948669","commentId":948669,"userName":"Zalrus9","timestamp":1389164430,"content":"Two handed solo means that you can play a lot more themed decks a lot, as I feel that when I try to make a solo deck, I always go back to the old Loragorn-Elrond-Frodo-Spirit Glorfindel mix or somesuch and it makes the game a bit boring. However, some adventures are a lot easier solo, and some are a lot easier with more players. Just mix and match and see what works best for you!"}]}