{"url":"https://community.fantasyflightgames.com/topic/96033-does-the-player-discard-pile-ever-get-shuffled-back-into-the-player-deck/","title":"Does the player discard pile ever get shuffled back into the player deck?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96033-does-the-player-discard-pile-ever-get-shuffled-back-into-the-player-deck/?do=findComment&comment=941988","commentId":941988,"userName":"Smiticus","timestamp":1388508101,"content":"I just started with this game and loving it so far (even though I keep failing the quest haha).  I have a question that I cannot find a direct answer for in the user guide or forums.\n\n \n\nQuestion:\n\nWhat happens when the player deck is empty?  Does the player's discard pile get shuffled into a new player deck?  Or, does the player deck remain empty for the rest of the game?\n\n \n\nThis is a general case question. I know there are some cards that allow a discarded card to be placed back into the deck.\n\n \n\nThe rule book \"implies\" that the player deck remains empty for the rest of the game:  In the Resource phase, if a player has no cards in his deck, then he does not draw. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96033-does-the-player-discard-pile-ever-get-shuffled-back-into-the-player-deck/?do=findComment&comment=942388","commentId":942388,"userName":"GrandSpleen","timestamp":1388561289,"content":"It remains empty.  Pulling cards out of the discard pile is a powerful card effect, and I have heard Will of the West called \"broken\" more than once when you pair it with a deck with lots of card draw.  There is no regular game mechanic to put the players' discards back into their deck, however."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96033-does-the-player-discard-pile-ever-get-shuffled-back-into-the-player-deck/?do=findComment&comment=942825","commentId":942825,"userName":"Smiticus","timestamp":1388620776,"content":"Thank you for the response.  I was hoping for better news, but do want to play the game right.  Hopefully I will get better at the game and not run out of cards before ending the game."}]}