{"url":"https://community.fantasyflightgames.com/topic/96211-traveling-and-progress-tokens/","title":"traveling and progress tokens","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96211-traveling-and-progress-tokens/?do=findComment&comment=943979","commentId":943979,"userName":"georgioos","timestamp":1388740651,"content":"1. when i travel to a location do i transfer progress tokens i already got to thid location?\n\n2. if location need 2 tokens to be explored and i get 5 tokens from the questing phase, what happens to the rest of the tokens. Removing locations removes the additional tokens too or im transfering them to the main quest card"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96211-traveling-and-progress-tokens/?do=findComment&comment=944134","commentId":944134,"userName":"Ileopsoas","timestamp":1388757077,"content":"1. Yes\n\n2.You transfer them to the main quest! The rule says: whenever you get progress tokens, put it on your quest; if you have an active location, you simply have to put tokens on it until the number of tokens matches the quest point on the location, then it is considered explored, and any sparing tokens go on the main quest.\n\nYou only lose progress token when you complete a scene, they don't go on the next scene!\n\nHope this'll help"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96211-traveling-and-progress-tokens/?do=findComment&comment=944144","commentId":944144,"userName":"GrandSpleen","timestamp":1388757706,"content":"Regarding #1, wasn't sure what the question was exactly.  \"Traveling\" means to move the location out of the staging area and making it the active location. No progress tokens are gained or moved as a result of traveling.  Any progress tokens on the current quest card will remain on the quest card.  When you get more progress tokens later, from questing or from other card effects, those tokens will go onto this active location before you are able to place any on the quest card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96211-traveling-and-progress-tokens/?do=findComment&comment=944155","commentId":944155,"userName":"Ileopsoas","timestamp":1388759077,"content":"Edit: 1. I thought you meant tokens already on the LOCATION. Tokens on the quest card DON'T go on the location you travel to!"}]}