{"url":"https://community.fantasyflightgames.com/topic/96218-reading-carachter-and-attacking-sam-gamgee/","title":"Reading carachter and attacking/ Sam Gamgee","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96218-reading-carachter-and-attacking-sam-gamgee/?do=findComment&comment=944131","commentId":944131,"userName":"Ileopsoas","timestamp":1388756644,"content":"Hi to everyone! I've got a doubt: A carachter may attack as many times he gets ready? And if he can he can attack again the same enemy?\n\nI wonder also what happened if your playing with Sam Gamgee and he is ready: does is ability activate the same when you engage a new enemy? And if for example you engage three new enemyes, he gets +3 to his carachteristeic, even if you engage them altogether?\n\nThank for your answers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96218-reading-carachter-and-attacking-sam-gamgee/?do=findComment&comment=944140","commentId":944140,"userName":"GrandSpleen","timestamp":1388757431,"content":"A character can be declared as an attacker as many times as you are able to Ready them.  But you may only declare one attack against one particular enemy in any given round (one attack per enemy, per player).  Sam Gamgee gets +1 for each enemy that you engage that round, meaning each enemy that moves from the staging area to your own space (or from being engaged with another player to your own space).  So if you engage 3 enemies in one round, he will get +3 for that round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96218-reading-carachter-and-attacking-sam-gamgee/?do=findComment&comment=945837","commentId":945837,"userName":"Nerdmeister","timestamp":1388910449,"content":">  And if for example you engage three new enemyes, he gets +3 to his carachteristeic, even if you engage them altogether?\n\nI don´t know if this is your intent, but remember that you can only voluntarily engage one enemy each engagement phase. And since Sam´s ability only activates when you engage an enemy with a higher engagement cost than your threat so having super high threat to engage alot of enemies automatically isn´t really valid.\n\nIf you do have some special tricks that allows you to engage more than once, or the encounter deck plays some tricks on you, that is another matter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96218-reading-carachter-and-attacking-sam-gamgee/?do=findComment&comment=945891","commentId":945891,"userName":"alogos","timestamp":1388920759,"content":"It's hammer (stroke) time !"}]}