{"url":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/","title":"A New Preview!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944552","commentId":944552,"userName":"Gizlivadi","timestamp":1388781005,"content":"Look at this: \n\n \n\nhttp://www.fantasyflightgames.com/edge_news.asp?eidn=4590 [http://www.fantasyflightgames.com/edge_news.asp?eidn=4590]\n\n \n\nWhat do you think?\n\n \n\nDarn, to be honest I'm really questioning the decision to make Grima a hero... But I guess it's still pretty valid. The thing is that while I get Grima wasn't always evil is because in the books ever since we meet him he's evil so it makes me think that Tolkien makes this character evil in his very nature aand thus making the idea a bit too fan-fiction-ish, but I guess if you stretch the imagination is possible. Either way thematically, he's actually a pretty good hero! Reducing the cost of pretty cheap events is great, but it's still and action and not a response, still, it's lore so he works great with Strider. \n\n \n\nNow that I think of it, you could interpret the Grima thing in a completely different way, and think it like a new \"faction\" in the game, like when in Meccg you could play as a fallen wizard, those were the kind of \"heroes\" you could use, so it kiiiinda could be comparable to that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944562","commentId":944562,"userName":"richsabre","timestamp":1388781541,"content":"very nice cards there. yeah, it is an intriguing descision, i really cant remember much about grima as i have read TT far less than fellowship......\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944571","commentId":944571,"userName":"Gizlivadi","timestamp":1388781788,"content":"But I guess that also now you can make Lore Rohan decks, which is nice, and also more Isengard trait!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944591","commentId":944591,"userName":"shoreless","timestamp":1388782831,"content":"Yeah I love anything that expands deck building options in interesting ways and I love that Caleb (and Feonix) take such great care with the theme.\n\n \n\nA+\n\n \n\nHopefully the box itself will deliver."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944592","commentId":944592,"userName":"Karlson","timestamp":1388782917,"content":"Grima as a hero (or villain)... Wow!  I never once thought of that possibility.  However, after reading the article, I really like the idea for a couple reasons.  First of all, this pre-LotR main storyline expansion is perhaps the only time we could conceivably receive Grima as a hero since he does indeed become evil not long afterwards.  Secondly, this game as a whole hopefully has a long life ahead of it; thus, we have plenty of time to see the more prominent characters receive hero status that we have yet to see (or other sphere incarnations of existing heroes.)  Now is the perfect time to put both Grima and Saruman in the card pool.  I have already imagined a thematic White Council deck for Escape from Dol Guldur but that's an altogether different topic.\n\n \n\nSo, overall I am pleasantly surprised at this possibly controversial decision to create a hero version of Grima (before he becomes Wormtongue.)  Likewise, throughout the article I was also thinking of how effective Strider will be now with the increased prevalence of the Doomed trait.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944597","commentId":944597,"userName":"Gizlivadi","timestamp":1388783173,"content":"I'd absolutely like to have hero versions of the wizards, it's just that it'd be really difficult to make them equal or just not better than their Ally counterparts since they're already pretty powerful. But I could perfectly see it. Doesn't have to be something so grand, just could be something simple and yet good, like many heores we have already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944619","commentId":944619,"userName":"Djenni","timestamp":1388784812,"content":"Finally a thematic use for Gleowine haha.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944624","commentId":944624,"userName":"camacazio","timestamp":1388784950,"content":"Awesome, just the hero I was predicting. I love that ability. I don't know if I'll be buying this box though... is anybody else starting to feel like they have enough card pools for infinite deck combinations and quest diversity already at this point?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944627","commentId":944627,"userName":"Djenni","timestamp":1388785039,"content":"> Awesome, just the hero I was predicting. I love that ability. I don't know if I'll be buying this box though... is anybody else starting to feel like they have enough card pools for infinite deck combinations and quest diversity already at this point?\n\nnope, i can't wait to get more cards. I also love the idea of FFG creating new Factions like Isengard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944629","commentId":944629,"userName":"Raven1015","timestamp":1388785100,"content":"I absolutely love this decision. Such a useful ability and he will help open up tons of deckbuilding options. Grima's back story is not fleshed out very well, so there is certainly room for some interpretation there. I'm looking forward to pairing Grima with Master of Lore (and MoL has a real reason to exist again). Come on February!\n\nEdited January 3, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944649","commentId":944649,"userName":"CaptainAce","timestamp":1388786505,"content":"As I posted on VoI discussion forum a doomed theme mono lore deck featuring lore aragorn, grima, and mirlonde using master of lore and the new isengard messenger would definitely be cool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944662","commentId":944662,"userName":"Nickpes","timestamp":1388787095,"content":"Maybe Grima sounds a bit strange, but it was a nice surprise and and interesting ability combined with the cards that are on the preview"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944680","commentId":944680,"userName":"MyNeighbourTrololo","timestamp":1388788306,"content":"I knew it! I told! I friggin told! I CRAVED!\n\nNow the Gollum hero and I am a happy man."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944682","commentId":944682,"userName":"kyrie","timestamp":1388788360,"content":"Lore Aragorn just got even better than ever. This is a perfect solution for Lore decks. It addresses the resource problem while complementing Aragorn and Mirlonde nicely. I'm definitely excited to see Grima hit the table soon!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944709","commentId":944709,"userName":"player1761766","timestamp":1388790236,"content":"Hilarious stuff! I love the crazy decisions we get in this game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944731","commentId":944731,"userName":"danpoage","timestamp":1388791814,"content":"I also really like the decision to include Grima as a hero. He was not always evil, as Caleb mentioned in the article, otherwise Theoden never would have given him a position of power. One of the deeper themes of The Lord of the Rings, and Tolkien's legendarium in general, is the potential for power to corrupt those who hold it.\n\n \n\nJust to add to Ian's point about Master of Lore, Grima's ability is particularly good because it does not say \"to a minimum of 1\". This means that Grima paired with two copies of Master of Lore (easy to draw with Mithrandir's Advice, Daeron's Runes, Gleowine, etc.) can allow you to play cards like Ithilien Archer or Forest Snare for absolutely no cost. Sure the threat raise is an issue over the long term but Strider has a solution for that problem. This card will be great for the metagame and I can't wait to see all of the new decks that will use it.\n\nEdited January 20, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944742","commentId":944742,"userName":"Tracker1","timestamp":1388792344,"content":"Grima seems pretty cool, but deck at least for mono lore is pretty straight forward with the current heroes we have, since Aragorn lore is pretty much a given in the deck. With Mirlonde starting threat is 26, with Pippin 27, Bifur 28, Denethor 29, Bilbo 30 and up from there, so in some ways it is kind of an obvious build for mono lore, but I'm real curious to see him in multi sphere decks.\n\nIt would be cool to play ranger spikes for 1 all on his own in this type of deck. I think including him in a spirit Rohan deck will be great, so you can play Elfhelm for 3, and other allies for 1. Maybe even try to do a tri sphere spirit, lore, tactics Rohan deck. Lots of cool possibilities because his ability is not limited to lore cards. More excited about this card the more I think about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944759","commentId":944759,"userName":"chuckles","timestamp":1388794090,"content":"How cool. Stoked to have a Rohan Lore hero too.\n\n \n\nI had wondered whether they might include Grima as a Hero, he does suit the doomed mechanic.\n\n \n\nNot sure that I want too many Hero's that have doomed effects... but without seeing more cards its hard to know... roll on the new deluxe adventure pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944771","commentId":944771,"userName":"Raven1015","timestamp":1388794814,"content":"Mono Lore Grima will be awesome but Grima with Spirit should also work well. The Galadhrim's Greeting for 2 is not bad at all (net threat reduction of 5)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944776","commentId":944776,"userName":"Dain Ironfoot","timestamp":1388795466,"content":"I think Grima is good, but it's important to remember that \"Whenever Doomed cards are played, EACH player must raise his threat by the value of “X.”\" (emphasis added). So, in solo play, you have no one to piss off. Raising the threat of all your buddies? That could get ugly...especially if they have no threat reduction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944785","commentId":944785,"userName":"chuckles","timestamp":1388796040,"content":"^ Yeah another reason to play S'Glorfindel. Add L'Aragorn, Grima... for 26 threat, 1 x reset and access to lots more threat reduction... then doom your way to victory - lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944797","commentId":944797,"userName":"Glaurung","timestamp":1388797173,"content":"Wow. Grima as a hero…..i like it. Caleb make some new decisions not as a prievious Lotr card games. Cool! Cannot wait for VOI and all new NM cards. this year start very promising."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944814","commentId":944814,"userName":"Bullroarer Took","timestamp":1388798581,"content":"No one has mentioned that the article says, \"You’ll soon be able to write your own untold chapters of The Lord of the Rings when The Voice of Isengard arrives at retailers later this month!\"? That's the best part!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944815","commentId":944815,"userName":"Dain Ironfoot","timestamp":1388798897,"content":"> No one has mentioned that the article says, \"You’ll soon be able to write your own untold chapters of The Lord of the Rings when The Voice of Isengard arrives at retailers later this month!\"? That's the best part!\n\nthat contradicts with the \"upcoming page\" which was changed on 12/27/13 from a Jan street date to a Feb street date; so, it's unclear which is correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944888","commentId":944888,"userName":"Bullroarer Took","timestamp":1388809031,"content":"> > No one has mentioned that the article says, \"You’ll soon be able to write your own untold chapters of The Lord of the Rings when The Voice of Isengard arrives at retailers later this month!\"? That's the best part!\n> \n> that contradicts with the \"upcoming page\" which was changed on 12/27/13 from a Jan street date to a Feb street date; so, it's unclear which is correct.\n\nI'm hoping (but wouldn't bet on it) that the latest info is the most accurate info."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944939","commentId":944939,"userName":"joezim007","timestamp":1388815513,"content":"> Mono Lore Grima will be awesome but Grima with Spirit should also work well. The Galadhrim's Greeting for 2 is not bad at all (net threat reduction of 5).\n\n \n\n\n\n> I think Grima is good, but it's important to remember that \"Whenever Doomed cards are played, EACH player must raise his threat by the value of “X.”\" (emphasis added). So, in solo play, you have no one to piss off. Raising the threat of all your buddies? That could get ugly...especially if they have no threat reduction.\n\nCombine these two posts for an interesting point. Raven's post is only true for 1-player games. In a 4-player game, you cut Galadhrim's Greeting's power in half (lower everyone by 2 after raising everyone by 1) or worse (if you choose to lower 1 player's threat by 6, for a net lowering of 2 threat). Might as well pay the full price of 3 resources for 6-8 threat loss in a 4-player game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944941","commentId":944941,"userName":"Pharmboys2013","timestamp":1388815765,"content":"Well once again FFG has made a fool out of me after I so adamantly projected Haldir has the other hero haha.\n\nWhat a fascinating and intriguing character and oh so fitting ability they picked though! So very excited for this character, I think he'll see play in a variety of different decks...just oozing with potential."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944966","commentId":944966,"userName":"joezim007","timestamp":1388818592,"content":"I find it interesting that after 10 spoiled cards, the 3 Tactics card don't interact with the \"Doomed\" keyword at all, whereas every one of the other 7 cards either dooms you or gains from being doomed.\n\n \n\nWhy doesn't Tactics use the doomed \"tactics\" (horrible pun intended). And where are the Spirit cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=944993","commentId":944993,"userName":"Gizlivadi","timestamp":1388820648,"content":"It's also kinda weird that they made a Grima hero since he seems to be also an objective ally in the Fight at the Fords quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945034","commentId":945034,"userName":"danpoage","timestamp":1388827174,"content":"Having heroes that are also objective allies seems to be a theme lately. They did the same thing with Faramir in the Against the Shadow cycle. As for why Tactics doesn't take advantage of doomed effects, my guess is because the starting threat of its heroes is so high (Merry excepted) and Tactics has no means of threat reduction. Every other sphere has some strategy for threat mitigation (Sneak + Gandalf, Loragorn, etc.) so a heavy Tactics deck is going to be a huge risk in multiplayer. All of the cleverness with Grima and doomed events will cause combat decks some real problems. It goes without saying that The Galadhrim's Greeting and/or Core Set Gandalf will be making an appearance in a lot of these new decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945116","commentId":945116,"userName":"joezim007","timestamp":1388843395,"content":"I don't buy that. Just because Tactics doesn't have a reliable means of threat reduction, doesn't mean squat. Most decks are multi-sphere, so there's no reason it can't be in decks with threat reduction. I'm willing to bet that there is one more tactics card that hasn't been revealed - an event - that has the doomed keyword."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945120","commentId":945120,"userName":"Sprenger","timestamp":1388843722,"content":"The solo player in me really likes these cards but the multiplayer side says this might be too risky. \n\n \n\nFrom a multiplayer aspect, we need to address how to control your partner(s) threat. Each sphere (except Tactics) has some kind of threat reduction like danpoage mentioned above. I think the card Song of Earendil, spirit Attachment that lets you raise your threat so another player can reduce their threat by 1, is a great start to making the use of these new Doomed players cards a really possibility in a 3 or 4 player game.\n\n \n\nDeck building become a little more tighter with the inclusion of the doomed cards. Gandalf becomes a must have in almost every deck. The wandering tooks paired with the Song of Earendil can be an effective way to help the Tactics player keep his threat down if they don't want to splash into spirit. I also agree that the Lore player has to use Loragorn, Spirit Glorfindel and Grima to effectively use the doom cards in a 3 or 4 player game.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945131","commentId":945131,"userName":"JSGosselin","timestamp":1388844751,"content":"I'm not very excited about this hero. Though I'm happy to see a Lore Rohan hero at last, the doomed mechanic is not very appealing to me since I play mainly multiplayer games. Is it me or the doomed keyword is not a very thrilling mechanic for multiplayer games? The fact that each player must pay for the use of an ability played by one is meh imo..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945152","commentId":945152,"userName":"klaymen_sk","timestamp":1388846571,"content":"If only Elfhelm worked against player card effects as well. Then it would pose little to no problems for two player games, but alas. It doesn't, however, exclude a possibility of such a character appearing in game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945166","commentId":945166,"userName":"MyNeighbourTrololo","timestamp":1388848318,"content":"> I'm not very excited about this hero. Though I'm happy to see a Lore Rohan hero at last, the doomed mechanic is not very appealing to me since I play mainly multiplayer games. Is it me or the doomed keyword is not a very thrilling mechanic for multiplayer games? The fact that each player must pay for the use of an ability played by one is meh imo...\n\nHave you seen those doomed cards? All players draw 2 cards, all players add 1 resource to each of their heroes resource pools... Threat is small price to pay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945170","commentId":945170,"userName":"Jekzer","timestamp":1388848550,"content":"As I said on the VoI topic, this a 100% surprise for me, but a pleasing one.\n\n \n\nGríma as a hero can open new strategies to Master of Lore deckbuilding and more importantly, can overcome the problem that could have Lore with things like Dunlending card draw hate, having the opportunity to play multiple cards with 0-1 cost.\n\n \n\nAnd more important for me, it's theme at its finest. With the perils of dark knowledge (doomed X) and with what would become of him if he didn't take the path of darkness.\n\n \n\nThe thing about all this Doomed X keyword (the same goes to Isengard trait) is: if that's a mechanic (and a trait) that we'll be seeing on the new cycle, that'd be helpful to enhance the variety of new decks. But if it's only in VoI..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945201","commentId":945201,"userName":"CardgamedoAnel","timestamp":1388850711,"content":"Grima + Song of Earendil + Loragorn = nothing more to say about doomed cards on multiplayer games.\n\n \n\nI loved VOI and expect to pick a copy as soon as possible, cant wait for the thematic Isengard on the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945209","commentId":945209,"userName":"Angus Lee","timestamp":1388851256,"content":"No one mention that his stats (2,1,2,3) does not add up to his threat cost (9)?  Is his \"limit once per round\" ability so good to warrant this penalty?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945218","commentId":945218,"userName":"MyNeighbourTrololo","timestamp":1388851741,"content":"> No one mention that his stats (2,1,2,3) does not add up to his threat cost (9)?  Is his \"limit once per round\" ability so good to warrant this penalty?\n\nIt's like having 4 heroes resource-vise. And one of them has like every resource icon. There is also a key neutral card which grants resource to its owner once per turn when doomed keyword triggers. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945233","commentId":945233,"userName":"JSGosselin","timestamp":1388852801,"content":">  \n> \n> > I'm not very excited about this hero. Though I'm happy to see a Lore Rohan hero at last, the doomed mechanic is not very appealing to me since I play mainly multiplayer games. Is it me or the doomed keyword is not a very thrilling mechanic for multiplayer games? The fact that each player must pay for the use of an ability played by one is meh imo...\n> \n> Have you seen those doomed cards? All players draw 2 cards, all players add 1 resource to each of their heroes resource pools... Threat is small price to pay.\n> \n>  \n\n \n\nI have to agree that regarding these cards, since the effect gives a benefit to every player in the game, it scales pretty well and the doomed mechanic is interesting.\n\n \n\nIn the case of Grima however, the more players there is in the game, the less interesting his ability become I think, unless the other players also build around the doomed keyword. I will probably play him regardless since I really want to play a Rohan spirit - lore deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945235","commentId":945235,"userName":"Scroll Lock","timestamp":1388853014,"content":"isengard looks like a serious faction, unexpected for me. I like the connection between Isengard and Doomed mechanic.\n\nGrima- what a surprise. His threat cost is higher than total stats and I understand it. What a combo with Keys of Orthanc and also Orthanc guard just became awesome.\n\nI also expect card that allows you to play Doomed events from any sphere (grima would be allowed to play ANY event then).\n\nAnd as always, sorry for my poor English."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945423","commentId":945423,"userName":"legolas18","timestamp":1388865784,"content":"Oh yeah. I didn't even think about Keys of Orthanc. Great combo. I'm very excited about this expansion. I can't wait to make a Theoden/Hama/Eomer deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945441","commentId":945441,"userName":"Gizlivadi","timestamp":1388867414,"content":"Keys of Orthanc with Grima is insane! And really thematic as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945520","commentId":945520,"userName":"Scroll Lock","timestamp":1388873877,"content":"What do you think about that Orthanc Messenger? I quite like that he is lore, (lore looks like main sphere for Isengard), but I think he is only good in massive Doomed deck or with Grima. If you use Doomed every turn, he is nice and if... No you cant play 2 doomed cards every turn.\n\nBut the best thing about him is, that you can boost his Willpower by 2 when you know if you need it.\n\nSorry for my bad English."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945536","commentId":945536,"userName":"Scroll Lock","timestamp":1388874808,"content":"And Orthanc Messenger is awesome with more copies on the table.\n\nI am starting to really like this new faction and mechanic :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945640","commentId":945640,"userName":"leptokurt","timestamp":1388882735,"content":"I like the mechanics of our new \"hero\" and I'm certainly going to try a Theodred-Grima secrecy deck, but...\n\n \n\nI already had a hard time to accept that we got an evil objective ally which really makes replaying every scenario including Alcaron as an ally an uncomfortable task to me. And now I shall have a hero that is going to mindrape the Rohan king? And I am kind of helping him? :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png] :o :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945658","commentId":945658,"userName":"GrandSpleen","timestamp":1388884420,"content":"Heh heh, no mean streak in you, Mr. Leptokurt?  Maybe Grima helps the heroes for his own reasons, and you can satisfy your clandestine desire to scheme and rub your hands together while others are not looking...\n\n \n\nI love Grima as a hero, pretty excited about this.  I play tactics so often, though, that I do see it being a bit of a problem.  But Loragorn + Desperate Alliance is looking all the more attractive now for a Spirit/Lore deck with Grima and Aragorn teamed with a tactics deck.  I also like that Grima's ability is not limited to Lore cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945676","commentId":945676,"userName":"MyNeighbourTrololo","timestamp":1388886282,"content":"> I like the mechanics of our new \"hero\" and I'm certainly going to try a Theodred-Grima secrecy deck, but...\n> \n>  \n> \n> I already had a hard time to accept that we got an evil objective ally which really makes replaying every scenario including Alcaron as an ally an uncomfortable task to me. And now I shall have a hero that is going to mindrape the Rohan king? And I am kind of helping him? :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png] :o :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n\nGrima is not \"bad\" by himself. He is corrupted by Saruman. And he wasn't like that all the time. Like designer said, he didn't got promoted to his position by giving the bad advice. He just lacked willpower to resist. He was just a human caught in a bad circumstances, and would it be otherwise - he would prove extremely helpful to Rohan and stuff. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945696","commentId":945696,"userName":"Pharmboys2013","timestamp":1388889890,"content":"> Keys of Orthanc with Grima is insane! And really thematic as well\n\nKeys of orthanic has to be a x3 when running Grima. 2 resources for 1 threat is crazy good. I mean, just think of a tri sphere deck with Grima, and being able to play a 3 cost card each turn with one of your heroes (1 from that turn's resource phase, essentially 1 from Grima's ability, and 1 from keys to whomever the attached hero is). The deck possibilities are so crazy it'll be interesting to see what the most effective build with him will be"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945699","commentId":945699,"userName":"joezim007","timestamp":1388890048,"content":"Grima + Campfire Tales = Deep Knowledge at -1 to both amount of threat gained and number of cards drawn. Might bring Campfire Tales out of more binders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945703","commentId":945703,"userName":"Pharmboys2013","timestamp":1388890487,"content":"> Grima + Campfire Tales = Deep Knowledge at -1 to both amount of threat gained and number of cards drawn. Might bring Campfire Tales out of more binders.\n\nInteresting thought, probably more practical the more players there are as for solo a 1 time event to draw one card even if it's free is probably not worth the space; would rather put in a different card that I would have hoped to draw instead. Possible side board replacement or something like that if the number of people you play with varies a lot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945771","commentId":945771,"userName":"Nickpes","timestamp":1388898823,"content":"keys of orthanc, grima, loragorn and the new isenguard cards .... it seems we have another new combo to play with"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945802","commentId":945802,"userName":"GrandSpleen","timestamp":1388905278,"content":"Regarding Grima and Saruman art... is this the first time we have seen box cover art used on actual cards?  Unless I'm mistaken, deluxe sets have always had unique art, although the APs use card art."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=945819","commentId":945819,"userName":"Karlson","timestamp":1388908487,"content":"> Regarding Grima and Saruman art... is this the first time we have seen box cover art used on actual cards?  Unless I'm mistaken, deluxe sets have always had unique art, although the APs use card art.\n\nHmm, I think many of the deluxe expansions do have their art on the cards as well, but restricted just to quest or encounter cards and no player cards.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946009","commentId":946009,"userName":"leptokurt","timestamp":1388934000,"content":">  \n> \n> > I like the mechanics of our new \"hero\" and I'm certainly going to try a Theodred-Grima secrecy deck, but...\n> > \n> >  \n> > \n> > I already had a hard time to accept that we got an evil objective ally which really makes replaying every scenario including Alcaron as an ally an uncomfortable task to me. And now I shall have a hero that is going to mindrape the Rohan king? And I am kind of helping him? :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png] :o :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n> \n> Grima is not \"bad\" by himself. He is corrupted by Saruman. And he wasn't like that all the time. Like designer said, he didn't got promoted to his position by giving the bad advice. He just lacked willpower to resist. He was just a human caught in a bad circumstances, and would it be otherwise - he would prove extremely helpful to Rohan and stuff. \n> \n>  \n\nWell, I don't buy this \"just a human caught in bad circumstances\" excuse.\n\n \n\nAnyway, my solution for dealing with Grima and my conscienc is that I'm going to \"accidently\" let through one enemy attack undefended just before I finish the scenario. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n\nEdited January 5, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946011","commentId":946011,"userName":"MyNeighbourTrololo","timestamp":1388934103,"content":">  \n> \n> >  \n> > \n> > > I like the mechanics of our new \"hero\" and I'm certainly going to try a Theodred-Grima secrecy deck, but...\n> > > \n> > >  \n> > > \n> > > I already had a hard time to accept that we got an evil objective ally which really makes replaying every scenario including Alcaron as an ally an uncomfortable task to me. And now I shall have a hero that is going to mindrape the Rohan king? And I am kind of helping him? :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png] :o :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n> > \n> > Grima is not \"bad\" by himself. He is corrupted by Saruman. And he wasn't like that all the time. Like designer said, he didn't got promoted to his position by giving the bad advice. He just lacked willpower to resist. He was just a human caught in a bad circumstances, and would it be otherwise - he would prove extremely helpful to Rohan and stuff. \n> > \n> >  \n> \n> Well, I don't buy this \"just a human caught in bad circumstances\" excuse.\n> \n>  \n> \n> Anyway, my solution for dealing with Grima and my conscienc is that I'm going to \"accidently\" let through one enemy attack undefended just before I finish the scenario. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n> \n>  \n\nI care not of what you buy and what you don't buy. It's not an excuse, it's how things are if you follow the origins. Isildur got his mind twisted by simple holding the ring for few moments, and who is Grima compared to him? And Grima have been under the influence of the Saruman far too long.\n\nEdited January 5, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946060","commentId":946060,"userName":"Gizlivadi","timestamp":1388938762,"content":"The problem I have with the Grima hero is that, from an author's perspective, the whole point of the character was to turn evil and remain evil afterwards. He's even physically described as \"evil\" (typical of classic epics), he's short, ugly, pale, creepy, etc. We know that he wasn't always evil, but we always see him as such, and thus there's just nothing to base this hero on or something we can draw inspiration from. We know nothing about him before he allied with Saruman and he's just irrelevant at that point in the story. There's just no real justification. It's like having a Bill Ferny hero card. Sure, he wasn't ALWAYS evil, but it's just pointless to make a hero card of him. The character's whole purpose was to turn to evil. Plus, be sure that we will see Grima enemy cards and objective cards (we already do), so that only creates confusion and incompatibility.\n\nEdited January 5, 2014 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946121","commentId":946121,"userName":"MyNeighbourTrololo","timestamp":1388943027,"content":"> The problem I have with the Grima hero is that, from an author's perspective, the whole point of the character was to turn evil and remain evil afterwards. He's even physically described as \"evil\" (typical of classic epics), he's short, ugly, pale, creepy, etc. We know that he wasn't always evil, but we always see him as such, and thus there's just nothing to base this hero on or something we can draw inspiration from. We know nothing about him before he allied with Saruman and he's just irrelevant at that point in the story. There's just no real justification. It's like having a Bill Ferny hero card. Sure, he wasn't ALWAYS evil, but it's just pointless to make a hero card of him. The character's whole purpose was to turn to evil. Plus, be sure that we will see Grima enemy cards and objective cards (we already do), so that only creates confusion and incompatibility.\n\nGrima was King's Counsellor. Ofc he was irrelevant before his corruption, lol. You can start making sense any time now. \n\n \n\nAlso, I draw a lot of inspiration from redemption, and Grima is filled with redemption theme. Turning back to light, to his people. It didn't happened in the books, but in LotR LCG a lot of thing that didn't happened in the books happens. Characters with inner struggle are those who invoke most of the sympathy, not the bold straightforward good guys in shining armor, which LotR is filled with as protagonist. It's good to have someone with hard fate at my side."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946182","commentId":946182,"userName":"Gizlivadi","timestamp":1388946634,"content":"Wow, and I had thought that rudeness in these forums had died. \n\n \n\nOf course he wasn't irrelevant in Rohan. But he was pretty irrelevant in the big picture at this point. None of his deeds were recorded or remembered. Anyway, i don't dislike the Grima hero, I think he can be thematic when you think speculatively, but still a little counter-intuitive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946190","commentId":946190,"userName":"Dain Ironfoot","timestamp":1388947509,"content":"The timeline of the game has been pre-LOTR since the beginning (as stated in an early, early article that I'm too lazy to look up!). As such, I have no problem with Grima as a hero. Honestly, I'd not have a problem even if this was the LOTR timelime.\n\n \n\nIt opens up design space, creates interesting, different kinds of heroes, and is just plain fun. This is a game, after all.\n\n \n\nI hope to see \"different\" sorts of heroes in the future, as well. Whether it's an Ent, Eagle, or Istari hero - something we've not seen before but would be really cool. I'm not as well versed in the lore as many of you here, but I'm sure there are other cool \"bad\" guys that we could stretch our imaginations a bit and have fun with as a hero!\n\n \n\nThe designers of this game have changed 3 times. They aren't beholden to what's been done in the past - though, some seem to think they are (there was a discussion about deluxe boxes only having 1 neutral card earlier, since the other two deluxe boxes did. that doesn't always have to be the case and we shouldn't assume that it will always be that way).\n\nEither way, I'm really excited about this cycle, more than I ever was for HoN! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited January 5, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946191","commentId":946191,"userName":"MyNeighbourTrololo","timestamp":1388947526,"content":"Theoden was a good king partly because Grima was a good counsellor. Rohan exists in it's state not because Grima did nothing for it in his lighers yers. Pretty big picture to me. There are less relevant for big picture characters amongst the lotr lcg heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946251","commentId":946251,"userName":"Style75","timestamp":1388950521,"content":"Regardless of whether or not I will play Grima, I salute the designers (Caleb and Matt) for making such a flavorful card. Everything we've seen so far from VoI is full of story and based on what they did with Black Riders, I expect this cycle to be a story focused flavor homerun. Mechanically, who knows? But the choice of Grima as hero fills me with confidence that the designers are going to shake things up a bit which I think is a good thing. It would be easy for them to keep churning out scenarios and player cards that are basically re-flavored copies of what we've already got, but it's clear they don't want to do that. I'm really excited about this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946302","commentId":946302,"userName":"Dain Ironfoot","timestamp":1388953224,"content":"> Regardless of whether or not I will play Grima, I salute the designers (Caleb and Matt) for making such a flavorful card. Everything we've seen so far from VoI is full of story and based on what they did with Black Riders, I expect this cycle to be a story focused flavor homerun. Mechanically, who knows? But the choice of Grima as hero fills me with confidence that the designers are going to shake things up a bit which I think is a good thing. It would be easy for them to keep churning out scenarios and player cards that are basically re-flavored copies of what we've already got, but it's clear they don't want to do that. I'm really excited about this cycle.\n\nhear, hear!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946470","commentId":946470,"userName":"GrandSpleen","timestamp":1388962941,"content":"> We know that he wasn't always evil, but we always see him as such,\n\n \n\nCouldn't you make the same argument for Denethor?  A lot of people seem to like him, even though by the time we meet him in the books he is pretty much at wit's end and making bad decisions for his kindgom.  We know he wasn't always so, and for many people *that* is the \"true\" Denethor, the noble steward of Gondor, rather than the character who is depicted in the Lord of the Rings narrative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946539","commentId":946539,"userName":"Gizlivadi","timestamp":1388968438,"content":">  \n> \n> > We know that he wasn't always evil, but we always see him as such,\n> \n>  \n> \n> Couldn't you make the same argument for Denethor?  A lot of people seem to like him, even though by the time we meet him in the books he is pretty much at wit's end and making bad decisions for his kindgom.  We know he wasn't always so, and for many people *that* is the \"true\" Denethor, the noble steward of Gondor, rather than the character who is depicted in the Lord of the Rings narrative.\n> \n>  \n\n \n\nExcept that Denethor we saw being good. Plus we know his deeds and efforts to defend Gondor. He has a reputation that we can actually justify. We know pretty much nothing about Grima except that he was chief counselor, which is not completely irrelevant, but it's nothing that Tolkien cared enough to explain. Any \"good\" version of Grima is almost entirely based on speculation, which is fine (i'd like to see Alatar and Pallano as well, and that'd be pure speculation), but again, it's like Bill Ferny. Its not that we know so little about him or his past, it's the fact that everything we know for sure about him is how evil he becomes, so that makes Grima a bit weird, there's no real purpose in making him a hero IMO.\n\n \n\nThat said, I still like him and I think he can be really thematic. This is just my initial impression. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946573","commentId":946573,"userName":"Glowwyrm","timestamp":1388971280,"content":"A big part of the theme and fun of this game is that you are creating your own adventures in the LOTR universe.  Having a hero like Grima only adds to the idea that you are writing your own stories and blazing new territory.  A hero like Grima gives me hope for alternate ring-bearers, something I liked in the Decipher game and hope to see here too. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946717","commentId":946717,"userName":"Glaurung","timestamp":1388988188,"content":"> A big part of the theme and fun of this game is that you are creating your own adventures in the LOTR universe.  Having a hero like Grima only adds to the idea that you are writing your own stories and blazing new territory.  A hero like Grima gives me hope for alternate ring-bearers, something I liked in the Decipher game and hope to see here too. \n\n \n\n> A big part of the theme and fun of this game is that you are creating your own adventures in the LOTR universe.  Having a hero like Grima only adds to the idea that you are writing your own stories and blazing new territory.  A hero like Grima gives me hope for alternate ring-bearers, something I liked in the Decipher game and hope to see here too. \n\nYes that what i like about this game is alternative story… We play so many times story of Frodo in other games (Decipher game a good example)  is boring to play it again . That Why i love Lotr lcv. Alternative ring-Bearer we will have in saga for sure. I believe fellowship sphere from saga expansion will bring a lot of alternative ring bearer. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946813","commentId":946813,"userName":"Scroll Lock","timestamp":1389001703,"content":"If you do not like Grima, do not use him- problem solved.\n\nI will play him for sure, always trying to make an alternative story- that is the best thing about LOTR LCG- there are many cards and you only use those cards you want.\n\nI hope so much we will get a scenario of guarding Isengard. If Saruman made alliance with Rohan and Gondor, Mordor would mostly attack Isengard for sure.\n\nAww, thank you Caleb for this new faction, it is awesome :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946837","commentId":946837,"userName":"leptokurt","timestamp":1389004102,"content":"No matter how we alternate the story - Grima is going to end up as the bad guy. VoI tells a story that is set before LOTR that is unrelated to what is going to happen. Nothing a player does here is going to change anything that happensin the books (ok, if you don't catch Gollum or you let Frodo die, infact it does - but that is not the kind of story one wants to tell their grandchildren). Only if you play Black Riders, you can influence the story of LOTR\n\n \n\nLike I said, I'm certainly going to use Grima, but I wished they would have made a real hero (Erkenbrand!) instead. Grima could have been used as an ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=946866","commentId":946866,"userName":"Scroll Lock","timestamp":1389010492,"content":"To Leptokurt: DONT BE AFRAID! WE WILL SEE ERKENBRAND! HE MUST BE IN THIS CYCLE!\n\nI hope he will be in the 1st AP of the Ring-Maker (but he won't be as we will probably see spirit hero).\n\nBut honestly, I am bored with heroes like Beregond or spirit Glorfindel. For me ability is more important and much more enjoyable than stats. I hope Erkenbrand/Gamling and another awesome characters wont be new Glorfindels, but new Grímas (not in meaning of traitor)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=947079","commentId":947079,"userName":"camacazio","timestamp":1389031732,"content":"I look forward to making a Rohan deck using Eowyn and Grima and titling it \"star-crossed lovers\"\n\n \n\nMan, just look at Grima's hair; that male pattern baldness just exudes his limitless manliness and testosterone. A true symbol of Rohan's strength and valor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=947123","commentId":947123,"userName":"JSGosselin","timestamp":1389034565,"content":"I'm personally ok with the idea of Grima as a hero since I don't care too much if there is some inconsistencies between the game and the LOTR lore. In the end, it remains a card game. I do understand though the people that find the idea a little bit too far stretched.\n\n \n\nOne thing I would have like however, is to see an artwork that would have represented a younger Grima with a more heroic stature. I find that he really looks like the villain he is meant to become on the current artwork of the card. But in the end, it is not a big deal. Like I said, I will still play him, even though his ability will require a little bit more coordination with the other players I play with than I'm used too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=947142","commentId":947142,"userName":"Scroll Lock","timestamp":1389036339,"content":"Everytime i see Grímas artwork, I MUST look at that place without hair (I do not know how to call it).\n\nAm I the only one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=947803","commentId":947803,"userName":"faith_star83","timestamp":1389097277,"content":"I personally was surprised to see Grima, but I think it is a very intriguing and thus good choice :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I really like how Caleb actually admits that he reckons not all the fans being to happy about this decision, but still decided to go through with it. I believe the game is in the right hands when it comes to flavour at least.\n\n \n\nAlso I do like Grima's ability very much, although I have not made my mind up concerning the Doom mechanic. It seems to bear some inherent danger of corrupting the game balance between Solo and Multi play. As has been mentioned before, in a multiplayer session it might be quite dangerous to make too much use of the doom cards, whereas in a well-built solo deck it might mean having access to overly cheap but powerful cards.\n\n \n\nEven so, I am looking forward very much to this cycle and the first Deluxe Expansion to kick things off and test & experience the new mechanics :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=947979","commentId":947979,"userName":"Mndela","timestamp":1389113104,"content":"I prefer Master of Lore than Grima. The only diference is  to pay 3 resources instead increase 3 threat level, and with Master of Lore you loss 1 card from hand (himselve) instead hability of other hero.\n\n \n\nWhat do you prefer to loss?:\n\na. 3 resources and 1 card (Master of Lore option)\n\nb. 3 threat level points and 1 hero's hability (Grima option)\n\n \n\n....\n\n \n\nGrima's option is good after 3 rounds: in 3 rounds Master of Lore recover his resources but also you raise 3 threat level points (3 rounds, of course)..., so Grima is better, but anyway: 3 resources is better than the other 1 hero's hability?\n\nEdited January 7, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948165","commentId":948165,"userName":"GrandSpleen","timestamp":1389123120,"content":"> I prefer Master of Lore than Grima.\n\n \n\nI would include them both in the same deck!  This is a really great card combo for a sphere that lacks resource generation.\n\n \n\nAlso, am I the only one who is sad that Elfhelm's [http://hallofbeorn.com/Cards/Details/51223bd0-ffd1-11df-a976-0801205c9005] ability will not be able to offset Doomed player cards? :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948173","commentId":948173,"userName":"Style75","timestamp":1389123740,"content":"GrandSpleen, I think that allowing Elfhelm to counter Grima's effect would be too powerful. Especially because spirit has so many ways to get allies back into play.\n\n \n\nNow that I think about it.... the wording on Elfhelm's card is very specific in that it does not pertain to player card effects. This makes me wonder if the design team had been considering doomed player cards for a long time prior to the Voice of Isengard, as far back as the mirkwood cycle. Curious, I'd like to hear something from Caleb or Matt about this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948183","commentId":948183,"userName":"Scroll Lock","timestamp":1389124167,"content":"> I prefer Master of Lore than Grima. The only diference is  to pay 3 resources instead increase 3 threat level, and with Master of Lore you loss 1 card from hand (himselve) instead hability of other hero.\n> \n> Grima's option is good after 3 rounds: in 3 rounds Master of Lore recover his resources but also you raise 3 threat level points (3 rounds, of course)..., so Grima is better, but anyway: 3 resources is better than the other 1 hero's hability?\n\n \n\nMain difference is, that you have Gríma since the beggining of the game. Having Master of Lore in your opening hand is not clear fact. \n\nBest solution: include both and play master of lore for 2 with Grímas ability :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948240","commentId":948240,"userName":"gokubb","timestamp":1389126864,"content":"Its a shame they didn't think about Grima's ability before cards like 'Thicket of Spears'. It would be cool if another benefit was you could play cards that are usually only usable in a mono-color deck, now in dual color. Would have made for more interesting combos."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948259","commentId":948259,"userName":"JSGosselin","timestamp":1389128184,"content":"> Now that I think about it.... the wording on Elfhelm's card is very specific in that it does not pertain to player card effects. This makes me wonder if the design team had been considering doomed player cards for a long time prior to the Voice of Isengard, as far back as the mirkwood cycle. Curious, I'd like to hear something from Caleb or Matt about this.\n\n \n\nI think that even before the doomed mechanic, Elfhelm ability could have been abused with cards like Song of Earendil and Wandering Took.\n\nEdited January 7, 2014 by JSGosselin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948269","commentId":948269,"userName":"JSGosselin","timestamp":1389128915,"content":">  \n> \n> > I prefer Master of Lore than Grima. The only diference is  to pay 3 resources instead increase 3 threat level, and with Master of Lore you loss 1 card from hand (himselve) instead hability of other hero.\n> > \n> > Grima's option is good after 3 rounds: in 3 rounds Master of Lore recover his resources but also you raise 3 threat level points (3 rounds, of course)..., so Grima is better, but anyway: 3 resources is better than the other 1 hero's hability?\n> \n>  \n> \n> Main difference is, that you have Gríma since the beggining of the game. Having Master of Lore in your opening hand is not clear fact. \n> \n> Best solution: include both and play master of lore for 2 with Grímas ability :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n>  \n\n \n\nThere is also the fact that with Grima, you can trigger the doomed keyword almost once a turn almost at will. I believe that Grima's ability has the potential to have a high level of synergy with other cards from this cycle (like it has been highlighted by the designers), while Master of Lore's benefit is more straightforward."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948303","commentId":948303,"userName":"Dain Ironfoot","timestamp":1389130862,"content":"> Now that I think about it.... the wording on Elfhelm's card is very specific in that it does not pertain to player card effects. This makes me wonder if the design team had been considering doomed player cards for a long time prior to the Voice of Isengard, as far back as the mirkwood cycle. Curious, I'd like to hear something from Caleb or Matt about this.\n\nthis seems doubtful, to me. seeing as how there have been 3 lead designers now (nate, lucas, caleb) and mirkwood was designed long before caleb was on board.\n\n \n\nwhat's more likely is that the designer of Elfhelm was just very careful to be specific, as many card game designers are, to allow as much open, future design space as possible.\n\n \n\nVoice of Isenguard is the first deluxe box and cycle that Caleb has been with from start to finish - even though he's done the saga boxes. these sets are in development loooong before they ever come out.\n\n \n\neither way, the doomed mechanic should certainly prove interesting!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948409","commentId":948409,"userName":"camacazio","timestamp":1389137000,"content":"On that note, it seemed clear to me that Elfhelm's wording had Frodo in mind, from just a couple packs earlier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=948916","commentId":948916,"userName":"Noccus","timestamp":1389194900,"content":"> I'm personally ok with the idea of Grima as a hero since I don't care too much if there is some inconsistencies between the game and the LOTR lore. In the end, it remains a card game. I do understand though the people that find the idea a little bit too far stretched.\n> \n>  \n> \n> One thing I would have like however, is to see an artwork that would have represented a younger Grima with a more heroic stature. I find that he really looks like the villain he is meant to become on the current artwork of the card. But in the end, it is not a big deal. Like I said, I will still play him, even though his ability will require a little bit more coordination with the other players I play with than I'm used too.\n\n \n\nThis is exactly how I feel. Specially about the art part.\n\n \n\nI willalso add here that he is a great addition to the lore sphere in single player. No doubts there.\n\nThe true challange however for me as a multi-player guy is getting my mates to say when I put down my heroes:\n\n\"You're playing Grima? Yay!\"\n\nThat's going to be difficult. Song of earendil might be able to help out here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=949006","commentId":949006,"userName":"JSGosselin","timestamp":1389201266,"content":"> I willalso add here that he is a great addition to the lore sphere in single player. No doubts there.\n> \n> The true challange however for me as a multi-player guy is getting my mates to say when I put down my heroes:\n> \n> \"You're playing Grima? Yay!\"\n> \n> That's going to be difficult. Song of earendil might be able to help out here.\n\n \n\nThis is exactly why I'm not overly excited about this hero. Unless my friends willingly build their deck around the doomed keyword, I bet they won't be very happy to see Grima as one of my hero. I don't want to impose them to build their deck around Grima either...from the games I've played multiplayer (3 players), I find it always less fun and rewarding when your deck is built around the hero of another player.\n\n \n\nSong of Earendil sure helps, but then it would be a 3 threat increase each time I would use Grima's ability. In the end, I think I will use Grima's ability in multiplayer games only in last resort, to play cards in emergency situation, that I wouldn't have been able to play because of lack of resources. Not bad after all, but not that much exciting hehe. For solo play however, this is an awesome hero, I agree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=949033","commentId":949033,"userName":"Thanatopsis","timestamp":1389203364,"content":"> This is exactly how I feel. Specially about the art part.\n> \n>  \n> \n> I willalso add here that he is a great addition to the lore sphere in single player. No doubts there.\n> \n> The true challange however for me as a multi-player guy is getting my mates to say when I put down my heroes:\n> \n> \"You're playing Grima? Yay!\"\n> \n> That's going to be difficult. Song of earendil might be able to help out here.\n> \n>  \n\n \n\nFor me, this situation is akin to a Leadership player that is selfish and does not know how to share their wealth of resources.  People get pissed at that guy. If they have the privilege of playing Steward of Gondor they had better do their part to help me get my tactics cards into play!  That way they don't lose their heroes in the first round of combat :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nThe same goes for Grima.  I certainly hope a Lore player does not abuse this card's ability and use it only for their own benefit (however thematic that may sound).  A good Lore player, using Grima, would use it to play radagast's cunning, to nullify a 6 threat enemy in the staging area.  Sure everyone's threat just went up by 1 , but it was about to go up by more if the team had quested unsuccessfully.\n\n \n\nBasically, the challenge will be to put cards in your deck that offer more global benefit to the team than detriment and then try your best to limit Grima's use to those cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=950666","commentId":950666,"userName":"Noccus","timestamp":1389352228,"content":"> For me, this situation is akin to a Leadership player that is selfish and does not know how to share their wealth of resources.  People get pissed at that guy. If they have the privilege of playing Steward of Gondor they had better do their part to help me get my tactics cards into play!  That way they don't lose their heroes in the first round of combat :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> The same goes for Grima.  I certainly hope a Lore player does not abuse this card's ability and use it only for their own benefit (however thematic that may sound).  A good Lore player, using Grima, would use it to play radagast's cunning, to nullify a 6 threat enemy in the staging area.  Sure everyone's threat just went up by 1 , but it was about to go up by more if the team had quested unsuccessfully.\n> \n>  \n> \n> Basically, the challenge will be to put cards in your deck that offer more global benefit to the team than detriment and then try your best to limit Grima's use to those cards. \n> \n>  \n\n \n\nI like your thinking!\n\n \n\nThe example you give is rather like the one in the preview where Grima was spoiled, but as you put it, it did change my reasoning on using him in a multiplayer game. In a pinch, you can play any sphere's 1 cost event, even when you're totally out of resources. Test of will comes to mind first of course. Every player \"paying\" 1 threat is no cost compared to the effects of a devastating treachery. Then with Keys of Orthanc on him you can even nick a resource in the process :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI'm warming up to Grima here!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=950840","commentId":950840,"userName":"joezim007","timestamp":1389368940,"content":"> I like your thinking!\n> \n>  \n> \n> The example you give is rather like the one in the preview where Grima was spoiled, but as you put it, it did change my reasoning on using him in a multiplayer game. In a pinch, you can play any sphere's 1 cost event, even when you're totally out of resources. Test of will comes to mind first of course. Every player \"paying\" 1 threat is no cost compared to the effects of a devastating treachery. Then with Keys of Orthanc on him you can even nick a resource in the process :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> I'm warming up to Grima here!\n\n\n\nThe interesting thing about using Grima for playing Response cards is that you have to activate his ability before the encounter cards are revealed, otherwise you won't have the opportunity to activate his action before you play the response card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=950847","commentId":950847,"userName":"Thanatopsis","timestamp":1389369292,"content":"> The interesting thing about using Grima for playing Response cards is that you have to activate his ability before the encounter cards are revealed, otherwise you won't have the opportunity to activate his action before you play the response card.\n> \n>  \n\n \n\nThat could a team in a very interesting position.\n\n\"Hey guys, I have a Test of Will in my hand, but I'm out of spirit resources.  Should I use Grima's action just in case we need to cancel that one really bad treachery?\"\n\n \n\nHow often would you raise your threat to do this with a there being a good chance that you won't actually play a card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=950988","commentId":950988,"userName":"Narsil0420","timestamp":1389376552,"content":"Well you could trigger his ability and NOT end up playing any cards. You wouldn't suffer any threat raise because the Doomed X won't trigger until you play the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=951033","commentId":951033,"userName":"Bullroarer Took","timestamp":1389378796,"content":">  \n> \n> That could a team in a very interesting position.\n> \n> \"Hey guys, I have a Test of Will in my hand, but I'm out of spirit resources.  Should I use Grima's action just in case we need to cancel that one really bad treachery?\"\n> \n>  \n> \n> How often would you raise your threat to do this with a there being a good chance that you won't actually play a card?\n\nIronically, asking that question is against the rules as written."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=951038","commentId":951038,"userName":"Raven1015","timestamp":1389379017,"content":"Well, one reason why I think the table talk rules are kind of silly is because you can rephrase the question as:\n\n \n\n\"Hey guys, I'm able to cancel a treachery, but I'm out of spirit resources.  Should I use Grima's action just in case we need to cancel that one really bad treachery?\"\n\n \n\nand be within the rules. Might as well just say A Test of Will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=951064","commentId":951064,"userName":"Bullroarer Took","timestamp":1389379953,"content":"Oh I completely agree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=951169","commentId":951169,"userName":"joezim007","timestamp":1389385142,"content":"> Well you could trigger his ability and NOT end up playing any cards. You wouldn't suffer any threat raise because the Doomed X won't trigger until you play the card.\n\n \n\nAbsolutely. His ability adds the Doomed keyword to the card you're going to play, so it only happens if you play the card.\n\n \n\nHere's a little food for thought: You are out of spirit resources and prime Grima's ability before staging just in case you need to play A Test of Will. You end up not needing to use A Test of Will and then you get through combat and are able to use Foe-Hammer. Oops, Grima's ability just raised your threat without giving you any benefit because the next card already costed 0. I don't see it happening much if at all, but it's interesting thinking about it.\n\n \n\nI was also realizing that Grima can be used in tri-sphere decks \"easily\" because his ability essentially gives you 1 resource of any type if you're able to soak up the threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=951200","commentId":951200,"userName":"Thanatopsis","timestamp":1389387327,"content":">  \n> \n> Oops, Grima's ability just raised your threat without giving you any benefit because the next card already costed 0. I don't see it happening much if at all, but it's interesting thinking about it.\n\nBrilliant!\n\n \n\nThe look on the other players' faces would be worth it! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIt reminds me of something Brandon (from CotR) would do: use the ability, and then always play a zero cost card immediately after."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=951946","commentId":951946,"userName":"Scroll Lock","timestamp":1389473205,"content":"We have not seen any spirit card- my favourite sphere :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nI have tiny hope, they are building Ent faction in spirit :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nWhat do you think?\n\nEdited January 11, 2014 by Scroll Lock"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=952023","commentId":952023,"userName":"Bullroarer Took","timestamp":1389480296,"content":"I see Ents more in Lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=952035","commentId":952035,"userName":"Gizlivadi","timestamp":1389481039,"content":"Agree. Ents are (at least initially) too reluctant to be Spirit. I really wonder what Spirit cards we'll be seeing in VoI, but I wouldn't get my hopes too high. Probably Rohan allies, or elven allies like the one shown in the VoI minisite."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=952044","commentId":952044,"userName":"Mndela","timestamp":1389481444,"content":"I see ents in lore. Ents make fear, not willpower, they are unknown..., secrecy knowledge. So better lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=952111","commentId":952111,"userName":"Djenni","timestamp":1389486289,"content":"hah! yeah \"The Table Talk Rule\" is a joke :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96245-a-new-preview/?do=findComment&comment=952248","commentId":952248,"userName":"Glaurung","timestamp":1389504140,"content":"> Well, one reason why I think the table talk rules are kind of silly is because you can rephrase the question as:\n> \n>  \n> \n> \"Hey guys, I'm able to cancel a treachery, but I'm out of spirit resources.  Should I use Grima's action just in case we need to cancel that one really bad treachery?\"\n> \n>  \n> \n> and be within the rules. Might as well just say A Test of Will.\n\nYes this table talk rule always was quite a dump...."}]}