{"url":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/","title":"From The Defense to Last Battle (Cair Andros)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/?do=findComment&comment=945088","commentId":945088,"userName":"Mndela","timestamp":1388836142,"content":"I have good decks to play this hard scenario (Cair Andros). But they are good in siege (my characters quest hard with defense points).\n\n \n\n  \n\n \n\n1b (The Defense) is easy to quest with them. But 5b (Last Battle) is not so easy because almost always it gains battle (quest by attack points).\n\n \n\n  ffg_the-defense-hon.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_the-defense-hon.jpg]ffg_the-last-battle-hon.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_the-last-battle-hon.jpg]\n\n \n\nI have a good idea to make it easier: i first explore all the Battleground locations, but not at all of The Citadel. For exemple, it is active location (other 2 are explored) and i try to keep it with, for example, 8 or 10 progress tokens. And the next round, i quest hard (with siege-defense points)...: the idea is...\n\n \n\nffg_the-citadel-hon.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_the-citadel-hon.jpg]\n\n \n\nI explore Citadel, and it automatically go to 5a and 5b..., the question is: does my quest points continue to place into 5b?\n\nLast game is so, for example:\n\n6 threat staging area, 1 quest point to explore citadel..., and our total quest (in siege mode) was 21. So we put into Last Battle 14 progress tokens (even if 5b gains battle).\n\n \n\nThe next round, you can quest easy even if you quest in battle mode :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\nPD: In fact, an attacker with gondolin blade kills an enemy and we won the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/?do=findComment&comment=945747","commentId":945747,"userName":"ricedwlit","timestamp":1388894948,"content":"Progress points do not carry over to the next stage of the quest.  From the rule book (emphasis mine):\n\n \n\n> Players immediately advance to the next stage of a quest as soon as they place a number of progress tokens equal to or greater than the number of quest points the current quest card has. Additional progress tokens earned against the quest do not carry over to the next stage. All progress tokens on the quest are returned to the token bank when players advance to the next stage. Players follow any instructions on the newly revealed quest card as it is revealed.\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/?do=findComment&comment=945793","commentId":945793,"userName":"GrandSpleen","timestamp":1388903746,"content":"His question is different, though.  The rulebook is talking about the common occurrence of placing more progress tokens than are necessary to advance to the next stage to the quest.  Those excess tokens are lost.\n\n \n\nIn the Siege, if you are on stage 1 and all Battleground locations go out of play, you immediately advance to the next stage of the quest (not as a result of placing progress tokens on the quest card-- so, different from the situation described by the rulebook).  \n\n \n\nThe question, then, is the order of resolution of effects and whether the progress tokens won from the quest phase can be placed on 5B if you advance there via the \"Battlegrounds out of play\" condition rather than the usual placing of progress tokens.\n\n \n\nNormal sequence would be:\n\n \n\n1) Resolve quest (determine number of tokens to be placed)\n\n2) Place tokens on Citadel\n\n3) Citadel goes out of play\n\n4) Trigger Citadel Response, remove stage 4 from game.\n\n5) Remaining progress tokens placed on current quest.\n\n \n\nWith the \"immediate\" text on quest card 1, you would have to immediately advance to stage 4 after the Citadel is explored, then trigger the Citadel's text and remove stage 4 from the quest deck, going right to stage 5.  Then do you go ahead and do the 5th step, above, and place progress tokens on stage 5?  This is different from the \"carryover\" discussed in the rulebook.\n\n \n\nI think yeah, this would work.  Why not?  We do have similar precedent: in Flight from Moria, and in the Battle of Five Armies, the current quest card can change mid-staging step.  Even though characters originally committed to one quest, they are allowed to put progress tokens on a different quest card if the quest changes.  Is there a precedent for changing the quest card during quest resolution, though, or after exploring a location like this?  I can't think of any off the top of my head."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/?do=findComment&comment=945893","commentId":945893,"userName":"alogos","timestamp":1388920992,"content":"I think it doesn't work because all the progress token are placed at the same time. Only after placing the token you would triger the exploration of the citadel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/?do=findComment&comment=946455","commentId":946455,"userName":"GrandSpleen","timestamp":1388962170,"content":"I thought so at first, but the rule reads like this in the manual:\n\n \n\n\"Note that if there is an active\n\nlocation (see page 15), progress tokens are placed on\nthat location until it is explored, and the remainder are\nthen placed on the current quest.\" (p 14)\n \nSo the active location gets explored before the remaining tokens are placed on the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/?do=findComment&comment=946961","commentId":946961,"userName":"alogos","timestamp":1389021812,"content":"As far as I remember, there was some ruling that says all progress token are place in one go and no effect could trigger in between placing one of the token.\n\n \n\nThis extract of the rules only says where to place the token, but all of them are placed in the same time window."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96281-from-the-defense-to-last-battle-cair-andros/?do=findComment&comment=946974","commentId":946974,"userName":"GrandSpleen","timestamp":1389022724,"content":"In my reading, \"until\" is a word which indicates a time window since it specifies a sequence of events.  But I don't have any official ruling, just my own guesses. "}]}