{"url":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/","title":"Rule Questions regarding the Blood of Gondor quest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=947818","commentId":947818,"userName":"arisgl","timestamp":1389098900,"content":"Both questions are about the mechanic of hidden cards.\n\n \n\nWe are at Stage 1 ( Blood of Gondor Quest) and during the beginning of combat phase and a player decides to turn each of his hidden cards face up. \n\n \n\na) The hidden cards are turned face up one at a time. The first card is an \"Evil Crow\" which immediately engages the player and instructs the player to take 1 hidden card.\n\n \n\nQuestion:  Will this second card also be turned face up during the current beginning of combat phase or will it remain hidden for now?\n\n \n\nI ask because the cards are turned face up one at a time and technically we are still at the beginning of combat phase. So the decision would still affect the newly received hidden card, but I am not sure if this was the designer's intention.\n\n \n\nb) The second question is simpler. We are still at Stage 1 and during the beginning of combat phase and a player decides to turn each of his hidden cards face up. The card is an enemy. Does he receive a shadow card? Shadow cards are also dealt at the beginning of the combat face. But what happens first? The turning of hidden cards faced up or the dealing of shadow cards? If two things happen at the same time, the current first player decides the order. Can I choose to first deal the shadow cards and then turn face up the hidden cards? Or I misinterpret something here?\n\n \n\nThanks in advance for any help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=947975","commentId":947975,"userName":"Mndela","timestamp":1389112828,"content":"a/ i would add a hidden card\n\n \n\nb/ Fist is 1b text, and after deal shadow cards (i think 'deal shadow cards' is not at the beginning of combat phase, only the previous step of attack enemies -for example, archery is before than deal shadow cards-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=951120","commentId":951120,"userName":"Jeffrey Shep","timestamp":1389382088,"content":"I also have questions about this : \n\n \n\nThe step 1b of the Blood of Gondor adventure says \"At the beginning of the combat phase, each player must turn each of his hidden cards faceup or take 1 hidden card.\". So, it is a \"must do this or this happens\" written card. Am I right ? \n\n \n\nSo, I must turn each of my hidden cards faceup and only if I don't have any hidden card, I take 1 hidden card. In other words, there is no strategic choice at this point! This comes from the Caleb's ruling about all the cards written \"must do this or this happens\". The only cards that let a choice must be written \"either do this, or do that\". \n\n \n\nWhat about the use of Faramir ? It seems quite less useful than expected with that ruling...\n\nEdited January 10, 2014 by Jeffrey Shep"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=951157","commentId":951157,"userName":"jjeagle","timestamp":1389384310,"content":"> I also have questions about this : \n> \n>  \n> \n> The step 1b of the Blood of Gondor adventure says \"At the beginning of the combat phase, each player must turn each of his hidden cards faceup or take 1 hidden card.\". So, it is a \"must do this or this happens\" written card. Am I right ? \n> \n>  \n> \n> So, I must turn each of my hidden cards faceup and only if I don't have any hidden card, I take 1 hidden card. In other words, there is no strategic choice at this point! This comes from the Caleb's ruling about all the cards written \"must do this or this happens\". The only cards that let a choice must be written \"either do this, or do that\". \n> \n>  \n> \n> What about the use of Faramir ? It seems quite less useful than expected with that ruling...\n\nAgreed, this seems like a bad ruling to me and I don't think it's how the scenario is supposed to be played - you should have the choice.\n\nEdited January 10, 2014 by jjeagle"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=951664","commentId":951664,"userName":"Mndela","timestamp":1389435721,"content":"Good question. If it doesnt need any correction..., Faramir would be good only:\n\n \n\nThe first question of original post: when a shadow card or the text of the engaged enemy triggers a new hidden card.\n\n \n\n \n\nWaiting for an oficial answer however...\n\n \n\nPD: in fact, you cant use Faramir before the choice about facing up the hidden cards or keep and add a new hidden card..., so Faramir is not so good anyway.\n\nEdited January 11, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=953273","commentId":953273,"userName":"alogos","timestamp":1389632483,"content":"Official response from Caleb :\n\n> Stage 1B is intended to be a choice. I will make a note in the FAQ to errata it to read: \"either turn each of his hidden cards faceup or take 1 hidden card.\"\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=960850","commentId":960850,"userName":"arisgl","timestamp":1390341272,"content":"Hello, I asked for an official answer for my questions and I post here the answers for whomever is interested:\n\n \n\nThe initial answer by Caleb was:\n\n \n\nHi Aris,\n\nIn answer to your first question, the new hidden card remains hidden and is not turned faceup at that time.\n\nTo answer your second, when two effects resolve at the same time, the first player decides which order to resolve them in.\n\nHope you're enjoying the scenario!\n\nCheers,\n\nCaleb\n\n \n\nIn order to clarify whether shadow cards are dealt to the turned faced up enemies I asked:\n\n \n\nThank you for your answers Caleb,\n \nAccording to your answer to the second question:\n \n\"when two effects resolve at the same time, the first player decides which order to resolve them in.\"\n \n(which I already knew from the F.A.Q.), the first player can avoid the dealing of shadow cards to the newly turned faced up enemy hidden cards because:\n \na) turning face up the hidden cards happens at the beginning of combat\nb) dealing shadow cards to the engaged enemies happens at the beginning of combat.\nc) The first player can decide to first deal a shadow card to each enemy engaged with a player and then turn face up the hidden cards.\n \nThe above procedure will lead to enemies originating from turned faced up hidden cards, with no shadow card on them.\n \nBy your answer I get that the above scenario is legal according to the rules of the game. If this is the case then the scenario becomes much easier and I must inform you that anyone I know from the forums or real life has no idea that this is a legal procedure. They (We) all deal shadow cards to the turned faced up hidden cards that are enemies.\n \nThe answer I received was:\n \nHi Aris,\nYour timing summary is correct. You may choose to deal shadow cards before turning hidden cards faceup.\nCheers,\nCaleb\n \nSo as it seems you can avoid dealing shadow cards to newly turned faced up enemies!\nInteresting!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/?do=findComment&comment=960897","commentId":960897,"userName":"Mndela","timestamp":1390343720,"content":"Yeah, very interesting"}]}