{"url":"https://community.fantasyflightgames.com/topic/96490-treasure-cards-and-additional-players/","title":"Treasure Cards and additional players","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96490-treasure-cards-and-additional-players/?do=findComment&comment=948678","commentId":948678,"userName":"scottindeed","timestamp":1389165681,"content":"Hi,\n\nI've been playing through all the Hobbit quests with 2 thematic decks featuring all the Dwarves of Thorin's company. Now that I've reached the Battle of Five Armies I quite like the idea of adding in additional players to represent The Eagles, Dwarves and Elves that took part.\n\nCan you add in additional players and still include discovered treasure cards? I realise that the new players won't be able to include the cards in their decks, but just wanted to check that adding in players didn't invalidate the other players from including treasures in their decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96490-treasure-cards-and-additional-players/?do=findComment&comment=948696","commentId":948696,"userName":"GrandSpleen","timestamp":1389167702,"content":"I asked the same question awhile back but nobody had a firm answer. Thematically it makes sense for a group of heroes to get some treasures and keep them even if joined by some other heroes. I think you're fine to play it that way. If you want an official response, you'll have to submit a rules question to the designers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96490-treasure-cards-and-additional-players/?do=findComment&comment=954835","commentId":954835,"userName":"scottindeed","timestamp":1389784671,"content":"Thanks for your reply GrandSpleen.\n\n \n\nI sent a question to Caleb and got an answer back.  You can add additional players and still have the original players keep their treasure cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96490-treasure-cards-and-additional-players/?do=findComment&comment=966092","commentId":966092,"userName":"SK3LMC","timestamp":1390856008,"content":"As a follow-up, can you use the Treasure cards only when playing the Hobbit Saga Expansion scenarios?  I have an all Dwarf deck and want to include those cards while playing any of the other scenarios.  Thank you and if I have to submit it to Caleb or the designers how do I do that?  Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96490-treasure-cards-and-additional-players/?do=findComment&comment=966124","commentId":966124,"userName":"Noccus","timestamp":1390857558,"content":"If you follow the rules then no, it is not allowed to add the treasure cards to your deck outside the hobbit saga quests.\n\nThen again, if you don't mind about that, nobody is stopping you from playing them if you want to.\n\nYour house, your rules."}]}