{"url":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/","title":"The Two Towers: Saga Expansions - What Quests will we see?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949801","commentId":949801,"userName":"faith_star83","timestamp":1389273289,"content":"As the title says, I was wondering what kind of quests we will se in the TTT saga expansions. Since the player has to have a Ring-Bearer as his fourth hero, does that mean we are limited to Frodo/Sam Story-line for these Expansions?\n\n \n\nIt would be somehow a pity, but having a Ring-Bearer Aragorn would disagree too strongly from the lotr theme I think.\n\n \n\nDid we alreday have any news on this? Or did you already think about it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949844","commentId":949844,"userName":"Scroll Lock","timestamp":1389277934,"content":"Are you talking about The Two Towers or next Saga we will see- 2nd part of The Fellowship of the Ring?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949887","commentId":949887,"userName":"faith_star83","timestamp":1389280528,"content":"I was actually thinking ahead already to the Two Towers storyline after the Fellowship breaks up. Because I really wonder what kind of quests we will see, as for the Fellowship Saga quests I assume we will just follow the Fellowship into Lothlorien.\n\n \n\nBut The Black Riders rule insert states:\n\n>  \n> \n> The Fellowship sphere emphasizes the sacrifice and determination of the valiant heroes who took up the burden of carrying The One Ring in the fight against Sauron.\n\n \n\nBasically this would mean we can only ever play Frodo as our fourth hero? Since he is the only character in the books who carried the ring (after Bilbo passed it down to him). This made me wonder what will happen to the quests in the future boxes after the Fellowship divides...will we just get to see one side of the story?\n\n \n\nMaybe it is a strange question, I was just wondering how the designers will handle tha paralell story lines. I imagined that maybe one quest will follow Frodo & Sam's storyline and another one Aragorn's group. Yet another one Merry & Pippin. But what would that mean for the fourth Fellowship hero in our decks? Wouldn't it be strange to have Frodo from the first box as the mandatory fellowship hero while playing through the siege on Isengard with the Ents?\n\n \n\nI am sorry if I cannot really put my thoughts to words... :wacko: [//content.invisioncic.com/Mfantflight/emoticons/default_wacko.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949899","commentId":949899,"userName":"jjeagle","timestamp":1389281081,"content":"> I was actually thinking ahead already to the Two Towers storyline after the Fellowship breaks up. Because I really wonder what kind of quests we will see, as for the Fellowship Saga quests I assume we will just follow the Fellowship into Lothlorien.\n> \n>  \n> \n> But The Black Riders rule insert states:\n> \n> >  \n> > \n> > The Fellowship sphere emphasizes the sacrifice and determination of the valiant heroes who took up the burden of carrying The One Ring in the fight against Sauron.\n> \n>  \n> \n> Basically this would mean we can only ever play Frodo as our fourth hero? Since he is the only character in the books who carried the ring (after Bilbo passed it down to him). \n> \n>  \n\nNot quite right - Sam took the ring for a while when Frodo was captive in Cirith Ungol. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949912","commentId":949912,"userName":"Scroll Lock","timestamp":1389281715,"content":"I am sure we will get alternative Ring-Bearer, in TBR is told something about alternative Ring bearer in the future.\n\nIf there will be quest, where Frodo couldnt be, you won't be allowed to use him, there won't be any 4th hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949926","commentId":949926,"userName":"Bullroarer Took","timestamp":1389282806,"content":"We had a thread about the second Fellowship box and so I will take this thread at face value and muse on the first Towers box - especially since I've been thinking about it in light of the new news on the Ringmaker cycle. I am really wondering if they will stick to the exact story line and keep the third box all about Rohan or if they will skip back and forth between Frodo's story and the Rest of the Fellowship's story. I can see arguments for both. There are some great quests possible in Rohan, but are there really three distinct quests possible following Frodo & Sam?\n\nI see the stairs and an epic battle with her ladyship, and journey quest through the dead marshes and down through Ithilien, but then... If they add in Emen Muil (again) will it just seem like more of the same? (I'm sure that Caleb & Co. Have already given this much thought btw.) Incidently, I was expecting that we would see a serious Secrecy boost when we got to this part of the story.\n\nSo for the Quests built around book three I expect pursuing the orcs (Three Hunters), Helm's Deep (yes!), and the Ents attacking Isengard. For the latter I expect that we will have to somehow convince the Ents to join our side before we attack Isengard in order to have enough strength to manage.\n\nBut again, given the way the timelines in the story work - the battle against Shelob actually occurred at the same time as the siege of Minas Tirith - I think we might see the quests not follow the books exactly. And if you carry the thought process further into The Return of the King, you will see that it makes sense to do this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949932","commentId":949932,"userName":"HeavyKaragh","timestamp":1389283061,"content":"We may see a Per Book (that is counting the 6 books) distribution:\n\n * 3rd book/saga expansion: Aragorn's path\n * 4th book/saga expansion: Frodo's path\n * 5th book/saga expansion: Aragorn's path\n * 6th book/saga expansion: Frodo's path+scourge\n\nEdited January 9, 2014 by karagh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=949941","commentId":949941,"userName":"Gizlivadi","timestamp":1389283793,"content":">  \n> \n> We may see a Per Book (that is counting the 6 books) distribution:\n> \n>  * 3rd book/saga expansion: Aragorn's path\n>  * 4th book/saga expansion: Frodo's path\n>  * 5th book/saga expansion: Aragorn's path\n>  * 6th book/saga expansion: Frodo's path+scourge\n> \n>  \n\n \n\nThis would be my first idea of the next sagas, and the one I would like to see. However, the ring-bearer is the only thing that links all the scenarios in the Campaign mode together, so it would be a little weird if we have scenarios that don't have anything to do with the ring-bearer (what relevance would they have to the Campaign mode?). But I still want to see this distribution; there's just so much stuff happening in the \"Aragorn books\" that they just can't leave it out. Also I don't think we'll see the Scouring of the Shire, but hopefully I'm wrong. As for alternate ring-bearers, it was made somewhat clear in the TC video that we will see alternate ring-bearers, in the form of one Fellowship sphere hero for each box I suppose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=950144","commentId":950144,"userName":"CaffeineAddict","timestamp":1389297467,"content":"I was assuming we'd see variations on Frodo in the saga expansions (the same way we had a different Bilbo in each of the Hobbit boxes), and then a Sam in a Return of the King box. I suppose you could make an argument for a Gollum ring-bearer hero - that could be interesting.\n\n \n\nI suppose for the quests they could do something like parallel quest stages for Frodo's journey and The rest of the fellowship. They did something similar in the Hobbit boxes when Bilbo was separated from the company. Might get complicated, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=950583","commentId":950583,"userName":"lleimmoen","timestamp":1389340872,"content":"It could be that a quest is going to take place on different levels: you will be trying to push forward with the Ring-bearer ever closer to Mount Doom, and at the same time fending off armies of Mordor or Isengard on various fronts. Now that I think about it, it seems quite hard to achieve but possible. It could be (on a much larger scale) similar to the Riddle quest where Bilbo was in a separate area.\n\nEdited January 10, 2014 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=950636","commentId":950636,"userName":"faith_star83","timestamp":1389348581,"content":">  \n> \n> > I was actually thinking ahead already to the Two Towers storyline after the Fellowship breaks up. Because I really wonder what kind of quests we will see, as for the Fellowship Saga quests I assume we will just follow the Fellowship into Lothlorien.\n> > \n> >  \n> > \n> > But The Black Riders rule insert states:\n> > \n> > >  \n> > > \n> > > The Fellowship sphere emphasizes the sacrifice and determination of the valiant heroes who took up the burden of carrying The One Ring in the fight against Sauron.\n> > \n> >  \n> > \n> > Basically this would mean we can only ever play Frodo as our fourth hero? Since he is the only character in the books who carried the ring (after Bilbo passed it down to him). \n> > \n> >  \n> \n> Not quite right - Sam took the ring for a while when Frodo was captive in Cirith Ungol. \n> \n>  \n\nYes, it is true. I overlooked this, sorry. (it's been a while since I read the books, actually I am re-reading them right now, but just started TTT).\n\n \n\nFor me it is hard to imagine that the storyline will alternate in between the same quests, but it is certainly possible. Much more like I think is either separate boxes per storyline or alternating quests in the boxes, but this last option certainly seems a bit difficult to realize from a gamedesign perspective.\n\n \n\nBut even then, I wonder how far the restrictions of the setup will be in favor of thematic thickness. It is not out of the question, that the fellowship sphere will have non-ring-bearer heroes such as Aragorn when considering the Frodo-Aragorn-Boxes approach. This could mean that we need a ring-bearer hero for the Frodo part and a non-ring-bearer hero for the other part.\n\n \n\nAnyway, I am already very excited to see where the Saga Expansions take us and can't wait for the first anouncements. I wonder if we will already see the first TTT box by the end of the year..?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=950766","commentId":950766,"userName":"koriakin97","timestamp":1389363876,"content":"Maybe we'll see another sphere, like 'Isildur's heir'"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=950824","commentId":950824,"userName":"Narsil0420","timestamp":1389368273,"content":"I also think they will be divided up by book so that we'll get one expansion that is centered around Aragorn (with him as the Fellowship Sphere Hero) and then an expansion about Frodo (with a Samwise solo deck anyone!?!)\n \n\nI have already said that I also think they're going to give us the ability to give the ring to a non-cannonical hero which I think is awesome. I want to see Legolas carry that thing into Mordor and actually be the elf-warrior that the Orcs were afraid of!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=950874","commentId":950874,"userName":"Raven1015","timestamp":1389370742,"content":"All I know is I can't wait to see the Battle of Helm's Deep. That must be some pressure on the designers to get such an iconic event right!\n\nEdited January 10, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=951014","commentId":951014,"userName":"Dain Ironfoot","timestamp":1389377860,"content":"maybe i'm having a total mental laspe...but why are some of you assuming we have to have a 4th hero for every quest?\n\n \n\ni see no issue with having frodo (or sam) for some quests and no fellowship sphere hero for others.\n\n \n\nhowever, since it is called the fellowship sphere, and not the ring-bearer sphere, i suppose they could make anyone a hero for that sphere (and maybe even multiple per box, with a frodo for some quests and an aragorn or whomever for other quests).\n\n \n\neither way, i'm not convinced we do need a 4th hero for all quests, but then again, maybe we will see some - with variety."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=951147","commentId":951147,"userName":"CaffeineAddict","timestamp":1389383757,"content":"> maybe i'm having a total mental laspe...but why are some of you assuming we have to have a 4th hero for every quest?\n> \n>  \n> \n> i see no issue with having frodo (or sam) for some quests and no fellowship sphere hero for others.\n> \n>  \n> \n> however, since it is called the fellowship sphere, and not the ring-bearer sphere, i suppose they could make anyone a hero for that sphere (and maybe even multiple per box, with a frodo for some quests and an aragorn or whomever for other quests).\n> \n>  \n> \n> either way, i'm not convinced we do need a 4th hero for all quests, but then again, maybe we will see some - with variety.\n\n \n\nI guess the assumption is because all the saga quests so far have been structured that way. Interesting point about the fellowship sphere, though. An Aragorn fellowship sphere hero would be interesting.\n\nNot sure how that would work with campaign mode, though, as I'm sure lots of people will have played one of the existing Aragorn heros in the campaign already.\n\nEdited January 10, 2014 by CaffeineAddict"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=951293","commentId":951293,"userName":"Dain Ironfoot","timestamp":1389392395,"content":">  \n> \n> > maybe i'm having a total mental laspe...but why are some of you assuming we have to have a 4th hero for every quest?\n> > \n> >  \n> > \n> > i see no issue with having frodo (or sam) for some quests and no fellowship sphere hero for others.\n> > \n> >  \n> > \n> > however, since it is called the fellowship sphere, and not the ring-bearer sphere, i suppose they could make anyone a hero for that sphere (and maybe even multiple per box, with a frodo for some quests and an aragorn or whomever for other quests).\n> > \n> >  \n> > \n> > either way, i'm not convinced we do need a 4th hero for all quests, but then again, maybe we will see some - with variety.\n> \n>  \n> \n> I guess the assumption is because all the saga quests so far have been structured that way. Interesting point about the fellowship sphere, though. An Aragorn fellowship sphere hero would be interesting.\n> \n> Not sure how that would work with campaign mode, though, as I'm sure lots of people will have played one of the existing Aragorn heros in the campaign already.\n> \n>  \n\n \n\nthe fellowship constantly changed/broke apart in the books and i'm sure the quests in the future (TTT and ROTK) will reflect this ever changing nature.\n\n \n\ni suppose a 4th fellowship hero could be someone that isn't part of the 9 - maybe a theoden 4th hero for the helm's deep quest, for example.\n\n \n\nin other words, if one of our existing heroes gets made into a fellowship hero for a quest or 2, i'm sure the rules would allow you to swap out heroes for that quest with no penalty.\n\n \n\ni just think it's highly unlikely that we'll have frodo for every quest - it just makes no sense (even if we did have bilbo for the battle of 5 armies - during which he was mostly knocked out! haha)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=951791","commentId":951791,"userName":"Thanatopsis","timestamp":1389459799,"content":"I'm really curious how the story will remain intact without the player feeling like every major event was forced.\n\n \n\nFor example/ if Boromir's will had been just a little stronger (both mentally in the case of Frodo, and physically in the case of Merry and Pippin, the fellowship probably would have never broken.  What if I build a really strong deck for the this quest, will the game still force my fellowship to splinter?\n\n \n\nAdditionally, the two towers has four story arcs!!!\n\n1) Frodo and Sam\n2) Merry and Pippin\n3) Aragorn, Gimli, and Legolas\n4) Gandalf: during the events of Helm's Deep he is a lot busier in the book than in the movie\n\n \n\nUp until now the three saga boxes have had highly linear story lines, the Two Towers completely strays from this.  I have no doubt that it will be expertly handled, but I'm still very curious."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=951815","commentId":951815,"userName":"Gizlivadi","timestamp":1389461568,"content":"> I'm really curious how the story will remain intact without the player feeling like every major event was forced.\n> \n>  \n> \n> For example/ if Boromir's will had been just a little stronger (both mentally in the case of Frodo, and physically in the case of Merry and Pippin, the fellowship probably would have never broken.  What if I build a really strong deck for the this quest, will the game still force my fellowship to splinter?\n> \n>  \n\n \n\nTen times this. I hate it when they sometimes try to force you to do this or that with this character because it's what happened in the books. Like if in the book Gandalf died fighting the Balrog people automatically say: \"Gandalf objective ally! discard it to kill the Balrog\" or something like that. Or \"Boromir enemy, right, because he betrayed the fellowship\". I really don't like when that happens because, firstly, it feels very cheap, like they could come up with a better idea to do this part of the story so they have to make an Objective or another obligatory encounter mechanic to do it. Secondly, it really kills the player's choice to do something different because they are forced to take this route. And finally, it also kills the choice to use said character as a hero or ally because the encounter deck already forces you to use that character as an objective. What if my deck really needs to use Gandalf or focuses on Tactics Boromir to win the quests? Too bad, they're objectives. That's why I feel like the developers often abuse the objective cards. Sure, for characters such as Alcaron or the Shadow Key or whatever it's alright because you're not going to see these as player cards, but when they make obejctive cards out of unique characters or attachments that could have been player cards they really kill compatibility for me. And yet for some reason we have a Grima objective ally AND a Grima hero in the same box. It just feels really weird."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=951831","commentId":951831,"userName":"Thanatopsis","timestamp":1389462982,"content":"This is why I'm convinced that the final quest in the \"The Road Darkens\" will have a trigger that will cause one of the players' heroes to betray the fellowship. The fellowship will break, but Boromir's betrayal will not be scripted.  I mean, how awesome would it be to have Elrond or Sam betray the fellowship!  The hero should even have a chance to mend their ways, After all, Boromir did see the error of his ways before dying.\n\n<still on topic since a lot of these events happened at the beginning of The Two Towers ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] >\n\nEdited January 11, 2014 by Thanatopsis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=951865","commentId":951865,"userName":"Scroll Lock","timestamp":1389465658,"content":"I agree with Gizlivaldi. These sagas are made to let you play \"what if\", not like YOU MUST USE ARAGORN, COS IT IS THEMATIC! AARGH, AND NOW BUY THAT NEWEST ADVENTURE PACK.\n\nI liked Black Riders, because it let open possibilities. If you want to play book story, play it then, if you do not, play Legolas, Sam and Pippin as i did(Legolas was going to Elrond, or something :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] )."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96562-the-two-towers-saga-expansions-what-quests-will-we-see/?do=findComment&comment=952194","commentId":952194,"userName":"ricedwlit","timestamp":1389498034,"content":"> This is why I'm convinced that the final quest in the \"The Road Darkens\" will have a trigger that will cause one of the players' heroes to betray the fellowship. The fellowship will break, but Boromir's betrayal will not be scripted.  I mean, how awesome would it be to have Elrond or Sam betray the fellowship!  The hero should even have a chance to mend their ways, After all, Boromir did see the error of his ways before dying.\n> \n> <still on topic since a lot of these events happened at the beginning of The Two Towers ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] >\n\nI think you might have something here.  In fact, it could be something like a forced condition that triggers in stage 3: \"Choose one hero to succumb to the power of the ring\". Perhaps the hero gets an attachment and you need to overcome them (in addition to dealing with the orcs attacking). The eventual outcomes could be\n\n- you lose because the selected hero takes the ring\n\n- you win, but the selected hero dies\n\n- you win, the selected hero lives but ends up with a permanent burden.\n\n \n\n- you win, the selected hero \n\nEdited January 12, 2014 by ricedwlit"}]}