{"url":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/","title":"Solo Mono Challenge 4: Druadan Forest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951210","commentId":951210,"userName":"Pharmboys2013","timestamp":1389388083,"content":"Back in the first half of the year 2013, user Leptokurt created a series of Challenges all revolving around the use of decks made of one sphere to beat scenarios with slights twits. I personally enjoyed that, and thought now would be a good opportunity to make a new challenge as we wait in anticipation for the Voice of Isengard expansion and also because the Against the Shadow cycle gave us many more tools to make these decks more viable.\n\nThis challenge will be based on the scenario the Druadan Forest. Picked this because its a newer scenario with medium difficulty IMO. The players will play the scenario 3 times with each monosphere deck.\n\nThe players will build a mono sphere deck for each of the 4 primary spheres. The deck may only contain cards of that specific sphere or neutral cards (aka no song splashing). As an additional challenge, when selecting heroes for each deck, none of the 3 heroes may share the same trait. 2 exceptions exists: the warrior trait may be shared as there is no thematic cohesion to it currently and there are simply too many tactics heroes that carry it to have different kinds of decks. The same also goes for the noble trait for it would be too difficult to build a leadership deck without it\n\nPlayers will record their score for each game and whichever has the least amount of points combined for all 12 attempts is the winner. For each loss, the player will count that as a score of 200. Additionally, you may receive -30 to your total score for each hero below that you use (aka a max benefit of -120 if you use all 4 heroes in your decks): Lore: Bombur. Spirit: Pippin. Tactics: Elladan. Leadership: Elrohir.\n\n \n\nFor example: I play my 3 matches with a lore deck of Mirlonde, Bombur, and Denethor.  \n\nmatch 1: victory  98 points\n\nmatch 2: loss     200 points\nmatch 3: victory 124 points\n\nBonus for using Bombur: (-30 points)\n\nRunning total thus far: 392\n\nAlso, tell us anecdotes of your attempts is always encouraged and adds a good bit of fun to the proceedings.\n\nThe challenge will go until: January 27th (or if i quit paying attention to this topic before then)\n\nEdited January 14, 2014 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951339","commentId":951339,"userName":"chuckles","timestamp":1389394462,"content":"Cool idea. Hope I'll have time to compete.\n\n \n\nTwo questions: \n\n \n\n1) Regarding \"none of the 3 heroes may share the same trait\". 9 of 12 of the released Tactics Heroes have the warrior trait. (Only Merry, Brand & Elladan don't)... Do you intend that the tactics mono sphere includes 2 of these 3 non warriors or can we ignore, either the warrior trait or traits that don't have any in game bonuses from cards etc.\n\n \n\n2) Are we restricted to just the released player cards or can we include proxied cards from the yet to be released Voice of Isengard cycle?\n\n \n\nThanks\n\nEdited January 10, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951372","commentId":951372,"userName":"Glowwyrm","timestamp":1389396019,"content":"Thanks for bringing these back!  I enjoyed the challenges when leptokurt did them, and this looks like fun too.  I'll have to find some time to play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951482","commentId":951482,"userName":"Bullroarer Took","timestamp":1389403799,"content":"Mono-sphere is restrictive enough in solo, I would drop the trait limitation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951500","commentId":951500,"userName":"Pharmboys2013","timestamp":1389405245,"content":"> Cool idea. Hope I'll have time to compete.\n> \n>  \n> \n> Two questions: \n> \n>  \n> \n> 1) Regarding \"none of the 3 heroes may share the same trait\". 9 of 12 of the released Tactics Heroes have the warrior trait. (Only Merry, Brand & Elladan don't)... Do you intend that the tactics mono sphere includes 2 of these 3 non warriors or can we ignore, either the warrior trait or traits that don't have any in game bonuses from cards etc.\n> \n>  \n> \n> 2) Are we restricted to just the released player cards or can we include proxied cards from the yet to be released Voice of Isengard cycle?\n> \n>  \n> \n> Thanks\n\n \n\nGood catch to the warrior trait, its so underdeveloped I completely forgot about it.  Changed the rules to allow it.\n\n \n\nRestricted to currently released player cards aka no VoI or Ring Maker cycle spoilers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951504","commentId":951504,"userName":"Pharmboys2013","timestamp":1389405348,"content":"> Mono-sphere is restrictive enough in solo, I would drop the trait limitation.\n\n \n\nI would prefer to keep it for this instance I think"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951654","commentId":951654,"userName":"leptokurt","timestamp":1389433248,"content":"Thanks for setting this up, Pharmboys! My time is very restricted, but I will try to offer a result for this challenge, especially as Druadan Forest is one of my favourite scenarios from the AtS cycle.\n\nEdited January 11, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951665","commentId":951665,"userName":"Scroll Lock","timestamp":1389435761,"content":"I would also ignore the Noble trait. It is quite restrictive for Leadership."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951672","commentId":951672,"userName":"Scroll Lock","timestamp":1389436527,"content":"Only 3 leadership heroes have NOT noble trait: Dain Ironfoot, Balin and Sam Gamgee.\n\nThere is also Hirluin, but he is useless for pure monosphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=951757","commentId":951757,"userName":"Pharmboys2013","timestamp":1389455510,"content":"> Only 3 leadership heroes have NOT noble trait: Dain Ironfoot, Balin and Sam Gamgee.\n> \n> There is also Hirluin, but he is useless for pure monosphere.\n\nBalls...good point *changes rules*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=953240","commentId":953240,"userName":"leptokurt","timestamp":1389630177,"content":"I already finished my three games with the spirit sphere. It was quite frustrating at the beginning, but after trying several decks I finally found one that was up to meet the challenge. The quest is, like I said, easily one of my favourite so far. It's a hard nut to crack for spirit, as this sphere lacks both HP to take all the ranged damage and the ability to heal your fellowship. That's one reason why Nori ended up dead twice (the other being that I forgot to add the White Tower Watchmen).\n\n \n\n \n\nHeroes:\n\n \n\nNori (Dwarf), Pippin (Hobbit), Glorfindel (Noble. Warrior. Noldor)\n\n \n\n \n\nResults:\n\n \n\ngame 1: win, score 132\n\n \n\ngame 2: win, score 146\n\n \n\ngame 3: win, score 82\n\n \n\nbonus: 30 points\n\n \n\n \n\ntotal:  330 points\n\n \n\n \n\nNot the best results, I suppose, but the last game was a blast. In all three games I excessively used the Nori/Bofur combo which I played for the first time. It is awesome! That plus an early Resourceful was the key to winning. I tried to gather enough resources to counter all the prowl effects. And kept praying that I wouldn't get any ranged enemies early in the game.\n\n \n\nOne question: how are we supposed to count losses? The rulebook only explains how to score victories... :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=953257","commentId":953257,"userName":"Pharmboys2013","timestamp":1389631379,"content":"While not specifically stated, the rule book says \"when a player is eliminated, his threat is considered to be 50 and all his heroes are considered dead\"\n\nSo using your hero compilation I would say if you lost a match on say turn 8, then your score would be threat (50), threat cost of each hero (20 total), and then number of rounds x10 (80) = 150"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=953366","commentId":953366,"userName":"jjeagle","timestamp":1389638456,"content":">  \n> \n>  \n> \n> Not the best results, I suppose, but the last game was a blast. In all three games I excessively used the Nori/Bofur combo which I played for the first time. It is awesome!  :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]\n\n \n\nDo you mean triggering Nori's threat reduction after putting Bofur into play in the quest phase? Nori was errata'd so this doesn't work..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=953383","commentId":953383,"userName":"leptokurt","timestamp":1389639767,"content":">  \n> \n> >  \n> > \n> >  \n> > \n> > Not the best results, I suppose, but the last game was a blast. In all three games I excessively used the Nori/Bofur combo which I played for the first time. It is awesome!  :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]\n> \n>  \n> \n> Do you mean triggering Nori's threat reduction after putting Bofur into play in the quest phase? Nori was errata'd so this doesn't work...\n> \n>  \n\nYou're right. Haven't played Nori for ages and didn't realized that they rendered him useless. At least for a spirit mono deck.\n\n \n\nOk, so my results are apparently invalid, I'm trying to figure out a new deck\n\n \n\n \n\n> While not specifically stated, the rule book says \"when a player is eliminated, his threat is considered to be 50 and all his heroes are considered dead\"\n> \n> So using your hero compilation I would say if you lost a match on say turn 8, then your score would be threat (50), threat cost of each hero (20 total), and then number of rounds x10 (80) = 150\n> \n>  \n\nHmmh, that's ok, but I think loosing a game should get you a harder punishment. Say I loose the game after turn 3, my result would be 20 + 50 + 20 = 90. Which is not too bad, and even better than actually winning the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=953908","commentId":953908,"userName":"Pharmboys2013","timestamp":1389682744,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > >  \n> > > \n> > > Not the best results, I suppose, but the last game was a blast. In all three games I excessively used the Nori/Bofur combo which I played for the first time. It is awesome!  :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]\n> > \n> >  \n> > \n> > Do you mean triggering Nori's threat reduction after putting Bofur into play in the quest phase? Nori was errata'd so this doesn't work...\n> > \n> >  \n> \n> You're right. Haven't played Nori for ages and didn't realized that they rendered him useless. At least for a spirit mono deck.\n> \n>  \n> \n> Ok, so my results are apparently invalid, I'm trying to figure out a new deck\n> \n>  \n> \n>  \n> \n> > While not specifically stated, the rule book says \"when a player is eliminated, his threat is considered to be 50 and all his heroes are considered dead\"\n> > \n> > So using your hero compilation I would say if you lost a match on say turn 8, then your score would be threat (50), threat cost of each hero (20 total), and then number of rounds x10 (80) = 150\n> > \n> >  \n> \n> Hmmh, that's ok, but I think loosing a game should get you a harder punishment. Say I loose the game after turn 3, my result would be 20 + 50 + 20 = 90. Which is not too bad, and even better than actually winning the game.\n> \n>  \n\n \n\ncrappp. i should have kept it simple with just a point for a victory like you used to do.  i'll edit the rules so that a loss gives you a score of 200 since theres no way solo victories would reach that high and is penalizing as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=953943","commentId":953943,"userName":"leptokurt","timestamp":1389690228,"content":"Ok, new results for spirit are up. I replaced Nori with Eleanor, sent all dwarves home and replaced them by neutral Gondor allies. No one died thanks to Light the Beacons and Blood of Numenor, but the first tow attempts were close. Had to overcome loads of threat in my fist game, and met a Druadan Elite on turn 1 in game 2. The strategy was to put Blood of Numenor on Eleanor, making her an excellent defender. The deck has a serious lack of ATT points which is why it took me forever to take out the harder enemies. Once the hobbit Gandalf was in play, he could take care about that. Resourceful and Shadow of the Past both are key to get your party through early and midgame. Once I had 6+ resources in my pool most of the encounter cards lost their lifethreatening power, as I could easily pay prowl effects. I decided to play this scenario very carefully, tying to minimze the risks. There only a small place for errors, as my fellowship cannot take a lot of damage. That's why I tried to hold back enough allies to be able to kill a Druadan Elite in one single turn. The results are thus not that spectactular, but at least I won all three games.\n\n \n\nHere are the results:\n\n \n\n \n\nHeroes: Eleanor (Noble. Gondor), Pippin (Hobbit), Glorfindel (Noble. Warrior. Noldor)\n\n \n\n \n\nResults:\n\n \n\ngame 1: win, score 159\n\n \n\ngame 2: win, score 155\n\n \n\ngame 3: win score: 116\n\n \n\nbonus: 30 points\n\n \n\n \n\ntotal: 400 points"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=954128","commentId":954128,"userName":"leptokurt","timestamp":1389714302,"content":"Aaaaaaaaaand.... here we go with tactics:\n\n \n\n \n\nTactics seems to have a solid base against this scenario. Enough HP to deal with ranged azttacks, some cannonfodder, strong allies and useful events. Theodren is a must IMO, as is Thalin. I used him and the Gondorian Spearman-Spear of the Citadel combo to deal with most of the enemies. Once I had an ally to block potential attacks, I sent everything with a point of WP to the quest. It's quite satisfying to see a mono tactics deck that can take it up with four early locations in a row, as happened in game 3. After clearing these locations I had enough support (Eagles of the Misty Mountains, Bofur) to make decent progress each turn.\n\n \n\nGame 1 was tougher, as I got also lotsa locations at the beginning, but not that much WP support. One Gandalf in midgame broke the spell eventually and afterwards it wasn't too difficult to complete the last stage (got White Tower Watchman in both winning games).\n\n \n\nGame 2 was a devastating loss. Got three enemies in a row during turns 4-6. One Druadan Elite and two Druadan Hunters sealed the fate of my strong looking fellowship. I don't think there was any way to avoid that loss. 'twas a typical case of bad luck.\n\n \n\n \n\nHeroes: Thalin (Warrior. Dwarf. Angry), Elladan (Noble. Noldor. Ranger.Twinless), Theoden (Rohan. Noble. Warrior. Badass)\n\n \n\n \n\nResults:\n\n \n\ngame 1: win, score:219 (!!!)\n\n \n\ngame 2: loss, score: 200 (?)\n\n \n\ngame 3: win, score: 133\n\n \n\nbonus: 30\n\n \n\n \n\ntotal: 522 points\n\n \n\n \n\nP.S. : The scoring system still seems to need a bit of tweaking... :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited January 14, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=954160","commentId":954160,"userName":"Pharmboys2013","timestamp":1389716638,"content":"ugh screw the scoring at this point, this is all just for fun and something to try anyway.  Thanks for the great recaps tho!\n\n \n\nmy lore attempt:\n\n \n\nI figured Lore would be the easiest of the 4 spheres with all it's healing, and while the archery truly posed no threat (no pun intended), I still struggled in other areas.  Particularly willpower which while is a known weakness of lore, came to the forefront of my playing experiences particular against some tricky locations like overgrown trail, secluded glade, and ancestral clearing.  I often relied on my heroes for the will power necessary to progress but untimely cards like stars in the sky really set me back.  While I was able to win all 3 of my attempts, this lack of willpower resulted in particularly long games...not ideal in a scoring competition (although at this point I'm so over the scoring).  The surprise of my deck was definitely Bombur, I named him as a bonus hero inclusion since he essentially has a dead ability within the rules but his 5 hit points alone was able to soak up damage like a boss.  Equipped with self-preservation, some boots from erebor, and bonus healing from Elrond's effect, the portly dwarf took arrows to the face all day and didnt care.  It was really enjoyable using a hero out of context but still finding a way to play to their strengths.\n\n \n\nHeroes: Mirlonde (Silvan, FFG-created, Underated) Bombur (Dwarf, Ham-Lover, Barrel Scene) Elrond (Noldor, Noble, Hugo Weaving)\n\n \n\nResults:\n\n \n\ngame 1: win 138\n\ngame 2: win 147\n\ngame 3: win 171\n\nbonus:          -30\n\n \n\ntotal:  426"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=954423","commentId":954423,"userName":"faith_star83","timestamp":1389733399,"content":"@Pharmboys, nice traits you have on your heroes ;-)\n\n \n\nThanks for the effort of elaborating this challenge guys. As a casual player, this is quite challenging, I did not manage to build a Lore deck to beat this deck mono-sphere, but with my tactics deck I had mediocre succes (so far the weakest score it seems):\n\n \n\nGame 1: 180\n\nGame 2:166\n\nGame 3: 200 (Loss due to Threat: 50)\n\n \n\nTotal: 546\n\n \n\nHeroes: Theoden, Thalin, Beregond\n\n \n\nThe first two games were actually quite simple, it just took forever to pile up the progress tokens. Thanks to Defender of Rammas, Winged Guardian and Gondorian Shield on Beregond I finished stage 3 in the first turn. Since the enemies have very low hit-points Spear of the Citadel + Thalin + Gondorian Spearman worked like a charm.\n\n \n\nThe third game, I lost due to drawing three Secluded Glades in a row in the first 5 turns. That was just too much for the low Willpower in the beginning stages of this deck.\n\n \n\nI know many players here don't like Theoden (mainly because he's not so thematic?) but in this deck he worked very well. I really like how he goes nuts with Thalin as a combo...from a pure gameplay perspective, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=954428","commentId":954428,"userName":"Pharmboys2013","timestamp":1389733715,"content":"Finished up leadership:\n\n \n\nDespite the one loss i had this deck, i was actually surprised by how well it did.  No healing was obviously a problem as in each game all of my characters were near death, but the will power boosts from faramir and visionary leadership did wonders in regards to questing quickly and dealing with enemies in stage 3.  Even on my loss i made it to stage 3 but just became overcome with enemies and was unable to pull through for the win.  I felt the uselessness of Elrohir this time unlike bombur in my lore attempt, outside of his average 2 will power he really contributed nothing else to the games, most times it was completely up to Boromir and whatever allies i could muster to do all the heavy lifting \n\n \n\nHeroes: Boromir (Gondor, Warrior, Noble, Ned Stark) Sam (Hobbit, Po-ta-toes, Rudy) Elrohir (Noldor, Noble, Ranger)\n\ngame 1: win  112\n\ngame 2: win  153\n\ngame 3 loss   200\n\nbonus:           -30\n\nTotal:            435\n\n \n\nRunning total thru 2 spheres:  861"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=954433","commentId":954433,"userName":"Pharmboys2013","timestamp":1389733854,"content":"> @Pharmboys, nice traits you have on your heroes ;-)\n> \n>  \n> \n> Thanks for the effort of elaborating this challenge guys. As a casual player, this is quite challenging, I did not manage to build a Lore deck to beat this deck mono-sphere, but with my tactics deck I had mediocre succes (so far the weakest score it seems):\n> \n>  \n> \n> Game 1: 180\n> \n> Game 2:166\n> \n> Game 3: 200 (Loss due to Threat: 50)\n> \n>  \n> \n> Total: 546\n> \n>  \n> \n> Heroes: Theoden, Thalin, Beregond\n> \n>  \n> \n> The first two games were actually quite simple, it just took forever to pile up the progress tokens. Thanks to Defender of Rammas, Winged Guardian and Gondorian Shield on Beregond I finished stage 3 in the first turn. Since the enemies have very low hit-points Spear of the Citadel + Thalin + Gondorian Spearman worked like a charm.\n> \n>  \n> \n> The third game, I lost due to drawing three Secluded Glades in a row in the first 5 turns. That was just too much for the low Willpower in the beginning stages of this deck.\n> \n>  \n> \n> I know many players here don't like Theoden (mainly because he's not so thematic?) but in this deck he worked very well. I really like how he goes nuts with Thalin as a combo...from a pure gameplay perspective, of course.\n\n \n\nthanks for the contribution!\n\n \n\nIn your defense, I think Tactics will be the hardest sphere to complete this with.  Theoden is going to be a must have in each attempt I'm sure.  I'll probably save it for last ha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=956652","commentId":956652,"userName":"chuckles","timestamp":1389957408,"content":"Mono Leadership:\n\n \n\nSam Gamgee (Hobbit), Balin (Dwarf), Boromir (Gondor, Warrior, Noble).\n\n \n\nGame 1: 200 (Loss)  - 11th round, Heroes died out during the final Quest... so close. Had a Druadan Hunter enter the staging area for each of the first three rounds... killing an ally each time & peppering my heroes with archery damage... in the end the lack of allies in play + the archery damage left too much for the Heroes to do. Ironically I had two copies of Denethor Ally & sneak attack in my hand & something else I couldn't use at the end (All my Heroes had taken wounds by then)... if only it had been ANY other ally I might have just made it... should have considered the amount of archery damage before adding ally Denethor to my deck... it seemed so Fatherly for him to hang out with his two sons.\n\n \n\nGame 2: 200 (Loss)  - 6th round Heroes died... well ok only two Heroes would have died in the sixth round...I quit... had a crazy amounts of high threat locations and so I risked questing with everyone (fail)... a Druadan Thief surged into two enemies... which, unfortunately was too much for my arrow cushioned Heroes... \n\n \n\nGame 3: 153 (win) ..Phew!\n\n \n\nSo HATE PROWL!! ...Equally not fond of treacheries effecting Heroes that no longer have no resources due to prowl!\n\n \n\nI think that I should have been able to win two of the three...but oh well ... next stop Lore... think i'm need of some healing ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nEdit... forgot about \"While Dru-buri-Dru is in the victory display, characters get +1 [Willpower] and +1 [Defense].\"  *wonders if that would have made a difference to game 1*\n\nEdited January 19, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958173","commentId":958173,"userName":"chuckles","timestamp":1390114957,"content":"Mono Lore\n\n \n\nHeroes: Mirlonde (Silvan), Elrond (Noldor. Noble ) & Aragorn (Dunedain. Ranger)\n\n \n\nGame 1: 151 (slow start cruised though)\n\nGame 2: 156 \n\nGame 3: 132 (faster game... though no healing for except for Silvan's via Silvan tracker. Certainly made life interesting. Sacrificed Mirlonde to finish off Dru-buri-Dru more quickly... only to have a shadow card return him to the staging area)\n\n \n\nnext stop mono Tactics... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958245","commentId":958245,"userName":"chuckles","timestamp":1390133897,"content":"Mono Tactics:\n\n \n\nTheoden, (Rohan.Noble. Warrior), Brand son of Bain (Dale), Merry (Hobbit)\n\n \n\nGame 1: lost (200)... over run by locations\n\nGame 2: lost (200)... over run by everything.\n\nGame 3: won (151)... think I got quite lucky\n\n \n\n(Game 4: won (154)...  Gandalf (Hobbit version) arrived just in time to save the day, his questing being enough to complete 2nd and 3rd quests and being a big help persuading Dru-Buri-Dru in between. Towards the end though, the other Heroes & Allies were getting quite nervous about the additional threat he was generating... so it was a good thing that we powered though the final quest without needing to have any embarrassing conversations... concerning a certain wizard being asked to leave the party)\n\n \n\nPity this game wasn't one of the three... maybe i should of had a practice round. (Probably would have won if I had)\n\n \n\nJust Spirit to go... \n\nEdited January 19, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958325","commentId":958325,"userName":"leptokurt","timestamp":1390142563,"content":"Next stop: Leadership!\n\n \n\nI considered this to be one of the easier challenges, and I didn#t get disappointed. Leadership helps you to create more resources than your enemies can prowl from you. Additionally, Gondor and dwarfs have cool synergies that boost both your WP and ATT. There's also enough HP on your allies to takes some ranged damage. All and in all I did't face any serious problems, even these Gardens of Poison could only slow my fellowship down, but not break them.\n\n \n\n \n\nHeroes:\n\n \n\nSam Gamgee (Hobbit. Best Friend.), Dain Ironfoot (Dwarf. Unnoble King.), Boromir (Gondor. Warrior. Noble. Cool.)\n\n \n\n \n\nResults:\n\n \n\ngame 1: win, score 130\n\n \n\ngame 2: win, score 121\n\n \n\ngame 3: win, score 131\n\n \n\n \n\n \n\ntotal:  382 points\n\n \n\n \n\nMy best result so far, unsurprisingly. In my first game I had an early Denethor plus Visionary Leadership to boost my questing progress. I managed to avoid any damage on my heroes until the end of the game, and Bill (in German: Lutz) the Pony saved the day by blocking two 4 ATT enemies. I even got a third copy of Bill that made it out of the forest.\n\n \n\nThe second game started with a Stewrad of Gondor in my starting hand, and I never got an encounter that I didn't want to see.\n\n \n\nIn my third game I encountered 3 Ancestral Clearings in a row (sometimes I ask myself why I'm even shuffeling...) and while I was clearing the clearings I could build up a strong fellowship with Faramir and some of his Gondorian pals. A midgame copy of Visionary Leadership sealed the deal.\n\nEdited January 19, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958534","commentId":958534,"userName":"faith_star83","timestamp":1390154165,"content":"Mono Leadership Results\n\n \n\nHeroes: Aragorn, Gloin, Theodred\n\n \n\nResults: 200 (Loss), 148, 143\n\n \n\nTotal Points: 491\n\n \n\nThe deck performes very well against this scenario, because I have a lot of resource generation and willpower boost in the deck. I lost the first round due to heavy pressing by enemies and very bad draws from the deck. I was being prevented from gaining resources due to poisonous forest all the time and the prowl effects made sure I couldn't even travel and explore there. 3 Gandalf on hand but no Sneak Attacks made me ultimately run out of options. \n\n \n\nThe other two games were fairly easy. Funny thing: In the last round I did not use Gandalf once, in the second game I used him quite extensively to deal with enemies.\n\n \n\nNext up: Mono Lore"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958873","commentId":958873,"userName":"leptokurt","timestamp":1390173503,"content":"Last, but not least: Lore!\n\n \n\n \n\nI am angry. That's why I only say two words: bad. shuffeling.\n\n \n\n \n\nHeroes:\n\n \n\nMirlonde (Silvan. Sneaky.), Bilbo Baggins (Hobbit. Fashion Victim.), Aragorn (Dunedain. Ranger. Hard Drinking.)\n\n \n\n \n\nResults:\n\n \n\ngame 1: win, score 116\n\n \n\ngame 2: loss, score 200\n\n \n\ngame 3: win, score 123\n\n \n\n \n\n \n\ntotal:  439 points\n\n \n\n \n\n \n\n \n\nHere are the enounters from game 2 and 3:\n\n \n\n \n\ngame 2: Men in the Dark, Druadan Elite, Druadan Drummer, Druadan Hunter, Overgrown Trail, Druadan Hunter, Druadan Thief/Glade of Cleansing\n\n \n\ngame 3: Secluded Glade, Garden of Poisons, Ancestral Clearing, Overgrown Trail, Overgrown Trail, Overgrown Trail, Lost Companion, Lost Companion, Druadan Elite, Men in the Dark, Druadan Elite\n\n \n\nI lost game 2, even two Warden of Healing couldn't repair all the damage inflicted to my fellowship. One of the most frustrating games ever. Game 3 was also frsutrating, and if I had not played Henamarth on turn 1 I would have lost that game. I was running out of threat after 4-5 turns, but thanks to Henamarth's scouting I could throw every single point of willpower into the quest.\n\n \n\nStill, I was tat convinced that lore would get me the best result. Very disappointing and frustrating end of this cycle. All in all it was fun though. Like I said, Druadan Forest is one of my favs, brilliant designa without being unfair, and excellently scaled for solo play.\n\n \n\n \n\n \n\nTOTAL END SCORE:\n\n \n\n400 + 522 + 382 + 439\n\n \n\n= 1743 points"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958911","commentId":958911,"userName":"Glowwyrm","timestamp":1390176237,"content":"Lore\nElf-stone let me get Hobbit Gandalf and Gildor in to help with the questing, and Asfaloth helped manage locations, which is why I used the under- appreciated Lorefindel (who is very good for solo mono Lore because of his willpower and Asfaloth).  Probably not coincidentally, the only quest I lost was the one I didn’t draw Asfaloth on.  Denethor was crucial to winning, and I think he’s the best card for this scenario solo.  I always knew when I needed to save my resources and when I needed to spend.    The direct damage from Poison Spikes and Expecting Mischief helped make short work of many Woses.\n\nGlorfindel, Denethor, Mirlonde\nAttempt 1:\n35 threat + 2 damage+ 7 rounds(x10) = 107\nA lucky run through.  Nothing but locations and weak enemies, and I had Asfaloth in my opening hand.\nAttempt 2:\n39 threat+0damage+8 threat for dead Mirlonde+ 8rounds (x10)= 127\nOops.  I over quested on the second stage, advancing to stage three before I was prepared to go there.  With all my heroes exhausted, Dru-buri-dru took out Mirlonde.  I breezed to a win anyway.\nAttempt 3:\nLost=200\nAfter a rough start, with a bunch of enemies coming out on the first few turns, I regrouped and came agonizingly close to finishing before I threated out. \nSphere total : 434\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958921","commentId":958921,"userName":"Glowwyrm","timestamp":1390177191,"content":"Leadership\nPretty simple strategy: Steward, Visionary Leadership, A Very Good Tale, Lots of cheap Gondor allies, sneak attack Gandalf, and quest like mad.  Rush through stage two, then Strength of Arms everyone for stage 3 to take down Dru-buri-dru.  It worked like a charm twice, totally failed the third.  In hindsight, I wish I would have tried someone other than Balin.  His ability is great, but I was either resource poor and had to transfer those to Boromir, or was so resource rich with a superior board position I didn’t care about shadow effects.  Sam’s value in leadership is immense, he really makes mono-leadership viable.\n\nBoromir, Sam, Balin\nAttempt 1: \n31 threat+ 8 damage+6 rounds =99\nA first turn Very Good Tale (exhausting Envoy of Pelargir and Pelargir Ship Captain) yielded Faramir, and the quest became a breeze.  Flew through the quest before the encounter deck could muster much against me. A late sneak attack Gandalf improved my score.\nAttempt 2:\n37 threat+ 5 damage +9 rounds=132\nSimilar to the first game, but not as lucky with my encounter draws.\nAttempt 3:\nLost=200\nMy loss was brutal.  Setup/first turn Druadan Elite and Glade of Cleansing.  I play enough allies to take the archery, block and kill it, but the shadow card returns it to the staging area.  Next turn, Druadan Hunter.  Take seven archery, block, hold back enough attack to kill the hunter, but shadow card returns it to the staging area.  Last turn I take another seven archery, everyone dies but Boromir, so I laughed and threw in the towel.\nSphere total: 431\n \n\nEdited January 20, 2014 by Glowwyrm"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958931","commentId":958931,"userName":"Glowwyrm","timestamp":1390177932,"content":"Tactics\nI tried some decks with Elladen, but I kept getting hammered, so I gave up and settled on a hero combination I enjoyed.  The key was using trained for war to battle quest through the end of stage two, so that my “high” willpower characters were ready to take down Dru-buri-dru in stage three (Beorn took the attack undefended unless I had a feint).  Beorn + Landroval = 19 possible damage soaked, and Tactics Bofur + Theoden and Merry meant a respectable 8 willpower first turn questing. \n\nHeroes: Theoden, Merry, Beorn\nAttempt 1:\n40 threat + 8 damage + 10 rounds (x10)= 148\nIt took me eight rounds to clear the first stage, and eight of my first nine encounter cards were locations or treacheries.  But in round nine, I played trained for war and blew through stage two in one shot, let Dru-buri-dru damage Beorn undefended, and swung back with all my will power to add him to the victory display.  Easily siege quested for victory the next turn.\nAttempt 2:\n40 threat + 4 damage + 10 rounds (x10) =144\nA more normal game, took my time through one and two, sped through stage three.  The best luck was drawing both of my feints just in time to face Dru-buri-dru.  Saved me from needing to use a Beorn-Landroval combo.\nAttempt 3:\nLoss=200\nAnother loss to end my run, mostly because I took a big gamble.  Locations were piling up in the staging area on stage two, so I spent all my resources to drop in allies and make a trained for war push to stage three.  I would then sacrifice Beorn to Dru-buri dru (already used Landroval because of an unusually high number of enemies in the early game) and have enough willpower to take Dru-buri dru down, then siege quest to victory.  Unfortunately, Dru-buri-dru returned to the staging area, and so Beorn died in vain.  I didn’t draw a feint, so Merry went down next turn, and I couldn’t come up with enough willpower to bring him down, so Theoden went down in the final round.\nSphere total: 492\n\nEdited January 20, 2014 by Glowwyrm"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958935","commentId":958935,"userName":"Glowwyrm","timestamp":1390178096,"content":"Spirit:\nMono-Spirit is my favorite deck archetype now since the release of Caldara and Hidden Cache.   As much as I wanted to include, Frodo’s damage cancellation is too good in this scenario, especially when facing down Dru-buri-dru.  The strategy was pretty simple, which is why I think I won all three games. Do nothing but quest and soak up damage through threat if possible for the first few rounds.  This built up a resource buffer that gave me the ability to respond to encounter cards.  Play Hobbit Gandalf in round three and start taking down some enemies, then play a few more allies (sometimes to soak up archery and protect Gandalf in stage 2) and charge to the last stage so that you can attack with willpower and take out enemies.\n\nGlorfindel, Frodo, Eowyn\nAttempt 1:\n44 threat + 4 damage + 6 rounds (x10) = 108\nThis was a 4 man show until the very end, with Hobbit Gandalf and the four heroes carrying the load.  I also had some really lucky encounter card draws.  The strategy above worked perfectly, and the last quest stage featured my only use of Against the Shadow ever.\n\nAttempt 2:\n32 threat + 6 damage +10 rounds (x10) = 138\nDifferent game from the first one.  Didn’t get Hobbit Gandalf until the very end, but I drew both of my Northern Trackers, and they helped carry the combat load.\n\nAttempt 3:\n46 threat + 2 damage + 9 rounds (x10) = 138\n4 man show again for the win.  My threat got all the way up to 49 before I dropped it back down with a timely Galadrihm’s Greeting and Elrond’s Counsel.\nSphere total: 384"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=958946","commentId":958946,"userName":"Glowwyrm","timestamp":1390179693,"content":"Fun challenge.  I rarely keep score when I play, so this was a fun and different way to think about deck building and in-game strategy.  I played aggressively, quested extra aggressively, and took a lot of risks. This lead to low scores, but also caused some of my losses.  This quest has a very different feel solo, and Dru-buri-dru can be challenging for spheres without great hero defensive options (or without enough willpower to attack him). \n\nGrand total:  434+431+492+384=1741"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=959109","commentId":959109,"userName":"leptokurt","timestamp":1390206414,"content":"> Fun challenge.  I rarely keep score when I play, so this was a fun and different way to think about deck building and in-game strategy.  I played aggressively, quested extra aggressively, and took a lot of risks. This lead to low scores, but also caused some of my losses.  This quest has a very different feel solo, and Dru-buri-dru can be challenging for spheres without great hero defensive options (or without enough willpower to attack him). \n> \n> Grand total:  434+431+492+384=1741\n\nCongrats Glowwyrm! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nWhy didn't you use White Tower Watchman to soak up the chieftain's damage?\n\n \n\nFunny thing is that I chose a different approach, playing cautiously and trying to plan for every possible encounter. But scorewise it didn't make that much a difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=959148","commentId":959148,"userName":"faith_star83","timestamp":1390213913,"content":"It is really interesting to paricipate in this kind of \"tournament\". Especially I realize that I seem to be a really \"slow\" Player, I almost never manage to finish quests under 10 rounds...quess I am not much of a risk taker :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Well, I still have to do this with Spirit and Lore and I totally forgot about the heroes that give 30 points bonus, too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=959181","commentId":959181,"userName":"leptokurt","timestamp":1390218416,"content":"> It is really interesting to paricipate in this kind of \"tournament\". Especially I realize that I seem to be a really \"slow\" Player, I almost never manage to finish quests under 10 rounds...quess I am not much of a risk taker :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Well, I still have to do this with Spirit and Lore and I totally forgot about the heroes that give 30 points bonus, too!\n\nThere's nothing wrong with being slow, as long as you win. Most players here consider the win-loss-ratio a more significant expression of a player's ability to play the game than the ability to achieve a top score in a single game. That's why we usually use the scoring system in combination with the win-loss-ratio.\n\n \n\n \n\nExample:\n\n \n\nyour tactics result would have been (180 + 166) * 3 (games) / 2 (wins)= 346 * 1.5 = 519 points\n\n \n\nmy tactics result would have been (219 + 133) * 3 / 2 = 352 * 1.5 = 528 - 30 points bonus = 498 points"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=959510","commentId":959510,"userName":"Glowwyrm","timestamp":1390242516,"content":">  \n> \n> > Fun challenge.  I rarely keep score when I play, so this was a fun and different way to think about deck building and in-game strategy.  I played aggressively, quested extra aggressively, and took a lot of risks. This lead to low scores, but also caused some of my losses.  This quest has a very different feel solo, and Dru-buri-dru can be challenging for spheres without great hero defensive options (or without enough willpower to attack him). \n> > \n> > Grand total:  434+431+492+384=1741\n> \n> Congrats Glowwyrm! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> Why didn't you use White Tower Watchman to soak up the chieftain's damage?\n> \n>  \n> \n> Funny thing is that I chose a different approach, playing cautiously and trying to plan for every possible encounter. But scorewise it didn't make that much a difference.\n> \n>  \n\nThe only sphere I used him in was leadership because he had some Gondor synergy.  For the rest of the decks, I wanted to have a reliable defensive option already in place so that I didn't have to rely on drawing him, and I didn't want to spend a full turns worth of resources on an ally that wasn't going to help me push through the quest.  The scoring system is strange in that losing Mirlonde didn't give me as big of a penalty as taking an extra round would have, so I prioritized finishing faster, even if it meant losing a hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=959518","commentId":959518,"userName":"Glowwyrm","timestamp":1390242897,"content":"> It is really interesting to paricipate in this kind of \"tournament\". Especially I realize that I seem to be a really \"slow\" Player, I almost never manage to finish quests under 10 rounds...quess I am not much of a risk taker :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Well, I still have to do this with Spirit and Lore and I totally forgot about the heroes that give 30 points bonus, too!\n\nI typically play much slower, depending on the scenario.  In some scenarios (like this one), it helps to move quickly so that the encounter deck doesn't have an opportunity to start making combos with itself.  In other scenarios, I prefer to take it slow, establish a strong position, and then move forward.  I agree with leptokurt, that I prefer winning a game to scoring well.  I hardly ever keep track of score, but it was fun for this challenge and made me take a different approach to the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=960318","commentId":960318,"userName":"-nebur-","timestamp":1390317322,"content":"Hi, I took the chance and tried your challenge too (great work/idea).\n\n \n\nAt the beginning I used leadership with Elrohir, Gloin and Sam.\n\n \n\nGame 1:             83    (6 Rounds, Threat 20)\n\nGame 2:           138    (9 Rounds, Threat 37, Gloin = Wose-Food :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] )\n\nGame 3:           100    (6 Rounds, Threat 29, Sam sacraficed)\n\nElrohir used:   -30\n\n \n\nTotal:               291\n\n \n\nWow...I never thought that this deck works so good.\n\nI'm fascinated by Gloin...even without healing-options his additional ressources made the beginning easier and 'King under the Mountain' and 'Durin's Song' did the rest\n\n \n\nMy Starting-Hand in Game 1 was nearly perfect:\n\n \n\n'Shadow of the Past'\n'Durin's Song'\n'We Are Not Idle'\n'King Under the Mountain'\n'Steward of Gondor'\n'Bill the Pony' \n\n \n\nalso I got  'Faramir'  early and I could use 'Gandalf' 3 times by 'Sneak Attack' and 'Tome of Atanator' .\n\nEdited January 21, 2014 by -nebur-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=960497","commentId":960497,"userName":"-nebur-","timestamp":1390325334,"content":"My next one is Tactics...Merry, Thalin, Theoden.\n\n \n\nGame 1:           126    (7 Rounds, Threat 47, Merry was lost somewhere in the forest :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] )\n\nGame 2:           103    (6 Rounds, Threat 43)\n\nGame 3:             92    (5 Rounds, Threat 38)\n\n \n\nTotal:               331\n\n \n\nVery lucky because in every Starting-Hand was a 'Gandalf' (Hobbit) and i could pay him in the second round...\n\nI started a 4th try and this time the Encounter-Deck stamped me into the ground...horrible reversal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=960891","commentId":960891,"userName":"Pharmboys2013","timestamp":1390343479,"content":"I'm glad to see everyone has been having fun with this now! Had a busy week and still need to finish two spheres. Happy questing all"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=961300","commentId":961300,"userName":"-nebur-","timestamp":1390396743,"content":"My Spirit-Team consists of Eowyn, Glorfindel and Pippin.\n\n \n\nGame 1:           102    (8 Rounds, Threat 21)\n\nGame 2:           200    (just enemies came...couldn't defeat them as fast as they killed me...stupid archery)\n\nGame 3:             78    (5 Rounds, Threat 25)\n\nPippin used:    -30\n\n \n\nTotal:                350\n\nEdited January 22, 2014 by -nebur-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=961355","commentId":961355,"userName":"-nebur-","timestamp":1390402218,"content":"Last and least Bifur, Mirlonde and Pippin.\n\n \n\nGame 1:           141    (10 Rounds, Threat 41)\n\nGame 2:           200    (argh...3 enemies and 'Ancestral Cleearing' <_< [//content.invisioncic.com/Mfantflight/emoticons/default_dry.png] )\n\nGame 3:             95    (7 Rounds, Threat 25)\n\n \n\nTotal:                436\n\n \n\n \n\nfinished...all in all it ran better than I expected and it was very funny...thanks again for this challange.\n\n \n\nLeadership:      291\n\nTactics:              331\n\nSpirit:                  350\n\nLore:                   436\n\n \n\nTotal:                1408\n\n \n\nOh, every game my score got worse...\n\nI never thought that my Tactics-Score will be better than Spirit and Lore...very strange.\n\nEdited January 22, 2014 by -nebur-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=961390","commentId":961390,"userName":"Bullroarer Took","timestamp":1390404112,"content":"> I never thought that my Tactics-Score will be better than Spirit and Lore...very strange.\n\nI think you already solved that riddle: Hobbit Gandalf on Turn 2 can work wonders, especially if it happens three games in a row."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=961503","commentId":961503,"userName":"-nebur-","timestamp":1390411772,"content":"Yes, sure...but I couldn't imagine before, that this could happen...very lucky, i know :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=961531","commentId":961531,"userName":"Mndela","timestamp":1390414334,"content":"Nebur is a good player. So i think 1408 points mayb be an amazing number ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=961564","commentId":961564,"userName":"leptokurt","timestamp":1390416753,"content":">  \n> \n> > I never thought that my Tactics-Score will be better than Spirit and Lore...very strange.\n> \n> I think you already solved that riddle: Hobbit Gandalf on Turn 2 can work wonders, especially if it happens three games in a row.\n> \n>  \n\nAgreed. I tried out that hero combo and the Gandalf approach and won 4 out of 5 games with outstanding results (~100 points). It's impressive how that fellowship can bulldoze through the forest straight to the chieftain. The only thing that's bothering me is Merry's low HP. I got Men in the Dark twice during the setup and had to play cautiously afterwards. Perhaps Elladan might be a better choice here, because of the bonus and the plus of HP.\n\n \n\nOtherwise: great idea and a well deserved lead! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited January 22, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=961991","commentId":961991,"userName":"-nebur-","timestamp":1390447118,"content":"Haha...thanks guys.\n\n \n\nI tried to let Merry at least 1 ressource if possible...getting 'Men in the Dark' at setup is of course very unlucky.\n\nI thought about Elladan, but I prefered the hobbit trait because of 'Halfling Determination', to have more ways for willpower.\n\nBesides Merry has 4 threat less than Elladan so the bonus isn't so big and 4 threat means 2 rounds for 'Gandalf'. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited January 23, 2014 by -nebur-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=962505","commentId":962505,"userName":"Pharmboys2013","timestamp":1390498610,"content":"Spirit Time\n\n \n\nFigured i'd try out Caldara has i had thus far neglected her and I was quite pleased with the results.  I actually only used her ability once, but it was incredibly timely as it allowed me to get the extra point of atk power i needed to kill off a druadan elite.  I was then able to play her the next turn with Fortune or Fate at a discounted cost since I used a hidden chache i had drawn to grab a good meal for frodo which I new was on top from stargazer.  Very satisfying combo overall.  I thought I would have more trouble with spirit since it lacks attack power and everyone but Glorfindel has low hp, but just the sheer questing power allowed me to plow thru stages.  The hobbit Gandalf was incredibly helpful in games 2 and 3 as well, playing him within the first few turns set me up to be basically invulnerable and his threat increase was not a big deal because...spirit, duh.\n\n \n\nFrodo (Hobbit), Glorfindel, (Noldor, Noble, Warrior) Caldara (Gondor)\n\n \n\nGame1: win 131\n\ngame2:  win 103\n\nGame3: win 136\n\ntotal:            370\n\n \n\ntotal thru 3 spheres: 1231"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=962751","commentId":962751,"userName":"Glowwyrm","timestamp":1390510211,"content":"Well done -nebur-!  I like your approach with all the low threat heroes, aggressive questing and Hobbit Gandalf.  Congrats on taking the lead!\n\nOne thing I've noticed is that all the Tactics players have used Theoden.  He's absolutely essential to solo mono tactics, and really makes it a viable deck type.  I've used Theoden decks to beat many quests that Tactics would have been hopeless against without him.  There's been a lot of Theoden hate in the community, but he definitely makes solo mono-tactics a viable deck type."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=963925","commentId":963925,"userName":"Pharmboys2013","timestamp":1390604913,"content":"yea, i've been saving the hardest for last though, will be interesting to see how tactics does 4 me personally"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=965150","commentId":965150,"userName":"CaffeineAddict","timestamp":1390766511,"content":"So I only spent about 5 minutes throwing each deck together, but I started on the challenge with A Leadership deck, and a lore deck.\n\n\n \n\n\nLeadership:\n\n\nAragorn, Gloin, Sam Gamgee\n\n\nI went with lots of cheap allies (as mahy as possible with at least 2 hit points, so i could spread archery damage around), and attachments like sword that was broken, celebrian's stone, king under the mountain, with faramir as a booster.\n\n\n \n\n\nThis worked generally quite well.\n\n\n \n\n\nGame 2 gloin died in about round 3, but aragorn had sword, stone and steward, and i had farmair on the board. A bunch of cheap allies turned into quite the fighting force, despite the loss of a hero.\n\n\n \n\n\n \n\n\nGame 1: 40 Threat, 7 Rounds, 6 damage on heroes = 116\n\n\nGame 2: 43 Threat, 10 rounds, 3 damage on aragorn, gloin dead = 155.\n\n\nGame 3: 37 Threat, 7 rounds, 8 damage (split across all three heroes) = 115\n\n\n \n\n\nLeadership total: 386\n\n\n \n\n\nLore:\n\n\nAragorn, Elrond, Mirlonde\n\n\n \n\n\nI went with encounter deck manipulation and healing, card draw and protector of lorien. Not as happy with this deck as the leadership one - lore is probably my least-played sphere, so i probably missed a bunch of tricks i could have worked in. Game 1 was a loss due to threat, as i got few allies out and could only hold my ground with heros, without making much progress.\n\n\n \n\n\nGame 1: 200 (loss due to threat)\n\n\nGame 2: 31 Threat, 12 rounds, 0 damage = 151\n\n\nGame 3: 30 Threat, 11 rounds, 3 damage = 143\n\n\n \n\n\nLore Total: 494\n\n\n \n\n\nTotal so far: 494 + 386 = 880\n\nEdited January 26, 2014 by CaffeineAddict"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=965244","commentId":965244,"userName":"CaffeineAddict","timestamp":1390774399,"content":"Built up a spirit deck and a tactics deck, and played through to complete the challenge.\n\n \n\nSpirit:\n\nEowyn, Glorfindel, Frodo\n\n \n\nLots of threat reduction, cheap allies, and cards to recycle my events. Used the hobbit version of Gandalf, who came out early in 2 out of three games. The best performance overall from the spirit deck.\n\n \n\nGame 1: 25 Threat, 5 Rounds, 4 damage = 79\n\nGame 2: 43 Threat, 5 Rounds, 3 Damage = 96\n\nGame 3: 26 Threat, 5 Rounds, 2 Damage = 78\n\n \n\nfor a total of 253 for spirit.\n\n \n\nTactics:\n\nTheoden, Gimli, Merry\n\n \n\nI chose tactics heroes that all had 2 willpower, so that with theoden's bonus they could all quest for 3, and be able to take the main guy at the end, for which i reserved a feint (or reused one with the book). a final push on the siege stage was done by defender of rammas, and the eagles. I used Gandalf from the Hobbit for some extra willpower, but he didn't make an appearance until game 3.\n\n \n\nGame 1: 200 - all heroes died.\n\nGame 2: 43 Threat, 11 rounds, 5 damage = 158\n\nGame 3: 46 Threat, 7 rounds, 3 damage = 119\n\n \n\nTactics total: 477\n\n \n\nTotal for all four spheres: 477 + 253 + 494 + 386 = 1610\n\n \n\nSo a total score of 1610. Not the lowest score reported here, but I was fairly pleased with it, given that the four decks had a collected deckbuilding time of about 25 minutes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=965489","commentId":965489,"userName":"Pharmboys2013","timestamp":1390803996,"content":"Finally finished my own challenge ha, \n\nLast and kind of least, was mono-tactics...as expected it produced the worst scores of the 4 spheres\n\n \n\nThe challenge was definitely will power, even with Theoden king pumping up himself and Elladan, it was often barely enough to clear locations or pass quest stages with any kind of efficiency.  I relied on expensive allies like Bofur, Farmer Maggot, and Eagles of the Misty Mountains, just for a few extra points of breathing room.  Also included Hobbit Gandalf in this deck as i felt his will power would be worth the gambit since I already have a high starting threat but I only got him out once towards the end of the second game.  Most times between clearing active locations and the threat level in the staging area I only ever made what felt like 2-4 net progress per round.  As expected combat was fine though, Beregond did all the heavy lifting defesnively and although the will power absence was tough for the Dru-buri-dru fight, i usually only had to save Theoden and Elladan for a turn to attack to take him down along with a select few other allies.\n\n \n\noverall i had a fun time with this and i hope everyone else did too.  hopefully we get some new news to tide us over this week!\n\n \n\nHeroes: Elladan, Theoden, Beregond\n\n \n\nGame 1: loss - 200\n\nGame 2: win  - 168\n\nGame 3: win -  164\n\nHero bonus      (-30)\n\ntotal:                497\n\n \n\ntotal thru 4 spheres: 1,725 \n\nEdited January 27, 2014 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=965491","commentId":965491,"userName":"Pharmboys2013","timestamp":1390804416,"content":"Power Rankings:\n\n \n\n1. Nebur-                1408\n\n2. CaffeineAddict-   1610\n\n3. Pharmboys-        1725\n\n4. Glowwyrm-         1741\n\n5. Leptokurt-           1743"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=965608","commentId":965608,"userName":"leptokurt","timestamp":1390826410,"content":"Wait, I thought we were supposed to get as many points as possible... :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\n*shakes fist at Glowwyrm*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=965617","commentId":965617,"userName":"-nebur-","timestamp":1390827705,"content":"This victory belongs to the whole team but my special-thanks are going to 'Gandalf', who was my all-game-back up and appeared very often...\n\nI think he was claimed by me most of the time...so he could't help you. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited January 27, 2014 by -nebur-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96660-solo-mono-challenge-4-druadan-forest/?do=findComment&comment=965629","commentId":965629,"userName":"servant of the secret fire","timestamp":1390829837,"content":"I just love how Gandalf acts in this game.He is like in the books.He leaves you alone in the most dangerous places but wen all hope has fade and you think you are doomed he appears from nowhere and saves the day.\n\n \n\nWell done FFG well done.\n\n \n\nps:i want to see how Gandalf the white will be."}]}