{"url":"https://community.fantasyflightgames.com/topic/96802-online-tournament/","title":"Online Tournament","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96802-online-tournament/?do=findComment&comment=953218","commentId":953218,"userName":"Zjb12","timestamp":1389629051,"content":"Hi!  I am reposting this to hopefully hit outside the player community thread.\n\n \n\nSome of us have been talking the last week or so about starting/restarting up the online tournaments that people like Juicebox use to hold.\n\n \n\nIf we did so, we'd liely start out simple with something like everyone being invited to play the first scenario of Heirs of Numenor.  You would play three games, (with no chagnes in between to your decks or heroes) record your scores/losses, heroes, and other pertinent info and then make an overall scoreboard.  Decks would be normal rules with all cards allowed, (as opposed to restricting to certain sets, etc.)\n\n \n\nPlease let us know your thoughts, suggestions, and questions.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96802-online-tournament/?do=findComment&comment=953684","commentId":953684,"userName":"Narsil0420","timestamp":1389659753,"content":"Let's do it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96802-online-tournament/?do=findComment&comment=958237","commentId":958237,"userName":"Legoland","timestamp":1390131530,"content":"Still be willing to beat the best score ;D"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96802-online-tournament/?do=findComment&comment=959083","commentId":959083,"userName":"Vase","timestamp":1390201571,"content":"Hey, I think we ought to follow the suggestion on the other thread to just start off slow, not wait a long time planning it out first.  It probably won't generate much interest until something is actually happening.  I am still anxious for some friendly competition!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96802-online-tournament/?do=findComment&comment=960302","commentId":960302,"userName":"divinityofnumber","timestamp":1390316384,"content":"It would be cool if people had the ability to video record their games. Perhaps we could let the tournament go for a while, and then the people with the top X scores are placed in a bracket, and face off for the titles. But, the games in that final bracket would have to be streamed or video recorded. "}]}