{"url":"https://community.fantasyflightgames.com/topic/96861-a-few-questions-regarding-songs-and-silvan-refugee/","title":"A few questions regarding songs and silvan refugee","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96861-a-few-questions-regarding-songs-and-silvan-refugee/?do=findComment&comment=954047","commentId":954047,"userName":"IchabodtheShadow","timestamp":1389705844,"content":"I'm curious, if I have silvan refugee in play and somebody plays sneak attack, when the character is returned to the owners hand does that count as a character leaving play for silvan refugee?\n\nRegarding songs that give heroes various resource icons, does that effect cards that require a hero to have a printed resource icon? For example if I use song of wisdom to add a lore icon to a non lore hero, can I then use a card that requires a hero with a printed lore icon?\n\nBoth of these things seem simple and obvious but I'm just double checking.\n\nThanks in advanced!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96861-a-few-questions-regarding-songs-and-silvan-refugee/?do=findComment&comment=954063","commentId":954063,"userName":"Thanatopsis","timestamp":1389707277,"content":"Sneak Attack states: \"Action: Put 1 ally card into play from your hand. At the end of the phase, if that ally is still in play, return it to your hand.\"\n\nSilvan Refugee states: \"Forced: After a character leaves play, discard Silvan Refugee from play.\"\n\n \n\nYes, Sneak Attack causing an ally to return to your hand does count as character leaving play. \n\n- An ally on the table is considered \"in play\". it does not matter how it got there. \n\n- An ally being picked up off the table is leaving play.  It does not matter what game affect is doing it.\n\n \n\nThe song cards do not provide printed resource icons... I suppose only the FGG manufacturing process can do that ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThe term \"printed\" I believe was put into use to  prevent players from using songs to make these cards work.  There was probably too much room for abuse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96861-a-few-questions-regarding-songs-and-silvan-refugee/?do=findComment&comment=954070","commentId":954070,"userName":"IchabodtheShadow","timestamp":1389708700,"content":"Indeed, that's what I thought on both subjects, thanks for the reply"}]}