{"url":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/","title":"Feeling on Against the Shadow Cycle?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954201","commentId":954201,"userName":"GalaxyUC","timestamp":1389719962,"content":"I suck at this game...I suck REAL bad, like can barely beat Passage Through Mirkwood bad and end up killed by Spiders and Locations. I have given this game up THREE TIMES!!! Sold and Traded away because I don't have time to \"deck-build\". I'm here for the story and narrative. Core Set through Dwerrowdelf didn't do enough for me to keep playing, so I gave up.\n\n \n\nthen...came easy mode. Awesome! Finally! I just want to form thematic teams of heroes, not justify in my game brain why Denethor and Eowyn and Aragorn would be traveling together. Well...I still suck at this game even on easy mode. But, I can see myself winning soon with a couple of adjustments.\n\n \n\nThat all being said, the other thing that brought me back was the potential of the cycle in reference! When I saw a whole page of Story/flavor Text, I thought, YES! This is what I'm talking about! Then, I picked up an opened a AP for this cycle and boom! More story on the back for after you win the AP!!! I felt this kicked ass and am now still ready to keep going.\n\n \n\nWas the narrative and story entries appreciated by LotR players??\n\n \n\nDo you think Voice if Isengard will continue this trend or do you think it will revert back to Shadows of Mirkwood Style?? If so, I may be moving toward the door again.\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954210","commentId":954210,"userName":"Gizlivadi","timestamp":1389720426,"content":"Caleb (the current lead designer for the game) has explicitly said that they want to really push the narrative aspect of the game for future cycles, so I think it's pretty safe to say that the ATS trend will continue with VOI and the Ring-maker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954258","commentId":954258,"userName":"Raven1015","timestamp":1389723287,"content":"Yeah, given the title of the cycle and what we've already seen, I expect this next cycle to be absolutely steeped in lore. I'd stay on board  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited January 14, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954364","commentId":954364,"userName":"soldat7","timestamp":1389729180,"content":"I just wish they would incorporate the story and AP rules and whatever flavor text on a series of cards. I can't stand the loose-leaf papers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954383","commentId":954383,"userName":"Raven1015","timestamp":1389730319,"content":"That's true. That's one nice aspect of the print on demand expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954425","commentId":954425,"userName":"faith_star83","timestamp":1389733669,"content":"I also really enjoy how the developerrs decided to emphasize the story-telling aspect of the game. I think this aspect sets the game much further apart from competitive games than the mere \"it's a co-op game\" aspect.\n\n \n\nEspecially when considering how thick and richly filled with stories the Middle-Earth Mythology I am really happy and greatful that the designers make good of this and create funny and diverse quests with a nice background story :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954759","commentId":954759,"userName":"Nerdmeister","timestamp":1389768680,"content":"I just have to ad that when I saw the plot twist for the last AP in this cycle, my jaw dropped and I went \"w0000000t\".\n\n \n\nDidn´t think that was possible in a card game  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954809","commentId":954809,"userName":"Tracker1","timestamp":1389778008,"content":"If the designers want to keep this game alive after the last Saga expansion is delivered in 2 to 3 years, they need to invest heavily in the story that they themselves create. They will have to explore unchartered territory while trying to stay true to the theme and history of Middle Earth. We see this with the hero card Grima. They come up with a \"what if\" story for this card and paint an alternate picture of a villain as a hero that Tolkien never alluded to. The \"what if\" type of story line might very well continue and I think the designers can certainly continue to make middle earth interesting since there is a ton of material to work with, they will just need to write their own history, unless of course they get the rights to other Tolkien works, for more Saga expansions. It does make me hopeful that the game may continue on, as long as players are still interested at that point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954915","commentId":954915,"userName":"GalaxyUC","timestamp":1389797798,"content":"As a player returning for a THIRD time, I will tell you that EASY mode got me interested in again, but I was so spurned by the game that it was way low on my priority list. But, when I started reading some of the PDF's from AtS cycle here on FFG I said well, this is pretty awesome! I just wish I could quest and play the game with the Heroes that I want, instead of having to use the Hero combinations that can win, which may mean two if not one sphere. That's the last hump for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=954966","commentId":954966,"userName":"faith_star83","timestamp":1389803051,"content":"Well, I am sure we will still get many alternate versions of the heroes that we already one or two versions of in the future. Or at least I hope so, because it will widen or options - especially for thematic players. Since we only ever get 1 hero per AP and 2 per DE it might take a while though until can you build your dream deck with exactly the characters you want :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nAlso, I wanted to admit that I actually prefer the paper version of the leaflets with the story and special rules for the APs. I can keep them neatly in my card binder and don't have to fiddle around with additional cards that are not part of my deck. I am very happy also that FFG kindly provides the pdf versions on the homepage, this way we can store it on smartphones or tablets for quick referencing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=955024","commentId":955024,"userName":"Khamul The Easterling","timestamp":1389806717,"content":"> I just wish they would incorporate the story and AP rules and whatever flavor text on a series of cards. I can't stand the loose-leaf papers.\n\nI take all the AP story/rule sheets, set them under some really heavy books for a day to flatten them out, three hole punch them, and then put them in a three ring binder all sorted nicely.  So when I want to read the story or look at a certain rule, I just take out my nice little three ring binder and page through sheets until I find the right one and its really nice.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=955291","commentId":955291,"userName":"Mogloth","timestamp":1389823536,"content":"*in best Peter Griffin voice*\n\n \n\nWhoah whoah whoah whoah whoah.\n\n \n\nWhat is this whole PDF story thing? I only have the core and the Hobbit expansions. Where can I find these things at? All I've found are rule books."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=955406","commentId":955406,"userName":"Dain Ironfoot","timestamp":1389832644,"content":"> *in best Peter Griffin voice*\n> \n>  \n> \n> Whoah whoah whoah whoah whoah.\n> \n>  \n> \n> What is this whole PDF story thing? I only have the core and the Hobbit expansions. Where can I find these things at? All I've found are rule books.\n\neach AP has mini story elements in the rules insert...however, the Against the Shadow cycle (along with the corresponding deluxe expansion: Heirs of Numenor) have much more fleshed out stories in their rules inserts. They designers were really going for a strong narrative.\n\n \n\nHowever, with that said, the Heirs of Numenor and AtS quests can be quite hard - and you might not quite want to pick them up until you've acquired a few more expansion. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=955415","commentId":955415,"userName":"Mogloth","timestamp":1389833478,"content":"Oh, I plan on getting all the packs in order if possible. I'm looking forward to the Mirkwood stuff coming back out in a couple of weeks. \n\n \n\nI just saw faith_star mention something about these story points being in PDF form on the homepage. I hadn't seen those. Would love to read em. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=955419","commentId":955419,"userName":"Raven1015","timestamp":1389833931,"content":"For your reading pleasure: http://fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4 [http://fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=955865","commentId":955865,"userName":"Style75","timestamp":1389885784,"content":"Easy mode is the way to go if you're primarily interested in story and flavor and not building uber-decks. On easy mode you still get a good feel for the encounter deck, but you're able to build thematic decks that are not cutting edge powerful. If you want a bit more challenge, try \"medium mode\". You keep all of the encounter cards but start with one resource per hero and draw a seven card starting hand instead of six."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96871-feeling-on-against-the-shadow-cycle/?do=findComment&comment=956059","commentId":956059,"userName":"GalaxyUC","timestamp":1389901207,"content":"EASY MODE is still very hard solo I have found. I really don't know how you guys do it WITH shadow effects and regular resource draw. To me, that makes the game IMPOSSIBBLE solo. So, I just got a rude awakening from a Hill Troll in the second Core Scenario...man! If you don't have a Questing Character with 4+, it's over before it starts!"}]}