{"url":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/","title":"Hill Troll and Goblin Sniper rules","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=954846","commentId":954846,"userName":"georgioos","timestamp":1389786980,"content":"Hill Troll rule:\n\n\"Excess combat damage dealt by Hill Troll (damage that is dealt beyond the remaining hit points of the character damaged by its attack) must be assigned as an increase to your threat.\"\n\n \n\nif i use sentinel to defend troll which player increases his thread from the remaining damage? Engaged player or player using his sentinel character to defend?\n\n \n\nGoblin Sniper rule:\n\n\"During the encounter phase, players cannot optionally engage Goblin Sniper if there are other enemies in the staging area.\"\n\n \n\nIf two goblin snipers are in staging area i am stuck with them there until the end of the game? they have 48 engagment cost!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=954864","commentId":954864,"userName":"Nerdmeister","timestamp":1389790656,"content":"1) The player engaged gets the threat increase\n\n \n\n2) Neither Goblin Snipe is eligible to be engaged. Try using other tricks to damage them in the staging area or engage them with a Son of Arnor. Plenty of possibilities.\n\n \n\nmed_son-of-arnor-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_son-of-arnor-core.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=955173","commentId":955173,"userName":"chuckles","timestamp":1389817283,"content":"Not that you asked for solutions and Nerdmister answered your questions... but as i'm having withdraw symptoms from lack of playing time, I've listed all the various cards, I could think of, that could target two goblin snipers... \n\n \n\n> \n\n \n\n2) Yes.. and if you only had the core set then I think Son of Arnor, Dunhere or Gandalf are your only options to engage/destroy them). You could play Gloin and including healing like self preservation... and get two extra resources a round.\n\n \n\nHowever... Going forward; Hail of stones, Thalin + Fresh tracks or Beorning beekeeper (a very popular expensive card), hands upon the bow, Great Yew Bow,  Forth Eorlinglas!, descendant of Thorondor, ranger bow, knights of Minas Tirith (though playing mono tactics isn't to be considered lightly... a bit like strolling into Mordor), the hammer stroke, infighting...\n\n \n\nOr scrying with Denethor/Henamarth + expecting mischief, poison spikes, ithilen pit...\n\n \n\nand I'm bound to have forgotten a few things "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=955544","commentId":955544,"userName":"GrandSpleen","timestamp":1389846035,"content":">  \n> \n> and I'm bound to have forgotten a few things \n> \n>  \n\n \n\nYes, one of my favorites!\n\n \n\nM1632.png [http://hallofbeorn.com/Images/Cards/M1632.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=956051","commentId":956051,"userName":"chuckles","timestamp":1389900833,"content":"Ah... it was bound to happen. Don't believe I have ever used that card..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=956456","commentId":956456,"userName":"GrandSpleen","timestamp":1389928020,"content":"Very fun paired with Bard or an elf with a Rivendell Blade.  Or two Rivendell Blades!  Bye-bye, Cave-troll!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=957458","commentId":957458,"userName":"chuckles","timestamp":1390026774,"content":"Hmmm... must try that. Thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=975806","commentId":975806,"userName":"la1cajun","timestamp":1391704798,"content":"What if a weapon doesnt have a exhaust option and its just there with a buff. I guess what i mean is if you exhaust a weapon thats not meant to be exhausted for anything what is the purpose of exhausting it. Like can I still attack with it that round and use its abilites that you dont need to exhaust to use? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=975840","commentId":975840,"userName":"alogos","timestamp":1391706415,"content":"The purpose of exhausting it is to limit the number of time you use it.\n\nLike Steward of Gondor...\n\nIf it is exhaust by its text or by another card is unimportant, just see it as a limitation.\n\n \n\nIf you want an exemple, foe hammer could be overpowered if you could play 3 of them in one go.\n\nExhausting weapon seems to be a design for using them for special tactics cards, they might provide more cards that works that way in the future. Also, imagine a treachery cards that exhaust all attachements in play, it might comes one day..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=976102","commentId":976102,"userName":"GrandSpleen","timestamp":1391718524,"content":"In other words, you may exhaust any weapon when using \"Foe hammer\" or \"Straight shot\" or other cards.  It doesn't need to have its own \"exhaust\" text.  If a weapon has its own action/response text that allows it to exhaust, that is separate from the exhaust required for the above named event cards.  You'll only be able to use that weapon for one exhaust in any given round (maybe someday we will get a \"ready an attachment\" action or response!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=976142","commentId":976142,"userName":"la1cajun","timestamp":1391720667,"content":"So what im understanding is if a weapon is exhausted, it cant be used that round, whether or not it has any exhaust text or not. I havnt come across that yet so I was unfamiliar. Ive seen weapons that are just there with static properties like + 1 attack or something, and others that have to be exhausted for something but the card above just made me think, does the static properties still apply? But if its exhausted and you cant use it regardless then I guess I got it. Doesnt matter what it has on it, if it is exhausted in some manner you cant use it that round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=976289","commentId":976289,"userName":"booored","timestamp":1391728120,"content":"this is a good question, but the answer is NO. The tapped state has no bearing on the attachment unless the action / response or w/e on the attachment requires a tap.\n\n \n\nThe tap requirement on the event is a limiter to stop abuse. For example...\n\n \n\nMerry + Brand + Hama == tactical event recursion that is off the chain. Do you really think it is fair to draw 3 cards every time you attack? Imaging a co-op game. You have 1 Foe Hammer in the yard and one in the hand.\n\nEdited February 6, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=976330","commentId":976330,"userName":"GrandSpleen","timestamp":1391730883,"content":"again I'll just chime in to clarify, since I like very directly worded answers...\n\n \n\nEven if the weapon is exhausted, it still applies its stat bonus such as +1atk.  Exhausting a weapon is done to pay a cost for some other action or response (like, exhaust a weapon to draw 3 cards with Foe-hammer).  An exhausted weapon can't be exhausted again in the same round, just like any ally or hero.  But the text on the card is still active and +stat or other benefits still apply."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=976331","commentId":976331,"userName":"GrandSpleen","timestamp":1391730959,"content":"> Merry + Brand + Hama == tactical event recursion that is off the chain. Do you really think it is fair to draw 3 cards every time you attack? Imaging a co-op game. You have 1 Foe Hammer in the yard and one in the hand.\n\n \n\nMan, that is a sweet combo... and in a mono-tactics deck, it is definitely within reason to have a weapon on each of those guys, or 2 weapons on one or two of them... just sick."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=976334","commentId":976334,"userName":"booored","timestamp":1391731118,"content":"> again I'll just chime in to clarify, since I like very directly worded answers...\n> \n>  \n> \n> Even if the weapon is exhausted, it still applies its stat bonus such as +1atk.  Exhausting a weapon is done to pay a cost for some other action or response (like, exhaust a weapon to draw 3 cards with Foe-hammer).  An exhausted weapon can't be exhausted again in the same round, just like any ally or hero.  But the text on the card is still active and +stat or other benefits still apply.\n\n \n\nExactly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96913-hill-troll-and-goblin-sniper-rules/?do=findComment&comment=976589","commentId":976589,"userName":"la1cajun","timestamp":1391750948,"content":"Sorry guys, it seems my question led to a lot of answers..lol...I guess all I meant was that if I just had a standard weapon attached, played strait shot and exhausted that weapon, disposed of enemy, then during attack phase for me, if the ally or hero with the attached weapon, which was exhausted, attacked would the stats from weapon still count? And it seems grand spleen answered by stating that it would. Which is why playing strait shot and exhausting an attachment that really has no negative effects from exhausting it seems like a free ride because exhausting it doesn't effect any of its stats during attack. I guess that's what I was trying to say but just didn't come out right. I know that if the card does have a exhaust for something ability on it that you can't use it the rest of round. This is actually good because as stated above I've never run into that kind of scenario so it will save me a search or post. Thanks for the input boored and grand spleen. Y'all have answered more than 1 question for me on other parts of forum. It helps a lot . Y'all have a good night !"}]}