{"url":"https://community.fantasyflightgames.com/topic/96954-dunhere-questioneowyn-question/","title":"Dunhere question/Eowyn question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96954-dunhere-questioneowyn-question/?do=findComment&comment=955385","commentId":955385,"userName":"David Spangler","timestamp":1389830109,"content":"HI, playing LotR TCG for the first time.  Dunhere is one of my Spirit heroes, and I already have a question.  When can he use his ability?  Can he attack an enemy in the staging area before it has a chance to engage or does he have to wait until after enemies have engaged and moved out of staging and then during the player attack phase attack whatever enemy is left in the staging area?\n\n \n\nAlso, when Eowyn uses her action to add +1 willpower to her questing, do I have to pay a resource as well as discard a card?  Rules say player must play resources to use actions, but later they say player must play cost of a card or a resource, so I'm a bit confused.\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96954-dunhere-questioneowyn-question/?do=findComment&comment=955543","commentId":955543,"userName":"GrandSpleen","timestamp":1389845944,"content":"Dunhere: he attacks just like any other hero during the combat phase, after you have defended.  So if a low engagement cost, you'll be engaging them and defending as usual.  But you can leave high engagement cost enemies in the staging area and let Dunhere deal with them there, avoiding the enemy's attack.  Or put them back in the staging area via A Light in the Dark.  Or let Dunhere attack early (during the quest phase, after Staging but before quest resolution is a good idea if he can destroy the enemy) by using a card like Quick Strike.  Dunhere's ability just means it is legal to declare him as an attacker against enemies in the staging area, but doesn't allow him to attack outside of the usual attacking window by itself.\n\n \n\nEowyn: no resource necessary.  If there is a resource cost for an action, it will be printed on the card itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96954-dunhere-questioneowyn-question/?do=findComment&comment=967587","commentId":967587,"userName":"Aragorn son of Will","timestamp":1390999092,"content":"thanks i was wondering about Dunhere too"}]}