{"url":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/","title":"Greetings to you all!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=955503","commentId":955503,"userName":"Xannidel","timestamp":1389842209,"content":"Nice to meet you all, just started looking into this LCG and being a huge LotR fan I believe this would be fun. Is this playable for one and/or two people?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=955524","commentId":955524,"userName":"chuckles","timestamp":1389844533,"content":"Welcome. Yes it is, in fact this game is playable Solo or Co-Op, with 1 to 4 hands/decks or players (The core box says that you need a second box, and whilst it is helpful, it is not necessary for up to 3 and 4 players)\n\n \n\nI say hands or players, as even when you are playing solo you can use more than 1 hand/deck. Two handed solo is quite popular as it allows for various card synergies that require more than 1 deck in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=955527","commentId":955527,"userName":"Xannidel","timestamp":1389844729,"content":"So is it possible to gather multiple expansions and combine them with the core box and play with that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=955702","commentId":955702,"userName":"Mndela","timestamp":1389868559,"content":"Yes of course. In fact, if you want play really, you must play with the most player cards you can.\n\nThis is the best game i have never played, and you can play up 4 players (and more if you want)\n\nPd: from which game is your logo?\n\nEdited January 16, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=955704","commentId":955704,"userName":"Xannidel","timestamp":1389868774,"content":"Middle Earth quest. I have not played it but I love Elves in fantasy settings and this one looked pretty awesome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=956125","commentId":956125,"userName":"Orcstalker","timestamp":1389904739,"content":" I was in a similar position about a year ago, trying to decide of this would be an enjoyable game for a Tolkien fan, and had some of the same questions. I took the plunge and am very glad that I did. This is a very absorbing, dare I say addicting, solitaire game that has the additional benefit of being a solid multi-player game that plays well cooperatively. The latter quality is really useful, as teaching others to play a competitive game is often one-sided and can even deter some folks from wanting to learn. However the cooperative structure of this game makes it fun to share with friends."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=956187","commentId":956187,"userName":"la1cajun","timestamp":1389907728,"content":"how much of the game can you solo play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=956238","commentId":956238,"userName":"faith_star83","timestamp":1389909857,"content":"Hi everyone, it is nice to see so many new players take the plunge. Be warned, however, this game can become a real addiction :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\n \n\n> how much of the game can you solo play?\n\n \n\nEverything! The game scales reasonably well for 1-4 Players, so all the quests can be played alone. There are many players who play two decks solo, which can be great fun, too, but requires good card management and a bigger table.\n\n \n\nSome of the quests tend to be very difficult when playing solo, for an example Escape from Dol Guldur from the Core Set. Others then to be even a bit simpler when playing solo. So you can adapt your play style for each quest. When playing two decks, you can try and build decks that share cross-deck synergies which is also a great challenge and a lot of fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96962-greetings-to-you-all/?do=findComment&comment=956246","commentId":956246,"userName":"la1cajun","timestamp":1389910351,"content":"Thanks. Ordering core set today!"}]}