{"url":"https://community.fantasyflightgames.com/topic/96972-starting-anew/","title":"Starting Anew","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=955566","commentId":955566,"userName":"la1cajun","timestamp":1389849100,"content":"Hi guys, new to LCG and about to buy my lord of the rings core set. Ive seen a hobbit card game. Is that a FFG game and does it go with core set. Just a little confused on that cause I don't see it on website and a couple of reviews said something about it. Thanks!\n\nThe cajun\n\nEdited January 16, 2014 by la1cajun"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=955575","commentId":955575,"userName":"GrandSpleen","timestamp":1389850195,"content":"Hi and welcome!\n\n \n\nThere is a game that is unrelated to the Lord of the Rings LCG called \"The Hobbit Card Game,\" and it is also made by Fantasy Flight.  The catalog page here is:\n\n \n\nhttp://www.fantasyflightgames.com/edge_minisite.asp?eidm=223&enmi=The%20Hobbit%20Card%20Game [http://www.fantasyflightgames.com/edge_minisite.asp?eidm=223&enmi=The%20Hobbit%20Card%20Game]\n\n \n\nThe Lord of the Rings LCG also has many expansions, and two of them are \"The Hobbit\" theme expansions.  One is called Over Hill and Under Hill, and the other is On the Doorstep.  Both require the Core set in order to play.  If you read a review of the LCG and it mentioned The Hobbit, it was probably talking about those two expansions.\n\n \n\nHope that answers your questions!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=955747","commentId":955747,"userName":"la1cajun","timestamp":1389876689,"content":"Thanks Grandspleen, do you think to follow theme and the books it would be wise to start with the hobbit expansion? How are the quests in there?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=955981","commentId":955981,"userName":"Scroll Lock","timestamp":1389895544,"content":"Over hill and under hill quests:\n\n1. Fight against Trolls\n\n2. Running along Stone Giants (and even fighting with them, if you decide to do so) and then fighting against many orcs in dungeons- thematic part of me really likes this quest.\n\n3. Glum's riddles with Bilbo, running out of the orcs dungeon and then assault of Wargs.\n\nOn the Doorstep.\n\n1. Fighting against spiders.\n\n2. I do not know, sorry :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n3. Battle of 5 armies.\n\nDont buy expansions unless you have played core set quests and liked (loved) them.\n\nThis game is really hard for new players (both, understanding rules and difficulty of quests). Dont be afraid to ask questions here when you get your core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=956012","commentId":956012,"userName":"Thanatopsis","timestamp":1389897835,"content":"The 2nd \"On the Doorstep\" Quest is \"The Lonely Mountain\" - stealing treasure from Smaug and his eventual burst of anger (but it does not include the Battle of Laketown.\n\n \n\nThe Hobbit saga expansions were playtested using only the core set (not exclusively mind you, but it appears that a fair amount of work was done to make entry into the Hobbit quests not entirely brutal.  The rule inserts actually provide sample decks that use only cards from these two saga expansions and the core set.  With that said, these are still difficult quests. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=956034","commentId":956034,"userName":"camacazio","timestamp":1389899536,"content":"The saga expansions are tough, but self-contained as stated above. They give a lot of replay value, and it ought to be fun to revisit the core set quests with the new Dwarf cards out of the hobbit box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=956185","commentId":956185,"userName":"la1cajun","timestamp":1389907607,"content":"Thanks guys. Ill try out the core set. Im gonna order it today. We do have a gaming group that meets once a month or so but I am excited about the solo play as well. From the reading Ive been doing I can tell im in for some brutal loses but with the occasional victory as well, and im ok with that. I dont particularly want to beat the snot out the game every time im playing. Is there quite a bit of variability when replaying the game? Its obvious im going to lose some games but if I turn around and play it again, with the amount of cards and shuffling, should present with quite a bit of different game each time for awhile anyways right? I hope this game isnt going away anytime soon like warhammer invasion is doing. I just bought the core set and found out there will be no more invasion, bummer. Anyway, thanks again and im sure there will be questions to come! Have a great day!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=956706","commentId":956706,"userName":"KennedyHawk2","timestamp":1389966068,"content":"How we have been playing is we started with the core set and when ever we beat the quests in the art we bought one expansion (or chapter pack) and could use the new cards in our decks as a reward, we've been doing them in the release of order and it's fun to see how decks may have changed over time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=956808","commentId":956808,"userName":"FreddieG","timestamp":1389973689,"content":"> How we have been playing is we started with the core set and when ever we beat the quests in the art we bought one expansion (or chapter pack) and could use the new cards in our decks as a reward, we've been doing them in the release of order and it's fun to see how decks may have changed over time.\n\n \n\nThat's how we've been doing it too - then we go back and play all the other quests with the new cards and characters to see how it changes. You can get a lot of milage out of an AP.  \n\n \n\nTo get my son and I familiar with the game, I made him beat every single quest in the core set using each of the different spheres, before getting an AP (but he could choose which deck I would use to help him). \n\n \n\nWe then go down on friday night and get an AP. It's fun to add that element of reward."},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=956880","commentId":956880,"userName":"Raven1015","timestamp":1389978064,"content":">  I hope this game isnt going away anytime soon like warhammer invasion is doing. I just bought the core set and found out there will be no more invasion, bummer. \n\nWhile nothing is certain in life, I would bet that this game has, at the very minimum, 2 or 3 years of life ahead of it. I wouldn't be surprised, and I would be supremely pleased, if we got quite a bit more than that.\n\nEdited January 17, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=957638","commentId":957638,"userName":"la1cajun","timestamp":1390056580,"content":"Got my core set! Just getting the rules down and watching the series watch it played to get an overview too! Will be ready for my first solo soon. I separated the cards. With each sphere, with the one gandalf in it and the 3 heroes I have 33 cards per sphere. Sound right? I thought I'd have more cards than that but I checked carefully and got all quests cards, 10, and the decks separated, and the other cards aside. I will separate for the first encounters per book the quests cards and the encounter deck. Can't wait!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=957640","commentId":957640,"userName":"la1cajun","timestamp":1390056710,"content":"I like the idea of going in order, how do you tell exactly the release dates on the extra stuff so I can go in order?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=957797","commentId":957797,"userName":"Scroll Lock","timestamp":1390072463,"content":"1st cycle\nHunt for Gollum\nConflict at the Carrock\nA Journey to Rhosgobel\n\nThe Hills of Emyn Muil\n\nThe Dead Marshes\n\nReturn to Mirkwood\n\n \n\n \n\nKhazad Dum (you need this to play 2nd cycle)\n\n2nd cycle\n\nRedhorn Gate\n\nRoad to Rivendell\n\nWatcher in the Water\n\nThe Long Dark\n\nFoundations of Stone\n\nShadow and Flame\n\n \n\n \n\nHeirs of Numenor (you need this to play 3rd cycle)\n\n3rd cycle\n\nStewards Fear\n\nThe Druadan Forest\n\nEncounter at Amon Din\n\nAssault on Osgiliath\n\nThe Blood of Gondor\n\nThe Morgul Vale\n\n \n\nSaga expansions:\n\nHobbit: Over Hill and Under Hill- SAGA EXPANSION\n\nHobbit: On the Doorstep- SAGA EXPANSION\n\nThe Black Riders\n\n \n\nAnd we will soon see 4th cycle:\n\nVoice of Isengard (you need this to play 4th cycle)- Avalaible this month\n\n4th cycle:\n\nDunland Trap- avalaible probably in april 2014\n\nUnknown 2\n\nUnknown 3\n\nUnknown 4\n\nUnknown 5\n\nUnknown 6\n\nEdited January 18, 2014 by Scroll Lock"},{"commentUrl":"https://community.fantasyflightgames.com/topic/96972-starting-anew/?do=findComment&comment=957879","commentId":957879,"userName":"la1cajun","timestamp":1390080057,"content":"Dang , thanks. I'll just go in that order"}]}