{"url":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/","title":"What Do Y&#039;all Look For?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956373","commentId":956373,"userName":"Mogloth","timestamp":1389918523,"content":"The question is pretty basic. But, I imagine the responses will be varied and not always easy to put into words.\n\n \n\nBut, what do y'all look for when you play this game?\n\n \n\nI'm still trying to answer it for myself. I love stories. I am extremely fascinated by the world of Middle Earth. I mean, I've been playing LOTRO since open beta. Lifetime account and all. I'm not a Tolkien geek; meaning I don't have everything memorized and whatnot. I know a few things.... but not everything. Yet. \n\n \n\nAnd as an aside - HOW do y'all play the game? I mean beyond just the 1 handed or 2 handed or whatever.\n\n \n\nWhen you play a cycle, do you try and keep a consistent deck throughout? Or is it, \"Well, I'm getting ready to start quest #2 of this cycle I'd better build a deck to beat it.\"?\n\n \n\nAnd what is meant by being a thematic player?\n\n \n\nThe only game I play that is close to this is the Pathfinder card game. \n\n \n\nI know I'm rambling here, I've just had a lot of questions on my mind lately. And I'm sure I did not do the best job of asking them here.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956382","commentId":956382,"userName":"Karlson","timestamp":1389919187,"content":"A thematic player is one who looks to receive a very Tolkien-esque feel when playing through quests.  For example, I recently devised a set of two different decks.  The first one featured Sam Gamgee, Aragorn (Lore version), and Frodo.  The other deck had three Tactics heroes: Legolas, Gimli, and Boromir.   The \"thematic\" component of these decks comes from the fact that they feature solely heroes that make up the Fellowship of the Ring.  Likewise, I put player cards in both these decks that also add to this theme such as Gandalf, Bill the Pony, Sword that was Broken, etc.  \n\n \n\nSo, hopefully that answers your question, and consequently that is also my response to your first question: how do I like to play?  Using distinct themes, of course!  Some of my favorite themes to play with so far have been customizing Dwarf decks to feature Thorin Oakenshield and his Dwarven companions, finding ways to pair Boromir and Faramir up together with their father, Denethor for a \"Leaders of Gondor\" theme, or perhaps using Eowyn, Theoden, and Merry to have an interesting Rohan themed deck.  \n\n \n\nThis is really where the game shines for me.  Some players couldn't care less about thematic decks and go for the end-all, be-all power decks in the game to stomp quests.  But many others enjoy making decks that feature prominent characters who really did quest together in Tolkien's novels, and that is the field in which I pitch my tent!\n\n \n\nTo answer your other question asking if decks are made to beat whole cycles or just individual quests, I would say that I really don't ever consider that.  Obviously some of the hardest quests in the game, such as the Battle of Lake-town, have to be specifically addressed with unique deck builds, but for the most part, I make a thematic deck that is still fully functional to beat the majority of quests and then just go with it.  I normally never play through a whole cycle of 6 quests (or 9 if you consider the big box expansions that come before each cycle) at once.  Instead, I'll pick and choose quests that I feel like playing at that time.  However, I know many players do enjoy making a deck(s) and tackling whole cycles at once.  I'll get around to trying that one of these days!\n\nEdited January 17, 2014 by Karlson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956390","commentId":956390,"userName":"Thanatopsis","timestamp":1389919854,"content":"I usually build a deck that I really like (thematic or otherwise) and play it, and play it, and play it. I'll tweak it along that way, but eventually get tired of it and move on.  Sometimes, I'll go through streaks where I'll only use decks posted on the forums or blogs.  Other times I'll get the bug to build my own.  All while playing one or two handed.\n\n \n\nI usually narrate the game as I play by myself.  It's usually a soft murmur and my wife tells me that it's a little weird to hear me talking to myself,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956400","commentId":956400,"userName":"danpoage","timestamp":1389920687,"content":"Everyone plays this game for different reasons. For myself, I have always loved Tolkien, The Hobbit was one of the first \"real\" books I ever read as a child. Ever since Magic: The Gathering was released I have enjoyed card games which feature a deck-building component. In general, I have always preferred games with strategic depth to those with a high degree of luck. Thus, this game is the perfect combination of many things that I really enjoy.\n\n \n\nI play most often solo, with a single deck, especially when friends get busy and it is difficult to coordinate times to play. When I can, I play two player games with my wife - using actual cards on an actual table. Lastly, I play 3 or 4 player games on OCTGN with the other members of The Grey Company Podcast [http://greycompanypodcast.wordpress.com/]. One of the nice things about this game is that there are so many different ways to play it, and I would definitely encourage you to try it with multiple players some time, if you have the chance. It is hard to truly appreciate how challenging and interesting some of the scenarios can be, until you see more than one encounter card revealed each round.\n\n \n\nThe card pool is large enough that there are quite a few very powerful cards. Especially when it comes to tackling the more challenging scenarios, many players will build decks using the most powerful cards - regardless of the traits or particular themes of those cards. For example, a deck might include a mix of Elves and Dwarves that would never really be found in Middle-Earth. As you read more of Tolkien's works, you will discover that the friendship between Legolas and Gimli was a rare thing indeed. In any case, I think a \"thematic\" player is one who emphasizes \"realistic\" deck design within the context and stories of Middle-Earth.\n\n \n\nFor example, a thematic player might not want to include Denethor and Dain Ironfoot in the same deck and attach Steward of Gondor to the Dwarf King. Even if this happened to be the best strategy for that deck, it would not appeal to the aesthetic of a thematic player. For a truly thematic player, deck building is as much about telling an interesting and meaningful story with your card choices as it is about creating a deck that defeats all scenarios. This is not to say that thematic decks have to be weak. Some traits are well-developed enough (Dwarves, Noldor, Outlands) that you can make very powerful decks that, for the most part, are thematically cohesive.\n\n \n\nPersonally, I fall somewhere in between a truly thematic player and someone who \"just wants to win\". One of the great things about this game is that it lets you pick where you feel comfortable on that continuum. You can even change it up from game to game. Some scenarios, especially the saga expansions, I may want to be much more thematically accurate. In that case, I can limit myself to characters that make the most sense (e.g. Hobbits for The Black Riders scenarios). In other scenarios with a high degree of difficulty, I will build a deck for the specific purpose of defeating that quest (in addition to The Battle of Lake-town mentioned above, two more good examples would be Into Ithilien and The Morgul Vale). The beauty of a deck building game is that you can do whatever you enjoy most. If you want to make thematic decks suitable for each scenario, go for it. If you want to use all of the best cards in the game to make the ultimate deck to rule them all, you can do that.\n\n \n\nUltimately, this game is about having fun and engaging adventures with recognizable characters in Middle-Earth. If you are more interested in the narrative aspects of the game, and want to explore heavily stylized decks, then Easy Mode might be something for you to try (you basically remove some of the more troublesome cards from the encounter deck before playing). If, like me, you enjoy the deeper strategic aspects of the game and want to \"solve\" the puzzle of each scenario, then you can play Normal or even Nightmare Mode. If you just want to look at the amazing art and create funny stories, you can make your own house rules where Bombur kills everything with his awesome barrel Kung Fu. Just know that there is no such thing as the one \"correct\" way to play the game - you are always free to decide what you enjoy most.\n\nEdited January 17, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956517","commentId":956517,"userName":"GrandSpleen","timestamp":1389935636,"content":"I enjoy interesting deck interactions, both within one deck and across two decks.  Three or four would also be great, but I rarely play anything other than 2-player games.  The Tolkien theme is definitely what drew me and has kept me in this game, although I am not as deeply into the lore as many of the gurus around here.  I love The Hobbit and The Lord of the Rings, and I've read some of the other entries into Middle-Earth, but obscure characters making appearances on cards doesn't prick my ears up.  I was just happy to get a Sam card :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nWhen I build a deck, I start from an idea which is usually a single card -- might be a hero, or an event, or maybe two cards that make a cool combo -- or I will build thematically and try to stay true to a race or a selection of heroes from a book.  I usually end up making allowances for gameplay though, so I'm not a purist in that regard.\n\n \n\nI wish I could say that the narrative is important to me, but the honest truth is that I often forget to read the flavor text on a quest card in a new pack, and I forgot to read the \"post-quest\" text on the Against the Shadow rules inserts for almost every quest in that cycle, for days after winning.  I think the story just plays out in my head more satisfyingly than any of the text has been able to do for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956605","commentId":956605,"userName":"Noccus","timestamp":1389948512,"content":"Those are some good questions.\n\nI'll try to answer them in order.\n\n1. A good time playing with my friends. ....and an epic win of course. Fun is the whole point of a game no?\n\n2. I play multiplayer, but beyond that I don't care much for theme. I also don't care for power decks.\n\nI just build a deck that I like and want to play in coordination with my buddies.\n\n3. Whatever I feel like doing. We do follow a cycle quest by quest, but sometimes I keep a deck, but mostly I build something different. I like to try stuff out. My friends are both different that way, as 1 uses the same deck over and over with little tweaking, and the 2nd plays a different deck every few games.\n\n4. Answered really well by others above.\n\nQuestion to you: how do you like pathfinder?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956625","commentId":956625,"userName":"faith_star83","timestamp":1389953987,"content":"Me, personally I really like the themativ aspect of the game, but I clearly tend to favor power over true thematic aspects when it comes to card building. So, yes, I would pobably stick a Steward of Gondor on Elrond if the strategy justifies it.\n\n \n\nHowever, I really enjoy the story part of the quests and meticulously read all the flavor texts, introductory texts and conclusion texts on the leaflets.\n\n \n\nCome to think of it, I don't conciously integrate the player deck per se into the story-line...I don't know, maybe I am pretty weird that way!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=956789","commentId":956789,"userName":"FreddieG","timestamp":1389972790,"content":"For me, it's simple: getting to play with my son  Aside from the quality time, this game has so much critical thinking, problem solving, odds, and even some good quick math. The bonus - it's set in the Tolkien World!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=957016","commentId":957016,"userName":"iznax","timestamp":1389985727,"content":"I came to this hobby through PnP RPGs, so customization is one thing i really like and this game has one of the best (if not THE best) and most interesting deck building/deck constructing options out there, and when you ad to this, that you can build 2,3 or even 4 decks that work well together ( sinergy, combos etc) that takes it to a whole new level !!!\n\n \n\nAnd ofc i love Middle Earth :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nP.S. sry for my english as always :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=959483","commentId":959483,"userName":"Legoland","timestamp":1390240072,"content":"For me it´s the most imprtant thing: Fun with fantastic drawn cards in a very cool challanging game. Personally I have more goals:\n\n \n\n1) Try to beat every Quest with every sphere 1; 2; 3 and 4 handed (or with 2-4 people).\n\n2) Try to beat the whole Cycle with only one multible Set (hard).\n\n3) Try to beat the whole Cycle with only one multible Set in hardcore mode (unbelivable hard :/)\n\n4) Enjoy the extrem fast changnig situations in the game (close win, hardcore loos) and building decks - the most fun :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited January 20, 2014 by Legoland"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=959852","commentId":959852,"userName":"Mogloth","timestamp":1390265916,"content":"@Noccus - I enjoy the Pathfinder game. I love the campaign aspect of it. How your deck can grow and evolve over time based on what cards you come across during a scenario. \n\n \n\nI am not new to deck construction card games. I have played Magic for awhile. I have built many a decks. It just seems to me that the thought process is different here than in Magic for building a deck. \n\n \n\nOr maybe it's not and I just haven't realized it yet. \n\n \n\nMy thoughts on the process will likely change once I start getting more cards than just the core set. Even though I have 2 cores. Granted I do have both the Hobbit saga expansions, but my face got rocked so hard, I'm gonna put those up until my card base grows.\n\n \n\nI will probably be a \"I want to win\" type of player. My card selection doesn't really lend itself to themes and tryouts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=960109","commentId":960109,"userName":"Olorin93","timestamp":1390294523,"content":"I have loved Tolkien ever since I was old enough to see the films. Then I read the trilogy (the Hobbit slightly earlier) and was absolutely captivated. My university studies of English have furthered my understanding of his work on a linguistic level, and sometimes I am simply awe-struck by just how much work he really put into his world, stories and languages.\n\n \n\nTo me, the Card Game definitely captures the feeling of Middle-Earth in a unique way. It is a different interpretation than Peter Jackson's films, but I do love both versions. (I also recently acquired the board RPG \"The One Ring\", which takes place between The Hobbit and the Lord of the Rings and manages to create a very Tolkienesque atmosphere - it's just that it takes a while to learn!) I'm all for thematic decks; I'm one of those who simply can't bring themselves to put attachments where they don't belong, or let elves and hobbits summon Outlands allies. As an elf player, I can't wait for the Ringmaker cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=960156","commentId":960156,"userName":"Nizi","timestamp":1390303305,"content":"Well... immersion basically. Some albeit minor quests that take place in the ME world. That's it. So as long as the art stays true to the current style, which is awesome, and there are different things to look for, I'll continue to play.\n\n \n\nAnd obviously the experience needs to be fun and highly customizable. Else there are better things to do.:P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=960169","commentId":960169,"userName":"booored","timestamp":1390306345,"content":"Personally I can not stand Tolkien, or fantasy in general. Scifi is my bent. I find Tolkien to be extremely boring and has little of interest to me... yes I know others like it.. w/e this is my opinion. I play this game as I love card games and besides the theme, this is a fun game with some neat mechanizes and also supports solo play witch is nearly unique in card games. There are a few, pathfinder is a recent one as mentioned - sorta.\n\n \n\nSo when I play I look for mechanism and card design, as in the functional text part of the card and card art and quest design. I couldn't get a **** if it is thematic to the lore or w/e. I want robust card design to allow me to make fun and interesting player decks. That is all i really care about.\n\n \n\nI personally find the quests themselves to be pretty much... meh. I do not really get a feeling of questing, like you do in say Pathfinder (witch for the record is a dice roller, like elder sign.. NOT a constructed card game). I think the Saga expansions are a step in the right direction.. much more interesting quests, that focus on story and questing. Even so the reality of this game is that it is a fighting game.. flip a card fight, flip a card fight. So the game is basically a combat game. So much so there is a fairly popular reskin of this game into a arena game. Same design, different art.. but a gladiator game.. and it works great.. a sign of how combat focused the game is. So I think what I would like to see the most is more of the Saga stuff that has stories and decks carry over from one game to the next to really give you the feeling of traveling and questing.. rather than just battling a bunch of monsters.\n\n \n\nSo for me it is...\n\n \n\n1) Solo Play\n\n2) Interesting Player Card Design\n\n3) The Harder the quests the better\n\n4) Art\n\nEdited January 21, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=961365","commentId":961365,"userName":"Mogloth","timestamp":1390403056,"content":"Wait a second.\n\n \n\nSo being a thematic player means, in one sense, creating decks around traits? I thought that would be what everyone does. \n\n \n\nI always figured thematic as being someone who says, \"Well, only Denethor can be steward of Gondor. These 2 people would have never quested together as they weren't alive at the same time.\"\n\n \n\nWell, then. Consider me a thematic player then. I'm all about buildings decks around themes. That's all I've done in Magic. My unleash deck. My zombie deck. My control deck. Etc.\n\n \n\nOf course, I can't really building theme decks yet as my card pool is still too small to do that. C'mon Mirkwood reprints. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=961377","commentId":961377,"userName":"Olorin93","timestamp":1390403611,"content":"I think everyone has their own definition of a thematic deck. For me, it is enough that the traits fit well together. \"Noldor\" I think go fine with \"Ranger\" since it's in the Eriador region and the Dúnedain were allies of Rivendell. I can even imagine throwing certain dwarf characters (especially Erebor ones, and characters from Thorin's company) into Silvan decks. But I do not fancy putting Steward of Gondor on Dáin or Elrohir, giving a Rivendell Blade to Hirluin the Fair, or paying for a Lórien Scout with the Denethor hero. Bilbo could play Rivendell allies, though, as he spent time in Rivendell when he was old. \n\n \n\nThere are no rules about this. This is just how I like to build decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=961424","commentId":961424,"userName":"servant of the secret fire","timestamp":1390406438,"content":"The answer for me is easy.Tolkien.I read fantasy because of Tolkien, i play rpg's because of Tolkien,i play this game because of Tolkien.\n\n \n\nAs for the way i play this game first i create a deck with characters i like from the books and i make decks with characters i don't like only if its the only way to complete a specific quest.\n\n \n\nAn other way is to make thematic decks like the three hunters (Aragorn,Legolas,Gimli) and try to take the best out of those decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=961434","commentId":961434,"userName":"divinityofnumber","timestamp":1390407146,"content":">  \n> \n> 3) The Harder the quests the better\n\n \n\nThis. I enjoy the challenge of the game. I like that the designers make the quests challenging. I would prefer a nearly impossible quest to one that I can walk right through on the first play-through. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=961469","commentId":961469,"userName":"Mndela","timestamp":1390409311,"content":"I think my process was like that:\n\nhttp://talesfromthecards.wordpress.com/2013/08/08/the-16-steps-to-lotr-lcg-addiction/ [http://talesfromthecards.wordpress.com/2013/08/08/the-16-steps-to-lotr-lcg-addiction/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=961473","commentId":961473,"userName":"Dain Ironfoot","timestamp":1390409534,"content":"> Wait a second.\n> \n>  \n> \n> So being a thematic player means, in one sense, creating decks around traits? I thought that would be what everyone does. \n> \n>  \n> \n> I always figured thematic as being someone who says, \"Well, only Denethor can be steward of Gondor. These 2 people would have never quested together as they weren't alive at the same time.\"\n\n \n\ni'm not a \"theme\" player, at all.  that's not to say I haven't tried eagle decks, or dwarf decks, but I don't go for the \"they never quested together in the books so i'm not going to try it\" nor are most of my decks revolving around traits.\n\n \n\nmy goal is to build a deck that wins consistently. certainly i understand a \"three hunters\" type deck, or what have you, from time to time but i'm not sure how consistently those decks would win (if you could only put in cards that exactly match the situation in the books).\n\n \n\nto me, the gathering of the fellowship was one of the few times in middle earth where all of the races combined to achieve an end goal. why can i not have that happen every time i play the game? i'm just playing with a different \"fellowship,\" so to speak.\n\n \n\nmeaning, it's not unheard of to have different men, dwarves, elves, and hobbits come together for the win! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] in fact, using heroes that didn't quest together in the book - to me - could be thought of as thematic in a sense: it's the coming together of the races for a larger good.\n\n \n\nregardless, since this is a co-op game, you can do whatever you enjoy. you can dabble in different deck constructions. everyone does something different. some like certain traits. some like certain spheres. some only want to use characters they know/love (regardless of their game strength/weaknesses) from the books.\n\n \n\nhttp://www.fantasyflightgames.com/edge_news.asp?eidn=2296 [http://www.fantasyflightgames.com/edge_news.asp?eidn=2296]\n\n \n\n^^^that may be a fun article for you! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited January 22, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97024-what-do-yall-look-for/?do=findComment&comment=961480","commentId":961480,"userName":"Raven1015","timestamp":1390410163,"content":"I pretty much play this game for a mix of all the different reasons mentioned, and couldn't single out any one aspect as THE motivating factor or thing I enjoy the most. In fact, I think that may be one reason why this game holds my attention over all others: I tend to have many different interests and usually one game can't satisfy them all, but this one does. I love Tolkien, the world he built, and the themes in them. I love a challenge, and so I'm in the same boat that love hard quests (this may be why Battle of Lake-town is in my top 3 list of quests). I love strategy and having to spend time creating these thought out deck builds. I tend to sit somewhere between a theme player and power gamer. For Saga Expansions, I tend to sit closer to theme, for whatever reason. For the non-Saga stuff, I feel pretty free to bring along whoever I want, but then I love the alternate universe aspect of it. What if a team of Dwarves had been sent to help Gondor in its battles against Mordor? What if Frodo had left the Shire earlier and gotten swept up in these other adventures? I guess I tend to think of the game less as recreating the stories we know but as a big Middle-earth sandbox to play in. In this way, I kind of reconcile the theme and the power sides of me.\n\nEdited January 22, 2014 by Raven1015"}]}