{"url":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/","title":"wolf rider shadow effect","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=956475","commentId":956475,"userName":"vjg13","timestamp":1389930907,"content":"so for last 3 years been trying to figure this one out. after reading a bunch of old topics it seemed the consensus was u could treat it like an attacking enemy and use cards on it not feint though cause it has to be used before step 1. but back in June this response from caleb was posted. on bgg forum\n\nCaleb wrote:Hi Robin,\n\nWhat a fun question. I checked with Nate to make sure I understood his original intent with Wolf Rider, and it plays exactly as it reads: Wolf Rider is still technically a shadow card when it makes an attack. It is only treated as an enemy card while resolving it's attack, but it is neither engaged with the player or in the staging area.\n\nIn terms of theme, it's an unexpected hit-and-run wherein the Wold Rider leaps out of the shadows to attack and then disappears again.\n\nCheers,\n\nCaleb\n\nanyone know the correct way to.play it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=956606","commentId":956606,"userName":"faith_star83","timestamp":1389949461,"content":"> so for last 3 years been trying to figure this one out. after reading a bunch of old topics it seemed the consensus was u could treat it like an attacking enemy and use cards on it not feint though cause it has to be used before step 1. but back in June this response from caleb was posted. on bgg forum\n> \n> Caleb wrote:Hi Robin,\n> \n> What a fun question. I checked with Nate to make sure I understood his original intent with Wolf Rider, and it plays exactly as it reads: Wolf Rider is still technically a shadow card when it makes an attack. It is only treated as an enemy card while resolving it's attack, but it is neither engaged with the player or in the staging area.\n> \n> In terms of theme, it's an unexpected hit-and-run wherein the Wold Rider leaps out of the shadows to attack and then disappears again.\n> \n> Cheers,\n> \n> Caleb\n> \n> anyone know the correct way to.play it?\n\n \n\nI think it's a difficult question, and I am not 100% sure, but since you treat the attack of the Wolf Rider as a normal attack, you would follow the 4 combat steps as described in the rulebook on p.18, giving you the option to play events between every step. Thus, I would say, yes you can play Feint after step 1 of combat and prevent the shadow card from attacking you.\n\n \n\nEdit: Ah, of course, it's too late to use Feint I just realized, since the enemy is already attacking. However, yYou could use other events I think...\n\n \n\nWhat I wonder though: After the Shadow-copy of Wolf Rider made his attack, does it disappear even if I don't kill it, since it is still a shadow effect? I always left the guy engaged with the player after he appeared and I couldn't kill it...\n\nEdited January 17, 2014 by faith_star83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=956809","commentId":956809,"userName":"Kassad","timestamp":1389973849,"content":"By Caleb's response I would say yes, it goes away like any other Shadow Card once it resolves.  It doesn't say it engages, it doesn't say return to the staging area.  After it gets its \"ambush\" in he rides off to the discard pile..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=957002","commentId":957002,"userName":"CJMatos","timestamp":1389985015,"content":"Do not forget the shadow text:\n\n \n\nShadow: Wolf Rider attacks the defending player. That player may declare 1 character as a defender. Deal Wolf Rider its own Shadow card. After combat, return Wolf Rider to the top of the encounter deck.\n\n \n\nSo it returns to the top of encounter deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=957170","commentId":957170,"userName":"vjg13","timestamp":1389995069,"content":"so by Caleb response he cant be killed or dealt with in any other way. you are only allowed to defend then he disappear back into the shadows like Caleb said"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=957254","commentId":957254,"userName":"CJMatos","timestamp":1390002072,"content":"If you have a Gondorian Spearman with Spear of the Citadel, Wolf Rider doesn't go to the top of the encounter deck. \n\n \n\nIt is killed and goes to the discard pile.\n\n \n\nAny other defense doesn't kill him and you become aware of the next card that comes in the next staging step..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=957430","commentId":957430,"userName":"vjg13","timestamp":1390022866,"content":"I don't agree. it's still technically a shadow card once revealed you resolve it's effect entirely meaning that card will always return to the top of encounter deck. That's the way I see it described by Caleb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=957652","commentId":957652,"userName":"alogos","timestamp":1390058153,"content":"I have this from Caleb :\n\n>  \n> \n>  \n> \n> Q: When a dwarf ally is put into play by To Me! O My Kinsfolk! effect and he dies, does it get back under our deck from the discard pile?\n> A: The lasting effect created by To Me! O My Kinsfolk! only applies if the character is still in play at the end of the phase. After a card leaves play, it can no longer be targeted by effects unless those effects specifically target a card in an out of play state. The extra text on Sneak Attack was only to help players understand how it works, but it's the same for both cards.\n> We did reverse / reword some rulings that I had previously sent to players because either I was wrong or there was a better solution. If you want more clarification on particular rulings, you would have to remind me which ones I changed.\n\nThat would suggest that you can't resolve the shadow effect of \"return it to the top of the encounter deck\" if he dies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97034-wolf-rider-shadow-effect/?do=findComment&comment=961142","commentId":961142,"userName":"vjg13","timestamp":1390369751,"content":"I stand corrected you were right CJMatos if wolf rider is killed during defense it is discarded and is the only way I think to keep him from returning to your encounter deck"}]}