{"url":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/","title":"Allatar and Pallando","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/?do=findComment&comment=957026","commentId":957026,"userName":"Raven1015","timestamp":1389986284,"content":"This may seem random, but it's something I've wondered about for a bit, in connection with thinking about whether we'll ever see cards for Alatar and Pallando (the two blue wizards). From what I understand, the Tolkien Enterprise license only gives rights to use stuff from LOTR and The Hobbit, but Alatar and Pallando are only named in Unfinished Tales. This is why in the first Hobbit movie, Gandalf says he can't \"remember their names\" about the last two wizards, because Jackson can't have a character say Alatar and Pallando or he'll get sued. \n\n \n\nAnyway, in the old MECCG, they had cards for Alatar and Pallando. Does anyone know how they were able to use those names in their game? It doesn't seem like they should have been able to, so maybe they just got away with it (since a card game doesn't get as much scrutiny as a movie)? Given this whole issue, it does seem unlikely that we'll ever see an Alatar or Pallando card, as FFG probably would toe the line a bit more. Any thoughts or information that I don't know about?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/?do=findComment&comment=957044","commentId":957044,"userName":"Dain Ironfoot","timestamp":1389987606,"content":"Iron Crown Enterprises had the rights to Unfinished Tales.\n\n \n\nHere is their copyright statement (emphasis added):\n\n \n\n\"Middle-earth: The Wizards is a collectible card game produced by Iron Crown Enterprises, Inc. (ICE), Charlottesville, Virginia USA, the exclusive holder of the worldwide adventure games license based on J.R.R. Tolkien's The Hobbit and The Lord of the Rings. Copyright © 1995 Tolkien Enterprises, a division of The Saul Zaentz Company, Berkeley, CA. Middle-earth: The Wizards, Middle-earth, The Hobbit, The Lord of the Rings, and The Return of the King, and all characters and places therein, and the Burning Eye are trademark properties of Tolkien Enterprises. The characters \"Alatar\" and \"Pallando\" appear in Unfinished Tales. They appear here with specific permission of the Estate of J. R. R. Tolkien. The copyright to Unfinished Tales is held by HarperCollins Publishers, in succession to George Allen and Unwin (Publishers) Ltd. and on behalf of Christopher Reuel Tolkien and Frank Richard Williamson, the Executors of the Estate of J.R.R. Tolkien. Middle-earth: The Wizards is made for ICE in Belgium by Carta Mundi. The character symbols (I M), region symbols ( c f b s d w ), and site symbols ( H F B S D R ) are trademark properties of Iron Crown Enterprises. All rights reserved. The Fellowship of the Ring - Copyright © 1955, 1965 by J.R.R. Tolkien. Copyright © renewed 1982 by Christopher R. Tolkien, Michael H.R. Tolkien, John F.R. Tolkien and Priscilla M.A.R. Tolkien. The Hobbit - Copyright © 1937, 1938, 1966 by J.R.R. Tolkien. The Two Towers - Copyright © 1954, 1965 by J.R.R. Tolkien. Copyright © renewed 1982 by Christopher R. Tolkien, Michael H.R. Tolkien, John F.R. Tolkien and Priscilla M.A.R. Tolkien. See page 5 for more copyright information. The Return of the King - Copyright © 1955, 1965 by J.R.R. Tolkien. Copyright © renewed 1983 by Christopher R. Tolkien, Michael H.R. Tolkien, John F.R. Tolkien and Priscilla M.A.R. Tolkien. Unfinished Tales - Copyright © 1980 by George Allen and Unwin (Publishers) Ltd. Address rules questions and comments via email to metwvaice@aol.com [metwvaice@aol.com] or via snail mail to our P.O. Box address.\"\n\nEdited January 17, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/?do=findComment&comment=957071","commentId":957071,"userName":"Raven1015","timestamp":1389988783,"content":"Awesome. Exactly what I was looking for, and that answers my question. So they could include them in the game, if FFG gets special permission from the Tolkien Estate. It's interesting, because I was under the impression that the Tolkien Estate absolutely refused to give away the rights to anything, but it appears they were OK with use in a game. It could give us hope, unless the Tolkien Estate position has hardened since then, which may be the case since this was in the pre-Jackson era, and Christopher Tolkien is pretty teed off these days with commercialization in the post-Jackson era."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/?do=findComment&comment=957086","commentId":957086,"userName":"HeavyKaragh","timestamp":1389989490,"content":"There is still hope. I read some times that FFG hadn't the rights for The Hobbit books, but they managed to get them. If the game is succesfull enough over time, we may see stuff from Unfinished Tales and The Silmarillion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/?do=findComment&comment=957140","commentId":957140,"userName":"Gizlivadi","timestamp":1389993431,"content":"Nice question. I really hope that they actually have the rights for those characters, because if they don't I think I'd quit this game. There's just no reason (for me of course) to play this over Meccg when the latter has much more Tolkien lore and material than this one. In fact one of the reasons I play this for now is that I'm waiting for them to get the rights to that material, and if they have them already, for them to actually make cards with it (why is this game so slow!?)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/?do=findComment&comment=957158","commentId":957158,"userName":"Dain Ironfoot","timestamp":1389994507,"content":">  and Christopher Tolkien is pretty teed off these days with commercialization in the post-Jackson era.\n\n \n\nI'd suspect FFG does not have the rights to the \"other\" works of Tolkein and will not any time soon (if ever). Ian is right, Christohper Tolkien has been remarkably stingy with the rights, at least as far as films are concerned."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97080-allatar-and-pallando/?do=findComment&comment=957183","commentId":957183,"userName":"Raven1015","timestamp":1389995823,"content":"I imagine that FFG will exhaust all of the available material before they approach the Tolkien Estate for permission to anything else, whereas MECCG had to do it from the very beginning because it was part of their whole initial concept (focusing on the 5 wizards). \n\n \n\nIt's interesting that MECCG permission was just for those two characters as well. That's probably the only way it would happen, as I don't think the Tolkien Estate would give away blanket rights to any work. \n\nEdited January 17, 2014 by Raven1015"}]}