{"url":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/","title":"How would you rank the heroes?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957317","commentId":957317,"userName":"Ozil23","timestamp":1390009126,"content":"Ok so I haven't seen a hero ranking in a while, so what do you guys think are the best and worst heroes in the game? You could include the new heroes Eomer and Grima if you would like."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957376","commentId":957376,"userName":"Dain Ironfoot","timestamp":1390014949,"content":"Best: Beregond\n\nWorst: Spirit Pippin\n\nEdited January 18, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957419","commentId":957419,"userName":"GrandSpleen","timestamp":1390021034,"content":"Here is an epic thread discussing just this.\n\n \n\nThe Hero Championship [https://community.fantasyflightgames.com/index.php?/topic/89803-the-hero-championship/?hl=+hero%20+tournament]\n\n \n\nAs for my current picks, I will have to agree with Dain that Spirit Pippin is at the bottom of the list.  For best hmm... I'm gonna define 'best' as the hero I enjoy playing with most.  Legolas gets my vote."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957423","commentId":957423,"userName":"joezim007","timestamp":1390021680,"content":"I wouldn't call Beregond the best overall hero, but certainly the best defender. The only characters that give him much competition are Denethor (1 less defense, 1 less health, no sentinel, no free/cheaper armor) and Beorn (hard to compare since Beorn can block multiple times per round without any outside readying effects and has a huge hit point pool, but he has low defense and can't hold any attachments to boost it or even receive a boost from Arwen or be healed. Beorn also has the ability to attack for 5 after all of that defending).\n\n \n\nAs for all-around best (as in most useful in the greatest number of decks) it's hard to compete with Spirit Glorfindel, even if he requires a special attachment to not be annoyingly prohibitive. Elrond is pretty darn good too - especially with Vilya and some readying effects - but his high threat is a hindrence. You could also go with the hero you enjoy using the most, like GrandSpleen did, but that's far more subjective. I too love Legolas. I also really like Dunhere, now that we have Spear of the Mark. Frodo is nice since he can take an undefended attack or two during the game without much difficulty, which is really useful before you can get an ally army built or get your attachments loaded up. I also really enjoy Prince Imrahil's readying effect. See how subjective this is? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nI would agree with Spirit Pippin probably be the worst, or least definitely in the lower 3. Half of his ability works against the general strategy of hobbits since he raises his threat to do it. This wouldn't be a huge deal, but it requires you to raise your threat by 3. If it only raised your threat by 1, it would certainly be manageable, but 3 threat is very hard to deal with when used liberally.\n\n \n\nI would say the Faramir hero is in a similar boat. His ability works well with is theme of keeping enemies in the staging area with traps and such, but his high starting threat makes it difficult to keep enemies from engaging unless you have have a Ranger Spikes every turn. At least Faramir DOES have the traps and at least his high threat comes with decent stats to make up for it. After using Pippen's ability twice, you'll get to the point where it would have been better to have Faramir instead... not that Faramir can be a drop-in replacement for a spirit sphere hobbit, but you get my point.\n\n \n\nI don't really like picking favorites (or least favorites) because I like to try to experiment with lots of decks (or as many as time allows) and not just stick to favorite heroes and such. It's also pretty pointless since there are numerous effective strategies and synergies that work well, so comparing heroes can often be like comparing full strategies since the hero may only be useful for that strategy/synergy and (mostly) useless outside of it. Dain Ironfoot is a good example. Unless you're piling up dwarves everywhere, he doesn't bring a whole lot to the table that you can't find elsewhere.\n\nEdited January 18, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957463","commentId":957463,"userName":"Dain Ironfoot","timestamp":1390027293,"content":"i was, in my original post, going to write a long spiel about best versus favorite versus most used hero but then decided against it. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\ni'd not say Beregond is the best overall/well-rounded hero in the game, but he's a staple for me and i just love giving him the gondorian shield.\n\n \n\ndefending is one of the most tense moments of the game (that, and flipping encounter cards) and, with beregond on the table, i always feel a bit less apprehensive and, most importantly, more bad ass. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited January 18, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957504","commentId":957504,"userName":"Scroll Lock","timestamp":1390034812,"content":"Favourite hero: Dunhere\n\nBest Siege-quest hero: Beregond\n\nBest Battle-quest hero: Faramir (I dont understand, why you hate him. In battle he is the best quester. Dont use his attack for fight. He is battle quester. )\n\nBest normal-quest hero: Eowyn. Just send her questing every turn. End of the story.\n\nBest overall hero: if you want broken heroes, then Boromir(TDM) and Glorfindel(FoS). But except them, very good hero is Legolas. But if you build good deck around Hama or Prince Imrahil they are awesome. For some quests Gimli is awesome. It depends on many things."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957615","commentId":957615,"userName":"joezim007","timestamp":1390054276,"content":"I didn't say I didnt like Faramir, I was just noting that he has flaws because his intended strategy is a bit difficult to pull off thanks to his high threat. Also Faramir's battle questing ability is relative to the number of enemies in the staging area, which you can help along with Ranger Spikes and by playing multiplayer, but if you're playing solo and you never pull those Ranger Spikes, he'll rarely break 3 attack and can often just have 2.\n\nOnce again, I'm not hating on him. Just saying you have to try to make him good, because gr isn't automatically good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957833","commentId":957833,"userName":"chuckles","timestamp":1390075578,"content":"Hard for me to pick a Best hero; Legolas, Elrond, Glorfindel, Celeborn?, Dain, Sam, Boromir, Aragorn, Eowyn... the list goes on... and if its a battle/siege quest then Beorn & Beregond are right up there!\n\n \n\nWorst Hero: Spirit Pippin.\n\nEdited January 18, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=957878","commentId":957878,"userName":"Mndela","timestamp":1390079880,"content":"I think there aren't powered heroes, so there isn't any best hero. Each hero is better or not depening of decks and quests.\n\n \n\nBut sure, the worst hero: Spirit Pippin :wacko: [//content.invisioncic.com/Mfantflight/emoticons/default_wacko.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=958047","commentId":958047,"userName":"Demoncow","timestamp":1390097459,"content":"Favourite hero: Theoden \n\nLeast favourite: fatty bolger\n\n \n\nWhy does everyone hate pippin? He is not that bad at all"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=958048","commentId":958048,"userName":"Raven1015","timestamp":1390097771,"content":"As everyone else said, best really is subjective. If you hold a gun to my head, though, I'd have to say Spirit Glorfindel is the closest thing to the best hero.\n\n \n\nWorst: Spirit Pippin\n\nEdited January 19, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=958064","commentId":958064,"userName":"Dain Ironfoot","timestamp":1390099520,"content":"> Favourite hero: Theoden \n> \n> Least favourite: fatty bolger\n> \n>  \n> \n> Why does everyone hate pippin? He is not that bad at all\n\n \n\nSpirit Pippin just isn't all that playable; to make him so, I'd\n\n \n\n- Make it an action, not a response (so you can trigger the ability any time, i.e., after engagement checks are completed)\n- Prevent the enemy from engaging every player (as it is, which ever enemy Pippin bounces back, the other players would have to make an engagement check against that enemy - this is the most damning to me)\n- Lower the threat cost (3 is just waaay too much)\n- Remove the restriction to all-Hobbit decks (also limits his usefulness, as he goes against the abilities of the other Hobbit heroes).\n- not have Lore Pippin be so awesome. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n \nI could go on and on, but he's a niche hero, at best, and there are better ways to do what his ability does already.\nEdited January 19, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=958070","commentId":958070,"userName":"Demoncow","timestamp":1390101296,"content":"I agree his ability totaly sucks i have never used it but when im looking through my spirit heroes thinking hmm good questing i obviouly pick eowyn but then. There are 3 spirit heroes(in my card pool) with 2 questing nori caladra and pippin so i normally choose pippin because of the six threat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=958891","commentId":958891,"userName":"iznax","timestamp":1390174861,"content":"I believe that when you all talk about the best hero you live Dain out of it right ? I mean a great Glorfindel deck is way less powerful than a great Dain deck and dont talk about 2,3 or 4 decks build around Dain vs 2,3 or 4 decks build around Glorfindel there is no point"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=958896","commentId":958896,"userName":"booored","timestamp":1390175144,"content":"I think Dunhere is still my fav hero\n\nDenathor is still a winner, I mainly play solo and his ability to see the coming card as well as defend well can make the hardest quests easy.\n\nBilbo is amazingly strong\n\n \n\nI haven't played much recently.. I am only just getting back into it and have started at the beginning to get into the flow.. so I have not much experience with the cards beyond DarrowDelf.\n\n \n\n> Dain that Spirit Pippin is at the bottom of the list. \n\n \n\nHow can Dain be one of the worst?\n\nEdited January 19, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959042","commentId":959042,"userName":"GrandSpleen","timestamp":1390195360,"content":">  \n> \n>  \n> \n> How can Dain be one of the worst?\n\n \n\nI think you should reread what I wrote :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959068","commentId":959068,"userName":"joezim007","timestamp":1390199229,"content":"> > How can Dain be one of the worst?\n> \n>  \n> \n> I think you should reread what I wrote :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYea, he was agreeing with the person whose forum name is Dain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959467","commentId":959467,"userName":"Raven1015","timestamp":1390239144,"content":"> I believe that when you all talk about the best hero you live Dain out of it right ? I mean a great Glorfindel deck is way less powerful than a great Dain deck and dont talk about 2,3 or 4 decks build around Dain vs 2,3 or 4 decks build around Glorfindel there is no point\n\n \n\nDain is indeed super powerful and a strong Dwarf deck is nearly without match. But there's many ways to measure \"best\", which is what makes it so difficult. The reason why I personally gave Glorfindel the nod over Dain, for example, is because he is just so flexible. He can fit into a million different decks and play a key role in all of them, whereas Dain is more restricted (to Dwarf decks, basically)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959525","commentId":959525,"userName":"leptokurt","timestamp":1390243390,"content":"> I believe that when you all talk about the best hero you live Dain out of it right ? I mean a great Glorfindel deck is way less powerful than a great Dain deck and dont talk about 2,3 or 4 decks build around Dain vs 2,3 or 4 decks build around Glorfindel there is no point\n\n \n\nThat's true. Pippin is not too bad considering his low starting threat. His ability is helpful to cover the biggest weakness of hobbit decks, which is when a low threat enemy shows up and tries to tear your fellowship apart. My only criticism is that they shouldn't have limited his ability to all hobbit decks, so you could combo Pippin with Dunhere.\n\n \n\nIn comparism Faramir is possibly worse than Pippin. His stats are average, and his starting threat is simply to high and it contradicts his ability. Not sure why I shouls choose Faramir over Aragorn, Glorfindel or Elrond. Hell, even the nerfed Beravor is better than him!\n\n \n\nBest heroes: Glorfindel (spirit), Theodred, Dain, Beregond, Frodo. The first three can be used in every scenario, while the latter two (especially Beregond) are not as flexible. Beregond is, however, top notch in the defensive section. Frodo is simply a gamesaver."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959692","commentId":959692,"userName":"Scroll Lock","timestamp":1390253746,"content":"STOP IT, STOP, STOP HATING MY FARAMIR :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] MY EARS! They cry :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nIt is like this: If the current quest is battle: While Faramir is commited to a quest, each enemy has -1 threat, and it can even go under 0. And he has also boosted attack, and he is ranged and lore with good attack. And he is Ranger.\n\nThe hero I really dislike is Fatty Bolger. He is limited to enemies and he must exhaust for that action. I tried him so many times, but he is useless. Another hero I dont like is Gloin. Bad stats and bad sphere. 1 defense is really weak and letting attacks undefended is too risky nowadays, and leadership has better ways of resource making."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959706","commentId":959706,"userName":"Mndela","timestamp":1390254954,"content":"Curious: Fatty, Pippin Spirit and Frodo are... hobbits, spirit sphere and their hability is by raising threat level."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959934","commentId":959934,"userName":"GrandSpleen","timestamp":1390272654,"content":"> Curious: Fatty, Pippin Spirit and Frodo are... hobbits, spirit sphere and their hability is by raising threat level.\n\n \n\nYes.  People always point at Pippin (Spirit) for running counter to the general Hobbit threat strategy, but it's certainly not Pippin alone.  He's just got the least useful ability.  \n\n \n\nIt definitely seems to be a part of the design for Hobbits to have to wrestle with threat, rather than simply stay low and glide on their low starting threat.  I really like Fatty and got great use out of him in the Black Riders quests.  Pippin I tried, but in multiplayer he just tosses enemies at other players.  I think someone else already said it, but his ability would be totally fine if it read \"that enemy cannot engage anyone for the rest of the round.\"  And needn't be limited to Hobbit decks.  Frodo, well, we all know his ability is priceless, and shores up a weakness of Hobbit decks (taking hits).\n\n \n\nSo I'll agree that it sucks to raise your threat when you have a Hobbit deck, but I definitely think it's intentional and meant to be part of the challenge of playing with Hobbits.   I think the only reason Merry, Pippin (Lore), and Sam don't rely on raising your threat is that it would be overkill to force every available Hobbit to rely on that mechanic.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959967","commentId":959967,"userName":"joezim007","timestamp":1390275839,"content":"> > Curious: Fatty, Pippin Spirit and Frodo are... hobbits, spirit sphere and their hability is by raising threat level.\n> \n>  \n> \n> Yes.  People always point at Pippin (Spirit) for running counter to the general Hobbit threat strategy, but it's certainly not Pippin alone.  He's just got the least useful ability.  \n> \n>  \n> \n> It definitely seems to be a part of the design for Hobbits to have to wrestle with threat, rather than simply stay low and glide on their low starting threat.  I really like Fatty and got great use out of him in the Black Riders quests.  Pippin I tried, but in multiplayer he just tosses enemies at other players.  I think someone else already said it, but his ability would be totally fine if it read \"that enemy cannot engage anyone for the rest of the round.\"  And needn't be limited to Hobbit decks.  Frodo, well, we all know his ability is priceless, and shores up a weakness of Hobbit decks (taking hits).\n> \n>  \n> \n> So I'll agree that it sucks to raise your threat when you have a Hobbit deck, but I definitely think it's intentional and meant to be part of the challenge of playing with Hobbits.   I think the only reason Merry, Pippin (Lore), and Sam don't rely on raising your threat is that it would be overkill to force every available Hobbit to rely on that mechanic.\n\nI think Frodo, Pippin, and Fatty all raise threat (as opposed to other hobbits) because they are Spirit sphere. Spirit Pippin would the fine if he didn't need to raise threat by 3 (1 would be great and 2 would be manageable) and if fit didn't screw over the other players. I'm mostly ok that his ability only works in all-hobbit decks, but that too really limits his usefulness, especially with the number of other great hobbits that most people would rather have. His ability would be immensely useful in a Dunhere and/or Great Yew Bow deck, but neither card can be in an all-hobbit deck. I might even \"cheat\" and try him in a Dunhere/GYB deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=959982","commentId":959982,"userName":"Bullroarer Took","timestamp":1390277205,"content":"Pipped was the hobbit who was always dropping stones into wells or stealing stones from Gandalf, so him increasing threat is at least thematic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960058","commentId":960058,"userName":"leptokurt","timestamp":1390286482,"content":"> Pipped was the hobbit who was always dropping stones into wells or stealing stones from Gandalf, so him increasing threat is at least thematic.\n\nAnd we all should be glad that it's only 3 points!\n\n \n\n \n\nPerhaps one problem with spirit Pippin's low image is that both his lore self and Frodo are better versions. Frodo basically does the same thing as Pippin (raising threat instead of letting someone die), but at least Frodo doesn't send the enemy back to the staging area. Note that Pippin might get superior to Frodo as we get more and mor 4+ ATT enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960111","commentId":960111,"userName":"Mndela","timestamp":1390295092,"content":"Pippin spirit is not so bad in 2 players mode. His hability is good when the player who controls him is the last player. Enemy can't engage the next player and you can avoid the enemy one round (or kill him with Dunehre, trackers with bows, etc)...\n\nPippin sometimes is like Brand when he kills an enemy by ranged and other player ready one character and he doesn't know what to do with his iddle character. Then Brand is usefull when he plays under first player control... Thus, Pippin is usefull when he plays under last player control ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960253","commentId":960253,"userName":"joezim007","timestamp":1390314165,"content":"> Pippin spirit is not so bad in 2 players mode. His hability is good when the player who controls him is the last player. Enemy can't engage the next player and you can avoid the enemy one round (or kill him with Dunehre, trackers with bows, etc)...\n> \n> Pippin sometimes is like Brand when he kills an enemy by ranged and other player ready one character and he doesn't know what to do with his iddle character. Then Brand is usefull when he plays under first player control... Thus, Pippin is usefull when he plays under last player control ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\nThat's not true. Even if he is the last player, the first player will need to go through engagement checks again. You don't stop checking until no more enemies are able to engage. So, if the first player's threat is high enough, the enemy will still engage the first player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960297","commentId":960297,"userName":"Mndela","timestamp":1390316214,"content":"Glups. True... My defense for Pippin was a mistake. Lol, it is because i haven't never played him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960299","commentId":960299,"userName":"divinityofnumber","timestamp":1390316254,"content":"I really enjoy:\n\n \n\nLore Glorfindel\n\nSpirit Frodo\n\nBeregond\n\nEleanor\n\nLegolas\n\nHama"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960619","commentId":960619,"userName":"Raven1015","timestamp":1390330313,"content":"3 points of threat was certainly excessive. I think 1 point of threat would accomplish the same design goal, and returning enemies to the staging area has a downside built into it already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960817","commentId":960817,"userName":"Scroll Lock","timestamp":1390339579,"content":"But he is nice with Sam. You engage higher threat enemy to boost his stats and ready him. +1 DEF is sometimes difference between win and loose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960839","commentId":960839,"userName":"joezim007","timestamp":1390340920,"content":"> But he is nice with Sam. You engage higher threat enemy to boost his stats and ready him. +1 DEF is sometimes difference between win and loose.\n\nThats an interesting use of his ability, but it still begs the question of whether or not there are better choices. That ability will be rarely used in single player since there may not be enough enemies to make it worth puffing Sam if youre sending the enemy back. Also, if you use it a couple times, you'll end up not being able to find any enemies with higher engagement costs.\n\nThis might work better in multiplayer where you'll have enough enemies, some of which you want to pass off to the next player anyway. Once again, though, you still need to worry about your threat getting too high to be able to take advantage of Sam's ability. Definitely going to need some serious threat reduction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960883","commentId":960883,"userName":"Mndela","timestamp":1390343160,"content":"> But he is nice with Sam. You engage higher threat enemy to boost his stats and ready him. +1 DEF is sometimes difference between win and loose.\n\n \n\nWhen you use this combo 2 times, your threat is raised 6. Galadrim Greetings cost 3 resource and decrease your threat level 6. So hability of Pippin is equal to 1,5 resource.\n\nThe Westfold horse-breacker [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/shadows-of-mirkwood/the-hunt-for-gollum/westfold-horse-breaker-thfg]cost 2 resources and ready also one character (like Pippin reading Sam), but horse can also quest.\n\nSaw so, Pippin's hability is not too expensive... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited January 21, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960915","commentId":960915,"userName":"GrandSpleen","timestamp":1390344995,"content":"Pippin makes you want to use Hobbit Pipes, but every time I include them in a deck I end up cutting them for something else...\n\n \n\nedit: you know, would be fun to design a deck around the Pipes and threat-lowering events.  Lore/Spirit with Needful to Know and some scry to make it work, put in an elf for Elrond's Counsel, Galadhrim's Greeting, and Smoke Rings... Two hobbits and Spirit Glorfindel?\n\nEdited January 21, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960961","commentId":960961,"userName":"chuckles","timestamp":1390348131,"content":"> edit: you know, would be fun to design a deck around the Pipes and threat-lowering events.  Lore/Spirit with Needful to Know and some scry to make it work, put in an elf for Elrond's Counsel, Galadhrim's Greeting, and Smoke Rings... Two hobbits and Spirit Glorfindel?\n\n \n\nYes and even better... Lore/Spirit, Pippin, another hobbit & sp Glorfindel... means there is no need for spirit Pippin at all ;P"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=960985","commentId":960985,"userName":"Tracker1","timestamp":1390350483,"content":"Best hero in the game for solo player is Spirt Glorfindel, since there are many differnt types of decks that he can fit in to. In multi-player I have never found him to be incredible though.\n\nWorst hero Spirit Pippin his ability being strickly tied to a hobbit deck pretty much kills the card with the curent card pool. There is going to have to be some more strong player card combo's for hobbits to get him in a deck, ar least for this solo player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=961201","commentId":961201,"userName":"leptokurt","timestamp":1390380436,"content":"Yesterday I treid a mono tactics decks with a hero combo provided by -nebur-: Theoden, Thalin and Merry. Merry's ability is completely useless here, but still I managed to get awesome results. Related to spirit Pippin this means that sometimes you simply need a hero to provide a special sphere, some WP and not too much threat*. In this case, Pippin is the man of your choice.\n\n \n\n* admittedly Merry sticks out in tactics with his low threat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=961240","commentId":961240,"userName":"Kcall07","timestamp":1390387164,"content":"Like marrying your highschool girlfriend, I've never gotten over Leadership Aragorn.\n\nPeople rave about S. Glorfindel (low threat blah blah) but I honest think Aragorn is the better card. He can do everything: quest, hit, block, and that sentinel keyword is indespenible in multiplayer.\n\nGet Steward on him and his readying effect will work every turn. He has so many attachments that work with him specifically. The Sword is one of the most powerful cards in the game and can change your fortunes the moment it is played. The stone speaks for itself and ring is fantastic for undefended attacks and attaching Burning Brand. He has more of a claim then most to Blood of Gondor and Gondorian Fire too.\n\nBring on Anduril!\n\nEdited January 22, 2014 by Kcall07"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=961248","commentId":961248,"userName":"servant of the secret fire","timestamp":1390389892,"content":"I have to disagree with you.5 thread cost for a hero like Glorfindel it is not just blah blah.it is way too good.I think we rate heroes alone not with other cards combine (i think).Having low threat plus a great quester/attacker with no other cards on him makes Glorfindel a superior hero and i think you can put him in any deck and be equally effective.\n\n \n\nI have the same opinion about Dain.He is an awesome hero but if you don't use Dwarves in you deck i don't think someone wants to have him just for his stats.\n\nEdited January 22, 2014 by servant of the secret fire"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=961255","commentId":961255,"userName":"Mndela","timestamp":1390390882,"content":"I'm thinking about build a deck with the 3 spirit hobbits heroes: Pippin, Frodo and Fatty..., and all the pipes cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=961281","commentId":961281,"userName":"Kcall07","timestamp":1390395078,"content":"I know S Glorfindel is ridiculously good, so does everyone. That's why I said blah, blah because it's so obvious. I was presenting an alternative argument as to why one of the original heroes is still the best (card number 1, no less.) And with respect I can like a character on whatever grounds I choose. When he is named specifically on more attachments then any other hero in the game I think it bears mentioning.\n\n12 starting threat? Bring them on! Haha. It will take more then some blond ingenue to turn my head. My loyalty remains to the king of Gondor! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=961317","commentId":961317,"userName":"servant of the secret fire","timestamp":1390398517,"content":"Oh, a mortal King thinks he is equal to an Elf-Lord?Ask a Balrog's opinion on this matter :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] .\n\n \n\nSeriously now i wasn't trying make you change your mind about your favorite hero in my comment,i just thought wen i read the blah blah comment you meant that 5 threat cost wasn't a big deal(my English are bad so i may misunderstand people).\n\n \n\nAs for the attachments Light of the Valinor and unexpected courage have some words to tell you :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=961862","commentId":961862,"userName":"chuckles","timestamp":1390434697,"content":"> Yesterday I treid a mono tactics decks with a hero combo provided by -nebur-: Theoden, Thalin and Merry. Merry's ability is completely useless here, but still I managed to get awesome results. Related to spirit Pippin this means that sometimes you simply need a hero to provide a special sphere, some WP and not too much threat*. In this case, Pippin is the man of your choice.\n> \n>  \n> \n> * admittedly Merry sticks out in tactics with his low threat\n\n \n\nThis is true and its a good example... and if Spirit didn't have a number of other (and better, IMHO) low cost heroes I would agree, however; 5pt Glorfindel, 7pt Frodo, 7pt Eleanor, 7pt Fatty Bolger, even 8pt Caldara, 8pt Dunhere... makes this a harder sell\n\nEdited January 22, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=962798","commentId":962798,"userName":"joezim007","timestamp":1390512344,"content":"> Pippin makes you want to use Hobbit Pipes, but every time I include them in a deck I end up cutting them for something else...\n> \n>  \n> \n> edit: you know, would be fun to design a deck around the Pipes and threat-lowering events.  Lore/Spirit with Needful to Know and some scry to make it work, put in an elf for Elrond's Counsel, Galadhrim's Greeting, and Smoke Rings... Two hobbits and Spirit Glorfindel?\n\nWith Glorfindel, you can't use Pippin's ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97092-how-would-you-rank-the-heroes/?do=findComment&comment=962809","commentId":962809,"userName":"joezim007","timestamp":1390512783,"content":"> > Yesterday I treid a mono tactics decks with a hero combo provided by -nebur-: Theoden, Thalin and Merry. Merry's ability is completely useless here, but still I managed to get awesome results. Related to spirit Pippin this means that sometimes you simply need a hero to provide a special sphere, some WP and not too much threat*. In this case, Pippin is the man of your choice.\n> > \n> >  \n> > \n> > * admittedly Me\n> > \n> > rry sticks out in tactics with his low threat\n> \n>  \n> \n> This is true and its a good example... and if Spirit didn't have a number of other (and better, IMHO) low cost heroes I would agree, however; 5pt Glorfindel, 7pt Frodo, 7pt Eleanor, 7pt Fatty Bolger, even 8pt Caldara, 8pt Dunhere... makes this a harder sell\n\nIn this situation i might try to take Pippin just so I don't have to worry about including 3 copies of Light of Valinor, but I would potentially take Frodo or Eleanor instead. With Eleanor, you have to choose between the cancel effect or using her for other tasks. That's not true with the hobbits."}]}