{"url":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/","title":"Experience with 4 palyers","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958203","commentId":958203,"userName":"Legoland","timestamp":1390123908,"content":"I planed to invit some friends for LOtR LCG. At the moment I played allmost the whole time solo or with my brother.\n\nI tried to play a 4 player game \"four handed\" solo. But somehow it seems it is not as challanging as 2 or one player game... Indeed it was a little bit boring  :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]  The Core Set Quest were beaten easily. Even Dol Guldor was mor a walk through as a realy hard Quest.\n\n \n\nSo tell me you 4 Player gamers: Is it orth the time and funny? Or a waste of time? GOnna try the first cycle with \"four handed\" but I guess it don´t gets any harder. I allerady heard that 4 Player game is to easy. But that what I tried could nobody loose :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958255","commentId":958255,"userName":"Noccus","timestamp":1390135533,"content":"Some quests scale better for multiplayer then others, and vice versa.\n\nDol guldur is a good example of a quest that gets easier the more player are around the table, as the loss of a single hero gets less and less significant the more heroes are piling in on the scenario.\n\nThe other way around, from the top of my head are, of example: the long dark, foundations of stone, & assault on osgiliath.\n\nThese Get a lot tougher the more players join in, so I would recommend these if you are looking for a multiplayer challenge.\n\nAnd if you want my personal advice on it: pick up the foundations of stone, if you don't own it.\n\nAwesome multiplayer quest. May even be my personal favorite. And great player cards too boot!\n\nEdited January 19, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958334","commentId":958334,"userName":"joezim007","timestamp":1390143039,"content":"Some things get harder and some things get easier. Against decks with several surge cards, youre more likely to draw them each turn and if the encounter cards have a lot of abilities that synergize with each other then they will get more powerful with mod players because they will have more cards out to synergize with. also, there will be a greater number of \"when revealed\" effects coming into play, so there won't be enough copies of A Test of Will.\n\nMultiplayer has the advantage of decks being able to specialize a lot more on combat or questing so you don't run into problems with having a little of everything, and not enough of any of it.\n\nWith as easy as you make it sound, are you remembering to reveal 1 encounter card PER PLAYER in your multiplayer games?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958341","commentId":958341,"userName":"Scroll Lock","timestamp":1390144002,"content":"Try Assault on Osgiliath ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958349","commentId":958349,"userName":"Narsil0420","timestamp":1390144676,"content":"I found The 7th Level quest from the Khazad-dum box works really well for 4 players and with new players. Encounter at Amon-Din is also a good quest that is too easy (IMO) solo but works nicely with more players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958365","commentId":958365,"userName":"Ryakool","timestamp":1390145943,"content":"I've found tackling the Nightmare scenarios four handed has been a fun challenge. The Tally Pro IOS counter app has been very helpful keeping track of willpower and threat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958483","commentId":958483,"userName":"Legoland","timestamp":1390152819,"content":"> With as easy as you make it sound, are you remembering to reveal 1 encounter card PER PLAYER in your multiplayer games?\n\n \n\nYes of course :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] That what it makes so easy was the fact that allways every time was solving for the upcoming problems.\n\nNoone dies and seldom get hurt. But it´s good to hear that it seems no waste of time to get 4 people together to try having a nice evening. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I was afraid that all quest will stay that kind of level.\n\nHowever I herad that the balance  will be improved from Dwarorelf up (after Mirkwood)? Is that right? I only have Core Set + the Mirkwoodcycle and the Khazad Box.\n\nEdited January 19, 2014 by Legoland"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958669","commentId":958669,"userName":"Noccus","timestamp":1390157917,"content":"With the quests you currently have, I recommend you try to do return to mirkwood if looking for challenge.\n\nIt is very hard solo, but is quite doable multiplayer, as gollum switches controller every turn.\n\nThere is a lot of hate out there for this quest in solo players, as it's probably made for 3-4 players.\n\nAlso, the 7th level is a cool quest with several players.\n\nThere it's so much fun to try and keep those orcs off the table who keep piling up.\n\nThese are, imo, the best multiplayer quests you own.\n\nI'd give these a try with your buddies.\n\nThough return to mirkwood might be a bit rough if they are new players, mind you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97168-experience-with-4-palyers/?do=findComment&comment=958696","commentId":958696,"userName":"EclatK","timestamp":1390158961,"content":"Some quest include cards that scale to the number of player, making them really hard to deal with even with 4 player.\n\n(I'm thinking one with the attack of the goblin is dependant of the number of player).\n\n \n\nIn my opinion, the game is really meant to be played in multiplayer."}]}