{"url":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/","title":"Captured hero of Dol Guldur in your control","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=959499","commentId":959499,"userName":"Mndela","timestamp":1390241394,"content":"I want to play Mithrandir Counsil. My captured hero in Dol Guldur is of lore sphere. Does he count as a hero under my control? Can i draw 1 card by him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=959723","commentId":959723,"userName":"Thanatopsis","timestamp":1390256418,"content":"I find this question very tricky.  The card text states:\n\n\"Randomly select 1 hero card (among all the heroes controlled by the players) and turn it facedown. The hero is now considered a \"prisoner\", cannot be used, cannot be damaged, and does not collect resources, until it is \"rescued\" (as instructed by card effects) later in this quest.\"\n\n \n\nIf the hero is to be considered \"Out of Play\" the card would state that. The card states restrictions placed upon an in-play hero card.  I suppose that any game effect that does not violate one of those restrictions can target the hero.  Actually, that hero could be the target of an attachment with a very literal reading of the card.\n\n \n\nThe tricky part is what \"Used\" means.  I think most of us would agree that that \"used\" means cannot quest, attack, defend, or utilize abilities.  But \"be the target of an effect\", counting it's trait (ex/ towards a 5 dwarf count, etc)?  Those are a grey area for me.\n\n \n\nThematically, both options make sense:\n\n1) the hero is a prisoner.  That can be no interactions whatsoever\n\n2) the other heroes and allies draw inspiration from the captured hero \n\n \n\nHowever, the FaQ has the following:\n\n \n\nQ: If all of a player’s heroes (except for the captured hero) are destroyed during the Escape from Dol Guldr scenario, is that player eliminated from the game?\n\nA: Yes, the player is eliminated, and the players (as a group) have lost.\n\n \n\nThis implies that the captured hero is indeed removed from play.\n\n \n\nAfter going through all of this, my heart settles on treating the hero like it is out of play. But, I asked Caleb just to be sure.\n\nEdited January 20, 2014 by Thanatopsis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=960757","commentId":960757,"userName":"Thanatopsis","timestamp":1390335820,"content":"Here is Caleb's reply:\n\n \n\nI've gotten this question a few times. The \"prisoner\" hero is definitely still in play. That becomes more important in the nightmare mode. In normal play, the two most important things about \"the prisoner\" are: 1. that hero is turned facedown, and 2. that hero \"cannot be used.\" Together, this means the \"prisoner\" cannot contribute its card type, sphere, stats, traits, keywords, abilities, anything other than its uniqueness (i.e. I cannot play an ally version of the \"prisoner\" hero). So, no additional card draw for Mithrandir's Advice and does not count toward the number of Dwarf characters you control, etc. You could not attach anything to that hero either, because that would be using it's hero card type.\nHope you're enjoying the scenario. It's definitely a challenging one.\nCheers,\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=960798","commentId":960798,"userName":"Mndela","timestamp":1390338232,"content":"Ok, thank you. It is cleared."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=1248241","commentId":1248241,"userName":"TwiceBorn","timestamp":1409859028,"content":">  \n> \n> Here is Caleb's reply:\n> \n>  \n> \n> I've gotten this question a few times. The \"prisoner\" hero is definitely still in play. That becomes more important in the nightmare mode. In normal play, the two most important things about \"the prisoner\" are: 1. that hero is turned facedown, and 2. that hero \"cannot be used.\" Together, this means the \"prisoner\" cannot contribute its card type, sphere, stats, traits, keywords, abilities, anything other than its uniqueness (i.e. I cannot play an ally version of the \"prisoner\" hero). So, no additional card draw for Mithrandir's Advice and does not count toward the number of Dwarf characters you control, etc. You could not attach anything to that hero either, because that would be using it's hero card type.\n> Hope you're enjoying the scenario. It's definitely a challenging one.\n> Cheers,\n> Caleb\n> \n>  \n\n \n\nI have a related question. Stage 1A (setup) in Escape from Dol Guldur instructs the player to \"attach 1 encounter to each objective card.\" Let us say that one of the cards attached to an objective is the treachery card \"Caught in a Web,\" which must be attached to a hero \"when revealed.\"\n\n \n\nWe then proceed to Stage 1B after all encounter cards with \"when revealed effects\" have been attached to their respective objectives and resolved. For illustrative purposes, let us say that \"Caught in a Web\" is attached to Legolas. Stage 1B reads: \"When revealed: Randomly select 1 hero card (among all the heroes controlled by the players) and turn it face down. This hero is now considered a \"prisoner,\" cannot be used, cannot be damaged, and does not collect resources, until it is \"rescued\" (as instructed by card effects) later in this quest.\"\n\n \n\nIf Legolas is randomly selected as the prisoner and turned face down in stage 1B, does the Caught in a Web attachment that was played on him in Stage 1A remain attached, or does it get sent to the discard pile? I understand that Caleb's response (quoted above) indicates that you cannot attach anything to a hero AFTER they have been selected as the prisoner… but what happens to attachments attached to the hero before he becomes prisoner?\n\n \n\nMy inclination would be to discard the attachment when the hero/prisoner is turned face down, but… is there an official or commonly accepted method for resolving this?\n\n \n\nThanks in advance for your comments/feedback. \n\nEdited September 4, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=1260563","commentId":1260563,"userName":"TwiceBorn","timestamp":1410590139,"content":"Anyone?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=1260582","commentId":1260582,"userName":"TwiceBorn","timestamp":1410592335,"content":"Alright, I have clarified the wording of my question, and sent it to FFG/Caleb. Hopefully I will get a response shortly. In the meantime, here is the revised and more detailed question I sent (and still welcome community feedback on):\n\n \n\n \n \nStage 1A (setup) in Escape from Dol Guldur instructs the player to \"attach 1 encounter to each objective card.\" Let us say that one of the cards revealed by the encounter deck to fulfill the \"guarded\" trait on one of the objective cards is the treachery card \"Caught in a Web,\" which must be attached \"when revealed\" to one of the heroes controlled by the player with the highest threat level.\n \nWe then proceed to Stage 1B after all encounter cards have been revealed and attached to the objectives in the staging area, or have otherwise been resolved (e.g., treacheries). For illustrative purposes, let us say that \"Caught in a Web\" is attached to Legolas during Stage 1A. Stage 1B reads: \"When revealed: Randomly select 1 hero card (among all the heroes controlled by the players) and turn it face down. This hero is now considered a \"prisoner,\" cannot be used, cannot be damaged, and does not collect resources, until it is \"rescued\" (as instructed by card effects) later in this quest.\"\n \nIf Legolas is randomly selected as the prisoner and turned face down in stage 1B, does the Caught in a Web attachment that was played on him in Stage 1A remain attached when rescued (Stage 2B), or does it get sent to the discard pile immediately after the hero is picked as prisoner during 1B? I understand that nothing can be attached to the hero AFTER they have been selected as the prisoner (since the hero \"cannot be used\"), until they have been rescued… but what happens to attachments from the encounter deck attached to the hero BEFORE he/she becomes prisoner? \n \nThe same general question would apply to the \"when revealed\" effect of the King Spider (\"exhaust a character\"), if applied to a hero during the  set-up phase (1A), when that hero is subsequently selected as the prisoner in 1B. When rescued in 2B, would the hero/prisoner be flipped up and immediately exhausted (in addition to suffering 1 damage) as a result of the King Spider's \"when revealed\" effect during set-up, or would the King Spider's \"when revealed\" effects in 1A be ignored when the hero/prisoner is rescued in 2B? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=1260613","commentId":1260613,"userName":"alogos","timestamp":1410596247,"content":"Didn't answer you because I didn't know. Sending a question was the best choice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=1261705","commentId":1261705,"userName":"TwiceBorn","timestamp":1410678814,"content":"Thanks, alogos.\n\n \n\nI'll post the reply from FFG if/when I receive one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97427-captured-hero-of-dol-guldur-in-your-control/?do=findComment&comment=1272050","commentId":1272050,"userName":"TwiceBorn","timestamp":1411347899,"content":"Please see this thread for Caleb/FFG's response to my questions: http://community.fantasyflightgames.com/index.php?/topic/122601-reply-from-calebffg-re-question-about-encounter-deck-effects-during-escape-from-dol-guldur-set-up/ [https://community.fantasyflightgames.com/index.php?/topic/122601-reply-from-calebffg-re-question-about-encounter-deck-effects-during-escape-from-dol-guldur-set-up/]"}]}