{"url":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/","title":"What is your setup?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961118","commentId":961118,"userName":"Khamul The Easterling","timestamp":1390365336,"content":"I'm just curious how you have your cards laid out.\n\n \n\n \n\nPersonally, I put my heroes down in the middle, with my allies all in a line next to the heroes, to the right. Then I have my player deck all the way to the right usually.  \n\n \n\n1. So do you guys have your allies above or below your heroes like shown in the rule book?  Or do you have them to the right of your heroes like I do?  Or to the left?  \n\n \n\n2. When playing a multiplayer game, how do you do the encounter deck/staging area?  Do you put the players on each side of the table and do the \"encounter deck in the middle with sideways staging area\" setup?  Or do you do it a different way?  \n\n \n\n \n\nI was wondering how my card layout compared to you guys. \n\nThanks,\n\nKhamul\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961129","commentId":961129,"userName":"GrandSpleen","timestamp":1390367473,"content":"This is kind of a fun question. \n\n \n\nI've moved several times in the past year, and my setup has changed to accommodate whatever table space we have.  In some places we've played on the floor due to really limited table space.  And then there are coffee shops, and I've also taken the game camping several times...  the setup fluctuates ever so slightly :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nMy preference is for heroes in a row, then allies in a row below them.  I usually attach cards in a cascade off the lower right corner of a card, so that each one is visible.  If a hero gets a ridiculous number of attachments, I'll stack them and just keep the ones that need to be exhausted visible.  When I exhaust cards, I tip them 90 degrees.  I played with someone else who just did 45 degrees, and I was like awww no you didn't.\n\n \n\nAt present we played with a two-tiered coffee table.  There is limited space on the top tier, so our discard piles and decks go below, on the bottom level of the table.  Victory points and other removes cards go on the floor or on the bottom level.  Token banks are also on the bottom level.\n\n \n\nThe encounter deck goes to my right, which is player 2's left since we sit across from each other.  It's at a 90 degree angle to both of us, so we can both see it.  I reveal cards to the left of the encounter deck, which becomes the staging area.  The quest card goes to the immediate right of the encounter deck (toward me), and the active location goes immediately below the quest card.  Discarded encounter cards are \"above\" the encounter deck in a pile.\n\n \n\nHere's a picture of an older setup, where I lived last year before we moved.  We took the picture after a game of Flies and Spiders, which tends to see a crazy number of cards on the table.  We have a lot more table space in this picture, and it doesn't look at all like what I just described:\n\n \n\nlotr1_zpsa6e5d1ca.jpg [http://i503.photobucket.com/albums/e440/grandspleen/lotr1_zpsa6e5d1ca.jpg]\n\nEdited January 22, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961167","commentId":961167,"userName":"booored","timestamp":1390374753,"content":"We play almost exactly like in that picture, but we have the encounter deck in the middle as there are rules for who gets to peak and see the hidden information, so all players need to reach it. We are big believers in the table talk rules.\n\n \n\nThe travel location goes next to the encounter deck and the staging area is below it. I normally put my heroes at the base of everything and allies above them. Also, something I rarely see is that I place attachments that tap completely below the heroes, not under or on them. So to quest with fast hitch I just tap fast hitch, with out having to screw about touching the other cards.\n\n \n\nAlso we HATE the tokens and use dice. Silver Dice for Resources, Red Dice for wounds, Green Dice for quest points and a few others to track things like +will from attachments. Best way to use dice is to just go up to the 5 mark before you place the next dice, very easy at a glace to read the values when they are stacked in 5s.\n\n \n\nIt would look something like this... (go SumoPaint!)\n\nUntitled_1.jpg [http://s30.postimg.org/px9sukxbl/Untitled_1.jpg]\n\nWe almost always play 3 players.. try and imagine it on a round table and the player heroes more sorta angled. Two player is also kinda like this, this way we can all face the cards.\n\n \n\nFor solo I pretty much use the book setup.\n\n \n\n@GrandSpleen [https://community.fantasyflightgames.com/index.php?/user/177891-grandspleen/]... .ARRRGAgAGAGA no sleeves hurts my eyes!! it burns... it BURNS!!!!\n\nEdited January 22, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961181","commentId":961181,"userName":"servant of the secret fire","timestamp":1390377573,"content":"My friends don't like coop games (they all play GOT lcg) so i can only tell you my set up for solo play.\n\n \n\nMy favorite card game before LOTR lcg was LOTR ccg and there you had companions and allies.LOTR ccg had a rule wich says that your allies must go below your companions(its called supporting area) and your companions must be in a straight line.\n\n \n\nAt this game allies had a more supporting role and they didn't participate in a fight except if a minion(enemy) had an ability to attack your ally or your ally had an ability that  let him/her participate in a fight.\n\n \n\nSo after 6 years playing LOTR ccg it stucked to my mind that every character wich participates in a fight must be in the same line with all other characters fighting.That being said my heroes and allies are all in a straight line in front of me and i use the area below them  for other cards (like locations you take,artifacts etc) or if i have many allies in play and i dont have space on the table to put them in a straight line.\n\n \n\nAs for my deck i always have it on my left side and the encounter deck like in the rule book and in the tutorial video.\n\n \n\nI must agree with booored.No sleeves?You must have the softest(i hope this word realy exist) hands on earth :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] .\n\n \n\nps: As always sorry for my English."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961199","commentId":961199,"userName":"Olorin93","timestamp":1390380216,"content":"Interesting question. I like to keep my heroes in a row with attachments just below. The allies go all over the place; next to, below, slightly off to the side... never in front if I can help it. I think strong heroes should be on the front line, but table space governs this. I often group similar or identical allies (like healers) together, and tilt all cards 90 degrees when exhausted. The player deck and discard pile is to the right. I tried having it to the left as I'm left-handed, but I'm so used to drawing with my right from other card games.\n\n \n\n(For the sake of theme and general feel-good, I also often put characters that know each other together. The Arwen ally often goes between the Elrond and Aragorn heroes, Faramir ally with Boromir hero etc.)\n\n \n\nThe encounter deck is set up almost exactly as in the rulebook."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961257","commentId":961257,"userName":"Mndela","timestamp":1390391175,"content":"In octgn:\n\n \n\nllevandolacuenta.jpg [http://imagizer.imageshack.us/v2/640x480q90/46/llevandolacuenta.jpg]\n\n \n\nIn the same file are the players, even up to 4 players: same file. Is not bad idea :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited January 22, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961371","commentId":961371,"userName":"Mogloth","timestamp":1390403346,"content":"My specific layout depends on table size like others. But, generally, my heroes go in a line with the deck. And allies go in a row \"on top\" of them. It's a habit from my Magic days where my creatures go \"on top\" of all my mana.\n\n \n\nAttachments go under the characters. And the encounter deck is mostly a line too. With the deck on the right and then the quest and then the staging area. The traveled location goes under the quest. \n\n \n\nAnd when I'm doing 2 handed, which is pretty much all the time, the 2 player decks go side by side. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961382","commentId":961382,"userName":"Khamul The Easterling","timestamp":1390403761,"content":"> @GrandSpleen [https://community.fantasyflightgames.com/index.php?/user/177891-grandspleen/]... .ARRRGAgAGAGA no sleeves hurts my eyes!! it burns... it BURNS!!!!\n\nha I don't use them either.  Too expensive.  I'm as careful as possible while shuffling, using ways to shuffle the cards without damaging them.  When I shuffle a deck, I usually lay all the cards randomly down in 8 piles and then pick up the piles in different orders and shuffle them normally a bit and then I'm good.   \n\n \n\n \n\nThanks for the replies everyone.  Looks like it didn't turn out to be a stupid topic. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961401","commentId":961401,"userName":"GrandSpleen","timestamp":1390404690,"content":">  \n> \n>  \n> \n> @GrandSpleen [https://community.fantasyflightgames.com/index.php?/user/177891-grandspleen/]... .ARRRGAgAGAGA no sleeves hurts my eyes!! it burns... it BURNS!!!!\n\n \n\nHah!  That's an older photo, and I am proud to say that currently 100% of my cards are sleeved :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961501","commentId":961501,"userName":"Raven1015","timestamp":1390411614,"content":"My set-up may vary depending on table space. The most typical arrangement is deck, discard pile, and hand(s) at the very bottom of the table. The heroes go in a line above. Finally, the allies go in the next line above the heroes (perhaps this is a subconscious signal that they will be meat shields). Any enemies that engage will go just above the allies. As I usually play two-handed, this set-up is mirrored. Up above, I'll have the encounter deck with the discard pile next to it, and the staging area just below it. The quest stages will go off to the side with the active location just below it. \n\n \n\nIf I play multiplayer, then the encounter deck will be between us, with the staging area cards placed sideways so that all players can read them. \n\n \n\nSometimes I've had to play on some extremely confined surfaces, so in those cases I've stacked allies on top of each other, so that I can just barely see who the characters are and have space to put on damage tokens. Fortunately, I've played the game enough that I don't need to look at the cards that much in those situations. Since exhausting is hard when you don't have space, I'll just throw progress tokens on characters and attachments to indicate they've been exhausted (and this works surprisingly well). If I have the room though, I always prefer exhausting the full 90 degrees!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961504","commentId":961504,"userName":"Thanatopsis","timestamp":1390411799,"content":"I purchased a few spice mixing bowls from Bed Bath and Beyond to store tokens.  I was getting sick of them being scattered around the table.  The curved bottom of the bowl makes tokens really easy to drag out.  Plus, they look super classy and are a quaint size that easily fits on the table!\n\n \n\nhttp://www.bedbathandbeyond.com/store/product/ARC-4-3-4-Inch-Stackable-Bowl/1010201284?Keyword=bowl [http://www.bedbathandbeyond.com/store/product/ARC-4-3-4-Inch-Stackable-Bowl/1010201284?Keyword=bowl]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961676","commentId":961676,"userName":"Bullroarer Took","timestamp":1390422932,"content":"My setup is much like the picture above, especially if I'm the guy sitting on the far side of the table.  (My tokens are a little more organized though.  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] )  One thing I do that I haven't read about elsewhere is this:\n\n \n\n1.  If a character is committing to the quest I turn them 90º clockwise.\n\n2.  If I'm committing a character to the quest that does not exhaust to quest I turn them about 30º clockwise as a reminder.\n\n3.  If I'm exhausting a character for any other reason before the quest phase (Imladris Stargazer or Master of the Frog* for example) I tilt them 90º counter clockwise so that I know they aren't questing when it comes time to count up the Willpower.\n\n4.  Finally, if I have committed a character to the quest and an event card causes that character to be removed from the quest I turn them on their head.\n\n \n\nThese are just little things that help me count up the willpower after the event card(s) is revealed.\n\n \n\n \n\n*Intentional"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97553-what-is-your-setup/?do=findComment&comment=961799","commentId":961799,"userName":"GrandSpleen","timestamp":1390430141,"content":"> (My tokens are a little more organized though.  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] )  \n\n That was a victory dance!  When you win, it is required that you sprinkle progress tokens all over the final quest card.  I'm pretty sure it's in the manual."}]}