{"url":"https://community.fantasyflightgames.com/topic/97672-using-hero-faramir-in-blood-of-gondor/","title":"Using Hero Faramir in Blood of Gondor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97672-using-hero-faramir-in-blood-of-gondor/?do=findComment&comment=962904","commentId":962904,"userName":"Thanatopsis","timestamp":1390518022,"content":"Please check my logic:\n\n \n\nStep 2 of Setup is \"Place Heroes\"\n\nThis would put Hero Faramir into play\n\n \n\nStep 7 of Setup is \"Follow Scenario Setup Instructions\n\nAt this point Blood of Gondor Stage 1A would occur\n\n\"... Put the Faramir and Lord Alcaron objective allies into play.\"\n\n \n\nThe unique card rules states:\n\n\"If any player has a unique card in play, no player can\n\nplay or put into play another card with the same title.\n\nAny attempt to do so will fail to the extent that the card\n\nattempting to enter play remains in its current location\n\n(hand, deck, discard pile) and does not enter play.\"\n\n  \n\nBasically, this setup step would backfire and only Alcaron would enter play.\n\n \n\nNot sure why someone would do this.  Maybe they really want to use the Faramir ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97672-using-hero-faramir-in-blood-of-gondor/?do=findComment&comment=963119","commentId":963119,"userName":"GrandSpleen","timestamp":1390537006,"content":"Well, you couldn't use the Faramir ally if the Faramir hero was in play.\n\n \n\nAnyway, I believe the rules insert for this quest says specifically that the players cannot use any Faramir cards.\n\n \n\nedit: no, I can't find that line in the Blood of Gondor quest, maybe it was in Morgul Vale... I seem to remember reading that somewhere.  \n\n \n\nedit again: I found it, there is something about not using any version of Faramir in the Morgul Vale quest.  \n\n \n\nHeck, I dunno, maybe you're right and it is legal to use the Faramir hero here and just prevent the ally from coming into play :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Of course, he'll still get captured on the 2nd stage...\n\nEdited January 24, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97672-using-hero-faramir-in-blood-of-gondor/?do=findComment&comment=963236","commentId":963236,"userName":"Olorin93","timestamp":1390551976,"content":"My guess is you simply can't use the Faramir hero if a Faramir objective ally is present in the scenario. I always take out my Arwen allies from my deck when playing Redhorn Gate or Road to Rivendell as I can't play them anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97672-using-hero-faramir-in-blood-of-gondor/?do=findComment&comment=963245","commentId":963245,"userName":"jjeagle","timestamp":1390554949,"content":"I think Thanatopsis' interpretation of the set-up rules is correct. It's only Morgul Vale that specifically prohibits the use of Faramir."}]}