{"url":"https://community.fantasyflightgames.com/topic/97854-question-on-the-word-control-and-ori/","title":"Question on the word &quot;control&quot; and Ori","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97854-question-on-the-word-control-and-ori/?do=findComment&comment=965269","commentId":965269,"userName":"gorenut","timestamp":1390776429,"content":"So me and my girlfriend are debating on how the \"control\" word works, specifically how it pertains to the \"Ori\" hero card. \n\n \n\nThe description in the card is that if I \"control\" at least 5 dwarf heroes, I get the draw an extra card. \n\n \n\nI think it's only if you have 5 dwarf characters in play that counts towards this because on page 25 it states that cards that are \"out of play\" do not interact with the words, etc unless specifically stated on the card.\n\n \n\nShe thinks as long as I have 5 dwarfs in my player deck somewhere, it counts towards the 5 going on the wording on page 25 in the paragraph before the one I described (under Control and Ownership) where it states that all the cards that the player \"owns\" is under his \"control\" until that ownership is altered. \n\n \n\nSo which is it? Thanks for the help in advance, we're both new to the game and basically just got both the core set and the first Hobbit expansion. Having a blast.\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97854-question-on-the-word-control-and-ori/?do=findComment&comment=965284","commentId":965284,"userName":"vjg13","timestamp":1390777820,"content":"You'd have to have five dwarves in play. Cards in hand and discard pile areconsidered out of play. Of course Ori counts himsellf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97854-question-on-the-word-control-and-ori/?do=findComment&comment=965388","commentId":965388,"userName":"gorenut","timestamp":1390786237,"content":"Thanks all, thats what I figured. The girlfriend was just so hung up on the wording of \"control\" in the manual. Having played many card games myself, I was already used to the concept of just deployed cards. "}]}