{"url":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/","title":"Card Sleeves","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=966648","commentId":966648,"userName":"la1cajun","timestamp":1390921963,"content":"Why in the heck does FFG have the core set needing number 5 sleeves and expansions number 2. Are the cards different sizes. I was gonna pick some up that were good for shuffling but now I dont know which to get. I dont have any expansions yet, waiting for gollum, so I dont really know the size of the ones in the adventure packs but seems like they should be same size. Anyway, any ideas would be great! Thanks again"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=966658","commentId":966658,"userName":"mewmartigan","timestamp":1390922682,"content":"They are telling you the quantity you need to buy. The color (grey in this case) is the size of the sleeve. Each sleeve pack is 50 cards. Since the core set has over 200 cards, you need 5 packs of card sleeves.\n\n \n\nI like FFG sleeves but I am going to give Ultra Pro a try as they are a bit cheaper for such a large amount of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=966702","commentId":966702,"userName":"la1cajun","timestamp":1390924554,"content":"Ahh ok. Was looking at that wrong. Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=966737","commentId":966737,"userName":"Scroll Lock","timestamp":1390926496,"content":"what is FFG's sleeves advantage over Ultra Pro?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=966770","commentId":966770,"userName":"la1cajun","timestamp":1390928833,"content":"Dont know. Ill have to look. I was just curious at how they were numbering those. I looked at my local game store and the FFG sleeves sized for the LOTRCG seemed like a well made sleeve for gaming. Ill have to do some looking. Right now i found these old 99 cent for 100 cheapo sleeves around the house and they just dont do the trick and are paper thin. But i knew that ahead of time so i figured I would use them till I got some others. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=966941","commentId":966941,"userName":"booored","timestamp":1390938394,"content":"I use Dragon Shields CLEAR for my cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967021","commentId":967021,"userName":"Dedalus","timestamp":1390942581,"content":"I am using Ultra Pro clear sleeves and they are good. \nBut, I will probably replace them with Ultra Pro Matte Black (have ~300 and used them when I was playing MEtW) because I found them to be more cool and serious  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited January 28, 2014 by Dedalus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967101","commentId":967101,"userName":"CJMatos","timestamp":1390947074,"content":"I use Ultra Pro Matte sleeves.\n\n \n\nAnd i'm happy with the no-wear of them"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967330","commentId":967330,"userName":"divinityofnumber","timestamp":1390964175,"content":"I use Ultra Pro Matte Black for all player cards, and have never sleeved my encounter cards. I have been thinking of buying some cheap clear sleeves and sleeving my encounter cards, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967478","commentId":967478,"userName":"faith_star83","timestamp":1390983022,"content":"I used to sleeve all my cards with clear sleeves in the beginning, but now I only sleeve my player card decks. When I started playing, I was still living in Japan and found very nice clear sleeves, they are still perfect even after three years of heavy use. Unfortunately they are from a Japanese company and I don't want to start mixing the sleeves with Ultra Pro or FFg stuff, because they will probably not be exactly the same...plus the Japanese ones were unbeatable when it comes to cost performance.\n\n \n\nGuess Japan is the place to be for cardgame nerds...card games are huge there! Maybe I'll just have a large quantity of sleeves shipped over, but it seems a bit exaggerated to have just the sleeves shipped through half the world :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png] I certainly pick up some when I go back there in May thoguh :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967490","commentId":967490,"userName":"booored","timestamp":1390984432,"content":"what is the brand name of the sleeves?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967505","commentId":967505,"userName":"faith_star83","timestamp":1390985681,"content":"The company is called Epoch\n\n \n\nHere is the link to the sleeves on amazon.co.jp\n\nhttp://www.amazon.co.jp/gp/product/B00297QUSS/ref=oh_details_o03_s00_i00?ie=UTF8&psc=1 [http://www.amazon.co.jp/gp/product/B00297QUSS/ref=oh_details_o03_s00_i00?ie=UTF8&psc=1]\n\n \n\nThere are some guys complaining in the review section that the quality is minor and the size of the sleeves varies to strongly. Honestly, I never noticed anything. But the price seems to have gone up! I only paid 200 yen per pack...\n\n \n\nActually, I think I'm just going to pick up a pack of sleeves on my way home from the local game shop, maybe there are almost the same ones and my problem would be solved...a bit OCD anyway I guess\n\nEdited January 29, 2014 by faith_star83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967613","commentId":967613,"userName":"vjg13","timestamp":1391001193,"content":"I like how sleeving makes it easier to shuffle.  Just split it in two and they slide right into each other.  The penny sleeves wear out pretty quick though and the shuffling isn't as even any more after a while and cards tend to stick and clump into big groups when shuffling this way.  The FFG clear sleeves I use for this game are amazing.  No signs of any wear.  I don't know how some people say they don't sleeve their player decks or encounter decks I used to be the same with my twilight struggle game but soon some cards had more wear than others and became marked had to buy colored back sleeves to fix that problem wish I would've sleeved in em clear sleeves from the beginning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=967632","commentId":967632,"userName":"Style75","timestamp":1391003480,"content":"Penny sleeves for encounter cards, FFG standard clear sleeves for player cards and heroes. I'm really glad I sleeved because of all the times I've seen the sleeves scuffed up, covered in sticky stuff, crumbs, and nastiness. I play with friends and while I like them a lot, they don't love my cards the way I do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=968132","commentId":968132,"userName":"booored","timestamp":1391031216,"content":"yeah there is no way you can protect your cards without sleeves... if you play then they get worn.. it is that simple. Yes sleeves can be expensive, but there are ways to do it so you do not have everything sleeved .. still the cards are also expensive.. so it makes sense to me to protect them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=968227","commentId":968227,"userName":"mewmartigan","timestamp":1391037886,"content":"So I found Ultra Pro sleeves at my local WalMart. 100 clear sleeves for $0.98 so I bought 4 packs. If the penny sleeves wear out after a while that is fine for the cost. I have the FFG sleeves on my X-Wing cards (way less cards in that game) and you can definitely tell a difference.\n\n \n\nIf the penny sleeves eventually fail I will get more or switch to FFG depending on how long they last."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=968308","commentId":968308,"userName":"servant of the secret fire","timestamp":1391044334,"content":"> Penny sleeves for encounter cards, FFG standard clear sleeves for player cards and heroes. I'm really glad I sleeved because of all the times I've seen the sleeves scuffed up, covered in sticky stuff, crumbs, and nastiness. I play with friends and while I like them a lot, they don't love my cards the way I do.\n\nUnfortunately not only your friends don't love the cards as we do.Its a universal problem.Wen some friends want to try the game and they don't have experience with card games first i announce the rules of how we hold the cards and what we don't do with the cards in our hands and then i explain the game. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=968462","commentId":968462,"userName":"la1cajun","timestamp":1391058932,"content":"Thanks servant of the secret fire! I just got my sleeves today and went with the FFG ones. They are perfect. Couldn't ask for anything better for now and I got enough for all core set and my upcoming hunt for gollum I will be getting when it re surfaces for sale. I went with all clear. The ones I was using was the ones I think you can buy like 100-200 for 1-2$ . They are so thin, if you try to shuffle you need to be careful or they will split. It's ones I had laying around the house with old Pokemon cards my son used to fool around with. Just wanted to have them in something till I got my good ones!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=969247","commentId":969247,"userName":"Karlson","timestamp":1391117840,"content":">  \n> \n> > Penny sleeves for encounter cards, FFG standard clear sleeves for player cards and heroes. I'm really glad I sleeved because of all the times I've seen the sleeves scuffed up, covered in sticky stuff, crumbs, and nastiness. I play with friends and while I like them a lot, they don't love my cards the way I do.\n> \n> Unfortunately not only your friends don't love the cards as we do.Its a universal problem.Wen some friends want to try the game and they don't have experience with card games first i announce the rules of how we hold the cards and what we don't do with the cards in our hands and then i explain the game. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nThat is a great idea.  I found myself horrified at how some of my new-to-the-game friends \"shuffled\" their player decks that I made up for them.  It was all I could do not to say: \"Here, let me shuffle those for you!\"  But, alas I did not and worried about my poor cards in their sweaty fumbling hands all night!  Yet another reason why I like... no prefer... to play this game by myself.  Maybe that would change if I had friends that actually knew the difference between a treachery and shadow card though!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=969581","commentId":969581,"userName":"booored","timestamp":1391148113,"content":"Yeah I get that a lot.. I fan shuffle my decks at comps all the time and sometimes the other players have mini strokes across the table :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited January 31, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=969593","commentId":969593,"userName":"GrandSpleen","timestamp":1391149908,"content":"hah!  I don't mind bridging my cards even though I cared enough to put them all in sleeves.  But I am a horrible shuffler overall... and the sleeves are so slippery, it makes it worst.  Most of my shuffling I end up doing by dealing out the deck into 6 stacks, then randomly putting them back together.\n\n \n\nI would love an automatic shuffler, but I am sure nothing exists for sleeved cards, and anyway the potential to damage the cards would be a lot higher in the cold, unloving hands of a machine..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=969599","commentId":969599,"userName":"booored","timestamp":1391150328,"content":"I have tried them before... not for collectable games.. just poker with the guys. One of our wives got it for a mate for xmas. They work.. but they are really noisy and they do damage the cards, badly.. at least the cheap one we had.\n\nIf someone could invent a shuffler that would work on sleeved cards (dragon shields please) and show they are not destructive, then they would make a fortune in kickstarter.\n\nGames like Arkham Horror need this so badly, that many people do not even sue the cards and not use mobile apps to draw the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=969858","commentId":969858,"userName":"Khamul The Easterling","timestamp":1391180846,"content":">  Most of my shuffling I end up doing by dealing out the deck into 6 stacks, then randomly putting them back together.\n\nSame.  That's the only reason I don't have sleeves for my cards.  When you shuffle them that way they don't get damaged."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=970210","commentId":970210,"userName":"Style75","timestamp":1391195737,"content":"Funny, I actually find shuffling with sleeves so much easier than shuffling by hand. Check out this video [http://www.youtube.com/watch?v=zjLp5wh5y90] to see my preferred method. It's fast, easy, and works great.\n\n \n\nI find the trick with sleeves is to train yourself to always hold your cards and decks by the edges instead of trying to compress them (compressing them causes them to spray everywhere, not fun). When you're shuffling, just let your grip slack off a little so the cards open up and just jam your piles together. Presto! shuffled deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=973427","commentId":973427,"userName":"Fippin","timestamp":1391513749,"content":"Ok. Guess I'm a sucker. I started using the FFG art sleeves that match the card backs. (Of course clear would have gotten me the same result, right?) Still they look great even though they are more expensive.\n\nI'm a terrible shuffler. But I feel better after seeing Style75's video, because that seems a lot easier than what I've been doing. How many times do you split and combine?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=973434","commentId":973434,"userName":"booored","timestamp":1391514663,"content":"As many times as you like.\n\nTragic [https://www.youtube.com/watch?v=R9-muxXwnaE&list=PLyyQgJXgN4c6oNrOpg5NKHz9NZspcX-CZ&feature=player_detailpage#t=383] did a cool bit on shuffling on one of his vids.. even has a guest spot fomr the mad Russian.\n\nIn it he linked a cool tutorial vid\n\n\n\n\nEdited February 4, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=973608","commentId":973608,"userName":"la1cajun","timestamp":1391527935,"content":"Dang, both videos are pretty cool with different shuffling ideas. Thanks for posting those guys!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/97946-card-sleeves/?do=findComment&comment=973612","commentId":973612,"userName":"la1cajun","timestamp":1391528198,"content":"So far Ive had my Fantasy flight clear sleeves for almost a week and i still could not be more pleased so far. They are not the cheapest sleeves but they are definitely not the most expensive either. I find them right in the middle of the road. I shuffle some a little like the first video above then use the old random 8 stacks trick and then cut and it seems to work well most of the time without any problems. "}]}