{"url":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/","title":"What makes this better than a computer game?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968277","commentId":968277,"userName":"Cunir","timestamp":1391041990,"content":"I was playing Lord of the Rings online the other day, and i was sitting there thinking that i'd rather be playing the card game. And then i wondered Whats the reason?\n\nThe computer game should be better in every way — its got loads of real people playing with you, instead of maybe 1 or 2 (or none). There are more places to explore. More enemies and characters, more items... more variety... More of everything. And its got sounds and music too. But i still pulled out the card game which is basically just a load of cardboard and counters.\n\nI think its just nice to have the stuff in your hands, to look at, instead of just mashing buttons on a mouse for an hour. And its much harder too, so its more of a challenge"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968298","commentId":968298,"userName":"Gizlivadi","timestamp":1391043811,"content":"Well, they are two completely different mediums for starters, meant to tackle on totally different sets of abilities. I enjoy mostly the \"having the stuff in your hands\" part, and I see each card as a little individual piece of artwork. But videogames are more about the action, the movement, reflexes, etc. While this game is about calculation, logical interactions, as well as theme. I don'0t think one is really more worthwhile than the other, it's just based on personal preference. I enjoy video/movement games from time to time, but I tend to enjoy card/board games more because of the strategic aspect, the artwork, the storybook aspect, etc. And while I agree that LOTRO has a much wider world to explore, I don't think it'll take that long for this game to catch up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968392","commentId":968392,"userName":"Bullroarer Took","timestamp":1391052014,"content":"I've never played LOTRO. Is there any strategy to it?\n\nEdited January 30, 2014 by Bullroarer Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968402","commentId":968402,"userName":"divinityofnumber","timestamp":1391053019,"content":"Need for Cognition. [http://en.wikipedia.org/wiki/Need_for_cognition]\n\n \n\nComputer games can be shiny and pretty, but some of us crave using our brains for complex cognitive tasks. Computer games calculate everything for you, while you just press the \"attack\" button. Card games can be, in many ways, more cognitively engaging. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968419","commentId":968419,"userName":"klaymen_sk","timestamp":1391054481,"content":"> But videogames are more about the action, the movement, reflexes, etc.\n\nNo offense, but such sweeping generalisations are worthless. In fact, my collection of turn-based strategy games and RPGs may want to have a word with you. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Not to mention superior reflexes may not win you the game, when your strategy or tactics is inferior."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968430","commentId":968430,"userName":"Gizlivadi","timestamp":1391055631,"content":">  \n> \n> > But videogames are more about the action, the movement, reflexes, etc.\n> \n> No offense, but such sweeping generalisations are worthless. In fact, my collection of turn-based strategy games and RPGs may want to have a word with you. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Not to mention superior reflexes may not win you the game, when your strategy or tactics is inferior.\n> \n>  \n\n \n\nYou're right, and I stand corrected, then. I actually thought about strategy videogames but was too lazy to edit, lol. Though far from being the norm, strategic, turn based non-realtime video games exist, and in that case, the reason I prefer card and board games is that I just prefer to have tiny colorful objects in my hands.\n\nEdited January 30, 2014 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968439","commentId":968439,"userName":"booored","timestamp":1391056268,"content":"computer games suck. Card / Board / RPGs don't.\n\n/end of thread"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968452","commentId":968452,"userName":"servant of the secret fire","timestamp":1391057540,"content":"> I've never played LOTRO. Is there any strategy to it?\n\nNo its a classic MMORPG like WOW,Rift,Warhammer online etc.Strategy in mmo's its different from a card game.In mmo's you must make a strategy how you will kill the boss in pve (knowing wen to heal,where and how to tank the boss etc) or to organize your raid in pvp (where you must attack,what keep you must take first etc).\n\n \n\nThat being said i like both video and card games but i play them for different reasons.Card games is more relaxed and more stategic but wen i am in a mood to kill a horde of brainless orcs with my elven sword a video game like War in the North or the upcoming Shadow of Mordor is a better choise.\n\n \n\nAs for LOTRO i have only two words:Hobbit guardian :angry: [//content.invisioncic.com/Mfantflight/emoticons/default_angry.png] .Really Turbine???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968496","commentId":968496,"userName":"Legoland","timestamp":1391062922,"content":"Computergames can also be challanging and tricky. Even LOTRO. But the problem I always have is when I logged off and shut down the PC. I asked myself: What have I done the last hours? Moving a electronic 1001110010 character from one to another point fight xy monster get reward upgrad my equipment - fantastic. But nothing of that realy belongs to mi in real life. So I turn off the computer and had nothing. Just changed a few rows fo 1110110101101 numbers.\n\nThe card game challange me and it is tricky too. But in the end you still pull the box full of cards in your cupboard and know that you have a fantastic collection with a little worthiness.\n\nAlso I´m realy relay afraid about kind of gams with no realy end (not only MMORPG) since scientists discovered that exzessive gamers has the same reaction areas in theier brain as alcoholis (so they talk about an offical addiction)... But thats enough fodder of conversation for a new topic though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968522","commentId":968522,"userName":"Nizi","timestamp":1391067929,"content":"A computer game has one advantage: it eliminates all the chores like die-throwing by automating them.\n\n \n\nNowadays, they are no shallow that it's often more fun to play an - often more complex - card game. And it adds 'moddability': you can change the rules at will to make it more interesting. You can not always do that in a game on pc;"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968547","commentId":968547,"userName":"HeavyKaragh","timestamp":1391071397,"content":"I don't find videogames better that board games, neither the other way. They offer to me different things that I may prefer for different moments. I find board games more relaxing and enjoyable to play with others, competitive or not. But I also love how much concentration action videogames need to success, even more arcade games (Gradius, King of Fighters), but I usually play solo, not even on-line. I hate MMO games.\n\n \n\n> it adds 'moddability': you can change the rules at will to make it more interesting.\n\nYes, this is a great advantage of board games. Also is easy to add custom content.\n\nEdited January 30, 2014 by karagh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968571","commentId":968571,"userName":"iznax","timestamp":1391075362,"content":"Comparing a board/card game to a video game is like, comparing a book with a movie, no one can say this is better or worst, i'm a gamer all my life and my video game collection is probably bigger than my board game ( except sony prodacts i have any console up to day ) but i can say i like board games more, does this make board games better ? I thing no.\n\n \n\nP.S. Lotr lcg is my number 1 card game, LOTRO is not even in my top 10 MMO games ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited January 30, 2014 by iznax"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968636","commentId":968636,"userName":"faith_star83","timestamp":1391084703,"content":"I think this is an interesting topic. Personally, I prefer Card / Board Games to Computer Games because they usually leave me more creative freedom (especially true for lotr lcg) and are more strategic and intense.\n\n \n\nBut I think the discussion will become somewhat more redundant as we see new technologies emerging that make virtual space increasingly transcend into the real world. Computer Games profit from elaborate graphics and sound and you can fully emerse yourself in them - within the scope defined by the designers. \n\n \n\n> Computergames can also be challanging and tricky. Even LOTRO. But the problem I always have is when I logged off and shut down the PC. I asked myself: What have I done the last hours? Moving a electronic 1001110010 character from one to another point fight xy monster get reward upgrad my equipment - fantastic. But nothing of that realy belongs to mi in real life. So I turn off the computer and had nothing. Just changed a few rows fo 1110110101101 numbers.\n\n \n\nI think this point strongly depends on your personal opinion. Computer games can provide a sensual and rich experience worthy of your time. Personally, I don't question my usage of time as long as I have fun. I don't think it's better to do something in real life just for the fact that there is a real effect on the physical environment. And as said before, the more ICT evolves, the more relevant virtual interaction becomes.\n\n \n\nI can relate to the \"holding stuff in your hands\" aspect, as I also love to just handle cards, tokens and whatnought. However, in terms of community the online world clearly has its benefits and so do digital distribution models. Look at Solforge or Hearthstone...isn't it strange to play a \"card\" game without actual, physical cards? At first thought one might think so, but the fun factor remains almost intact once you're used to the new concept (but then again I did not find either one very interesting either ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ). \n\n \n\nUltimately, I think we will see an increased disappearance between \"real\" / \"virtual\" and \"online\" / \"offlline\" and this will affect card games, also. Especially competitive ones. But your personal preference remains your own choosing.\n\n \n\nFor me, whereas I do sometimes play computer games, I still prefer the \"real deal\" and actually holding my cards in hand. On the other hand I am startled at how comfortably I can pop a quest or two after dinner with OCTGN :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited January 30, 2014 by faith_star83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968668","commentId":968668,"userName":"alogos","timestamp":1391087648,"content":"> Need for Cognition. [http://en.wikipedia.org/wiki/Need_for_cognition]\n> \n>  \n> \n> Computer games can be shiny and pretty, but some of us crave using our brains for complex cognitive tasks. Computer games calculate everything for you, while you just press the \"attack\" button. Card games can be, in many ways, more cognitively engaging. \n\n \n\nIntroducing : Path of Exile... Well, I spent more time on paper, planning my character, than actually playing the game (or close...)\n\n \n\nAs for Card Game vs Video Game : \n\nCard Game is a social event where you meet friend in real life and talk and interact and all that.\n\nIf there is a lotr lcg video game allowing custom scenario and custom card, I would love it, and I would never buy the card game if it is only for playing solo.\n\n \n\nAnd then, everyone has his reason..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968678","commentId":968678,"userName":"Olorin93","timestamp":1391088546,"content":"Thank you for raising this; it's a very interesting question.\n\n \n\nI play Lotro occassionally as well and enjoy it, but I need to be playing with someone else. (I pretty much solo'd from level 1 to 60 on my main character a few years ago, and am now pretty fed up with playing alone.) The card game is entertaining in groups, but - to me - it also works fine as a single-player experience. Why? Honestly, I'm not sure. I suppose it is in a way more tangible than playing on the computer; I like buying and collecting the cards, and building decks with different characters and strategies. I like the strategy element of the card game, and, even though there are strategic classes to play in Lotro, the card game is more relaxing as you don't have to react quickly but can take time and consider your choices (and drink a cup of tea while thinking). I love playing my Lore-Master in kinship groups, but it demands your constant attention, and you speak of little else than the objective and enemies at hand with your co-players. Sitting around a table with your friends is an entirely different experience - and the battles are just as exciting without \"smack!\" \"clash!\" \"boom!\" \"*wilhelm scream*\".\n\n \n\nI was a pretty serious PC gamer a few years ago, MMO and otherwise, but now I only play casually, and mostly to talk to friends who live far away. Now, I have come to prefer board games.\n\n \n\nShort answer: digital and board gaming are totally different media, and I enjoy both in different situations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968721","commentId":968721,"userName":"Khamul The Easterling","timestamp":1391091945,"content":"How about playing Lord of the Rings LCG on the computer? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968726","commentId":968726,"userName":"Cunir","timestamp":1391092413,"content":"one advantage for the card game — you are also building up a collection at the same time, and it's nice to see your collection of cards grow and expand as time goes on. you don't get that with a computer game\n\n \n\nand one advantage for the computer game (specifically LOTR online) — there is a lot more continuity from one game to the next. what you did last week effects what you can do this week. your character's stats get better and his equipment gets better the more time you put into it, which can be satisfying... trying to get better stuff than everyone else\n\n \n\nbut it looks like the card game is starting to address that with the saga expansions, with all their boons and burdens ideas, and i think it will be nice to see some more of that. picking the card game up tomorrow and having no real continuation from what happened today is it's only real flaw i reckon.\n\ni know they've got nightmare mode, and all that stuff, but i don't think that is the same thing. i like what they are doing with boons and burdens much better. i hope they expand it to include lots more equipment and people too, so you can only use them once you have 'unlocked' them\n\nEdited January 30, 2014 by Cunir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968769","commentId":968769,"userName":"Distractionbeast","timestamp":1391095188,"content":"I like the card game more for a few reasons:\n\n 1. Less influenced by the Peter Jackson alternate universe.\n 2. The cards are beautiful.  I've played LotRO and their characters are NOT.\n 3. Most of the time, MMORPGs limit their social interaction to sparce typing or *maybe* voice chat (or emotive animations?).  When I play the LCG, I invite a friend over and we chat and work out strategies face-to-face.\n 4. When LotRO is a few years old, it will be shut down and you will be left with an expensive splash screen that tells you how much they thank you for playing all these years.  The LCG will still be in your box, ready to play.\n 5. I can control Glorfindel, who makes the Nazgul soil their robes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968816","commentId":968816,"userName":"Olorin93","timestamp":1391096939,"content":">  \n> \n> I can control Glorfindel, who makes the Nazgul soil their robes.\n> \n> \n> \n>  \n\nThis is very true.\n\nIt is also true that the card game can be played indefinitely whereas you never know how long an online game will be available.\n\n \n\nAs Cunir says, it would be nice with some more continuity in the card game. I haven't played any of the saga expansions so I don't know about boons and burdens, but it sounds promising."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968947","commentId":968947,"userName":"servant of the secret fire","timestamp":1391103453,"content":">  \n> \n> I like the card game more for a few reasons:\n> \n>  1. Less influenced by the Peter Jackson alternate universe.\n>  2. The cards are beautiful.  I've played LotRO and their characters are NOT.\n>  3. Most of the time, MMORPGs limit their social interaction to sparce typing or *maybe* voice chat (or emotive animations?).  When I play the LCG, I invite a friend over and we chat and work out strategies face-to-face.\n>  4. When LotRO is a few years old, it will be shut down and you will be left with an expensive splash screen that tells you how much they thank you for playing all these years.  The LCG will still be in your box, ready to play.\n>  5. I can control Glorfindel, who makes the Nazgul soil their robes.\n> \n>  \n\n1.Many people don't like Peter Jackson's material from the movies but some  things like sir Ian Mckellen as Gandalf, Viggo Mortensen as Aragorn,Galadriel,Saruman(sir Christopher Lee met Tolkien) and the places,.costumes etc are like they poped up from the books.Sure many things were wierd and far from what Tolkien wrote but i must give a big thanks to Peter Jackson for bringing Middle Earth to life.\n\n \n\n2.i' am 100 % with you.\n\n \n\n3.Meeting with my friends in real life is always better than speaking to ventrilo,skyoe etc.I agree with you again.\n\n \n\n4.Again i agree.\n\n \n\n5.Amen brother.If they also give me a Galadriel  hero i will be the happiest gamer in the world :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] .\n\n \n\n> How about playing Lord of the Rings LCG on the computer? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nThe best thing of card games is that you hold the cards in your hands play them on the table and have fun with your friends.Clicking on a virtual card and play alone in your pc makes the magic of a card game disappears."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=968993","commentId":968993,"userName":"CaffeineAddict","timestamp":1391105521,"content":"I've always preferred card games and board games to computer games. I dont play them. I work in IT, so I spend a fair portion of the working day staring at screens. So when it comes to games, I'd rather do something else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=969244","commentId":969244,"userName":"Karlson","timestamp":1391117618,"content":"> I've always preferred card games and board games to computer games. I dont play them. I work in IT, so I spend a fair portion of the working day staring at screens. So when it comes to games, I'd rather do something else.\n\nExactly what I was going to say.  Most of us spend so much our lives in front of electronic screens, whether they be computuers, cell phones, or televisions.  So, it is so nice just to relax with something non-digital that holds a physical presence that you can interact with.  That's one of the main reasons I have really gotten out of video games and into board and card games in the past year.  I can't remember the last time I actually played a video game to be honest, but it's been a while.  I've purchased a handful of board games in the past few months and have had a blast playing them with my lady and even on my own.  I play LotR LCG almost exclusively solo, however, but I absolutely love that.  I take pride in my collection and building decks, playing through quests, etc... Feelings I've never had for a computer or video game.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=969390","commentId":969390,"userName":"Mndela","timestamp":1391125563,"content":"If you like pc games and lotr lcg, you can join them in octgn :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nSeriously: i always played in pc games but since i found out lotr-lcg, i left the pc and i returned to the real life with the physical cards (well, sometimes into octgn :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png])\n\nEdited January 30, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=969671","commentId":969671,"userName":"Noccus","timestamp":1391163418,"content":"I've played video games ever since I got the NES in the late 80s. Must have turned 12 years old.\n\nBack then gaming on a console was (at least we're I live) very uncommon. Few kids had one.\n\nAnyway, since then I played a lot through the years. Some games really had me hooked.\n\nSome favorites on the NES:\n\nSnake rattle & roll, life force (salamander), contra 1 (probotector), double dragon 2\n\nSNES was my RPGs discovery time:\n\nFF6 (FF3), chrono trigger, secret of mana, Zelda to name a few.\n\nPC:\n\nBaldurs gate, unreal tournament 99, Diablo 2, Vanilla WoW.\n\nI state these as my reminder of fond memories. You will all have similar ones with your favorite games.\n\nNow I simply do not have the time, or will to play every day. I'm getting older I think.\n\nAs back then I could emerge in a game all day and be happy. Now 1 hour is enough.\n\nOnly a few years ago turned back to card/board games because of my buddy.\n\nDid play MtG a lot in the past, but back then I would choose video games, hands down.\n\nNow I enjoy sitting with my mates around the table with lotr lcg & a beer (or rum) and having a conversation.\n\nToday I would choose card/board games.\n\nSo for me, it's time/age dependant. And this might very well be true for others here too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=974608","commentId":974608,"userName":"VladVoivode","timestamp":1391613948,"content":">  \n> \n> >  \n> > \n> > I can control Glorfindel, who makes the Nazgul soil their robes.\n> > \n> > \n> > \n> >  \n> \n> This is very true.\n> \n> It is also true that the card game can be played indefinitely whereas you never know how long an online game will be available.\n> \n>  \n> \n> As Cunir says, it would be nice with some more continuity in the card game. I haven't played any of the saga expansions so I don't know about boons and burdens, but it sounds promising.\n> \n>  \n\nFirst off, hello all!! I've been an FFG player and lurker for a few years and finally decided to join the online community. There are lots of brilliant people who have unknowingly helped me through some of FFG's more \"arcane\" game rules, so, a pint or three for all!\n\n \n\nTL;DR: There are no guarantees\n\n \n\nThis will at first seem tangential but please bear with me as I believe it is germane to the comment about servers shutting down and you are stuck with something you can no longer play.\n\n \n\nI am a HUGE fan of Runebound. When I moved to Europe I made certain to pack all of the mini-expansions. When my stuff arrived here three weeks later, these mini-expansions were lost by customs. So, I thought, okay, I'll just order them again. I learned that most are OOP and in addition, those still IN print cannot be bought on FFG's store unless I am in North America. So, I tried eBay and Amazon. The prices for the mini-expansions are INSANELY high. Yes, I have all of the big box expansions for Runebound except for Midnight. But here's the thing: all of those great adventure variants are gone, all of the challenges, etc, offered by the mini-expansions. Runebound unfortunately doesn't allow for mixing and matching from one big box to another. So, I either go bankrupt buying the minis again, or I am stuck with just the single scenario in each big box. I have read pleas of the Runebound section of FFG for reprints of these and the silence from FFG is deafening. Essentially, for me, the server has shut down and for any new players to Runbound.\n\n \n\nSo now I finally come to LOTR: LCG (hereafter known as LOTR). I have the base game, Khazad-Dhum, and The Heirs of Numenor. In addition I have the minis Hills of Emyn Muil, Foundations of Stone, Road to Rivendell, and The Steward's Fear. My local gaming shop is plagued and infested by Magic The Gathering and board games are largely ignored. So I face a quandary. Because of limited funds, I can only buy a few minis for LOTR at a time, but, FFG could very well discontinue some of these before I get them, thus, shutting parts of the server.\n\n \n\nThere are no guarantees in board games/card games my friends. I quit physical MTG after - I think - Judgment. Not because the server shut down but because WOTC bans cards, changes rules, etc. It became such a money sink. So I play online in various ways ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]. But how many people have wanted board games that are gone? Mage Knight is skyrocketing in price. Owners of first edition Descent have to either buy the conversion kit, or chuck away Descent for the second edition and of course the three (?) new expansions.\n\n \n\nI love LCG, CCG, and boardgames, but, they are more of a risk. In PC gaming there is GOG and many great games are available again. With physical games, there is a shark after market.\n\n \n\nSo a bit of advice folks: knowing what I do have with LOTR, what would you suggest I go for next in the mini packs?\n\n \n\nThanks!\n\n \n\nBest to all, \n\nVlad"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=974841","commentId":974841,"userName":"Noccus","timestamp":1391626073,"content":"1st, welcome to the community!\n\nMaybe you should consider turning your post into it's own thread?\n\nIt can stand fine on it's own legs as a topic.\n\nJust a idea.\n\nAs for your question, I would not worry to much about lotr lcg dying anytime soon.\n\nI think it has a growing player base, and they also will finish the lots saga expansions no doubt.\n\nAnd with mini's you mean APs, as in adventure packs I take it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=974948","commentId":974948,"userName":"Distractionbeast","timestamp":1391631937,"content":"I take a balanced approach, since I have financial and time constraints as well.  \n\n \n\nI try to pick up the expansions as they come out because they unlock gameplay for the entire upcoming cycle and provide 3 new quests to play through.  After that, I pick and choose which APs I want to pick up, but try to go in chronological order - so I don't run into discontinued products."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98058-what-makes-this-better-than-a-computer-game/?do=findComment&comment=975227","commentId":975227,"userName":"VladVoivode","timestamp":1391651862,"content":"Thanks Noccus and Distractionbeast for your kind replies. \n\n \n\nNoccus, I sometimes tend to get long winded; I'll work on shortening my posts in the future.\n\n \n\nDistractionbeast, What's killing me is that I'm not used to a 21% sales tax. One of the reasons I miss America. So, while the APs may cost 14.95, after shipping from Amazon UK - because FFG for some odd reason doesn't ship to the EU, I get hammered on every product.\n\n \n\nI guess I'll start with the earliest APs first and work forward.\n\n \n\nThanks again and also thanks for the welcome."}]}