{"url":"https://community.fantasyflightgames.com/topic/98099-attacking-with-unexpected-courage/","title":"Attacking with unexpected courage","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/98099-attacking-with-unexpected-courage/?do=findComment&comment=968915","commentId":968915,"userName":"marktarver","timestamp":1391101617,"content":"Apologies if this in threads elsewhere, but as a new player I am still a bit confused.\n\nMy interpretation of the rules for when I have a hero with unexpected courage is as follows:\n\nI have 2 engaged enemies in my attack phase.\n\nI attack enemy 1 with heroA, use UC and can then attack enemy 2 with heroA?\n\nI cannot attack enemy 1 twice?\n\nThis follows because the rules only allow me to declare an attack once against a single enemy when engaged with me.\n\n...........\n\nI have a ranged hero, they attack an enemy 1 engaged with other player. Because they are not engaged with me, I can ready them with UC and attack the same enemy again with the same character?\n\n..........................\n\nI cannot attack the same enemy twice no matter what if they are engaged, unless using a card to trigger an attack and it is not a normal player declared attack?\n\n..........................\n\nDunhere with UC, I attack an enemy in staging area, ready him with UC and can attack thee same enemy again because he is no engaged with me and I am still using the same hero that made the first attack?\n\n......................\n\nLove the game, but working out the minutiae of the rules is taking ages!\n\nThanks in advance for your help"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98099-attacking-with-unexpected-courage/?do=findComment&comment=968935","commentId":968935,"userName":"alogos","timestamp":1391102415,"content":"You got it right. 2 attacks on different enemy, not twice the same.\n\n \n\nRanged character can only participate once, so you cannot have a same hero counting twice his attack on a single attack (not clear in your exemple).\n\n \n\nYou can have your HeroA attack an enemy engaged with other player as your normal \"only once\" attack declaration, and he can participate any number of times in attack declared by other players.\n\n \n\nCards that declare character as attacker don't use your \"only once\" attack declaration.\n\n \n\nDunhere cannot attack twice the same enemy, he use a standard \"only once\" attack declaration from you. His capacity don't allow participation on attack on enemy not engaged with you nor offer additionnal attack declaration."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98099-attacking-with-unexpected-courage/?do=findComment&comment=969383","commentId":969383,"userName":"Mndela","timestamp":1391124872,"content":"You can attack the same enemy, but in diferent phases. For example, using Hans upon the Bow in quest phase and after (if the attacker is ready), by normal attack in combat phase.\n\n \n\nThe restriction that no more than 1 attack is in the same phase (like combat phase).\n\nEdited January 31, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98099-attacking-with-unexpected-courage/?do=findComment&comment=969394","commentId":969394,"userName":"alogos","timestamp":1391126128,"content":"Hum. pretty sure you can hands uppon the bow / quick strike / do a normal attack in the same combat phase, nothing wrong with that."}]}