{"url":"https://community.fantasyflightgames.com/topic/98143-adding-surge/","title":"Adding Surge","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969517","commentId":969517,"userName":"Khamul The Easterling","timestamp":1391141826,"content":"Anytime I come across a treachery that doesn't do an effect I have it surge even if it doesn't say to.  Exceptions include things like masters malice if I have a mono sphere deck.  I usually don't let a card surge if I used some real good planning to avoid a treachery, but if its just like \"remove all progress from quest\" and there is nothing on it, then I always surge those kinds of cards on my own.  I just feel like I'm getting away with a real easy encounter phase otherwise.  I feel like something bad should happen during the encounter phase. \n\n \n\nDo you guys do this?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969540","commentId":969540,"userName":"booored","timestamp":1391144363,"content":"Your comments seams to show you do not think this is the official rules, and it is not. Unless it says something like \"card name gains surge\"\n\nExample.\n\nmed_driven-by-shadow-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_driven-by-shadow-core.jpg]\n\nAnd no I do not play this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969551","commentId":969551,"userName":"Khamul The Easterling","timestamp":1391145197,"content":"I know darn well it's not the official rules.  Sometimes the official rules have problems.  There are very few cards in Core/Mirkwood cycle that don't make you surge if nothing happens.  So in a solo game, more often that you might think, you will flip a treachery that does nothing.  Well you basically just skipped the encounter staging phase.  I don't think that should happen.  The newer expansions are addressing this problem.  You really never see it any more.  \n\nEdited January 31, 2014 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969567","commentId":969567,"userName":"booored","timestamp":1391146806,"content":"This is not a bad thing in my view. In fact I think it is a good thing.\n\nEvery single card being a bad draw is what drives a lot of people away form this game, having reprieves or a easy turn adds variety and texture to the game. You can not have highs with out lows. In truth I think there should be more beneficial cards in the encounter deck. Not to make it easier, though we have nightmare to compensate for this now, but to give the decks more of a questing feeling.\n\nAlso the problem you are talking about (not that I think it is a problem but I see your point) is something that only happens when playing solo, as in real solo not 2 handed or w/e some other people play. The chance of pulling a completely dead draw of 2,3 or 4 treachery cards is practically no existent, so those dead turns just do not happen, all they in are is turns that are less hard and as I said I think this is a important part of the game to give it texture."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969609","commentId":969609,"userName":"joezim007","timestamp":1391152034,"content":"I think he's mostly saying that he enjoys a bit of a challenge, and when playing solo and drawing a treachery that does nothing, it's pretty boring (unless you were really hoping for it because you weren't able to otherwise quest successfully)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969614","commentId":969614,"userName":"booored","timestamp":1391152293,"content":"yeah, I know what he is saying, your post is basically what I said above...\n\nThough I think that variance in the difficulty of the questing is important to the design.. not a detriment. It is not about being easier.. it is about giving spikes and pits in the difficulty that translates as a interesting variety of chances. Getting a \"phew\" turn is just as much a variance as getting a \"omg\" turn.\n\nThough I do recognise that in solo play this can lead to dude draws, witch doesn't happen in multiplayer.. then again I also think this is a 2 player game that CAN be played solo and 3/4.. subtle but a real difference. So this \"problem\" is not a problem in the game design, per say.\n\nEdited January 31, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969753","commentId":969753,"userName":"servant of the secret fire","timestamp":1391173170,"content":"I must a agree with booored on this.Also i think is more in the feeling of the books.Wen i first raid the books one time you are relaxed wen Tolkien describes the lands and how the Hobbits have a party etc and suddenly in the next line a Nazgul appears and s...t happens.\n\n \n\nI want to keep that feeling in my games too.I want to have my relax moments and the 'oh wtf moments'.\n\n \n\n A very good example are some games i had with Anduin river.A  round past just with a troll in the staging area and a treachery card with no effect.And at the next round wen i thought that things going well for my fellowship i said ok i ll commit only Eowyn for the quest cause only the troll is in the staging area.Staging phase was a nightmare.First card was eastern crows(surge) next one an other eastern crows next one wolf rider (surge) and the final card was the brown lands.Yeap as you can imagine i wasn't ready for the troll my threat went over 30 and it was game over for me.\n\n \n\nBut this is my personal taste.If you feel that you want more challenge or you want always be in danger nobody stops you for playing like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969794","commentId":969794,"userName":"Spurries","timestamp":1391176501,"content":"If you notice how the nightmare decks and more recent quests have been, the current designers are going this way(pretty much all of the Black Riders treacheries have Surge), treachery cards without surge are removed from nightmare decks.  Certainly makes the game harder, but no I don't do it haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=969806","commentId":969806,"userName":"servant of the secret fire","timestamp":1391177184,"content":"> If you notice how the nightmare decks and more recent quests have been, the current designers are going this way(pretty much all of the Black Riders treacheries have Surge), treachery cards without surge are removed from nightmare decks.  Certainly makes the game harder, but no I don't do it haha.\n\nBecause i just restarted the game after 2.5 years and i have only the core set and 2 AP's what do you mean?All treachery cards have surge or they are all like driven in the shadow(like if treachery doesn't have an effect then the card gains surge)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=970006","commentId":970006,"userName":"leptokurt","timestamp":1391188217,"content":"I asked Pippin and he's ok with having no encounter. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=970236","commentId":970236,"userName":"camacazio","timestamp":1391196970,"content":"I love it when I get a free turn, a do-nothing treachery is the best when things get heated. I take every chance I can get to avoid surge. It also makes test of will better, by putting it under \"when revealed\" instead of surge as a keyword to begin with. Surge is the worst."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=972894","commentId":972894,"userName":"Fippin","timestamp":1391458634,"content":"Khamul, I admire your masochism, but I think those little respites are necessary in order to (at least have a chance to) win. Thematically I think it works out well too. As servant of the secret fire indicated, having those moments of peace between horrific challenges is very Tolkien. I only surge when it says so, and I in no way feel guilty or cheated!\n\nI bet you love the nightmare decks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=972899","commentId":972899,"userName":"born to lose","timestamp":1391458845,"content":"> Anytime I come across a treachery that doesn't do an effect I have it surge even if it doesn't say to.  Exceptions include things like masters malice if I have a mono sphere deck.  I usually don't let a card surge if I used some real good planning to avoid a treachery, but if its just like \"remove all progress from quest\" and there is nothing on it, then I always surge those kinds of cards on my own.  I just feel like I'm getting away with a real easy encounter phase otherwise.  I feel like something bad should happen during the encounter phase. \n> \n>  \n> \n> Do you guys do this?\n\n \n\nKhamul,\n\n \n\nHave you played Heirs of Numenor?  I'm just happy when the encounter deck doesn't discard my entire freaking hand or make me toss all my resources out lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98143-adding-surge/?do=findComment&comment=973513","commentId":973513,"userName":"Mndela","timestamp":1391523062,"content":"When Masters Malice does nothing effect because we have monosphere, i remember the happy times of core, when 1 or 2 empty treacheries are revealed in the setup. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}