{"url":"https://community.fantasyflightgames.com/topic/98181-action-during-combat-phase/","title":"Action during combat phase","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/98181-action-during-combat-phase/?do=findComment&comment=969947","commentId":969947,"userName":"la1cajun","timestamp":1391186261,"content":"Question, while im playing, im a newer player, I have the book opened to end where the phases and steps are all color coded and such. In combat phase it says after shadow card is dealt, then there is an action window. During the resolution of combat there are no action windows until after all combat is resolves then there is an action window there. SO basically there is an action window after shadow card deals and then after resolution of combat. If you read in the book on page 19 it says following the 4 steps of combat resolution actions can be taken after each step. So Im a little confused. Can someone tell me exactly what the ruling is for playing actions during the combat \"phase\". Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98181-action-during-combat-phase/?do=findComment&comment=970119","commentId":970119,"userName":"Thanatopsis","timestamp":1391192434,"content":"I find it easier to explain when actions cannot be played.\n\n \n\nOnce the Combat Phase begins, you cannot play an action until all shadow cards are dealt.\n\n- Now you could have thought ahead and played that action during the encounter phase\n\n- However, this is an example of why Feint is played only after shadow cards are dealt.  Feint is a Combat Action and could not have been played in the encounter phase, so you must wait for the Shadow cards to be dealt first.\n\n \n\nDuring each discrete step of the combat phase (defending and attacking) actions cannot be taken\n\nHere is a silly example:\n\nStep 1: choose an enemy\n\n- no player may play an action while you are choosing which enemy to defend.  Of course it takes all of 1 second for you to say \"I choose the Witch King!\" ... so it's not really an issue.  I suppose you could chastise your friend for interrupting you while you were speaking if they try to break this rule :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nHere is a better example:\n\n4) Determine Combat Damage\n\n- this step requires you to determine damage,  apply it, and then remove the character from play if required. \n\n- since it's all one step, you can't use a healing action to save a character part way through.  This is where responses come in.\n\n \n\nIn reality, each step of the combat phase is nearly instantaneous.  Even then, the strategy aspects of this game often cause us to informally do steps out of order.  (I always add up attack strength before declaring an attack).  This is why most(?) players just consider the combat phase to be one big action free-for-all.\n\n \n\n \n\n \n\nI thought this was worth throwing in:\n\nOften actions will have restrictions that are not in bold. For instance Behind Strong Walls has the following text:\n\n\"Action: Ready a defending Gondor character. That character gets +1 [Defense] until the end of the phase\"\n\n \n\nIn order for a defender to be targeted (and then readied), you must first 1. choose an enemy, and then 2. declare a defender.  At this point you can play the card. It could be played between steps 2 and 3 or between steps 3 and 4.  However, once a defense is resolved, the character is not longer defending (so you can't play the card after step 4).  From a strategic point of view, I would play it after shadow card resolution just in case the shadow effect ruins your plans (kills the character, etc).\n\nEdited January 31, 2014 by Thanatopsis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98181-action-during-combat-phase/?do=findComment&comment=970220","commentId":970220,"userName":"la1cajun","timestamp":1391196269,"content":"Thats exactly how Ive been doing it. After shadow cards are dealt you can play an action if needed. Then once declaring defenders and combat mitigation actually starts i let it fully resolve till combat is over. Then play action if needed at end of phase. Its like that in the last page of the rule book as well. But my buddy is coming over tomorrow and were gonna go coop for first time so I was looking at book and came across the \"steps of combat\" on page 19 and it says just before that that actions can be taken after each step.\n\n \n\n\"When resolving enemy attacks, the players follow these \n\n4 steps, in order. Players may play event cards and take \nactions at the end of each step.\n1. Choose an enemy. The first player chooses which \nattack (among the enemies to which he is engaged) to \nresolve first.\n2. Declare defender. A character must exhaust to \nbe declared as a defender. Only one character can \nbe declared as a defender against each attacking \nenemy. A player also has the option to let an attack go \nundefended, and declare no defenders for that attack. \nUnless a card effect specifies otherwise, players can \nonly declare defenders against enemies with whom \nthey are engaged.\n3. Resolve shadow effect. The active player flips that \nenemy’s shadow card faceup and resolves any shadow \neffect that card might have.\n4. Determine combat damage. \"\n \nThats from the rule book but its different in the back of the book on the quick flow. It makes more sense doing it the way you said. Anyway, now you can see why i was confused..lol..\n \nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98181-action-during-combat-phase/?do=findComment&comment=970252","commentId":970252,"userName":"Thanatopsis","timestamp":1391198117,"content":"Actually, I'm going to argue that the Turn Sequence in the back of the rulebook and the combat phase sequence on page 19 are in phase with each other.  Page 19 provides clarification.  Essentially stating that when executing each of the 4 steps as discrete moments in time, you can't interrupt them.  However, you can play actions between steps.  Since those steps are usually of such short duration, many of us just play actions freely any time during the combat phase.\n\n \n\nCombats Phase\ndeal shadow cards\nACTIONS\ndeclare enemy\nACTIONS\ndeclare defender\nACTIONS\nreveal and resolve shadow cards\nACTIONS\nresolve defense\nACTIONS\n\n \n\nthis all falls under the green highlight \"First player resolves attacks made by enemies against him. (See page 18.)\" in the back of the rule book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98181-action-during-combat-phase/?do=findComment&comment=970363","commentId":970363,"userName":"la1cajun","timestamp":1391205320,"content":"I just saw something at very top of chart Thana, \n\n \n\n\"This chart provides a detailed structure of the phases \n\nand steps involved in play. Items presented in red are \nknown as framework events, as they are mandatory \noccurences dictated by the structure of the game. \nAction windows in which players are free to take \nactions are presented in green.\n• Red – Players cannot interrupt with actions. \n Responses can be played if their conditions are met.\n• Green – Any player can take actions generally, or \nbetween the game steps stated in the rules.\"\n \nAnd the whole combat sequence after the shadow card is dealt is in green. So your right. The way the book has the actual word \"ACTION\" makes it appear its an action window where you can perform these and only then but i just didnt see the very top area. Anyway, thanks alot for the input. For the most part I got the structure pretty well that im running through without looking too much at the sequence page, learn something everyday though!\n "}]}