{"url":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/","title":"First 2 player game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=971632","commentId":971632,"userName":"la1cajun","timestamp":1391325691,"content":"All I can say is wow. My buddy and me played the coop with lore and tactics decks from core set. We decided on the passage through mirkwood, we thought it would be a breeze since I've beaten it with 3 of the 4 decks so far. That thing kicked out butts. I don't know if it was just bad card draws with lots of high level creatures and location after location or what but man, I gotta say I feel kinda bad. Seemed like we couldn't get ahead on the threat. Anyway, were both fairly new to game, it was good but just can't believe we got it handed to us..lol. So far I'm 1/4 with lore, 1/4 with spirit, and 2/2 with leadership on solo play. I hadn't played the tactics yet. I'm open to any suggestions being how it was our first coop series. Anyway, thanks guys!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=971664","commentId":971664,"userName":"booored","timestamp":1391332268,"content":"what you need to realize is that you are basically playing a single deck.. not 2 different decks.\n\nWhen you make a deck you make it so synergies and combos occur though out it. This exact method needs to be used for co-op deck creation. The \"hands\" as I call the individual decks form a single \"deck\" that two people play and just like building any single hand deck you need keep the focus of a co-op deck.\n\nSome things to consider...\n\nThe ONLY cards that need to be in a individual hand are allies. Attachments and Events can be inside either hand and played to help the other hand. The prime and most obvious example of this is that steward of gondor can be in a deck, but the leadership resources can be generated in Hand A, even though the target for steward is a hero in Hand B.. maybe a spirit hero. There is no need to build Hand B to have a way to cast leadership resources or have steward in it at all. Heroes are also like this. Heroes are the most powerful part of a deck, so if you can get heroes that complement each other rather than just being resource matches (common in solo decks) you can make very powerful combos like Brand become super duper powerful as an example. Also remember to look at things like sentential and ranged keywords a solo player soon forget about.\n\nAnother common thing is for different hands to focus on different aspects of the game. Questing, Support in one hand and Combat in another. It is a little more complex than that but often you will be using optional engagement in conjunction with threat levels to move all combat to a single side. One of the upshots of this is that the quest / support hand (Lore / Spirit) has a lot of ranges and sentinel.\n\nMy guess is that you just picked up two solo decks and went at in. In most cases if a deck is a good solo deck it is not a good co-op hand. Most people believe that the game is generally easier 2 handed and I would agree with that, as you add hands up to four it just gets easier and easier. There is of course some quest exceptions but in general this is true. The misconception that it is harder is usually form a basic lack of understanding about how co-op decks need to be designed using BOTH hands in mind."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=971691","commentId":971691,"userName":"EclatK","timestamp":1391337126,"content":"Well, the basic deck are pretty bad, so no wonder if you are not able to deal with the senario in two player. You should try mixing tac/leadership to deal with the combat and one other deck with lore/spirit to deal with the quest and support.The fact is that, in multiplayer, there is generaly more than 1oppenent card per player dealt each turn. So it is usualy more difficult to beat some senario in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972015","commentId":972015,"userName":"la1cajun","timestamp":1391376585,"content":"That all makes sense. Still unbelievable in 3 games we couldn't beat a level 1 scenario. But your right, you have to deal 1 card per player to staging area. A couple of things occurred as well:\n\n1) sentinel : the player with sentinel can send it over during the other players defense step to block for player being attacked by creature?\n\n2) player that has a card that says \"all enemies engaged with player cannot attack this phase\" can cast it on other players defense step when he's being attacked? If so, if he waits for shadow cards to be dealt, then plays the action and the enemy can't attack, does the shadow card just go to discard and not get played\n\n3) it's defense stage and player being attacked plays a card that allows him to have an extra character defending. How is damage mitigated with 2 characters defending? I know you can't normally defend with 2 but this was a special card that let him do it.\n\n4) shadow card is dealt, player declares defender whom upon declaring as a defender does 2 direct damage to engaged enemy and kills it before any resolution of shadow card or damage to character. Does the shadow card just go in discard and no damage mitigated to character?\n\nThanks guys. Just a couple of things I ran into in my first coop game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972042","commentId":972042,"userName":"Olorin93","timestamp":1391377825,"content":"1) Yes, characters with the Sentinel keyword can defend on behalf of any other character and take all the damage.\n\n \n\n2) What card is this? If it is an event card, it would probably be played before any shadow cards are dealt.\n\n \n\n3) What card is this? Only one character at a time can defend against a single attack; there is no way to divide damage between different characters, unless specified by a card text.\n\n \n\n4) If the enemy receives two damage as soon as the character is declared as a defender, then I wouldn't say that the shadow card was even dealt."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972070","commentId":972070,"userName":"CJMatos","timestamp":1391379989,"content":"3) He is talking about http://hallofbeorn.com/Cards/Details/51223bd0-ffd1-11df-a976-0801200c9038 [http://hallofbeorn.com/Cards/Details/51223bd0-ffd1-11df-a976-0801200c9038]. In this case you add the total value of defense of all defending characters.\n\n \n\nThen, if the attacker gives damage (attack higher than defense), you assign all damage to one of the defenders.\n\n \n\nIf that one dies and there are more damage to assign you give it to the other, and successively till there are no more damage...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972071","commentId":972071,"userName":"iznax","timestamp":1391380036,"content":"2) is Thicket of Spears and yes u got it right\n\n \n\n3) is Stand Together and you are right to ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nand 4) Shadow cards are delt BEFORE declaring any defenders and yes if you kill the enemy before the shadow card \"open\" it gets descarded\n\n \n\nP.S. sry for my english, H.F."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972100","commentId":972100,"userName":"booored","timestamp":1391382855,"content":"> That all makes sense. Still unbelievable in 3 games we couldn't beat a level 1 scenario.\n\nFFG difficulty ratings are completely meaningless. Mirkwood is not a \"1\" for example. Just ignore them.. they must randomly pick them or somthign.. cause they are completely wrong almost every time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972143","commentId":972143,"userName":"la1cajun","timestamp":1391389779,"content":"Thanks guys. I thought we were those cards right. Well, back to the drawing board. As far as solo I was playing each deck builtin core set 1 at a time to get used to the cards and see where weaknesses and strong points were. Then I'm gonna break them up and construct a deck and see what happens. My buddy did like the game such he bought his own core set too so he will be able to construct a deck too. Thanks for all the help guys. I'm getting Gollum as soon as it reprints."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972373","commentId":972373,"userName":"Olorin93","timestamp":1391424881,"content":"> and 4) Shadow cards are delt BEFORE declaring any defenders and yes if you kill the enemy before the shadow card \"open\" it gets descarded\n> \n> \n> \n>  \n\nReally? I need to re-read the rules!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972380","commentId":972380,"userName":"booored","timestamp":1391425721,"content":"shadow cards resolve as part of the attack, there is even an action window after they are revealed but before the attacks occur. At any time if the attacker is destroyed before the attach the shadow card is discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98299-first-2-player-game/?do=findComment&comment=972519","commentId":972519,"userName":"la1cajun","timestamp":1391439085,"content":"At the beginning of the combat phase, the players deal \n\n1 shadow card to each engaged enemy. Deal the top \ncard of the encounter deck, face down, to each engaged \nenemy. When dealing cards to a single player’s \nenemies, always deal to the enemy with the highest \nengagement cost first. Cards should first be dealt to the \nenemies attacking the first player, and then proceed \naround the board until all enemies have 1 card.\nIf the encounter deck runs out of cards, any enemies \nthat have not been dealt shadow cards are not dealt \nshadow cards this round. An empty encounter deck \nonly resets during the quest phase (see page 14).\nWhen resolving enemy attacks, the players follow these \n4 steps, in order. Players may play event cards and take \nactions at the end of each step.\n1. Choose an enemy. The first player chooses which \nattack (among the enemies to which he is engaged) to \nresolve first.\n2. Declare defender. A character must exhaust to \nbe declared as a defender. Only one character can \nbe declared as a defender against each attacking \nenemy. A player also has the option to let an attack go \nundefended, and declare no defenders for that attack. \nUnless a card effect specifies otherwise, players can \nonly declare defenders against enemies with whom \nthey are engaged.\n3. Resolve shadow effect. The active player flips that \nenemy’s shadow card faceup and resolves any shadow \neffect that card might have.\n4. Determine combat damage. This is done by \nsubtracting the defense strength (Ú) of the defending \ncharacter from the attack strength (Û) of the attacking \nenemy. The remaining value is the amount of damage \nthat must immediately be dealt to the defending \ncharacter, possibly destroying that character (see \n“Hit Points and Damage,” page 20). If a character \nis destroyed by an attack, additional damage is not \nassigned to another character. If the Ú is equal to or \nhigher than the Û, no damage is dealt.\nIf an attack is undefended, all damage from the \nattack must be assigned to a single hero controlled \nby the active player. Allies cannot take damage from \nundefended attacks. If a defending character leaves \nplay or is removed from combat before damage is \nassigned, the attack is considered undefended. A \ncharacter’s Ú does not absorb damage from undefended \nattacks or from card effects.\n \nHere are the rules strait from book for you on shadow cards and actions and such for intital combat phase"}]}