{"url":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/","title":"Time X - problem with the phrasing or intentional?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973325","commentId":973325,"userName":"Nerdmeister","timestamp":1391497983,"content":"time-x.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-voice-of-isengard/time-x.png]\n\n \n\nAs written this would mean that if a card with the Time X keyword is merely added to the staging area (without being revealed) it would not be gaining any tokens.\n\nDo you guys think this is an oversight?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973332","commentId":973332,"userName":"booored","timestamp":1391499045,"content":"To put simply, keyword have nothing to do with \"when revealed\"\n\nkeywords like time X, surge, doom occur separately and BEFORE when revealed effects trigger. This is why Test of Will can stop when revealed, but not surge as an example.\n\nSo the card is drawn. Time X triggers and it goes into the staging area. \"Revealing\" a card form the encounter deck is NOT the same as a \"when revealed effect\" they in fact occur at different time windows.\n\nEdited February 4, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973338","commentId":973338,"userName":"Nerdmeister","timestamp":1391500827,"content":"-----------------------------------------\n\n(1.01) Encounter Keywords\n\nSurge, Doomed, and Guarded keywords should be\n\nresolved any time the card on which they occur is\n\nrevealed from the encounter deck, including during\n\nsetup.\n\n---------------------------------------------\n\nThey trigger when revealed and not when merely added, as I am reading this.\n\nThey might occur before the \"when revealed\" effect but not in the absence of being revealed.\n\nEdited February 4, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973348","commentId":973348,"userName":"booored","timestamp":1391502604,"content":"exactly... revealed is NOT \"when revealed\" they are separate time windows. \"Revealing\".. or \"drawing\" occurs before anything else as soon as the card is drawn.\n\nIt even says in the images of the rules you linked.. \"when a card with time x is revealed\".. meaning \"drawn\". It is placed in the staging area and gioved X tokens.. when they run out.. THEN the trigger effects occur .. Keywords like Time X and Surge etc.. are NOT trigger effects.\n\nEdited February 4, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973352","commentId":973352,"userName":"Nerdmeister","timestamp":1391502969,"content":"Quote please that says revealed keywords happen in the absence of the phrase \"when revealed\".\n\n \n\nBecause right now it is just looking as if you are making assumptions based on what you think it should be like."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973353","commentId":973353,"userName":"booored","timestamp":1391503026,"content":"w/e play wrong if you like.. but that is how it is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973361","commentId":973361,"userName":"Nerdmeister","timestamp":1391504115,"content":"> w/e play wrong if you like.. but that is how it is.\n\nNot really what I asked for.\n\nSeems like you are under the impression that you cannot be wrong and don´t need sources for your arguments.\n\n \n\nI have said that I am open to input if you have them. Just saying \"because I said it...\" isn´t an argument though.\n\n \n\nDidn´t want to go there but if you insist on being arrogant, it seems in good order to remind you that, you can be wrong and that humility might serve you better from time to time.\n\n \n\nhttp://www.cardgamedb.com/forums/index.php?/topic/7022-aragorn-theodred/ [http://www.cardgamedb.com/forums/index.php?/topic/7022-aragorn-theodred/]\n\n \n\nAlso my original post hasn´t been answered yet, as far as I´m concerned so if anyone has some constructive input, I´m still very much interested.\n\nEdited February 4, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973363","commentId":973363,"userName":"booored","timestamp":1391504268,"content":"**** humility. I'm right and I know it. Learn or discard my help.. I do not care. I'll let other people come in and confirm it.\n\nIn the mean time I would look into Elenor's Ability, Test of Will and Thalin.. might help you a bit.\n\nEdited February 4, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973373","commentId":973373,"userName":"Nerdmeister","timestamp":1391506290,"content":"One can show humility and still be right. Just as one can show assertiveness and conviction, yet still be wrong.\n\n \n\nI don´t know if this part has somehow eluded you, but you do realize that there are encounter cards with text along the lines of:\n\n\"search the encounter deck and discard pile for (card X) and add it to the staging area\" and of course related phrasing\n\n\"search the encounter deck and discard pile for (card X) reveal and add it to the staging area\"\n\n \n\nWhich is a pretty big difference when a keyword only applies, when a card is revealed.\n\nI am sure you knew this though as this is exactly what the original question is all about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973383","commentId":973383,"userName":"booored","timestamp":1391507745,"content":"Sigh.... exactly.\n\nReveal is a game state (sort of) that occurs when you draw from the encounter deck, witch in turn starts a sequence which is the card resolution. Cards can be popped into the staging area and bypass the \"reveal\" window (nowadays) if there is card text that instructs this is so.. much the same as you can \"put into play\" and \"play\" cards though trigger effects. A \"reveled\" card is just another way of saying it is \"drawn\" or to be more accurate, saying \"start the card resolution on this card\". This resolution includes Keywords (timeX, DoomX, SurgeX etc) and THEN in a totally separate part of the resolution... the \"when reveled\" triggers.. witch are separate.\n\nSo.. in the case of TimeX.\n\n1) You draw the encounter card\n\n2) This is a card in a \"reveled\" state.. so we start the card resolution.\n\n3) We resolve triggers, in this case Time X.\n\n4) As it says in the text in the image...\n\ntime-x.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-voice-of-isengard/time-x.png]\n\n5) So the card is placed in the staging area.\n\n6) You place the counters on it\n\n7) you remove counters as instructed.\n\n8) you run out of counters\n\n9) The TimeX keyword has finished its resolution.\n\n10) The rest of the card resolves, just as if it was drawn that turn and had no timeX.\n\nSo.. if you drew a TimeX card that has \"Doom 1. Surge, TimeX\" the doom and surge would trigger, then the time X would, then the rest of the card.\n\nThis is all possible because \"reveal\" and \"when revealed\" are different states."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973402","commentId":973402,"userName":"Nerdmeister","timestamp":1391510032,"content":"All of it correct, as far as I can tell.\n\n \n\nThough the issue of what happens if you pull the card out of the discard pile and merely add it to the staging (the effect that pulls it from it´s out-of-play state does not say to reveal the card prior to adding it) area by a card effect is what the issue is all about.\n\n \n\nThe \"when revealed\" state isn´t a part of the original question. The occurrence of whether the card is being revealed in and of itself is what is of interest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973417","commentId":973417,"userName":"booored","timestamp":1391512677,"content":"> Though the issue of what happens if you pull the card out of the discard pile and merely add it to the staging (the effect that pulls it from it´s out-of-play state does not say to reveal the card prior to adding it) area by a card effect is what the issue is all about.\n> \n>  \n> \n> The \"when revealed\" state isn´t a part of the original question. The occurrence of whether the card is being revealed in and of itself is what is of interest.\n\nWell, it is part of the question.\n\nWhat you are talking about is a different key-phrase called \"Enters the staging area\".. this is a catch all phrase that includes BOTH \"add it to the staging area\" and \"reveal and add it to the staging area\".\n\nTime X occurs during a \"reveal\" NOT when it \"enters\" so it would only trigger during a reveal, as we chatted about b4. The rules are super clear on this. Keywords like surge, doom etc.. only resolve when \"revealed\", which as we know is not the same as \"when revealed\"\n\nSo... what dose this mean?\n\nIt means if you draw a time X card to the staging area though \"add it to the staging area\".. then TimeX will NOT trigger at all. The \"reveal\" rules we have gone over explain why.\n\nNow we go into theory as if I am not mistaken there hasn't been any timeX encounter cards spoiled? Only TimeX on quest cards.. that do not have any of this stuff...so... hmmm ...\n\nBut.. depending on the wording of the \"Zero counter\" trigger.. it may fizzle OR it will resolve instantly. As in this case, as we know form when the \"reveled\" rules, time X doesn't trigger... BUT TimeX just handled the counter control, there is a forced effect (we know from spoiled quest cards) that occurs as a separate effect, and \"forced\" is a effect that occurs regardless of the \"reveal\" state... SO... as I said ... depending on the wording of the forced effect the card will fizzle or go off, instantly.\n\nEdited February 4, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973428","commentId":973428,"userName":"Nerdmeister","timestamp":1391513763,"content":"> It means if you draw a time X card to the staging area though \"add it to the staging area\".. then TimeX will NOT trigger at all. The \"reveal\" rules we have gone over explain why.\n> \n> Now we go into theory as if I am not mistaken there hasn't been any timeX encounter cards spoiled? Only TimeX on quest cards.. that do not have any of this stuff...so... hmmm ...\n> \n> \n> \n>  \n\n \n\nWell it seems we are actually in agreement (and might have been from the start depending on misunderstandings) that Time X will not trigger under certain circumstances. Though the path has been less than straight.\n\n \n\nBut to add to the issue, there has been spoiled an encounter card with Time X keyword. And it was this card that triggered my curiosity on the subject:\n\nravens-guardian.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-ringmaker/cards/ravens-guardian.png]\n\n \n\nThis card says to trigger it´s effect after the last counter is removed from it.\n\nThus the issue arises, if none where placed on the card to begin with (because it was added by some other effect) and it seems to loose alot of it´s bite.\n\nIf the type of phrasing used on this card occurs on more cards, is it then the intention that if you add those cards (without reveal) that they be ignored completely like the other keywords.\n\nBringing me back to the original question: is it a problem with the phrasing or is it intentional?\n\nEdited February 4, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973430","commentId":973430,"userName":"booored","timestamp":1391513859,"content":"it fizzles, as you say.. there is no counter getting removed as none is placed, so this returns a null value for the trigger. It would have to say something like \"forced: If there are no counters on....\" or something like that to go off. Just as for TimeX to trigger it would need to go off on \"enter\" instead of \"reveal\".\n\n \n\n\n\n> Though the path has been less than straight.\n\nI enjoy talking game mechanisms\n\nEdited February 5, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973666","commentId":973666,"userName":"GrandSpleen","timestamp":1391532208,"content":"> keywords like time X, surge, doom occur separately and BEFORE when revealed effects trigger. This is why Test of Will can stop when revealed, but not surge as an example.\n\n \n\nI was under the impression that it was the other way around: 'when revealed' resolves before 'surge' or 'doomed' etc.  So you would reveal the card, resolve any 'when revealed' effects (or cancel with AToW), then add the card to the staging area and trigger 'surge' or 'doomed.'\n\n \n\nBy the way, this whole thread has been a big weird test of wills in which you both agreed in a funny sort of way (Nerdmeister's original post summarized in one line what the rest of the thread expounded upon), but failed to address the original question!  \"Do you think this is an oversight?\"\n\n \n\nMy guess? Probably not an oversight.  They probably do not want us to come up with a fancy way of resetting \"Time X\" counters by bouncing cards back into the staging area, so the 'reveal' text is crucial."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973798","commentId":973798,"userName":"wlk","timestamp":1391539445,"content":"> I was under the impression that it was the other way around: 'when revealed' resolves before 'surge' or 'doomed' etc.  So you would reveal the card, resolve any 'when revealed' effects (or cancel with AToW), then add the card to the staging area and trigger 'surge' or 'doomed.'\n\n \n\nfrom Alogos' unofficial FAQ [https://community.fantasyflightgames.com/index.php?/topic/92338-unofficial-faq-compilation-of-answer-from-around-the-web/]:\n\n> Q: Surge is distinctly said to take effect after the when revealed effect. But nothing is said about other keywords. I think I once saw a clarification that keywords are passives or rules text, something like that, that enables them to take effect before when revealed effect, but it may be my imagination. How do we resolve the order of keywords? Simply by order of appearance or something like it's a passive text rule or perhaps, like surge, should it trigger after?\n> A: FAQ item 1.37 addresses the order of resolution for effects. Passive abilities (such as keywords) come first. Surge is a special case because the rules for the keyword indicate that the extra card should be revealed after the card with surge. With regard to Star in Sky, the players would first resolve the Prowl 2 and then resolve the When Revealed effect.\n> \n>  \n\n \n\nNote that the underworld keyword is also an exception: \"the Underworld keyword trigger when location enters play, not when it is revealed.\"\n\nEdited February 4, 2014 by wlk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=973876","commentId":973876,"userName":"Mndela","timestamp":1391543332,"content":"Ok, but surge is not exception, because it simply says: \"after the card is revealed...\". If the card with surge not reaches to be revealed (for example, with Thalin, etc) it doesnt trigger the keyword surge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974048","commentId":974048,"userName":"GrandSpleen","timestamp":1391553482,"content":"So let me see if I have this right... if you have a card that said something like: \"Prowl 2. Doomed 1.  Surge.  When Revealed: discard all characters in play.\"\n\n \n\nYou would do this:\n\n \n\n1. Discard 2 resources.\n\n2. Raise threat by 1.\n\n3. Resolve the 'when revealed effect' by discarding all characters in play.\n\n4. Reveal another card per Surge.\n\n5. Ask \"what was the point of that, since I just discarded all my characters\" and ragequit.\n\n \n\nIn other words, all keywords except Surge are resolved before the When Revealed text?  And player emotions are reserved until the end of the staging step."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974349","commentId":974349,"userName":"booored","timestamp":1391581145,"content":"Yeah that is correct (minus the rage quit! hehe), but surge also happens before when revealed.. it just pulls the card into the staging area, where it waits for the full resolution of the original surge card before you start the resolution on the new card. This subtle difference can change the way the staging area fills based on how you draw.. but most of the time it won't.\n\n@wlk\n\nI would be very wary about using unofficial FAQs... they often have bad information and are slow to update. The LoTR rules is really starting to come together and it is pretty clear in most cases now. Especially with a active forum to ask.\n\nEdited February 5, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974411","commentId":974411,"userName":"alogos","timestamp":1391592227,"content":"Well, if you see any bad information, please report it to me or on my thread. I carefully put all url where I found the answer so it can be tracked to the original question/response thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974412","commentId":974412,"userName":"Nerdmeister","timestamp":1391592402,"content":"I´m still feeling undecided as to whether it was intentional.\n\nOn one hand the design team has been getting really good at wording effects and cards in an unambiguous way, that also benefits the intentions behind the designs (the way I see it anyway)\n\nOn the other hand it just seems a bit weird that the Raven´s Guardian example, which is intended as a cyclical problem, to be potentially rendered completely ineffective. The solution to this specific card could be a wording like \"when there are 0 time counters on Raven´s Guardian put 4 time counters on it\". Indeed the only \"oversight\" (if indeed there is one) might be connected to the Raven´s Guardian text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974418","commentId":974418,"userName":"booored","timestamp":1391593310,"content":"It is defiantly intentional. There is a provision in the rules to force TimeX to always trigger... all they had to do was have the TimeX definition say \"enters\" instead of \"revealed\". There is no way this is a mistake, as there is no ambiguity in this interpretation, imo. Having TimeX not trigger is no stranger than not having guarded trigger in HFG after you use Banks of the Anduin or Surge and doom not triggering.\n\nI guess the real proof is that TimeX is a reveled keyword like Doom and surge and all that and none of them trigger on enter either.. So if it was a mistake, then it was breaking the established patterns of the game design.\n\nIt is interesting to note that the \"reveal to staging area\" and \"add it to the staging area\" never used to be separated, nor was there a definition of \"enter\". Keywords like Surge, DoomX and Guarded originally always triggered any time, as anything entering the staging area was revealed. This is why the wording is so lame, using practically the same names, as it used to be the same. It was separated in a FAQ sometime in Darowdelf if I remember right.\n\n \n\n\n\n> Well, if you see any bad information, please report it to me or on my thread. I carefully put all url where I found the answer so it can be tracked to the original question/response thread.\n\nWell I guess there is no reason not to expect the uFAQ to have evolved as much as the official FAQ. It was just when the game first started there was 3 completely separate uFAQs and they would make rulings on stuff that the forums were still discussing and FFG had not ruled on. Having 3 locations with conflicting information was just a mess and made more confusion than it stopped. I just thought the entire thing was a total mess. I should probably take another look at it before making such comments I guess.\n\nEdited February 5, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974778","commentId":974778,"userName":"GrandSpleen","timestamp":1391622668,"content":"> I´m still feeling undecided as to whether it was intentional.\n> \n>  \n\n \n\nIt would just be too easy to use A Light in the Dark, or Spirit Pippin, or an Ithilien Archer to reset an enemy's time counter if it was \"adds to\" or \"enters\" the staging area.  And there are plentiful ways of returning the active location to the staging area as well.  I guess they could have written that Time counters are placed when a card \"enters play,\" but certainly if they had written \"enters the staging area\" or \"is added to the staging area,\" the whole Time system would be a joke."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974799","commentId":974799,"userName":"wlk","timestamp":1391624187,"content":"> Ok, but surge is not exception, because it simply says: \"after the card is revealed...\". If the card with surge not reaches to be revealed (for example, with Thalin, etc) it doesnt trigger the keyword surge.\n\n \n\nTrue, Indeed.\n\nMy point was that keywords are confusing because they are handled in different ways:\n\n- some are trigger \"when revealed\", but before \"when revealed\" effects\n\n- some are trigger \"when revealed\", but after \"when revealed\" effects\n\n- some are trigger when entering play (so don't require to be \"revealed\")\n\nIt's easy to misplay them. I used to trigger \"Undergworld X\" only \"when revealed\" until I checked precisely after reading this thread.\n\nUsusally not a big deal, but I like to play by the book :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98441-time-x-problem-with-the-phrasing-or-intentional/?do=findComment&comment=974802","commentId":974802,"userName":"wlk","timestamp":1391624325,"content":"> I would be very wary about using unofficial FAQs... they often have bad information and are slow to update. The LoTR rules is really starting to come together and it is pretty clear in most cases now. Especially with a active forum to ask.\n\n \n\nWell in this particular case, the UFAQ point to the official FAQ, so there's not much doubt :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}