{"url":"https://community.fantasyflightgames.com/topic/98788-removing-quest-stages-siege-of-cair-andros/","title":"Removing quest stages - Siege of Cair Andros","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/98788-removing-quest-stages-siege-of-cair-andros/?do=findComment&comment=978515","commentId":978515,"userName":"Chris51261","timestamp":1391890151,"content":"So I was playing through the Siege of Cair Andros and I had just advanced to stage 4A, having removed the banks and the approach by questing. My quick question is: if I were to fully explore the citadel, would I remove 4A, even though it was my current quest? Or does it have to be removed prior to advancing? Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98788-removing-quest-stages-siege-of-cair-andros/?do=findComment&comment=978690","commentId":978690,"userName":"alogos","timestamp":1391900806,"content":"Nothing says to not remove it while it's the current quest, so remove it as soon as the location is explored."},{"commentUrl":"https://community.fantasyflightgames.com/topic/98788-removing-quest-stages-siege-of-cair-andros/?do=findComment&comment=980105","commentId":980105,"userName":"Nerdmeister","timestamp":1392021326,"content":"I would argue that you do not remove it if you explore the location while you are at quest stage 4.\n\nThe Citadel says that after you explore it to \"remove stage 4 from the quest deck, if able\".\n\nI would say though that while stage 4 is the current stage of the quest it is no longer in the quest deck, which seems to suggest an out-of-play area.\n\n \n\nFor a comparable example I would like to use Fili/Kili which says that when you play one of them, you can search your deck for the other to put into play. And in this instance it has been ruled that if the card you want to put into play is not in your deck (but in your hand or discard pile) then you cannot trigger this ability.\n\nEdited February 10, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98788-removing-quest-stages-siege-of-cair-andros/?do=findComment&comment=980133","commentId":980133,"userName":"alogos","timestamp":1392024379,"content":"Didn't though the first card was different... and it is not.\n\nFrom rulebook :\n\n>  \n> \n>  \n> \n> 6. Set Quest Cards\n> Arrange the quest cards in sequential order, based off\n> the numbers on the back of each card. Stage 1A should\n> be on top, with the numbers increasing in sequence\n> moving down the stack. Place the quest deck near the\n> encounter deck, in the center of the play area.\n\nEdited February 10, 2014 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/98788-removing-quest-stages-siege-of-cair-andros/?do=findComment&comment=980139","commentId":980139,"userName":"Nerdmeister","timestamp":1392025949,"content":"Hmm right you are. As current quest seems to still be part of the quest deck, then your initial assessment that it be removed upon exploring the citadel should be correct."}]}