{"url":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/","title":"Ered Nimrais","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=982882","commentId":982882,"userName":"Mndela","timestamp":1392229119,"content":"His text is the next one:\n\nResponse: After Ered Nimrais Prospector enters play, discard the top 3 cards of your deck. Then, choose and shuffle 1 card from your discard pile back into your deck.\n \n\nA little question: if you dont have cards in your deck, can you anyway choose 1 card from you discard pile and put into your deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=982920","commentId":982920,"userName":"GrandSpleen","timestamp":1392230639,"content":"I would say \"no.\"  Because the card says \"Then,\" the first part must resolve or the second part won't happen at all.  If you can't discard the full 3 cards to resolve the first part, I think the second part can't happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983171","commentId":983171,"userName":"booored","timestamp":1392243738,"content":"Yes you can resolve the THEN text if the first part fizzles.\n\n \n\n\"Then\" is not the start of a conditional statement. If you had to do both it would read... \"blah blah blah and shuffle 1 card\". You see example of this all through out this game. \"Then\" is basically saying \"after that part of the card resolves (or fizzles) do this\"\n\n \n\nTake this card for example... from core\n\n * If there are no locations in the staging area, nothing get +1Threat... but you still resolve the 35+ part, right?\n\nmed_treacherous-fog-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_treacherous-fog-core.jpg]\n\n \n\nHere is a modern card though that ALSO uses THEN in a way that resolves regardless of the beginning of the text..\n\n * If you have no engaged goblins, you still add the +1 will to any already in the staging area, right?\n\nmed_chaos-in-the-cavern-ohauh.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_chaos-in-the-cavern-ohauh.jpg]\n\n \n\nThis card on the other hand uses a self reference in the second statement. So in this case \"then\" can not resolves as the start fizzled. So there are exceptions to this.\n\n * If you are not able to select an ally you can not discard it.. right?\n\nmed_a-knife-in-the-back-tsf.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_a-knife-in-the-back-tsf.jpg]\n\n \n\nSo in my mind this is pretty clear... THEN is not condition, but it can be self referential. In most cases you resolve \"then\" separately, independently of the other parts of the card resolution.\n\nEdited February 12, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983185","commentId":983185,"userName":"CJMatos","timestamp":1392244383,"content":"From FAQ:\n\n \n\n(1.15) The word “then”\nIf a card effect uses the word “then,” then the preceding\neffect must resolve successfully for the subsequent\ndependent effect to resolve.\n \n \nSo first part must be successfully to do the second...\nEdited February 12, 2014 by CJMatos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983192","commentId":983192,"userName":"booored","timestamp":1392244735,"content":"That is ******* retarded.\n\n \n\nWhat is the point of writing the cards in English if your not going to use English language rules and then force everyone to learn FAQs,, when they could just write it in ******* correct English in the first place.\n\nEdited February 12, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983258","commentId":983258,"userName":"Mndela","timestamp":1392248485,"content":"A Knife in the Back: so if the random chosen ally has no attack (neither doesn't damage any hero)...., the ally is not discarded?\n\n \n\nffg_a-knife-in-the-back-tsf.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_a-knife-in-the-back-tsf.jpg]\n\nEdited February 12, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983318","commentId":983318,"userName":"GrandSpleen","timestamp":1392253357,"content":"You would still have to discard the ally.  In that case, X still has a value: the value is zero.  The effect is fully resolved, and 0 damage is dealt as a result.  Then discard. \n\n \n\nTake that, Imladris Stargazer!\n\nEdited February 13, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983431","commentId":983431,"userName":"Thanatopsis","timestamp":1392261141,"content":"i think we may be over thinking this a bit.  I'll look into it further, but here's what I'm thinking\n\n \n\n\"Each location in the staging area gets +1 Threat\" \n\nI look at this as a passive effect that is applied to the staging area.  Even if there are no locations, you still apply the the +1 Threat to the staging area effect. The \"then\" effect then takes effect.  \n\nIf the effect was to choose a location in the staging area to receive +1 Threat, then there is a specific target.  If there are no locations, the effect fizzles and the the \"then\" effect does not occur.\n\n \n\nWhere i'm going with this is that CJMatos and Booored are both correct.  That is Booored's assessment fits within the context of the FaQ clarification."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983442","commentId":983442,"userName":"booored","timestamp":1392261935,"content":"med_treacherous-fog-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_treacherous-fog-core.jpg]\n\n \n\n \n\nWell I agree with you, but the FAQ is very clear.... if there are NO locations then the effect fails, and the second part after the \"THEN\" dose not resolve.\n\n \n\n>  \n> \n> From FAQ:\n> \n>  \n> \n> (1.15) The word “then”\n> If a card effect uses the word “then,” then the preceding\n> effect must resolve successfully for the subsequent\n> dependent effect to resolve.\n>  \n>  \n> So first part must be successfully to do the second...\n> \n>  \n\n \n\n \n\nIf the 1st part doesn't resolve.. then the next part doesn't either.. this is clear as day in the FAQ.. It is absolutely ridiculous.. but it is not disputable.\n\n \n\n \n\n> A Knife in the Back: so if the random chosen ally has no attack (neither doesn't damage any hero)...., the ally is not discarded?\n> \n>  \n> \n> med_a-knife-in-the-back-tsf.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_a-knife-in-the-back-tsf.jpg]\n\n \n\nX is always == to ZERO is there is no value to fill it. So as Spleen said.. it would be 0 dmg then discard. The effect fully fizzles if there is no ally at all to target.\n\nEdited February 13, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983472","commentId":983472,"userName":"GrandSpleen","timestamp":1392264266,"content":"I think in cards like Treacherous Fog and Chaos in the Cavern, the Then clause will still resolve even if the first part of the card does nothing.  It's in the wording of the card.\n\n \n\n\"Each location gets +1 threat.\"  OK, so +1 threat to 0 locations.  No problem.  That is successful effect resolution, so per the wording of the FAQ, the Then clause can go ahead and resolve as well.\n\n \n\n\"Return all goblins to the staging area.\"   OK, move 0 goblins.  No problem, done and resolved.\n\n \n\nBut!  If the card said \"Choose a location.  That location gets +1 threat.\"  Or \"Move 1 goblin back to the staging area.\"  Effects worded in that way would \"fail\" and the Then clause would not be able to resolve.  The wording in that case requires you to do something specific.\n\n \n\n(oh, and minor clarification -- it's true that X is zero if there is no value to fill it.  But in the case of A Knife in the Back, there IS a value to fill that X as long as there is an ally on the table.  But maybe that value is \"0\" anyway, since many allies have 0 attack power).\n\nEdited February 13, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983482","commentId":983482,"userName":"booored","timestamp":1392265098,"content":"> I think in cards like Treacherous Fog and Chaos in the Cavern, the Then clause will still resolve even if the first part of the card does nothing.  It's in the wording of the card.\n> \n>  \n> \n> \"Each location gets +1 threat.\"  OK, so +1 threat to 0 locations.  No problem.  That is successful effect resolution, so per the wording of the FAQ, the Then clause can go ahead and resolve as well.\n> \n>  \n> \n> \"Return all goblins to the staging area.\"   OK, move 0 goblins.  No problem, done and resolved.\n> \n>  \n> \n> But!  If the card said \"Choose a location.  That location gets +1 threat.\"  Or \"Move 1 goblin back to the staging area.\"  Effects worded in that way would \"fail\" and the Then clause would not be able to resolve.  The wording in that case requires you to do something specific.\n\n \n\nyour ******* confusing me.. this is exactly what I was saying at the start and everyone told me it was wrong?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983555","commentId":983555,"userName":"GrandSpleen","timestamp":1392274307,"content":"I just finished writing a really long answer, and **** am I long-winded, ugh... so here is the short version: It is true that \"then\" clauses don't resolve if the first part of the card doesn't resolve.\n\n \n\nBut does \"then\" resolve if the first part of the card is PARTIALLY resolved?  I dunno.  My thoughts are expanded below...\n\n-------------------------------------------------------------------\n\n \n\nsorry if I wasn't clear...  At first we were talking about \"then,\" and that's when CJ quoted the FAQ.  Now I'm talking about whether or not the first part of the card is considered to be \"resolved\" if the effect isn't fully resolved.  The more I think about it, the more I am inclined to answer Mndela's original question as \"yes.\"\n\n \n\nwhat I'm trying to say is:\n\n \n\nAn effect can be resolved successfully and have no impact on the game state.  You can deal 0 damage, or add 0 threat, and still successfully have resolved an effect.\n\n \n\nBut some cards direct you to do something specific: discard 3 cards, or deal 2 damage, or whatever.  If you can't do that, maybe the effect doesn't resolve successfully.\n\n \n\nSo here are examples of text that (I think) could do NOTHING, and then you would still be able to resolve a subsequent \"Then\" clause:\n\n \n\n-Search the encounter deck.  Add any enemies found to the staging area. Then, xxx...\n\n-Discard all attachments.  Then, xxx...\n\n-Give all players each taco in your refrigerator.  Then, xxx...\n\n-Search your sock drawer for any number of black socks, and put all progress tokens inside them.  Then, xxx...\n\n-Draw all copies of the Ace of Spades from your deck.  Then, xxx...\n\n \n\nIn all of those fake examples (did you know they were fake?!),  I used non-specific language: \"all, any, each.\"  Those concepts include \"0.\"  So you can resolve the effect even if you don't have any tacos, or black socks... you get the point.\n\n \n\nBut a card like Ered Nimrais Prospector uses specific language:  discard 3 cards.  If you can't do that, the effect isn't fully resolved, and the \"then\" clause wouldn't activate.  Still, I could be wrong, because there is this thing in the FAQ:\n\n \n\n\"Q: If I can’t discard 3 resources from all of my heroes\n\ndue to Bitter Wind (KD 56), do I have to partially fulfill\nthe effect?\nA: Yes, players should resolve as much of any\n“discard” effect as they are able to.\"\n\n \n\nSo if you play Ered Nimrais Prospector, you can partially fulfill the effect by discarding 1 or 2 cards. Or even 0, I guess.  But does that count as \"successful resolution\" and allow the \"Then\" part to activate?  The more I type about this, the more I think \"yes it does\" (contrary to my original answer).  But I'm not sure... thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=983634","commentId":983634,"userName":"Mndela","timestamp":1392283789,"content":"I think one thing is \"then\" inside a phrase, and other diferent thin is \"then\" just after a \".\"\n\n \n\nffg_lost-companion-hon.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_lost-companion-hon.jpg]\n\n \n\nThis card is useless if only one player didn't quest any characters (if only one player cant resolve the first part). And we play other way: if any player has not characters commited finally, our total and final quest is 0."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=984228","commentId":984228,"userName":"Noccus","timestamp":1392319343,"content":"Errr, I'm not too sure about this one.\n\nGrandSpleen here brings up some good points, yet it would make the game very confusing indeed.\n\nMy guess, (and I know I played it wrongly with the treachery cards showed as examples) is that the FAQ rule quoted by CJMatos earlier should be followed. In that case, GrandSpleen his first reaction was correct.\n\nThe answer is \"no\" I think, and this will make some treachery cards far less dangerous.\n\nI'm not yet sure if I like this....can I call for a ruling again? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited February 13, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=984450","commentId":984450,"userName":"booored","timestamp":1392331454,"content":"I have a official rule request in... this faq rule completely guts many treacheries. The \"returns 0\" as still a successful resolution is a possible solution but clunky, I'll keep it in mind as I play I am sure this will cause its own set of problems on other cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=984851","commentId":984851,"userName":"Noccus","timestamp":1392367577,"content":"True indeed. I wonder if it's maybe only for player cards?\n\nBut that would not make much sense now would it.\n\nThanks for requesting a ruling yet again booored.\n\nReally curious about the reply now...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=985606","commentId":985606,"userName":"booored","timestamp":1392426729,"content":"You provided two interesting examples, and I'm glad you did because they highlight the difference between immediate effects and lasting effects.\n \nImmediate effects are effects that are fully resolved as soon as they are triggered, whereas lasting effects affect the game state for a specified amount of time. Because they always say something like \"until the end of the phase\" or \"until the end of the round\" lasting effects are easy to identify.\n \nLet me use your examples to demonstrate:\n \nChaos in the Cavern : has an immediate effect (return all enemies to the staging area) that if it triggers creates a lasting effect (each Goblin gets +1 threat strength until the end of the phase). If there are no enemies engaged with players at the time Chaos is revealed, then it cannot trigger because no enemies are returned to the staging area. That means the \"then\" clause will not trigger and Goblins will not get +1 threat strength.\n \nTreacherous Fog : works the opposite way. It creates a lasting effect (locations in the staging area gets +1 threat strength) that triggers an immediate effect (players with 35+ threat must discard 1 card). Since this lasting effect affect the game state, it will always resolve. Even if there are no locations in the staging area at the time Treacherous Fog is revealed, locations will still get +1 threat strength until the end of the phase. That means if a location is added to the staging area after Treacherous Fog is revealed, it will get +1 threat until the end of the phase. Because the lasting effect of Treacherous Fog always resolves, it also means the \"then\" clause will also always resolve.\n \nSo, if there are no locations when Treacherous Fog is revealed, it still resolves because it has successfully created a lasting effect. However, if there are no enemies engaged with players at the time Chaos in the Cavern is revealed, it cannot resolve its immediate effect and you should not resolve the \"then\" effect.\n \nCheers,\nCaleb\n \n\n\n----------------------------------------\n\n\n\nThe FAQ says...\n \n\n(1.15) The word “then” If a card effect uses the word “then,” then the preceding effect must resolve successfully for the subsequent dependent effect to resolve.\n\n\nSo, this is new to me.. dose this now mean that effects also do not trigger if the then fails?\n\nTreacherous Fog\nWhen Revealed: Each location in the staging area gets +1 Threat Strength until the end of the phase. Then, each player with a threat of 35 or higher chooses and discards 1 card from his hand.\n\nChaos in the Cavern\nWhen Revealed: All engaged enemies return to the staging area. Then, each Goblin enemy gets +1 [Threat] until the end of the phase.\n\nThese two, and many like it... if the first fails... dose the 2nd part not happen? Like with the Fog, if you have no locations in the staging area... is that a fail? With Chaos is there are no goblins engaged.. dose that fail?,,, and with those failing.. the part after the \"THEN\" also fails right? This can not be right!... right?\n\nHidden Threat, Sleeping Sentry, Ill Purpose, slick footing,. .. etc etc etc.. many cards have effects that can fizzle.. these can not all have the text after the then fail as well right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=985691","commentId":985691,"userName":"GrandSpleen","timestamp":1392436490,"content":"that is by far the longest official response I've ever seen\n\n \n\nand I'm kind of reeling after having read it... right now I do not feel like, having read that, I can go and read a new card and correctly determine whether or not the \"then\" clause should resolve if the first part of the card did nothing.  And that is not a place I like to be..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=985793","commentId":985793,"userName":"Noccus","timestamp":1392458998,"content":"> that is by far the longest official response I've ever seen\n> \n>  \n> \n> and I'm kind of reeling after having read it... right now I do not feel like, having read that, I can go and read a new card and correctly determine whether or not the \"then\" clause should resolve if the first part of the card did nothing.  And that is not a place I like to be...\n\nThis nailed it.\n\nI understand the answer, yet it is very easy to make mistakes. I don't like it.\n\nGonna think a bit on it, if I'm just going to resolve the whole thing on treachery cards like I always did, or not.\n\nIn any case, this should be in fat print in the FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=985925","commentId":985925,"userName":"Mndela","timestamp":1392475619,"content":"How must we undertand this card?:\n\n \n\nffg_fatigue-tld.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_fatigue-tld.jpg]\n\n \n\nWhen first part ends 'if able'? If one player can't exhaust a character, the 2nd part of the treachery doesn't trigger?\n\nEdited February 15, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=985931","commentId":985931,"userName":"Mndela","timestamp":1392476136,"content":"The Spider's Web (Mirkwood Nighmare): When Revealed: The player with the highest threat exhaust all heroes he controls. Then, attach this card to one of that player's heroes...\n\n...if i have all my heroes exhausted (for example, commited), i mustn't attach that nasty card to anybody, isn't? Nice!!! (for example, if you see it is coming by Denethor, i will exhaust all my heroes before it is revealed)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=987658","commentId":987658,"userName":"leptokurt","timestamp":1392670163,"content":"> I think in cards like Treacherous Fog and Chaos in the Cavern, the Then clause will still resolve even if the first part of the card does nothing.  It's in the wording of the card.\n> \n>  \n> \n> \"Each location gets +1 threat.\"  OK, so +1 threat to 0 locations.  No problem.  That is successful effect resolution, so per the wording of the FAQ, the Then clause can go ahead and resolve as well.\n> \n>  \n> \n> \"Return all goblins to the staging area.\"   OK, move 0 goblins.  No problem, done and resolved.\n> \n>  \n> \n> But!  If the card said \"Choose a location.  That location gets +1 threat.\"  Or \"Move 1 goblin back to the staging area.\"  Effects worded in that way would \"fail\" and the Then clause would not be able to resolve.  The wording in that case requires you to do something specific.\n> \n>  \n> \n> (oh, and minor clarification -- it's true that X is zero if there is no value to fill it.  But in the case of A Knife in the Back, there IS a value to fill that X as long as there is an ally on the table.  But maybe that value is \"0\" anyway, since many allies have 0 attack power).\n\nI think this sums it up pretty well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=987833","commentId":987833,"userName":"booored","timestamp":1392680357,"content":"except we got the official word (posted a few steps back) that completely trashes this explanation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=988176","commentId":988176,"userName":"leptokurt","timestamp":1392723584,"content":"> except we got the official word (posted a few steps back) that completely trashes this explanation.\n\nDoes it? It just explains why one effect fails and the other one doesn't. \"Choose something\" is concrete, or immediate, that's why it fails when thee is nothing to choose from. \"Each location gets..\" is general, or lasting, that's why it doesn't fail."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99121-ered-nimrais/?do=findComment&comment=988180","commentId":988180,"userName":"booored","timestamp":1392724067,"content":"You read it wrong. Part of the quote you posted was\n\n \n\n\"Return all goblins to the staging area.\"   OK, move 0 goblins.  No problem, done and resolved.\n\n \n\nThis is exactly the example of what he says produces a fail.. not a resolved."}]}