{"url":"https://community.fantasyflightgames.com/topic/99226-hidden-cache-discard-question/","title":"Hidden Cache / Discard Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/99226-hidden-cache-discard-question/?do=findComment&comment=984532","commentId":984532,"userName":"iGaveHimLife","timestamp":1392336282,"content":"Are all cards placed in the discard pile considered to be discarded? Like dose using the action on Hidden Cache as a normal event trigger its response?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99226-hidden-cache-discard-question/?do=findComment&comment=984547","commentId":984547,"userName":"Bullroarer Took","timestamp":1392337708,"content":"If I understand you, playing an event is not the same as discarding the event."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99226-hidden-cache-discard-question/?do=findComment&comment=984565","commentId":984565,"userName":"booored","timestamp":1392338884,"content":"RTFC! - The combo doesn't work.. it says right on the card \"discard form your deck\" so it needs to be discarded directly from the draw deck to the discard pile.\n\n \n\nAs for the other more interesting question...\n\n \n\nThere is no \"proof\" either way. The fact that the \"discard pile\" is called the discard pile you can think of ANY card in it for ANY reason as discarded... I mean it IS in the discard pile.. so the cards are discarded when in the discard pile, right? ....\n\n \n\nThe problem here is that in MTG and a number of other popular games discard is a term that is defined.\n\n \n\nMany cards say things like \"discard from hand\" or \"Discard from play\" etc etc as a way of defining the location the cards are discarded from.. but again, this doesn't mean that the movement to the discard pile regardless of location is a \"discard\" act. This is why the cache says \"Discarded form your Deck\", but again... this could be just to stop protector or ewoyn triggering it from your hand\n\n \n\nSo to put it plainly.. there is no proof either way as far as I know.\n\nEdited February 14, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99226-hidden-cache-discard-question/?do=findComment&comment=984752","commentId":984752,"userName":"GrandSpleen","timestamp":1392353733,"content":"It would be awful to have to keep track of which cards in the discard pile were \"destroyed\" vs. \"discarded\" or whatever else could land them in your discard pile... so I'm going to just call them all \"discarded.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/99226-hidden-cache-discard-question/?do=findComment&comment=984755","commentId":984755,"userName":"booored","timestamp":1392354088,"content":"yeah, I play that any card moving into the discard pile for any reason is \"discarded\" and would satisfy any effect requiring a \"discard condition\". It is kinda convoluted, and really they should have used a different word for the discard pile. Still I think that the naming of the location it is discarded form should remove most problems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99226-hidden-cache-discard-question/?do=findComment&comment=986783","commentId":986783,"userName":"leptokurt","timestamp":1392582290,"content":"When you're lying on the graveyard does it really matter what got you there? YOU'RE DEAD*!!!!! D - E - A - D : dead\n\n \n\n \n\n* except if you've got a second copy of Bill the Pony. The he'll come back. But not from the grave, shockingly."}]}