{"url":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/","title":"SPOILERS!!!  Voice of Isengard Player Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984504","commentId":984504,"userName":"Glowwyrm","timestamp":1392334412,"content":"Copied from a Board Game Geek post.  The OP translated the not yet revealed cards from German.\n\nThe original post can be found here: http://boardgamegeek.com/thread/1122602/why-is-there-no-spoiler-list-yet [http://boardgamegeek.com/thread/1122602/why-is-there-no-spoiler-list-yet]\n\nHeroes\nEomer (lazy, see image gallery)\nGrima (lazy, see image gallery)\n\nLeadership\nOrthanc Guard (ally, cost 2, 1w0a2d2h, untaps after increasing threat from doomed)\nLegacy of Numenor (event, cost 0, doomed 3, add 1 ressource to every hero)\n\nSpirit\nWestfold Horse Breeder (ally, cost 1, 1w0a0d1h, after comes into play, search top 10 cards of deck for mount attachment, put in hand, shuffle. says action, should probably be reaction)\nSilver Lamp (attach, cost 2, attach to spirit hero, while attached hero is untapped, your engaged enemies get their shadow cards face up(!))\nPower of Orthanc (event, cost 0, doomed 2, every player may select and discard a condition attachment in play(!))\n\nLore\nMessenger from Isengart (ally, cost 2, 1w0a1d2h, gets +1w until EOT after increasing threat from doomed, limit 2x per turn)\nDeep Knowledge (event, cost 0, doomed 2, every player draws 2 cards)\n\nTactics\nWestfold Outrider (Vanguard? idunno) (ally, cost 2, 0w2a1d2h action discard to engage an enemy not engaged with you)\nRohan Warhorse (attach, cost 1 attach to rohan or tactics hero, restricted, tap to untap attached hero after a killing attack\nVoice of the Wizard (event, cost 0, doomed 3, each player chooses 1 engaged enemy, until end of phase each enemy won't attack the player that selected it)\n\nNeutral\nSaruman (lazy, see image gallery)\nOrthanc key (attach, cost 1, attach to hero, after increasing threat from doomed, tap key to give attached hero a ressource. Edit: unique. No keychain of Orthanc for joo, Grima.)\nSeeing Stone (event, cost 0, doomed 1, search your deck for a card with doomed keyword and add to hand, reshuffle deck)\n\ntl,dr: OMG new anti-shadow tech. OMFG new anti-condition tech.\nOnly 2 (edit: 3) benefit-from-doomed cards for now, but the doomed cards themselves seem universally pretty strong. And free, seems its largely a \"pay threat instead of ressources\" thing. Most are also affects-all-players stuff, so the fact that doomed is technically worse with more players is self-regulating"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984516","commentId":984516,"userName":"Raven1015","timestamp":1392334972,"content":"Give me that Silver Lamp!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984525","commentId":984525,"userName":"Tracker1","timestamp":1392335864,"content":"> Give me that Silver Lamp!\n\nSmall Target with a hobbit deck just got way better. But having 2 enemies engaged probably means things are not going that well.\n\nPower of Orthanc, really nice to see another way to remove a condition outside of lore.\n\nDoomed keyword looks like it can get out of hand. Here come Aragorn lore and Grima decks, i feel bad for the others guys at the table. Mono tactics is going to be hurting, since it can only rely on threat reduction from Gandalf and what other players can provide. Solo play is no problem though. Aragorn lore and Spirit are the solution.\n\nWould be cool to see tactics get an attachment that lowers threat after destroying an enemy.\n\nEdited February 14, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984542","commentId":984542,"userName":"Bullroarer Took","timestamp":1392337429,"content":"Is there a window to take advantage of seeing the Shadow cards face up?  Presumably you can't deal them to the enemy you want knowing what they are.  (Or can you?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984548","commentId":984548,"userName":"Tracker1","timestamp":1392337833,"content":"> Is there a window to take advantage of seeing the Shadow cards face up? Presumably you can't deal them to the enemy you want knowing what they are. (Or can you?)\n\nNot sure i am interpreting the question completely, but shadow cards are dealt to enemies with the highest engagement cost and then to the next, and next etc. I guess you just go in order, and if 2 enemies have the same cost, decide which enemy the shadow card is going to and place it face up after you have decided, so you do not know what the shadow is before placing it down. No peeking.\n\nEdited February 14, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984579","commentId":984579,"userName":"Raven1015","timestamp":1392339576,"content":"No, unfortunately you can't choose which enemy gets which shadow. You could use cards like Dawn Take You All or Rider of the Mark to get rid of them strategically though. Main reason I want it though is just that it gives you total knowledge for your defensive decisions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984592","commentId":984592,"userName":"Pharmboys2013","timestamp":1392340728,"content":"Really like westfold horse breeder, will tie together some nice things.  Seeing stone is going to be OP as well.  Doomed decks in single player where the consequences arent as severe will have the capacity to be really strong"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984670","commentId":984670,"userName":"Karlson","timestamp":1392346051,"content":"Very interesting to see those titles and actions, and I can't wait to see the artwork. However, I'm a bit confused; I thought there were going to be three heroes in this expansion?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984672","commentId":984672,"userName":"Pharmboys2013","timestamp":1392346440,"content":"> Very interesting to see those titles and actions, and I can't wait to see the artwork. However, I'm a bit confused; I thought there were going to be three heroes in this expansion?\n\nWhere did you get that impression? Not trying to be critical, just curious. I haven't seen that anywhere"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984674","commentId":984674,"userName":"Karlson","timestamp":1392346677,"content":"I'm not sure why I had that impression, but I guess it was a false preconception. Maybe it was that mystery character who appeared on the VoI web page and quickly removed, remember?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984689","commentId":984689,"userName":"Downer","timestamp":1392348077,"content":"Of the non-previously spoiled:\n\n \n\nWestfold Horse Breeder - seems like an auto-include, in my opinion. It quests for one and can chump block if necessary, so it's includeable on that basis alone, grabbing a mount puts it over the top though.\n\n \n\nSilver Lamp - Good card, I don't know why they gave it to Spirit, which really limits it. Tactics really needs a card like this (and would be very thematic in them being, you know, tactical... more so than being spirited making you suddenly a master combatant). In most sphere's it'd be an include, but in a Sphere with Hasty Stroke and less of a means to act on that information, I'm not sure if it'll make the cut.\n\n \n\nPower of Orthanc - Conditionally the strongest Doomed card. *Sigh* so spirit has the best Shadow-cancellation, Treachery-cancellation, and Condition-cancellation? Great card that you won't always play, but I'd keep it in any deck with Spirit because it's basically always worth it if you need it.\n\n \n\nVoice of the Wizard - I'd say the second best Doomed card. While drawing cards or gaining resource is nice, gaining actions is really good. Also, I'd say that while there might be times where you need cards, or there might be times where you need resources, you almost always can do something with when you free up a blocker, and I think it's a much more universal position. You naturally gain resources and cards, but you naturally lose board position. This helps address that. \n\n \n\nSeeing Stone - Is your fourth of a Doomed card, or your second or third of a  Doomed card for a toolbox if it can get either Voice of the Wizard or Power or Orthanc. If it can only get one of Legacy of Numenor or Deep Knowledge, I'd probably just stick with those cards.\n\n \n\nOverall:\n\n \n\nEomer - meh.\n\nGrima - very interesting.\n\n \n\nOrthanc Guard - Very playable. Only major issue is that leadership decks tend to be highly trait oriented, so he's fighting against deck synergy. That said, he's strong enough to be played despite lack of synergy.\n\n \n\nLegacy of Numenor - Good. I wouldn't always play it, mind you. But like most Doomed cards, when it is the right decision to play them, they are worth it.\n\n \n\nMessenger of Isenguard - Meh. Not unplayable, but more of a gap-filler.\n\n \n\nDeep Knowledge - See Legacy of Numenor\n\n \n\nWestfield Outrider - Meh. See Messenger of Isenguard.\n\n \n\nRohan Warhorse - Yes. Very Yes. \n\n \n\nSaruman - Probably the best Doomed card for solo play, probably not worth it for multiplayer as he scales poorly.\n\n \n\nOrthanc Key - Only Grima would probably play that many Doomed cards.\n\n \n\nGeneral Thoughts:\n\n \n\nGrima seems really interesting, and thematically I enjoy the fallen things and broken things, so I'm personally looking forward to him.\n\n \n\nI love me Tactics, and in my opinion Rohan Warhorse finally gives it a power card that they never had. They were always a good supporting cast before, but now they have a wow factor that the other factions have.\n\n \n\nDoomed is a mechanic that I really like, at least in theory and at this point, because I feel like it adds a lot of decision making to cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984696","commentId":984696,"userName":"danpoage","timestamp":1392348725,"content":"Power of Orthanc, in addition to being all-around useful, is quite good for Flies and Spiders from The Hobbit: On The Doorstep. Since poison cards count as \"Condition\" attachments, this could be huge in a multi-player game. It is interesting to see how the changing card pool interacts with past scenarios. I really like that they are using Nightmare Scenarios as a way to adapt old scenarios to the evolving metagame.\n\n \n\nAlso, the warhorse with Háma has the potential to be a game-breaker, especially as new Tactics events are released.\n\nEdited February 14, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984728","commentId":984728,"userName":"Raven1015","timestamp":1392351641,"content":"> Of the non-previously spoiled:\n> \n>  \n> \n> Silver Lamp - Good card, I don't know why they gave it to Spirit, which really limits it. Tactics really needs a card like this (and would be very thematic in them being, you know, tactical... more so than being spirited making you suddenly a master combatant). In most sphere's it'd be an include, but in a Sphere with Hasty Stroke and less of a means to act on that information, I'm not sure if it'll make the cut.\n\n \n\nI see what you're saying, and it's a good point, but since all you need is to have it on an untapped Spirit hero (like Glorfindel), I can see a nice Spirit/Tactics deck that makes use of it. Besides Silver Lamp though, I really love the Rohan Warhorse. That card has some great potential."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984737","commentId":984737,"userName":"Bullroarer Took","timestamp":1392352615,"content":"> > Is there a window to take advantage of seeing the Shadow cards face up? Presumably you can't deal them to the enemy you want knowing what they are. (Or can you?)\n> \n> Not sure i am interpreting the question completely, but shadow cards are dealt to enemies with the highest engagement cost and then to the next, and next etc. I guess you just go in order, and if 2 enemies have the same cost, decide which enemy the shadow card is going to and place it face up after you have decided, so you do not know what the shadow is before placing it down. No peeking.\n\nI was at work earlier and didn't have the rules. That point hasn't been particularly relevant since up until now the shadow cards are all random. Here is the point I was missing (because it didn't matter heretofore): you chose defenders AFTER the shadow cards are dealt. So yeah, the card can be huge. Regarding it being part of Spirit, I guess it fits because Spirit gets everything. Which is to say, give Tactivs some love FFG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984741","commentId":984741,"userName":"Downer","timestamp":1392353147,"content":">  \n> \n> > Of the non-previously spoiled:\n> > \n> >  \n> > \n> > Silver Lamp - Good card, I don't know why they gave it to Spirit, which really limits it. Tactics really needs a card like this (and would be very thematic in them being, you know, tactical... more so than being spirited making you suddenly a master combatant). In most sphere's it'd be an include, but in a Sphere with Hasty Stroke and less of a means to act on that information, I'm not sure if it'll make the cut.\n> \n>  \n> \n> I see what you're saying, and it's a good point, but since all you need is to have it on an untapped Spirit hero (like Glorfindel), I can see a nice Spirit/Tactics deck that makes use of it. Besides Silver Lamp though, I really love the Rohan Warhorse. That card has some great potential.\n> \n>  \n\n \n\nTrue. Don't get me wrong, I think that it's a very good card. I'm more questioning if there is room for this plus Hasty Stroke, and if not which is better. There are cases for both, but I'm leaning toward Hasty Stroke, ever so slightly.\n\n \n\nThat said Glorfindel, yes. Or any other consistent readying effect that occurs before shadow cards are dealt.\n\n \n\nFrodo also works well it, as he is usually the designated blocker. I don't own Conflict at Carrock unfortunately, though this does give me reasons to, especially with the Rohan stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984780","commentId":984780,"userName":"Downer","timestamp":1392357463,"content":">  \n> \n> >  \n> > \n> > > Is there a window to take advantage of seeing the Shadow cards face up? Presumably you can't deal them to the enemy you want knowing what they are. (Or can you?)\n> > \n> > Not sure i am interpreting the question completely, but shadow cards are dealt to enemies with the highest engagement cost and then to the next, and next etc. I guess you just go in order, and if 2 enemies have the same cost, decide which enemy the shadow card is going to and place it face up after you have decided, so you do not know what the shadow is before placing it down. No peeking.\n> \n> I was at work earlier and didn't have the rules. That point hasn't been particularly relevant since up until now the shadow cards are all random. Here is the point I was missing (because it didn't matter heretofore): you chose defenders AFTER the shadow cards are dealt. So yeah, the card can be huge. Regarding it being part of Spirit, I guess it fits because Spirit gets everything. Which is to say, give Tactivs some love FFG.\n> \n>  \n\n \n\nThere is also an action window between dealing shadow cards and declaring defenders.\n\n \n\nYeah, Tactics need some love. I'm trying to think of high-powered cards for Tactics, and really Warhorse is probably it. They are a good Sphere, particularly in multiplayer, but they have the most needs of any Sphere. They feel like they were designed by balancing Spirit, Lore, and Leadership against the Encounter deck, cutting their attack values to the point where it's problematic (Spirit) to slightly problematic, but then gave those factions some power cards and/or synergies to compensate for that, and then lastly took the difference in attack value added whatever mechanics that were left over and called it \"Tactics.\" \n\n \n\n \n\n \n\nChanging the subject, does Grima impact the evaluation for Resourceful in non-secrecy decks? 3 resources and 1 Doom for a recurring non-unique resource. Yes, it's worse than Steward of Gondor, but I think that's a given (just like every free-action attachment will be worse than Unexpected Courage), but:\n\n \n\n1) It's neutral.\n\n \n\n2) Works in multiples and with a Steward of Gondor, \n\n \n\n3) 3 neutral resources is a lot sooner than 4 neutral resources and is situationally less taxing than 2 Leadership resources, and\n\n \n\n4) Played with Grima, it's in a faction with card draw, so it innately has a better chance of being drawn early."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984788","commentId":984788,"userName":"GrandSpleen","timestamp":1392357742,"content":">  \n> \n> Small Target with a hobbit deck just got way better. But having 2 enemies engaged probably means things are not going that well.\n> \n>  \n\n \n\nyes, very excited for this!  I seem to end up with plenty of enemies engaged no matter what deck I play, so I guess I am always in trouble :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nanyway, works great in any deck with Frodo, whether it's hobbit-centric or not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984793","commentId":984793,"userName":"Scroll Lock","timestamp":1392358509,"content":"Must...not...read\n\nFor now I only read the names of cards. Honestly, I expected more cards. But I like that there are 3 neutral cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984797","commentId":984797,"userName":"MyNeighbourTrololo","timestamp":1392359032,"content":"Too bad, Elfhelm does has no sinergy with player card Doomed keyword, could have been a good combo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984799","commentId":984799,"userName":"booored","timestamp":1392359073,"content":"> Yeah, Tactics need some love. I'm trying to think of high-powered cards for Tactics, and really Warhorse is probably it. They are a good Sphere, particularly in multiplayer, but they have the most needs of any Sphere. They feel like they were designed by balancing Spirit, Lore, and Leadership against the Encounter deck, cutting their attack values to the point where it's problematic (Spirit) to slightly problematic, but then gave those factions some power cards and/or synergies to compensate for that, and then lastly took the difference in attack value added whatever mechanics that were left over and called it \"Tactics.\"\n\n \n\nTactics has been weak form day one, it doesn't just need love.. it needs a complete rethinking in how they design it. There is a strong showing for them in multiplayer and this is the rub, they simply do not have tools to allow solo players to use them. All they need to make tactics viable and open a ton of those player cards to solo players is some songs or attachments or something that can add other icons.\n\n \n\nOne of the great problems in this game is the factions are not really divided across theme or tribes or w.e.. they are divided by utility. Now this is all well and good when you have a way to splash effectively, but tactics just do not have it. Maybe when they get a tactic Aragorn it will open all those aragorn attachments to make splashing less of a chore.\n\n \n\nThe idea of split utility is cool, but not when you consider the solo game. Having an entire set of allies and only 2 of them with over 1 will and 6 at 1 and a whopping 12 at 0 and the heroes not much better is just not viable.\n\n \n\nStill this split on utility is causing many of the problems in this game. A deck needs to be able to quest and reduce threat... almost beyond all else and I do not think anyone is going to sit there and say spirit is not nearly a must include at some level for solo decks. Lore has some great cards but most importantly it has the Minstrels allowing efficient splashing of songs and all that card draw that makes those clunky decks function very well.\n\n \n\nAs the game progresses this divide in utility is just going to get bigger and bigger separating the spheres until there are very very very few options for solo. Tactics is the worst so far, leadership not far behind.. in fact the only really immune one is Lore with the card draw and the song search..\n\n \n\nThis needs to be addressed at some point.\n\nEdited February 14, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984849","commentId":984849,"userName":"Noccus","timestamp":1392367174,"content":"Man spirit got some power cards here. More auto includes in this box for spirit!\n\nHonestly, if you guy use spirit, are not over 75% of the cards you use always the same?\n\nKnowledge is power: silver lamp is a game changer. This thing is auto include.\n\nIf not, something is wrong with you. Seriously. Wrong.\n\nI really like the horse breeder. Great utility card.\n\nAnd power of Orthanc is just as it should be, IMO. Great against certain quests, and scales nicely for multiplayer with it's doomed keyword. Well designed card right there. Powerful, but not too much so.\n\nEdited February 14, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=984869","commentId":984869,"userName":"Downer","timestamp":1392370527,"content":">  \n> \n> > Yeah, Tactics need some love. I'm trying to think of high-powered cards for Tactics, and really Warhorse is probably it. They are a good Sphere, particularly in multiplayer, but they have the most needs of any Sphere. They feel like they were designed by balancing Spirit, Lore, and Leadership against the Encounter deck, cutting their attack values to the point where it's problematic (Spirit) to slightly problematic, but then gave those factions some power cards and/or synergies to compensate for that, and then lastly took the difference in attack value added whatever mechanics that were left over and called it \"Tactics.\"\n> \n>  \n> \n> Tactics has been weak form day one, it doesn't just need love.. it needs a complete rethinking in how they design it. There is a strong showing for them in multiplayer and this is the rub, they simply do not have tools to allow solo players to use them. All they need to make tactics viable and open a ton of those player cards to solo players is some songs or attachments or something that can add other icons.\n> \n>  \n> \n> One of the great problems in this game is the factions are not really divided across theme or tribes or w.e.. they are divided by utility. Now this is all well and good when you have a way to splash effectively, but tactics just do not have it. Maybe when they get a tactic Aragorn it will open all those aragorn attachments to make splashing less of a chore.\n> \n>  \n> \n> The idea of split utility is cool, but not when you consider the solo game. Having an entire set of allies and only 2 of them with over 1 will and 6 at 1 and a whopping 12 at 0 and the heroes not much better is just not viable.\n> \n>  \n> \n> Still this split on utility is causing many of the problems in this game. A deck needs to be able to quest and reduce threat... almost beyond all else and I do not think anyone is going to sit there and say spirit is not nearly a must include at some level for solo decks. Lore has some great cards but most importantly it has the Minstrels allowing efficient splashing of songs and all that card draw that makes those clunky decks function very well.\n> \n>  \n> \n> As the game progresses this divide in utility is just going to get bigger and bigger separating the spheres until there are very very very few options for solo. Tactics is the worst so far, leadership not far behind.. in fact the only really immune one is Lore with the card draw and the song search..\n> \n>  \n> \n> This needs to be addressed at some point.\n> \n>  \n\n \n\nWell, Leadership is quite good (better than Lore as a primary Sphere, in my opinion, Lore is the better support sphere though). In fact, I think all the non-Tactics races are reasonably close. Spirit is ahead, but it's not ahead in such a way that invalidates other Spheres, i.e. there are plenty of meaningful things that Lore and Leadership can do better than Spirit, they are also better solo than Spirit.\n\n \n\nWhile at this point it can only be addressed through card balance, I actually think Tactics problems has more to do with the mechanical set-up of the game and where combat is positioned in it. \n\n \n\nWillpower is needed for questing. Questing successfully keeps your threat low. Threat determines when enemies engage you and keeping your threat low reduces enemy engagement. Enemies engaging you less means you can spend more resources questing.\n\n \n\nOn the other hand, lower willpower means failed quests. Failed quests means you increase your threat. Increasing threat means more enemies engage you. More enemies engaging you means fewer resources spent on questing.\n\n \n\nBoth are positive feedback loops, but one is for your deck and the other is for the encounter deck.\n\n \n\nNow, I think this was a thematic decision. You can't just bully your way to victory, you have to go on some quest. However, mechanically this puts combat at a disadvantage and as more of a support role since it's not progress it's simply damage control.\n\n \n\nBut to be honest, balance-wise I don't think it's a problem (solo mono-Tactics is just one out of many iterations). My issue is more that Tactics always feels like generic.dec rather than a unique creation. You just block and attack, which every deck does, but you do slightly better.\n\n \n\nThere Sphere mechanics are so-so, combat tricks are okayish, but many lack punch do to their design. For example, the abilities that allow a single character to attack the staging area are irrelevant because you typically can't solo an enemy and doing multiple attacks is inefficient considering they usually have at least 1 defense. Weapons are generally less useful than similarly costed allies. Also, their traits are either secondary (despite Theoden and Boromir, Rohan and Gondor are more Spirit and Leadership) or bad (Eagles). \n\n \n\nThey didn't make out too bad in Heirs. Much better than the Dwarf dominated Khaz and their embarrassing Eagle nonsense in Mirkwood. Dunland Trap doesn't seem especially good, but Voices gives them good things. They are mostly on the right track though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985218","commentId":985218,"userName":"Distractionbeast","timestamp":1392398808,"content":"I'm not sure how everyone else plays, but generally, I try to engage every enemy as early as possible, because leaving them in the staging area just leads to tears later on.  No matter what spheres I play, unless I'm doing a final questing blitz, I can't afford to let enemies sit in the staging area (with rare exception).\n\n \n\nWhile tactics has a hard time questing, the inability to deal with enemies is usually worse for me.  IMHO"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985232","commentId":985232,"userName":"KennedyHawk2","timestamp":1392399541,"content":"I usually do this as well, unless I'm playing a deck designed on keeping enemies in the staging area (for extra attack, or if traps help keep them there and reduce their threat)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985263","commentId":985263,"userName":"Scroll Lock","timestamp":1392401189,"content":"There is not a single unique ally. Does this mean that that awesome art in the top right corner of the description page is just some objective? :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nEdited February 14, 2014 by Scroll Lock"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985286","commentId":985286,"userName":"KennedyHawk2","timestamp":1392402151,"content":"> There is not a single unique ally. Does this mean that that awesome art in the top right corner of the description page is just some objective? :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nSaruman is a unique ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985306","commentId":985306,"userName":"Distractionbeast","timestamp":1392402749,"content":"BTW, Silver Lamp sounds SUPER-OP.  As stated, I think it's an auto-include.  The only limiter is that usually spirit heroes are expected to quest, especially early in the game.  But that's not a problem a few turns in, and there are other ways to ready or prevent exhausting (especially in spirit sphere!).  Besides, you can save your spirit heroes for combat and still get full use of this card.  Just WOW.  \n\n \n\nWas spirit weak enough to warrant this card?  I didn't think so.  \n\n \n\nShadow cards represented the unpredictable nature of combat - the die rolls in other games.  This is what keeps the tension up and forces hard decisions before they get flipped.  Even without preventing effects, the lamp destroys all that tension and literally changes the nature of the game, shifting it towards a more deterministic model.  I'm very nervous about this.  Am I wrong to be?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985330","commentId":985330,"userName":"Style75","timestamp":1392403619,"content":"I don't think Silver Lamp is OP. First of all it costs 2 so you'll have to choose between this or an ally in the first round. It requires that the hero not do anything which is a serious penalty in the early rounds, especially if you're not putting out an ally. Also it only affects enemies engaged with you. In a multiplayer game, this does nothing to help the tactics player who is probably getting most of the enemies anyways. Basically I see Silver Lamp as a tool that helps control the late game. The early game will still be as dangerous as ever. It's a fantastic card, but not all OP.  Dain still wears the crown of OP cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985365","commentId":985365,"userName":"Scroll Lock","timestamp":1392406006,"content":"> There is not a single unique ally. Does this mean that that awesome art in the top right corner of the description page is just some objective?  :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nSaruman is a unique ally.\n\n \n\n \n\n \n\n \n\n \n\n \n\nThat is true. But I wanted to say one thing. \n\nhttp://www.fantasyflightgames.com/edge_npm_sec.asp?eidm=210&esem=1&epmi=s [http://www.fantasyflightgames.com/edge_npm_sec.asp?eidm=210&esem=1&epmi=s]\n\nWho is that awesome art elf in the top right corner? And how about that blue-eyed elf in hood who disappeared? Are they in VoI box? Are they only objectives? That would be quite disappointing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985378","commentId":985378,"userName":"Thanatopsis","timestamp":1392406769,"content":">  \n> \n> Was spirit weak enough to warrant this card?  I didn't think so.  \n\n \n\nSome say that Spirit really got the short end of the Against the Shadow cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985381","commentId":985381,"userName":"Style75","timestamp":1392406801,"content":"These cards look really good and it's obvious they were carefully designed to work well with the existing Rohan cards. It's nice to see the designers trying to make some of the older seldom played cards more useful (ex. \"A Light in the Dark\"). I do wish, however, that they included something for Theoden to make him more useful. I think this was a missed opportunity to make the King of Rohan a little more kingly. I think it's very telling that the latest second breakfast deck [http://www.fantasyflightgames.com/edge_news.asp?eidn=4651] doesn't even use Theoden and it's supposed to be the premier Rohan deck.\n\n \n\nNote that the Westfold Horse Breeder will fetch Asfaloth, a powerful effect in a Glorfindel deck making it a definite auto-include for that deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985416","commentId":985416,"userName":"Bullroarer Took","timestamp":1392409584,"content":"I mitigate shadow cards the old fashioned way - with Burning Brand.  But for Spirit I think it's a great card.\n\n \n\nAnd while I do think Spirit didn't get much during the AtS cycle, it had a huge head start and is still ahead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=985450","commentId":985450,"userName":"Distractionbeast","timestamp":1392411378,"content":">  \n> \n> >  \n> > \n> > Was spirit weak enough to warrant this card?  I didn't think so.  \n> \n>  \n> \n> Some say that Spirit really got the short end of the Against the Shadow cycle.\n> \n>  \n\n \n\nPerhaps, but I'm not convinced that this sort of drastic approach is warranted.  To reiterate my point, it fundamentally changes the mechanics of the game.  Burning Brand did this as well because it meant shadow cards were completely irrelevant on some enemies.  The uncertainty of shadow effects (and encounter deck staging) is what prevents players from planning out their victories many rounds in advance.  Burning Brand can actually \"break\" the game to this extent much of the time.  I'm afraid that Silver Lamp will similarly allow players to plan out their victory by eliminating the unknown which leads to anticlimactic games, in my experience.\n\n \n\nI love the effect and I get excited about strong, general use cards, but I'd think it would warrant additional conditions or limits. For example, I'd pay 4 resources for this effect.  Or maybe it must be discarded if the attached character exhausts?  I'm worried that to counter this, we'll see some steep encounter deck power creep, which will exacerbate the balance between the current card pool and earlier scenarios.\n\n \n\nAnyway, that's my $0.02."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=987150","commentId":987150,"userName":"monkeyrama","timestamp":1392638970,"content":"The lamp doesn't help much in any situation in which the enemy will get extra shadow cards - or, as someone noted above, sometimes it'll just let you know that you're going to get a pasting. It is pretty tasty though.\n\n \n\nThat said, maybe this cycle will also have more attachment hate. We haven't seen much of that since Heirs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=987155","commentId":987155,"userName":"MyNeighbourTrololo","timestamp":1392639770,"content":"Lamp is good for allowing undefended attacks. No sudden \"Shadow: +1 ATK, discard your entire friggin table from the roof if undefended\" effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=987156","commentId":987156,"userName":"monkeyrama","timestamp":1392640076,"content":"> Lamp is good for allowing undefended attacks. No sudden \"Shadow: +1 ATK, discard your entire friggin table from the roof if undefended\" effects.\n\n \n\nIndeed! Seems to me that Hobbit decks in particular will like the Lamp, since it could allow very low attack enemies to slip through for 1 HP undefended. Usually with Hobbits this is too risky."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=987172","commentId":987172,"userName":"booored","timestamp":1392642177,"content":"> Lamp is good for allowing undefended attacks. No sudden \"Shadow: +1 ATK, discard your entire friggin table from the roof if undefended\" effects.\n\n \n\nthis is exactly what I thought as well, basically a much better version of Dark Knowledge which is a card that is really underrated imo. Still Lamp is just better in every single way. I would suggest that Lamp is in fact a redesign of Dark Knowledge.\n\nEdited February 17, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=987180","commentId":987180,"userName":"monkeyrama","timestamp":1392643005,"content":"It's a fantastic card for characters like Eleanor, who in any case tend to be left uncommitted to the quest just in case, but otherwise serve a limited function unless a treachery comes up. What I want to know is whether the Lamp only attaches to Spirit heroes, or to any hero with the icon (so those with Songs of Travel/Narvi's Belt etc.)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=987196","commentId":987196,"userName":"jjeagle","timestamp":1392645231,"content":"> It's a fantastic card for characters like Eleanor, who in any case tend to be left uncommitted to the quest just in case, but otherwise serve a limited function unless a treachery comes up. What I want to know is whether the Lamp only attaches to Spirit heroes, or to any hero with the icon (so those with Songs of Travel/Narvi's Belt etc.).\n\nIt also looks particularly good on Glorfindel with Light of Valinor (as if he needed any more support) - typically you want to quest with him and then attack later, so Silver Lamp is perfect for him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/99221-spoilers-voice-of-isengard-player-cards/?do=findComment&comment=987616","commentId":987616,"userName":"chuckles","timestamp":1392667647,"content":">  \n> \n> > It's a fantastic card for characters like Eleanor, who in any case tend to be left uncommitted to the quest just in case, but otherwise serve a limited function unless a treachery comes up. What I want to know is whether the Lamp only attaches to Spirit heroes, or to any hero with the icon (so those with Songs of Travel/Narvi's Belt etc.).\n> \n> It also looks particularly good on Glorfindel with Light of Valinor (as if he needed any more support) - typically you want to quest with him and then attack later, so Silver Lamp is perfect for him.\n\n \n\nI agree... its hard to leave him out of decks when they keep creating new cards that work so well with him, such as Lay of Nimrodel & now Silver Lamp... I wonder how well he would go as the single hero in a solo deck... (probably be too reliant on getting the right combination of cards early on)\n\nEdited February 17, 2014 by chuckles"}]}